{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "We stopped in on our first night...  Monday's are underwear night :-) we didn't get down in our skivvies, and we still had a blast . Bartenders were on point ! Not many bars are this caliber anymore .. We will be back", "author": "Jacob H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-08", "description": "First let me start by saying I actually like this place. But tonight, the bouncer messed it up. I had a few drinks. I preface this because I figure most people reading it will understand. I told my friends I would be back and walked down the street and bought a couple of pizza slices. Why? Cause we've been drinking and it's the thing to do. \n\nSo I tried to walk in and he stopped me and said couldn't. I asked why? As anyone would. And he said...\"because I said so\".. oh hell no! You do not say that to anyone. He continued to say \"I said so\", so I told him he's behaving like Fox News peeps and Trump and all he needed to say was \"no outside food in the bar\" and I would have accepted that. Also, put a god damn sign outside if that's the case. \n\nI ate a slice and gave the rest to the homeless people outside and then tried to walk in..empty handed. I was told I couldn't go in. I said my friends are in there and don't have signal and just want to tell them I'm out here. Denied again. So I stood outside of the door and waited for closing for my friends to come out.\n\nI liked 440 but will never, ever  go back there (as if I could get in based on this guy) and will tell everyone I know not to go there while this guy works there.", "author": "Valentin R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-02", "description": "This review is for the bartender at the back.\n\nWhen a bartender complains to a customer about getting a small tip, you know he's been working too long and he just doesn't care.\n\nIt was a busy night and there was a line to get drinks, which I didn't mind. A couple of people were in front of them and the bartender scolded at each one of them. I didn't know what the situation was and I didn't care. When it was my turn, I ordered 2 drinks, which came up to $12.50. I happened to only have $13 in my wallet so that's what I gave him. When he gave me 50 cents for change, I left them on the counter as tips. He then motioned me and said, \"Take it, don't give it to me. Do you think 50 cents is a decent tip for 2 drinks?\" In which I responded, \"with that kind of attitude, it's not even worth 1 penny\".\n\nThe sad part is that I generally do give a buck or two for tips every time I order a drink. Am I a lavish tipper? No. But am I really obligated to give you a tip for handing me a beer? It's arrogant bartenders like these who EXPECT lavish gratuity are the reasons people stop frequenting these establishments. And there are other options in the Castro.", "author": "Derek W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Reviewer #173\n\nI liked this place. I didn't stay too long because my boyfriend didn't like how much I was getting hit on... after all it's more of a BEAR bar than a gay bar and when you got it... you got it.. (jk... or am I?) :)~\nThe music was hot and there was lots of cool conversation. The  drinks were nice and strong and the place was packed. Certainly looks like the place to be on the Castro! I look forward to going back to this bar the next time I am in town. \nGo over to Orphan Andy's after a night of drinking and get your grub on!", "author": "Greg D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "This is a \"bear bar\" but all are welcome.  We popped in for some drinks before taking in a show at the Castro Theater across the street. \n\nATMOSPHERE:\nIt's a narrow, dark-walled, dimly lit bar with a few seats at the front, some in the middle and the majority towards the back.  \n\nBEVERAGE:\nThey have a full bar menu with good beer prices.  My Bud bottle was about $3 or $4. \n\nSERVICE:\nThe bartender was friendly and funny even, presenting my beer bottle to me like it was a bottle of wine. \n\nI remember years ago when this place was called Daddy's, this dick of a bartender gave me attitude because I didn't give him my two drink order at once.  Calm down honey, you're gonna give yourself a heart attack!\n\nOVERALL:\nCool place, good prices, now with better service.", "author": "Vince N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "We followed a group of friends here to finish the night off. While there, a man followed me into the restroom and sexually assaulted me while I was urinating. He grabbed my penis and said it was perfect for him. He then quickly tried to kneel down and perform oral sex on me, but I was already buttoning up my pants and trying to get out of the way. He then blocked the doorway and tried to kiss me. I pushed past him and told my boyfriend what had just happened. We both agreed that it went beyond the \"look but don't touch\" behavior that the bar's decor (read: trough-style urinal and angled mirror so you can look at everyone's penis) seems to encourage, and decided to report the incident. \n\nDuring the time I was discussing the incident with my boyfriend, the man followed several other guys into the restroom. He was sitting on the bench across from the entrance, as as soon as they would go in, he would get up and run into the bathroom after them. \n\nFirst I reported the incident to the bartender, who directed me to the bouncer at the front door. I informed the bouncer what had happened, and he said he would watch the guy. I was confused by this, since I had just informed him that I had been assaulted, but they want to make sure he's really doing what I said he is? Have you seen the news lately!? \n\nAnyways, it happened again, and the bouncer seemed to have noticed, because the man was asked to leave. I don't know if I should have escalated the incident further, but I would urge the management to do a couple of things: \n\n1. Take people who report assault seriously by immediately confronting and removing the person from the situation. \n\n2. Rethink the angled mirror. I wouldn't have used this restroom but since I was the only one in there (until my assaulter walked in), I felt like it would be OK for a quick bio break. \n\nI definitely don't feel comfortable coming back here.", "author": "Dustin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Bartender Kevin lets his friends who sit at his bar with their cheap tips take priority over friends of the bar.  After just two ciders over two and a half hours, I was about to leave and decided to have one more.  I waved, yelled- no matter what, he wouldn't respond.  He instead served every new person who came in.  I finally got his attention and knowing how sensitive these bartenders are, I calmly asked why he was purposely ignoring me.  He got mad and said verbatim \"go away, asshole.\"  I asked him to repeat what he said because I know the owner Gordy, and his response was \"now you're a bigger asshole I am having you removed.\"  Bye bye 440.", "author": "Richard W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "This is just a bit of a cautionary review than anything else. Prior to April 28, Id not been in this bar since 2004.  It was quaint and friendly as I remembered it with helpful bartenders.  So on Monday April 30, I went to the bar to attend their underwear event. I figured it might be a good way to liven up my last night in town.\n\n  Now please bare in mind Ive been to such events at various bars around the country and outside the country. I dont expect too much other than seeing other laid back fellas in their skivvies.  Well I thought it was a really good deal when I learned that if you stripped to your underwear youd be given a token for a free drink.  Well imagine my surprise when I was CHARGED to check my clothes.  So essentially the drink WASN'T FREE at all. It was $3.  Admittedly in San Francisco a $3 is indeed a steal, but the minor subterfuge whether intentional or not was a mildly disenchanting. Still enjoyed myself and my \"free\" drink but wish the parameters had been more clearly defined. Not only that, you couldnt use the token for call booze. Only well drinks were allowed.  \n\nIm sure Ill visit the bar again, but this time it will be with eyes wide open.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-05", "description": "My friend who has autism went there to get a drink unfortunately they told him he was an able to come in because of his autism. They are very bad people and should never have a business license", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "Normally always one of my stops in the Castro. Really awesome drink specials on Sundays. Although in general, the drinks are cheap enough (especially compared to every other neighborhood in the city). Normally always packed- been here on a Sunday, Monday and Thursday before- can't imagine what this place looks like on a Friday or Saturday.\n\nStaff is friendly, doesn't take too long to get a drink. Best be warned, the drinks, like all drinks in the Castro, are cheap and strong. If you order a well drink, it's going to be 90% liquor with a splash of whatever else you ordered in it.\n\nI would say the crowd is definitely on the older side.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "Great place except for 3 important items:\n\n1) They put the fans on full-blast when they are NOT needed.  People walk under them and in different places to avoid them.\n\n2) They play their music way too loud at cocktail hour when people want to talk to one another.  That would be OK for 9 pm and after, but not earlier.\n\n3) Their wi-fi is non-existent if you're in the back part of the bar.", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "This is totally the dark and dank bar of my dreams. It's so chill and welcoming. Great location. Good drinks and lots of gay personality.  This is the spot to hang out when in the Castro. It's seriously close to everything. I'm all about it.\n\nThe patrons of this joint are so cool. This is where people go to drink and enjoy themselves. There are no hangups about this bar. Just have a good time and everything will be right. This is a good place to make new friends. The patrons of 440 Castro are a hoot!\n\nI really appreciate the helpful and nice bartenders. They're pretty dang funny too. It's all about having a good time and being, well, gay. There is personality a-plenty at this spot. The drinks are reasonably priced and they pack a punch. There's a decent selection of beer and cider. \n\nIt's real easy to stop in and have a quick one or just hang out the whole day watching the people of the city walk by. There's great action out the front window. The elevated dance area in the back is totally cool - lots of flavor. It's a win for me!", "author": "Richard R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Super fun bar if you are up for an adventure in the Castro district. The music was outstanding and the ambiance was fun. I really loved the red industrial pendant lights and our waiter Andrew came up with a refreshing shot made with Effen Cucumber. Truly refreshing and such a great spot for a drink.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Friendly crowd, great Bartenders, and convenient location in the Castro.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "This is one of the lively venues in Castro with nice crowd and friendly staff. A favorite of mine.", "author": "Marc K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-17", "description": "440 is a place to go if you want to get ripped off. It is overrun by pickpockets and thieves, and management doesn't give a shit. Shane the manager should be fired and 86'd from all Castro businesses. Stay away!", "author": "Richard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Small and crowded drinks are reasonably priced mid to older crowd and friendly bartenders.", "author": "Jacob D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Friendly staff and good deals. If you're in the Castro area, this is fun bar to be. It is cash only so be sure to have bills on you. There is an ATM inside as well but note the service fee.", "author": "Nicole Anne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "Worst bar in Castro. My friend was drugged and his watch was stolen right from his wrist. Beware of this place.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "This review is just for the security. I was drinking there left to eat and they had some shorty fat ass security when I came back. Lame that he wouldn't let me i when I got in at q but there loss guess they only like old men ‍", "author": "Nick A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-04", "description": "Underwear night used to be fun, but now women have started coming to gawk, and it's not fun anymore.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-18", "description": "I moved to SF 11 years ago, and live around the corner from 440 (Daddys) I used to go there 3-4 times per week and I would stay for a few hours (dropping $35-$50 each visit), and I always enjoyed it. \n\nLately, (past year) when I've gone there, I ordered a drink and before I finished it, I can't wait to leave the place. Why?  The F@#%ING NOISE LEVEL OF THE MUSIC IS SO IRRITATING THAT I WANT TO LEAVE IMMEDIATELY!  I've got really great hearing (and I want to keep it that way) But whoever manages the bar (Gordy) please get this... I don't come here to LISTEN TO LOUD MUSIC, I can do that at HOME! I go there to meet men, socialize and have conversations, which is now next to impossible. \n\nI can be speaking (shouting) into someone's ear, (my lips 5-6 inches away), and they STILL CAN'T HEAR me, WTF?!?... AND trying to listen to other people,  I get really tired of saying, WHAT? I don't know why the BARTENDERS don't do something about it. I can only speak for myself (and some of my friends), who don't go there anymore, because of the noise level of the music. So, we go to the patio at the MIX, or to the EDGE or even to MOBY DICKS so I can experience what gay bars are supposed to provide, a local place to socialize and make connections with other people. I really don't care what AMAZING DJ is playing his tunes. The music in BARS are supposed to be background music, unless it is specifically a music venue.  I will stop in from time to time, but now I don't order a drink, unless I can have a conversation, if its too loud, I walk out and take my business elsewhere to a bar who understands the real purpose of being a bar in the Castro.", "author": "Michaiel B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-05", "description": "It's quite something when, in a supposedly open and tolerant neighborhood, two yuppie 30-somethings - who otherwise kept to themselves and managed to stay courteous despite pushy crowds - should walk in and get super-mean stares and derogatory comments from the patrons here.\n\nWhat was so offensive? Was it the fact that we were far younger than the median age of the crowd? That we were not their \"type?\" Or was it the fact that we simply weren't white? It's incredibly sad and ironic that some members of a community, at least some of which have likely fought for a lifetime for civil rights, should treat other humans with a lack of basic respect and dignity. \n\nA shame, because some of the bartenders here are actually quite awesome. Hence, 2 stars' worth of pity instead of 1.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "This place was packed on a Sunday, bears everywhere!! Now I usually hate gay bars because I feel like I don't fit in with the loud and flamboyant crowds but this place was different, most patrons were older and I noticed most guys were hanging out in groups chatting and drinking, music was really good and beer was surprisingly cheap, glad I walked in it was fun.", "author": "Tony D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "OK bar with a friendly crowd and bored bar staff.  I have to say being Irish living in SF, I find the 'Sunday Furry Sunday' reference really offensive.  'Sunday Bloody Sunday' is a song about Bloody Sunday occurred in Derry in 1972.\n\nBloody Sunday - sometimes called the Bogside Massacre[1] - was an incident on 30 January 1972 in the Bogside area of Derry, Northern Ireland. British soldiers shot 26 unarmed civilians during a protest march against internment. Fourteen people died: thirteen were killed outright, while the death of another man four months later was attributed to his injuries. Many of the victims were shot while fleeing from the soldiers and some were shot while trying to help the wounded. Other protesters were injured by rubber bullets or batons, and two were run down by army vehicles.[2][3] The march had been organised by the Northern Ireland Civil Rights Association and the Northern Resistance Movement.[4] The soldiers involved were members of the 1st Battalion, Parachute Regiment, also known as \"1 Para\".[5]\n\nLearn your history bears, and maybe after the sad events at a protest march in Dallas this week, you may step up and find a more sensitive name for your Sunday romp!!!!!", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "The bartenders here seem to be in a hurry to serve you. Seriously, how awesome is that? In the Castro, there are several bars where the bartenders seem extremely inconvenienced by the presence of a customer, but 440 is not one of them. My favorite bartenders are Andrew and Jonathan, who I've come too know because they tend to work the back bar when I'm there on weekend late afternoons. Overall: the drinks are strong, there's a decent amount of seating (benches) around the bar, there's a lively crowd every night of the week. My favorite bar on Castro.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "I stopped by on a wkday afternoon and the vibe was still cool. Seemed like there were more tourists than locals but that was probably bc of the timing. Good strong drinks and drink specials", "author": "Kyle A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-25", "description": "My first review was taken down by Yelp! Again Go figure. Read my review about Yelp and you will understand why.  One Star here and that's only because I can't give a Zero. I was kicked out for making my political views known. Donald Trump would not approve of this Very Fake Anti-American Values Venue.", "author": "Mark J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "I don't think I've ever been in a bar where the bartenders AND the gorgeous and sweet lumber-sexual go-go man (he was no boy!) both asked AND remembered my name throughout the evening.\n\nDrinks were ridiculously strong and inexpensive.\n\nI had a good time here, and was very disappointed when I learned all Castro bars including 440 close at 2 am and I got kicked to the curb :(\n\nCrowd was friendly and I didn't feel invisible the way I do in some bars now that I'm nearing 50.  I had a few good albeit drunken conversations with other patrons.\n\nI can't quite go 5 stars because same customer informed me it was an unusually quiet night because a day earlier management had '86'd some of the most popular staff and many regular customers were boycotting as a result.  \n\nAlso, its pretty much of a black box dive.  \n\nIt was a fun night, and I'd definitely go back. I'd just go a lot earlier.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Not a very friendly bar. One night the bathroom door hit me in the face because someone opened very quickly and when a person went to get help, ( I assumed he was getting some ice for me) he told the bouncer I was over intoxicated. I was asked to leave even after I politely told him that I wasn't over the handle and that a door had just hit my face. I found it rude all together.", "author": "Ramon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-07", "description": "Unfortunately since it went from \"Daddy's\" to \"440\" another change has been with the front of the bar staff. Never have I seen such a disorganized unprofessional bunch.\n\nThe barback last week dropped a crack pipe out of his pocket and started yelling at anyone he could all the way to the door. \n\nI've uploaded his picture.\n\nThe bartending staff are a delight however but can't even work with them with the rude front of the line help.  \n\nEdge is the new Daddy's bar. Midnite Sun has also attracted a lot of the legacy crowd.", "author": "James V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "Umm... so I was literally the ONLY chick in the entire packed gay bar, which was awesome because I was practically invisible. This was my first gay bar (bar, not club) experience and it was so fun. Such a wonderful and happy vibe, and who doesn't want to be distracted by all the underwear models on the TV screens everywhere?\n\nMy guy friend ordered drinks at the bar, and we hung out towards the back of the whole place. There are two bars... one in the front and one in the back. I would suggest just scooting to the back of the bar since that bartender tends to be less busy most of the night anyways. So many fabulous queens in here -- LOVE it.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "My first stop of the night. I order my drink, receive my drink, turn around and the bartender yells \"THANKS FOR THE TIP!\" Like man relax! Don't be rude! There's a lot of people in this bar and your yelling \"Thanks for the tip!\" Are you serious? It's my choice to tip you or not!", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "Nice daddy bar! Most guys are older and some are hotter. If you want a daddy look no further. BUT remember this is CASH ONLY like a lot of the bars in the area.", "author": "Victor R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Been here just a few times but the bartenders have been really nice each time and the crowd is upbeat and fun!", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Favorite local neighborhood gay bar. Very friendly staff, and great drinks. Keep an eye out for drink specials everyday. Love thier bloody Mary's. Large glass and plenty of veg and spice. Sunday is a great day usually a beer bust for a charity.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "I went in here with some friends - my gf wanted to go to a cool gay bar and this is the place. I've been here before and I prefer it not so crowded. These bartenders are excellent - they have really affordable drinks and can make anything!! I mean they can make a craft cocktail or a great martini and everything in between. They are personable and cool no matter who you are or what you look like. There was a drag queen to my left and they were as cool to her as they were to me and my friends. Awesome place - and the customers all seemed to be having a good time. It felt like camaraderie. \n\n***NO Cards - Bartender said most bars on Castro don't take Cards*** good to know.", "author": "Rew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "This is my favorite place to have a drink in sf! Is always busy from noon to night. Drafts and cocktails at good price. Is a nice place to stay when the night starts. Friendly people and friendly staff. More than recommended!!", "author": "Ser M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-03", "description": "Unless you are a guy, everyone is standoffish and rude! Never again! Sat down for a beer and feel un-welcomed!", "author": "Katrina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "I mean, it is what it is. It used to be called Daddy's. I'm not sure why they changed the name, since a more accurate name has never existed for a place. It's a total Daddy bar. Arguably, it's THE Daddy bar. I'm turning 40 quite soon... and when I pop in I'm usually in the youngest quartile of bar patrons. I'm pretty sure that once or twice I've been the youngest fellow in the place.\n\nThe drinks are cheap and strong. The crowd is friendly enough. The men's room definitely has a peek-a-boo urinal trough, so if you're not okay with getting a compliment while you're peeing, you may want to use the facilities elsewhere.\n\nNot really my scene... it's a bit crowded and stuffy and not all of the patrons are obsessive about their personal hygiene. But if that's what you're after, then this is your place. I generally just end up here when I'm someone's +1...", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Inexpensive and strong drinks.   Cheap Beers ($2 any beer all day tuesday!).  Friendly bartenders (Bill is great!  always a smile on his face). \n\nThis bar is fairly mixed during the day through happy hour.  After 9 it gets bearish (which is a good thing).  The back bar is usually best if you like a little breathing room.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Awesome, friendly staff!  Bartenders make some of the best cocktails in town.  Go here and have a good time.", "author": "Fred S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-13", "description": "The scene was pretty busy for a Wednesday but appears to be more crowd for mid 30s and older. The music was decent and they had live entertainment but not a hot spot for those in their 20s... at least for a Wednesday.", "author": "Anthony J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "I had a great time here.  I've only been twice, but will definitely go back!  The drinks were strong and inexpensive- plus, once you buy a drink, you get a drink token to use for a free well drink (it's a win-win)!  The bartenders were super cool and I enjoyed the vibe.", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-28", "description": "This place has 2 dollar beers at 10:30PM on a Saturday night, which was enough to make me go. The drinks are MAD STRONG. We're talking, would you like some coke with your rum sir? Not rum with your coke. \n\nIt's a levi/leather Gay bar, which to what me and my friends took as a divey gay bar that encouraged gay men with beards. \n\nI wasn't exactly aware it was a gay bar when we initially went in (I know, how could I miss that), but shortly after a man with blue hair and more make-up on than me entered, I quickly realized this was a gay bar. \n\nIt was pretty fun, but not exactly my scene. The decor leaves a lot to be desired, the place could use a good mopping and spray of bleach.", "author": "Molly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "Drinks are strong and I am always treated well.  The bathroom is a little weird with the mirrors but sometimes slutty can be fun.", "author": "Shaun C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Fun bar in the Castro with theme nights and sometimes strippers  This is my favorite bar in the Castro.  Friendly crowd with lots of eye candy!  oh lots of days they have second drink free.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-28", "description": "Bartender asked me tips. Why I should give him money if he serving me just a bottle of beer and i give another bartender before him?? He's was so rude: he said: DONT WORRY ABOUT THE TIPS. He's not making me cocktail or something like that. Aghh.    ,", "author": "Damir R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "I keep getting here to late to eat anything.\n\n Drinks are strong and atmosphere is friendly if you don't mind queens that love themselves more than anyone else. \n\nI always have stories to tell when I leave this place.", "author": "Niah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "To know 440 is to love 440 and I know and LOVE it.\n\nThis is yet another iconic Castro gay bar.  They know what they are doing too.\n\nThe bartenders are professional and like getting people drunk, which is easy in The Castro in general as most bars pour very strong drinks.  440 does a 2 for 1 special and if you are a raging alcoholic this could be your utopia.\n\nWhat I LOVE about this bar is their attempt to keep it more old school.  Meaning, they hate cologne and love the smell of urine in the air.  But truth be told the vodka aroma masks the urine unless you are upstairs near the bathroom.\n\nThey have 2 bathrooms. I am not going to spill any tea, but both bathrooms serve dual purposes.  Like most good gay bars, the one bathroom is open trough style urinal, smelly, so dark you cannot see your hand in front of your face and CRUISY.\n\nThe 2nd bathroom is private and only one person at a time ;)\n\nKnow this; men go here. So do boys, but mostly men. This is not the dance club, which caters mostly to tourists, down the block.  This is gay men, doing what gay men have done for many years before the twink generation came to light and this is why I love 440.\n\nI can grab my drink, sit back and have men hit on me, cruise me and tell me I am still handsome, hahaha, I don't hear that much anymore and this place makes me feed my ego. Hahaha. Kidding. Or am I ??????????????\n\nCASH ONLY, ATM next door at Citibank.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Visiting family in SF....did lunch in the Castro, stumbled upon this GREAT bar, \"440 Castro\" and the owner, a Canadian, named Gordy, bought us drinks and was more than welcoming!  Great location, strong drinks, nice people.  Love SF.  Thank you!", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Oh, 440, how do I love thee? \nLet me count the ways...\n1. Stiff drinks at reasonable prices\n2. The Addams Family Pinball machine\n3. Adorable bartenders\n4. Pleasant doorpersons\n5. Your welcoming bosom\n6. The biker cut out guy\n7. The adorable clientele\n8. The chalkboard above the troff\n9. The upstairs bar\n10. The way you make me feel...........", "author": "Michael T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-21", "description": "Remember when Dorothy skiped down the yellow brick road and there was a lion, a tin-man, a scare-scow, and todo the friendly dog?  Well this bar is nothing like that.  There are bears everywhere!  Which can be kind of amazing depending on the crowd of men you like.  This place has cheap pints and decent music for being a non-dance club.  The bartenders are always half-naked... as well as the patrons and the bar in the back is a little less crowded so head that direction.  \n\nIt gets a little warm in there so be sure to breathe deep before entering.  have fun!", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-25", "description": "Not a very friendly place. A regular patron wanted my seat, so he kept sliding down the bench. Eventually I stood up halfway, and he tried to push me off entirely. I told him I was using the seat, and he said, \"If you weren't so fat we could both fit.\" I spoke with the manager, and even though that kind of hate crime is illegal in SF, he actually laughed. Kind of shocked me, since one of their draws is that it's supposed to be a bear bar or bear-friendly. Sad in the 21st century to witness this behavior, by both the manager and the patrong.", "author": "Cub C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Hmmm...  As the only certified female in the bar, I'm not the one to really make a qualified review of this place.  However, the drinks were strong, the place was clean, and there was at least enough space to maneuver around.  They guys were all nice, even though I'm obviously the outsider, and I had a lot of fun.  I definitely will return.  It was a good night out, and it was a fun place to be with friends.", "author": "Jes G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Had a great time wasting an hour or so here while my hubby got his hair done.  Great service,  and a memorable experience for a number of reasons.  Will definitely be back.", "author": "Dan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Awesome place. A little crowded but awesome. The atmosphere is pretty chill. The bartenders are nice and overall the drinks aren't too expensive. I think the bathroom can use a bit meow cleaning but it's a bar so who cares. Lol", "author": "Jim V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "Ok, great neighborhood bar, that is if you count Castro as your neighborhood. The staff is engaging and you feel at home the minute you walk in. The staff gets to know you immediately by name. I've only been there a dozen times since November and I've got to say there is no better place for happy hour or a good time people watching. Monday is underwear night and it can be quite mesmerizing. David, Tony, Randy, Shando and Junior are great behind the bar. They serve good cocktails and ensure you are having a great time no matter how busy they are. The crowd here is mature. NOT OLD. The younger crowd that hangs out here are not afraid to engage in conversation.  \nFor a great evening I highly suggest 440. The staff and customers are just what you want on an evening out.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "Always fun at the 440 ... \n\njust a con ... it gets easily noisy .. so if you want a nice quiet talk with friends .. might not be the right place .. otherwise .. super friendly staff .. and lots of happy hours !", "author": "Nicolas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "All of the bartenders  are really attentive and nice and the folks in their are pretty cool and real. Drinks are potent and cheap! Me like!", "author": "Chas A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "They have some great deals on drinks! They even give out tokens to come back for a free beer or well drink. They have two bars inside and it's in the heart of the Castro. The bartenders are always very welcoming. They don't ignore you until they're ready to deal with you like most bars. They acknowledge you and let you know they'll be with you soon. Whereas I feel that because I'm a female, other male bartenders in the Castro tend to help others before me haha.", "author": "Eliza B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "Mad props to the first gay bar in the Castro that welcomed a lone cisgendered female noob to the area (I tried another place first but was totally dismissed, ugh)! Randy is a fantastic bartender, and it's so nice to sit and enjoy great music- everything from Madonna (Like A Virgin years) to Dev to Motown to whatever, in a neighbourhood environment with a fantastic happy hour, where I know most folks don't care that I'm the only female here. For an introvert like myself who just wants to chill after work (or maybe to have a quick shot before work, shhh), this place is the best- friendly staff, great music; cheap, stiff drinks! Cheers!\nOh, and $3 margaritas during happy hour!", "author": "Bonnie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-28", "description": "The one star is just for the guy outside that checks ID's. I came to 440 with a friend for the first time on 11/27/2015. We came in and ordered drinks and the bartender had given me these tokens that were good for other well drinks or something like that. We left to another bar down the street to just dance and move around and we were going to return to 440 to drink some more. So I get to the door at 440 and the security, GREGORY, I think his name was, asked for ID's from my friend & I. Of course we give it to him and everything checks out. I asked him a quick question about the tokens that Ive gotten earlier from the bartender here. I asked; \"How does these (tokens) work again?\" and his response was; \"Do you speak/read ENGLISH?\" OMG.............I was so flabbergasted at what I just heard. He really made me feel uncomfortable to the point that I almost cried =( Yes I'm a dude of \"color\" so of course that hurt my soul. I went into the bar regardless of his comment and I mentioned it to the bartender Andy & he was quick to defend me and my friend =) He was awesome, but I wont come back here only because I don't want to see Gregory again. He really is a douche", "author": "Sunia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-04", "description": "On NYE and the day after I was asked to leave because I \"looked tired.\" I am sorry I was looking down at my phone like 1/2 the people there. Why not kick out the guy upstairs who was obviously drunk falling all over people. The second time was when I was struggling to get my token for a free drink out of pocket without dropping my keys and phone to the floor. Apparently when one tires not to damage their phone, one looks like they're weaving and get's asked to leave! WTF!! Never again.", "author": "Jessie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-04", "description": "This is THE bar in the Castro. Gay owned and gay proud. The owner is usually to be found greeting customers and welcoming back the regulars. All of the staff are friendly and welcoming. More of a\nBar for the Bears and Daddies, everyone is welcomed and treated as\nLoyal regulars. You get what you pay for!\nThe go to bar for\nCharity events!\nHere's a good tip: on the weekends use the coat check open 8-close.  $2 can assure you that you coat or whatever you check will be safe and secure. \nGo on Monday night 9-close and enjoy Underwear night. Check ur\nClothes and go in your undies and get a drink on the bar!", "author": "Dustin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "After a showing of my 1962 comeback hit, \"What Ever Happened to Baby Jane\" was shown at the Castro Theater, I stumbled across the street in need of a strong cocktail after seeing Bette Davis' mug on screen for close to two hours. It was a Monday night and I made my way into what looked like a quaint little bar called 440. I was hoping that was the Proof of the vodka they were selling. \n\nTo my surprise I saw many men wearing underwear and jockstraps and I quickly put on my white gloves! As I made my way past the nearly naked men, I used my white gloves to make sure that the boys were up to my cleanliness standards.\n\nMany of the men we clean as a whistle but some left stains on my gloves. I wasn't mad at them, I was made at the \"DIRT.'\n\nAfter my inspection -- I realized that I was wearing a bejeweled jockstrap - hell, from what I could see - my package was much bigger than half of these \"men\".\n\nSeveral vodka's in and many laughs - I left the bar with some amazing memories! Thanks to the bartender Brad for paying attention to ole Joan's hot little ass!\n\nBless you\nJoan Crawford", "author": "Joan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "The next time the bar sells me a drink and sends security after me after after 30 seconds to kick us out, I'll be contacting my retained attorney and the police. Piece of shit bouncer with no sense of business dynamics.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "The bartender always is nice here plus they have good beer on tap. The place can get crowded but it is a gay bar.  Usually relaxed and friendly", "author": "Tom A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-20", "description": "So when I lived in SF and when I've visited, I usually end up here.  It's a nice bar, but it's nothing special, but at the same time comfortable.  Drinks are reasonably priced and it's a fun crowd.  I'd say the best time to come here is late at night.  It gets packed and that's when people get chatty and friendly.\n\nIf you're making a stop in the Castro, I'd totally recommend stopping by, but stop by after 11.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "26 July 2013, 9p\n\nI've only been here once when this place wasn't totally packed and I can honestly say, that's when I enjoyed it the most.  Not being a bay area native, I surmised that this bar does not EVER have a line to get in because they let everyone in at all times.\n\nI'm not one who necessarily enjoys being trapped in a space not being able to move about, let alone try to get a drink.  It can be fun for the first few minutes, but when you can't even get out when you want to leave because of the number of people coming it, it's a little ridiculous.\n\nIt's not a bad place, but I'd rather enjoy it when it's not packed to overflowing.", "author": "SoCal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-23", "description": "This place smells like...man. And booze too. \n\nBut the drinks are strong and cheap. $2 pints are bitchin. Usually the sea of bears will only entertain me enough for one drink.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "Love. This. Place.\nThis bar truly represents what the Castro should be.\n\nThis is an EVERYMAN bar. Young. Old. Skinny. Buff. And everything in-between.\nIt's perfect for the location - any bar on Castro that tries to limit the crowd to a specific type of gay (twink, bear or leatherman) is not going to make their business succeed; and 440 succeeds because it's a welcoming place. \n\nThe other day, the crowd wanted to watch the Giants game and so they changed it from some video loop to the actual game. That wouldn't happen at Badlands or Toad Hall.\n\nI always feel comfortable at 440. The drinks are strong. The service is super friendly (Brad and Ben are so cute!). \n\n2-for-1 specials on Friday happy hour. Amazing! I have friends that go to Midnight Sun for the 2-for-1 and stand around with 2 drinks in their hands for 30 minutes. 440's got the drink chips- so much more convenient.\n\nIt's the perfect place to start, spend and finish a night out in the Castro.", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-06", "description": "My partner and I can't ever seem to get served here, even on a dead weekday afternoon; the bartender is always too busy chatting with the very few regulars that frequent.  What a luxury it must be to blow off customers with money to spend.", "author": "Mitch H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "I go here pretty regularly with my partner and we enjoy the ambience and atmosphere. Shane in particular has proven great service time after time. 440 has good prices for happy hour and it is easy to fit into the crowd. I would recommend coming here for bears and drinks. Either or both, you won't be disappointed :)", "author": "Zack E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-19", "description": "This place smells like beer & musty ass crack.", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-18", "description": "If you want an overpriced bad drink then 440 is your place!! \n\nThis bar has a very sex negative environment. What is the point of going to a gay bar if you are negative about sex and sexuality?\n\n Do not let the owner's pictures deceive you. And seriously, the half porn that they show on the screens is terrible. \n\nThus, if you want to a go to a gay bar and not just A bar please consider another place.\n\nYes there are a few good looking people around and drink specials... so do other bars.", "author": "Gorry X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "Worst place in the whole Castro area. The bouncer at the door was racist and made the experience awful even before we walked in. He made remarks that's were unprofessional and not necessary . My friends and I walked in and turned around and went to spend our money in another bar that appreciated us . A bar that depends on their customers money to survive the owner should be worried about the money his losing with his door man.", "author": "Jon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Great drinks, friendly staff, customers who grope.... what more could you want?  This place is perfect for those who like men with hair on their chest.", "author": "Lyric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-12", "description": "Like $2 pints of Miller Lite?\nLike a dark room, even when the sun is blazing hot during the day?\nLike a huge fish bowl filled with free condoms (conveniently located right next to the dark men's bathroom)?\n\nIf you said yes to any of the above, you might dig 440 Castro.\n\nUpon trekking through the Castro last weekend, my friends and I were driven like mosquitoes to a shiny, neon bulb when we saw the \"$2 Miller Lite pints\" sign written in chalk outside the front door. It was just about *that* time in the day where a frosty beer could have really hit the spot, so we acted on our alcoholic impulses. It was pretty apparent the bartender knew we weren't locals (it was myself, my girl, my buddy and his wife), because the first thing he said once we walked through the door was, \"Aaaahh, you must be here for the cheap Miller Lites!\" Indeed, we were. \n\nService was cool, the patrons were all a little on the older side, and they were promoting all sorts of wacky gay-themed nights. Looks like they do a pretty regular 'bulge contest' where you rock your underoos and show off your junk. And they have a pretty popular 'bear night' that attracts sexually-charged hairy men from all over the city.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "Love this place! They were so welcoming especially in my giants get up. I was with a friend who is a regular and he introduced me to his friends. I had a riot of a time watching my boys the Giants around great company of other fans! They didn't care that I was a straight girl. When this drunk from the TL who came up here just for cheap drinks try to hit on me. One of the sweetest men went she's with us! I love my bears of castro and thank you for making my game 1 of the 2014 NLCS even better with a win and kindness!", "author": "Nadia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "We stopped in for a drink because it was busy and the music pulled us in off the street. We were not disappointed. 2 for 1 drink night, and they were strong!  Bartender/Randy (hehe) was friendly and helpful, gave us tips on things to see in the city. Place got busier with every minute, standing room only. We stayed for two drinks, the atmosphere was so great, and would have stayed longer but we did have to drive back over the Golden gate on a cycle, and another of those drinks and we'd have to take a cab. Love this place!", "author": "Rain Greg J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-21", "description": "A Good time can be had.  Good Drinks, Good People. \n\nOpportunity for sex, what more does one want", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "I Just Moved back to town after being away for 6years down in So Cal & the place has changed from Daddies! I was shocked when told about this but took some friend that were visiting here anyways.   Man oh Man! Was I surprised how much Fun I had the Place only changed names but the Bar Tenders are AWESOME!!! Friendly! Friendly! I didn't go there much when I used to live here but DEFINITELY is on the TOP of my Favorite Places in the Castro.  Glad to see some things haven't changed to much.", "author": "Martha O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "Came in for some shots and it wasn't too crowded. The bartender didn't smile much, but was quick with our drinks. Thank you!", "author": "Anji W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "Actually better than I expected. The crowd was very diverse. A few friends, friends of friends, my partner and I stopped in for a drink or two Saturday night around 9. The bartender in the back bar was really friendly and my drink was good and not expensive at all by San Francisco standards. There were all kinds of men there and it seemed more men centered, my one girlfriend who came out with us was the only girl for a bit, a few showed up later. Music, meh. I would go back, definitely.", "author": "Bertamus R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-23", "description": "A decent divey spot for a relaxed evening.\n\nIt's very dark and can get really crowded.  Most people are pretty easy-going.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-18", "description": "I was warned beforehand.\n\nNo kidding.\n\nDaddies' bar.  Bears.  All sizes, mostly big; all ages.  \n\nAsian twinks following bears.  \n\nMusic is good.  People are friendly but I'm outta place (DUH!)\n\nDrinks are nice, not watery and strong.  XD\n\nCrowd leaves a li'l something to be wanted, especially if you're not-so-into-that-scene...I'm a straight chick who will dance with the gay guys and makeout with girls...but I'm not diggin' the bear thing.  So...whatever......\n\nI'll go here with friends, but never, ever alone!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Had a GREAT Sunday Fun Day doing the Castro Crawl! Great drinks, fun people, good music and Videos. A MUST while drinking in the Castro!", "author": "E S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-21", "description": "This place is a BLAST!!! Checked out 440 for Tuesday $2 Draft Beer night, and got SLIZZARD. \nChecked out 440 for 2-4-1 cocktail night, on Wednesday, and got SLOSHED. \nTotal fun! Great vibe, very high energy. Friendly, hot staff.. friendly, hot patrons!\nTHE MUSIC IS SO YAY! Lots of Late 80's/Early 90's dance, and cool newer stuff! Love love love 440!", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-26", "description": "We were walking down the street after brunch on Easter Sunday when:\n\nBaby, look, they're having Rusty Nail and Bloody Mary drink specials.\n\nUh huh.\n\nRusty Nails and Bloody Marys.\n\nI know, I heard you.  We just drank our breakfast.\n\nIt's Easter.  Rusty Nails and...\n\nOh my god.", "author": "P J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-11", "description": "We have been going to 440 for quite some time now while in San Francisco.  The drinks are wicked good, but the atmosphere is just not there.  They pack in as many people as they can, and then crank the heat up...what is up with that?  We usually can only have one drink here before we have to take off, or we would sweat our behinds off.  The bartenders are nice to look at, but just not worth all it is hyped up to be.", "author": "Kevin V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "I love this bar, even though it's not my scene.\n\nIn my past life, I was a \"clone\". I had a shaved head, freshly plucked eyebrows, wore makeup, tight jeans, and classy shirts. All I knew about bears was seeing them at the Folsom street fair and them once in awhile picking up on me at those mentioned fairs.\n\nBut now that things have changed. I find myself going here because I am the big fish. I am the only \"female looking thing\" that goes here and I have a blast each time.\n\nThey always have an interesting crowd here. All older(40+) gay men, a few strange straight guys who hang out here, etc. I've always had a blast here. Maybe it's my primal urge to smell body odor and sweat. But it's a great bar.\n\nIt is kinda small and aon a Saturday don't be surprised if it takes awhile to get served.", "author": "Lana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-24", "description": "the day was 2/18 (yes, it was after vday and i firmly don't believe in its existence). 440 made it better for me! DEFINITELY! i LOVE the \"bears\". i really do. even though it was rainy and too packed, i still had a bombass time! OH YEA, the joy of being grabbed by a man..expect the unexpected (you see, it's not unexpected, it is expected.haha)\n\nthis is def a bar for the open-mindedness and the people who love bears and they're welcoming!", "author": "Marc K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Some hirsute stout sirs\nCute bartenders are so nice\nTo shaggy and shorn", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "440 has become one of my favorite bars in the Castro. Everything you hate about Badlands and most other places in the Castro doesn't exist here. It's low-attitude, free of pretense, and free of that general homogeneous foofiness which is unfortunately so often perceived as characteristic of all gay culture. \n\nIt can get crowded, but never too full, and the crowds are not an issue because they're usually made up of friendly people who can also be interesting to talk to.\n\nI enjoy coming on Tuesdays, when all beers are $2, but I've also been on a Monday, when lots of people, including the hunky bartenders, are in their underwear. That can be amusing, for obvious reasons. Weekends are usually busy, making it difficult to find a spot to settle, but entertaining for the senses.\n\nMy only complaints: the small size of the bar, which is a problem you can't avoid in any Castro establishment, and the music, which is definitely subject to personal taste, so it's difficult to fault them for my disliking it.\n\nI suppose that in essence it's a bear bar, so you should go with that in mind, but I must say the crowd is extremely mixed. I think this comes in large part from it's central location on Castro St.", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-08", "description": "Love, love LOVE this place! The staff treats you like family from the beginning! Can it get crowded, absolutely. Is that a bad thing in a gay bar, ABSOLUTELY NOT! Every time I go, I meet a new patron that is very friendly and strikes up a conversation with me. As a new guy to the city, I have found this to be one of the more friendly spots and love going for a quick beer after brunch on the weekends. Doesn't hurt that the staff are pretty easy on the eyes too!", "author": "Bradley V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "I'm older than the 30- and 40-somethings who make the 440 a happening place, yet I don't feel out of place or neglected. The 440 has a relaxed, neighborhood bar feel that welcomes regulars and tourists alike. It's the kind of bar where you get to know the bartenders by name (Shando, Tony, Steve, Nick, et alii). The 440 is also a great place to meet up with your friends after work for a drink. It's also the home to Sunday Furry Sunday and Sunday Scruffy Sunday afternoon events organized by the celebrated Harry Lit (CastroBear) with DJ Rotten Robbie. Wednesdays is Wooden Nickel Wednesday -- buy one drink and receive a wood token good for your next one. Fridays 4-9 is also the perfect way to start the weekend with buy any cocktail and receive a wooden token good for your second. The 440 has an excellent sound system with popular and talented DJs including one of my favorites Bill Dupp. The \"440\" in the name refers to it's street number in the address. This location has been a gay bar since the 70s with great names like \"Daddy's\" and \"Bear Hollow.\" Finally, no review would be complete without mentioning that Miller Lite draft is always only USD $2.", "author": "Ted C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Randy is the best bartender in the world! Courteous, friendly...and not bad on the eyes.", "author": "Lars L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-29", "description": "It's my \"Go To\" bar in Castro. Low-key, great people, fun times, laughs and all my friends! One of things that I do like the most is that it's one of those Castro bars that you don't get a lot of \"hags\" hanging there which is WAY cool! \nThe downside, it's lost it's Daddy's edge nonetheless it is my old faithful!", "author": "Rob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "I used to hate going here when it was called \"Daddy's\".\nI have now grown (no pun intended) to love the new 440 Castro!\nMy favorite night is always monday night- UNDERWEAR night!  \nThe best bartender there- this hot guy named BEN- ask for him! woof!\nI also love Nick!-&\nJodi --sometimes he pours drinks,other times he cleans the glasses. Atta boy. I prefer this bar over any other in the castro because the staff is WAY more friendly. Amen!", "author": "Gabriel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "It was a Friday night as it was my first time checking out the Castro. We were going from one place to another--not impressed. What caught our attention about this place was this gay boy who was complaining about a $5 cover which we found to be a bargain bc in WeHo $5 is nothing along with paying $12 for a drink. When we entered the place I was relieved to see a younger crowd dancing to good music sipping on drinks that were soo affordable--I don't think people fully appreciate. Saturday night we didn't want to repeat bars but ended back here again since we just weren't impressed by anything else. Maybe it's because I'm not from the area but this place was definitely fun and memorable. \n\nThe only one thing I wasn't cool with were the random straight guys that were lurking around trying to pick up on wasted girls. Maybe this was just an isolated incident but the bartender had to intervene a couple times by calling the security guard over to break apart weirdos that were sucking each others faces off.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "I'm a straight gal. But I LOVE going to this place with my gay friends. It is a bear bar with lots of horny guys. But nevertheless, everyone is very friendly and warm. The bartenders do a great job and the place is always clean (except bathrooms could do a little better). \n\nYou can see me here almost every weekend.\n\nCASH ONLY!", "author": "Katie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-12", "description": "Formerly Daddy's\n\nWed. night is club frathouse, hosted by Gus Presents.  Awesome party.  Crowded.  Lots of cute gay guys.  drink specials,  $1 cover on wed.\n\nThe rest of the week it is an older gay man's bar.  Cool spot, esp. on Wednesdays.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-07", "description": "Daddy's Bar is undergoing a facelift and an identity change.\n\nI honestly find 440 Castro to be the happy medium between Badlands and the Cafe.  It's also not as crowded as \"The Bar\".\n\nPoints for 440 Castro:\nThey are not limited to the \"music videos\" that Badlands plays over and over.\nThe staff is great.", "author": "Max K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-22", "description": "Seriously, CLEAN THIS PLACE!\n\nThis place stinks to high heaven and can be smelled a block away, It's horrible.\n\nThe music is very predictable and passé' with a huge yawn factor. \n\nMost of the time everyone is playing on their phones and not interacting with each other. I guess that's pretty standard nowadays. However this place actually holds events that encourage that behavior instead of them having to actually make an enjoyable, fun, social atmosphere", "author": "J.B. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "FUN...\n\nPlan on walking home...the drinks are STRONG (sorry liver but strong=fun).\n\nHere is what you get: dimly lit dark bar with red glow...usually hot (so you'll want to take your jacket/sweater/shirt off)...mostly 30s-40s masculine men, flirty (but not creepy)...bartenders are efficient and cordial (willing to shoot the shit if there isn't a line)...sometimes overcrowded...drag queens to leather to twinks to bears...nothing seems too \"out there\"...if you come alone-you may be touched inappropriately (or appropriately)...\n\nConversations likely to be overheard: Did you see the invite/photo on Facebook about....Cool...what's that app called (iphone)? He's hot...do you know him? I think he might be on Grinder...Isn't Gavin handsome?...Are you going South of Market tonight / this weekend?", "author": "Tom M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "This place is cool. The people are usually pretty friendly.\n\nThe scene - it depends on what you like. :) And to go here, you should probably like bears and cubs and guys like that, or at least want to see them. :)\n\nAlso, check out the back of the bar when you can - you might notice more fun times than you could have imagined!", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "Great staff. Nice guys. Thanks for making my stay in the Castro so enjoyable.  I will be back! Very comfortable vibe. Found my neighborhood bar in the Castro.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "I'm a fan of 440 and also of their sister bar in Waikiki (Bacchus).  I had a great time at SFO pride with all the nice guys at this packed bar.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-20", "description": "I love this bar.  \n\nCheap drinks.\n\nGood music.\n\nBears (who I've come to find are the most friendly people in the Castro). \n\nGreat staff.\n\nFriendly crowd.\n\nTwo thumbs up for the 440!", "author": "Valerie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "I probably frequent this bar in the Castro the most and I've finally been able to call it 440 after all these years of calling it Daddy's. Funny though, that I think the crowd is a bit younger than it used to be...or is it that I'm now in my 40's and I just look like all the other older dudes. But at any rate if your into the mid-30's to mid-40's kinda guy, you'll find him here. Not the lurchy, creepy-cruisy ones, but a good mix of locals and tourists alike, mostly donning ball caps, Levi's, flannel and fur. Totally laid back and very San Francisco. \n\nBe sure to check out: \n\nUNDY MONDAY - underwear clad bartenders and patrons with the occasional big bulge contest. \nTWO DOLLAR TUESDAY, All Beer. All $2. All Day. - And NOT just the Miller Light. \nFRIDAY HAPPY HOUR from 7-10 is usually packed. \nSUNDAY BEER BUST from 3-9 where $8.00 gets you a souvenir cup and all the beer you can drink. \n\nBut notably EVERYDAY, drinks are cheap and STROOONG. Just like we like 'em in the Castro and if you hang out long enough next to the Pinball machine, you might meet your future husband. I did - and I proposed on NYE!!!", "author": "Frank B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-15", "description": "I always feel a bit strange reviewing a gay bar when I am a woman, but here I am reviewing it. I review it because I have many lovely boyfriends who, after getting me socially lubricated can convince me to go into a place named \"Daddy's.\" Sure, it's changing, but it's still similar from a woman's point of view.\n\nA fun place with plenty of eye candy to dazzle you with. As an avid people watcher, I was thrilled by men in their underwear and my usual course of drag quens. I must say, the shocker of the evening was my attempt to find the women's room, which there isn't one. Naturally. \n\nI may have ended the night outside, ill to the stomach, but my best friend did come to my aid with a bottle of water, and then shrilly screamed \"They're playing Gloria\" and he was off to flashdance with the crowd. That alone makes this place a 4 star. I minus the one because, as a woman, there just aren't many leather mamas inside for us to enjoy.", "author": "Vee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-10", "description": "OK! It's official! Nothing but 5-stars for this place! I've found my Trax equivalent bar in the Castro! \n\nNothing much has changed since my last review (see below) but the more I've been going here lately, the more I've been liking it.\n\n- Great beers on tap and cheap too\n- Nice and very friendly bartenders. No matter how crowded the place gets, they're always smiling and having a good time\n- Music still remains good\n- Crowd is the winner! Friendly, laid back, fun, unpretentious, jovial and out to have a good time!\n- Seating at the bar is good so are the benches with the perfect height for the second step so you can keep your foot on it for hours!\n\nSo, let see:\n1. Good and cheap alcohol\n2. Good and friendly bartenders\n3. Good albeit a bit loud music\n4. Good and friendly crowd\n5. Good seating\n\nMakes for an instant 5-stars!!", "author": "Amit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "I been there this July 2011 and this place ROCKS and sooo many HUNKS for gay men! makes ANY guys drool!", "author": "EdwardF A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "Yes! This place is awesome!! This is a very friendly, social place, with awesome music. It's small so it's gets crazy crowded, but it's a good time and an awesome place to stop in if you're doing the whole Castro run. I've seen some ads saying no women in here...which is true. I've often been the only woman in here, but that's not to say always, and the guys are fun. You might get vibed by some if you're a woman, but let's not block out all the friendly guys!", "author": "Dana W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Drinks are really STRONG!!  Had four long island iced teas and ended up way too drunk to function.\n\nThe owner of the bar is really nice (gave my bf and I free drinks).   The bartenders weren't particularly friendly before the owner gave us drinks but much more attentive afterwards.  \n\nIf you like cheap strong drinks, def go here.  The scene is kind of daddy/cub/bear etc. but a good place for cheap drinks to start off your night.", "author": "Banana S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-27", "description": "I do not think I have ever said this in any of the many, many reviews I have written, and certainly not about a bar, but if I could give this place negative stars I would give it 1000 big fat stars with lessons on not hating people who aren't like you written on them.\n\nThis bar has this gimmick on Mondays in which if you wear your underwear you get $1 off your drinks. IF YOU ARE A MAN. If you are a woman you will be told quickly that this is a very bad idea because this is a gay mans bar and they will not like it if you do. \n\nSo, me being me, I took a survey. I did not find one patron who would have given a rats ass if a woman was in her underwear, and quite a few who said they couldn't believe that was the message being sent out by the staff......but, okay, whatever, the staff must know what they are talking about and I didn't want to be disrespectful (plus, I got a free pass to not have to take my clothes off in public, which, honestly, is not a bad thing at all or something I would likely do). \n\nSo, at this point I figured fair is fair. Since I was basically not allowed to participate in order to get a discount I thought the least they could do was give me the discount in good faith and for listening to their gender bias (illegal, by the way) rules. What I got when very nicely suggesting just that was a rude comment from the bartender and double charged for my drink. \n\nSo, I asked a different bartender to allow me to speak to the manager since the one who overcharged me had no intention of coming near me to fix his \"mistake\". \n\nI explained how if you are going to make exceptions to your discount policy then you should accommodate accordingly. I was very nice and really just looking for an explanation as to why I was instead charged double when inquiring about it. \n\nThe manager at this point very curtly asked what I had been drinking, threw at me half of what I had paid for my drink and said in one of the most hateful voices I have heard this year \"If you don't like what he said you can leave\". \n\nThat I did. \n\nI live in this city, and love it, because it is much more accepting of all people than anywhere else I have been. I  never thought that someone who most likely has dealt with issues of acceptance could be so unaccepting of someone else. \n\nYou mean, mean man. I tried to talk to you nicely. I was not argumentative when you told me I couldn't play with the other kids. I tried to treat you and your place with respect, and you treated me with hate in return.  Hate. Why?? \n\nI will never be back, and if I can help it neither will anyone I know in the gay community (and that constitutes a whole lot of people). Will this shut you down? Probably not, but maybe it will make enough of an impact to make you think about acceptance, just for a minute..... both receiving it and giving it. \n\nShame on you. \n\n(If circumstances were different this could have been one of my funniest reviews EVER!)", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-09", "description": "Love this bar.  Bartenders Lee and JJ are THE BEST.  Wish it was still called Daddy's but I like the mix of people now that they made the change.\n\nJim Hopkins DJ'ing there on several various nights throughout the week = AWESOME.  Jim's been DJ'ing and producing in the dance music scene for over 20 years- and has played at venues/parties all over the city.  440 (and the Castro for that matter) is lucky to have him as the maestro.\n\nThis place can get rowdy... and I like that.  Good eclectic mix of guys just down to have a fun time.", "author": "DJ P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-01", "description": "I'm of the opinion that everybody needs places to call their own. Not uniquely their own, but to have as their comfortable, enjoyable default. You need \"your\" Thai joint, \"your\" coffee place. And, when you're a shy, yet kinky gay boy, you need Daddy's. Yes, Daddy's. Calling it \"440\" instantly marks you as a tourist or n00b.\n\nThat said, Daddy's is my prototype, my Plato's \"Form\", if you will, of the ideal gay bar. Attitude is refreshingly absent (*koffkoff*Badlands*koffkoff*), you won't get molested (unless you want to be!), it doesn't smell like fetid asscrack (*koffkoff*Edge*koffkoff*), the staff is friendly, they actually know what a gimlet is, and they have Big Daddy on tap. Fortunately, I'm happily partnered, so I don't have to suffer the existential angst of drinking a Big Daddy while cruising for a big daddy.\n\nYes, you'll find everything from the stereotypical bear to the unbearable vapid twink here. But, all seem to exist in a sort of détente. All are friendly; you can talk to strangers without necessarily having to go home with them afterwards. But, the sexy, sexual edge is still there. The standard angled mirror above the urinal is present, and underwear night gets downright naughty after about 10 PM. And for the love of God, if you don't want to be the most popular guy there, don't bring a just-purchased riding crop into the bar. Just sayin' is all.\n\nSo in sum, Daddy's is friendly without being saccharine, sexy without being nasty, and always good for a quick cocktail or extended booze session.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-19", "description": "Drink prices are okay. Customers are alright. Gets very crowded. Has limited seating. Its really just a bunch of people standing around. I don't think its that great. And it seems not clean and outdated.", "author": "L. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-08", "description": "Somehow I always end up at Daddy's when I am in the Castro (not the 440... that is just some ruse to try and gentrify the joint). \n\nThe drinks are cheap, the place dark and quiet (my roommate once sequestered himself here after an eye exam when they told him that he could not go out into the light for a while... and bourbon made it all better). \n\nNot a terribly \"scene-y\" bar, Daddy's is a place to have a drink, sit back, and not be attacked by blaring loud music... \n\nThe bartenders and crowd are friend, the drinks are easy to get and cheap... though remarkably heavy handed (just like Mom used to make... well, not my Mom, but you know)... and its a great place to hide away from the day...", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "Most Awesome Gay MEN'S Bar in the Castro.  Great drinks, great staff, cool music.  While I miss the Detour,  440 thankfully takes its place.", "author": "EC N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-21", "description": "You know, I find that I enjoy this bar more than any other bar in the Castro.\n\nThe crowd is less pretentious, a little older and certainly cute.  The bartenders make stiff drinks and they're pretty cheap (though still a little pricier than other places nearby).\n\nUnderwear night is a hoot.  This one old man was walking around with a straight up boner (pun!).  In general, if you like your bars sketchy and the men skeezy then I suggest hitting this place up on Mondays.\n\nWednesday is Frathouse night and tends to skew very young.  It's a little too crowded but can be fun.  And there was a HOT go go dancer this week.  If you're the hot one (you know who you are!) call me up.  Me love you long time.\n\nClearly I'm a little bored at work today.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-13", "description": "I was mauled by a bear here!  I was just trying to enjoy my Big Daddy (the beer) when a bear friend of mine sidled up to me, pulled off my shirt, and...well, from there I'll spare you the details, mainly because I don't remember them.  I do remember trying to put my shirt back on to order my fifth Big Daddy (again, the beer) of the night when Mr. Bear said, \"No!  Go order your drink with your shirt off, and you will be god of this bar!\"\n\nI've been to 440/Daddy's on a few occasions.  Until my most recent romp, I'd never had a truly great time here.  The place is alright.  It's a gay bar, and they have men and beer.  What I do like about it is near-total absence of cookie-cutter gays that congregate at the B.O.C. or Badlands on any given night.  Instead, it's full of cookie-cutter bear daddies--and while that's not my type, they do make for pleasant company and conversation.  For example, when I wasn't getting groped and ogled, I remember discussing which Star Trek series is best (The Next Generation) and who we would cast in a remake of Harold and Maude (the teenager from Little Miss Sunshine as Harold, and with a lot of age-makeup, Patricia Clarkson as Maude).  You just don't get this kind of conversation at the other bars around the Castro.\n\nWARNING: This is yet another one of those gay bars that has a mirror at belt-level above the trough urinal.  As I've said in the past, there is nothing more humiliating than having to bend over a urinal in order to check your hair and make-up.  \n\nFor as crowded as the bar gets on a Friday night, the bartenders are really fast and friendly.  I was expecting to wait for an eternity to get my drinks and was highly impressed at their efficiency.  This allowed me to get drunk faster.\n\nYou may be wondering how shy, modest me handled my shirt/no shirt drink ordering dilemma.  I compromised--put on only my jacket, left it open, and wore my aviator shades which I always keep handy.  I looked like a badass, and also like an escapee from some aviation-themed porn flick.  But mainly I just looked like a mess, and I fit right in.  Bottom line: If you want to get sloppy drunk and disobey social conventions, this is probably the best place to do it around here.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-29", "description": "I still call it Daddy's. When I do come to the city it's here or the edge for me. Stopped by last Sunday after the Mint before dinner and it was some hairy guy day. Just had to pay a buck cover to get in. We went to the back sat down and emjoyed the view. Very friendly bar tenders. Great crowd--my age!!! No twinks here.", "author": "Nobbi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-05", "description": "Met up with friends for a drink after work.  Bartender looked at my ID twice and under the red light (yes, I'm that much older than 21) and then told me I'm gorgeous.  I love gay men.\n\nThis place is great for people watching when you're by the door and when you're with locals they LOVE to comment on everyone on the street: \"he used to look good\", \"oh, she is looking good these days\" ... Of course several acquaintances and friends stroll by with a kiss on the cheek or sometimes come in and entertain you for 20 minutes.  3 beers for $12!  I'm beginning to like this place ...", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "This is your Daddie's bar. You won't really find 21 year old twinks here, but sometimes a stray wanders in.\n\nIt's a really chill place, except the bathroom is small, so you usually have to wait in line. They have a trough with a small-ish mirror over it, so it's not really designed for people who are pee shy. I once even saw a girl completely wasted out of her mind having great difficulty trying to pee over the trough. It was pretty shocking/funny. I hope her friends never let her forget it.\n\nOkay, so MONDAY they have underwear night. Come here for fun and see some cute guys in underwear. They have some sort of clothes check so you don't have to worry about leaving your clothes at home and taking the MUNI in your underwear. To encourage this sort of behavior the bar gives I think $1 off drinks if you order in your underwear.\n\nTUESDAY they have $2 beers. Hallelujah!\n\nAnd they have some other special events I'm sure you can check out on their website. So if guys with beards turn you on, definitely come here. If you only like young looking guys, maybe check some other place out, like The Lookout.", "author": "Xavier G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "The drinks are strong and cheap. The bartenders are friendly and cute. Can you ask for anymore? Oh and careful boyz... this is a bear bar so you'll definitely run into a handful of daddies : ) lol.", "author": "Moises T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "Otters and Cubs and Bears, ohh my!!! I love this place and you get some strong and cheap drinks here with really friendly bartenders. One of my staple stops.", "author": "David R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-08", "description": "Went here on a weeknight.  There were lots of people, but they were mostly staring around looking for excitement.  Music was so-so.  Drinks (Cape Cod) was awful - house vodka, whatever it is, is astringent tasting.  Had one drink and went to Moby Dicks a few blocks away and had a blast.  Cash only; no credit cards.", "author": "SF G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Daddy/Leather bar. Not my scene. But fun to go to mix it up.\n\nGood drinks.", "author": "Art A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-02", "description": "First Wednesday of the month is called \"Faggot\" and it's a packed house with an awesome DJ and a very non-\"daddy's\" crowd. In fact, it's more of a \"boi\" crowd, think along the lines of Trannyshack / tubesteak type of crowd. Alterna-gays. Crazy fun, great music, make-up, go-go boys, shots, no attitude, cruisy...hmm..why is it only once a month?\nDaddy's is changing, slowly but surely, it's actually even changing the name to 440 Castro and not Daddy's...", "author": "Jason D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "This bar has great happy hour specials. I especially like the fact they give you a token for your second drink unlike Midnight Sun. But this bar NEEDS to understand that when 150 people are in it....they NEED to put the FAN on. It feels like a sweatshop in there. There have been many times I have had to leave because of the heat.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "One of the few places in the Castro that doesn't seem to be swarming with obnoxious 22-year-old twinks. If you scene is a more mature dude with body, possibly with a little b.o., this is the place for you. They have a great happy hour. I've been in SF three weeks and I think I've been there enough times to be consider a \"regular\" on Yelp check-ins. Music is usually pretty good, especially when the sexy DJ Guy Ruben is spinning. A word of warning though: They have old school tinkle trough in the men's room...with a mirror above it. So if you're shy, I suggest asking the bartenders for the key to single-use toilet.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-13", "description": "So this review is strictly for FRATHOUSE, which I was totally unfamiliar with - I actually hadn't been here since it was Daddy's so very long ago.....\n\nSo - 1 point for a decent coatcheck with a no-nonsense queen taking my stuff and treating it well.\n\n1 point for the bartenders in the back room who weren't at ALL like the shithead ones that were in front. Ugh - rude, rude, rude!\n\n1 point for the mix of the crowd. I was really afraid it was going to be brainless golden retriever pretty boys in their Abercrombie, but honestly, it was a LOT sleazier and you know me, kids - I likes me some sleazy.\n\nOther than that I would say it was just okay. I think Sloppy Seconds would be a much more fitting name for this event rather than Frathouse. More fun at 11 than at 1AM, when there were so many people that I swear I was inhaling the sweat of the armpits of 100 stinky men rather than actual air. I wouldn't say the crowd was exactly...um...attractive(?) but hey, 31 flavors, right?\n\nBest moment: When some creepy guy came over and asked me if my friend ( a fellow Yelper) was single and I told him he was a male escort from NY that I had paid a pretty penny for. Not only was said creepy man not discouraged but actually asked me if we wanted a 3rd for later. Ew.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "440 gets the balance right - better than anywhere else in the Castro as far as I'm concerned. Everything from great happy hour specials, sweaty underwear nights, cheesy, but entertaining air canons, and even the edited porn make this one of the better choices in the Castro. It's the only place I enjoy for a quick drink after work, an after dinner-get-the-party-started drink, or often enough a 'why go anywhere else' night.", "author": "Ennis O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-17", "description": "Great venue.  Totally wonderful staff.  Most of the clientele are great too.\n\nHowever, compared to other bars, my experience witth 440 is unfortunately replete with umpleasnt encounters with hostile, combative, asinine customers.  It's the only bar in which I have, without provocation, been threatened with physical violence.\n\nWas there just this past evening- not feeling especially keen on returning for a spell.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-19", "description": "Great place for a drink before a show at the Castro theater.. ice cold Hefeweizen on tap. Ultra crowded, I'm surprised this place wasn't shut down by the fire marshal!", "author": "Alexander C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "Okay...440?  Pfffft.  I absolutely R-E-F-U-S-E to call this place anything other than \"Daddy's\".  \n\nSo, on to my review - loooooooves Daddy's!\n\n...And, I'm not really sure why.  There isn't a lot of seating.  The benches they do have are uncomfortable.  No dance floor.  The bathroom has one of those mirrors right above the urinal so that pervy types you wouldn't look twice at can sneak peeks of your junk.  \n\nThere are some plusses - the music is fun.  There are two bars (one upper, and one lower) so that you don't get stuck in any crazy lines.  And there is one ridiculously hawt bartender.  The drinks are also pretty decent.  And they have one of those little computer game machines that are way too much fun to play when you reach a certain level of inebriation.\n\nBut, all in all, the positives shouldn't place it much above most of the other bars in the Castro...and yet - somehow they do.  When the friends and I want to gather for a drink, Daddy's is usually one of the first places that comes up, and probably the only place we can all agree on (some hate the crowd at Badlands, some dislike the smoking at The Mix, I'm not much of a fan of Moby Dick's).  Basically everybody's got a gripe about one bar or another - except Daddys!  We all heart Daddys.\n\nOkay...probably my least informative review.  But thats mostly because I can't quite place my finger on why we all dig Daddys.  Decent music, decent drinks & computer games.  Guess it doesn't take all that much to float my boat.  \n\n...well, I guess there is that yum-o-rific bartender.", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-13", "description": "440 (formerly known as Daddies) is the place to be.  Great bartenders and good looking patrons.  What else do you need?", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-09", "description": "Oh, why can't I quit you 440?\n\nI love this bar. It's probably my favorite bar in the SF. The guys are generally a nice mix or normal to attractive guys. Most guys are friendly, but not overly grabby. \n\nDrink specials here are usually the \"DRINKS ARE CHEAPER\" variety which, as a beer drinker I prefer. I hate when places have 2 for 1 mixed drinks, and no specials on beer.\n\nMy only complaint is the occasional Bear with a BO fetish.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-10", "description": "Like many reviewers, I still call it Daddy's. As far as small neighborhood bars go this is one of the better ones. I've stopped in with out of town friends on a Friday or Saturday night and always had a nice time.\n\nThe Sunday Furry Sunday events they do as fundraisers for the Lazy Bear Fund are always really fun. I do my best to avoid the place when they have other special events, especially \"Frathouse\" as it seems to attract a crowd I find unsavory.\n\nI'm hoping this bar's identity crisis will end once that crowd migrates to the Lookout or other places pandering to twinks and under 30's...", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "This is a Daddy Bar... The name changed years ago but everything is still the same.. If you like older guys, here is the place!", "author": "Rix G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-22", "description": "I miss Daddy's. I think some of the guests haven't realized that the ownership has changed as they looked dumbfounded at all the younger, hairless boys prancing around.\n\nStrong drinks, SUPER hot upstairs and jam packed. It's conducive for disrobing and dancing but I'll never forget the original bar that I had loved when I was 21!", "author": "Tyler J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "440 is not my #1 hangout spot, but it's a lot of fun and there's no attitude. The folks that work there are awesome and they make strong, delicious drinks. Check it out sometime!", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-21", "description": "I'll be the 1st to say that the  Stro ain't my favorite place to hang but I won't go into all that here. What I will say is that 440 is the best bar on the strip hands down. I was really suprised how friendly the people are and the drinks are nice and SCRONG**yes scrong**. The dj on mon-wed is a sweetheart and will play anything you ask.", "author": "Marc F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-03", "description": "Like: The strong drinks, reasonable prices, laid-back crowd.\nDislike: The pee trough with a mirror above it.  Honestly...I know it's a gay bar and used to be Daddy's and cruisy, etc....but that's just unnecessary.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-23", "description": "Being married means I have to get my bang for my buck whenever I go out with my friends.  Not literally, but figuratively.\n\nThis place, for the after-work crowd, generally does that.  Enough flirtation to stay, and just nasty enough to get me to go home after a few drinks.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-22", "description": "one of my favorite hang outs.\n\nNo it is not a hag bar\nYes it is a mans bar\nNo it isn't Daddy's anymore :o(\nyes it smells\nyes the drinks are strong\n\nMe likey!", "author": "Matt V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "440, what......\n\nDaddies, love me some Daddies.\n\nThe place is a great space to grab a drink and maybe grab....\n\nA good ole cruise bar...more SOMA than Castro", "author": "Ken p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-14", "description": "At first I was highly pissed they changed Daddy's. \n\nBut after a while, I started to embrace the better music, nicer bartenders (love you Nick and the hot Daddy in back), more space, improved lighting and, oh, hotter guys...\n\n...and never looked back!", "author": "BroSauce J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-16", "description": "I've been here twice. Once after the Pink Party during Pride 2008 and most recently out with friends after a birthday dinner.  Both times I have had different experiences. During Pride it was far to crowed in a good way, took forever to get a drink, but was well worth it based upon the mood and vibe of the crowd. Being a straight girl in a gay bar can be a tricky situation, you either feel loved or extremely out of place.  I totally loved it and had a fabulous time, and was extremely relieved to see that the women's rest room was upstairs and locked rather than the men's room spectacle that would have proved difficult and extremely akward for me.\n\nThe bar tenders were gorgeous and freindly and one made me the stongest tequila sunrise I have ever had....always a plus.  Hot go go dancers, and an awesome DJ make this a really cool place to go. If your up for an expereince go here....you may meet a drag queen that'll knock your socks off.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-22", "description": "Ladies, better be content with being invisible.  The times that I have been here it must have been leave your clothes at home night because several gentlemen were strutting around the bar in nothing but their tiny knickers.\n\nMy roommate Emily dragged me in the little gated off section of the stairway to dance and was completely mortified when she noticed that no one was watching us.  Ahem.  Lets' see, we're in the Castro, at a gay bar where men are walking around in their undies...I don't think any gay man would be interested in watching two fully dressed straight women dance...  Just a crazy thought.\n\nThe men were fun and outgoing and more than willing to chat us up and talk about their dogs and various other fun, everyday stuff.  I'd definitely recommend this place because the people that frequent it are awesome....I wish I had the guts to talk about my undying love of my dog Snuggles while wearing nothing but a thong and holding a cocktail.  Kudos.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "Pappa can you hear me?\n\nApparently not.  It's so sad that the days of Daddy's are gone.  I can still remember being a wee lad of 21 and crossing the street to avoid the oversexed men that paraded inside the dark, smelling bar.  Not too long after I found out why years later I was so drawn to step foot inside.\n\nDaddy's (440 to the newbies) still embraces yester-year with it's iconic man dressed in leather garb cut-out located near the trough upstairs, however these men no longer venture.  You'll find this bar full of every taste of the rainbow from twinks to muscle bears.  You won't find many bikers here, nor those dressed in leather, but you will still have an amazing time.\n\nThe bartenders are friendly and have wicked smiles.  Watch the youngster in the upstairs bar, he's more than likely to call you \"Mister or Sir\" regardless of your age.  Obviously he knows his place on the totem pole (just jokes kiddo).  Music at times here can be a little too Pop and best left at Badlands.\n\nOverall, if you walk into Daddy's with a go with the flow attitude, you're night will treat you well.  It can get a little crowded and warm in this place so just be patient and respect those around you.", "author": "Shane P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "There's just something missing. The soft core porn videos reek of \"trying too hard\". The staff is nice enough, but when a 35ish bartender is trying the A&F look,,,,I realize businesses need to make money and use any ploy at their disposal, but REALLY..REALLY? You can tell the owners put some thought into the look of the place, which is nice..but there's just something missing that I can't put my finger on. They get an A for effort though.\n\nUpdate: 01/18/13: things have settled into a more comfortable groove. The bartendars welcome everyone equally and have a kind of confident sexiness whithout being arrogant. AND they are putting money back into the business by re-doing the back bar area. Good drinks, good men, YAY!", "author": "David I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-19", "description": "I was here in July of 2007.  Cool space.  I am not into the bear type or those who look my age.  Lets face it, after 30 oil of olay can do wonders, and beer guts are not enticing to the majority and not good for your health.  Lets's get a clue people!   Dudes, take better care of yourselves!   Good place for a lay if you are into this type since I was felt up and groped like when I was 17 and I am 47 now.  \nSo, whatever.  Great bar for those that like this scene.  Bar staff was excellent, however, they really don't cater to women but I guess that is ok if that is the ONLY gay bar like that.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-29", "description": "Looks like 440 walled off their rear, up the stairs bar making the rear part so much smaller.   I don't get it, it looks horrible and cramped, totally unfriendly looking.   Bummer.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-02", "description": "$2 Beer on Monday any on draft... that's just crazy. Even crazier was the fact it was $2 even, no additional tax or charges.. just two dollars. Nuff said. Has a decent atmosphere, didn't feel stuffy. I visited in the afternoon and they were pretty busy so I can only imagine at night. Like most the establishments in the area its cash only. I will be back for another visit.", "author": "Zak P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "If you are a twink, you will either a) find a sugar daddy b) get raped by a bear in that tiny bathroom c) want to get raped by a bear in that tiny bathroom d) get visually raped", "author": "Allen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "I spent 6 days in San Francisco trying to find a bar that felt like me.  This bar was just nice.  No gimmick, no strange themes, just good men, good atmosphere.  A real bar.", "author": "Clint S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-27", "description": "Oh my god I've never been in such a tightly packed man-crowd without a glimpse of another woman ANYWHERE!!! I felt awkward at first, but then met some nice drunk guys who were tickled to see a woman in the place. I think they felt embarrassed for me. Either that or they were jealous of my shoes.", "author": "Chantal H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-23", "description": "This place used to be Daddy's... Before I ever went, I always found it very scary: with its husky hairy leather-toting guys hanging out in the front, and its dark and ominous entrance. Then my friend talked me into going in, and it wasn't that bad. Sure, as a twenty-something you'll get a lot of attention (more than desired?), and it's not exactly my crowd, but people are friendly overall. Pretty cruisy place, though, I must say. Highlight of the bar: the giant mirror right above the urinals, oriented just so as to give a perfect view of your fellow guests's attributes.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-27", "description": "Creepy vindictive manager no-one seems to care for.  Heard many stories from former workers of the 440.  Ye shall reap what ye sow, buddy.", "author": "Cabron B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-11", "description": "I came with my gay friends, again I was the one and ONLY woman. I give you an extra star because they shot MONEY out of these guns today out of no where! Money flying everywhere!! I grabbed what I could, a whole $3! Woohoo felt like I won at Vegas haha. My friend got a $5 bill and $2 Woohoo!!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-07-05", "description": "My boyfriend liked the pinball machine here. I'm usually okay with being the only woman in a gay bar (i'm a guys girl) but the vibe at Daddy's was defenitely very penis oriented so I would not recommend it for a hag outing.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-01", "description": "440 Whoot Whoot! Love me some daddy bears! The best part about 440 is there is no stuck up attitude...cool bar tenders and plenty of wild life inside...definatly recommend", "author": "John H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-07-11", "description": "Lots of leather (more as an accoutrement rather than a lifestyle) and even more attitude, some of it from the bartenders, who should know better if they're relying on tips.  A very cruisey crowd, and therefore unfriendly if they're not interested. I'm surprised Maria D made it through the door.  Earns a star for its contributions to the community.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-08", "description": "went here for frat night once, and it was just.... amazing.  $3 beer bongs?  i think i had six of them.... and my friend at some point said \"ok Caleb, no more hard liquor for me, ok?\" then two seconds later they announced $3 jaeger shots, and her resolution went out the window... amazing.\n\nI give 3 stars, because I don't actually like the bar that much.  It's tiny and crowded, and the older guys who frequent are usually kind of mean to me....  but I love frathouse!", "author": "Caleb D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-29", "description": "i have really come to enjoy 440. i mean sure when i was 17, 18, 19 this place wouldnt have been my first choice, but then i turned 22, and realized that badlands isnt the answer to my lifes problems. maybe, just maybe 440 is? hum interesting. BUT in all honesty i would say i go to 440 1 in the 30 times that i go to badlands or the bar. still i do enjoy it when i go. maybe thats because i am so shit faced, i say \"lets go to 440!\" who really knows.\ni have begun to enjoy wednesday nights though. Frathouse. hum interesting again... its a cool mix because you have the really young crowd and then you have the little older mature crowd on the otherside. its the best of both worlds! i enjoy the crowd for sure!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-28", "description": "I LOVE ME SOME GAY BOYS!!! I was here on Sunday afternoon preparing to go on a bus bday party.  Good times to be had here, I even got the special bathroom key as I am a delicate flower.  Full bar, bar tenders were super cool, and it was bear Sunday! Who knew?  I would for sure go back for $2 beer.  Even my super tall way strait date has a killer time and we all ended up back here after the bus had whipped us around the city for 5 hrs.  Yes yes yes to 440!", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "Miss calling it Daddy's, but a chill bar, go in Wednesday's for Brad night! I mean Frathouse :)", "author": "Sean M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-21", "description": "I have grown to really like this place.  The crowd is a little older (well my age) and they are friendly.  The music ranges from really good to awesome at times.", "author": "Sean O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "The first time I ever saw a mirrored urinal was at this place. I wish it was still called Daddys. It was kind of fun to say that you went to a bar called Daddys some night.", "author": "John T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-08", "description": "Daddy's (oh, sorry, 440) offers a pleasant alternative to the more popular Castro bars. This definitely isn't your typical Kylie-spinning, shade-throwing \"boi\" bar. Changing the name might have made it sound more mainstream and--I guess--accessible to the toddler set, but I for one am glad there's a place that's more focused to a more masculine 30+ crowd. Definitely a white elephant in the Castro these days.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-18", "description": "It has been a decline since it ditched the name Daddys, but lately it has been on a steep downhill decline.  Surly employees, severe and annoying or annoyed patrons, bartenders trying to short change you in change to gain more money... just isn't any fun any longer...  Drinks have always been poor and I use to have pronunciation wars with the back bartender always on how to pronounce hefeweizen which he said wrong and would repeat it to me wrong multiple times when I ordered it to argue with my saying it and the fact I pronounced it correctly. I learned to pronounce it from a German speaker which is also confirmed online by doing a quick pronunciation search...  Well he I think is even gone these days too.  Also saw the door man have a freak out on someone last week for what seemed no reason.  Just bad vibes and a bad time for all these days...  Bounced my above thoughts off friends and most agree... Must be the new owner I heard took over and his way of running things...", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "It's my go to bar.  The drinks are resonably priced and the folk are friendly.  The music isn't too loud and it's not too crowded but there are definately folk there.  The crowd is quite diverse with a little something for everyone's taste.  Younger, older, richer, poorer, everyone seems to be here, though not always together on the same night. The bartenders are friendly and attractive and the vibe is very positive.  The weekend and Thursday night can be VERY busy so be prepared to spill some of your drink.  Monday night is Underwear night.  It's gone downhill, they need to make the back bar underwear compulsary and kick out the gropers.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-20", "description": "stinky and full of sweaty men. but they let me use the bathroom without buying a drink. AND a guy let me go ahead of him in line. a gentleman's bar, apparently.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-18", "description": "Daddy's has transformed! Awesome DJ, sexy club nights, hot batenders, and right in the Castro. Still not much fun for the ladies, however.", "author": "Billy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-07", "description": "low key, funny bartenders, no pretense of badlands, and $2 bud lights on tap!  came here on a sunday afternoon with some friends and definitely had a good time.  i'll definitely come back again, but it's definitely not my crowd and it's incredibly dark inside for a Sunday afternoon.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-08", "description": "Thought not much of a bar guy, like this place because all are welcome, does not have the airs it used to, and the bar staff -- especially that crazy danc'n hunk at the back bar -- make it one of the friendliest places in town.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-24", "description": "2.5 stars really. Rougher-looking daddy types in this leather bar. The decor is old and butch, but it's not like you can see it. Went here last night, it's pitch-black with only electric red lighting. It's a wonder I wasn't groped, but then again, I wasn't at N-Grope. Monday is underwear night, and first Wednesdays have a decent DJ (I heard him DJ at a Bevan Dufty fundraiser, he was actually decent). Only went here because a friend wanted to. Don't think I'll be going back, at least not on my own. The music I heard on a Thursday night sucked too. That said, I did see a flyer for a Goldfrapp cd release party, so it seems varied. YMMV. And yeah, you won't see any women here (str8 or lesbian).", "author": "Hao L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-19", "description": "I went to this bar 3 times while I was visiting here back in May.  The first time I went was on Monday-- underwear night.  The back room had some action going on, but I did not partake.  (Really, I didn't.)  Crowd was pretty much the same when I went on a Saturday night.  Daddy types.  Lots of guys with goatees.  Not as raw as The Eagle Tavern, but definitely not a circuit boi kind of place.  I met these 2 Irish guys there a couple of times.  But I give this place only 3 stars.  Because the pinball machine was broken.  And the bartenders at this bar weren't particularly friendly.  One of them will shoo you away if you stand where he likes to sell beer.  Oh, and also Daddy's is a much better name than 440 Castro.", "author": "Flip C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-08", "description": "Had a great time there last Sunday.  The cover was something like $1.  The patrions were very friendly was the bar staff.  You get exactly what you expect to get on this - a lot of people standing around drinking and checking each other out.  If you don't like a dark bar with a lot of different types of people or if you frighten easily, this isn't your place.  Less attitude than many other gay bars.", "author": "Ted G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-02", "description": "I like this place....\"two buck tuesdays\" are a favorite of mine....low key bearish crowd, no attitude, just people gettin' their drink on.... The bartenders are always friendly...and remember my \"rocky mountain martinis\" (beer with three olives in it).  A good watering hole for the locals...", "author": "Blake J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-01", "description": "440 Castro, nee Daddy's, nee The Bear is fairly fun, particularly if you happen to be there when it's a rugby fund raiser. Still has that weirdly proportioned leather \"hottie\" cut out of plywood near the toilets, an image of a man that I have never seen at this establishment regardless of its incarnation.  The DJs can be pretty booming, which is a gigantic plus in tritzy gay disco-centric Castro.  There's a really hot bartender who mans the back bar, don't know his name but he used to work at that packaging store down on Howard Street near 9th, so tell him I said hello even though he doesn't know who I am. yet.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "the go-go dancer gave me a few winks and a kiss on the cheek. and this was before i gave him a dollar.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "First off, I have to say most of the reviews of this place seem a little unrealistic.  If you don't personally like the decor, the atmosphere, the crowd, etc, then why are you there reviewing it in the first place?  I don't personally like the Badlands, but I wouldn't give it a negative review based on my dislike of the crowd.  I suppose to a degree the bar decides the clients, but if the Badlands crowd all decided collectively that they were only going to 440 from here on out then I'd not like 440 much anymore.  I used to like the Daddy's crowd, if for no other reason than it was more accessible to me than the outfit and attitude crowd elsewhere.  I was a little unsure about the change when 440 got going, but it was a good change.  Without chasing away the old crowd (Well, other than a few who probably belong at a sex club anyway), they have given it a much more lively atmosphere without loosing the Joe Average feel that made it a favorite in the first place.  The bartenders are usually pretty friendly, though like anyone else, some of them have their moments.   If I was slinging beers to obnoxious drunks on a Friday night at 1:30, I might be a little cranky too (ok, I'd probably be more than a little).  The only reason I don't give a 5 star is that the First Faggot night smacks of an attempt to be something the bar is not.  It is as if the Badlands decided to have a Bear Night once a month.  I think it probably started off differently, but it just feels like they are trying to say 'Regular crowd :  Don't come tonight'.  Other than that I still love the place.  I just wish the whiny neighbors would let them reopen the patio to the public (OK, if I lived there, I'd be a whiny neighbor too, but come on...you moved in above a bar.  Hello?)", "author": "Allan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "being female...i know i don't belong here.  but i ended up here last night with my homeboy.  and it was great.  i gots a bud light from the bar and settled right in. it was wall to wall guys and i was one of two women in there.  and i was made to feel welcome and special.   maybe because my hair was crimped.  i should crimp it more often.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "I have to borrow Chris T's mantra, that everyone needs their \"your\" places. Daddies' is definitely one of those spots, more times than not in the short time I have lived here, the text from friends reads \"meet me at 440\". Whenever people drag me around the 'stro I don't mind because I know that I can always pop into Daddies while they are crammed into Badlands or Midnight Sun. There are many regulars here that are definitely worth taking some time  to have a chat with. I have never really encountered attitude here, never seen anyone get aggressive(in a bad way, lol), and the crowds are usually right up my alley (yes, sometimes literally...underwear night on Monday can get crazy!). I always meet someone new when I'm there and I usually always run into them again next time I'm there. The bartenders are extremely friendly, the barbacks are too, and they have great drink specials ($2 Tuesdays, come on!). The crowds can be pretty packed depending on the weekend and if there are coinciding events happening in the city, but seeing as I how I tend to go out on weekdays and Sundays, I usually find myself with plenty of room to move around but then again I typically don't mind what I'm brushing up against if it's crowded. My only complaint about this bar would be the music. Sometimes it's ok, but it totally random most of the time, it would be a lot better if I was dj-ing there.", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-11", "description": "This bar is in the middle of a transformation, but I still see the same crowd everytime I go, which isn't all that attractive. It's like they're trying to bring in younger guys, but it's not working except for Faggot. The music is good and not loud so it's a nice place to just hang out and drink with friends.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-26", "description": "i went here last wednesday for the frathouse nite. it was a special frathouse nite, where it was the dvd release party for the falcon film endless crush. since it was called frathouse, i expected a younger crowd, but it was older. maybe cuz it was the day before thanksgiving. the youngest people were those of us who went to support my friend who was in the movie and djing a set. it was very crowded and no one dances. maybe actually we didnt have room to dance. the music was a background for people yelling. there were beer bongs but i didnt see anyone drink from them. its very much a bar and not a club, not a place to go dance. it's hard to even walk, and not cuz im a girl, the guys couldnt walk anywhere either. maybe its different on a non holiday week. who knows. anyways, it seems a good place to go drink and chat if you're a middle aged to older guy. and sometimes they have cool falcon/naked sword events. :)  oh, cover on wednesdays is usually $1, but it was $5 for this special event.", "author": "Merredith L."}
