{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "I made a reservation on opentable and was seated right away. I love their attention to detail here everything was so good and the service was great! To start off they gave us a date wrapped in bacon which was so good! I wish they had them on the menu! Then they brought two breads, bacon and sourdough. We started with the seared scallops and the Romain salad. The scallops were nicely cooked and came with an amazing sauce (3 scallops)And the salad was flavorful too (it was a Cesear). After the appetizers we got a palette cleanser which was sweet but also amazing it was the perfect pick me up before the main course. I ordered the filet mignon medium and my boyfriend ordered the bone in ribeye medium rare, on the side we ordered the sweet potato gnocchi and the mushrooms. Both steaks tasted amazing and were cooked well and to our preference. The gnocchi was so rich and cheesy and the we liked the variety of mushrooms used in the side dish. By the time the main course came we were so stuffed so we took the rest home. To end the meal we got a Anniversary Dessert which was the perfect size and also a Madelyn and a fruity treat at the end. Would definitely come back!! \n\nMy boyfriend and I dressed in the nicer side but we saw people wearing hats and jeans and sandals so you can definitely come casual!", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "I've been here a two times. Once for a work event and once for a dining experience with Bae. The place is really nice and I would suggest using this as a venue if you are looking for a nice place to have ~100ppl for heavy appetizers and drinks. \n\nFor the group experience I brought ~110 people. They allowed me to select a menu and they were very gracious when accommodating my guests who were vegetarian, vegan, or who had dietary restrictions. We rented the whole place out so it was wonderful to be able to mix and mingle. This was such a hit that I decided to come back for dinner. \n\nThe dining experience was very different (for obvious reasons) and we weren't disappointed! The ambiance is really beautiful, be it for a large group or for a general meal. The food is really great and has an Asian fusion flare. The cocktails are really good. \n\nThe staff is excellent and Michelle, who I worked with for the event was responsive, professional, and I'd totally recommend reaching out to her should you have a large group that would like to have an excellent experience.", "author": "Channing M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "Delicious filet mignon and truffle Mac and cheese. The love cocktail was amazing! Great service.", "author": "Sepideh A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Had an amazing experience here! They treated us fantastic and the food was so good! I recommend the bone in ribeye so tender. What a great way to spend my birthday I wouldn't have had it any other way!!! I suggest making reservations this place is popular!", "author": "Lovebug A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Exceptional service!\nI called in to see about changing our reservation, casually mentioned it was our anniversary. When we got there, Rae our hostess was amazing!! Everyone there was Amazing! The food is pretty great too. Definitely going back. We were served a complimentary glass of bubbly as well as dessert for it being our anniversary.", "author": "Reenay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "I went in for dinner the other night and the service and food/wine was amazing. Matt Rhinehart was nothing less that impeccable in all of his recommendations. I highly suggest asking for him the next time you're in. And if you haven't been yet, what are you waiting for..GO!!!!", "author": "Christine P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-02", "description": "Too small of a dance floor and some of their music that they play is not rhythmic!  Their music ranges from country, pop, mainstream and to oldies.  I don't know what age group or type of crowd they are trying to attract with the songs they play!\n\nPeople are there, but half of the crowd are not dancing - just lingering.  It kills the whole vibe for the night, kinda.\n\nTheir drinks are priced on average.  Downstairs, where the unisex restrooms are located, is pretty nice!  What a waste of space, though - they could have converted that seating area, downstairs, as an additional dance floor area, somehow.\n\nThe layout is modern - especially with the glam on the top ceilings where the bottle service is at.  It's eye-catching!  \n\nFINAL SAY - Please make the dance floor bigger and the music better!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-04", "description": "I've been here numerous times to celebrate birthdays or just have a fun night out on the weekends. The steakhouse turns into a lounge almost a club on Friday and Saturday nights. It's a bit more upscale and dressy than your typical lounge. They have a dj that plays classier music like edm and top 40s. You'll rarely hear hip hop and rap, if anything it will be a mashup and it'll pass by real quick. \n\nThe crowd is also fancier. An older crowd of late 20's-late 30's and mostly asian. The real loungers will be seen standing in the dining area with drinks in their hands chatting their night away. While you'll see the clubbers on the dancefloor and at the bar. Every time I've been here it's been real busy. But I heard it can be quite dead.\n\nThe men wore suits, business attire (collared shirts with dress pants). The ladies wore cocktail dresses and heels. They enforce dress code strictly, so men put those sneakers away and bring out those dress shoes.\n\nRumor has it the owner of 5A5 is also the owner of Element SF. Surprised it's not ratchet? Heard the owner is strict on keeping 5A5 fancy. Tried to request a lil Jon song one night and the dj said he's not allowed to play those kinds of songs. Say whattt? :O. But the dj said he'll try his best to incorporate my request in his playlist. It ended up being mashed up and played for about 20 sec until it transitioned to another song. At least he tried.\n\nI do really like the decor, ambiance and layout. They also have an outdoor patio don't remember if it was also a smoking area. The bathrooms are downstairs and I liked the design of it. It is unisex however.\n\nThe venue itself isn't meant to hold a lot of people. When capacity hits, they open the downstairs private dining area and the bar downstairs as well. The \"dancefloor\", because it's a lounge not a club but can seem like a club sometimes, is between the bar and dj. It's not spacious at all and can get quite packed like a sardine in a can.\n\nBar is fully stocked with top shelf choices. Around $10 per cocktail/shot, average in my opinion.\n\nThey have a guestlist and it's guestlist ONLY. There's no cover. They also have table service.\n\nAnd if you have late night cravings, the munchies, or just drank a little too much, there sometimes have been a dirty dog (bacon wrapped hot dogs) stand outside. YUMMMM who can resist that smell?\n\nI've always had a good night here so far.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "What a cool spot in a nice neighborhood. I did not come here for steak. Apparently a good steakhouse, but came here for drinks many a time back in the day. Definitely an air of class that comes close to pretentious. That much I believe is unwarranted. \n\nStrict, fancy location with good drinks a bit more upscale crowd at night during the weekends. Or that's what they say at least. A lot of posers, but I believe that crowd has moved on. \n\nFor a good chill lounge it's a solid spot for the inclined.", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-12", "description": "went here because the bar at kokkari was too crowded and I came a little too early for dinner at 8:30 there with Maksim. This bar is next door, and kind of looks good so I went in. My review is for the bar only and the cocktail, and not the food at the restaurant. 2 stars because the bar looks nice, kind of upscale but the cocktail was expensive for SF. $16 for a martini, I did not expect it for a place like this LOL. Maybe I should give it ONE STAR actually because NO CELL PHONES allowed at the bar. They will tell you to put your phone away too, I will never go back there even if the cocktails are free!!!!!", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "was looking forward to this four star rated place, it started off good with still water.....presentation of the waygu beef, by the waiter was in poor taste.  Didn't want to order beef after what he had said.   Had to try though because of the rating....Now it is going down hill.   The beef was overly sauced and cold.  Cauliflower looked like crumbs, not nice florets, served cold but overlooked.   The plus side is they serve great whiskey, a few of those will make any food taste good.", "author": "Cassandra O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "Had a few questions about the different meats \nAnd Chef Miguel took his time and talk to explained about the meats and also gave me recommendations about what to order thanks again Miguel 5A5 needs more people like you", "author": "Poli H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-11", "description": "Tried to cancel my reservation more than once, but no one answers the phone. Seems to be disconnected.", "author": "Pat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "I remember when this place was a French restaurant way back when.  The decor has remained essentially the same but the food is a much different.\n\nThe experience is great.  The closest comparison I can make is Alexander's Steakhouse which I really like.  5A5 also is just as great.  It's has a slightly different spin on the steak dining experience with a slight Asian fusion touch with its hamachi sliders and wasabi sauces.  All I can say is that I really enjoyed my dining experience here and the steaks were cooked perfectly to my liking.  And if you're really up for the $$$$, they of course have the Japanese imported Kobe / Wagyus.\n\nI'm definitely coming back someday soon.  A great holiday and special occasion date dining experience!!", "author": "Cary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "The bar and lounge area of 5A5 exudes a club-like feel with tacky electronic flames lighting up the panels behind the bar and a huge circular ceiling bearing over the dining area. On the same token, the atmosphere is chill enough to just kick back and have a couple drinks with old friends. I arrived early for an annual Christmas party last night so I thought I would try a couple cocktails before heading to the private dining room downstairs. Not wanting to ruin my appetite, I passed on the small bites. \n\nThe cocktails are all priced around the $11-12 range. The first thing I noticed was that many of the specialty cocktails included raw egg whites, which have been making a comeback in the past year or so. First made popular in the pre-Prohibition era, this ingredient has reinvented the texture and consistency of the cocktail drink. At first, I was perplexed by putting egg whites in alcohol. What could a seemingly flavorless, slimy egg white contribute to a drink? After that first sip of the ginger fizz, I realized that it was all in the texture and airiness. \n\nPrepare to be wowed because I'm about to drop some Alton Brown knowledge on you. The main component of egg white is ovalbumin, which make up roughly 60-65% of the protein (thanks Wikipedia!). Structurally, the protein is tightly-wound, but when shaken, like say for instance, in a mixing glass, the protein unravels, thus leading to bubbles and the foaming property of eggs. And the inclusion of acid such as sours in mixes stabilizes the ovalbumin, leading to smaller bubbles and better foam.Thus the mystery behind the egg white is revealed, leading to a silky and and light cocktail drink. \n\nAt 5A5, they serve a particularly nice ginger fizz, which is a take on the classic Ramos gin fizz. It has a wonderful ginger-lemonade type flavor with a touch of carbonation. It's light in both flavor and texture. Another drink with egg white that I tried was the fog nog, which I guess is a spin on the classic egg nog. I wasn't particularly fond of the flavor because the cinnamon and maple syrup combination with the rum turned the entire drink into a Kahlua-flavored drink. Nevertheless, they have plenty of other drinks to try with egg white to tickle your fancy. They also seem to have a great happy hour menu.", "author": "Bailey Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "Lots of Asians! Like lots and lots of Asians. The ratio isn't that great here if you're a guy. The music is your pop top-40 mix. I like it.  I came here for a birthday so getting in wasn't bad at all, no line at 11:30. We also had a table so luckily we had a little area set for us. The dance floor is pretty packed. But the bar area isn't too bad. The restrooms are in the basement, with unisex stalls. And sometimes the light doesn't work, so you don't know of someone is in there or not. Long waits for the restroom, but it nice to strike a conversation here and there. They kick you out right at 2AM, and won't let you loiter in front of the lounge.", "author": "Arnold W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-02", "description": "One of my dearest & oldest buddies asked me of any lounges to celebrate her b-day that I could suggest.  I named a few that I've never been to, including 5a5.  Steve was her main point of contact that I gave her (I had tried to plan my b-day at 5a5 a month prior but had to cancel) & he was so accommodating.  They hooked it up with a complimentary table, comp champagne & a surprise slice of cake for her.  Though the venue is small & the table couldn't hold that many of us, the staff is so nice & the music wasn't that bad either....& NO COVER, but you must be on the guest list for admittance (no time cut off though)!\n\nThis nice venue mostly attracts the Asian crowd, but there is some sprinkles of diversity.  It does get stuffy in there as the dance floor is small as well, but I believe there are ins & outs.    Note: Table service doesn't start until everyone clears out of the dining room...this could be until after 11.  \n\nOverall, not a bad place if you want to go somewhere a little more laid back & intimate.  Thanks 5a5 for making my friend's b-day a great one!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-28", "description": "I'm debating between 1 or 2 stars. 2 stars? Story time.\n\nMe - \"Excuse me sir, is there cover?\"\nGuard 1 - \"No there isn't, but it's guestlist only\" \nMe - \"Ohh.. ok thanks\" \n\nOur friends were already inside, so we tried calling them. 3 asian girls in heels and skimpy dresses walk pass us \n\nGuard 2 - \"Sorry it's guestlist only\" \nGirl - \"ohh.. but our friends are already inside\" \nGuard 2 - \"ohh.. well I guess you girls can go on in then\" \n\nMy friend and I look at each other \"WTF?!\" \n\nMe - \"Hi, our friends are already inside, is there a way we can get in?\"\nGuard 2 - \"Are you girls in the guestlist?\"\nMe - \"Umm.. no.. but our friends may be, we're trying to contact them\"\nGuard 2 - \"Well, it's guestlist only...\"\nMy friend  - \"Well I went on the website and tried getting on guestlist but it said that girls get in free before 1030. I tried getting on guestlist just in case but it wouldn't let me\"\nGuard 2 - \"girls free before 1030..? Well, how about you girls step aside and wait for your friends\"\n\n-_____-\n\nOur friend comes out, talking to Guard 3. \n\nOur friend - \"Hi sir, my friends and I are in guestlist but my two friends over there (points) aren't. We're from LA and invited them last minute, is there a way they can come join us?\"\nGuard 3 - \"is it just those two girls?\"\nOur friend - \"yeah\"\nGuard 3 - hesitates. \"It's supposed to be guestlist only. But I'll take care of you guys. You gonna take care of us?\"\nOur friend - \"Ohh.. yeah forsure. thanks man.\" And my friend hands him a $20 tip.\n\nARE. YOU. KIDDING ME.\n\nWe go inside, it's a bunch of short fobby asians who can't dance taking over the dance floor and overpriced drinks = what a RIP OFF. The guy/girl ratio is freakin 3:1 right now and you don't even want to let 2 nice girls in?! SERIOUSLY?!\n\nOk I've decided. 1 star. The End.", "author": "Raquel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "Hi, my name is Cherylynn and I'm addicted to 5A5...\n\nThis is embarrassing and I can't believe I'm admitting this, but I literally get 5A5 withdrawals and it's the only thing that I look forward to every weekend. In the past 7 months, I've been to 5A5 every Saturday with the exception of several Saturdays because I had to go to birthday parties at other clubs. And, even when my friends and I try \"change it up\" and go elsewhere, we always end up at 5A5. \n\nI don't often write review updates, but my friends and I always have a great time at 5A5 so I thought I take the time to do so. \n\nIMPORTANT: \n1) 5A5 now enforces a guestlist ONLY policy. If you're not on the list, you will not get in. The guestlist often hits capacity a week before if not earlier, so plan accordingly and sign-up ahead of time. \n\n2) Security is very strict on dresscode. I've seen numerous people get turned away because they were in chucks or tennis shoes, so guys make sure to wear dress shoes.\n\nPROS:\n1) CROWD: Classy, upscale crowd in their late 20s to early 30s. It tends to be more Asian than mixed. In the 30 times I've been to 5A5, I've never seen anyone get kicked out or carried out because they were a sloppy drunk or rowdy. I've only seen one fight which occurred outside after 5A5 had closed down. If you're an avid club goer, you'll know that this is a rarity!\n\n2) STAFF: One of the most friendliest staff I've ever encountered!\n*The VIP Event Director, Steve is awesome! He's amiable, social, and quickly responds to email/text correspondences. Last month, one of my friends wanted to do bottle service last minute (as in 1 hour before 5A5 opened) and he quickly put that together. \n*Bartenders, Tina, Amy and male bartender (works at the main bar on the right side) are super friendly, quick and make a stiff drink. I don't even have to ask, and they already know my regular of Hendrick's Tonic although I did shots all night last night (BAD IDEA esp when I saw my call log this morning, followed by pics and videos my friends have taken *sigh*)\n*Bathroom attendant, Jose is the MAN! He always greets us with a cheery smile on his face and keeps the stalls immaculately clean and fully with stocked toilet paper, seat covers and paper towels. \n\n3) MUSIC: The Top 40s and Mash-ups always keep me dancing and fist pumping all night. Twice a month, they bring in a drummer which gives the songs a different dimension and spin to it. Thank you, Norris for the awesome spinning and always playing my annoying requests. \n\nCON(S):\nThe only con is 5A5 gets really packed on Saturdays and everywhere you go, you will be rubbing elbows with the crowd. \n\nThank you 5A5 for making every Saturday night like Katy Perry's \"Last Friday Night\". This Saturday night, it will be time to DO IT ALL AGAIN (minus the chicken in the bed)!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-23", "description": "- Bad crowd\n- Eh music\n- No one dances\n\n+ places to sit\n+ no line", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-02", "description": "SUPER DUPER ASIAN.  I have nothing against Asian places (duh, I'm Asian too...), but I love diversity....  Other than the fact that there really isn't a diverse crowd, it's pretty nice.  I love the decor and ambiance.  \n\nThe cucumber gimlets are really good here - strong too!  \n\nThere's the main area upstairs and there's also a smaller VIP area downstairs.  It's also a steak house, so the dining area turns into a bottle service area when it becomes a club.  \n\nThe bouncers are really nice (such a nice breath of fresh air), and the bartenders can be a bit snippy.. but they do a good job with your drinks.  It can get pretty crowded too since it's not a huge venue.  If you're going with just girls, they usually let you cut the line or you can hop over to the VIP line. \n\nOverall, it's not too bad.  I'd give it 3.5", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-14", "description": "I've been dragged to 5A5 on a number of occasions in the past month for late night clubbing, and each time have been disappointed.  There are always issues getting in, and, although the free cover is nice, the interior is usually overcrowded.  They have extra space downstairs with an extra dance floor and bar, but it's often closed, even when packed.\n\nGood:\n+ Free cover\n+ Location in North Beach and Financial District\n+ Music is pretty good, mostly Top 40s\n+ Often a well-dressed crowd\n+ Drinks are average priced (~$10 shots/cocktails). \n\nNeutral\n- The crowd has been mixed, sometimes very rude and other times friendly.  It seems to attract mostly mid-20 Asian Americans.  \n\nBad:\n-- Bouncers are randomly discriminate and have,on many occasions, not let my friends in for not having the right shoes, and I've been told that it's a \"private party only\" night (only to eventually get in by talking to the owner).  \n-- At last call, they shift to only selling shots (no mixed drinks).  I had to order a shot of vodka and a sprite chaser with ice to make my own drink.\n-- They shut down the party very early.  By 1:35 the lights are on, and they start forcing you out at 1:40.\n-- Taxis are nearly impossible to get in the area at ~2am on the weekends.  \n-- The bottle service area in the middle is always packed and hard to keep limited to your friends.\n\n(This review is for the 5A5 lounge / bar / club, not the restaurant.)", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "This is a review for the after hours night lounge/semi-club.\n\nI LOVE THIS PLACE!  If you love Asians, then this is the place for you.  I hear Asians saying, \"There are too many Asians there.\"   I have never heard a white person, black, indian, mexican, or any other ethnicity say there is too many of their own race at a venue as a negative comment..   Boggles my mind really.   Why we gotta hate on ourselves? \n\nEvery time my friends and I go here, it has never disappointed.  The ratios are good.  Lots of females that I feel are willing to dance with you.  The music is top 40 with some old school jams that night.   \n\nThe drinks are strong and delicious.   \n\nAlways lots of Asians.   I think its a good thing. :D", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "+1: Definitely a classier crowd since I and my friend seemed like the most inebriated people there even though we were taking it slow without all the long islands that night.\n\n+2: 5A5 apparently had about 7 birthdays going on the saturday we went. My friend and I felt a little out of place because we were probably the only two randos who didn't belong with anyone there.  But the crowd was chill and easily approachable, and obviously no one wanted to turn down talking to two hot chicks, especially one with a charming european accent.\n\n+3: We tried to make our own dance-space by clearing a table and standing on top of it (I forgot how this came about). The big security man simply helped us down and didn't kick us out. I celebrate every outing where we pull some antics and don't get kicked out.\n\n+4: I always love a packed venue. Though I want to apologize to all the sharp looking men whose nice suits I kept spilling my lemondrop martini on throughout the night (my own arm basically turned into a lemondrop popsicle too after I was done pouring all my drinks). I also love me a bunch of well-dressed men in suits.\n\n+5: Complete strangers who turned out to be the owner's friends drove us two hot messes home. Kudos for that and also for not deciding to just drop us off at on the side of some random road when we kept talking and repeating same things over and over again in probably really annoying pokemon voice in the backseat. Gotta love'em nice San Francisconeans.\n\n\nBest. Lounge. Ever.\nI'll be really sad if I return next time and find out that I'm secretly blacklisted from the place though.", "author": "Tian Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "We brought some cousins here for some drinks and to dance the night away.  The bf and I walked into the venue when dinner service was ending.  We saw a lot of people eating and promised each other to come back to try the food next time.\n\nThis place gets realllllllly crowded.  Barely any room to move around.  Since th place is small, you can see everyone in the room.  My cousin found another girl wearing the same exact dress and only standing 2 feet away from her.\n\nI suggest coming early if you're only here to drink.", "author": "Thuy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "this place made me feel old.  Mainly because I used to come here when it was Frisson.  \n\nAnyway,  enough room on the ground floor next to the bar for a dance floor (improvement) but very poor ventilation (sigh)\n\nDownstairs bathroom sinks are cool, but very little room downstairs for dancing (there is an extra bar and a little lounge area - about 5 by 8 or smaller).\n\nOverall, definitely a restaurant, not much of  a dance place.  Lounging here used to be really fun, except the drinks were really expensive.", "author": "Shinny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Not sure why there are two profiles on Yelp for this place... It's been more than a year since we had a corporate dinner event here. I also had dinner here once or twice by myself. The service is very good and I liked that they have coat check-in. Perfect if you go on a date. The food was also good. A little pricey but perhaps that comes with any fancy restaurant", "author": "Omid A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "After hearing a lot about 5A5 from some friends, I decided to take a few visiting friends here to grab a drink. It's a decent, contemporary place to lounge and/or have dinner. A bit smaller than expected upon walking in, but the ambiance is trendy and intimate. \n\nI ended up trying the white cosmo from the cocktail menu, which had a refreshing cucumber flavor. After sampling some of the other cocktails ordered, I quickly realized that this place does cocktails justice albeit being on the expensive side. \n\nWe also ordered a few small items to share:\n- lobster tempura w/sweet & sour shitake dipping sauce \n- truffle fries w/sirachi aioli\n- mac & cheese w/gruyere, mozz, and cheddar\n\nAll of the items were just superb! It was my first attempt at lobster, and despite being a fried version, it was SUPER tasty and left no aftertaste. However, at $23/plate, I expected more...the quantity was minuscule and appropriate for just one person since the amount of meat was minimal. Go figure at a steak restaurant.\n\nThe truffle fries were pretty standard, but cooked using the twice/triple-fried method, and hence quite crispy. \n\nThe mac & cheese was among the best I've tasted! The flavor of each cheese was readily apparent. Keep in mind that this is definitely a cheesy side dish, so great for sharing with the table since a few bites will satisfy. \n\nOverall, 5A5 had a great atmosphere not typical of places in San Francisco, so it's nice for a change. Don't forget your wallet, however, or you'll be washing dishes for a long while -- pricey. \n\nP.S. Valet parking ($8) is a great option. Street parking is tough to find in the area, and parking lots nonexistent.", "author": "Mansi A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-08", "description": "5A5 Steak Lounge Happy Hour review. Open seating area near the bar for happy hour. There's a piano right nearby that someone plays. Fancy looking bathrooms downtown stairs, but you'll have to take the elevator down to use it. Gets kind of noisy here if you want to have a conversation. Bunch of tables and seats in this place, which makes it kind like everyone's squished into this area. The dinner area is definitely a lot more roomy.\n\n== Food / Drinks ==\n\nAll appetizers are $5 during happy hour!\n\nQuality however range quite a bit. It's quite bleh to pretty good.\n\nThe truffle french fries and oysters on the half shell (came with 3) are good.\n\nRoasted mochi was pretty disgusting. Hard texture mochi in some kind of red sauce.\n\nPopcorn chicken wasn't really good either. Another dish to avoid.\n\nDrinks are pretty nice. Quite expensive at $11 a pop. I tried Tea Garden Cooler, which is really cool and refreshing. Definitely worth getting. The other drink I got... I don't remember but it wasn't that good.\n\n== Service ==\n\nPretty good service. Waitress came around a bunch of times to check up on things. Food takes a while to come out, but drinks come pretty quick.\n\n== Overall ==\n\nKind of an expensive place for happy hour if you're going for drinks. The appetizer price is pretty nice, but the quality is hit or miss. Overall, it's pretty meh in terms of a place to happy hour at if you want to have a conversation.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Great ambiance! I do love the decor in this place and it does make for a very comfortable lounge. Drinks were fair, but it is super hard to get to the bar because this place gets crowded! You seriously have to wait like 5 mins at the bar to get anything! \n\nMy friend got table service for her party and I thought it was pretty good (had a bottle of vodka, champagne, 2 jars of juice, and other bottle that I couldn't remember). But great table service. \n\nLike everyone else has said, this is a guestlist only, no cover, ppl dress nice and lots of guys! Guys to girl ratio was quite off when I went. Great for the ladies but not so much for the men? Sorry. Maybe if enough girls read the reviews and decide to go, it'll be more balanced. ;)", "author": "Louisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-10", "description": "Few of my friends did birthdays at the 5A5 lounge before and it never disappoints, so this year, I decided to have mine here. I requested a table without bottle, and Steve was very nice to save me a table. Oh yeah, they also brought out a complimentry mini cake for me. They are super nice because I was wandering around the dance floor, and they actually hunt me down to give it to me. That was very sweet of them. \n\nThere is no covers as long as you're on the guestlist. The lounge has a dj on Saturday, and the music starts around 11:15ish. The music here are pretty good, like those you would hear on the radio. The drinks here are strong, definitely worth the money. The atmosphere is pretty and classy.", "author": "Mandy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "This is a review of the bar only.   A few weeks back Wifey and I went to see a play at the Eureka Theater.   We arrived early so we went across the street to grab a cocktail at 5A5.   \nThe bar area was pretty decent but they had about 75% of it blocked off for some private affair.   Unfortunately, the bar space was taken by people eating at the bar.   Personally, I believe if you are going to a steakhouse for dinner, you should sit at a table and enjoy the full experience.   So, we ended up standing at a high table since there were no chairs.   After waiting for a while, I realized there was no cocktail waitress.   So, I go over to the bar, and lean over some folks to get my order in.   What we received were some small martini glasses.   Eh, ok.   \nThe drinks were fine, nothing special.   But I do have to complement the bartender.   She was the only one working behind the bar and she was really moving and trying to keep on top of things.   Kudos to you.   \nAs for the rest of steakhouse, I thought it was a little loud for a place that is an upscale location.   Also the decor seemed old and a little worn.  \nWill I be back?  Maybe.   I do like steak, but I think there are other places I'd like to try first", "author": "Bill C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-02", "description": "Lots of Asians. Or is it just me?\n\nNo really, look around you. I should have figured that out when I went to the bar and they said the best drink is a lychee martini.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "Music doesn't start till 11pm, after the restaurant guests are done,so if ur there any earlier..you will basically just be engaging in staring contests and see all the guys/ girls sizing each other up. Ughh kinda awkward. So me and my friend just stared back at people until they felt uncomfortable..hahaa\n\nBut...once the music starts and rounds of  shots start flowing 5a5 is the place to be! I love looking at all the pretty, well-dressed ppl. The lounge does cater to a more upscale crowd, so it's more rare to be seeing barely legal girls and immature asian club fights.\n\nPeople are wallflowers and don't dance cus they are waiting for others to make the first move. All good w/ me becus that means I have more room to dance! The night I went, it was pretty popping and everyone really looked like they were enjoying themselves. Would love to come back here for dinner and to enjoy a nice night with all my close friends.", "author": "Marie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "Nice lounge in it's design. Very classy.\n\nAs a restaurant, very nice also. Very classy.\n\nAs both a lounge and a restaurant; very pricey. Don't plan on coming here if you don't plan on spending some good amount of money. The food is good, just not cheap. The bartenders and drinks are nicely mixed, but the price of a beer is painful to the wallet.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "Came here with 2 of my girlfriends to check out this place around 10pm on a saturday night. They had an event prior to the lounge opening, so it was already pretty packed inside. \n\nThe venue is gorgeous, with ample seating around to rest our poor feet after a whole night in heels. The entrance to the bathroom downstairs is unisex, but the guy who works there will always lead you to the right stall so there are no awkward man-woman encounters. He is always extremely courteous and will make sure each stall is clean before you enter - definitely deserves a tip if you have a couple bucks to spare! \n\nAs for the drinks, I definitely recommend the lychee martini. It is delicious and fairly priced. On top of that, it even comes with a full lychee in your drink! My girls and I can sip on those the whole night. \n\nCrowd is a little older here - around 27-34, and most people mingle through talking about work and their jobs (and I've met some people here with pretty cool jobs!) \n\nDefinitely a good \"YUP\"-PY hangout. Now i just need to try a dinner here....", "author": "Gelene V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "I went here on a Saturday night. We had a table. So I guess a club is what you make of it. I personally had a lot of fun. I didn't deal much w security or staff so I can't comment on that. The dance floor is small and it was super crowded. I liked the crowd. People dressed nice and everyone for the most part was there to hang out. I would definitely come back.", "author": "Wil L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-21", "description": "I came here this past weekend for the \"lounging\" part of the night. On the plus side, there is no cover to get in unlike most SF places, but it was inssaanely PACKED!! The dance floor upstairs is tiiiny and it was definitely over max capacity. For some reason the downstairs was closed off for clubbing, even though it was a saturday night. Bad move. The music was pretty lame, mostly R&B type music, not much hip hop (which is what people like to dance to in clubs!) Asked for a glass of water and got an 8 oz glass of mostly ICE...could have been a little more generous, I mean it's FREE afterall. And it was really hot in there...wayyy too many sweaty people rubbing up on me and trampling on my toes. =(\n\nI didn't get to walk around at all because it was IMPOSSIBLE but from what I could see of the place it was nicely decorated. I would be willing to go back a different night to try the food, but I'm definitely leaving before 10pm when the \"Asian Invasion\" hits.", "author": "Cammy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "Second visit here following up on a previous review....\n\nVibe:  4.5 Stars - still a really neat place to drink and dine.  Sizeable lounge area and great crowd, although drinks a bit pricey.\n\nFood:  4.5 Stars - This visit was even better than the last, special recognition to the Hamachi Spoon Shots, the Diver Scallops, and the 4oz Wagyu Ribcap (wow)!\n\nBottom Line:  If a subsequent visit is this good and consistent, I will likely give this place 5 stars...", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-04", "description": "5A5 is probably one of the nicer lounges in the city that caters to a crowd of mid 20 year olds. \n\nI mean, let's face it. People go to the clubs looking for a hot party. They want to dress up and be with people that are dressed up. They want to be surrounded by hottie totties. Yes, 5A5 will provide that for you.\n\nBut man, talk about STUCK UP. A lot of wall flowers. The dancefloor is usually pretty empty.\n\nDrinks are a little pricey than what I'm used to seeing.", "author": "Azn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-16", "description": "5A5 is a swanky lounge/club with a lot of space to move around since it's two stories, although they don't always open the downstairs dance floor. I've been here a few times, and most of the time it's crowded, but the last time I went it was dead. They usually play a variety of music which is nice, and the majority of the crowd is usually Asian but it is fairly diverse. What weirds me out is the dark bathroom area downstairs-it's so hard to see! I prefer coming here to dine versus party. Parking can be difficult, but valet is available.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-07", "description": "It seems as if there's always a party of some sorts here, especially on weekends. The place has a nice ambiance, plus enough space for networking or chatting until it gets too crowded. Once the crowd of nicely dressed people arrive, space is limited.\n\nThere's main floor, then another bar and dance floor downstairs. The drinks are okay, though when we're here, they're priced as much as the other bars in the area. Overall, we felt cramped as places to chill & relax got scarce while everyone was lining up for drinks, so this after hours establishment wasn't memorable for us.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-03", "description": "3.5 stars based on their lounge on Saturday nights. \n\nI've been here twice already and the fact that there's no line, cover, guest list time frame and awesome top 40's music, i will definitely keep coming back. One thing I hate about signing up for guest list is that they would ask you specific questions that shouldn't even matter when going to a club/lounge.  They would ask the company you work for, your occupation, alumnus and who referred you! Why in the world would they ask that? It's pretty personal I must say. Are they doing some kind of a demographic poll? They really need to stop with that shit....maybe that why there's no line....hm....something to think about. \nAnyways, besides having to give out all your personal info on the guest list, they have great music and an interesting crowd (all Asians). If you like an Asian crowd, come here.  If you want a mixed crowd with bad music, walk 2.5 blocks to Bubble Lounge.", "author": "Irene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "Not remembering the last part of the night means I had an awesome time! \n\nI came here right before they stopped serving cocktail drinks and ordered the FA5 something or rather and I loved it! I love going out with my girlfriends and just having fun. Although it's a lounge, there were people dancing. \n\nThe crowd was kind of throwing me off. There were a mixture of younger people and OLDER people. \n\nI definitely was NOT enjoying the DJ though. The music sucked and there were a lot of random mixes that did not transition well....", "author": "Mai W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-09", "description": "I'm sorry, 5A5.  I must have mistaken your Vegas joint for a steak lounge in San Francisco.\n\nI've previously written about our experience with the bouncers at 5A5 on their restaurant page.  Steve C., the owner, wrote me to apologize and offered to look into the matter with security.  He came off as really professional, and even caring of his customers.  Sadly, not all of his staff acts or feels the same way about 5A5.  Take our recent experience into account:\n\nMy friend decided to celebrate her birthday at 5A5.  The day comes, and we all take the time to get dressed, pre-party, and head to 5a5.  The mood is high and we're all ready to party.\n\nThis all ends when we get to 5a5.  The bouncers at the door gave attitude to the bday girl and said she wasn't on the list.  Things get more ridiculous and straight up rude when my group walks up:  One of the bouncers loudly says to the others dismissively, \"ALL GUYS.\"\n\nThey don't greet us, or even attempt to ascertain who we are.  We explain we're here for a birthday--they check us off as if we're criminals and move us through the door like they're doing us a huge favor.  No \"Have a great night,\" and not even a smile.  We're here 30 deep of guys and girls, ready to celebrate and part with our money, and you're going to treat us like we're unwelcome?  \n\nThings only go from bad to worse in terms of service when we get in.  There are three roaming security guys on the floor.  Two were cool, friendly, and professional.  The other guy--a tall white dude with a Justin Bieber haircut, was completely rude and in your face.  A simple, \"Hi, sorry to bother you, but this area needs to be kept clear to ensure everyone's safety,\" would have sufficed.  Customer relations training is definitely lacking here.\n\nYou can have the best venue and the best goods to sell, but if your people are acting like untrained apes with sticks up their asses, you're going to ruin your brand.\n\nOn the plus side, 5a5's bartenders are good.  At one point, I overpaid for a round and was about to walk away when one of the bartenders got my attention to give me back my money.  She could have easily just palmed the cash, but she didn't, so that says a lot.\n\nOverall, though, we're not going to forget the rest of our experience here.  You know how the saying goes...\"Fool me once....?\"\n\nTwice is enough.  Never again.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-11", "description": "First off, we came here to celebrate a friends birthday. No we didn't get a table, but we were on the glist. They made it seem like we had to be with a party with a table or something which I didn't understand because they let us in anyways?!?!\n\nSecond, I usually focus on the venue and the music more than the people. But this time I was really expecting a good crowd since they tried to make this place SUPER exclusive. I thought I'd see DROP DEAD GORGEOUS looking men and women. BUTTT the crowd was kind of eh not so hot.... there was not one guy (or girl) that caught my eyes AND my standards are lowered when its dark and I'm buzzin'\n\nThird, who said that people here were in their mid twenties? Mid twenties is like 24-26. I'm pretty sure everyone here was in there later twenties... if not 30.... I mean I don't have any problems with older crowds, but if you come with a bunch of 22-23 yr olds... you're going to feel a little bit out of place..  \n\nFourth, people here are sort of boring. I literally felt like we were the life of the party. But then again, maybe this place is \"classy\" so people here don't like to get down? They just like to stand and look pretty? and this place is a \"lounge\" not a club. Why the eff is there a dance floor?\n\nAnyways, my conclusion is... if you're just trying to have a good time, then 5a5 is a good place to go because its free and the music is good. 3 solid stars for being an average SF club. I had fun because I was with good company. BUT be warned!! ONLY come if you're going to stick with your friends. If you're trying to meet new guys or gals, then I'd go elsewhere.. the crowd here is just ehh... nothing special. There's also some bitchy ass girls here. I don't understand why though, its not like they are hot or anything.", "author": "Becky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "I believe that it would be a yelp faux pas to write a review on a lounge, as each experience would be different depending on the outcome of the nights debauchery.  However after frequenting this establishment several times to remove oneself from the weekly toils of life's obstacles, it is only befitting that I rate where I find my release.  \n\nAt first Glance:\nI was taken in at the awe and beauty of the decor and quiet location of this lounge.  During the day light hours, it's surface is a restaurant, which I have yet to partake.  However the upscale ambiance is warm and appealing to the eyes.  One can only admire the nuances, from the fire projected on the wall above the bar to the low vaulted dome lit up above the table service area.  The staff is well dressed and professional looking.  The slight walkway between the dance floor and steps that lead to the restrooms could use a bit more space, however it is suitable to limit traffic.  \n\nThe Bar:\nPleasingly the bar at 5A5 is stocked full of the candy that each one of us childlike adults could ask for.  It is clean and with the exception for the pillar that is centered, it is accessible to even the most intoxicated individual.  There is a small bar downstairs that does provide some ease on the ground level, however is only open on occasion sadly.  Although minimally staffed, the wait is within a 5 minute or less time frame which can only be explained by the lack of courtesy by my fellow patrons.  \n\nWhen examining the drinks, needless to say I was disappointed.  They are inconsistent in alcohol to mixer content, although the prices are $9 per cocktail, which you'd expect.  Some with fruit, some without.. two straws to three, to one. Minor yes, but consistency is always a sign of a great establishment.  \n\nThe Bottle Service:\nAs with the majority of the table service, it is opened within a certain time so as not intrude on the lingering dinner guests.  However in this case, it was more forgiving that most.  Although adequately priced and served, one must keep in mind that if you tell a customer it opens at 11, please be courteous enough to open at 11.\n\nThe Smoking Area:\nWhen searching for solace away from the inebriated masses, the smoking area at 5A5 is nice.  Quiet and within the confines of the lounge, it provides a nice place to socialize or make a call.  It usually is at an ambient temperature and clean.  However, please fix the bench.  Thanks\n\nParking:\nIf you get there early, you should only circle the area a few times.  If you lag... well, you already know the deal because I have no doubt you always lag, so good luck to you in that sense.  \n\nOverall I do enjoy the atmosphere at 5A5.  I highly recommend it for the more mature palate and those with distinguishing tastes.  Dress well and be prepared to sign up for the guest list on the Monday prior or you will feel the demeaning nature of being turned away while trying to impress whomever you brought.", "author": "Adam Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-07", "description": "This is a review for DINNER not just drinks.  Anyone can make a mean $14 martini in a metropolitan city, hell, even San Carlos can do it @Town.\n\nI went here before I started eating red meat again so I can say they do have fish and chicken, the fish was pretty incredible from what I recalled...\n\nThen I had one of the better filet mignons ... next to Harris. Pretty impressive food but $12 sides should be more generous in my opinion.\nI understand that quality outweighs quantity but perhaps learn from the chef over at Epic?!  Both can be done simultaneously, and when done right, it's quite an art.  :)\n\nEverything's a la carte so your steak and sides will run you a minimum $70 a head, not including drinks.  Went here for a friend's bday get together. $115 a person later on the split post tax y propina, I didn't think it was worth it.  Neither did 1/2 the others.  \n\nI may give it another chance.... But not to be on their 'guest list' for the steak house turn club post 10pm.  Please.  I am the guest.  It's not the other way around.  \nDid everyone miss the memo that there's a ton of places in SF that would be happy to let you drink and dance without the pretension of the list that makes lame people feel special for a night.  Just sayin'\nSolid 3, potential for a 4 but who if you're reading my yelp, you might the notion that I exercise being fair so just take it for face value and try it yourself.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "Come here to hang out with friends and to just release stress by dancing to music....  The place is small and there's not too much of a dance floor.  \n\nThe place was busy on a Saturday night as there seemed to be an event party happening.  \n\nI don't have a favorite drink here, but the girls seem to enjoy the Lychee Martinis here.... so, for your ladies out there, you should try them here.....", "author": "Edward L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-20", "description": "(HAPPY HOUR REVIEW ONLY) The food is aight and the drinks are fine too. The best draw is the HH special, and the nice atmosphere. It is a chill environment to have a drink and catch up with someone before the dinner rush. I would come back but mostly because for the deals.", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-15", "description": "I can't believe I haven't post a review yet!\n\n5A5 is my FAVORITE restaurant in San Francisco. Hands Down.  I come here for special occasions, and always recommend this restaurant for rehearsal dinners. \n\nPros:\nLove their beautiful ambiance.\nthe Hamachi shots 10 Stars\nMAC and Cheese -- truffle oil..........YUMMMY!\nthe Prime Rib... i dare say, better than HOPR!\nthe service, always attentive and fast\nthe price - it's well worth it.\nthey have valet Parking -- what's not to love!\n\nYou can call or make reso's on opentable. Go on a Saturday for the fun and drinks. Good looking people. Why go anywhere else?\n\nThanks 5A5, I'll be back!! (again)!", "author": "Braden B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-18", "description": "The lounge is gorgeous, and the music is usually pretty good - you'll get a good mix of top 40s and some oldie R&B jams. It's not too hard to get a drink (from what I've been told :P), and parking was super easy. \n\nThere are a few hiccups though. The dance floor is really small and can get pretty crowded. Depending on the night, it can be super hard to get in or you'll breeze right through. AND worst of all, the music doesn't start until the dining crowd leaves, so if you get there early, you just have to stand around and wait (and drink). \n\nAll the times I've gone, the crowd tends to be HEAVILY Asian - which is a plus or a bad thing depending on your cup of tea. \n\nI generally have a good time when I come; I will be back at some point.", "author": "Linh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-13", "description": "If you're in the mood to fist pump the night away, this is the spot for you.\n\nGave this place 2 stars rather than one because the people that work the door are really nice. You too, bored security guy at the back.", "author": "I. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-27", "description": "Cockfest 2011.  Tons of dudes everytime I come here. So I stopped coming.  If you're a girl, might appreciate this place.  I think people come here since no cover. \n\nDrinks are okay priced, but there's only 1 main bar, and getting a drink is kind of a pain.  The \"dancefloor\" is cramped as hell. \n\nIt's the kind of place to stop by for a bit, then move on.  Not worth to spend the entire night.", "author": "Yangfan X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-03", "description": "Arrived at 10:30 to beat the crowd and possible lines, as I've heard this place gets packed once it turns into a lounge. Alot of customers were still dining, so it was pretty quiet as we waited for them to finish up. That's fine, I understand that you are a fancy steak restaurant first and foremost. But the DJ didn't set up and no music was played until 11:45. YES, everyone stood around awkwardly with a drink in one hand in a quiet restaurant for over an hour. \n\nThis is probably a great place to meet people because everyone was definitely dressed to impress i.e. suit sand ties for the boys and designer handbags for the girls. However, this is not the type of place to dance and have a good time with your friends. No amount of alcohol could compensate for the lack of energy and ho-hum music and \"DJ\". Not sure if I'll be back, unless it's for the steak.", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "I've been here quite a few times in the past two months, and I was not disappointed. It wasn't until two weeks ago when I decided to book a bottle and host a small gathering for my graduation party that I felt extremely well-taken care of - from the doormen, to the hostess, to the server, to the VIP manager/owner that I eventually got to meet. The bottle was decently priced - not more than $280 for a Liter of Goose with tips and gratitude included, with a complimentary bottle of champagne and a surprise congratulation piece of cake! What?? Not a birthday cake - a cake to \"congratulate\" me! So you see, most of the stars go towards the service.\n\nAs for the music - it was so-so - there's a DJ that plays top 40/mash ups, not my favorite I would say, but music is music when you're drunk. On Saturdays, they have a random drummer on stage - it's random, but cool, and it doesn't really bother me. \n\nI really enjoy the ambiance and atmosphere. This lounge is classier than most places young 20s go to in the city - that's because it serves a more mature crowd (mostly between early mid 20's to late 20's on Saturdays). It reminds me of a lounge you would find in Santana Row in San Jose - if you're familiar with that area. Pretty chill, not too many lousy drunk people (unless there's a bottle involve, and in that case - you'll be like my group and I, probably the loudest and most-unclassy ones in the crowd). Speaking of the crowd, if you're trying to find amazing dancers here - you probably can't. There ain't no bboys that can drop it like its hot, so if you don't see anyone dancing at 11:30 yet - do yourself a favor and start the party! I know we did!    ;)\n\nI heard the Steak Lounge is amazing - I'm planning to try that out one day soon and I'll be back to review it!\n\nThat's all!", "author": "Ting C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-22", "description": "The space and environment is pretty nice but it just really isn't my thing. the crowd seems to be a bit more older than I would like it to be. Drinks are pretty pricy here compared to other places. The crowd and hype isn't as intense as I would like it to be.\n\nThe place was dead when we were there. We had to start up the dance floor even though we came here really late. When we got there, people were just standing around and no one was even dancing... Don't you go to clubs to have a good time? I guess not. \n\nThere are certainly better places around this area but I wouldn't mind coming back here.", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "Not a fan. Atmosphere is so so, food is kinda bleh. It's just not what I would expect from a steakhouse, no offence to the chefs and I am sure it's more of a management thing, but salt is your friend. I have such a hard time writing reviews for crappy places because I feel it's not the staffs issue at all, I mean again, service and food is managements thing, everyone else is just there trying to make the best of things. So staff I give 5 stars , they are seriously trying. Hopefully management takes notes and can maybe listen to their staff for some ideas.", "author": "Ian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-25", "description": "*WARNING: KEEP YOUR RECEIPTS*\n\nI came here on Saturday 1/22/2011 for a friend's b-day party.  +2 stars since we got in quickly for table service and no cover charge.\n\nNow, on to the thing that makes me wag my finger.  I ordered 4 shots of straight patron - doubled up.  The total came out to $80.  I give the blonde bartender my credit card, add $5 tip to the receipt and leave both receipts with her.  Why?  Because when I'm partially inebriated I tend to become an optimist and trust everyone will do the right thing.\n\nFast forward a few days to where I am reviewing my credit card statement.  Staring at my face is bold, type-12, Arial font stating I was charged $88 - $3 extra from what I wrote.  I have absolutely no problem with this because it's only $3 but how many times has she done this before?  What about just that one night?  Is it rampant throughout the entire establishment?  If she jips off 10 people that's a free $30 for committing fraud!\n\nAnyway, I like 5A5 and will definitely come back for my own b-day but the whole thing is such a turn off.  Oh, and just for safe measure to my fellow Yelpers....\n\n*WARNING: KEEP YOUR RECEIPTS*\n\n==========\n\n-3 Stars for credit card fraud\n\n*2 Stars out of 5*", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-09", "description": "Until 1940, over a million Chinese immigrants passed through Angel Island, where many were forced to live in decrepit living conditions before being denied entry to the United States.\n\nAnd 5A5 Lounge is about the closest thing I'll ever get to being in a refugee camp.\n\nLast night was the second time I've been here, and it was much more crowded tonight than it was the first time I came here. With the number of people and the music, it definitely has more of a club feel than a lounge. There's a bar that's impossible to get to (tip: double fist it, so you only have to take one trip), a small outdoor smoking area in the back, and trendy unisex bathrooms downstairs. People tend to get pushy as the night wears on. \n\nPersonally, I was never much of a clubber. And the older I get, the less I care for them. Standing shoulder to shoulder with a bunch of drunken douche bags searching for ass isn't my idea of a good time.\n\nAnyway, if clubbing is your thing, or you simply have a thing for lap chong, you've come to the right place.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "This is my new Happy Hour hunt ! \n\nPROS:\n1. Classy look and a very comfortable lounge. \n2. HH until 7:30pm with $5 beers, wines, cocktails. \n3. $5 appetizers are a steal !! Every time i order the truffle fries and chicken yakitori, both are delicious, the dip with the fries is heavenly!! Also $1 oyster shooters is a definite try for such cheap price!!\n\nCONS:\nI just wished they had more options of cocktails in their HH list.\n\nNote:  If you dont want to sit at the bar, its always better to call up prior to make a reservation for the lounge seating, esp for large groups.", "author": "Payal B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-01", "description": "Only been once.  Good music, no cover all night and fun crowd.  The place was a lot smaller than I imagined, but still a good size.  They played top 40s music the night I went, so I had a good time.  Wouldn't say it's the best lounge out there, but it's definitely nice and dim.\n\nWould come back on a night if I'm feeling like I just want to lounge around and not dance much.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-28", "description": "I would give this place a three star, but I'm taking one off for a bad experience. Those darn hooligans!\n\nAnyways... Gave this place a try for the first time on last Saturday night. There is no cover charge, but there is a strict dress code and you should be on the guestlist. I was stunned how large the place is, but not amused that the restroom is downstairs. Plus the crowd could have been bigger. \n\nThere were two dance floors and two bars. The second dance floor is in a small room downstairs, which is a bit odd but never gave it a go. And If the main floor's bar is overcrowded then it's best to try the downstairs' small bar. The DJ was alright and played few  top hits but it was annoying how there was a random drum player who randomly beats the drums. It was really unnecessary.", "author": "Zha L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-14", "description": "I came here on the dine about town but added a few appetizers to top of the day. \n\nThis restaurant has too long of a wait.. I didn't really like that...we had our reservation for 8:15pm,, but got sat down at 8:40... After that, it took a long time for the food to come as well. \n\nI had the sashimi wagyu beef for the appetizer. It was tasty, though there was this smell in the sauce that I didn't really like; it kind of reminded me of the nails shop where I get a manicure... ;/ ish not really a fan of that when I'm eating...\n\nThan we had the romaine salad, which was really good. I liked it alot. \nwe did get a complimentary soup thing which was really nice.. \nWe also had the daikon soup which was really tasty.\n\nfor the main course, I had the new york strip steak that was okay. i would give it a 3.5 star because it was good but not like a WOW i must get kind of steak. \n\nfor dessert.. we had the creme brulee ginger carrot cake spice thing. and the chocolate cream cake thing~ both were ok. \n\nAfter all that.. they gave us a complimentary wasabi cotton candy.. WHICH WAS like uh.........??? lol but pretty interesting. \n\nThe restaurant itself had a really nice atmosphere tho :)", "author": "Christina K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-24", "description": "I came here with a large group of my friends on the night of March 5th for my friend's birthday. We were all dolled up and ready to party because we opted for bottle service and got there early.\n\nWe arrived at approximately 10:45ish and were let in the door. When we approached the area for table service, they told us we could not get seated until 11:00pm because they were serving dinner until that time. I hadn't eaten yet, so I asked the hostess if I could see a menu (since she said they were still serving dinner for guests). She then tells me, \"Oh, sorry, we're not serving food anymore... would you still like to see our menu?\"\n\nSorry! But why would I want to see your menu after you just told me I couldn't order from it AFTER telling me we couldn't sit down because you were still doing dinner?!\n\nWhat irks me most is that the table that we were assigned in the back was already empty. Anyway... to kill time, we went over to Bubble Lounge to relax and meet up some other people, and then close to 11:10, we walked back again.\n\nThe bouncers were a bit rude this time around, even though we were just in there 30 minutes earlier. We got in, got to our table, and it wasn't even set up! I don't know how long we even waited for our actual bottles to show up. I felt so bad for my friend the birthday girl. She spent a bit of the evening running around looking for the person who helped her with making the table service reservations and getting people into our party (apparently a bit of the list was missing).\n\nIf you've never been here, there's a small dance floor downstairs. Upstairs, it just gets way too crowded to enjoy any semblance of dancing. Getting drinks is pretty hard too because of how congested the bar area is. I also think they don't monitor the table area well because I am almost for certain a lot of random people were taking liquor from our area. Also, beware of the many d-bags. Sorry to use that word, but sheeesh, when you see the guys here, how could you not?!?!\n\nAfter all of the hoopla, we enjoyed the rest of the night. It just would've been a lot more fun if we didn't have to deal with the earlier problems in the evening.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "Love the ambiance and service but the steaks were so expensive yet unremarkable that I had to write.  We had a large group of 12 for a bachelor party and all felt that the steaks were not steakhouse quality meat.", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-11", "description": "Organized a double birthday party this past Saturday at 5A5. What can I say... I knew we would get a couple of tables and a bottle of champagne. What I was really surprised by was the surprised birthday cakes for both of my friends. Wow is all I can say for their service and place itself. The manager who helped with this party has been helping me with a few others too. He just keeps on moving that bar higher and higher each time! From the guest list, to the champagne, to the tables, and to the cakes. Each step of the way, I felt like we were very well taken care of.\n\nDefinitely a place to go for special events and occasions!", "author": "Eva Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "I figured it out.  Asians will congregate at places where there is no cover.  That's why this place is packed with Asians, just like Bubble Lounge.  It seems as though the crowd that graduated from the Element parties (now their late 20s and early 30s) party here.  The table seating is clever and decor is nice but the crowded circular walkway means spilled drinks and rubbing up against everyone until you either leave or go to the bathroom or outside (they have heaters!).  My friend and I both got drinks spilled in a close proximity to us (2x).  And then this one guy got his shirt button caught on the back of my lace dress (that's how CLOSE everyone is).  We arrived around midnight and didn't have to wait in line and there's $10 valet right out in front.  Would come back, when it's less crowded.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-16", "description": "I was going to see Sweeny Todd at the Eureka across the street and wanted to meet friends for drinks and appetizers before hand.  Yelp showed this place as the closest and reviews were decent and it looked like a nice space.  Let's give it a try.\n\nI would have to agree that the space is very nice and the cocktails were great.  The appetizers we ordered did not live up though.  My two friends and I ordered the steamed pork buns, truffle fries and the popcorn chicken.\n\nThe pork buns were awful - worst ones I've ever had.  I think they were microwaved vs. being steamed.  They were incredibly hot and parts of the bun were rock hard.  We only ate a portion of one and didn't even touch the second one.  The truffle fries were not cooked evenly.  Maybe half of them were cooked fully and the rest were just mush.  The popcorn chicken was cooked but didn't have a much flavor to it.  I expected some spice from the shishito peppers but it wasn't there.\n\nThe staff was fairly attentive on drinks but didn't check in on the food at all.  For being a $$$ restaurant is was unimpressed to say the least.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-08", "description": "*I've only been here for a happy hour, so I can only review that, not the food.\n\nThe good thing is, they have a pretty good happy hour special (beers were $5 or $6 depending on what you get).  The problem is that the decor is just generic \"fancy\" with no personality.  The only food I tried was the truffle fries, which were pretty good (I'd give them an 8 out of 10 rating).  \n\nIt didn't get to crowded (I went on a Friday around 5:30), and I was able to secure a seat.  If you work in the area and would like to grab a beer after work without having to fight your way to the bar, this is a decent spot.", "author": "Jake W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-04", "description": "This is an upscale lounge complete with rich decor, dim lighting and a fancy cocktail list.  It's enjoyable but crazy crowded on a Saturday night.\n\nWe came in early before you needed to wait in a line.  A group of us got a great corner booth that was comfy and rich with dark wood tables and faux croc bench.  A fake fire burns on a screen behind the bar and it's cozy to sit and chat and watch the groups of people get larger and larger as the night progresses.\n\nThe cocktail waitress was very attentive and sweet.  I ordered the French A5 cocktail.  It was really interesting with vodka, champagne, grapefruit jiuce and chamboard but at $12 a piece I had only two over the evening.  Nice presentation though and it's always fun to try something new.\n\nAs the night progesses they open up the lounge area to be a dance floor and their is plenty of room.  Took a while though to get the music going and when we left around 11pm everyone was still standing around as the DJ just started to spin.  Shoulder to shoulder packed .  . . and as we left there was a crazy long line waiting to get in on a Saturday night.\n\nBathrooms are on the bottom floor, dark, dim and coed.  Later in the evening there was an attendent and everything was kept quite clean.  \n\nInteresting experience but I don't know if I'd personally wait in that crazy line to get in.  So come early or be prepared to wait.", "author": "Sabrina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-08", "description": "I loved this place but with some things I only gave it three stars.... I was also having a great time with Patron Silver so I loved everything anyways....\nWe went here for ladies night and it was so much fun! They require a dress code and everything inside is very nice- it's vibe is very upscale and classy. \nPlus the place is always packed so you never wonder if this is the place that makes you wait in line outside to finally get in and find it empty. But if you're a girl, you don't have to wait :D \nThe problem we found was that it was so busy that once you made it up to the bar, there was only one female bartender so she hit every guy around us before I started shouting and waving my hands at her to get her to make us drinks. Very frustrating. There's a bar downstairs too but its just as busy so you might as well stand there waving your money until they finally get you something. Boo. \nTheir website show a lot of club pics with mainly white people in them, but the night we went it was filled with Asians so I don't know the type of bar/lounge it is for those who have a preference. \nOne thing I'm not a fan of is that the lounge and dance floor are combined. It's super squishy when you want to dance and people are pushing and shoving their way around you. \nThe good thing about this place is that the type of people that went there were really nice. This may have to do with the fact that it's more upscale. I hate those places where the guys are creeps that sneak up behind you to try and dance with you or won't leave you alone when you tell them you're not interested. Ugg.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "Aww man, I thought I checked in here, but it was for 5A5 Steakhouse, not 5A5 Lounge. Fail. -_-\n\nBlah! Anyhoo, pretty cool place to hang out on a Saturday night. Best part of it all: no cover charge or lines! The venue is really pretty with a cool unisex bathroom and plenty of toilets! :D  Top shelf shots are ~$11 each, kinda pricey, well cocktails about $9 each. \n\nMusic is decent, top 40 mash ups usually.  It doesn't really get \"poppin'\" til about 11:30 I'd say. Crowd is mostly Asian, young, working professionals. How can I tell? Because I usually run into my college buddies there - ones I haven't seen for a while. That's pretty awesome in my book. :)\n\nThere's usually plenty of street parking if you get there before 11pm. If you get bored, you can always migrate to Bubble Lounge down the street and if you're hungry, Sun Hong Kong is just up the block. 4th meal! Woooot! Oh, and if you still need more, the strip clubs and peep show booths are just up yonder as well. ;)", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-03", "description": "Came here on a Friday night after dinner. The first impression was: What's up with the DJ. There was no music at the beginning, he was just standing there with his head set on and staring at his mac computer......... and that was almost 11.  After he finally started the music, the volume was so low that I didn't feel like I was anywhere close to a lounge. What sucked more was his music was soooo poorly mixed, wait, no, I take it back, his music was NOT mix at all. He stopped the previous music for transition to go to the next. @___@ So the whole time I was questioning why was he so stingy about his music and how did he get the job??!!!\n\nThe second impression was what's up with is crowd? Is this some kind of business social night?? Or I'm just end up at the wrong night. A bunch of mid age business looking men hanging around, talking... Well, of course coz there's no music! \n\nHeard there was a girl's bday party. And who knows her? Maybe she invited half of her Facebook friend who she didn't even know ....\n\nI think I should try their steak next time.", "author": "Serena H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "Some fridays I want pitchers of bud light and some nachos.  For my classier fridays, I am loving this as a new happy hour spot.  Close enough to the financial district to walk from the office, but far enough away to avoid the crowds.\n\nHappy hour is from 5 - 7:30 and offers drinks and apps for $5 (such as truffle fries, french dip w/ au jus, and hamachi shooters).  They also have a daily bite for $2 (beef kabobs, lobster dumplings, etc.).  \n\nIf you can make it for happy hour, I think this is a great spot for a classier alternative to nachos and beer.", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "Saturday, 10:30PM. Club/Lounge review.\n\nTriumvirate birthday celebration with three college friends from LA. Gotta do it big for these Hollywood folks!\n\nC's Notes:\n1. No cover, AWESOME.\n2. Expensive drinks - it's okay though, they didn't charge cover and I was buying for good friends\n3. Classy dress, mixed with the Yay hipsters\n4. Decent deejay: top hits in the mix early, winded down with weird electronic/80's mash (not as fun to dance to)\n5. Venue accommodated our party of at least 100 (took over all the dinner tables)\n\nAnd then...?\nAdd this to your rotation of lounges. Get your boogie on early!", "author": "Chuck N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "Cool place and great service.  A pleasant surprise for a Monday night.  Worth heading over for a drink, especially during happy hour.  \n\nCrowding on the weekends doesn't surprise me - good place.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "Sexy. Sultry. Classy.\n\nCame early while dinner was wrapping up to beat the line. Boys wear dress shoes. The workers in the front frowned upon boys wearing sneaks.  5A5 has a modern decor. Dark rich wood, beautiful lighting display, plush white seats and chill atmosphere. The birthday boy reserved the back area for bottle service. Had plenty of chairs, long couch, and little open area to walk around/dance. Cocktail waitress was very friendly, however lacked on replenishing items for the bottle. \n\nDJ played top 40. He did not really play good music until after 12!! Seriously! He did however saved the best song for last, the Dougie LOL. The open lounge area in the front was where most people hung out at. It was crowded and hard to walk through. The crowd was Asian. Was not diverse at all but I was not complaining. There is a smaller room downstairs with an smaller bar as well.\n\nBathrooms are so pretty. The bathroom attendent picks where you should go and keeps it clean. I like how it is a unisex bathroom. They also have a smoking room inside the lounge with glass windows so that they could still see whats going on inside.\n\n5A5 is very chill. It isnt really geared to club heads who like to bump and grind on each other. People can sit and chat or mingle on the side and two-step. I would reccomend this place to anyone.", "author": "Geneve V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-15", "description": "So boring! My friends and I went to this place because we had heard they keep it classy. It's literally like I've stepped into Beijing. everyone here is Asian. The bar is unbelievably crowded, and there's no dance floor. everyone just stands around and judge each other. Super lame!\nI would like to try the restaurant during the day though. I heard the food is great, so I don't want to write this place off just yet.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-13", "description": "Drinks. Sadly they stop mojitos at 11pm ish. I wanted to buy my friend a mojito, but they said no sorry we don't make mojitos. THEN WHY DIDNT YOU tAKE AWAY OUR DRINK MENU??? tis okay. \n\nMoving on - I was pretty gone and the pretty lights made me happy. The music was good, but my friends don't agree. I met this guy that was the subject of my weekend. So I guess it's an easy place to meet people and dance dance bc it's sucha small dance floor. I tried to make space and dance on the table, but i quickly fell and left my home boy dancing by himself. LMFAO. security was AWESOME - took him down right away. that fool. hahah :_)\n\nApparently everyone looks hot at this lounge?", "author": "Jenna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-23", "description": "Location: 5A5 Lounge, 11:00pm, Saturday 1/22/2011\n\nScene: random Saturday night.. random get-together with cousins.. random drive to SF, clear starry night\n\n.. so our 4 pack drives to SF to get our dranks on. call up the bro, and check where he's at. 5A5 it is. find VIP parking right up front and walk right in. NO COVER! NO DRESS CODE! whhaaaat?\n\nbut walking inside, i already feel like it's a sardine can with extra hot tabasco sauce, and i'm the next sardine to be stuffed inside with my head already torn off. its incredibly impossible to move around here. shoulder to shoulder, and everyone's arms up with drinks in hand trying not to spill. \n\n2 bars: 1 upstairs to the right with the yule-log type thing on the screen, and 1 in the downstairs basement. by close to 1pm they ran out of ingredients to make me an AMF. eh? really? so instead they make me a nasty long island with whatever leftover drippings on the bar counter they can scoop into my glass. \n\n..and its pretty much the asian crowd. the ones that grew out of the whole club NVs and Temples, etc etc. \n\nmusic wise: Black Eyed Peas tracks on heavy rotation back to back upstairs. downstairs, you've got the 80s/90s/2000s mashup mixes.  the music shutoff for a good 15 minutes and i thought it was closing time... only to find out that they ran out of tracks to play on their playlist.. or something like that. but at that point when the music shutdown, half the crowd started to leave.\n\noh and one more thing. its a sausage fest. more fellas than ladies.... (ladies::creeper alert! haha)\n\n3 stars for it being a random night with cousins, sis, and bro.\n\nWOMP WOMP.", "author": "Summer R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "Came here one time with my siblings and few friends. Upon entering, you can tell this isn't one of those cheap dirty lounges, definitely more upscale. Prices are a bit high, but typically for a lounge, definitely not bar prices, but no complaint here.\n\nThey offer a dance floor and areas to sit, no cover charge the night I went(Saturday, I believe). The average age there is around 25 if I had to estimate, so if you prefer a younger crowd, this might not be the place for you. \n\nI took off 2 stars because with lounges I typically like a better crowed, not something they can control, but I'm not rating their restaurant just their lounge. Everyone was kind of to themselves, except with the people they knew, making the environment not so fun. The music that night could of been a little better as well, but that's personal preference.", "author": "Austin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "This review is for happy hour which was quite nice, especially the nibbles.  Truthfully, I'd give four stars to the food and three to the drinks although I probably shouldn't complain at the price!  It was quite affordable!  We tried the happy hour wines, a French Sparkler and CA Chard which were OK, the Beaujolais was the best of the three.  The food was the star...  The French dip was quite generous for $5 and the little lobster dumpling, $2 was delicious.  I don't remember how much the French fries were but they were quite yummy too.\nNext time I do happy hour I think I will stick to the happy hour menu but order wines off the regular wine list.", "author": "Kara H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-23", "description": "Decent place.  Loved their long island, which is rare, usually bars make them nasty but it was super delicious and packs a punch here.\n\nWent on a Saturday night, was not too crowded which is great.  Music is decent, typical billboard music.  Heavy Asian crowd, though, Asian owner.  Girls definitely dress up in tiny skirts, etc. Bouncer supercool.  Overall good experience, would be back.", "author": "Li Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "A few locals took me here during my brief visit to SF last month. \nLuckily, we went during restaurant week and got a a good deal on the food, because I would not have paid much more for the food we were served. \n\nNot to say it was bad, it just wasn't anything exemplary. The steak was decent, but I've had better. \n\nI AM a huge fan of whatever culinary gold they soaked those fries in, though. If I lived in the area, I would come back for them. \n\nBottom line: It's not worth the money.", "author": "Caro D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Neat!! Live drummer on the band floor with the dj!! That's new!\nDrinks were alright I needed a bigger buzz\nBut security was fine and there's a large dance floor\n\nThere's downstairs too If you Lookin to chill\n\nSmoking section in backyard is what I didn't like. The\nSmell is too strong", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-29", "description": "This is a really cool place, with a trendy vibe & great atmosphere for dining or drinking. They have a great Happy Hour, with great prices on drinks & small plates. The $5 hamachi shooters are the highlights, but literally, you could make an early, cheap dinner off the tasty $5 HH menu. Great date place.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-02", "description": "This review is for happy hour only.  We've been here for happy hour before and did not have any problems on previous visits but on our most recent visit last week,  the quality of the bar food had significantly declined.  We are not food snobs but even so things were noticeable.  We ordered the chicken wings and the meat was tough and tasted old.  They also offer this malay filet skewer dish and that was dry and tasteless.  The highlights were the french dip appetizer which was actually good, and my husband liked his happy hour pinot.  It's been awhile since a happy hour has left a bad taste in our mouths, especially at a place like this, so we were pretty disappointed.", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-16", "description": "This rating is for the lounge, not the food/restaurant (even though it's the same place).\n\nSo I've re-written this entry a few times and have watered down progressively each time.  To sum it up, I hate this place and here's why:\n\n-Not my crowd (douche-y, for the lack of a better word)\n-Crowded and the layout doesn't work well (probably since it's supposed to be a restaurant and everyone spills over to the tables)\n-Parking is difficult\n-Takes a while to order drinks, probably because there's only one bar and an overwhelming amount of patrons\n\nReally, my biggest beef is the crowd.  I don't mean to offend, but that's just how I feel.  Maybe I'm the douche and everyone else here is fine.  But I've been dragged here a few times and it's been that way each time.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-17", "description": "*Fri/Sat night LOUNGE review*\n\nThis place was pretty cool to hang out with no cover. I really did not expect this place to really have a line, but boy was it long! Most of us got in right away and skipped the line but later on in the night the bouncers were being dicks to some friends who were supposed to skip the line from the guest list that got sent in.\n\nThe place looks really nice but they did start having a capacity problem... the entire place was paaaacked before I could even take a second glimpse. The main floor's bar was way crowded so we hung out downstairs with the bar down there for most of the time. The bathroom is co-ed and pretty cool looking. It seemed like everyone in the whole place was there to celebrate birthdays too. Hmm I guess I would probably come here again but I wouldn't go too much out of the way to do it.", "author": "Anna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "I have been to 5A5 in the past for a sampling of their food, but this is a review for club venue, which apparently only happens on Saturdays.\n\nTo get into the club, I was advised by my friends to sign up for the Guest List, which was about 3 hours ahead of time, the price to get in was still $20. When I arrived there the lounge was really crowded, and there was dinner service still going on when I arrived, but basically a whole flock of Asian folks were just mobbing the front entrance of the restaurant. There was little room to move around, so much so that it might have been easy for feel like they were getting pushed up upon. I'm guessing! If you're familiar with the setup of 5A5, the bathrooms are towards the right hand side and down a flight of stairs, which creates a serious bottleneck around that area. Not really well thought out, but maybe it becomes a conversation piece for you. Dancing was pretty good and on the night that I was there, which was yeah admittedly months ago, the ratio of women to men was in the guys favor. I prefer a little more hip hop but this was a good mix of top 40, and light on the house and techno. Drinks were pretty standard about $5 for beers, and $10 for mixed wells. Live DJ, laser rays, the works. Would definitely end up there again.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "pros\n-decent street parking if you arrive somewhat early. i arrived at about 10-10:30\n-there was barely a line at the time\n-i love places with coat check! 3 coats for $8\n-the downstairs bar near the bathrooms were hardly crowded\n-carpeted stairs so no slips & falls!\n-music was top 40 so it was pretty decent\n-well dress ppl\n\ncons\n-not well ventilated. it was super hot and i was sleeveless and in a skirt\n-super crowded. if someone knocked into one person, 3 others would feel it\n-small dance floor but i had plenty of room that night\n\nnotes\n-individual bathrooms but shared sink with other sex\n-drinks were about $10 ..standard for a place like this", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-02", "description": "I wish I can give this place negative stars at this point... I'm only writing on my Lounge experience, I can't speak for their food. \n\nI'm in medical sales, and I truly believe service is everything. Apparently, this place didn't get the memo. Bouncers are straight rude. My first encounter with a bouncer here was uncalled for. I told him I was there for my friend's birthday and she got a table... at any other club/lounge, we should be able to skip the line and head in. He snidely responds, \"well, are you paying for it?!\" Excuse me douche bag, power trip much? He eventually let me skip the line and tried to get my number later... BIPOLAR much?!\n\nSecond horrible incident (I shouldn't have even gone back) the bouncers said my girlfriends and I needed to be on a list. I told him I was unaware that this was a guest-list-only-lounge (who does that?) and if my two girlfriends and I can just come in. They had the worst attitude and I had to talk to the man in charge to get in. It's like they wanted me to beg! I would have just left, but there are ZERO cabs around and no other places to drink in walking distance. The continued to make me talk myself in... told them next time I'll put my name on this \"list\"... was I supposed to go on my iphone and put my name on the online guest list to get in? A few guy friends came later and couldn't get in... I came out to try to get them in and the bouncer, AGAIN, was a douche bag. These bouncers tell my friends, \"your homegirl was being rude, so you guys can't come in...\" First off, don't call me home girl... second, if you know me, I'm the nicest girl you'll meet. I think these douches are intimidated by a confident woman. \n\nWent to talk to the same guy in charge that got me in, my friends eventually got in... at that point, my night was effed by these rude bouncers. Some bouncer said I came up like I owned the place.... again, they see confidence as rude?! I'm no submissive Asian stereotype, so get used to it.\n\nNot worth the breath I wasted to talk my way in... crowd was desperate middle aged people with only one bar open, bottom floor wasn't even open, and definitely  NOT better than any other lounge back home in OC.... where I get NO trouble getting in. \n\nVegas, Miami, Chicago, New York, LA, OC... never had to deal with this rude crap... \n\nNever coming back here again. If you want to beg your way into a wanna be exclusive lounge, feel free and check it out.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-28", "description": "What can I say about this lounge?!? Mhmmm... 5A5 Lounge has a nice modern decor. It has a dining area with great service and the food is wonderful. The dining area becomes table service after all the dinner service is over. The problem is... THEY TAKE FOREVER TO LEAVE!!! LoL The bar and lounge area near the front door is pretty small. It gets super packed with people standing around with no where to go. I came here two times for the \"lounge\" experience and it starts super late... Probably some where between 11:30 p.m. to 12:00 a.m. How can I enjoy the night life here if it starts at midnight and the place is almost closing in like two hours or so???  Everyone is holding their drinks just waiting. It gets so hot that everyone is sweating balls!!! LoL I gave this place a second chance, but it was the same as the first experience. Maybe I'm just impatient and I am accustomed to other lounges being open and active around 10:30 p.m. to 11:00 p.m., but I seriously think this place is highly over-rated. I like the open bathroom area located downstairs though!  I hope others have a better experience than I did. Sorry for the average review. At least your food is good! (5A5 Steak Lounge) =D", "author": "Anji W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-19", "description": "Its a cute place, service is good but I'm not impressed with the food and or their wine list. However, that's not to say that I wont be hanging out there from time to time, I like the ambiance.", "author": "Kajal P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-29", "description": "My friend and her other friend held a joint bday shindig here last Saturday night.  Plus, they also made it a Charity event to benefit the Japan Earthquake/Tsunami relief the same night, which I thought was very cool of this establishment to do!  It started off on a pretty good note but I'm sad to say that that night could very well possibly be my one and only visit to this lounge....\n\nMy friend and I got there really late because finding (free) street parking in this area on a Saturday night is a huge challenge.  We circled for about 15 minutes before my friend gave up and decided to drive into a parking lot, where we had to feed a meter $10 so we could put a ticket in the car's window. (There were a couple of guys there who claimed some dude had been checking the cars earlier so we didn't want to risk getting ticketed.)  It was about 11:30pm or a little past, by the time we reached the entrance and there was still a fat line.  Luckily, we told the guy at the door we were there for a birthday and turns out there was a guestlist.  We were on it so we got to go in.\n\nUpon entering, the place was Packed and the music is bumpin.  To the right, was the dance floor, beyond that was the bar and - what? - there was also a stage with a drum set and a drummer who was drumming with the music (made me think of Travis Barker).  Straight ahead I saw the great big chandelier thing above a mass of Asians.  We were fortunate to run into another friend very close to the entrance and she pointed us in the direction of the table where the birthday celebrants were - right through the crowd.  We had to push our way through the mess, which was made more difficult by people going the opposite direction.\n\nThe bathrooms are unisex and are located downstairs, where there is another lounge, a DJ and a smaller bar.  The lounge/dance floor down here was pretty dead though - just a bunch of girls sitting around and only one girl trying to take advantage of all the empty space on the dance floor to move around in!  My friends and I thought the music upstairs was actually better though.  \n\nMy positives:\n- No cover all night.\n- Venue seemed classy, I liked the decor.  Plenty of seating.\n- Drinks were decent \n- Staff was nice (bartenders, hosts, security, guy at the door, bathroom attendant)\n- Good music\n- There's an attendant in the bathroom that will clean up the stall after someone uses it and tells you it's clear (if there's a line)\n- There's an outdoor area for smokers.\n\nMy negatives:\n- Crowded, at times packed so close together you could barely move\n- I paid $14 (if I remember correctly) for a grey goose & cran, a diet coke and a water.... \n- Parking\n\nSo.... for the major negative that will keep me from coming back here in the future.... warning: it's pretty gross.  By around 1am, maybe 1:30am, there was a lot of drunk people and this is where classiness left the building.  I noticed two guys worst off than anyone else there who occupied my friend's area; 1 was bent over with a napkin over his mouth (eyes still open) and the other was slumped over, pretty much passed out with his sober friend watching over him.  One of the security guys came over to the one that was slumped over and I think he tried to wake the guy up.  I guess he woke up and his friend convinced the guy that he was fine so security guy left.  If this were Vegas, that guy would have been escorted out.  Once he was gone the guy put his head down on the table.  A few minutes later I happened to glance over just as he puked on the table top. OMG.  Blecckkkkkkkkkkkkkkk.  I left for the bathroom.  When I came back both guys were gone and my friend told me to watch where I stepped because the other guy had also puked.  Not what I want to think of when coming to any bar or lounge.  And this is supposed to be a restaurant before it turns into a lounge? I feel so bad for the cleaning crew!  Ummmmmmmmm I'm sorry 5A5 Lounge but not sure I could come here especially for dinner after that scenario.", "author": "Mercy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "the place is pretty small considering it's a steak lounge and they serve dinner here riiight before it gets all club/lounge-like. and i really mean.. RIGHT BEFORE! (if you go around 9, you can see it transition into a lounge before your very eyes!)\n\ndrinks were def. pricier than the average place, but if you visit a few bars before coming here, you're set! haha. im a fan of the dress code for sure though.. it was kind of a casual kind of classy with a nice mix of people. and the unisex bathroom downstairs was definitely a nice touch! the only downside that i can really think of besides the drink prices was that the music was definitely NOT ON POINT! besides that.... it was a pretty nice place to hang and drink.", "author": "amelia g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-06", "description": "Pretty crammed and they try to make this place upscale and seems like every time you go there is an exclusive if your not on the GL you cant get in.   Also the crowd is super crowded and seems to be 99% Asian so more of an FYI if you head over there.  Would like to try out the restaurant and see how the food goes.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-19", "description": "When this place first opened, I was really excited because the ambiance reminded me of an LA restaurant/lounge. However, the past few times I have been, the crowd has been really awkward/trashy. It's an okay place for happy hour but it definitely would not be one of my top choices.", "author": "Jenna Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-27", "description": "I am not sure with this place. I really want to give better star rating than two just because it is in my neighborhood and I have special memories with this place when it was another restaurant. So when i want to try this place for another special occasion for my close friend. The server is very very friendly and thoughtful. The food is just like going to big chain restaurants - \"no soul\", the portion is generous, with the price I paid the choices in S.F.  I would have much better alternative for steak. With restaurants come and go in Pacific, i can't wait a better one to open and bring back all the charm and glory of the good days here.", "author": "ivy h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-04", "description": "the lounge is SMALL! i think there is an upstairs and a downstairs. upstairs is where the bar, dance floor, and seating area is at.  the bar and dance floor is at the same area. HELLLAAA cramped! it was hard to get to the bar when everyone is pushing and shoving -_- ahh they should have a separate area for the dance floor and the bar! \n\nthere's not that many seating areas, but people sit on top of the wall area and watch people dance o_O although there weren't that many people sitting but all the chairs were occupied. anyways..there's a SECOND FLOOR which is downstairs.. that's where the restroom is. you have to walk DOWN THE STAIRS when you're buzzed off of alcohol to get to the bathroom. o_O and then walk back UP THE STAIRS to the main area. OH SO CONVENIENT! NOT! so hard to find people because you can get lost just by standing there!\n\ni had a patron shot and i can tell that it wasn't watered down like some places. which is a PLUS! =)", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-29", "description": "OMG! the music sucked - been there 3 times and all 3 times it's been a drag. Maybe for 5 minutes in the entire 2+ hours that I was there did they play some good numbers... The sound system is terrible. This one chic kept falling on the dance floor again and again and again.... at some point the guy who was with her just let her be there.... we all gave him a big fat stare...", "author": "Kinjal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "Have not dined here but I enjoy the night scene at 5A5. This is a perfect place to lounge around if you're looking for a night out that is not too extreme. They got a hint of the club feel with the music and scene but it is definitely a good, one-step back from the typical shitshow. Great place to go with friends and have a semi-chill night. This place can be extremely packed and the fact that it was set up as a restaurant makes the spacing a little inefficient. Shout out to Steve for being a great guy unlike most club owners / managers.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "i like. the people and the atmosphere was chill and this place is gorgeous and upscale. staff was super friendly and the co-ed bathroom was nice and clean. it's a older crowd so it's a bit more enjoyable. parking is also pretty easy to find. only weird thing was... no one was dancing?", "author": "Ann T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-07", "description": "Food is great. Service is not good at all. I have been here on 2 ocassions. I would highly recommend the truffle fries and the filet mignot (medium rare). We asked the manager something and he wasn't responsive at all, we rarely saw are server. Also when we entered we had to wait several minutes for the lady to even look at us to be seated. The placement of the welcome/seating persons area is very stange. I would recommend a podium in the direction of the entrance. Parking is difficult and it's noisy inside.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "A friend of mine needed some help in choosing a venue for her bachelorette party. Seeing as I've reviewed a handful of places in SF, she sought my advice. I recommended a few on my list and a few that weren't, 5A5 being one of them. As far as prices for bottle service were concerned, this place turned out to be the most reasonable. I had previously never been here, so it was only fair that I check it out for myself as well. I did recommend it to her, after all. They were able to accommodate our party of 15 girls, even though one table was reserved. I guess I was the only one thrown off by the bottle service, which included everything you would expect to find. But with the addition of a cocktail shaker, one would figure that a server would be on hand to make drinks for the group. Nope. So I decide to step in and get the ball rollin' by pouring out a few chilled shots, then a few vodka/cranberries and vodka/pineapples. \n\nSoon we all had enough liquor in our systems and headed to the floor, which was pretty dead. Excuse me, don't bring your wall flowering self onto the dance floor if you're not going to dance. Gah! Here we go again getting the party started. The DJ was pretty good with his music selection. Drinks from the bar can be a tad pricey depending on what you order. I was hoping the bartender would be able to bring back my Vegas moment by making me an Electric Lemonade, but he couldn't recall the recipe. Fail. Oh well, water under the bridge. \n\nI like the ambiance of the place and the free cover, which makes up for the drink costs. It's also a restaurant before it turns into a lounge. So if you're an early bird to the party scene, feel free to drop in and get your grub on before getting your groove on later.", "author": "Rhia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-21", "description": "Restaurant by day, lounge/bar/club(??) by night. Friend of friend's bday celebration thus it was asian invasion to the max. Interesting layout provided no real comfortable space for all the attendees (might I add there were a LOT for the popular bday boy). Downstairs equipped with a second bar and several hangout spots that get filled up quick. Main floor was adjacent to the main dining area with a large spot that turning into a dance floor. Hot, crowded, I-can-feel-the-steam-off-that-guy-next-to-me dance floor with inadequate ventilation. Fun stuff.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-04", "description": "Service was good.  Ambiance was pretty hip too but kinda small for a steak lounge.  The aged bone in rib eye steak was full of moisture and good flavor.  But it didn't have as much texture on the outside of the steak.  It was good, but not great.  Brought a good bottle of wine and had dinner with a few friends.  The truffle fries are a must try too.", "author": "Jeremy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "5A5 is one of my Fav. spots for an AMAZING USDA Prime Beef and a killer cocktail. I prefer the lounge and bar witch is always open seating. You may need a reservation for a seat in the opulent dining area. The Filet Mignon and French 5A5 is my usual order. The Green Beans and truffle fries are amazing sides, the shot glass sushi thing is so delicious. Most sides are big enough to split. This restaurant is a-la-cart and a little pricey but so worth every penny... Yum! Oh and it closes early on Sunday so go early.", "author": "Jacque D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-29", "description": "I celebrated my husband's Birthday at 5A5 Steak lounge on the 16th of April and we were very pleased with everything at this place. It was my birthday too, and I never told the staff it was my birthday, but they heard people giving toasts to both of us, so, they brought decorated desert to both of us. It was a very nice touch... \n\nThe service was provided by Leyla and Dan, both of them were excellent. If there were some little problems with the number of servings, they were quick to attend and resolve these little \"hiccups.\" The drinks were served quickly. Overall, the services was excellent! \n\nAll the food was great! All our guests loved it! Some of the people were allergic to the desert that was served that evening, their desert was replaced with ice cream, and everybody was happy.  \n\nI have reserved two tables for the lounge after the dinner. At the end of the dinner, their manager approached me and offered to leave two tables in our private room and have another DJ come to this room and play. The manager stated this room would be open to public though. Everybody in our party was happy with this offer. Honestly, there were a couple of people outside of our party, but they did not stay long, and we continued to have a pretty private event in this room. \n\nI also got great help from Kyle, their director of sales and events. Kyle was prompt and helpful: he returned all my phone calls within the same day, he responded to all of my e-mails, and he gave me some great suggestions. I made some last minute changes, and Kyle was able to accommodate most of them and if not, he had a good explanation for it. A little suggestion I wish to give to the restaurant is to be just a bit generous for people who reserve a private room and pay so much money. For example, I asked to wave the cutting fee for the cake I wanted to bring, and I was not warranted with that. I just thought that something little like this could be granted for us as we were spending a good deal of money there. \n\nThank you 5A5 for making my husband's Birthday a special celebration!", "author": "V G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "I am rating happyy hour it was great. A lot of bites choices and the drinks deals are great. Nice crowd nice service really nothing bad to say!!!", "author": "Carpe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "I went here for a company happy hour and had a blast.  I wanted to stay until the DJ got there, but it was hard to do so since we started at 5 and had a continuous flow of food and drinks.  I'd certainly love to go back here to check out the Steakhouse portion of this establishment.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "3.5 stars to be more accurate\n\nDon't get me wrong... I had a great Saturday night while visiting from socal for the weekend, wish I could give it 4 stars but for the most part the venue itself was just average?  \n\nCrowd was mixed depending where you were?  Downstairs and upstairs by the bar/music = Asians galore... Tables in the back seemed to have more Caucasians chillin' on drinks and not so much dancing?  This place must be pretty popular because I started recognizing people I haven't seen for at least 5 years back in the earlier college years...  Great DJ with variety of music - the oldie but goodies and current popular songs, which always makes for a feel good night.  But they didn't start playing until some time past 11pm; pretty late regardless, but luckily they started up when my friends and I were just about getting restless and drinks were just not enough to kill the waiting game especially when you have a bunch of girls wanting to dance!  Drinks were your average overpriced drinks, but what confuzzles me is taking 5 tequila shots and not being one bit drunk!  I call shenanigans!  If my friends and I are going to pay that much money and keep buying drinks from you, PLEASE be sure to have a heavy hand and I hope you weren't watering down your liquor bottles!  x(  It's okay, the bartender was cute and sincerely embarrassed / apologetic when he flubbed our orders, so we kept going back to him, and by the end of the night, 2 shots - only $10?  I guess that makes up for it.  Unisex bathrooms were interesting, and I'm seeing more of in clubs/bars/lounges...  I think I prefer because it never seemed to be TOO long of a wait?  Maybe that's the trick and they've figured it out!  If both guys and girls are in there, the ladies won't want to hang out and linger in the bathrooms prissing and primping as long since the guys will be in there able to watch them too.  \n\nAll in all, good music and good company makes for a great night.  And no cover means if I find myself back in SF, I'd be down to do a repeat of this place.  :)", "author": "Tina T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-29", "description": "I hate to complain being in the steakhouse industry but I went to 5a5 expecting melt in your mouth meat and got okay, over cooked, and over priced steak. The service was great, my martini was awesome, and the side dishes were good. But that's all. I mean I don't mind spending money on a good steak and I have had Kobe, wet aged, dry aged, American wagyu, and all kinds of steak but that was not wagyu. I ordered the filet which is the most tender of cuts and the meat was over cooked and was not wagyu. I hate to say that the restaurant is lying but waygu should melt in your mouth and be full of flavor. I do not recommend going here and safe your money for a restaurant that serves real melt in your mouth wagyu.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-13", "description": "still popular with the asian crowd on Sat. nights.  efficient use of space to turn a restaurant into a lounge.  online request forms for hosting gatherings and guestlist only.  run very well and efficiently by Steve Chen.  impressive.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-16", "description": "Great atmosphere.   The truffle fries were good and so was the lobster tempura.  But, the main courses were all served cold.  We were commenting on how long it was taking to get our food for a slow Sunday night.  Our friend went to the restroom to wash her hands.  While she was gone the waiter told us our food was ready but could not serve it because our fried was missing and he \"didn't want our food to get cold on our table\".  our friend returned within 2 minutes and our food was served.  My medium-rare lamb was COLD, steaks were luke warm and only 2 side dishes were somewhat hot.  I ordered the strawberry souffle for dessert. I guess they didn't want to serve this cold either so they brought it out 10 mins before the other desserts.  The waiter was nice but blamed the cold food on my friend being in the restroom (for less than 5 mins).  I thought they had heat lamps to keep food hot before serving.  even with the uneaten food you think they wold at least comp us a dessert.  NOPE", "author": "Floyd F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-23", "description": "Bartenders are all polite and pleasant.  Even when the bar is 5 deep.  If you have the opportunity to go early, try talking to them.  They always have something fun to talk about, and the drinks rock.", "author": "Blowfish J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-06", "description": "well crap, i accidentally deleted what I wrote. doesn't that stink?\n\nBasically, though...\n\n5a5 was a ridiculously crowded mess when I went there for the first time this last weekend. The owner says its cause of all these birthday lists that night and they let everyone in...so I guess if I gave em the benefit of the doubt then its ok...IONO. I just like to move/breathe and dance a little AND even if there are a good amount of decent looking people (which there were, also the mix of dbags and the non-decent, now I feel like an ass for judging but you know we all scope!) that doesn't usually compensate for being elbowed and butt pushed all over the place. \n\nThe place did have a pretty ambiance though and maybe part of the crowded-ness problem was that nobody went downstairs. Might be the bright lights that show your sweaty mess of a face in the stairway and the luminescent \"exit\" signs shining over the downstairs dance floor as you wonder where the bathroom is. \n\nOh, and the bathroom was pretty clean...props to that and your attendant considering some of the drunk ladies puking down there.", "author": "Minh-Chi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "came here on a thursday night for a company paid team dinner. apparently we came on some kind of a ucla business school reunion so it was packed. however that in no way relates to the review.\n\nmy coworkers were basically given some super VIP treatment thanks to our boss who went balls out. the 9 of us got a private room where we got some special private service that was one of the most polite places i've ever been to. for sure as a waiter here, your clientele probably has a lot of money and is willing to spend it. for appetizers we had a salmon shooter and hamachi shooter and both were delish. i prefer the salmon over the hamachi. then i had the butternut squash soup that was creamy and lick the bowl good. first spoonful was ok but the more i drank, the more i wanted it... i took the bread and started mopping it up. then came my filet mignon cooked at medium rare and was tender and tender and juicy. didnt care for whatever was on top but it was good. the mashed potatoes and greenbeans that came with it were ok. then for dessert we had the redvelvet cake. we had 2 bottles of wine and a bottle of champagne. for water i was just expecting like tap but instead it was voss...\n\nim a simple guy so being wine and dined like this was a first. id come back here for happy hr for sure. it ends at 730 so u can totally grab a pretty dinner for cheaper than usual", "author": "edward k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "Been here for happy hour once and a party on a saturday night once. Not a bad place. It gets pretty damn crowded, though.", "author": "Steve C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-21", "description": "I've been here on a weekday for happy hour and on multiple Saturdays to partayyy and had a great time! The place is beautiful and Steven (the guy that manages the place/owns it) is the most hospitable person ever! I celebrated my birthday here in June and my brother celebrated his birthday here last week and Steven was more than accommodating with our entire party. The drinks are stiff and the music is great! The place is upscale so make sure you dress to impress otherwise you wont get in! BTW the 49ers dined/partied here this past Saturday, so clearly it's the place to be at on the weekend in SF.", "author": "Himani A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Great spot for a chill night out. No lines, no cover, places to sit, and good music. Great decor and lighting. Ample parking around the area. Only downside was when the staff repeatedly bumped into our crowd while walking by.", "author": "B .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-16", "description": "no cover- very good. drinks are decently priced $8.00 / drink. its a very clubby scene though. Everyone there is like... 18-23 lol.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-06", "description": "After all the hype, went to 5a5 for a cocktail and appetizers on a Saturday nite with two other couples. Restaurant was chic and the menu looked promising, but the servers were all huddled around the bar area doing absolutely nothing when we entered. After seating ourselves and waiting for 10 minutes or so, we got up and walked over to the EMPTY bar and placed our orders. After what seemed like another ten minutes or so, mind you the bar was void of customers, the server finally brought over our warm martinis and disappeared. My husband and friends walked over to the bar and kindly asked the bartender to shake them up a bit more whereupon she rolled her eyes at us....yep rolled her eyes!  When you're shelling out $12-$15 per cocktail, they should make a cocktail the way the customer wants.  Edamame was good, truffle fries were a bit limp, and our food was brought without napkins or plates; no waitstaff in sight! Service can make or break a dining experience and 5a5 failed miserably...needless to say we will not be venturing back to try the full menu.", "author": "Sasha R."}
