{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "As a Full House fan, I've been coming to this park for years.  This is my first time visiting since the renovation and I love it even more.  We stayed for longer than we anticipated.\n\nMy kids loved playing in the playground.  There are two separate ones - one for bigger kids and one for little kids.  It was nicely separated.  You didn't have to worry about the bigger kids trampling your little one.  It wasn't crowded on a Friday afternoon.  \n\nThe view of the painted ladies is what we came here for but we got more than we expected.  The walkways allowed foot traffic to move away from the grassy area.  We sat on the grass and didn't have to worry about people walking close by or being stepped on because everyone was walking along the pathway.  Kudos to the city!\n\nThere was a coffee truck (it was just OK) where we grabbed a cup of joe before walking around.  You get some really nice views of the city especially on a clear day.", "author": "Linda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Alamo Square is so picturesque, I stayed over an hour snapping photos and taking in the scenic views. \n\nMy second stop during my trip to San Francisco, Alamo Square added an additional layer of excitement to my already exhilarated disposition. While there, I joined a handful of visitors snapping pictures of the 'Painted Ladies' and downtown San Fran. I stayed for a while after grabbing some shots and relaxed on one of the many benches. This park even has a coffee truck and off-leash dog area. If visiting San Fran, Alamo Square is a must do!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Aw-aw-aw-aw, awwwwww...\nWhatever happened to predictability?\nThe milkman, the paperboy, the evening TV?\nHow did I get delivered here?\nSomebody tell me please\nThis old world's confusing me...\nEverywhere you look, everywhere you go\nThere's a heart (there's a heart)\nA hand to hold onto\nEverywhere you look, everywhere you go\nThere's a face of somebody who needs you\nEverywhere you look\nWhen you're lost out there and you're all alone\nA light is waiting to carry you home\nEverywhere you look\nEverywhere you look\nShoo-bit-a-ba-ba-bow\n\nOK, I admit it. I've never seen a complete episode of \"Full House\" - just the opening credits that end with the characters having a picnic on the grass in front of the Painted Ladies on Steiner (video: http://bit.ly/2OCSlpt). I have yet to do that since I'd be afraid of being trampled upon by aggressive tourists who take their photos and point and shout, \"Jesse house! Jesse house! Have mercy!\" Regardless of all these psychological barriers, Alamo Square is quite worthy of landing as my 4,300th Yelp review.\n\nIt's been a year since the bulk of the park was shut down for a $5 million renovation to make it more ecologically sound and more in line with tightening climate control measures. The year-long shutdown was worth it as the paved walkways, floral gardens, and the mammoth trees look immaculate now. The playgrounds have also been upgraded, but I could only tell from a distance since I wasn't accompanied by a child. Hell, even the dog park looks inviting to non-dog owners.\n\nIt's definitely a toss-up between this patch of greenery and Dolores Park as far as which represents the definitive photogenic view of San Francisco. There's no doubt that Alamo Square is certainly the windiest bluff in the city, and its proximity to foodie havens like Divisadero Corridor, Hayes Valley, and the Lower Haight make it appealing to hipsters and young families as well as tourists. I also think the Edwardian homes on Scott are just as photogenic as the Tanners' house.\n\nShoo-bit-a-ba-ba-bow!\n...and didn't Emily Blunt and Jason Segel get married here at the end of \"The Five Year Engagement\"? Yes, I think I'm right.\n\nRELATED - Looking for some more greenery in the Bay Area? Here's a collection of places I've visited and reviewed: http://bit.ly/2QJwjmj", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "This park is famous for its view of the Painted Ladies. Don't get me wrong, the view of the famous ladies is great but the park is more dynamic than that and worth visiting! \n\nThere is a newly renovated children's playground, a dog park, and three separate views of different parts of the city. There are always open benches if you aren't a fan of sitting on grass. And it's never overly crowded. \n\nWorth taking a visit with kids, dogs, and out of towners!", "author": "Sydney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "What an amazing park. Nestled into the neighborhoods, you'll scale the iconic hills of SF that'll make your calves burn but be rewarded with a wonderful view on a clear day. \n\nThis park is jam packed with all the things! Tennis courts, playgrounds, a dog park, restrooms, and lots of space to linger or picnic, which is just what we did. \n\nThe Divisadero is right by so you can pop down there and load up on coffee or groceries (go to Bi-Rite, place was great) and make a little picnic for yourself. \n\nWe saw a big green parrot cawing from the treetops on our way out which capped a magical afternoon at Alamo Square.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Came here on a Sunday afternoon. The weather was nice and view was great. A perfect place for picnic!", "author": "Tracy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "This place is incredibly beautiful & photogenic. During sunset & nighttime city lights are popular times to snap a great shot!\n\n- Overseeing the painted ladies & skyscrapers from the hill top. Can def take photos from here to showcase the unique parts of the city. \n\n- Florals on the sides of the park, playground, and benches. Perfect spot to chill & hang out. Can be a bit chilly at night! Wear layers. \n\n- Plenty of free 2 hour parking around this park! \n\n- Near by the artisan bakery the Mill, as well as Boba guys NOPA. Many quality restaurants & cafes to check out. About 5-10 min drive to Japantown. This park is esp. convenient for those who want to spend the evening strolling around NOPA/ JP town!", "author": "Jess W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "This park is everything. Wide, expansive space on top of a hill with enough room for humans and dogs to live in harmony. The main attraction across from it is the Painted Ladies of course, but Alamo Square shines too. Huge, tall trees of all types provide shade and photo ops. You're up so high you get great views of the downtown San Francisco. The sky was so blue and the sun bright on the Saturday afternoon I went that you could see views for miles. A bit chilly so bring a sweater. Also amazing for picnics! I'll come back and be prepared too!", "author": "Liz B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "If you love the TV show, Full House, you must come here. Even if you don't really like the show, I think you should. \n\nAs a park, there really isn't much, but the view it offers is spectacular! Of course, the famous houses from the opening song of Full House are right there in front of your eyes! You can also see the San Francisco skyline behind them.\n\nN.B.:\nThe bathroom situation is not very good here, particularly for men. There are two bathrooms. One is for women. The other is an accessible bathroom, and men have to use this one since the other one is a women's. In this \"men's\" bathroom, there's only one stall, no urinals. Since tour buses hit this park, there could be long lines. So, please plan accordingly :-)\n\n******************************\nIf you found something useful in my review, please hit \"useful\" so that I can improve my reviews. If you love food and traveling, follow me, or better yet, let's become friends on Yelp! Thank you and happy Yelping!", "author": "Masanori D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "This four-square-block city park has always been pretty popular.  It has many of the same amenities that other similar parks in The City have.  Still, I've noticed that its popularity has been picking up in recent years.\n\nTwo reasons.  One, those Victorians.  It's subjective to say that this Victorian is better than that Victorian.  But these six on Steiner Street are arguably the most famous in San Francisco.  The owners know that, so they make it a point to keep the exteriors looking perfect.\n\nTwo, \"Full House\".  Nearly everyone who came of age in the `90s knows that the introduction ends with Danny Tanner, his three girls, and his two buddies having a picnic on that steeply sloping lawn, with the frame playing up those Victorians and the skyscrapers in the distance.  Alamo Square is quickly becoming known as \"the Full House park\".  Now the next generation, \"Full House Too\", is being made for Netflix, and the end of THAT intro is the same thing, this time with DJ, Stephanie, and Kimmie and their kids on the lawn.\n\nWhen the inlaws have come here from Southeast Texas, if I'm in SF with them, I've made it a point to take them to this park.  They didn't watch \"Full House\".  But this point, halfway up Hayes from Steiner, encapsulates San Francisco, a city that embraces its history while forging into the future and giving both resident and tourist a chance to rest and take it all in.\n\nThere's more to Alamo Square than that view, I admit that I'm not an expert on all that's here.  But if that view is all you get, then that's good enough.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Alamo Square is such a great park in the middle of the city with great views of San Francisco and large, open grassy fields for people and fur babies to enjoy.  You'll find many people sitting, laying, reading, talking, basking in the sunshine on a nice day.  Even if it was a cold, overcast day you'll probably still find large groups of people because of the Painted Ladies, made famous by Full House -- a TV show that I grew up with and brings warm, fuzzy feelings of the 90's. (*note - The real Full House house is located on another street)\n\nIt looks like they've made some upgrades recently since the last time I've visited. New pathways have been created, a fun playground for the kiddos was installed, & I think a tennis court (not sure, was that always there?! I don't remember it the first time around).  Definitely all great additions to the park, IMO!\n\nThere's also a lot of awesome food spots around Alamo Square.  Pick-up some bites and bring it to the park and enjoy it with a view!  I usually head to the Bi-Rite Market just a block over for their amaaazing ice cream and finish it up as I admire the beautifully Painted Ladies all around the park.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Whether it is for the renowned Painted Ladies (from the Full House TV show), wonderful city view, playground, bringing your pet for a walk, and/or picnicking, this square has it all! \n\nIt's green and open space is lovely to simply enjoy while overlooking the colorful homes and view of the city! \n\nI believe that it's healthy to take a stroll in fresh air and just being at ease in the hustle and bustle of San Francisco.  I got to take it in, reflect and be mindful here.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "The park is open!  I repeat, The park is open!  ...and it looks amazing after being closed for construction\n\nThe view of the Painted Ladies is one of my favorite must-do location stops when entertaining guests.  The lawn on the east side also provides a nice resting stop.  Parking is very difficult, so walk here or take an uber.  After the visit, head west to Divis or south to Haight Street for a snack or a drink-- both districts plenty to do.  \n\nAwesome views, a foliage-filled park to stroll, and a grassy lawn for resting....and it's all FREE!", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Alamo Square sits on a hilltop overlooking San Francisco and the famous Painted Ladies. \n\nThe view is simply amazing. It was my very first stop in San Francisco, got there via an Uber. This park really helps you take in all of the hilly Bay beauty. It's the spot to photograph the Painted Ladies with the skyline backdrop. \n\nAlamo Square seemed to be a small suburban park. It's ideal for a picnic spot. We were only there for the sunset over city vantage point. \n\nThere was still a little bit of construction going on. The area closer to the sidewalk facing the Painted Ladies was fenced off. But this did not obstruct our view or get in the way of our picture taking.", "author": "Donna D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I wanted to have a chill day with my fiancé so we came here found a spot to lay down on the grass and enjoyed the scenery and warm weather. I had a great time here and the vibes were great!!! Great people and great location!!!", "author": "Neloffer E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "A popular small park and great for pets! I would never have been here if it was not for wanting to see the 'Painted Ladies' homes! You will be lucky if you find parking around here! The views are great here and the park is very hilly.\n\nThe park seemed well taken care of by visitors and residence near by. It also seemed updated as well. The park is very pet friendly mainly saw many different dogs. They do provide doggy bags for the poops coming from the pets. There is also a small playground for the kids. Mainly people here just 'hang out' or chill on the grass or have little picnic. We even saw people bringing beer and just chillin' while viewing the 'Painted Ladies' homes and SF city in the background! That I didn't think drinking was allowed in the parks but I guess as long as you clean up? \n\nIf I lived near by, I would always make use of this park. Great find. [97/100]", "author": "Edna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "Parking is hectic just great to enjoy the view and the awesome artist. Watch out for the old man is the thong might not be appropriate for kids", "author": "Tattooed B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Been to Alamo Square. It's a patch of green in the middle of urban space. It's hilly. They renovated the park. It's good to bring your dog here for a walk. It's near Divisadero and the hustle and bustle there. It's a nice park for the public.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Currently under construction, but they still have an area open where you can sit and enjoy a view of the painted ladies. After having brunch and ice cream nearby, my group decided to walk off the fatness. Walked by Alamo Square on Saturday, April 1st around 2:15pm.\n\nSince there's only a small section open, it was rather crowded. I just quickly took my photo and moved on. I can't help but feel bad for the people who own the houses along Steiner. So many tourists running up and down their front steps taking pictures. I guess that's the price you pay when you own one of these famous houses.\n\nI can't wait til Alamo Square reopens. It would be fun having a picnic on a nice day.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "This place is exactly how you hope it will be and it lives up to the full house experience. You can take all the pictures you want of the full house row of homes. This square is a beaut park with picturesque views of the city. There is plenty of green space to enjoy nature. There is also a dog play area where the dogs can be off a leash. I'm terrified of dogs and had no idea that having a dog off a leash in a non enclosed dog park area is a thing. This is a thing in San Francisco apparently. If you love dogs come and enjoy. If your dog is rowdy this is not the place for you as other dogs can amp your pooch up. Come and see full house. Come relive the 90s. Come take photos.", "author": "Alexis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Relaxing little park with spectacular views of the city skyline and of course, the painted ladies. There are quite a few coffee shops in this neighborhood, so a perfect spot to grab a coffee and head down here if you would like to enjoy it with a view. The park is dog friendly.", "author": "Preeti R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "Great place for a photo shoot with the Painted Ladies! There's tons of space to read, play, relax. Dog friendly as usual. Conveniently close to the Muni stops also", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "I seriously love this location.   Great place to walk.   Beautiful trees.   A lot of happy doggos having fun with their pet parents and for people that still play Pokémon there are a lot of pokestops in the area.", "author": "Tina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "The view at Alamo Square is one of the most gorgeous. You can see the Painted Ladies and get a great photo of the city. The park is open to dogs and you can grab a coffee at Lady Falcon Coffee Club, a woman-owned truck. There are a couple of tables and benches but if not, this is a great spot for a picnic (on the side without the dogs). Park here and walk around because it's close the everything hip!", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Now restored and reopened to the public, Alamo Square Park offers that picture-perfect Full House view of the Painted Ladies with the West Bay skyline glistening in the background.\n\nThe grassy fields are quite hilly, but are also angled just well enough so everyone can enjoy the view and lounge around picnicking, sunning, or just chilling without blocking each other's sightlines, even if some folks are playing frisbee or cornhole. \n\nBeware, it can get quite windy here, so you might want to bundle up. It's partly why the west-facing open areas have much fewer people on them, in addition to the fact that they don't have quite as iconic a view.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Love this park! Coming here on a beautiful San Francisco day is the best. You can just lay on the grass and relax, have a picnic, or people watch. And staring right in front of you are the beautiful painted ladies and the city behind them.", "author": "Christina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "San Francisco sightseeing on a budget. Anyone who likes Full House or San Francisco architecture will recognize the Painted Ladies. Fair warning, the SF uber and lyft drivers don't seem to know their way around here or that \"the painted ladies\" aren't literally a group of women covered in paint. (Which I guess could be a SF thing too)", "author": "Scott Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "I love these houses! It symbolizes SF!\n\nIts a good spot to visit on a sunny day in town.. you can have a picnic in the park with the view of the painted ladies..", "author": "Deebs M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I used to live across the street from the park in 89 and it was not used much. Now with the new park renovation it was wonderful to see many groups of people using it during a weekday. There's more than the view of the painted ladies here, it has an unusually uncluttered view of Sutro Tower and it's a nice walk from Civic Center BART and close to Bi-Rite where you can get some of the best ice cream in SF.", "author": "Andrea Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "We were visiting San Francisco and my wife wanted to see the Painted Ladies. We must have timed it right as the park was open. What an awesome park for residents. The dog park, playground and grassy sitting area make it a perfect spot to chill and look at spectacular views of the city!", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "I can't believe I have not made a review of this place and I bring people here all the time!!!\n\nJust a up the street from Japantown is Alamo Square.\n\nThis is the famed \"Painted Ladies\". Last time I was there, some construction was going on at the edge of the park.\n-------------------------------\n\nThis is a great place to take people. Parking can be tough at times, but people are also leaving often as well. \n\nThe square is a big open spot, so people bring dogs and kids can play (look for dog crap on the grass).\n\nThere is also a good size playground nearby as well!", "author": "Roger A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Nothing says San Fran like a visit to the Pink Ladies! I was able to reminisce of my youth, being such a fan of Full House. My advice, grab lunch and some picnic in Alamo on a warm sunny day. Nothing better with such a lovely view!", "author": "Brooke D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "The first time I came here a few years ago, you can walk around the park. This time the park was under construction, but you can still have a good view of the painted ladies. Just remember this isn't the place for you if you think this is where the 'full house' houses are. The painted ladies are a nice icon to San Francisco since those houses are pretty unique.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "We all know why most people besides the locals go to this park. It's definitely one of those really shamelessly touristy things to do but well worth having your own version of a pic with the painted ladies. You will have to hike your way up to the top of the hill and it is quite a bit of a workout but well worth the amazing pics you will get. Only bad thing about it was how crowded it was which was a given, but that was also probably due to summer vacation. Just an FYI more than likely you will have random people in your shot, we unfortunately had a completely nude man coming into our shots on purpose, he knew everyone was taking pics of the houses so he purposely tried to ruin it for everyone. Be prepared for characters like this guy if you plan on coming. Oh, bring a jacket, we were here at the end of June and it was freezing cold and windy!", "author": "Sheena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Beautiful spot!! We had a wonderful picnic in front of the painted ladies. Beautiful spot, and really dog friendly.", "author": "Angelica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "The park is renovated. It can get really crowded right in front of the painted ladies with tourists. It is a great spot to have a picnic on. There are a lot of cafes that are walking distance. Parking is relatively easy and the best part is that it is FREE!", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Best little park in all of San Francisco. Most people come here to see the Painted Ladies. I come for the hidden tennis court. They just repaved it. Can't wait to start whacking some balls around want to play?", "author": "David A R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Absolutely beautiful park... A great place to relax, have lunch, people watch, take really awesome photos of the Painted Ladies from across the street and see a remarkable view of the city from top of the hill.", "author": "Becky G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Growing up watching full house I was always curious to see where this place is at. Finally I get to come and take pictures and walk the streets. FYI we came on the day of the bay of the breakers and the Alamo square was boarded up with fences. \n\nBeing that I was from out of town I had to get better pictures so I hopped the fence to get a bigger and wider picture.\n\nJust my luck the cops drove by as we walked towards the fence to hop back over.\n\nCop \"Kids your not suppose to be in there, that's why the fence is boarded up\"", "author": "Keniff K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "I'm fortunate enough to live a couple blocks away from here and the view is breathtaking, both during the daytime with colorful Painted Ladies and at night the San Francisco city skyline. It can get a bit windy, so if you're going to chill there for the afternoon you might consider bringing a sweater.", "author": "Kurt P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-26", "description": "This is my favorite park in the city. I am disabled with mobility issues. My partner and I have been going there weekly for years. When the weather is good we generally go there 3-4 times a week. NOT ANY MORE. The Park reopened on May 24th and I found out that all but 5 benches were ripped out! The park is halfway re-sodded  and many trees were cut down. This is a 12.7 acre park with one of the most famous views in the world. It has a large off-leash area for dogs at the peak of the hill and a tennis court. \n\nThere used to be over 30 benches in the park so that one could stroll up and down the rolling hills and socialize with the regulars and tourists, watch the sunset and enjoy the fantasy views of the city. It was a great place to watch a lunar eclipse last year and share our delight with the crowds that came out to view it.  The reproduction 1920's street lights and Victorians ringing the park could transport the mind to a bygone era. It is truly a community experience that was beautiful and welcoming. \n\nNow that the benches are gone and there is nowhere to sit it is now a scenic pass-through for commuters from the Peninsula getting on or off the google busses. With no place to sit it is hostile to park visitors, especially those with mobility issues such as the disabled and the elderly. \n\nNow that there is no place to linger there is no longer that welcoming sense of community that drew us there for years. We called London Breed, the 5th District Supervisor and President of the Board of Supervisors. We called the Mayor's Office of Disability and our supervisor in District 8. No one knows if the benches will be replaced and there is no update on the Park and Rec website. \n\nThere are no trash cans at the moment. We are told at least one will be installed at the playground.  The steps are in the same state of disrepair they were before the so-called $5,300,000.00 renovation. Where did all the money go?\n\nIf anyone is interested contact Public Works, Park and Rec. and London Breed at the board of supervisors. Otherwise it will be a summer of rolling in the dirt amidst trash and dog poop, and pee soaked lawns.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Update on the Park Closure: The Alamo Square park are closed , fenced off , can not access through the park . The  lawns, flower bed area, bathroom, dog park, tennis court, kids play area are not accessible. \n\nBut the Painted Ladies ( Victorian Homes ) are still able to view and take pictures. You can stand in front of the Painted Ladies and there is a section that are reserved for those memorable photo opportunity. Call this number with any questions 415-218-0259 or sfrecpark.org\n\nI moved away 2 years ago from SF. Now taking my children and friends there playing tour guide. \n\nIt's still as beautiful and spectacular view as I remembered. \n\nParking is a bit scarce, anywhere within 2 blocks, especially on the weekend. Don't even think about double park to take a quick photo opportunity. Traffic officers are canvassing like a hawk. \n\nA reminder when ever you are parked on an incline anywhere in SF area , remember to curve your wheels to the correct position . If not you will find a ticket on your dash. \n\nTips: before turning off your vehicle, you need to turn your power steering wheel. \n\nDown hill slope: turn your steering wheel so that the car front wheels are to the curb \n\nUp hill : turn your steering wheel to have the car front wheel turn away from the curb.\n\nFor the children there is a park a few feet away, bring a blanket, have a picnic and people watch while kids play..", "author": "Vuoch. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Naturally, it's a tourist must, but it's got much more to offer than a Full House flashback. \n\nIMO, the Painted Ladies aren't nearly the coolest houses on the block. There are tons of amazing Victorians in the neighborhood, and it's worth walking beyond the perimeter of the park if you're into architecture. The skyline views are amazing as well, especially with city hall in the foreground. \n\nMy favorite part about the park is how dog friendly it is. There is an off-leash area with lots of friendly dogs and dog owners. It's nice to see that locals frequent the park and they aren't complete a-holes like some other cities (*coughNewYorkcough*). \n\nThe drag about this place, aside from parking on weekends, is that it's 95% dirt / mud. The grass is mostly weeds, and it's pathetic for the dogs. Maybe it's just because of winter, but I cannot imagine trying to picnic here. Also, on two sides of the park, there was shattered glass from two car break-ins. Wouldn't trust parking here after dark.", "author": "Kate K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "This is a nice park.  It is in a residential neighborhood.   Lining the park are a couple of nice apartments,  but mainly beautiful victorian houses.  These include the famous and highly photographed Painted Ladies.\n\nThe park its self is grassy with nice trees and nicer viewed.  It is a high point and you can see all over from up here.\n\nWhen I have been here it has always been used by two groups.  Tourists looking at the houses and people exercising their dogs.   There are lots of happy dogs.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "5 stars for the view.\n\nIn a City that is chock full of views, Alamo Squares is unique.\nA row of Victorian homes line the eastern side of the Square and beyond this, is the most amazing skyline view of Downtown San Francisco.\nThis view appeared in a TV sitcom; it's in countless tourist photos.\nBut when you think about it, it's one of the beautiful neighborhoods in San Francisco.\nLast year, I stumbled upon an antique & flea market that the Haight Neighborhood association planned as a fundraiser. It was very cool. The other homes around the perimeter of the square are distinctive and pretty colorful in pattern & history.\nIn warm weather, bring a picnic and spread out on the grassy slope. Enjoy a glass of wine and snacks. The view is your sweet treat.", "author": "Joanna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Mary Kate & Ashley put the Painted Ladies on tourist's list of places to visit in SF.\n\nBut for the locals who live around the square, there's more to than just staring at these classic Victorian homes.\n\nIt's about playing with your kids in the playground.\n\nIt's getting a glimpse of downtown SF on a fog free day. \n\nIt's about gathering picnic supplies at nearby Bi-Rite market and enjoying it here.\n\nIt's about letting your pooch get some air time with your frisbee and meeting other cute doggies.\n\nIt's about communing with Mother Nature after a hard day's work. \n\nI love SF.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "Popular tourist destination as the six Painted ladies border the small park... but at the moment this park is fenced off and closed.\n\nWhen this park was open it was dog tested and approved by my very own Piggy. Lots to see with views of Fidi and plenty to sniff: trees, fire hydrants, and the like.\n\nNow that the park is closed its not the photo op that it once was but you can still be loud at all hours of the night and hang around The Six - everybody else does it.\n\nLombard and the Golden Gate make great backdrops for that perfect photo. Feel free to come here and sniff around.", "author": "Stefan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "This is another one of those must-see high traffic tourist spots for the obviously picturesque and easily recognizable Painted Ladies. However, what makes this park more inviting to go to is that it's much more calm and not overly swarming with annoying visitors because it is more inland and takes a steep climb to get to. \n\nIt is a big, gorgeous, and very clean park, and once you get to the front you'll see everyone posing on the lawn with the iconic houses behind them while some just lounge and enjoy the park and day off to the sides. It's a very fun and tranquil location as long as you don't mind all the photographers, yet you can't come all the way here without snapping at least one selfie! \n\nThe neighborhood around the park is generally quiet, and traffic isn't bad on Steiner St between the park and the ladies depending on the time of day. the 5, 5R, and 22 buses all stop along McAllister and Fillmore, which isn't far from the park at all, yet is a little steep, and gets more steep if you're coming south from Steiner. \n\nOverall, this is a very accessible park if you're willing to go the distance, and while you know the view from Full House, you just have to come see it in person because these ladies are truly a work of art, especially on a sunset! :)", "author": "Kyrie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Can honestly say such a wonder park. The people in the area were friendly a lot of dogs, family's elderly and kidz. The view of the \"painted lady's\" waz fantastic. I'm here in mid June and the weather iz fantastic! Just bring a light jacket as It'z quite chilling late afternoon ! The tree'z make this place feel like a wonderland and they're scattered about the park so it shouldn't be to difficult to find a nice shady spot to relax and read a book, and have a picnic!", "author": "Zane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "This might be one of my favorite parks in San Francisco. Its more calm. Nothing like the crowd you would get at Dolores. It's on top of the hill therefore the view is nice and the view of the painted ladies. Especially this weekend, the sun was out. Just bring a blanket, some fruits and shades. Perfect day at the park. Noise level is very light even with all the tourist. Very relaxing. Especially with the rainwe had this year, the grass is green.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Beautiful well kept park. Not too crowded, I went during the week and took some great pics. And the view is outstanding.", "author": "Magdalrna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Beautiful park but it's closed for the entire month of May :(  If you're going to see the Painted Ladies you can still view them from the street even though the view isn't quite the same.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "As far as views of the city and the Painted Ladies, Alamo Square is one of those iconic tourist places in SF that you might enjoy visiting. Located across the street from the \"Full House\" house, the row of Painted Ladies is quintessential Victorian era San Francisco. Beautifully painted and maintained to reflect the grandeur and elegance of San Fransisco circa mid 1800's- early 1900's, these homes surrounding Alamo Square, including the Painted Ladies, but also a few other beauties, are really very captivating. Definitely a good place to visit if Victorian architecture is your delight.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "Beautiful San Francisco city park especially along or looking towards Steiner St. because of the Painted Ladies. So much beauty in the neighborhood and looking beyond it at the city skyline. Great place to just have a quick picnic and take in the view. The Painted Ladies are just so beautiful to look at. You cant help but remember it from the Full House tv show or countless postcards that have featured those victorian masterpiece homes. \n\nThere's a lot of tourists. There's a lot of dogs. So watch your step and pay close attention to the street signs as well as any temporary street construction signs. SF parking enforcement will be on you with the quickness. I parked across the street from the Painted Ladies first, only seeing the street signs thinking it was ok. But  I hadn't noticed the signs during construction of no stopping or parking. Stoops! Good thing I didnt get a ticket in the 5-10 mins it took me to realize I shouldn't have parked there. Whew!\n\nAlamo Square park. You gotta see it. Just sit and take it all in for a moment. You're seeing the city from one of its most beautiful vantage points. What a view...", "author": "Chuck D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-23", "description": "Great place but you have to watch out where you are parking . My car got broken into within 10 minutes being there , it was fast so they must of been watching me before . Make sure you have your car close by on eye sight . The officer said it is very common there and at twin peaks just for heads up to tourist . I would think their would be more security having to be touristy place", "author": "Nancy U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Best place to take pictures of the Painted Ladies. It's nice to just sit in Alamo Square and watch the sunset with the Painted Ladies. Alamo Square is also just a nice park in its own right - with lots of dogs and benches. The fact that it's so steep means you get a great view of the city!", "author": "Judy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-27", "description": "This park is basically a hill with nice views at the top.\n\nYes, yes, yes, it's known for it's famous: Painted Ladies which is lovely and I suppose the views of every direction are nice. However, I do not appreciate the fact that so many people smoked in this park the day I came. It kind of destroyed the little bit of nature that San Francisco had, even though there isn't really nature at all with the drought and all.\n\nThe washrooms here were surprisingly clean, but there is a window on the top of the washroom I was in, so the entire time, I was self conscious to know if someone was looking at me from above.", "author": "Kristy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "I've lived on Alamo Square for almost 20 years and this little patch of heaven is my favorite spot in San Francisco.\n\nWaking to birds chirping, fog burning off quickly, the lovely postcard row with stunning skyline backdrop, gorgeous architecture all around, off-leash dog run on the west side of the park, the darling children's playground, tourists posing for photographs and sunbathers in the park on any nice day - without there being a crush of people like Dolores Park.\n\nThere's almost everything to like about picturesque Alamo Square. \n\nExcept when visitors block the driveway to my garage  (\"we were just going to be a few minutes!\") which gets on my nerves when it happens four times a day.\n\nAlamo Square offers San Francisco views at their very best and ideal city living.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "PEOPLE!! I am begging...PLEASE stop sitting/laying down in the dog park area! There are so many other places you can use in the park, but we dog owners only get that one section. It's really exhausting and frustrating when I bring my dog to the park to get him some much needed exercise (1 year old pit/shepherd mix= lots of energy) only to find the field covered with people suntanning and having picnics. It creates an obligation for me to chase my dog around to make sure he's not bothering anyone, which defeats the entire purpose of taking him to a legal off-leash dog park. \n\nI've had people straight roll their eyes at me because my dog went up to lick their face when they were SITTING on the grass. What do you expect? I know some people like to sit there deliberately so they can say hi to dogs, but it can derail training and it's also not safe when there are large dogs playing. You might be having fun, but the dog's owner is not. \n\nI honestly don't know why anyone would want to sit down on that field anyway considering how many dogs use it as their toilet!", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "This park in San Francisco is famous for the row of houses known as the \"Painted Ladies\".  If you want to get this famous shot come on down.\n\nThere are a couple of things you need to know if you have never been to this park before:\n\n1)  Parking is very difficult to find in this area each time I've ever been here.  I was lucky last time to actually get parking on the street adjacent to the park.  Other times I've had to park a couple blocks away.  \n\n2)  Sunset is an amazing time to come here.  This park being elevated has a really nice view of the surrounding area.\n\n3)  Much of the west side of the park has lots of dogs playing around since it's a dog park!  Lots of friendly people with their dogs running around enjoying the space is a really nice site.\n\n4)  The park is steep getting up to the middle because it's a big hill.  If you can't do the steepness go around to the east side to see the Painted Ladies if you can't go through the middle.  \n\n5)  There are public restrooms in this park closer to the east side just south of the tennis courts.\n\n6)  This park contributes to show off how beautiful San Francisco is in case you didn't already know.", "author": "Lambert P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "Sadly, the park is fenced out still. I like that they still give you a good view of The Painted Ladies. It's definitely worth a quick visit, but parking can be a bit difficult to find, so I recommend coming early in the day. I hope to come back once the park does open!", "author": "Cathy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "Full House!!!\n\nStreet parking. Super crowded in the park/square area. \n\nTaking pictures from the park gets the best view of the Painted Ladies. \n\nBrings back memories seeing these houses up close. \n\nI would really hate living in this area!", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "If you were a Full House fan growing up then you must visit this place-if you are nearby. If you are nearby and want to take a break, stretch your legs, people/dog watch or have a small picnic, then this is the place for it. I visited in October so the trees & grass were turning and some patches of dirt. However the houses are great to look at. Combine this with a landscape backdrop of San Francisco and you have epic selfies. Not sure the distance, but a few laps around the park will definitely give you a cardio workout if you keep up for 20 minutes at least. There's parking all along the perimeter of the park but there are also lots nearby.", "author": "Linh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "One word: Gorgeous. \n\nFew more words: Alamo Square a.k.a the park from the picnic scene in the credits of the TV show \"Full House.\" Bam. What a sentence. \n\nParking for this beautiful park is all on the streets and thankfully the spots do not require coins since it's surrounded by residential homes. \n\nThis park is crazy popular with people who want to take a picture of the iconic Painted Ladies of San Francisco. And it's actually a super nice place to go and just enjoy the day at. I saw people just sitting on the grass eating food so you can definitely recreate the picnic scene from Full House if you wish to. \n\nThe park also includes a small playground for kids that has 2 adult swings if that catches your fancy. My cousin claimed we were too old for that so we walked away. #regret \n\nOverall, definitely gonna find time to come back and enjoy the beautiful sunshine while it's still around.", "author": "Venus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Sure, everyone goes to Alamo Square for the picturesque cityscape -- especially that one with the Painted Ladies front and center and the rest of the SF skyline hanging in the background.  It's where you can have a short but sweaty urban hike, have a picnic with brie and baguettes, and re-live the opening credits to Full House.\n\nBut what I'd like to talk about are the DOGS.\n\nThe locals who hang out at Alamo Square all have dogs, and each one is nicer than the next.  While I was doing the tourist thing and snapping pictures around the Square, I had my ankles licked and/or cuddled by 14 (yes, I counted) different dogs.\n\nThe amazing thing about these dogs?  There wasn't a single mean or ugly one.  I don't know if it's something in the water (or just all the weed wafting through the air), but SF dogs have truly embraced free love and respect toward their fellow living things -- sometimes even more so than their owners!\n\nWith that, I give Alamo Square 5 woofs!", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "On my way to SFO airport, I stopped by Alamo Square to check out the Painted Ladies. I discovered this park via yelp reviews, and was eager to see what the beauties looked like. :)\n\nParking was rather difficult to find, but I managed to squeeze into a spot about 1 street over from Hayes. After a brief 2 min walk, I'm there - on the green lush lawn, full of tourists and locals basking in the bright sun. It was such a beautiful day this past Friday, and people were sunbathing and enjoying the nice weather.\n\nI snapped some photos of myself and the Painted Ladies in the background. haha :) and had to rush off to the airport. Would love to spend more time here next time, and even have a picnic!", "author": "Yonnie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-26", "description": "A lot of tourists here to take pictures of the Victorian houses. Too many dogs in the area, couldn't really enjoy peace here. Perhaps I didn't explore the entire area, I didn't see any flat ground where families could enjoy a picnic. \n\nWasn't too hard to find street parking but I can picture it being tough during weekends.", "author": "Danae L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "We had an awesome time here today. Perfect weather, though very windy, as it is high up and exposed, so bring a sweater. Lovely to walk around, we stopped at the playground, where there is one restroom. My husband and I took our two boys: 2 and 5. Beautiful view of the city and the painted ladies. Dogs running around, lots of people sitting on the grass or on picnic rugs. There are steps up, not sure if there is a way up without stairs. But wheelchair ramp at playground and wide concrete paths throughout Park. Really great place to stop by with the family. Great play for picnic, play etc. though there were plenty of people it didn't feel packed at all. Beautiful big shady trees.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "On a whim, family friends and I decided to head to Alamo Square to take pictures of the famous Painted Ladies. These are Victorian houses that were popular in San Francisco, back in the day. Painted Ladies are preserved by the city as a historic site.\n\nParking is difficult to find, so if possible, take public transportation (or walk). An app called Rover works well for finding the nearest muni, as well as estimating your time of arrival! If you decide to go by taxi, just tell your driver you want to see the Painted Ladies and they'll know exactly where to take you. No address necessary! Alamo Square/Painted Ladies is also 0.5 miles away from City Hall and Haight-Ashbury (though in opposite directions) so you can easily walk over to those two places!\n\nWe found that the best spot to capture that postcard image is from the benches on Alamo Square. If it's nice out, the Square would be great for a picnic!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "The park has a great view of SF. Of course this park faces the painted ladies. The only downside is that parking is very hard to find. \n\nThe park itself was beautiful and there were benches to sit on. The temperature was just right with the breeze blowing. You could see all the locals just enjoying their day with families and friends.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "\"Whatever happened to predictability? The milkman, the paperboy, the evening TV....\"\n\nWhen I think about SF, I think about the houses. And when I think about the houses, I picture Full House. This is the place to be if you wanna feel like you're part of the show. The Painted Ladies featured in the theme song can be found at this park!\n\nBring a small picnic blanket and pack your lunch, or you can go on a foodventure like I did and bring all your goodies to munch on here! There's plenty of grassy areas or benches to sit so you can enjoy the San Franciscan air.\n\nBeware of the doggy doodoo because everyone brings their pups to play too.", "author": "Sidney T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Beautiful park in San Francisco.  Go for the views of the Painted Ladies, the Victorian Houses on the one side, stay for the beautiful views and the very serene feeling you get in the park.  Lovely on all sides.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "An all day trek to reach the Full House park at golden hour. Awesome.\n\nWhen my boyfriend and I took our first trip to SF together, the one thing he wanted to do was \"see the Full House house\".\n\nWe googled directions to the house and were really disappointed.  It didn't look anything like we remembered.  There was couple from Germany, who were doing the same.  They asked us to take a photo of them in front of the house.  We asked them if this resembled the house they remembered. They figured it had changed a bit over the 20 year gap, but that wasn't good enough for my boyfriend. \n\nHe googled the house used in the song and it led us to Alamo Square. It was only a couple miles away (and we were parked at the pier) so we decided to continue on foot. San Francisco is not the most walkable city. The steep hills added to our walk time and before we knew it, the sun was starting to set. Turns out, the universe had a surprise in store for us because when we reached our destination, it was golden hour. We snapped away. And to my boyfriend, the trip was complete.", "author": "Nancy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Everytime I have visited this park, the Full House theme just would suddenly go off in my head! The park is beautiful and the view of downtown SF is fantastic, but the obvious highlight is the row of colorful houses featured in the Full House theme song. I've been here during the day and during the night and there are always people just hanging around the park, mostly chilling on the grass. Accessing this park via a car is not a problem either as there is residential parking surrounding the park. If you don't find a spot the first time, just swing around and eventually you'll find one.", "author": "Chris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "This place is definitely a gem of San Francisco!\n\nFirst of all, it is in front of one of San Francisco \"landmarks\", which is the Painted Ladies (the 5 colorful houses that appear on the opening of the 90's TV series, \"Full House\").\n\nSecond of all, this square is extremely cute! Seriously, it is so relaxing to be here. And it has a great view of the San Francisco skyline.\n\nFurthermore, this square has a playground that is simply amazing! With awesome play house constructions, swings, and the squishy type of floor to protect children from getting hurt when they fall. \n\nWarning: No pets allowed in the playground area!", "author": "Andréia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Alamo Square is tourist central, of course, but whether you're an SF resident or not, you can't deny that this is an iconic and beautiful park. Views of the painted ladies and downtown on one side, dog park and views of Sutro, etc. on the other side. With the hills on all sides and crooked trees around the center, the terrain is gorgeous.\n\nBonus for me: it's essentially my backyard. But it's also super convenient to get to from Western Addition, Lower Haight, Hayes Valley, and so on.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "I can't imagine how the Full House cast picnicked on such hilly grass area but nevertheless, I'd like to picnic here someday too. I stopped by this area after realizing that I had lived in the bay area my entire life and had never ONCE stopped at Alamo Square to admire the painted ladies. I feel bad for the residents whose house is on constant display and is subject to so many photographs (but maybe they like that...?). \n\nThere's a playground and benches for those who want to bring their kids and have a nice lunch. I wasn't even aware that this place was considered a dog park until reading about it on Yelp. \n\nFor those touring around SF as tourists or for people like me who have lived in the bay area for a quarter century, this place is a must see.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Great find in San Francisco, came here to see the painted ladies. Apparently one of the houses was the house for a popular tv show. No idea about that.\n\nSo the houses were not that awesome to see, really could have done with more stand out paint. What was nice was the view from here of the city. Did not check out much else of this square, just made my way down to Japan Town from here.", "author": "Bobby N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "Came to Alamo Square so that I could see the \"Painted Ladies.\" They are the Victorian houses at 710-720 Steiner Street, across from Alamo Square Park, also known as \"Postcard Row.\" Built between 1892 and 1896 by developer Matthew Kavenaugh, they have appeared in multiple movies, TV shows, and ads. But of course they are special to me because they were in the opening credits for FULL HOUSE!\n\nIt seems like there are always several groups of people here taking pictures of the Painted Ladies. The park is really nice and also very dog-friendly. I forgot to check out the shoe garden, so I must do that if I ever come back here. Street parking can be found relatively easily 2-3 blocks away.", "author": "Esther K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "For a tourist trap, this place is a major dump.\n\nMaybe I have to be a local to appreciate this park because it isn't a nice park at all. The park is surrounded by homelessness and feels dirty. The grass isn't well maintained and looks barren. The view of the city is nice but there are much better views elsewhere (Filbert Steps, Twin Peaks, Alcatraz, etc.). Most of the Victorian houses looked ordinary to my untrained eyes. Even the Painted Ladies that everyone comes to see look OK to me. Maybe I just don't know how to appreciate this kind of beauty.\n\nOverall, I'm glad I was able to take a couple photos of the Painted Ladies but it certainly isn't a park I'd revisit. Parking can be a pain in the you know what and if you're lucky, you might end up on Divisadero where homeless people will sell you homeless paper the moment you get out of your car. Good luck!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "Nice spot on a nice day in the city. I've only been here once and it's right across from the Painted Ladies. Great spot to bring dogs or just bring a blanket and chill. Although the public bathroom here is pretty gross. We got lucky and found parking right in front of the park.", "author": "Sherry Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-02", "description": "Alamo Square is a quick stop but a must see on the speed tour of San Francisco.\n\nIt's beautiful! Smack in the middle of a residential area, this park is well maintained and home of the famous Painted Ladies aka those Victorian houses that San Francisco is known for and iconic of our childhood series Full House.\n\nWalking by, my friend and I got a kick out of the house with a sign on it's window saying \"No, this is not 'Full House'.\" The real house facade they used on the show is on 1709 Broderick Street. One could easily do the Hollywood tour in SF (Mrs. Doubtfire, Full House, Real World, etc.).\n\nAlamo Square is a nice park to sprawl. I've never done it but I did see a few people with blankets. Even on a semi cloudy day, Alamo Square is nice. You see dog walkers, dogs playing fetch, kids running around, picnics. It's all good fun and amazing for pictures. \n\nDon't forget to walk through the shoe garden by the building in the middle. I've never seen anything like it. An outdoor shrine to shoes!", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Kudos to everybody who posted beautiful photos on here.  Unfortunately when I stopped by and took pics, mine didn't come out nice.  No bueno.  Maybe it was the time of the day where the shadows were covering the gorgeous Victorian homes.   It's a perfect place for photo ops.  Good luck trying to find a parking spot.", "author": "Yuka N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "This is a great neighborhood park loved by locals and tourists alike. I still take pictures of the Painted Ladies with SF in the background, and I've been here countless times! On a sunny day (like today!), people just flock to the green lawn, find a spot, sit down and enjoy the view. We have young kids in tow, so we always head to the playground, which should win the award for \"best place to take the kids while enjoying the San Francisco skyline\". \n\nParking is quite tough, and it's a bit of a hike, but the reward is worth the effort! Oh, and if that isn't sweet enough, walk 4 blocks down to Smitten, Miette and Chantal Guillon...", "author": "Dawne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "Painted Ladies?  What area is this?  That sounds so...commercial.  Forgive me.\n\nI've seen the row homes for so many years within movie and TV clips that I wanted to get a few photos before I could not.\n\nThis seems to be one of the high points in the city, along with Chinatown.  I felt as though there was a lot of climbing.  I suppose I could have used the Route 21 or 22 buses to get within a few blocks.\n\nHowever, it was very, very chilly outside and I needed to get some exercise.  It was a good walk from the Union Station area.  The park seemed full of people just relaxing.\n\nAs you look further, you can see much of a tiny city in the distance, far below your location.  It was pleasant.", "author": "Nobuyuki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "Want to see the Painted Ladies....this is the place.\n\nIf you are in San Francisco, this is a must stop tourist location for pictures, but parking is very tough to find. Spend some time trying to get the perfect photo as there will be a ton of other people doing the same thing.\n\nIf you want a special secret, bring your tennis racquets and some balls as there is a hidden tennis court in the middle of the park surrounded by very tall trees and I have NEVER seen anyone playing on that court.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Like a miniature Dolores Park, except less crowded, less pretentious, less trash, and less bs.\n\nPicture perfect view of the Painted Ladies and downtown skyline behind it.\n\nI want to picnic here everyday!", "author": "Lanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "On my second to last day in SF and on a whim after visiting Japan Town, I looked up on the internet to see if the houses we see on the opening credits for Full House were truly in SF. Why, yes it is, says the internet. Granted the Full House used for exterior shots is not very close by, but this is a pretty neat park to visit. On one side, you'll enjoy the picturesque shot of the Painted Ladies as well as a lot of other people who have the same idea as you. It's also a very expansive park, great for dog walking and for enjoying the swings as I did (even though I am an adult, I still can't say no to swings). There are some steep areas in walking so if you are here just to see the row of houses, try to go up on the right side and not like us on the opposite side--great exercise but a little more tiring at the end when you finally locate the side with the houses.\n\nThere may be some street parking, but it looks pretty limited. Definitely bus it if you can (you are in SF--why are you driving a car??? LOL).", "author": "Grace C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "What a lovely place for a rest, a walk, a jog, a dog walk or a picnic!\n\nLocated right across from The Painted Ladies, Alamo Square has it all. \n\nA beautiful place to enjoy the outdoors in this part of the city. It almost, for a second, feels like you're not in the city at all.\n\nWhat I appreciated is that this seemed like a place for locals to go, too. I saw people walking their dogs, making breakfast plans, strolling around (without big bulky cameras around their necks) -- a nice neighborhood gem.", "author": "Kristin Leigh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "As you can see .. it was a grey foggy day .. but still worth a stop. We stopped on our way out of town so we had our own car but driving around town is awful .. so use public transportation as much as possible .. loved the trolleys.", "author": "Rhonda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "For most people Alamo Square and the view of The Painted Ladies is iconic due to the tv show Full House. For this gal, this spot derives its special meaning from the movie \"The Five Year Engagement.\" Alamo Square is the park where Emily Blunt hosts a \"pick your own adventure\" style wedding. The scene, like everything in the movie, is super charming. It imprinted itself in my touristy desires and it did not disappoint. \n\nIt was lovely to see people leisurely enjoying their weekend picnics and lounging about on the grass. The views of San Francisco from this spot are surprisingly vast and lovely. We were here during Fleet Week and the city insider pro-tip is that this is a great spot to watch the agile acrobatics of the planes. \n\nBe forewarned. This is a highly active area for car break ins. If you plan on parking nearby, make sure you keep all your valuables out of sight. We encountered shattered glass and  police offers taking reports from incidents that occurred in broad daylight.", "author": "Oulie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Great place to visit while in San Francisco!  I have never been lucky finding a parking spot here.  So, I have never yet set foot in Alamo Square.  Hopefully, one of these days I will.\n\nI sometimes drive friends and/or family here to see the Painted Ladies.  I am always reminded of the sitcom Full House whenever I go here\n\nAn awesome touristy spot in the beautiful city of San Francisco.", "author": "PatrickJ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Good luck on parking, unless you are a lucky ducky. The famous Painted ladies are the reasons you endlessly circle the park for a parking spot. It's a must see while in San Fran. The public bathroom was surprisingly clean. \nDon't forget the parking brake! :P", "author": "Tasia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Add this to your SF to-do. All the tourists do it. This is where you can see the Painted Ladies aka Full House houses... everyone takes their iconic FH pics here.  You also get a view of the SF skyline since the hill is slightly elevated. There's usually street parking at the perimeter of the park.", "author": "Suji C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "I've been here a few times while on vacation and it's a pretty nice park with views of the painted ladies.  I see a lot of people letting their dogs run and play together but I'm not sure that it's necessarily a dog park.  \n\nOverall, a very nice place to walk around in SF.", "author": "Pier H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "Great park to walk your dog and/or read a book. Even to picnic. I love how quiet and tranquil this park is. And you get a perfect view of the painted ladies.. Dog lovers unite for sure! :p I've never seen so many canines together before... Definitely a cool sight.", "author": "Arturo B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-11", "description": "Aside from the great view of the Painted Ladies with the city behind them... I didn't see a whole lot of awesomeness at this park. It did have an off-leash dog area in it, which seemed cool (even just for us onlookers -- we missed our pup back at home, so it was fun to see others playing!), but overall the park seemed kinda dirty and too crowded to truly enjoy just hanging out in it.", "author": "Justine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Everyone must recognized this place in the us tv show full house. You have a beautiful view of the city and skyline. Beautiful houses cover the front line. I love it", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "If you've watched Full House, this park is a must see.  This is where they filmed the opening credits!  Of course, this area also has some of the best examples of the \"painted ladies\" (old Victorian houses) in the city.\n\nThe park itself is not the biggest (2 blocks 2 blocks or so), and it's a bit hilly, but the green space is definitely nice for chillaxing.\n\nOther than the painted ladies, there are several other really cool-looking houses if you walk around the outer perimeter of the block.", "author": "Edward L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "Dog lovers unite! Alamo Square is a great off-leash dog park, and the sheer amount of cute pups I see here makes my day. \n\nOf course there's a view of the painted ladies, and a small swarm of tourists milling about that side of the park, but honestly it's more fun to people watch the tourists and hang out with some cute puppies.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "I have not been here since I was a child I came here recently this park is huge takes the whole block around has a famous pink ladies with just the house dog friendly come out and enjoy the park you'll love it", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "The park is beautiful. It is hard to find something so calm and rich with nature in the middle of the city. One thing I like about San Francisco is that the city is not condensed and the hills are beautiful! You can bring picnic and drinks with a blanket and hang out at the beautiful park! Many dogs like coming here too and play with each other. I love seeing the city and painted ladies in foreground! Must visit. A very beautiful destination!", "author": "Nuno V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Alamo Square is definitely one of the most popular San Francisco attractions. Parking can be really tight at times, especially because this is in a residential area; otherwise it's best to use public transit, as there are some Muni lines that run close to the area. There is always a view of the \"Painted Ladies\" and a view of the Downtown area in the distance.", "author": "Paul N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Whatever happened to predictability? The milkman, the paperboy, evening TV?\n\nYou know you sing this song too when you're passing by Alamo Square.\n\nThis is a nice park with a postcard view of the city, a view that blends the old Victorians with the rising sky scrapers.  But don't neglect to do a 360 because the vantage point at the top also provides great views of Sutro Tower and the Presidio.  It's beautiful.  \n\nIt's also a place where you can hang out with friends after brunch, take your dog for a run, or just bask in the sun (when there is sun).", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "As beautiful and majestic as promised in the Full House TV show theme.", "author": "Stuart F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "Love love love this park! \n\nSuper dogs friendly and prob is one of the very few dogs friendly parks raft is actually safe to off leash your dogs! It is not gated but the park is so huge that it's pretty safe to let then run in the middle of the park. \n\nThe view is amazing as well. \n\nParking is often easy to find around the park (except long weekend/holiday) and it's not metered.", "author": "Hunter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "BUCKETLIST FINALLY CHECKED!\n\nIf there is absolutely one thing you should know about me, know that I LOVE FULL HOUSE! \"YOU GOT IT DUDE!\" says Michelle Tanner.\n\nI can't believe it has taken me so long to finally visit Alamo Square, but boy, was I a happy camper. =D\n\nOn a nice day, Alamo Square is a great place to hang out and have a picnic!", "author": "Jen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "One of the nicer parks in the area and the weather is nice as well.  It has great views of the city, a nice open dog park, and plenty of grass for people to sit.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "I love this park.  The views of the city are fantastic.  We spent the better part of a Sunday afternoon here hanging out under an old cedar tree along with hundreds of other people.\nVery mellow crowd--hipster-ish with babies and tattooed moms.  Interesting mix.  A San Francisco original.  Then again, it was 4/20.......", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "Postcard row is going through construction and it's pretty ugly to look at.  \nLots of obstructions that make for some pretty horrible photos...=(\n\nI also think this is the HARDEST place to find parking in SF.\n\nJust a fair warning to all who think on visiting this summer!", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Nice spot to read a book. Many dogs frolicking with children. It's a nice place to get the \"big picture\" of The City. \n\nI like to stand in front of all the tourists snapping pictures and say \"Hey, hey! I know I'm good looking but ask first please.\"", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "On a winter weekday afternoon, my GF and I were surprised that the House from the tv show Full House did not have a park across it. We came to a realization that what was filmed on the intro credit scene was in a separate place. WHAT A TEASE!\n\nAmbiance:\n\n* Parking | For a week day, parking was pretty tough, but once you do, it is generally a free 2 hr parking kind of deal. Good luck!\n\n* Feels | If the grass was trimmed I would recommend coming here to relax. It is at a high viewpoint of the city. It is relatively quite as I don't think many events happen here as oppose to Dolores Park.\n\nOverall | 4 stars, the grass was muddy long. We weren't inclined to step on the grass however you do get a nice view of the city and the charming houses around it.\n\nAdvice:\nThis is not the Full House House, but a scene was filmed here.", "author": "Leland S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Remember the Alamo! \nI was visiting from San Antonio, the home of the Alamo, so I had to check this place out, and look for the basement. \nA great park to let your dog loose in, or just get lost in! The park affords wonderful views of downtown San Francisco, and the homes in the area.  \nSurrounded by Victorian architectural gems, this is a beautiful park! You might recognize the park from the opening of the TV show, Full House. There's plenty of lush grass to relax in the sun, flowers, basketball courts, shade to hang out in, park benches, etc.\nThey have a monthly flea market that has all kinds of great treasures waiting to be discovered!\nI came here a few times, and even at night, I felt safe. There were lots of foreigners here taking pictures and selfies. The people were friendly.", "author": "Curt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-11", "description": "JUNE 2014: Under construction so that was a fail. \n\nBut I'm sure its nice when its not. I took public transportation here and it was a breeze. I'm sure parking would be hard.", "author": "Kristel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "When I think about SF I don't even think about the Golden Gate Bridge, I solely think about this place and this place only....... A perfect backdrop for a memorable weekend in Frisco. Unfortunately, some of the houses on the painted ladies have been demolished but go on a clear day and you'll be transformed into a 90's kid again..... \n\nHAVE MERCY.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "We came here to see only one thing: The Painted Ladies! \n\nThis was our first stop on our little day-cay (that's a word I made up just now containing day and vacation) I was pretty pleased because in the middle of January at 3:30 in the afternoon, there wasn't a cloud in sight! And in fairness, the weather was pretty warm! \nCan I just start off by saying that the Painted Ladies is just so gorg! NOSTALGIA AT IT'S FINEST! Full House was and still is one of my favorite shows. I can watch rerun after rerun and not ever get sick of it. Sitting on a bench facing the houses just made me wish I was a kid again. No bills to pay, no finals to study for... In fact, I remember when I was younger there were days when my mom used to scold me, I cried and wished I was part of the Tanner family! Whenever I think of that and just laugh my ass off!\n\nThe hills were pretty steep, actually. Parking was a pain in the butt, but somehow we were lucky enough to find parking really fast! It's just parking parallel on a hill is annoying. Thank God I was driving because if my boyfriend had the wheel we would've hit a car or two! \nI loved that this dog park had no poop on the floor... Not that I was searching for any, but I noticed when we got back to the car that I didn't step on anything yucky. Yay me!\nWhat I regret not doing though is not going to the shoe garden! I didn't even know such thing existed until I saw photos posted here. Maybe next time!\n\nP.S. I found a debit card lying on the floor by the playground. If you think you lost your debit card here and you're reading this... Don't worry I already tore it up and threw it away! You're safe!", "author": "Irish P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-08", "description": "It's so funny that for most of my life living in the bay area, I have never been to Alamo Square.  And it finally took one Saturday Brunch at NOPA to finally see one of the most iconic views of the city.  Why wouldn't you want to take a picture of the Painted Ladies with the SF skyline right behind it?  It's modern art at it's finest!  The park itself is nice for a picnic or just hanging out and relaxing when you've been walking around all day.  It's definitely a must-visit if you're in SF!", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "What a pretty place to hangout and have a picnic with your best friends! You get to eat, chat, and have a great view of those beautifully painted houses! This is located in a residential area so parking is already difficult. Since this place is kind of a popular and tourist-y place, it's even more difficult to find parking! What sucks the most (to me at least) is that it's kind of on a hill and I hate parallel parking in a steep slope, boo! But it's a great accomplishment when you actually park perfectly on the slope because now you get to enjoy the view!\n\nMost people do just come to take pictures of the houses, which what I came for originally. But it's honestly a great place to have a picnic. It was a sunny (and somewhat windy) day when I went so it was pretty great. The park is pretty huge also. It's a giant square with four sides facing the houses. \n\nOverall, I definitely enjoyed visiting here. It's nice seeing those houses because it brings back so much memories! I definitely recommend this place but be warned about the parking!", "author": "Wendy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "******************************* 941 *******************************\n\n My hood, loving it here!\n\n- Love walking neighbor and my cousin dogs weekly at this unleashed dogs park. \n\n- Love the hills up and down, perfect for  working out.\n\n- The view of the city and the Lady Painted House\n\nDislike the tourist buses jam pack on the weekend!", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "Fun place to spend a few hours on a weekend. \n\nThe best part is that it is in a hilly part of town and there are several different hillsides each with very different views. By just walking around you can feel like you are in completely different parks. \n\nThere is a dog area but it seems like people are respectful and don't let their dogs poo outside of that area. I didn't see any dog poo when walking around.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "Beautiful Views Of The City From The Top Of This Hilly Park!\n\nMy mother and I visited Alamo Square on the afternoon of August 1st. \n\nWe arrived at Alamo Square via the MUNI bus, and walked a few blocks to reach our destination. The famous row of colourful Victorian houses called The Painted Ladies were situated on one side of Alamo Square. \n\nAlamo Square was a large urban park taking up an entire city block in the middle of a residential neighborhood. The park was perched on top of a hill, that overlooked the city. It had a good mix of open grassy spaces and treed areas. \n\nWe climbed the hillside in order to get a better and less obstructed view of The Painted Ladies. The views of the surrounding city and downtown skyline from on top of the hilly park were fantastic and beautiful and provided great photo opportunities! \n\nThe atmosphere felt very relaxed and peaceful and the park was busy with tourists admiring The Painted Ladies and lots of locals enjoying a picnic, reading, sunbathing or just hanging out. \n\nThe park was surrounded on all four sides by gorgeous and colourful Victorian houses (including The Painted Ladies) with such unique, detailed and impressive architecture. The whole area around the park was also full of beautiful homes. I really enjoyed wandering around the neighbourhood while checking out and admiring the pretty houses. \n\nIf I lived in this neighbourhood or had more time in San Francisco, this park would have been a beautiful place to just relax for an afternoon, enjoy a picnic and admire the great views from above. I enjoyed my visit to Alamo Square and would definitely recommend it to visitors in San Francisco.", "author": "Brittany T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "It's where you get the best views of the Painted Ladies.  Aside from that, it's still another pretty park.  Walk up the stairs to the top of the hill and enjoy this relaxing park.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "Many happy memories at this park: Dog watching, people watching, house watching, picnicking, meeting friends, celebrating with friendly strangers whose floats broke down during Bay to Breakers, sunbathing, and most recently watching our kid enjoy  running through it. \n\nLots of tourists and people are generally very friendly - either walking their dog, child, or partner. The view of the city and the iconic houses is breathtaking and the near constant breeze keeps one wanting to move along after a time. \n\nA lovely place to make and capture great memories.\n\nOh, and the children's playground on the West side allows you to watch your little one and the great views simultaneously.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "So many fun loving dogs and responsible owners. A constant stream of dogs to frolic with at all times of day", "author": "Wendy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "There's probably only two reasons why you visit this area:\n\n1. The \"houses\" from Full House (they're called \"The Painted Ladies\")\n2. GREAT VIEWS OF THE CITY SKYLINE!\n(http://www.yelp.com/biz_photos/alamo-square-san-francisco?select=l6g_8uWVHkUvLtBxmZFW6w#HJMVkP4A5Tkle3tdmGyTAg)\n\nWorth visiting? YES (IMHO)\n\nYelp 2013 100 for 100 Challenge - Review #93", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "Victorian Painted Ladies---CONSTRUCTION!  Be aware---one of the houses is under construction!  I was disappointed because my DH is really into photography and was hoping for some frame quality prints.  It was still nice to see the beautiful homes, but it definitely detracted.  It was still worth the trip and would be 5 star worthy when all the construction is completed.  There are many other beautiful homes surrounding this great park.  Take a look! \n\n I thought the park was neat---including great views, an off-leash dog area and a few picnic tables.  I felt safe, there were a lot of locals and tourists enjoying the sunny day. Street parking only.", "author": "Deb P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "I spent a lot of quality time in this park while living in San Francisco.  I've never watched Full House...  I'm sorry world.  Please don't hunt me down.  I did not grow up with cable.  Nonetheless, I've now watched Full House after seeing the Painted Ladies to make up for it.\n\nThis park is on the top of a hill so you get a really pretty view of the city on a non-foggy day.  It's a nice place to picnic, and there are a ton of places on Divisadero and Fillmore where you can grab something to eat.\n\nAdditionally, this was a fun place to watch the Fireworks on the 4th of July.  Make sure to get as high up as possible.  We sat toward the Fulton St side of the park and had a great view.  There will be a ton of drunk people, but it was pretty fun.  It beats trying to cram into Fisherman's Wharf with everyone else!", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "What a beautiful park in a beautiful spot in a beautiful city. I have to admit, I was expecting the park across from the infamous Painted Ladies to be a bit seedier than it actually is; sure, it's filled with tourists and weed smoke, but everyone is there to relax in the shade and enjoy the view. It's quite lovely. \n\nWhat I didn't realize is that Alamo Square is actually quite elevated, so you can see much of the city from the peak -- all the way downtown and over to Russian Hill, to be exact. There are nice paved walking paths and even a place to let your dog off-leash for a romp. The park is surrounded by some of the most beautiful Edwardian and Victorian houses in the city, which enhance the elegance and wholesomeness of the park.\n\nI wish I'd brought a blanket, a bottle of rosé and a few sandwiches for a picnic -- Alamo Square really is the ideal place for that, much more than any other park I've been to in SF. Next time, for sure!", "author": "Hilary H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "Last time I was in San Francisco, I definitely acted like such a tourist.  One of the \"touristy\" things I did?  Going on a mission to find the Full House house!  And then the moment happens when you realize you're actually looking for TWO things.\n\nSo apparently, the house with the red door they close up to in the credits is not located in the row of houses in the same credits.  Tricky tricky.\n\nIn case you were wondering, go to Alamo Square to get a view of the beautiful row of houses featured in the opening credits of Full House.  Being the tourist I am, I definitely got lots and lots of pictures.\n\nThe park?  It's a beautiful park.  Great for a nice walk, stroll, on a beautiful day.  Parking isn't too bad, but that's probably because we lucked out and found a spot right away.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "During my SF trip, I got to see the famous \"Painted Ladies\" Victorian houses in Alamo Square. My friends and I were here for like 30 minutes just to take pictures here. There's nothing that much to see except for the houses. I would probably stayed here longer if we came here before sunset and have a picnic just like the \"Full House\" theme song. ;)", "author": "Linda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "I get so happy whenever I come to Alamo Square. I love this park mainly because it reminds me of FULL HOUSE and you get a beautiful view of San Francisco and the painted ladies aka the Victorian houses. :)\n\nParking is hard to find though, so good luck!", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "The park was beautiful as always. Took some professional pictures here and event tho the weather was against me with wind and overcast they still came out amazing. Hoping to come back again when it's sunny!", "author": "Erica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-17", "description": "Go to see the Painted Ladies.  But wait a little while (this is written mid June 2014) since a couple of the houses were wrapped in scaffolding when I went.  It's worth the postcard photo op.  One of these times I'll go at dusk for a better perspective.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "This park is filled with a lot of people in the evening on a Sunday. And has a very nice view of the city. It also has a nice view of the houses that are like different and are very rich looking on the outside. It's a very calm park and very relaxing to sit down just have a drink or lunch and just enjoy the view. I will be back again.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "I recently got married and, for the wedding, my wife and I filmed scenes for a mock Full House intro here, which was pretty awesome.  Even without a specific purpose, I can see this place being a pretty chill place to hang out and chillax. This park is great, and it so HUGE!  It really surprised me how big it was.  There are even tennis courts in Alamo Square park!  Definitely didn't see uncle Joey playing tennis on TV back in the day.\n\nI think part of the reason I thought the park was smaller is due to the disproportionate attention Postcard Row gets vs the other sides.  \n\nIn any case,  I'm definitely going back even though we're done filming!", "author": "Sebastian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "\"Everywhere you look...\nThere's a heart....\nA hand to hold on to.\nEverywhere you look....\nThere's a face of somebody who needs you.\"\n\nThe lyrics that make up the \"Full House\" theme song seem to echo when you visit Alamo Square and see the infamous \"Painted Ladies.\" Maybe I'm dating myself here, but every time I see that sight I feel nostalgic with memories. \n\nThe park has a bit of a slope so you can get a bit of a hike in and enjoy all of the fantastic historic architecture that surrounds the park. The grassy knoll that makes up the park offers a great place to have a picnic on a beautiful day. Just take a quick stroll around the perimeter park and enjoy the day. \n\nAlamo Square is one of those parks that has history and a future thanks to the modern entertainment era and the people that flock to is lawn.", "author": "Chad Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "I've been here a few times before, but I decided to take a friend here to have a picnic. People always swear by Dolores Park or Golden Gate Park and, don't get me wrong, they are great. But, I prefer Alamo Square any day because you get the view and the ambiance without all the people. \n\nMy friend and I brought a blanket and easily found a place to sit. We weren't surrounded by people and we had a view of the downtown/civic center area and the painted ladies. We brought some snacks because I remembered that there aren't many places right around the park itself. There are some restaurants and convenience stores a few (very hilly) blocks away, but none actually next to the park. \n\nWe spent the afternoon playing games and laying on the blanket people watching. It was the perfect Saturday afternoon activity. Away from the tourists and the hustle and bustle of other parts of the city. If you need an escape and have the chance, go to Alamo Square Park!", "author": "Erin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "Alamo Square = a beautiful view of the city from here.  From the Civic Center, it's pretty easy to get there by taking the #21 bus.", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Protip: When viewing the Painted Ladies, walk halfway up the hill alongside the south concrete wall. Now turn and look at the Ladies... and a great view of the city!\n\n\nThe eastern portion of this park is mostly tourist traffic, whereas the western half is great for dog walking and quieter picnics. Bring a jacket for the east hill, because the winds are fierce starting in the afternoon.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "Sooo...what is this? Pretty much cosigning what Angela Z said. It didn't help that I came on a day that was bitterly cold but it seemed like most of everything is under construction, the houses are diluted, lots of dirt and just overall not a pretty place to hang.", "author": "Inês L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "I really like this place to come during the daytime when it is a beautiful day. The sunset time is also good but sometimes it is too cold to stay. When you are lucky, you can see a full moon rising behind the ladies!\n\nYou also can take a look of other location on this website.\nhttp://www.pashadelic.com/photos/25734", "author": "Kenji Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "So glad I visited this park and area.  The houses around the area are gorgeous and the famous \"painted ladies\" were so cool to see.  This is where the Tanner family picnic was filmed in opening scene of Full House. Just a really relaxing and beautiful area to explore.", "author": "Sapna D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-14", "description": "The houses were beautiful but we went during a bad time. They are currently rebuilding the park. So if you're thinking about going make sure you check if the park is still getting rebuilt cause it ruins everything.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Beautiful park with a great view of the Painted Ladies and downtown San Fran directly behind it. (Go up the hill of the park to see the buildings of SanFran). My lady and I grabbed a bagel sandwhich from the cafe two blocks away and brought it to the park to eat. We went, we ate, took pictures and left. Other than that, there ain't much to do there.", "author": "Leo S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "Such a gorgeous park! With a great view of the city and the Painted ladies!\nIts really cool to be standing in the area where they show the Tanner family having their picnic in the opening scene of Full house!", "author": "Allison P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "Reasons to come here:\n\n1) Unique uphill sloping geography makes for an unusual place to go for a walk, run or dog walk with the reward of breathtaking views of every part of the city from the top\n\n2) Beautiful, unusual trees. They look like acacias, but I don't think they are. Whatever they are, their shape and silhouette is reminiscent of trees found in Africa and Asia.\n\n3) No sketchy people. Imagine that!\n\n4) Convenient park amenities including a fairly clean public restroom, benches and lots of grassy fields make for a great place to spend a day.\n\n5) And finally, to see the Full House houses on Steiner St. Even if you've never watched an episode of this show and have no idea what everyone's talking about, the slanted row of Painted Ladies is a pretty sight in its own right.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "Alamo Square was on the top of my bf's must see sites for our trip to San Francisco. It also features the row of houses from the TV series Full House. \n\nParking was a nightmare, but definitely doable if you are willing to walk a few blocks. \n\nI didn't get a chance to stop by the shoe garden, but it was nice to just walk around the park and snap some photos before it got too dark.\n\nBring a jacket because there is a lot of wind!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "The \"painted ladies\" Victorian homes across from Alamo Square are what you see in the opening credits of \"Full House,\" but the actual house is located a short drive away in another neighborhood.\n\nAlamo Square is much more worth it than passing by the house.  We took a bus here, a longer ride from Union Square than some other places, but it was worth it.  We should've packed a picnic or picked up some food nearby, but we sat on the grass for awhile.  Not a lot of benches or screaming kids like your suburban parks.\n\nThen some people walked by, and I got a huge whiff of marijuana.  Since I was a tourist, I couldn't tell if this was just blatant stupidity (I then saw the cig in his hand), or typical San Francisco since it isn't the 60s anymore.", "author": "Angela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Was visiting the bay area for the 4th just this past weekend and took my boyfriend sightseeing. He's never been to SF before, so it was great to show him  a bit of the city's history.\n\nThis is a great place to come, sit for a bit with your lunch or your friend and just take in the view. \n\nThe painted ladies are awesome to see as well, especially if you grew up seeing them in your favorite shows. Genuinely gorgeous homes.\n\nI love SF.", "author": "April T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-02", "description": "A very nice park to spend some time in. Lots of grassy fields to just sit down, relax and take in the view of the painted ladies and downtown San Francisco. The park also has a lot of steep hills so its a good place to walk around and get some good exercise.\n\nParking can be tough around here sometimes, but it is fairly close to public transportation. Definitely come here if you want to relax and take in some of the nice sights of San Francisco.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "I absolutely love this area of the city. It is so cute and clean, unlike most parts of SF. The Painted Ladies are located in this area and people come here to sit, relax, have a picnic and take in the beautiful scenery. The park itself it pretty good size so even though it is pretty filled with people, you can always find a spot to sit down and enjoy the view. Also, if you were a fan of the show Full House growing up, this is a place you need to check out!", "author": "Courtney D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Not sure why it too me so long to get here but I finally made it over this weekend!\n\nVery cute park to relax, have picnics and play with doggies. Take pictures of the colorful Victorians aka the \"Painted Ladies\" and the gorgeous view of SF/Financial District right behind. One of my favorite parks in the city!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Great park. Closed from May to the fall though so keep that in mind when visiting! We didn't know this until we arrived.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Really pretty view from the Alamo Square! Seems like a pretty common tourist spot because once you get there, all you see are people taking photos in front of those houses from Full House haha but if you walk through the center through to the other side of the square, you'll see plenty of people hanging out on the grass, dogs running around, and people taking walks. I originally came here with my boyfriend to bring our dog, only to realize their \"dog park\" was not fenced, just simply an off-leash zone. Our dog is only 5 months so we don't quite trust him running around like that quite yet, but it looked super fun with lots of wide open space, just wished we had brought our older dog with us. Also warning it gets super windy even if you're in the sun so bring a jacket :)", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "For all the gushing I've heard about the grassy expanses of Dolores Park or the breathtaking views from the Twin Peaks, I am surprised that more SF love isn't directed towards Alamo Square. Though famous mostly for bordering the Painted Ladies of Full House fame, the square is a true hidden gem just northwest of the heart of Hayes Valley. \n\nApart from snapping twenty-three pictures of the Painted Ladies like a tourist, the square is the perfect place for joggers to get in a morning run, dog-lovers to flirt with each other via their canine companions, and friends/couples to plop down on the grassy slopes with a blanket and a six-pack of IPAs and watch the sun set over the city. The view here is truly phenomenal, especially at the end of the day. You can see as far north as to the ocean, and as far east as to the glittering skyscrapers in the Financial District. \n\nDuring a busy week of adjusting to my new digs in Hayes Valley, going to school, and trying to work out, it was nice to take a break from it all and take a walk to Alamo Square for some clarity. I sat down on a bench near all the lovebirds on the grass, tried in vain to ignore that familiar SF smell of weed in the air, and enjoyed the heart-aching beauty of this city I can now call home.", "author": "Esther W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-15", "description": "How can anyone not love this park? It gives you the most photographed spot in San Francisco. Yup, it's the view that you most often see on SF postcards which is a row of Victorian houses with the financial district skyline in the background.\n\nFor best photography, visit in the late afternoon or during sunset when the sun is shining towards the Victorian houses.", "author": "Teri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Starts singing the full house theme song: \n \nEverywhere you look (everywhere)\n There's a heart (there's a heart)\n A hand to hold on to.\n Everywhere you look (everywhere)\n There's a face of somebody who needs you.\n\nhhehe...that songs always comes up when I go to visit the alamo square and the painted ladies...parking is a burden...you may have to park somewhere far just to get to here. The last time we went it was quiet because it was drizzling and we were pretty lucky getting close parking to one of the painted lady...\n\nAt first we were like the full house house was one them but apparently it's not...the house is around the area but approx a couple blocks down. You can lounge at the park when it's sunny. The time I went before the last it was sunny and it's just fun looking at the sky...the weather is no joke in San Francisco, you look up at the sky and the clouds are freakishly moving but so fascinating.", "author": "Crystal H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Amazing views and fun to see the Tanner house! Beautiful green grass and fragrant trees! Dogs can run off leash and kids can play at the park!", "author": "Stacy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "LOVE LOVE LOVE THIS PARK. Prolly one of my favorite places in the city.\n\nAnd do you remember this? \n\nEverywhere you look (everywhere)\nThere's a heart (there's a heart)\nA hand to hold on to.\nEverywhere you look (everywhere)\nThere's a face of somebody who needs you.\n\nIf you do, then chances are you'll love it even more.\n\nBring a blanket, some snacks and enjoy the sun, view, and cuties :D", "author": "Dominique F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "I find this park enchanting.  I even like it better than Golden Gate Park.  It's hilly, beautiful green grass, gorgeous trees, and it's QUIET.  Good enough for me.  And it's across the street from probably the most photographed scene in San Francisco besides the Bridge.\n\nThis pic I took is of the Painted lady on the corner of Steiner and Grove that is still for sale for $3.9 million as of April 2010.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Cute little park with the view of the painted ladies as well as the city skyline. It's a great place to take visitors. Parking isn't bad but you might have to walk a couple blocks.", "author": "Vika N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "A must stop when you visit San Francisco.  One of the most iconic views in the city.  Scroll through the pictures and you will see why.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "I absolutely love the painted ladies!!!  however, it's probably best to go before the sun starts creeping up so that you can capture a better picture or later on the evening :)", "author": "Brooke W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "Everywhere you look (everywhere)\nThere's a heart (there's a heart)\nA hand to hold on to.\nEverywhere you look (everywhere)\nThere's a face of somebody who needs you.\n\nThis is of course one of the quintessential stops for a SF tourist, so of course I had to visit.  The park is beautiful, and it was bustling on a Sunday afternoon.  It seems like a lovely park for packing a picnic and lounging around.  I do appreciate that they have bathrooms as well.\n\nOne of the great allures of the park is to see the famous painted ladies a la Full House fame.  I recommend pulling up the theme song as you're strolling through the park to bring up some cherished childhood memories.  Unfortunately one of the famed painted ladies is being renovated which puts a damper on the pictures we're of course all eager to take.  The nerve!  I'm sure it'll look great when it's finished though.\n\nJust don't be annoying.  I watched a tourist ding dong ditch one of the famed Victorians.  Seriously?!  What's the point?  Don't be that person.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-12", "description": "It's so sad we are in such a drought. This used to be my favorite square as a kid. So many hills and green grassy areas to run around but now there isn't much grass anymore. Makes complete sense but doesn't make it the beautiful park it once was. In my opinion you can skip this park now in your touristy travels. The only reason to visit is the painted ladies but if you don't care to see them this park is not worth your visit.", "author": "Jena D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-05", "description": "Very nice park!  If you're coming at it from the east on foot, it's a hike uphill, but worth it for the views and the peace and quite in the sunshine!\n\nMy one regret is that we did not have a chance to walk around the entire park.  We came here to see the row of famous Painted Ladies houses, which we did (they are very nice, but a bit overrated perhaps).  We plopped down in the grass and just enjoyed the rest for a while.  Dogs ran by and kids played on the playground, which has a nice Victorian houses theme to it.  \n\nGreat place!  Wish we could have stayed longer (it was getting cold and we had a dinner reservation to catch!).", "author": "Johanna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "This is often a forgotten spot to bring tourist.  Not everyone remembers to come here since it's often over shadowed by the Golden Gate bridge, Palace of Fine Arts, and Lombard street. But if you are tour guide for a day and you are starting from the peninsula don't forget to stop by here. If you are coming from the peninsula, i would recommend hitting up twin peaks first, followed by Alamo square, Palace of Fine Arts, Golden gate and lombard street.  I never ever have a had time finding parking here.  You can either find it as you circle around the park or on the side streets.  Once you find parking the painted ladies or the Full house backdrop is on Steiner.  So you would want to face that direction for that perfect shot.   Overall, it's a fairly clean park. There are people who don't pick up after their dogs.  There is also a mini playground here for you to bring your kids.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "beautiful park to hang out in. since it's on a hill, it has a great view all around, although due to the hill it can also get a bit chilly up there sometimes, especially since it's san francisco after all. the painted ladies are great to see, but there's also more views if you walk along the path and through the dog park", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "While walking along Steiner, I came upon this park known more for the views of the Painted Ladies than the grounds itself. The park has much to offer. Great hills to work your quads, excellent weather for those who hate the heat, and a charming well-maintained playground for the little ones. \n\nAs you can probably imagine, parking in SF is at a premium, even in a residential neighborhood. Good luck finding much during the weekends, where tourists abound. However, if you can walk or ride a bike here, it's much more convenient. \n\nThere's a ton you can do to enjoy the amenities, Throw a Frisbee along the rolling green hills, take a nap under one of the majestic trees, or enjoy a picnic on one of the park benches or picnic tables. The only drab thing to say is the bathroom is a bit dingy and gross. But what do you expect from a public park restroom?", "author": "Andy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "\"Trying to find Full House...\" \n\nFinally came here yesterday to check out this lovely park. You get a nice view of the city skyline & the Painted Ladies. Cute playground area for little kids to play their little hearts content. \n\nIt's definitely a nice park to hangout to relax or have a picnic. :)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "Ahh full house.  It took me a year to finally see Alamo Square.  I made my friend drive around the block so I can take a quick picture of the Painted Ladies homes really fast.  Definitely a nice park and a cool tourist spot.  It wasn't that crowded which was nice.", "author": "Chrissie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "Came here the second time with my mum on labor day and I must declare the views are super awesome. It does not matter if you are from the Bay Area or outside the US this is a must see site in SF. Good for taking photos is what matters the most. If you have a dog feel free to bring them, they will enjoy it", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "Alamo square is a beautiful park  and there are amazing Victorian homes around the park but who can  forget the famous show full house has parts of this location where in the show. Very nice green space to lay out on or sit and look at the views and relax in this quiet neighborhood. A must see on the bucket list.", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "I love a dog-friendly park, and this one has world-class bonus views. We swung by on a walk around the city this gorgeous January day. It was great to hang out in the sun with all the happy people and dogs.  \n\nNow I find out there's a shoe garden? Must return!", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "ROBBED!! Our car was broken into while we were taking pictures.  We parked our car on Fulton street and went to take pictures of the Painted Ladies. We were gone less than 30 minutes! Came back to our car to find shattered glass and multiple cars broken into in broad daylight! Be careful in this area.", "author": "Alvin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "Even though there are hoards of tourists that come here to get a picture of the scene in the opening credit from Full House, it's not a tourist trap.  The park sits on top of a hill and has a beautiful view of not only the painted ladies but of the city itself.  There is a fountain and lots of green to picnic and lay in the sun on nice days.  There is also tennis courts, a playground, restrooms, benches, picnic tables and water fountains.  The park is dog friendly, there is even a fountain at dog level.  I love coming here for sunset and on sunny days.  It's also a great place to watch fireworks whenever the fog isn't heavy.  If you need picnic supplies, run over to Bi-Rite on Divisadero for supplies.  A very picturesque way to spend a lazy afternoon or kill an hour or two.", "author": "Kristi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "I enjoyed my quick visit to photograph the painted ladies. It looks like a popular spot for locals and tourists alike. It would be a nice place for a picnic.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "Does anyone know where full house house is? I keep thinking that one of those 4 victorian houses were it. Anyway, this park is full of tourists and selfie sticks. I am totally guilty of being a tourist with a selfie stick as well. I didn't explore the entire park, but it's just a regular hilly park where you can have picnics and you can do your daily run. To be honest, no one is here to enjoy the park. They're all here to take pictures of the houses to post on social media. I am guilt of this lol.", "author": "Tammy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "This park is near JapanTown. I usually do my evening run there. The park is very nice,there is a dog area as well as children playground,but what makes it wonderful is the \"painted ladies\" townhouse. And the ciew of SF financial district.", "author": "Kynan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "Anytime I have guests come in from out of town, I take them here for an afternoon picnic...providing the weather isn't too windy.  It's a great photo opportunity for them with Postcard Row in the background and it's perfect to get our dog out of the house.  Signs around the park say \"keep dogs on leash\" but there's always dogs off of their leashes...mine as well.  Dogs have always been well behaved when I am there.  The park gets crowded on hot days but never too uncomfortable.  \n\nHere's my tip:  Grab an Ike's Place sandwich to enjoy while relaxing in the park.", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "There was some construction going on by the park... But other then that, very chill park. We put a blanket down and played some board games. PERFECT!", "author": "Fatima M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "Everywhere you look, theres a heart, theres a heart. A hand to hold on to!! Full House man. Never had an urge to You Tube it after it stopped playing until this day. I didn't, but I had the urge.\n\nBeautiful little park, up and down hills, good for a work out. Like I said, check out the Full House setting. Not much else. We took \"Action Bronson squat pics\" hahaha and almost stepped in dog ish, thats nice. Lots of animals here, I guess its the parks theme. It was a very calm, tranquil place though, almost like a scene from a movie. There were dogs playing together, a playground full of children, people laying out on the grass relaxing and even a guy blowing huge bubbles on top of the hill. Gave me more love for the city.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "Alamo Square is located in the Western Addition and the Park consists of four city blocks at the top of a hill overlooking much of San Francisco. I've walked through this park, ran by it during the Bay To Breakers, and waited here for Gayle to come by during the Susan G. Komen Walk for the Cure. Several bus lines also cross here, so a Visitor should have no problem either walking here or taking public transit. I would also limit my visits to the daytime hours. \n\nThe park includes a playground and a tennis court, and on a clear day, the Transamerica Pyramid building and the tops of the Golden Gate Bridge and Bay Bridge can be seen from the park's center. Then of course there are the Victorian Houses - \"Painted Ladies\", which is one of the signature San Francisco Tourist pictures. I sometimes wonder how the people who actually liver there put up with the traffic.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "Awesome View of the city from this park!\nThis park is great for dogs or just a nice stroll around the park. It has a spectacular view of the city along with old houses that were filmed in tv shows such as full house. It is also near a farmer's market where one can buy either fresh fruits, veggies, alfredo pasta or seafood. Alamo square is also near a really popular restaurant called NOPA. So come here to relax or to walk your dog in this awesome park!", "author": "Mimi V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "Full House! Great for tourist photos and a must visit if you've never been here. Been here a couple of times for frenchie meetups, but my only gripe is that the grass is a little dirty and trash is present.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Gorgeous view of the city at any time of day - twilight, afternoon, witching hours all have their own sense of enchantment. \n\nIt can be a bit windy though. If you're planning a picnic on a Sunday afternoon that weather.com promises to be a fair temperature - beware! The elements of San Francisco may have something else for you in store :p", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "I was in the Bay area visiting family and we were doing the touristy things. Alamo Square was just one more thing to do.\n\nLots of people, tour buses, cameras, dogs, and the television series backdrop of Full House was there for all to be seen and pose in front of. (see my photos)\n\nI was there on a particularly cool foggy morning, but Alamo Square is still a sight to be seen. As a tourist destination, this place was not even on my radar.\n\nParking can be a problem for those who don't know how to parallel park on a hill, but take your time. Many tourists will come and go and you will find parking.\n\nWhen here, also make note to visit the Alamo Square Shoe Garden. It is a place in the middle of the park where people put plants in shoes. It is neat and interesting to see how creative people can be with a plant and a shoe. (see my photos).\n\nFive Yelp Stars for this tourist trap of San Francisco!\n\nAlamo Square is a little hidden gem to be seen by all.\n\n=)", "author": "Albert E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-19", "description": "\"CUT IT OUT\" I have finally made it to the park to take a view of the famous homes from the Full House opening credits. These Victorian houses are the best-known groups of \"Painted Ladies\" in SF. It is also known as \"Postcard Row\" The homes werebuilt between 1892 and 1896. \n\nIt is nice park to end up after a walk around the city. Bring something to lay down because the park is sloped so you can take in the view of the \"Painted Ladies\" and of the city. Its not the best view of the city skyline, but your there more for the place where the Tanner TV family grew up.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-15", "description": "Great views!  It makes you want to watch some Full House reruns!", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Great location.  Easy to get to.  Nostalgia factor with full house.  Those are the positives.  Unfortunately this fog haven doesnt have a fence for the dogs and it's atop a very steep hill so if your doggie is prone to run off or chase things you should avoid this dog park.\n\nI would only bring my puppy back when she's better at listening and obeying verbal commands.", "author": "Kenyon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "One of my favorite parks to visit when in SF the view here is amazing overlooking the painted pink ladies and in the back a gorgeous view of the city.", "author": "Monique C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "If you watched Full House, this is the park where they have the picnic at the end of the opening credits and also where Conan and Bob Saget mocked the show when he brought Late Night to SF.\n\nIt was such gorgeous day in the city and we had a great view of the SF skyline behind the Painted Ladies (the houses).  The best time to go is during the afternoon when the sun starts to set in the west. My friends and I had a fun time just relaxing. I know it's a very touristy thing to do, but it's something I needed to do before I moved out of CA.\n\nFYI - If you want to go to the actual Full House house where they \"lived\", that's located near Broderick and Pine.", "author": "Rhoda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "It's where you get the best views of the Painted Ladies.  Walk up the stairs to the top of the hill and enjoy this relaxing park. Parking can be a challenge, other than that well worth the trip.", "author": "Nick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "This place is so beautiful, especially when you climb uphill to check out the breathtaking view of the San Francisco skyline. My sister insisted on coming here since Alamo Square is known for being in Full House. So much fun and can't wait to visit again!", "author": "Debra T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "Really nice place to big the pups and take them off their leash! If we weren't on vacation and my pup was here, I'd definitely take him for a fun walk at Alamo Square!\n\nThe view is beautiful as you have to hike a short hill up to reach this top. It's also a popular place for you Full House fans to see the Painted Ladies! So pack a lunch and charge that battery for your camera because SNAP! SNAP! and CHOMP! CHOMP! You can do it all here and have fun in the sun.", "author": "Linda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "Situated on a hill, this park has beautiful views of downtown SF.  My brother brought me here to show me the famous \"painted ladies\" of SF, as shown famously in the opening credits of the 80's sitcom, Full House.  I'd have to say it, as a someone who used to watch Full House, that it was absolutely nostalgic to see these homes up close and personal.\n\nIn regards to the park itself, there were many people taking advantage of the gorgeous SF weather by either walking or playing with their dogs, reading a good book, or just enjoying people watching and good conversation.\n\nWonderful place to sit and relax while in SF =)", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-17", "description": "I've lived in San Francisco all my life, and yesterday was the FIRST time I've ever stepped into Alamo Square.  Sure, I've seen the postcard photos hundreds of times, recognized the shot on TV's Full House, run passed it during the Bay to Breakers many times and rode pass it on MUNI a gazillion times, but I'd never walked onto the park grounds until yesterday morning.\n\nA volunteer project brought me here.  We spent the morning scraping weeds off of the cracks and crevices along the sidewalk and curb on the Fulton Street and Steiner Street sides of the park.  We encountered numerous tour buses and even had our photos taken by some of the tourists.  Many stopped to ask about our organization (One Brick) and our work.\n\nAfter the work was done I had a chance to walk around the park.  The park appears to be super dog-friendly, but wow, what fantastic views of the City's skyline!  Even on a gray, overcast morning like yesterday the views were spectacular.  There are lots of grassy areas too and a cool children's playground which incorporates the inspiration of the nearby \"painted ladies\" into its design (pictured).  \n\nI still can't believe it's taken me a lifetime to discover this park.\n\nBTW - Kudos to the Friends of Alamo Square organization who brought us water, hot coffee, bagels, breakfast pastries and some super, moist and decadent chocolate brownies.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Going to Alamo Square is nothing to write home about other than being able to get to see the Painted Ladies which you'll do from here. It's a good park for people watching as well as catching you breath and avoiding cardiac arrest from walking to the top of it just to see a part of 90's television history.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "Came here with friends on 4th of July after reading Wes M.'s review that it was a great place to come see fireworks!\n\nYou are able to see the higher fireworks, but the lower ones are covered by buildings. It was still great, because we could see the show and didn't have to deal with all of the people at Fisherman's Wharf.\n\nAlso, you'll meet some fine San Franciscan folks. The group behind us kept singing, \"Happy Birthday to you! Happy birthday to you! Happy BIRTHDAY DEAR AMERICA!\"\nOver. And over.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Every once in a while, I have to remind myself that this park exists. And then I trek up the major Alamo heights hills to this beautiful view of the city, to reflect for a while.\n\nMake sure it's a pretty nice day though, otherwise this park tends to get really windy! Otherwise... make sure you have a jacket or something.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Nice park with some beautiful views. Grab some coffee or bring an inconspicuous alcoholic beverage  of your choice,  face east toward the city and you're set. Great place foe dog lovers or a nice place to chat with a loved one. TIP: On CLEAR NIGHTS  stay an extra 30 minutes after sunset for a nice evening view of the city lights turing on.", "author": "Nathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-12", "description": "Perfect spot to view the famous Painted Ladies...you see people setting up their cameras hours ahead of time to capture them in the perfect lighting.\n\nWhat I really enjoyed most was watching all the off leash dogs run around and play.  There seems to be a good number of regulars there, nice sense of community.  Cute!", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "Went to Alamo square to see the \"painted ladies\" and check out what the hype was all about. Ummm, mixed feelings on this place. \n\nPainted Ladies - reminded me of a Polish saying, \"the older the lady, the pinker the dress.\" The houses need some work - paint is peeling and the houses are showing their age. \n\nAlamo Park - this is a nice sot with a great view of the citywide - on a clear day you can see the ocean and the bay bridge area. Nice stop to just have a sandwich or play with your dog.", "author": "Jake K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "after searching for parking around dolores park for eons, i suggested to my friend, what about the park that faces the full house houses. she'd never been after living in the city, and agreed. found VIP parking (but observed someone bumping it trying to park in front of her car, no damage done, thank god), but GOOD TIMES. not as crowded as Dolores Park, even though we saw a lot of tourists (but we felt like tourists taking pictures as well). was fairly empty, and although it wasn't as warm as it was around Dolores Park, weather was fabulous for SF, and drinking our rose champagne, couldn't have asked for more.\n\ntheres even a bathroom, it's not the greatest (one stall door was broken), but pretty clean for SF standards!", "author": "Denise L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-08", "description": "I saw the full house house. I think I saw uncle Jesse taking out the trash, but probably not.\n\nI had an amazing nap. pretty much re-energized my entire day.\n\nLots of doggies running around and overall fun tiems!", "author": "Javi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "A beautiful park with a great view of the city, and Painted Ladies.  Good spot for some green beneath your feet and to get in a walk.", "author": "Courtney L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-08", "description": "It's the Full House park =)\n\nHow can you not love how this park makes you reminisce on being a kid and watching DJ, Stefanie, and Michelle Tanner grow up??!!?\nEspecially when the weather is not foggy, too cold, and the sun's out. \nReminds me of Union Square...you're in the big city but, still feels homey. Great for picnics, chillin, or walks with the doggie!", "author": "Laurie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-26", "description": "Alamo park is dog friendly and has some cool views of the city. Plenty of clean benches to sit on. The grounds are in need of maintenance. However, the city has no money and is completely incapable of managing money. So parks like this are adequate, but improvements are few and far between.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-09", "description": "Let's face it, people visit Alamo Square for one reason and one reason only, and that is to see the houses from Full House!  These houses are formally known as the \"Painted Ladies.\"  Nice park, although no Tanners to be seen.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "On a beautiful day, it is amazing to have a picnic with your friends or to have a date there :D My boyfriend was stressed out that day, but I took my boyfriend there and surprised him with a picnic. His stress was out the window. The dogs there, the city scenery, and the beautiful day made him mellow :) So good there if you need to de stress! :D Plus, it was nice to be reminded of Full House LOL.", "author": "Jeca V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-08", "description": "I don't think I'll ever get sick of walking though this park on a beautiful day in San Francisco and peering in all directions at the gorgeous views our lovely city has to offer. How spoiled are we to have a place like this right in the center of town?! Why anyone lives in Cleveland, I'll never know.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "It's a park...with a view. \n(see pic)\n\n...and halfway through our awesome \"view\", I smelled poop.\njust sayin'", "author": "Sherri K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "What ever happend to predictability?\nThe milk man, the paper boy, evening T.V\nYou miss your old familar friends, but\nwaiting just around the bend.\n\nEverywhere you look (everywhere)\nThere's a heart (there's a heart)\nA hand to hold on to.\nEverywhere you look (everywhere)\nThere's a face of somebody who needs you.\n\nWhen you're lost out there and your all alone\nA light is waiting to carry you home\nEverywhere you look.\n\nYou got it dude...", "author": "Nino R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "Little House's on a Hillside, Little House's on a Hillside..........\n\nOne of my first Picnics in SF was at Alamo Square, even though it was a gorgeous day and it was a Saturday at noon, somehow I still found a beautiful patch of green grass, where I laid myself down. \n\nSuch an amazing self realization moment, when you sitting on that green patch. There is no way you can sit there with a frown on your face. Once you settle in and stare at the gorgeous view of the  painted ladies with SF's skyline as your background, all your worries melt away, and your overcome with a sense of personal nirvana.  \n\nI'd say somewhere in Alamo Square is the answer for World Peace.......", "author": "Lannette G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Alamo Square is a great open area for dogs and people to walk and enjoy the city's view. There are tennis courts, bathrooms, an open grass area and dog park. Come on a sunny day but always bring a jacket! San Francisco weather changes drastically. There are many places to eat around the area too if you just want to stop by for the view.", "author": "Joanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-18", "description": "Sighhhhh. How could you not LOVE Alamo Square? The view of the city is BEAUTIFUL, it's never very crowded (except during Bay to Breakers), and it brings back so many fond memories of watching Full House as a child. \n\nIf you're in need of some sustenance and liquids to get you through a long day of park-lounging, Alamo Square Market & Deli on Scott and Hayes has great sandwiches.\n\nProbably my favorite park ever.", "author": "Talia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "The Painted Ladies are cute, sure, but not very interesting in the grand scheme of things. So if you're visiting Alamo Square for the Painted Ladies, that's perfectly fine, but a three star experience. Now if you're coming to Alamo Square with your dog (or leashed cat!) and maybe some friends, relax a bit, play with your beloved pet, then Alamo Square is a five star experience. It really is a great dog park but as far as touristic attractions go, you've seen everything you need to see within five minutes. Or less actually because we in fact kept on walking up from Alamo Square when we first got there because we all thought \"Seriously? That's it? This can't be it, this is nothing, we must be in the wrong square!\". But we weren't. This was seriously it, this was the right square and the most amazing thing there was a couple relaxing with their leashed cat and puppy.", "author": "Bekkah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-14", "description": "If you want to check out the houses in the show Full House, this is the place to go!", "author": "Danny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "I really love this park, as do my dogs!  Half of it is an off leash dog area, and even though it isn't fenced in, it's up above the street and feels like a really safe area for the pups.  The park itself is really pretty and well maintained, and as far as I've seen all the dog owners clean up after their pets.  The dogs have fun playing, owners enjoy chatting, it's a great place for you and your furry friends.  Then on the other side of the park you can relive your childhood with the Full House houses (never gets old).  There is also one tennis court and a fenced-in play area for children :)", "author": "Allison R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-23", "description": "I happen to think this park kinda sucks. The one upside is the views of the painted ladies (aka: full house houses).\n\nhttp://en.wikipedia.org/wiki/Painted_Ladies\n\nIt's on a hill so you can't really play a decent game of soccer or basketball.\n\nI've heard it is popular for dog owners.  Apparently it's not popular among non-dog owners as we get to step in dog shit all day long.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "Pros: Nice views, quiet, some shade, right size, great for a picnic.\nCons: Windy. Some people are not responsible with their dogs.", "author": "Pablo D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-12", "description": "(cue Full House theme song)\nWhat can I say? I love SF. \n\nGreat park with vast expanses of grass for dogs to run off leash and play. Keep in mind, nothing is fenced in so make sure your animal is obedient and well-trained. There is an area just for dogs but they are allowed everywhere else in the park as well. All owners seemed very responsible, picking up after their dogs and watching them closely. \n\nIf you don't have a dog, this is the perfect spot to grab a blanket and have a picnic on the grass. Parking is pretty easy and the are barely any crowds...besides the usual group of tourists huddling around with their cameras snapping photos of the Painted Ladies. There is also A tennis court...but it is SINGULAR. Only one. That I could see anyway. \n\nParking was not that bad in this area and no large crowds. Love!", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "Just another breakt-takingly beautiful SF park, that makes you sad at your lack of financial ability to living in these houses, and leaves you with the Full House theme song stuck in your head.\n\nEVERYWHERE YOU LOOK....", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-15", "description": "Honestly, who cares about the Fullhouse houses?\n\nThis park is great regardless, and if I lived in this area I'm sure I'd be hanging around here most of the time. Fun dog watching, incredible view, even at night.", "author": "Jessie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "I honestly don't think this view could ever get old.\n\nSeriously - can't get it out of my mind.\n\nPeople laying about - drinking wine, beer... listening to music.. just enjoying the city.  It was oh so charming.\n\nIf you're visiting you need to make a stop at Alamo Square... IMO.", "author": "Tony K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "I hate to blow up the spot, but this is one place in SF that is ironically both the best kept secret here as well as one of the hottest tourist attractions.  I see tour buses and tourists here all the time, but whenever people ask me where I live and I say \"Alamo Square\", they're like \"huh? where's that?\"\n\nFor visitors, it's a must see simply for the amazing vantage points to take some postcard worthy photos.  You can see the famous row of painted ladies that are featured in the opening credits of Full House (and on countless postcards and souvenirs).  On a clear day, you can also get a fantastic view of the city skyline as well.  \n\nFor locals, it's a great place to bring your doggies.  There's an off leash area where the puppers can run free.  Just be careful as sometimes people aren't very careful with their own dogs.  If you have a small dog, be mindful that there may be large aggressive dogs running around.\n\nParking is not too bad during the day, but after about 6pm it can be a b*tch.  \n\nAs a neighborhood to live in, well it's pretty awesome if you can find a spot that's affordable.  It's super close to Hayes Valley, Pac Heights, the Fillmore, Lower Haight, etc.", "author": "Preethi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Growing up in the 90's and watching Full House, we were not going to miss the Alamo Square and the famous Full House house. On the other side of the park was a nice view of the city, which was breathtaking. There were lots of people sitting and relaxing. I won't see that in Long Beach. You can't miss visiting the Alamo Square if you are visiting San Francisco.", "author": "Neang C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "Beautiful spot on the hill to get a picture of the Full House houses! I loved this spot on our sightseeing adventure. Bus takes you right there & it wasn't overly crowded. Great views of the city from atop the hill.", "author": "Dawn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "So I live like 2 blocks from here and its really nice. I walk by them all the time cuz its a nice little uphill workout. Plus the park is really nice, well-kept, and the scenery of the Painted Ladies and the city behind them is gorgeous!\nIts really nice on a warm day. Just lay out in the sun on the grass. Everyone minds their own business, people are really good about picking up after their dogs, there are restrooms if needed, and even a tennis court.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "My apartment is about equidistant between Dolores Park and Alamo Square Park. Alamo Square Park feels like the quieter, less outrageous, less warm and significantly less in-your-face cousin. Where one can REALLY get some reading done, not just watch kooky people get drunk and toked up.\n\nThe doggies here are cute and don't take over the space like my neighborhood park, Duboce Park.\n\nI get a kick out of taking visitors here to show them the full house houses. If I am not here with out-of-towners, avoiding that side of the hill is best to maximize the peace and quiet this park can provide compared to other major parks in the city.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-16", "description": "I love this park!  There's always people on the grass laying on a blanket with a view of the Painted Ladies and the city in the background.  There's plenty of street parking during the day.  Highly recommended to bring tourists here or to have a picnic!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-19", "description": "I don't understand why anyone would give this park less than 5 stars! Alamo Square is huge, if you're lucky, there's tons of parking nearby, and if you're not so lucky it's easily accessible by public transportation, walking distance from many eateries, clean, and most importantly, has one of the best views in SF. Remember Full House with the row of houses? Those houses are right in front of you along with a nice view of the city! If you go on the other side of the park, you have a wonderful view of Twin Peaks. Seriously, the best park ever.", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Awesome park with a great view of the TransAmerica building and City Hall! Come relax on the hillside and enjoy SF =)", "author": "Sam F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "**Cue in the Full House theme song......\n\nI'm such a tourist so of course I came here just to see where the characters of one of my fave shows growing up frolicked....and there it was!  *sigh*  nostalgia.....\n\nIt's a nice park though.  Not too big and not too small.  I guess there's a part of the park where your doggies can roam around free, but uh I saw them in all parts so not sure where that area is?!   A lot of grassy areas to throw your blanket down and have a picnic or just lay out.  Great view of the painted ladies as well as the city skyline.  I wish I came here around sunset for the photo op.  Maybe next time!", "author": "Bernadette M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "Perfect view of San Francisco's famous Painted Ladies.", "author": "Rose A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "Best park to enjoy an Ike's Place sandwich. \n\nThe girl to guy tourist ratio is very high, so I rate it high on the pickup parks charts. \n\nBathrooms have soap and seat covers, very clean, probably due to #1 in Rory H.'s review.", "author": "Luke H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-03", "description": "I have to post this in the middle of the night in the hopes of avoiding the wrath of the SF crew.  Far be it from me to criticize a public park, but Alamo Square is way overrated.  It's just a big hill with grass and a few trees.  Oh, and a janky tennis court.  And a questionable restroom.  But that's it.\n\nI never knew about the Full House connection until reading the little review blurbs along the right side as I write this.  Yeah, sorry guys--that is not a good enough reason for four or five stars.  San Francisco has some great, great parks; in fact it has the best large-scale parks in the country.  But Alamo Square is just a boring piece of land.  It's good for the same things that other parks are, which is a beautiful thing, but that just isn't enough.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "My favourite spot in SF. Just seat on the grass and enjoy the \"painted ladies\".\n\nMon spot préféré à SF. Asseyez vous sur l'herbe et comtemplez les \"painted ladies\"", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-25", "description": "My favorite city park for a pic-a-nic and this is why:\n\n1) Bums seem to lazily avoid the hills that form the perimiters.\n2) Saggy trouser drug dealers prefer other less touristy parks.\n2) Nice grass and gardens.\n3) Awesome view of skyline and famous SF architecture.\n4) Tourist watching at its best. How many random tourists have sat on the porches of the Painted Ladies for a photo op?\n5) This is where Danny Tanner prefers to picnic.", "author": "R J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-01", "description": "ATMOSPHERE:\nThis park has a good view of the city! And plus the Full House houses! (Painted Ladies) ^________^ \n\nNot only that but it has \n\n1.) Playground\n2.) Tennis court\n3.) Bathroom\n4.) Nice Grassy Hills to lounge on", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-21", "description": "Last night my neighborhood park evoked the feeling of NYC in the summer. At 10 pm, people were still milling about, parked on blankets, sipping wine under the stars, walking their dogs, and talking to neighbors. At that hour, it was still a balmy 80 degrees, a far cry from the usual wind-whipped meat freezer it becomes when the sun sets and the tour buses leave.\n\nWhatever its incarnation, my local park rules and kicks Dolores Park's ass! Okay, maybe not. It can't compete with the sheer size, sun exposure, and various demographics (the gay banana hammock lawn on the southeast end, the gangbangers on the west lawn, or drug dealers, but for a little park it kicks butt.", "author": "Suzanne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Great FREE place to visit while in San Fran. Beautiful views and close access to other  sites", "author": "Marty B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "I love this dog park, it's nice and close to my house.  Lots of nice dogs and people too.  only bad thing is when it gets muddy the hills are terrible!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-29", "description": "As a dog-owner that lives nearby, this place has become my home away from home. We take our dog there 2-3 times a day and he gets to roam free in a pretty large off-leash dog area. The people that also take their dogs there seem great and responsible, which makes for happy dogs, happy dog owners and a clean park. Best part - there are NO squirrels to entice my furry companion to disappear.\n\nAs just a visitor sans furry companion, this park is very well kept (grass is green, trees are trimmed, etc) and offers great views. Large tour buses come regularly to schlep tourists to see the Painted Ladies. There is a deli/convenience store nearby (plus!) in case you wanted to have an impromptu picnic and it's perfectly situated along the Bay to Breakers route (plus! plus!).\n\nWithin the past year, they cleared out the a lot of the underbrush below the tall trees and in some other areas so that certain people and activities would be discouraged to stay. Turns out it worked!\n\nGreat place for families. There is a lovely playground area that is kept just as clean as the rest of the place. One tennis court is available (no lights for night-time though) nestled among the trees. There are also public restrooms available (but I'd leave those for the tourists).", "author": "Jasmyn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-03", "description": "Full House. Why else would you come here? Maybe the view is beautiful too. It wasn't until I saw the 5-year engagement that I told myself I should come here. I brought my sister here as we grew up watching the show. It was pretty funny trying to figure out which house they lived in and which was Kimmy's. I feel sorry for whoever lives there, they must get bothered a lot from tourists and nostalgic people alike. It was pretty windy there, and definitely an uphill/downhill hike.", "author": "Phan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "I like to walk cities.  \nI like to take mass transit.  \nGetting your soles down with the sidewalks of a town is my preferred method for getting to know a place and making it mine.  \n\nAfter exploring the Haight, I huffed it to a hill.  I wanted to meet some ladies....The Painted Ladies.\n\nThese Damsels of the Bay truly are a must see (even if they've been snapped, photo-ed, painted, etched, filmed, and written by many a person).  \n\nI was lucky to make it here on an excellent-weather day.  Sure the Painted Ladies are the stars here, but there is so much more.  So, snap your pictures of the dolled up chicas, but be sure to explore this park.  This park is a green space with a small hill at its center.  At the peak, you will find a banos/loo/bathroom which was rockin' it's early 20th Century grandeur and was surprisingly clean---California budget woes???  I wouldn't know it from this spic 'n' span bathroom pit stop.\n\nOn the hill you have very tall and cool trees and shrubbery of many types.  Work them into your 360degrees of photo opportunities here.  People-watching also abounds here.  If you're a doggie lover, this park also serves you well with all sorts of mutts running with abandon in the sun on the green green grass.\n\nSpeaking of grass, I ended up parking myself on a patch and ended up pulling out my Don Quixote (Yeah, Cervantes has accompanied me to many places.  This book is my Sancho on my worldly adventures of slaying city serpents).  I tried to read a few pages, but as usual, my surroundings were too distracting.\n\nOk, this is my challenge for you.  I dare you to take a nap or read a book here.  \n\nGo ahead.  \n\nTRY IT!  \n\nI assure you the distractions of this beautiful park, in this magnificent city, will slay you every time.", "author": "Corey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "Walking up to the top will give your cardio a little boost.  Of course when we went, two of the homes were being painted or reno'd or something so we didn't get that 'classic' postcard look we hoped for the but view is still amazing even if all of the painted ladies were tented and not just two.", "author": "A. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Beautiful day today to enjoy the sun at AS. Spent time with the family on the grass and also at the kids playground - hidden behind the trees. Lol. Must visit if you're from out of town.", "author": "Karol S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "I had to check out this park coz of Full house! Omg! I was too overwhelmed! Just to sit and relax and feel nostalgic about full house! Loved it! cute lil houses they call Painted Ladies(no idea why) around! so damn cute!!!!", "author": "Sara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-28", "description": "I've been here twice and the only reason why I come is to see the \"Painted Ladies.\" If you're trying to get a good photo of the \"Painted Ladies,\" the best time to come is after 3PM. The sun is on the correct side and you'll getting pretty decent lighting. If you come in the evening, on the opposite side of the \"Painted Ladies\" you can catch a really nice sunset.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "Really nice park, and it's big enough to get away from most of the tourists that stare at the Pained Ladies (Full House house) \nI can't wait for my puppy to be a little bit more reliable so I can let him off of his leash to play.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "An AMAZING neighborhood park.\n\nScenic from all angles, historic, and a great place to have a picnic or just enjoy a drink in a beautiful place! This park always has great vibes and is an awesome place to bring your dog. If that's not enough, then go there to watch gobs of tourists do their best pose in front of the painted ladies. \n\nBottom Line: Check this place out whenever the sun is shining, you will not be disappointed!", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-27", "description": "Beautiful neighborhood park! Great views of The City,great dog area,nice tennis courts,& lovely place for a picnic. It can be windy at times,so bundle up if it's a chilly day.", "author": "Shelley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "When Dolores Park is too crowded, when Golden Gate Park seems too far, Alamo Square is just right. Never too crowded, good place to let dogs run. Most important, the views of downtown are simply spectacular: the painted ladies framing the skyline.", "author": "Dustin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "Famous for being on the title sequence of Full House, Alamo Square park offers much more than a photo op with the \"Painted Ladies.\" It's also home to a dog park (no fence) and affords lovely views of the city. A great place to soak in some sun, or for tourists, to rest your feet and take a pee break (bathrooms are at the top of the hill). It can get super foggy of course, and the temp can drop rapidly, so if you're planning to stay around, bring lots of layers and maybe even a blanket.", "author": "Ana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "In typical SF fashion I came to Alamo Square park for some day time relaxing. \n\nWith my packed lunch and a bottle of wine I sat there with some friends and just let myself be! Great thing to do every now and then. \n\nThis park is awesome for a few reasons. 1) The painted ladies. They are really a staple of SF and I enjoy SF architecture. 2) Tons of fun people bring their dogs here to play fetch with. Being a huge dog person I really love this! and lastly / most importantly 3) I REALLY loved Full House as a child and this totally makes me happy to be in the park from the opening credits. \n\nYA and I even busted out my iphone to play the Full House theme song... Whew! I admitted it! \n\nGreat part with an awesome view of not only the painted ladies but all of downtown SF!", "author": "Dawn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "A fantastic park.  Full House memories will flood you as you overlook the Painted Ladies, and you get a beautiful panoramic view of the city.  The park itself is actually much bigger than I originally thought; there's a playground and pathways to walk through that makes you feel that you're taking a leave from the city life for awhile.  But, of course, still in the city.  :)  Wonderful spot to grab a coffee, read a book, or just take it all in.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "A big green park on a sunny SF day is like finding a $20 in the pocket of your winter jacket. What a treat!", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "Cool park, for our kids it was a blast and our dog loved it too. Look forward to coming back.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-12", "description": "Just knowing that I was going to go to see the famous Painted Ladies from the show Full House was satisfaction itself.  I was so giddy with anticipation going over the little hill on Steiner Street.  When I finally got sight of Alamo Square and the Painted Ladies I had died and gone to heaven.  Full House heavily influenced my childhood so it was so neat to finally see the famous opening scene in person.  On the day I went the weather was a bit cloudy so I didn't get a good view of the city behind the houses.  All in all...it was fun going!!!", "author": "Celin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "Damn it.  I just wrote a long review that got eaten.  Sorry if this is scatterbrained, but I'm angry right now.\n\nThis is one of the best parks in the world.  I won't bore you with all the details of why this is a fun park.  But I'll point out two things you probably don't know about Alamo Square.  Up by the bathrooms and tennis court, there are plants potted in different kinds of footwear.  The tradition is that when you move out of the neighborhood, you leave a pair of shoes or heels or ski boots for the groundskeeper to pot plants in.  I hope I won't be leaving my shoes for a long time.  They filmed part of Invasion of the Body Snatchers in the playground.  \n\nThis park makes me proud to live in San Francisco and this neighborhood.  I take it for granted, but it doesn't hold it against me.  It's also a nice place to take dogs and kids, preferably at the same time.\n\nOh, and I absolutely abhor Full House, but you people really did not watch your sitcoms very closely.  The opening of Full House has them picnicking in Alamo Square, but their house is not one of the Painted Ladies.  Their house is actually in the Marina or Cow Hollow or whatever.  It has a red door.  None of the Painted Ladies has a red door.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-14", "description": "This is a gorgeous urban park - it's known for iconic views of a row of Victorian houses known as \"Painted Ladies\" with downtown San Francisco above in the background.  Great place to go have a picnic, read a book and enjoy the people and dog watching.  Bring a blanket or a chair because the grass/ground can often be damp.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "yes yes, this is where the full house house is... so be prepared for lots of tour buses and people taking photos.\n\ni love the dogs everywhere :)\n\nthere are tennis courts.\n\ni came to lie down after walking around the city. nice place to just sit and chill. on a sunny day, it's bliss.\n\ni also remember (slightly) doing my first beer bong here for bay to breakers a couple years ago wooooooohoooooooooo", "author": "Kailey O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-23", "description": "Main reason I wanted to visit Alamo Square was 'cause of the Painted Ladies.  Second was 'cause of the view behind the Painted Ladies.  Third was 'Full House' (I'm a huge Olsen twins fan!).\n\nThankfully we arrived just before the sun set, around 5:00 pm, so we could still catch a couple of daytime photo ops.  Really, really beautiful and breathtaking views of the city behind the Painted Ladies.  I imagine those houses are really expensive since they're so well known.  But that's off-topic.  \n\nAlamo Square is definitely a must-see in San Francisco!", "author": "Ivy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "Day three of our vacation GBF#1 and I knew we wanted to head out to Richmond for some dim sum so on our way there we made a pit stop at Alamo Square just to see the lavish Victorian cookie cutter houses and some painted ladies.  \n\nWe arrived early in the day and the park was filled with people walking their dogs.  OMG so many dogs, some cute, some ugly, some big, some small but so many out having a grand old time in the sun and grass and very little poop on the ground.  The park also has a pretty big play ground for the little ones to play on and if I remember correctly tennis courts too.  \n\nBesides the houses, the dogs, the playground and the grass Alamo Square also has some amazing views of downtown San Francisco and thankfully we were there on a very clear day so we could see for miles around.  Oh and I guess I should add something about Full House and the Tanners to make it complete so there I mentioned them.", "author": "Me H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "It can be a bit of a tourist-trap, but it's a great spot to hang out with your pooch.", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "A good friend of mine lived at Steiner and Wall. Another one of my besties lived at Page and Pierce. Collectively they lived in that neighborhood for more than a decade and a half and never once did we even venture out to Alamo Square. \n\nHowever, one day, on the way home, BA and I decided to stop the car and picnic because the sun was shining and we just happened upon that rare parking space. I remember it vividly, we had Mediterranean. The memory is a brief but a good one. Sigh. I wish we had more than just that one afternoon there. RIP BA.", "author": "Chum L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "If you're visiting San Francisco, Alamo Square is one of those places that you must \"check in\" to and check off your list! Such a beautiful view of San Francisco and the \"Painted Ladies\"!!! Once you park and walk up the hill, the theme song from FULL HOUSE automatically plays in your head. \n\nTIP: Drive a couple blocks down to Broderick and take a picture in front of the house! \n\nGreat picture of SF, great place to let your dog run free, nice park to have a picnic!!! Restroom was a little dirty but what park restroom is nice and clean? Parking is horrible (as always). So Drive by on your way to PIer 39 and Lombard St!", "author": "Sara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "Ahh Ahh Ahh Ahh Chity Chi bob botta.....sing it Uncle Jesse!\n\nIf you need to fill the void that was left when Full House went off the air, if the nostalgia of TGIF and simpler times are what you are searching for, this is where all things become right in your world again. \n\nThe park itself is beautiful, well kept, and not just a tourist destination but one frequented by the locals as well. The views from the top of the sloping square are amazing and were well worth the little hike we made from our hotel in Union Square.\n\nThere are many parts of San Francisco that I did not have a chance to take in on my short visit, one intriguing bit would have to be this shoe garden that everyone talks about and posts pictures of. If that's not reason enough to get back to the west coast then I don't know what is.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "San Francisco never disappoints.  I've visited the city nearly 50 times and although I can no longer visit the Fisherman's Wharf - might just puke into my mouth if I went there again - I haven't had the exposure to see different neighborhoods of this city.\n\nThe Alamo Square is a terrific little hill top located in the Fillmore neighborhood.  The park itself has a nice tennis court.  I love how the tennis courts in San Francisco are always located at these perfect places.  (remember the tennis courts at the Presidio?)  No tennis player is really looking at the view while actually concentrating on the ball, but there is a certain aesthetic appeal to having a tennis court perched on the top of a hill, with Victorian residences in the foreground and almost every sightable sight in the background.\n\nThe dog park is a wonderful little patch of land, and even though I don't have a dog myself and don't even live in San Francisco, I wish I'd one day be a pet owner, playing with his pet on top of this park.  \n\nOne must mention the Painted Ladies.  If you're into architecture history, make sure you check out the painted ladies from the park, especially when the sun is hitting just the roof tops.  A mix of Victorian style houses and Edwardian style houses, both truly dating back to the time that these styles existed.  \n\nThe romance of San Francisco is fully appreciated in the Alamo square area.  Views ranging from downtown to twin peaks and everything in between, put this hill top as one of my favs, ahead of Nob Hill too.", "author": "Aditya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-16", "description": "When I come to Alamo Square only 2 things come to mind:\n1) Full House \n2) the amazing view of the skyline!\n\nI've lived in the Bay for most of my life and I had never been here until recently. And I literally discovered that day that the view was that amazing. I had no idea that it was where Postcard Row was! I just knew it was where the Painted Ladies were (why that connection never clicked in my head I will never know lol). \n\nIt's pretty cool that even though it's kind of far away from Downtown, it's high enough on the hill where you can just see the buildings in FiDi peek out over the roofs of the Painted Ladies.\n\nAnyway, though it is a tourist spot due to the Painted Ladies, it is in no way super touristy like Fisherman's Wharf and that's exactly the way I like it. A good mix of locals and tourists, just like the Golden Gate Bridge and the Embarcadero areas. \n\nIt is a bit of a pain to get there just because of the hills you gotta climb whether you're walking or driving. Parking is a bit scary if you're not used to the hills. \n\nNevertheless, it's well worth a visit, especially if you're a 90s kid like me and you watched Full House religiously.", "author": "Constance C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "One of my favorite places to go to in San Francisco. I love it here. Just strolling around and people watching is fun. Can't walk away without a picture in front of the Painted Ladies. Beautiful!", "author": "Rebekah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "Great park! Love walking around with my shoes off and strolling in this wonderful yet hilly park! The views are spectacular, the ambiance fantastic; they even have a playground for the little ones. I just love coming here and yes, I found myself taking pics of this wonder. Historic area and a hop skip and a jump to anywhere in the city. Great park to have a picnic with friends and special loving people as well.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-25", "description": "Please don't pee in Alamo Square anymore.\n\nMy first memory of Alamo Square is when I went walking in SF and happened upon a Shoe Garden. Then closely followed a walking tour group to realize I was in the famous park with the \"houses from that one TV show\" I was discovered by the tour guide when I yelled out \"Full House\". He shooed me away. ::smile::\n\nMy second memory is when I passed by Alamo Square during Bay to Breakers only to see that my favorite Shoe Garden was being pee-ed upon by many drunken citizens. This made me sad. How would you like it if the Shoe Garden pee-ed on you? Huh! \n\nThat is all.", "author": "Cat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "True to city-dwelling form, I relish open park spaces, lying out on the grass, and just watching the world go by. Yes, Alamo Square Park is right next to the Painted Ladies, they are beautiful, yes. But this park is also a really lovely spot to sit and watch puppies and look over the other city vistas. Listen to the wind rustle through the cypress and eucalyptus trees. Bring a book and a jacket. Watch the clouds go by.", "author": "Mea H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-24", "description": "Alamo Square is a very nice (hilly) park located across from the world famous \"Painted Ladies\". I must warn you that it is a few steps to get to the top of the park and the only true way to take in the view of the city and the Painted Ladies is from the top (worth the climb).\n\nParking can be tought since it is a popular tourist stop so prepare to drive awhile around the park before finding a parking spot. \n\nSimply a must stop especially on your first visit to SF.\n\n*Insert Full House theme song here*", "author": "Saul A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-22", "description": "Unlike the other bashers who think Alamo Square is for the foreign folks - I think this is a lovely place to relax for a few even if you are from here. Maybe even snap a picture or two; even though I've already done it a million times -it's just what you do!\n\nA lovely place in a lovely city. I always laugh about the 7th \"step-sister\" the one on the left...it looks a bit out of place.\n\nTake Note: This is NOT the location of the Full House house.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "Full house houses! Cute park. Well maintained. Love that I can always find parking around here!", "author": "Leana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "i was here for one thing only... take a pic in front of the \"FULL HOUSE\" scene. yup that's it! another item done on my things to do before i die. \n\nwell i'll just say that it is very pretty.. i can just picture myself having a picnic here. It was quiet, the weather was nice - you got the sun and the cool breeze from the bay, the view was gorgeous. I wish i can bike around here everyday.", "author": "Cherie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "Love taking the dogs here! People are really responsible with their dogs and I love that the dogs can go leash free. Also a great spot for a picnic with the pup and to show tourists. \n\nClean and a great view of the city!", "author": "Kellie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "If you're a tourist, come here for the Full House houses and the view. If you're a resident, come here for the dog park and the noticeable lack of  compared to other parts. In other words, no matter who you are, come here. \n\nDon't count on parking; I live on this block and it's often rough. Take the 21 Hayes or 5 Fulton or the 24 Divisadero or the 22 Fillmore.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "Maybe it was the prospect of living a block away from here. Maybe it was the 4505 meat in tube form to my face. Maybe it was the sunshine. Maybe it was the mutts running amok in a good way. Maybe it was the gal on my shoulder. Maybe it's the idea of Stamos & Saget getting tipsy and tumbling down these knolls at 3am rehashing their mullet-ed past. There are so many reasons that lead to adding all the parts of this park up for it to take the top spot of the highly competitive SF Parks. Golden Gate is a village of itself, and really special, almost so much it's on a list of itself. But the other urban parks in neighborhoods: Dolores, Duboce, Lafayette, Alta, Precita. They're all special. Some not even mentioned. But here. Man. Views, space, benches, dogs, dog space for off leash, woods, and central location. There won't likely be pot truffles, riotous tents being posted up for impromptu concerts, and you won't feel like you're on the school ground recess park like Dolores. You're also likely not to be hassled by any street life asking for change or newspapers to blot away their urine on their pants. This park restores some faith in a civil city. It really makes for a weekend destination. A weekday relaxation break. A reason to walk and rest. Like the Alamo, preserve this space.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "This place is NOT a dog park; it's a park you can take your dog to play off leash and that's as good as it gets. Surrounded by busy streets, tour buses and people everywhere,  dogs must have excellent recall and voice control which makes this a great place for a family outing with Fido.", "author": "Mark I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "Painted Ladies. Shoe gardens. Transamerica Pyramid views. Twin Peaks glimpses. Plenty of grass to relax on while taking it all in.\n\nAs the tour buses roll by and the tourists snap pictures of one of the most quintessential spots of our mighty fine city, you gotta think some secretly want to call this magical place home. So glad we do.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-19", "description": "I've lived in San Francisco for 26 years and the beauty of  this city still blindsides me at random moments.  I  ride by Alamo Square and the Painted Ladies on the 21 Hayes every single day on my way downtown.  And each morning I have the priveledge of stopping to think, \"Is this my life?  Do I really live here?  Is this city really mine?\"\n\nAfter all this time, the magic didn't fade.  I will never move to Walnut Creek.", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "Buster loves to root around in the grass here amongst the city views. Great place for pooches!", "author": "Laura F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "Great park. There are constantly people just hanging out, sitting in the grass, having picnics. A ton of fun and great views of the city. A lot of dog owners visit as well. The park is super clean, though!!", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-05", "description": "Another great San Francisco park with unbelievable views of the city. This park is very dog friendly as you can see when you walk around the place. However, the hills are tiring when you walk around so much. The painted ladies provide a nice picture perfect postcard for any snapshot and it is where the Full House gang would play around on some days. There is an interesting shoe garden in the park which cracks me up when I actually saw it in person. The park can get windy at times but that would not stop me to enjoy the great views of this great city. I took my date here and we both created some wonderful pictures in which I cannot wait to show them!", "author": "Danster L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "whatever happened to predictibility..the milkman, the paper boy, the evening tv..Everywhere you look, everywhere you go (theres a heart), Theres a heart. \nA hand to hold onto.\nEverywhere you look , everywhere you go.\nThere's a face\nOf somebody who needs you.\nEveywhere you look,\nWhen you're lost out there and you're all alone,\nA light is waiting to carry you hooooommmeee. \nEverywhere you look.\nEverywhere you look. \n\nSit down and have a picnic in alamo square...full house family style.", "author": "Daniella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "Painted Ladies, Clean Grass, Open Space and Great People.  What more could I ask for in a park?   \n\nIt's not as crowded or loud as Dolores Park.  Definitely a park to sit and read or relax with a group of friends.", "author": "Morgan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-14", "description": "Cute place to take a photo from memories of Full House", "author": "Tay T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-16", "description": "Alamo Square is one of my favorite places in the city. Why? For one thing, on a nice and clear day you can see an awesome view of the city skyline from here. Another reason is that it reminds me of the tv show Full House, which I watched a lot as a kid. Just seeing the opening credits and catching a view of Alamo Square and the Painted Ladies always got me excited.", "author": "Frances V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "Living in San Francisco, I have found it easy to get burned out on touristy locales.  When guests come into town and I ask them what they want to see- I typically dread the answers to come.  It isn't that I do not appreciate entities such as Fisherman's Wharf and Alcatraz for their history and uncanny ability to produce tourist revenue for the city.  It is just that, these places are not San Francisco to me.  Not the San Francisco that I know and love.  \n\nSo, I will take my guests wherever they would like to go.  But since I am fortunate enough to live two blocks from Alamo Square, it is easy for me to ask them to go on an impromptu walk up the street at sunset.  As we walk through the park they too begin to understand what makes this place so special.  \n\nThe views from Alamo Square juxtapose the old Victorian Painted Ladies with the modern Financial District and a perfectly painted California sky in the background.  Sometimes I come here-  just stare and think...\"I'm not in Michigan anymore, thank goodness.\"\n\nAs an everyday venue, this is a great park to take your dog off-leash or go for a run yourself.  There is a nice playground and plenty of benches for taking in the views.  \n\nI took off one star because the tennis courts really need to be worked on.  I live close by, but will never play here on these cracked courts.", "author": "Floyd R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "This place is amazing, a great relaxing place on a sunny day to soak up the sun and a beautiful view of the city's skyline. It's not necessarily a close walk, but it's totally worth the walk. Plan to come here more often when I'm in town. Tends to be sunny when I'm in town.", "author": "Anshel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-09", "description": "Looking for a place to visit on a trip to SF?  Check this out!\n\nYou'll see the \"Full House\" house and a very cool view of the city.  The park is in close proximity to the Haight and Hayes Valley.  It's also about a 20 minute walk from City Hall.  \n\nI love the local neighborhood feel with all the people laying out on the grass and playing ball with the dog.  Also, don't miss the shoe garden.   It's a very bohemian, fun idea.  It inspires me to make one one day.\n\nFun times!  Get your booty out ot the house and get over there.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "Nice little park to bring the doggies to and get a view of the painted ladies. A lot of people come here to take pictures of them. There are a few benches and tables to sit and talk and enjoy things at. This is just another place that I like to people watch or even to watch cars struggle to park in small spaces. I watched a car the other day that took ten minutes and then gave up and drove away. It was interesting.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "Alamo Square is definitely a landmark of San Francisco. Go there to visit the famous Painted Ladies featured in Full House. On any given day, you'll see tourists taking pictures with the houses and lounging on the grass on a sunny day. The only thing I didn't like about Alamo Square was the smell...there's a certain stink that lingers in the air. Other than that, it's beautiful - there's dogs playing on the grass, people people-watching, and tourists taking pictures.", "author": "Gina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "This is a cool tourist spot or a local place to chill especially with your doggy! I went on a weekday so it was very empty and not overly crowded. The park is cool to walk or run through because of it's hills. The famous line of houses shown on Full House is pretty spectacular, see my photo! All in all, a cool place to chill, bring a blanket and layer... the sun gets you warm but normally there's a breeze!", "author": "Laura F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "Great little dog park with an amazing view of the SF skyline next to the painted ladies. There are plenty of cute little doggies who also pee and poo on the grass. Makes you wonder when you sit on the grass. I would give this park another star but I have 5 mosquito bites. =[", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Great place to lounge around on a lazy weekend afternoon if you don't want all of the pressure of trying to act cool at Dolores Park (I'm kidding). It's really amusing to see everyone oriented toward the Painted Ladies, but I guess Fullhouse nostalgia is one of the main draws to this park. It's a clean park with a good view, and pretty easy to get to -- worth checking out at least once.", "author": "Adam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-25", "description": "Full house point baby!! great place to chill out with some awesome views, some decent wine and some toilet paper so you can pee in the bushes.\n\ni was hanging out with some friends and two dogs came over to us.  asked the owner their names...Jesse and joey...no sh*t, perfect way to wrap up an alamo park day.", "author": "kiki b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-05", "description": "This park is great if you can make it up the hills.  The view of the \"Painted Ladies\" Victorian houses is awesome as well as the view into downtown.  It is off-leash dog friendly too.  I've spent afternoons reading, soaking up a little sun from this little haven.\r\n\r\nTimes visited: 4", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "FULL HOUSE! My childhood show!!\n\nOf course we had to stop here on our trip to SF. There's a park right in front of the painted ladies so it makes for a  a great photo op/tourist spot. Also a nice place to have a picnic or bring your family/pets. =)", "author": "Leanne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-06", "description": "Beautiful park.  I take my friends there who have never been there before.  I have gotten drunk and smoked park there at night with a bunch of graffiti writer friends also.  I show people the Miss Doubtfire house there.\n\nAnother SF treasure.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "\"When you're lost out there, and you're all alone, a life is waiting to carry you home, Every where you look....\"\n\nThis was our first stop during our trip to SF with friends. Great park filled with trees. Tons of places to sit, plenty of benches and of course grass - perfect for picnics. There's a tennis court hidden among the trees right along one of the paths too. Great view of the Painted Ladies and the SF skyline.", "author": "Irma E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-29", "description": "Four facts about Alamo Square Park, based on my experience:\n\n1. Epic and euphoric views of the city.\n\n2. It's a dog party.\n\n3. I lived at the corner of Scott and Fulton, next to the monster Victorian mansion.\n\n4. The Painted Ladies are pretty zexy.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "If you liked the Full House sitcom, then take a picture at the Alamo Square.", "author": "Carlene R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "There one word I call this place! \"\"\"\"\"\"\"\"\"\"\"AWESOME\"\"\"\"\"\"\"\"\"\" and if you have pets this is a great to meet friends here! Beautfull homes here and TONS of Pretty Ladys (I means Victora Homes near by) near by! Parking on the other hand not so much. Better off take a bus to come here!", "author": "EdwardF A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-01", "description": "Strange name, sweet place!\n\n(It's hard NOT to love a park that encompasses a famous vantage point of the epic, beautiful Painted Ladies....) \n\nSomehow we always manage to find a parking spot on the street w/ relative ease, too. \n\nThis gorgeous park provides not only the aforementioned photo op but also one of City Hall which is equally as epic! \n\n- Aside from views of said awesomeness, this is a decent sized park with both trees & open grass that is perfect for laying around in and reading a book.\n\nSurrounded by bustling neighborhoods and frequented by tourists, you're sure to always have an interesting (and memorable) experience at this neat gem!", "author": "Kai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-08", "description": "This is my favorite park in San Francisco and a perfect place for laying out on a warm, sunny day! Spectacular views from the top of the park that span the vast SF skyline! And the Painted Ladies: gorgeous!", "author": "Rob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "Excellent restaurant! Superb food and wine and the owner, Andre, is the best! The flourless chocolate is to die for as well!", "author": "Ellen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-06", "description": "Came here to see the Full House tourist spot but was greatly disappointed. The park was very dead/mellow.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "You need to stop here at least once to get a nice view of the Painted Ladies, and then you can also relax on the benches/lawn with a snack. Fairly quiet when we went and peaceful.", "author": "Aly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-31", "description": "I came at such a bad time when I visited the famous Painted Ladies. It was early evening and The sun was kinda low, so bad pictures of the painted Ladies... Plus My friends and I only stuck to the south side of the park. I wanted to go to see more of the park but it was getting cold in the middle of August, so it's off to home we go.\n\nHowever next time, I'm going to explore the entire park! *crackles evilly*", "author": "Matt M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "The park in the Alamo Square area is really nice and has the accent of a grassy incline as viewed from the approach of Golden Gate Avenue.  While proceeding through this neighborhood, one might see any of the great features of the homes painted with different colors, different marquis buildings and churches, and any number of \"pit stops\" one can make in the area.  The area, given the particular location, also has excellent views of downtown.  Really nice!", "author": "Thomas H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-22", "description": "Such a beautiful place to have a picnic! Amazing views and lots of room to spread out and picnic, play games and take the kids!", "author": "Mrs. B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "Oh Alamo Square Park. I have to admit, the only reason I knew about it was due to having a secret love for Full House. However, that was not the sole reason I was headed there on a gorgeous afternoon the day I arrived in San Francisco. After grabbing some sustenance I trekked what seemed like a million miles uphill with my two carry-ons to spend a few relaxing hours at the park. \n\nI really love the view. I admit, this is the only park in SF I've been to, but it was beautiful. The painted ladies are gorgeous to look at not even including the rest of the view. I only hit one small area of the park, but from what I saw it was relatively clean and peaceful. I had a chance to read, listen to some music, and people watch. \n\nUntil the Full House crazies arrived. All of them. Then I spent an hour and a half overhearing conversations debating which house they lived in (the answer of course is none since their house was a *set*) and the playing of the opening credits over and over again on you tube while debating this epic situation. \n\nThere was construction going on behind me and fences were up which made me sad. I would've loved to see what else the park had to offer.", "author": "Tonia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-31", "description": "This is what happens when you stand around here long enough:\n\nTourists 1: \"Can you take our picture in front of, you know, the tourist thing?\"\n\nMe: \"Sure\"\n\nTourists 2: \"Can you take our picture in front of, you know, the tourist thing?\"\n\nMe: \"Sure\"\n\nTourists 3: \"Can you talk dirty to us like Bob Saget in real life?\n\nMe: \"Sur....excuse you?!?\" \n\nDoesn't this park just makes you want to sing the \"Full House\" theme in your head (or in my case, aloud and look like an authentic SF crazy)? \n\nLa, la, la, laaaaaaaaaaaaaaaaa Everywhere you look , everywhere you go (there's a heart). There's a heart A hand to hold onto....\nhttp://www.youtube.com/watch?v=Ul2QTLpasDs\n\nBesides the Painted Ladies, don't forget to check out the shoe garden!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "Great place for a picnic with friends, family, or a significant other! You get wonderful views of the Painted Ladies and behind them, the skyline of SF!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "Apparently on MLK Day all the bars in the Divis corridor close so fortuitously for us, plan B was to grab some beers and head over to Alamo Square Park. How is it that I have lived in the city for this long and never spent an afternoon here? I felt sort of sorry for all the people on the tour buses that kept coming by. It must be torturous to be on a vehicle that stops only long enough to snap the key tourist picture of the Painted Ladies and the SF skyline instead of lounging on blankets, playing with random dogs, drinking beer and making friends in a city you love living in.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-20", "description": "Friend from out of town: Hey Jeff, take me to the Full House Park in SF.\nMe: Don't be silly, that's just a TV show, that park doesn't exist.\nFriend takes me to the Google.\nMe: Well I'll be damned.\n\nI was actually excited to see this place, I was looking forward to singing the theme song and running through the field. Except I forgot the lyrics when I was here so it was more like:\n\nEverywhere you look, everywhere you go (there's a heart)\nThere's a heart.\nI something something something **inaudible mumbling**\n\nWhen you're lost out there and you're all alone.\nSomething is waiting... to carry you home!\n\nNeedless to say it didn't play out like it did in my head.\n\nAnyone else think that Becky was hot?\n\nI think I smell \"Talk Thread\".", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-27", "description": "So, I'm rewriting my review of Alamo Square...leaving it an awesome 5 stars...but my view on my neighborhood park has changed for the better since becoming a dog owner.\n\nI've been stressing unnecessarily for a while now.....about life, love, money, just general stuff...but I've found the best therapist.  Its the dog park.  I go, take the pooches, and sit back and watch the interactions of this huge community of dogs.  On nice days the park is packed, and you can usually find a friend....for your dog.  Its awesome.  Most of the dog owners don't even talk to each other.  They admire one another's dogs, and see who sniffs whose butt, and who wants to play.  Just watching makes me super calm.  With my ipod on, nothing else matters.  It is a very zen place for me...and I'm glad its only a few blocks away.\n\nAnd a side note.  Calm environments, such as the chaos of the dog park are very therapeutic...but you know what else is?  Having sex to heavy metal.  I would NOT recommend doing that in Alamo Square, ...but even if you aren't a metal fan...try it, you might like it.  The chaos is the therapy...gets you out of your own head...even if just for the length of the CD.\n\n\n\n---------------------------------------------------\nOriginal Review 12.05.06\n\nWhat ever happened to predictability?  The milkman, the paperboy, and even MTV?  I have sung this song one too many times.  Something about the painted ladies inspires me....\nDog friendly park.\nPicnic friendly park.\nFull-house friendly park", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "Yesterday my friend and I grabbed our rackets and headed over to Alamo Square for a tennis match. There's only one tennis court and it's dead as a doorknob, but it's impossible not to feel soulfully alive in this park. \n\nThe views are simply stunning, and I had forgotten how good it feels to sit in the playground on swinging tires and shoot the shit while pulling sweaters tightly and staring up at the tall trees all around.\n\nI first saw Alamo Square in the movie Tales of the City when Mrs. Madrigal falls in love with a dying man. I feel a little bit like her sometimes. Minus the sex change, of course.", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "Yes this is where the \"Full House\" painted ladies can be seen.  \n\nYes I did the Dave Coulier \"Cut.It.Out\" bit for the camera when I first visited.  \n\nNo I did not see the actual \"Full House\" house here.  I'm beginning to think that was just a Hollywood set.  \n\nYes I've seen every episode of \"Full House.\"  Probably more than once.  \n\nNo I don't think the Olsen twins are hot.   I watched those girls grow up on that show.  That's disgusting.", "author": "William S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-29", "description": "If you watched Full House growing up, you'll definitely want to visit this park. It's simple and nice and parking is tough!!!", "author": "Kaycie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "Nice place to take the pup. A tad windy, and watch out for the mud", "author": "E T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-09", "description": "Hahaha, I love tourists!\n\nAnd I realize that since I am an LA resident and a visitor to SF, that technically makes me a tourist, BUT I do work for an SF company and run with the locals, so I think that exonerates me from nerdy tourist status, okay?\n\nGood. So Alamo Square. It's gorgeous. There are happy puppies running around and playing. Cute guys running around after the happy puppies and playing and this square is just a beautiful slice of SF life. It's also adjacent to the Full House houses. And this is where you lose me.\n\nWhy in God's name would this be a tourist destination? You do realize, the guy on the show had a mullet, right? You do realize there were creepy twins on that show, right? You do realize that the goofus comedian on there was rumored to be the guy who Alanis Morissette angrily scratches her nails down someone else's back to get over, right? You do realize that in real life Bob Saget is about the dirtiest bird around, right?\n\nWow, i think i actually just realized why this is a tourist destination. Nevermind.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "I used to drive by this park all time going home from work. Oddly enough, I almost worked right by this park. And of course who can forget that this is the sight of the very famous Painted Ladies as seen in the all time family favorite sitcom Full House. Of course I've seen it from a number of angles and never seem to get it just right like the tv...oh well. \n\nI sometimes walked all the way here from Geary and just enjoy the park. It was rather peaceful despite the pain in the ass grade of the sloping landscape.", "author": "John-Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-03", "description": "What ever happened to predictability? \nThe milk man, the paper boy, evening TV \nYou miss your old familiar friends, but \nwaiting just around the bend. \n\nEverywhere you look (everywhere) \nThere's a heart (there's a heart) \nA hand to hold on to. \nEverywhere you look (everywhere) \nThere's a face of somebody who needs you. \n\nWhen you're lost out there and your all alone \nA light is waiting to carry you home \nEverywhere you look. \n\nYeah so most of known references of San Francisco were from the show \"Full House\" and the movie \"The Rock\". \n\nSo sure enough we made our way over to check out the Painted ladies, (houses from full house) \n\nIt wasn't as spectacular as I remembered from a child. \n\nMaybe it's because mary-kate and ashley are all grown up and cause as much drama as paris hilton that makes this place just not as cool as I imagined it would be. \n\nSKIP!!!", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-13", "description": "Beautiful park, and yesterday, even hosted a Rocket Dog adoption fair!   The weather was sunny and lots of really nice people came by to see the dogs. There was a flea market too, but I did not find anything worth spending a dollar on. \r\nMy friend bought one of those old school popcorn machines.  Oh, and my favorite purchase.  A sign that said \"welcome\" with a big cow underneath.  Nothing says welcome quite like a cow, I always say.  Everyone should hang a cow on their front door, I think there would be a lot less violence on the streets.\r\nIf you have a dog, or just want to enjoy the sun, this park is worth a trip. \r\n\r\nInsert Full House reference here.\r\nDammit, I had to.", "author": "Starla D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "So I visited San Francisco and was on a trolley tour cart. The guide took us anywhere that we wanted to go and I exclaimed, \"FULL HOUSE AREA!!!!\" Thank goodness he knew exactly what I was talking about and even told us that the park is called Alamo (Almo) Square! Took great photos, had a lot of fun rolling down the hills, took some photos in our \"Full House\" poses, and reminisced on good ol' Full House days. And yes, I know this area was famous before the TV show but if I want to pretend that I was Michelle Tanner, then darn it.. I will. Lol :P", "author": "Elizabeth N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-10", "description": "I am lazy.  Which means it probably wasn't the greatest idea for me to get a dog.  Nevertheless, I got one anyway.  And apparently, he requires ridiculous things like \"walks\" and \"food.\"  Keeping things alive is hard work.\n\nAlamo Square makes that a little easier.  I start my mornings off at the park, admiring the view of downtown and the Bay, and occasionally smirking at tourists.  My dog likes the pee on everything there.  He once attempted to pee on a tourist's leg, but that's a story for another day.  \n\nEven though I love my neighborhood park, there are a couple of things that drive me nuts (hence the minus-one-star): homeless people who eat chicken wings and leave their chicken bones behind in the dog park; irresponsible dog owners who don't clean up poo;  children (I like dogs, not children); and that damn puddle!  \n\nOtherwise, though, it's a great place to have a picnic on a sunny day, take a stab at learning tennis, or run around with your four-legged friends.", "author": "Jess T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "Fear of the unknown or a more reasonable fear of the Western Addy keeps many away from this little gem.  \n\nThis park employs a modern \"green\" hipster repellent -- the hill.  Through this modern marvel, there's nary a fixed gear bike to be seen.\n\nThere is no better way to spend a relaxing afternoon than drinking in public and few better public places to drink than Alamo Square.  \n\nIf you look close enough you may find an Olsen twin walking hand-in-hand with Dave Coulier.", "author": "jack p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-15", "description": "I know everyone likes to come here because it gets shown in the opening credits of Full House, but I don't find anything particularly enchanting about this place. \n\nThat's not to say it's not a cool place to hang out. This is the closest park to me, so I come here all the time. I walk up, sit and enjoy the view while meeting some of SF's finest furry friends. And hopefully their not-so-furry owners as well.\n\nHowever I still miss living by Golden Gate Park.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-11", "description": "Ahhhh, my neighboring gorgeous Alamo Square Park holds the most memories of any place in this magical city. It's as significant as a certain ungrassy park in AZ, the location of my very 1st makeout...friends gazing, vying with a stopwatch, as I tested the elasticity of my braces' rubberbands. That park came to hold so many more 1sts-chewing tobacco, underage drinking, grapefruit fights, being arrested, etc etc...Good parks make for good times, right?\r\n\r\nAlamo Square is my SF version.\r\nIt's been a place to start, end, explode, burn-out, test, ignite, and close so many relationships. Each spot: shoe garden, tennis court, park bench, doggie grounds, and the Full House viewing hill, have connections. Don't get me wrong, ASP is awesome for drawing, BBQ-ing, and napping too. It's just so much more than a giant hill-park.\r\nIt's a place were the bad, ugly, but mostly really good stuff happens...", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "Came here on a super rainy day .. just to see the painted ladies and take pictures of the great views of the city. I wish I could have stayed longer to enjoy the park, but it was pouring. It seems to be a really nice park .. great for picnics and kids to play. PLUS ... the views are beautiful!", "author": "Emily P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "I love this park.  I bring my dogs here all the time.  There is a good loop you can walk on and one side has an area where dogs are allowed off leash.  The other side is the one that stays sunny.  Sometimes this park is windier than others but i still love it.  Also, there are always tourists checking out the great view of the painted ladies.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-05", "description": "First things first: this is the home of the Painted Ladies (the row of 6 Victorian houses that you always see on the postcard), and it is also featured in the Full House intro.  (But note that the actual house from Full House is *not* on Alamo Square, it's up near Broderick & Bush).\n\nBut touristo-cultural references aside, Alamo Square is one of the best \"square\" parks in the city, perched atop a hill with nearly 360 views of the city.  These views come in very handy on 4th of July, as it's a very convenient place to watch the fireworks (ie, you can actually park nearby).  There's a sizeable crowd but still plenty of room to sit down.  Some of the fireworks are blocked by Russian Hill, (which makes it look like the city is being bombed), but overall you get a great show.  People were ironically chanting \"USA! USA!\", and others not-so-ironically counter-chanting \"Stop the war!\"...good ol' SF.\n\nI'll have to come back in the daytime to explore further (and particularly to see the shoe garden), but it's clearly a well-maintained park, and one of those classic spots that every good city-dweller should visit at some point.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "Another San Francisco tourist landmark. The 6 Victorian houses that make up the Painted Ladies is more for those who appreciate art and architecture. The colors and designs are pretty but i dont think this attraction would keep my attention compared to palace of fine arts and Lombard street. Its also a park and might be a decent place for a picnic but not one of the best of the best tourist attractions IMO in san francisco.", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "I love living near this park. When I take the 21 bus home I get off on Hayes & Pierce and cut through the park to get home. It's a great view at the very top and there's almost always a dog owner playing with their dog around. I live vicariously through my friends with dogs so it's always nice to see!\n\nI want to make use of the tennis courts here, too", "author": "Brianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "It's always a must-see attraction whenever I have out of town guests visit me. \n\nThey've always asked me where this row of Painted Ladies are in the City and well, to their surprise, I'll take them there without notice. \n\nA smile is a thousand words...unsaid. And that..my friends, I'd rather see their smiles than hearing a \"Thank you.\"", "author": "Mika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-03", "description": "Kinda on the dead side but you get the perfect view of the Painted Ladies (aka the houses in Full House tv show) ... across the street.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-06", "description": "Do the houses near the square look familiar? It's 'cause they're the Full House houses! Too bad when I came here it was too dark to take pictures in front of the tv landmark :(\nThere was nothing much to look at around here. Alamo Square is just a park so I guess if you like parks then this is a good place for you.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-15", "description": "The hills around and through Alamo Square are my own personal stair-stepper with a view.  I run circles around you, square.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-10", "description": "This was seriously awesome.  I've watched every episode of Full House at least 5 times so seeing this was a historical moment, for me at least.  Embarrassingly enough, the bf and I even took out his iPhone so we could listen to the theme song and see if the colors of the houses have changed.  I wonder if the residents (are there any?) mind that people are just sitting there staring at their houses.  No wonder all the curtains are pulled shut.  I brought my dog here and let him run around off-leash which was great because all the other dogs were running freely too!  On a sunny day, I would like to bring a blanket and sleep out on the poop-infested but very green grass. How can you beat beautiful Victorian houses with the SF skyline in the back? Perfect!", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-03", "description": "Update: 2/17/2008\n\nAs of the 1st of February, we've moved away from Alamo Square, and we miss the park fiercely.\n\nWhat many folks don't say in their reviews is that the dog park community there is an amazing set of fantastic people who love their pups and take great interest in their community. \n\nIt was here that the boy teamed up with another dog owner to surreptitiously fill up a stanky, foetid sinkhole of muddy rank water - sure giardia for dogs who drink it... \n\nIt was here that we got a connection to the lead attorney on Ellis evictions at the Tenderloin Housing Clinic who happens to walk his dog through the park.  The attorney was one of the best resources we had during that horrible time...\n\nThe boy (to another dog owner): \"I don't suppose you'd know anything about Ellis evictions?\"\nDog owner: \"Not really - but you should really talk to [attorney] ... hey he lives over there and it looks like his light is on... you could knock on his door...\"\nThe boy: ok, thanks...\nDog owner: \"Oh wait... here he comes walking up the path with his dog Milo right now!\"\n\nI know this above narration is a bit random but, some 2 weeks after moving, we definitely miss the dog park here and the other dog owners.\n\n\n========================\n2/23/2007\nSince puppy, I've been ever so grateful for the big, beautiful, hilly expanse of The Alamo, just a block away from our front door.\n\nThe Puppy Playground is on the crest of one of the windiest hills in the city, and even though she always comes back filthy with mud and other doggies' slobber, it's truly worth it for the hard romps that tire her out for the rest of the day.\n\nI love the tiny little doggie water fountain low and convenient, the ever-so-romantic SF skyline, all sparkly glittery at night.", "author": "Claudine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-31", "description": "Where is the Full House house?\n\nIt's not here in Alamo Square as believed by many.  It's really located here:  1709 Broderick Street, near Bush Street. In the opening credits, the Tanner family picnics in Alamo Square.  Ah, the power of tv.\n\nStill, the site is well worth a visit if you've never been.  Enjoy the painted ladies and visit the park.  Watch tourists huddle for that Kodak snapshot.  Find a small mocked up painted ladies facade on the play structure. Enjoy the wind and view of SF. Find the hidden shoe garden.  But let 'em know the real Full House is...about 12 blocks away.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-16", "description": "Great attraction for tourists! The famous houses remind me of Full House and Family Matters (shows I used to watch all the time when I was younger). Great place to have a picnic and enjoy the scenery. The actual Full House house (Tanner Residence) is down the street!", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-28", "description": "I always march my out-of-town visitors up to this park. And they are always filled with awe.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "Easy to find, plenty of neighborhood parking...or it was just our lucky day. \n\nThis area was beautiful. It's a dog park + tennis court + picnic area + a good walk. \n\nMy boyfriend & I came here on a Sunday morning 11am-noonish (after a night of partying), and relaxed here. There were benches in many areas of the park, and we dog-watched, people-watched, and observed the views of San Francisco (since the park was on a hill). \n\nLots of areas of shades or sunlight and surrounded by the houses you see on Full House. It was lovely ! =)", "author": "Sonya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-03", "description": "My favorite house in the city sits on the corner of Fulton and Scott, at the northwest corner of Alamo Square.  If you like architecture, check it out.\n\nThe Westerfeld House at 1198 Fulton.  Still, FYI, a single-family residence.\n\nMy interpretation:  http://static.px.yelp.com/photo/XGAcMRIAdjWYgVduYyK_jA/l", "author": "Randy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-15", "description": "So...I attended Ida B. Wells High School for a few years, the alternative high school right by the park on the top of Hayes Street. I've always known we were high up and had decent views, but I never actually tripped that we had THEEE prized, million-dollar view...not until years after I left the school. Alamo Square Park is a tiny park, but high up on a hill. The park itself has several steep hills. Views from all around the park are beautiful, but people come from far and wide for The Postcard Row...aka The Painted Ladies...aka The \"Full House\" House. The ornately-kept Victorians of yesteryears with the modern cityscape in the back drop, we've seen it in a million postcards. If you can handle the heavy winds (on most but not all days), this is a great place to picnic. The hilly terrain makes it an ideal spot for Slip 'n' Slides. I've never partaken in the Slip 'n' Slide, I've only ever watched with envy as strangers  slid around with glee.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-05", "description": "Hi, my name is Tats and I live in Hayes Valley. OK, not quite as heart-rendering as making that statement with the more predictable double-initial ending, but still.\n\nHaving moved from the Lower Haight up the street to Hayes three months ago is still something I'm sometimes sheepishly embarrassed about. Even though it's not really the Valley but more Alamo Square, the punk in me is blushing. \n\nCorrection - make that WAS. Not anymore. Not since yesterday, when i took a thermos full of beer, a blanket and a laptop and just parked my tired old ass in the park. All afternoon. I now love living half a block away from Alamo Square. The park is pretty, the view is great, there's tons of happy puppies to play with (and a community of responsible owners who take care of them) and there's, like, a dozen of open wireless networks you can log on to and siphon Internet off of. \n\nIn fact, I enjoyed myself so much that I decided to play hooky as the weather was once again nice. And guess where I am RIGHT NOW! You got it. Gotta go, there's dogs to frolic with and tourists to mock in front of the Painted Ladies.", "author": "Tatjana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "on a nice day this place cant be beat.\n\nvery conducive to day drinking.\n\nnot as hippy infested as the park.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-23", "description": "To keep it short and sweet, this is where you wanna go.  Well kept grounds, clean restrooms, lovely view.  If you enjoy watching tourists - this is the spot.  Hopefully you won't mind being in the background of someone's photo.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "Love this park, great for dogs and one of the main reasons why I moved close to it.  Great views of the city and friendly atmosphere.  I go 3 times a day to let my do out, close and convenient.", "author": "David K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-10", "description": "What no fenced doggy area?!?!\n\nCouldn't let poor Murphy loose to run around.", "author": "Howard T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-10", "description": "Beautiful park, Beautiful view, great ambience,  I really loved the little playground its perfect for kids and secured my baby really enjoyed it", "author": "Maryfer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-04", "description": "Love the park, excellent location, great view, and always felt safe here and never approached for money or to buy crap.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-02", "description": "Today I discovered two good things:  the shoe garden, and the dog playground.  Just wandering over the hill to see the views, including the all-too-famous one, we discovered people playing with their dogs off leash.  Everyone was happy.  Then, in the southeast side, around an old permanently-locked restroom, we saw all these tree sections lining the walk.  Nailed to the tree sections -- shoes, often pairs of them.  Filled with dirt.  With plants growing in them.  \r\n\r\nStreet art at its best.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-14", "description": "How can you talk about Alamo Square and not reference \"Full House\"?!?  You just can't.  The last time I was here, I had the theme song stuck in my head.  \n\nOddly enough, I can't remember the grass ever looking as cleanly cut as it did in the opening shot.  \n\nSituated along the infamous Bay to Breakers Hayes Street Hill, the views are great.  Have a picnic here, like the Tanners.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-08", "description": "You know what would be a good call?  Dressing up like Saget and Stamos (in that horrible late 80's sitcom gear) and staging a really angry, graphic 'domestic dispute' in front of the \"Painted Ladies\" for all the tour groups who roll by on their buses.\n\nThat'll give them something to photograph.\n\nOh, and Alamo is a good park for night time tree-climbing missions.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-22", "description": "Ahhh, ahhh, ahhh, ahhh...\nWhat ever happened to predictibility?\nThe milkman, the paperboy, evening TV.\n\nEverywhere you look, everywhere you go (there's a heart)\nThere's a heart,\nA hand to hold onto.\n\nEverywhere you look, everywhere you go.\nThere's a face,\nOf somebody who needs you.\n\nEveywhere you look,\nWhen you're lost out there and you're all alone,\nA light is waiting to carry you home,\nEverywhere you look.\nEverywhere you look.\nShubby-do-ba-ba-dow!", "author": "Viv C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "The Painted Ladies are a row of 7 Victorian houses or so located across the street from Alamo Square (park) on Steiner Street between Hayes and Grove.  There are great views of the houses and downtown from the park across the street and most of the time parking is not too difficult to find.  For the history of these homes, check out Wikipedia at http://en.wikipedia.org/wiki/Painted_ladies.  This is a classic San Francisco photo spot and the weather is usually sunny here too even when it's foggy elsewhere in the city.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "Almost right in the heart of the city this spot/park is a nice location to relax.  Watching the dogs and other tourists go by, it's kind of romantic with the city skyline in the background.  On that note, maybe sunset would be a good time to relax and take it in (though twin peaks on a clear night would be even better).  Lots of street parking to choose from make this a nice stop and smell the roses date location.", "author": "Brian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-23", "description": "I like to get biscuits & cornbread from Eddie's Cafe on a sunny afternoon & sit in the park & eat. See? : http://www.flickr.com/photos/melisserlovesmook/114289993/\n\nIf you like people watching, this is a good place to go. Tourists, locals, doggies, they're all here. I also drive out-of-towners past the \"Full House house\", they like that.", "author": "Melisser E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "I really like Alamo Square. I really only go for the dog park portion of the park, where I take my four legged boyfriend to fro lick with other canine creatures when the weather is amicable. There are always plenty of other pooches to play with and great owners. I have yet to encounter a rude owner or disrespectful dog. \nThe park itself has several gentle slopes that hoomans and dogs alike can enjoy either for picnicking or (in the case of canines) running down to fetch balls or other toys of delight.\nBe warned though, after rain or very damp weather the park can be a little muddy which makes for messy paws (easily fixed by a long walk home or the accompaniment of a towel) and sometimes balls get lost because they roll down the hill and look like about four other balls that may have been thrown down there as well. If your puppy isn't picky (like mine is) they'll be more than happy to bring back some body's ball for you to throw again. \nThere is (of course) a drinking fountain for the dogs at the top of the hill. \nAs I said- I am always on the dog side of the park. The other side (that faces the row of houses featured in the Full House opening) I have not visited. I get the impression from other reviewers that dogs must be on leash at all times on that side. For the dog side only aggressive dogs must be on leash.\nFun time on Christmas morning.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-26", "description": "Perfect setting for a picnic. Gorgeous green hills, big trees, sweeping views, dogs galore.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "I live a block away- why don't I come here more often?\n\nGorgeous view of the city, even (especially?) when it's foggy.  If you love rando leash-free dogs bounding all up on you while you're quietly enjoying the view with a friend, this park is for you.  If that's not so much your thing, stick to the perimeter.  Worth hiking through to get to the single tennis court on a sunny day.  The courts are pretty well-maintained, busy on weekends of course.  And who doesn't enjoy feeling like they're in the middle of the Full House opening?  Don't lie.", "author": "Anna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "Such a great park! Spent a couple of hours enjoying the sun, taking in the beautiful views of the city and of course snapping pics tourist style of the \"Painted Ladies\".", "author": "Rhonda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "The most notable thing about Alamo Square isn't even in Alamo Square, it's the buildings across the street (on Steiner Street). Alamo Square park itself is a fairly small and very hilly park that includes basketball courts, a dog run, a field full of tourists photographing the famous row of 6 houses, and all the other features you'd come to expect from a public park. If you're just looking for a nice San Francisco park I'd recommend going to Mission Dolores which is better maintained and offers a better view of the city, Buena Vista which has lots of serene shaded paths to walk around, or of course Golden Gate Park for just about anything. For all intents and purposes this is actually a review of the painted ladies. A \"painted lady\" is actually the term for any Victorian or Edwardian styled home painted in 3 or more colors to enhance its architecture. Even though about 48,000 Victorian and Edwardian homes were built in San Francisco between 1849-1915, it's the series of 6 painted ladies at Alamo Square that were built between 1892-1896 that have become the most well known. What makes them so well known? Perhaps it's the view of the San Francisco skyline behind the buildings or their beautiful exteriors unobstructed by anything besides a few beautiful and well manicured trees (unlike the view of countless cables that obscure almost every view in the city) or maybe it's their use in countless movies, postcards, and television shows (most notably the opening credits for Full House). For you Full House fans out there, Alamo square and the painted ladies were featured in the opening sequence to the show but the Tanner family home was actually shown as being 1709 Broderick Street which is about 15 blocks north of the park.", "author": "Matt E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "Updated Feb 2009\n\nAs new puppy owners, we have ventured into the magical world of SF Dog Parks only a little. Our little Shiba Inu is NOT an off-leash dog and the dog park here is not fenced. And it is near a bus line. And crazy-ass tour buses who hog the road. That being said, we do go over on-leash and the people are super friendly and really nice. Boo to the women skulking around trying to get people to buy her services as a dog photographer, but other than her our experiences have been good!\n\n--------------------\n\nI adore this park. It is safe, mostly clean (except for dog poo) and has great views. No, not of the painted ladies. . .go over by the dog park and look out west-ish. Cool. Especially at night - you can see the fog moving in and the towers of St. Ignatius. \n\nThe shoe garden is a little ratty looking, but one of those quirky things that make me love SF. \n\nUnlike some city parks, I have no hesitation going here at night.", "author": "Sarcastic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-25", "description": "The moment I first stepped foot into Alamo Square, nostalgic memories began flooding back to me of sitting in front of the TV watching TGIF with my family as a young child. Images of DJ's bed comforter (that I so badly wanted), Kimi Gibbler's incessant rambling (being so grateful none of my friends were that annoying), Uncle Jesse hanging out with the Beach Boys (dude - how cool is that), Uncle Joey's signature phrase \"cut it out\" (wow - there are a lot of annoying people on this show). And how could I forget, the final word of the opening credits: Shoo-bi-doo-ba-bah-dow.\n\nNow, Alamo Square is my favorite place to picnic in the city. The view of the Painted Ladies and SF skyline can't be beat ...bring some wine and crackers and brie and soak in those sunny SF days. \n\n(Note to dog-owners: while I love being able to pet your dogs and see them frolicking free, my \"I so badly want a dog but can't because I live in a studio\" thoughts quickly disappear when I encounter dog POOP where I want to set up my picnic blanket. Please please pick up the poop.)", "author": "Dalia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-10", "description": "An off-leash dog park a block from my apartment?  A park that not only provides amazing views, but also a doggie water fountain?  \n\nWith two big pups, this park is our stomping ground every morning & every night...  I'm the girl calling for Flash & Apollo or making gross faces after throwing their drool-covered ball.\n\nThe only reason the park gets 4 stars instead of 5 is the wind... Oh man, can it get cold up there!  It's tough to be at the top of the stairs seeing sun in Oakland while being bombarded by drizzly fog.  Scarf & gloves, anyone?", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "Finally get to see the \"Full House House\" LOL!!! ahhh... all my years and today I feel a little bit more accomplished..", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-11", "description": "The view is awesome.  The higher up the hill you get, the more of the skyline you get.  It's not all about those painted ladies.\n\nI went earlier in the day, so there didn't seem to be many tourists around.  I saw a few buses parked, but no people.  Hm... At least two of the streets have cleaning 12-2PM, so if you can sneak in before/after, parking is a breeze.\n\nI wonder how much use the tennis court in the middle gets...", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-20", "description": "Excellent old neighborhood park. A recent facelift gives this park so much beauty you'll forget while you sat there for hours just staring at the views. \nAlso, a great place for watching meteor showers in the middle of the light-polluted city.", "author": "E.Mo. .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "painted ladies!! fan of full house? then this is a must on your tour of sf! praking can be a lil hard but you'll be able to find something!  on a nice day you can see far past the houses and makes for a great photo op.  \n\ntheres also a cool shoe garden in then middle!", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "It's unfuckwithable, historically speaking (as anything with a TGIF connection should be), but from a practical standpoint, you're mostly going to find people walking their dogs (one of the finer dog parks in this town) & Japanese tourists taking pictures of the painted ladies.\n\nI'd give it three stars were it not for the fact that the last time I was there, a carload of girls with a megaphone were continuously driving around the park asking people what their favorite episode of 'Full House' was.\n\nThree Words: Chinese Fire Drill. You know it's true! Okay, either that one or the one where Uncle Jesse gets dared to ride his motorcycle along the edge of a tall building & then at the last minute decides he loves DJ, Stephanie & Michelle too much to endanger his own life over a dare. A truely touching moment. But what's the deal with the continuous \"AWWWW\"ing of the studio audience anytime Michelle did or said anything? For chrissakes, she could've pooped on the rug & the whole place would've exploded with AWWWstruck people. Enough, already!\n\nBut I digress. It's pretty cool.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-09", "description": "Why yes, this is the park that is filmed at the opening to the show Full House! While this isn't my favorite park in the city, (GG park is) it still has it's perks. For one, on a clear day, it has one of the best views of downtown and is one of the prettiest backdrops for taking pictures for your holiday cards! Secondly, if you are not a dog owner you can be one of those creepy lurkers who just hangs out so they can pet other people's dogs all day.  Also great if you don't have a dog but want to meet a hottie with a dog. It's also good for kite flying. Because it's up on a hill with not a lot to block the wind, you get plenty of wind to hold up your kite.  Great for picnics as well.  \n\nOr you can visit the shoe garden. Yes, there is a shoe garden there! it's a bunch of random shoes, heels, snowboard boots all nailed down and filled with plants to form a perfectly charming shoe garden. Lastly, it's a great place to go drink some brews with friends at night when the bars close. For those of you who are afraid of sitting in doggy poo, I haven't had too much of a problem with this. There is a main section of the park that the dogs and their owners hang out so as long as you stay away from there, you should be pretty good.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "This is a quick trip hanging out at Alamo square and looking across the street at the painted ladies. This is a busy area so don't expect it to be peaceful and quiet. The row of houses are very pretty and interesting to view.", "author": "Ellie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-25", "description": "When I lived a couple blocks away from it, the boyfriend and I would regularly occupy one of Alamo Square Park's benches and chow down on some dinner picnic-style.\n\nPart of me kept hoping that the Tanners would show up and have a picnic dinner with us.  But I guess they stopped hanging out there when Full House went off the air.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-15", "description": "I [heart] my new 'hood.\n\nBonus points for telling all my friends in the midwest that I live next to the Tanners.\n\nI always keep a lookout for the Beach Boys to drop by.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-29", "description": "I live two blocks away and I love walking by the park when I take the #21 bus home. The previous week I sat on top of the hill in front of the Full House (whichever one it is) and read a book :). My favorite things to do here:\n\nIntroduce people to the shoe garden by the public toilets\n\na. Check out this article from the SF Chronicle about it.....worthwhile!\nhttp://www.sfgate.com/cgi-bin/article.cgi?f=/chronicle/archive/2003/05/24/HO99126.DTL&type=travelbayarea\n\nb. And even better, I found this video on Brightcove, a beta site featuring the garden:http://www.brightcove.com/title.jsp?title=770018120\n\nSwing on the swingsets\nFly a kite while the tourists take pictures\nPoint to one of the painted ladies and guess which house on the row was the infamous house. \n\n:)", "author": "Laura G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-09", "description": "I understand being a tourist.  When I go to a big city that I've never seen before, I want to see it all.  But prior to me moving to the Western Addition, I would have never bothered to come to Alamo Square, let alone be able to call it by it's proper name.  Seven sisters?  Big whoop.  (Although, to be fair, I DO love the tourist who comes up and says \"Look there it is!  Hey, which one is the Full House? Where is it?\" -Um, if they keep things like that from the early 90's, it's on a sound stage in LA).\n\nOkay, possibly the BEAUTIFUL view of the city on a clear day, but still, I prefer Twin Peaks for that, especially if I am a tourist and have a limited amount of time.  Or GG Bridge.  Do you know how many people have lived in this area and have never walked across it?  I think that is a travesty.\n\nSo, despite the beautiful view on a clear day, I still can't understand why any tourist would want to come here, take a few pics of the houses and then leave.  Is it to make yourself jealous of all the people lying around with their dogs who clearly live here and have nothing better to do today except sit on the grass, thank God for sunny days like this and the fact that they live in the best city in the world (in my humble opinion)?  Because that is the best reason to come here, to bask in your luckiness.  So, Alamo Square, despite the BUS LOAD of tourists that insist on standing ALL AROUND ME while I'm reading my book and getting some rays, you are currently the light of my life on a lazy sunny Sunday afternoon. For all the sunny clear days in San Francisco where I was just too lazy to go to the beach, GG Park or Dolores Park, Alamo Square, I salute you.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-18", "description": "Beautiful, picturesque, not far from my apartment, and great for dogs and for humans. You gotta walk up a bunch of steps plus if you walk or jog around the entire park, it's great exercise. \n\nIt doesn't get five stars because it's often a bit too chilly and windy up there.\n\n**Edited to Add: Be sure to check out the quirky, cute shoe garden which is in the center of the park.**", "author": "Kimi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "Interesting park indeed. We sat in Alamo Square today on a lunch table and watched several tourist sight seeing buses come and go. If you have a dog, this is a very friendly dog park. The art near the bathroom is original and very cool. I liked how some clever and creative soul planted some flowers inside a ski boot. Wish I had my camera. The grounds were very clean and there is a huge tennis court and playground. A great place to sit and watch dog owners and tourists taking pictures of the postcard picturesque symbol of San Franisco....the Full House row. \nBathrooms are open from 8am till 2pm on Saturdays. Not sure the hours for the rest of the week.", "author": "Meredith O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-07", "description": "Full house house...\n\nFun to just look at and reminice the beginning part of the full house show.\nIt's a park so you can relax here and roll down the grassy hills, which is very rare in the crowded city of SF.", "author": "Realtor Karl B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "This park has got it all, beautiful views of the bay area, a tennis court nestled in a grove of trees and flowering bushes, lush greens to lounge around on! MY trip to SF isn't complete without an afternoon spent relaxing here.", "author": "S P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "Memorial Day weekend has been one of the most beautiful and sunny weekends in San Francisco. What better way to spend it than to go park hopping. Alamo square was one of the stops on our adventure, and my favorite one. Mostly because I got to introduce my new BFF to the Painted Ladies. After a year of living here, she had never been to Alamo Square! I know! I couldn't believe it either! On this sunny Saturday, the park was filled with people laying out on beach blankets, sharing packed lunches, and snuggling in the sun. It was the perfect day to show my friend the gorgeous view beyond the Painted Ladies.", "author": "Casi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "If we're writing about the park, I friggin love it! I think it's perhaps the best park for its size.  People say they like dolores park down south, but I can do without all that.  Ok, so the park is great, the shoe garden, the painted ladies, the actual ladies that are taking pictures of the painted ladies, and all the dogs.  However...stray from this grassy knoll two blocks in any direction and it looks like a too short video.  That's why I didn't move here.\n\nThumbs up to the park, thumbs down to everything around it.", "author": "Amir B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "I am proud to state I have never seen a whole episode of that insipid TV show Full House.  Therefore, the review is about it from an unbiased person.  \n\nThis is a well used neighborhood park. There are:  Dogs abound!  Joggers ahoy!  Walkers everywhere!  Sun worshipers ubiquitous (on nice days)!  Gawkers all over the place!  Tour Buses ever present!\n\nGreat views, walkable paths, well kept grounds, decent but shady tennis court, and great accessibility on all four corners.  Oh yeah...I guess it is an icon as well.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-07", "description": "Hokey fun time nostalgia aside... great communal area for running your pup!\n\nGo to Eddie's for breakfast afterwards.  \n\nAnd don't forget to check out the shoe garden!!!!", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "I'm not going to complain about everybody who wants to take their Full House pictures.  It's there, it exists, whatever.\n\nThe truth is that Alamo Square has a beautiful view and is always full of dogs bounding about.  Great things if I ever saw 'em.\n\nIt only loses a star for me because it gets so damn windy.\n\nThis review has inspired me to get off the damn internet and go up to Alamo to read.  See ya there.", "author": "Stef A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-09", "description": "Really, what's this all about? I know it because of Full House, but really, that's about it. It's kind of small. You blink, you drive by it. Oh well, if you like Alamo Square, you should check ou Atla Plaza at Scott and Jackson. \nThere's a pretty good view of the city from here.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-14", "description": "This is the best park I've been to located in the city. Of course it's historic and has beautiful views, but the best thing is that it really makes you feel like you're in the heart of SF (versus the more \"hip,young, and chic\" areas like SOMA). I love bringing my doggie here and I think she likes it a lot too. They have doggie bags in case you forget and usually on weekdays there are a group of doggies who are ready to play. \n\nThe one bad thing about this place (pretty much like anywhere else in SF) is the parking. We had to drive around for a good 15minutes to find a spot.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-15", "description": "I'm never really a park person - I really don't know what to do there - so I can easily give this place a 5-star.  Hubby & I took my dog there for a walk because I wanted to take my dog out more, and yelpers recommended me this park. \n\nIt was a very nice day in SF, and a lot of people and dogs were out in the park that day. I loved it that it lets doggies run wild in the center of the park, and everyone and every dog is friendly.  \n\nThe view is nice up there, though I personally think SF is just a very beautiful city, and it's easy to find a nice view spot.  There are also a lot of tall buildings that block most of the views, so it's not as cool as I thought it would be. \n\nOverall, hubby and I had a good time spending time there, taking pictures, and seeing our dog sniffing around. And I think my doggy liked it too.", "author": "HsuMeow L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-16", "description": "first time i was there, it was raining. I played in the play structure waiting for my boyfriend with my bestfriend... in the rain. since he \nsecond time i was there with Sam and Mia and Jill, and Missy, and a whole bunch of people for an photograph intensive. Also, waited for my boyfriend because he was taking a test at school. but missed him\nloved the shoe garden, i'm probably gonna put it at city hall. and then there were the big cute dogs. ALLL BAD. ALL BAD. Almost got dirt on myself. oh well, it was gonna be worth it! :D", "author": "Carolyn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "After 15 years of living in San Francisco, I finally made it up to Alamo Square.  It was completely by accident.  We decided to walk to Hayes Valley from Golden Gate park and ended up here.  Wow!  It really is a beautiful view and I can see why this place is photographed so much.  Standing up there I was really proud of my adopted home city and how beautiful it truly is.", "author": "Sean O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-31", "description": "There's a timeless quality to this place, or rather, a feeling of being frozen in time at Alamo Square. The Victorian houses, dogs frolicking...it's a place where hipsters and yuppies can coexist. It's great for people watching or grabbing a blanket and just relaxing and laying out in the sun.  It's a unique, little anomaly in the urban jungle of SF. Parking sucks if you're not from the area.", "author": "Monica N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "My heart just started beating fast thinking about waking up this hill. I like to put my headphones on real loud and charge up the entire hill as fast as my fat thighs can move me.  The view is nice I guess, but it's that much sweeter when you're drenched in sweat because you were trying to KOM it.", "author": "Soma S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "The man and I went to this park to check out the dog park.  I had a good time we walked around a little bit.  Sat in the sun, talked, people and dog watched.  We met some cool people and their dogs, Phoenix got plenty of excercise.  \n\nWe got to see the the \"Full House\" house and the rest of the painted ladies.  We saw plenty of tour buses go by and a lot of picture taking, tourists, kids, and local people hanging out.  \n\nThe downside of this park  is the parking can be a pain. I think we just got lucky we parked right across the street.  It may not be so simple the next time.  There were parts of the park that were muddy, watch your step by the looks of my shoes I obviously did not, It was not shit.  Thank God! \nI will be back soon!", "author": "Maureen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "This little park gives you a little bit of both - the old and the new.  The pretty Victorian houses and the gorgeous view of SF Financial District.  It's also a good people watching spot.  Alamo Square is included in every guide book, so it can be really crowded with tourists.", "author": "Lidiya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-12", "description": "A coworker took me this wknd to hang out here.  I know Alamo Square as where Danny, DJ, Stephanie, and Michelle Tanner from Full House would hug and make up after a very frustrating 20-min. family conflict.  Anyway, those houses are totally cute.  The square park area is pretty big.  We played frisbee, and I utterly suck.  But my coworkers were respectfully patient with my challenged fat ass.  They even gave me some tips.  Anyway, there were hella dogs... it was like some annual dog conference or something.  Dogs are cool, except for their doo-doo.  Doo-doo isn't too cool. \n\nThe view is pretty nice here too.  The day was beautiful, so that made it that much greater.  Good ole SF!", "author": "Labonee M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-12", "description": "So pretty.  Easily the prettiest place in the city, IMHO.  SOOOO  pretty.  God, how much do I love this park.  ITs not that big, and its on a big hill, which makes it much more of a hangout park than a sport playing park (which is fine by me).  There's a dog side, a tennis side and a sitting side.  The dogs kinda have the run of the place, but they're soooo cute and their owners are pretty good about picking up after them, so its not a problem!\n\nHere's what you do: go here in the Early afternoon when its sunny and bring some wine and some cups.  You can bring beer if you want, but you might be told by the police to get out of here you crazy kids if they catch you with it.  Wine is much more mellow and respected by law enforcement.  So, yeah, you do that, and you bring some antipasto or little sandwiches with no crust and a bunch of your friends that you LOOOVE soo much.  We're talking heaven on the grass, real life wine and roses shit.  \n\nThere's an amazing view of the city, FiDi to Twin Peaks to Inner Richmond/Sunset.  Its perched up on little hill and is always in the sun, unless the stupid clouds have rolled in.\n\nThe only problem with this park is that it is often the windiest place in San Francisco.  If you come here anywhere close to sunset you're gonna get blasted soooo hard its gonna make you wish that you had brought that second jacket.   But the thing is, even if you HAD brought it, you'd still be cold and/or your friends would have forgotten theirs, so just know you're gonna have to leave when the sun gets low.\n\nOnly other drawback is that the tour buses drop people off here, which kinda harshes your mellow until you realize that you're living in a tourist destination and then you get ecstatically happy about how lucky a roll of the dice you got to be born into this life of yours.\n\nHere's a super-secret secret:  this park is gorgeous at Sunrise.  I'd say start here at fool's dawn after a night of drinking and wait until daybreak.  No matter what kinda night you've had you're going to feel small and light.  Just don't talk loud.  That's not cool.", "author": "Bill P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "Pancho's (my sweet 11 year-old black lab) favorite park that's walking distance from our apartment.  We're here nearly every day.  Beautiful views, lots of dogs.\n\nOne star off for having to see 20+ tourists on the same hill taking the same picture everyday.  Yeah, its the John Stamos house--who the F cares?  Look at the cityscape, you nimrods!", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-02", "description": "Five stars just form my proximity alone, when I move further away two stars will automatically deducted.\n\nGreat views, as if every tourist and newlywed didn't know.\n\nI love to watch people letting their dogs play in the leash free zone, which inevitably leaks to the non-leash free zone.  \n\nThe wind over the top is wicked fun for kite flying.\n\nAnd the log at the top is perfect for some cyclocross practice.", "author": "Adrian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-20", "description": "I never knew the Tanners lived so close to the projects.  \n\nDecent park for hanging out and reading a book, but too much of an incline to play a decent game of frisbee.  Could probably throw a football around though.  Popular among dog owners, so be sure to watch where you step.  The views are nice throughout the park, not just of the Painted Ladies, but of the northern and western sides of the city.", "author": "matt c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-08", "description": "NOW we know why Danny Tanner didn't want DJ going to the dance late at night. NOW we understand where Joey was getting all of that crack cocaine. and NOW we've realized there's a reason Jessie had that AK-47 assault riffle stashed under his bed.\n           -this is a great park! nice size, plenty of grass and trees, good views of the city, dogs, friendly people and the regretfully unavoidable busses FULL of tourists.\n    all that being said, a great place to lay or sit in the sun and chill out a little bit. also a nice part of town to witness a drive by shooting. \n   oh yea, have you seen the shoe garden?", "author": "Pflip W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-22", "description": "Come on people...the last thing I think about in this amazing San Francisco jewel is Full House.  SOOO over it.\n\nAlamo square is where it is at - the heart of the city.  It is not about the painted ladies - not that I take anything away from the sisters - but, it is where the world falls in love with pre-1906 San Francisco.  \n\nYeah, love the people watching almost as much as the views of the city.  Does not get better than that.  So, grab your loved ones and camp out, picnic, play with your dog - or, any dog for that matter; mooches are welcomed - and, fall in love.\n\nIf you are into the Victorians, continue down Steiner and hit up McAllister, and the surrounding areas (including NOPA).  Although, I love the ladies, they are not my favorite in the neighborhood.  I am almost certain, if you continue to explore this amazing artistic and historic district, you will feel the same.  It is kind of like ice-cream, you should never stop exploring new flavors.", "author": "Kiki I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-30", "description": "Yes this is where the full house credits are..ok big deal. If you go to the park you'll get over that in say i dunno 5 seconds? :)\n\nWe went to the park on an absolutely gorgeous day so my review will be a bit skewed. The park is not huge by any means, but there is a nice grass area overlooking the north west portion of San Francisco. Its a great view on a clear day.\n\nThere are many grassy areas, but quite a few of them are used by dogs so beware where you sit. The southwest corner of the park is the best view and the best place to sit. There is also a small children's playground in the middle of the park if you have kids.\n\nThe park was relatively quiet and peaceful. The intricate Victorian houses are cool to gaze at.\n\nI'd say this park isn't the best to come with a bunch of people to play ultimate frisbee or something, but is better for a smaller group to share lunch or just relax and sleep.\n\nYay I love city parks! The end.", "author": "Varun .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "The most beautiful majestic trees, I love the different seasons here with the willow trees sprouting in the spring. Forget the painted ladies and look around at some of the most beautiful manisons in the city closer to Scott & Hayes. Always an inspiring walk first thing in the morning with the dog.\nThe lady that looks after this park does an amazing job.", "author": "sarah l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "Spectacular views of the city.. parking is bad tho.. I was in search of the full house \"painted ladies\", wow.. thats it???  Lots of tourists takin photos of the houses, and dogs running around.  Boy it was hard to find!", "author": "La La T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-08", "description": "I visited Alamo Square over the weekend and as I stood on the steps that overlooked a beautiful scenery of the city of San Francisco and the \"Painted Ladies\" or what's better recognized as the \"Full House\" house, it dawned on me that:\n\n1. Why is this place called Alamo Square?\n2. Which one of those houses was actually the Full House house?\n3. Where can I find Uncle Joey?\n\nNot! I don't really care about Uncle Joey, but the funny thing is... when I visited this place I couldn't help but to find it amusing how there were all these international tourists that came to check out this place and somehow all knew it as the the Full House houses. I mean was that show that big that these people really traveled millions of miles just to check out the Full House house? Sad to say, but according to Wikipedia \"Contrary to popular belief, the red-doored Victorian where the Tanners live is not one of these houses. The address of the Tanner house was mentioned in \"Blast From the Past\" as being located at 1882 Girard Street in San Francisco, CA.\" and not to mention the show was never even recorded in any of those houses! So I don't even know why I refer to these houses as the Full House house or why I even get excited whenever I pass by this park. I guess somehow the Intro to that show fooled me into believing it was located there and that since it was featured on a popular TV show, being in the same vicinity as these houses just makes them cooler. But aside from all that, Alamo Square is a lovely park. I still have yet to venture off to the other side opposite to the Painted Ladies.\n\nhttp://www.youtube.com/watch?v=oSL_EvN1XqM", "author": "Ally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-20", "description": "Five stars for Alamo Square Park on a hot friday night!!!\n\n Full House....bitches.\n\nYeah we were the drunken girls running around the park last friday, rolling in the grass and cartwheeling through the expanses. The view is tremedous of both the city and the painted ladies. Shoe garden brings something new and unexpected to the picture.\n\n Opting for something other than the biker trash kids and fist fights of Dolores park for a change, we braved the hill and found ourselves in a quiet green happy park. Contemplating the cocaine usage of previous Full house stars and chatting with passer bys. What a great use of our girls night out.\n\nOn a side note dont stay to late unless you are accompanied by a bodygaurd the neighborhood is shady and it is a park afterall.\n\nNever a dull moment.", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "This park is in my new neighborhood and I love it!  I hope I never take it for granted when I'm on the 21 Hayes everyday!  Today was a beautiful day and I picked this park to sit and read for a couple of hours.  In some spots it could be really windy but in other spots, I was fine.  There were many tourists around but that didn't bother me.  Besides, the whole time I was there I could only focus on one thing.  And that was the following song replaying in my head.\n\nAre you ready for this...\n \nAhhh Ahh Ahh Ahhh Ahhhhhahhhh\nWhat ever happened to predictability? \nThe milk man, the paper boy, evening T.V\nYou miss your old familiar friends, but \nwaiting just around the bend. \n\nEverywhere you look (everywhere)\nThere's a heart (there's a heart)\nA hand to hold on to.\nEverywhere you look (everywhere)\nThere's a face of somebody who needs you.\n\nWhen you're lost out there and your all alone\nA light is waiting to carry you home\nEverywhere you look.", "author": "Dominique T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "This is one of the best spots in the City on a rare late summer evening when it's unbearably hot during the day, but perfect when the sun is just starting to go down.", "author": "A D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-04", "description": "I was there the other day, for the first time in years. \n\nLoved it.\n\nQuestion: which one of the Painted Ladies did the Tanners on \"Full House\" live in? And why was their proximity to Alamo Square not referenced in the show?", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "windy hill-top park with a little bit of everything!\n\noff-leash dog area for the poopy puppy.\n\npaths for your walking pleasure.\n\nbenches for your lazy ass.\n\ntennis court covered in branches and pine cones for your amateur match.\n\nplayground for the munchkins. \n\nthose houses from \"full house\" so you can stand next to a gang of fresh-off-the-bus tourists and take the same damn picture that everyone has already taken a million times, then bring it home and show your friends and say \"hey, guys. you remember 'full house?!'\"\n\nword to the wise: DO NOT walk through the north-east quadrant of this park during extremely windy conditions. the massive monterey cypress trees are notorious for calving branches the size of a house while under gale force.", "author": "zachary p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-01", "description": "This place holds some sentimental memories, as we got our dog here. Adopted him from someone else and met the little monster here for the first time. My problem being, there is no fenced in area I can let my dog off the leash and as he has gotten older, he really cannot control himself off the leash. But it's a beautiful park and I love walking here....just not with the dog.", "author": "Jena D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-25", "description": "A magic place, particularly in the morning when the professional dog walkers occupy the hill above the Seven Painted Ladies. If you want to take the photo you see in all the guidebooks, it's better around 5 PM, you will have the sun in your back. Now the thing to do, once you have seen Alamo Square is to continue along Clayton Street and walk up to Haight Ashbury.", "author": "CasimirVessel"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "Well, it's a pretty park, with a very pretty view.\n\nIf you have not been there yet, here is a postcard just for you...\n\n\n____________________________________________________\n|                                                                                                                        |\n|        HELLA  ! ! !                                                ___                            ___  |\n|                                                /\\         __            |      |____|-----|____|        |\n|     __        __       ____         / \\        |    |__-----|      |      |  |       |       , .........|  \n|__|_  |-----|    | __|__   |----   /  \\___|    |     |               , ................  /     \\        |\n|        | | __|     | _         |          /    \\       , .................  /  *  \\            /    ^^^    \\     |\n| ___|                          , .................  /      \\             /    {}{}    \\     /__^^^^^^__\\  |\n|           , .................. /     \\             /     [][]    \\      /___,,__,,__\\ |           ____   |\n|        /     \\              /   OO     \\     /___.[][].___\\ |++++++++++|          |__|_|   |\n|    /    [][]     \\      /~~~~~~~~~\\ |************* |++++|__|__|  |    / \\   |__|_|   |\n|/__,,___,,__\\  |xxxxxxxxxxxxxx|      _____     |++++|__|__|  |_/     \\______|\n|  __      _____|   [][]   [][]  [][]    |    |            |    |___^______.|  |      |              |\n|  |   |     |     |     |   [][]   [][]   [][]   |__|.____.|__|     /   \\             |  |      |   [][][]     |\n|..|...|__|||||||||||||___./\\.______|+++++++++ |    |     |   [][][]   |  |      |   [][][]     |\n|__________ |      / [] \\             |  _     _____|    |.     |  [][][]   |  |_.._|  ooo     |\n|               ___  |      |     | ____  | |  |    |     |     |    ===  |||||||||||    /   \\ oOOOo |\n|   [][][]    {        } |    oo   |__|__| | |..|_  ||||||||||||__===_ oo_ |._/__\\_oOo__|\n|   [][][]    { .      } | oOOo|__|__| |       ____                  oOOo                Y       |\n| _____{ ___} |      Y`                __ /       |_\\__                 Y                    |        |\n|             ___            |                 /----O------O---\\                I                              |\n|       __/     |_\\__                                                                                               |\n|     /---o------o----\\                    .....     FROM   SAN  FRANCISCO  ! !          | \n|____________________________________________________|", "author": "Margie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "I came here last Friday for some sightseeing. The park itself was well kept. I saw a few dogs roaming. I didn't see any dog poop. Oh, and nice green grass. I loved the view of the Painted Ladies and the skyline in the background. A good day out, and the view was a plus.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-16", "description": "You know the face, but you can't remember the name . . . most people never knew it in the first place, but everyone in the world recognizes that row of well-maintained Victorians with the downtown skyline serving as their backdrop as being the quintessential San Francisco scene. Every TV show and movie set here uses it as an establishing shot, especially if they're filmed in Vancouver.  Welcome to my backyard - or front garden, if you will, as I live on one of its corners and have a smashing view of all that greenery. It's never more beautiful (or eerie) than when shrouded in fog at dawn, never more crowded than at the height of tourist season, when busloads of camera-toting visitors invade it to snap pix of the Painted Ladies. From other vantage points you can see that lone tall white apartment building towering above Pacific Heights, and on a clear day the top of the Golden Gate Bridge. I love to sit here and read mid-afternoon, before everyone gets home from work and dashes over to let Fido run free. Some day I hope to own one of those famous houses and paint it black or hang a huge sign that says 'F*CK YOU' just to freak out the photo fiends. In the meanwhile, join me on my bench and chat for awhile.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-27", "description": "\"By far, the easiest way to befriend a large group of white people is to organize and then participate in a game that is normally played by children.\"\n\nhttp://stuffwhitepeoplelike.com/2008/06/02/102-childrens-games-as-adults/\n\nWhen I got word that a pick-up game of capture the flag was being arranged, I of course jumped at the chance to play; I'm genetically predetermined to. The venue was Alamo Square, and the organizers were (surprise!) a bunch of my kickball friends of the pigmentally-challenged persuasion. \n\nIt started with a few libations at Madrone and The Page (cause children's games apparently can't be played without adult beverages), and then it was off to the park. With the teams dressed in camouflage or head-to-toe ninja black and the sun setting behind us, we were ready to enter stealth mode and get down to business. Some of us (um, me) even brought ninja stars and a sai. Battle lines were drawn, the jails were stocked with 30 packs of Bud Light, and we squared off. Truly, this was no kiddie version of capture the flag.  \n\nIt was an epic clash, with each team having secured one victory (simultaneously, at that) and the deciding match on the line. By now, it was well into hour two of what historians have already dubbed \"The Battle of Alamo (Square Park)\", and this girl desperately needed to use the little soldier's room. But these are times of war, people, and there's no running across the street to use the gas station loo in such critical circumstances. Besides... the sidewalk was out of bounds.\n\nSo, I found myself an appropriately sheltered bush located behind my team's jail, and assumed the position. With my spandex around my ankles, and a stream of relief exiting my body, I suddenly heard the crunch of the leaves made by an enemy approaching. With my adversary unaware of my position, I laid in wait for the opportune moment to unleash my impromptu defensive strategy. Just as my foe was about to turn the corner of my enclave, I said to him in my most menacing tone,\"Take one step closer buddy and you'll be entering a world of pain... and by pain, I mean urine.\" Suffice to say, the kid BOOKED it back to his side, and away from his intended goal. Point: Anna K.\n\nWhile I'm usually not one to toot my own horn (you hush), I think its pretty safe to say I piss all over the competition.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-02", "description": "Sometimes on moonlit windy nights after a bit too much Maker's Mark, I sprint up to the tip top of Alamo Square Park and yell \"Remember the Alamo!\" Sometimes on bright days I stretch out on the grass and try to determine where the crowns of trees end and where the sky begins. Sometimes my old shoes go missing in my closet and I find them stuffed with earth and pansies in the garden at Alamo. Sometimes on Valentine's day there is a park bench I reserve with red caution tape that says \"Love Crime About to be Committed\". Sometimes in a headband and wooden raquet, I say \"Game, Set, Match....shall we have a cocktail now?\" Sometimes the downtown skyline leaps so fiercely to my eye I think I am going to explode with the weight of the ancients. Sometimes trees bend deeply at Alamo. The whole park folds. Alamo: where the grass is always greener, no matter which side.", "author": "Cpt. Scallywag N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-12", "description": "FYI - The opening credit house for Full House is at 1709 Broderick Street, between Bush and Pine.  Dont be fooled - they painted the red door black.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "Alamo Square has a pretty view. I first went here with friends last summer...on a spontaneous trip to SF. The Painted Ladies are pretty. The Full House house isn't on this street (FYI). It's a nice place to have a picnic though!", "author": "Jackie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-07", "description": "best place to drink a 40 while getting stabbed in the ass with a needle!\n\noh and dog watching is fun too!", "author": "Ishmael V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "I'm like any 30 something person who lived outside SF... only knew about the \"painted ladies\" from the show Full House. I was surprised how nice of a park this was. Nice views of the painted ladies, which I found it funny my friend thought they were statues, nice area for dogs on and off leash, grassy areas for picnics, scenic views all over, and plenty of photo shots. This is SF so always be prepared in case of  windy or cold weather, I think I saw a girl from The Hills blow away while there. Place has a public restroom and checked out the shoe flowers around it, which makes for good pictures. You will spend about 10 minutes looking for parking on nice days but well worth the visit.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "i don't think i'd ever done much more than drive by the painted ladies (FULL HOUSE HOUSES OMG!) until i started working at a-house-that-shall-not-be-named across the street from it. \n\nand then, i loved it more than anything else.\n\nperhaps it was the fact that the-house-that-shall-not-be-named was the craziest, most stressful environment i have ever worked in, but there was just nothing like escaping on a break to the solitude of this park. here, i could clear my head. here, i could smoke cigarettes without prying eyes. here, i could have phone conversations without prying ears. and here, i was just far enough away that i didn't have to hear any of the sounds from inside. \n\nsiiiiiigh.\n\nthat's how this park makes me feel: one giant sigh of relief.\n\nalso, good for both dogs and kids.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-24", "description": "Perfect place on a sunny day for a boy with his dog, his book, and nothin' much to do but wait for his boyfriend.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-23", "description": "This is the park by my house, so it's dear to me. It's also got some serious breathtaking views like Dolores & Buena Vista, but they don't have a wall of parking built around them for the tour buses. It can get windy here in the afternoons due to it's hilly nature. They have a cute little garden area where old shoes & boots are filled with plants, I just love that. There's also tennis courts and a puppy play area.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-09", "description": "Easter Sunday. Spending time with the new person in my life. The wind is refreshing and crisp and the sun is shining and I am grinning from ear to ear. We're both a little low on funds and agree to not drink until a certain designated hour. How to pass the time?\nI begin the walk up Fulton with my sparkly new special friend walking hand in hand. He asks where we are going? I tell him I have a surprise for him. He looks at me inquisitively but goes along. \nWe approach the park and he halfheartedly grumbles about the last uphill hike. Once we turn to look at the first view all complaining leaves. He is smitten and so am I. Hee hee. \nThe views here are smashing, doggies and children playing around are uplifting, it screams bring a picnic, bring a kite, bring a camera, bring someone special. I highly also recommend bringing a bottle of soap bubbles (see my Burma Superstar review) as they are fun and really when was the last time you went to the park to blow bubbles? If you can't remember and/or it's been over decade go and buy some darn you! It'll cost you all of about a buck and a few minutes at Alamo on a bench blowing bubbles and you'll magically centered, happy and content with the world. I promise. Life can be sweet.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "Great dog park. It has a big designated off leash dog area. I take my dog here almost every day and he enjoys it. There is plenty of space to toss a ball around and lots of trees and bushes for him to sniff.", "author": "Abhi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-02", "description": "The park where some of the most romantic moments between my boyfriend and I took place will always hold a special place in my heart.  I love to watch the dogs let off the leash running and circling with all their little doggie energy around the hills, so happy to be alive and free until they roll around on the grass in pure ecstasy.  I love the trees in bloom and the rare, hot nights, when sitting barefoot in the grass on a blanket counting stars is the preferred pastime.  So much more than the place where forgotten TV shows and movies were filmed and where tourists take pics of Victorian Row.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-27", "description": "If i lived in SF and anywhere near this park i do believe that Joshua and i would be here every day.  There were lots of cute doggies having fun.  The grass is really nice to lay on.  And you can see the Full House houses.  Tits.  Lots of foreigners taking pictures...", "author": "desiree n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "If I'm ever reborn as a dog, I'm going to drag my owner here to play every day. But until then (or until I get a dog, in which case he/she can gladly drag me!), I'll just have to enjoy the human side of things - picnics on blankets, reading in the shade, sunning on the grass. Lots of room, fresh air, sweet views. Mmmmm, simply peaceful.", "author": "Kai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-08", "description": "concern of summer 2008: how will i get tan in the city?\n\nanswer: alamo square!\n\nlazy sunday (or lazy lazy thursday in the summer) has now translated to a particular hill, dogs, headphones on, telephone off, laptop gone, perfect read, over-sized shades,  and some of the best views.", "author": "Coco E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-18", "description": "7am, dogs splash in puddles\r\nstill pooled from long past rains, \r\ngolden dome glittering.\r\n\r\nSkyline fades in, fades out.\r\n\r\nTransamerica shamelessly postures, \r\nblack windows winking darkly.\r\n\r\nThe fog veils the slumbering ladies,  \r\ntucked up side by side, painted faces framed  \r\nwith matching lace, faintly awry. \r\n\r\nShoes stuffed with earth,  \r\nbloom amidst cracked mirrors, \r\nneatly paired. My face, wavers in the glass. \r\nSomeone's altar.\r\n\r\nStooped at the foot of a weeping willow, \r\nthe gardener bends, a small white flower\r\nflourishing in the cup of his palm.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-23", "description": "This place is WAY over-rated.  \n\nOk, the views are great.  The \"painted ladies\"  look much better on the picture, when you make the right cut.  The big building on the right side of the \"ladies\" really doesn't fit in.  \n\nI would drive by with friends from out of town.  Maybe I would even want to go in for a few minutes to take some pictures for the album.  But I would NOT take my child there again, not in a million years.  \n\nAt first, I actually liked the views and the painted-ladies theme of the playground.  I thought it was kind of cool.  \n\nHowever, as soon as we got near with my 3-years old, we saw a crowd of parents and kids hitting that mexian toy with a big stick, as a bunch of toddlers were curiously wandering around.  I had a hard time keeping my son away from them.   ARE YOU PEOPLE NUTS?  If you let your kids play a game like that, do it in your own back yard, or get a secluded section!!!  \n\nSecond, there are two or more gates, and people don't keep them locked.  Some kids would run out and go around, and if a child escapes, good luck catching up with him!  \n\nThe biggest slide is actually dangerous in the way it is designed.  It has an opening at the top, where kids can fall out and get hurt.  \n\nThe facilites are dirty.  Only some of the kids are supervised.  Most of the parents looked like the weirdest crowd of lower-height folks that you wouldn't normally invision as parents: pierced, greasy-haired, tatooed, lather-dressed punks.  And what do you expect, it is only steps away from Tenderloin and lower Height.\n\nThere are older kids who come and go, as they wish.  At one point I found my son playing with a much older kid and his \"parent\" in the sandbox.  I thought it was strange for a kid this old to play in a sandbox.  So, I leaned over to look.  The older kid's \"parent\" turned out to be an oversized teenager, and he had a super-sharp object in his hand that looked like an oversized tweezer.  They left, as soon as I leaned over.  And then I saw the oversized teenager was explaining his buddy how to hit someone with that sharp object.  What was his intention about my son or another baby?!  I asked the guy to put that thing away, and soon they left the playground.  I still wonder if I should have called the cops.  The most disturbing of it all was that everything was taking place in my plane view, and in the plane view of many other parents.  And I was the only one who told the teenager to put away that super-sharp scary object.\n\nAnyway, I am so disgusted with this nasty little place.  Parents alert: stay away from this place with your kids, or watch them very closely.", "author": "LANA R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-03", "description": "I must admit, I was bummed out when I realized that this was the Full House park.  The thought of Mary-beth Olson and her lame-ass twin frolicking in vicinity (with Bob Saget supervising) just irked me.  I thought, that MUST be a different park, maybe the other square in Pac Heights.  The dozens of Yelp reviews MUST be wrong on this point.  They weren't, and I got over it.  This is an awesome park with awesome views to north and south.  I'm glad to have it in walking distance.", "author": "Leon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-23", "description": "I think if I lived in SF I would be here everyday. The views are magnificent and of course the Full House house!!! The park wasn't crowded and there were lots of friendly dogs. I saw a group of people with all of their pugs and it made me miss my pug at home.  I also thought he would have been so happy there.  A great place for pictures and to just sit down and take everything in.", "author": "Glenn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-18", "description": "Great dog park.!! I'm right in between the panhandle and this park. Actually, the panhandle is a little closer, but I prefer this park. It's farther away from traffic and it has a great view.", "author": "Lucy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "This park is very cool, but it needs a few more patrols at night to keep the buttsex in the bushes down...", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-12", "description": "My Dog loves this park.  I love this park.  Sometimes I do feel bad though when I steal uncle Jesse's parking spot.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "Definitely not a wilderness hill, Alamo Square hill is THE hill for Victorian house viewing, and for Victorian-house-viewing-tourist viewing. I love the stand of trees in the middle, and I love the grassy hill facing North, and I love the knobby bent tree at the Northwest corner.", "author": "Geronimo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "This park makes the 21 bus ride to and from work enjoyable for about a block. A great place to drink after hours.", "author": "Danny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-22", "description": "I can always find a needle here when I need one... Also, Kimmie Gibler hangs out at the corner of Steiner and Fulton every Tuesday and gives great ZJ's. What's a ZJ, you ask? We'll, if you don't know, you can't afford it!", "author": "Trevor J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "Go ahead, get it out of your system.  Pose with the Painted Ladies and downtown skyscape in the background.  Let your dog run around.  Avoid the occasional homeless guy.  You're right, it's pretty damned picturesque.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "I brought my wife to this area for one reason..and thats to \"everywhere you look ,everywhere you go(theres a heart)theres a heart\" Give up...you guessed it to take a picture of the houses that come on the 90\"s show full house.And it didnt  dissappoint.", "author": "Elijah Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "Other than the Golden Gate Park, this has to be another touristy park. When i visited it, there was a tour bus driving away and a bunch of people taking pictures in front of the painted ladies (aka the Victorian & Edwardian houses). It's a great park for dogs, for picnics (there are picnic tables), for sunbathing and of course, for snapping pictures and admiring the SF view.", "author": "Janel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "I love this postcard perfect park, especially on one of those rare sunny and relatively warm SF days! I come here to play with other people's dogs, pretending they're my own because I'm not allowed to have one in my apt :( Not quite in the same vein, I also have some good memories of playing watchdog as my friend watered the trees after some good soju-infused fun in the valley of Hayes.", "author": "Natalie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-18", "description": "close to home, filled with dogs, view of the city, and not as intense as Dolores. definitely gonna be lighting some things on fire here.", "author": "Ronny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-08", "description": "I disappointed my sister by taking her here when she found out there were only 4 painted ladies... she disappointed me when she refused to reenact the opening scene to full house with me...", "author": "Valerie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-27", "description": "I am just waiting for the day I run into DJ, Michelle, Stephanie, Joey, Danny, or Jesse.", "author": "Julie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-30", "description": "the city stops here. you sit on top of the hill watching the cars go by and its like time doesn't exist. usually its breezy so your hair gets in your face, but thats part of what SF is about. you really could sit forever. ever corner looks like a postcard moment.\n\nmost people just drive past not realising how beautiful this place is. take a moment and breathe in the city life. \n\nalso, tennis courts and playground! weeeeeeee!!!!", "author": "Scarlet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-06", "description": "Great views of the painted ladies and the SF skyline! This little park perched atop the hill is perfect for pictures and picnics. It's dog friendly. There's also a shoe garden - yes, a shoe garden by the restrooms. What's a shoe garden? Well, it's hard to describe and a little quirky...so go see it.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-21", "description": "I have always loved this park, and probably always will.  I love the dogs, I love the flowers, i love the view...but then I got my own dog and learned a bit more about the park.  They fertilize the grass with something salmon flavored so my dog loves eating the dirt.  The dirt has feces traces in it and the feces often have diseases.  Now the lil pup can not kick the giardea he picked up in his first week there and it has been over 2 months.  Dont let your dog eat the dirt!  Otherwise it is a lovely place.  Say a prayer for poor little cowboy bob.", "author": "S M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-01", "description": "A restaurant that truly feels local.  I used to live only a few blocks away from Alamo Square and know that the only drawback is that the restaurant stand on \"its own\" without the company of close bars or other places nearby. I like the reasonably priced fish menu and good wine selection.", "author": "Cakes A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-18", "description": "Beautiful view, secluded and relatively unbusy tennis courts where I can be horrible & not embarrassed. Slightly windy (but not the tennis courts which are in a nice stand of trees) and can get quite cold. Great fun to play with all the dogs that bring their owners out there, and some of the owners are very cute. A great place to sit and read my book & listen to music if it's not wet out.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-10", "description": "First time I realized you can smoke herb pretty much ANYWHERE in SF was at this park...so...4 stars for that", "author": "Garrett C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-29", "description": "This place is as loud as a rock concert and as dim as a sex club. Otherwise, the food was pretty decent.", "author": "D'Andy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-05", "description": "Beautiful. I lay in the grass under some eucalyptus trees on a recent warm sunny day, and totally blissed out. Quiet on the non-downtown-view side of the park, though of course the view is stellar. Don't miss the random \"shoe garden\" behind a small building (bathrooms, once upon a time?) in the middle of the park!", "author": "El K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "Another wonderful, sunny, friendly park to spend a day lounging on a blanket playing scrabble- which is what my bf and I did not too long ago. lol.. Yes, it is where the \"Full House\" houses are located, also known as the \"Painted Ladies.\" It's beautiful here, especially when the locals walk their beautiful dogs. Last time I was here I saw a great dane, huskies..etc.. I love dogs. Anywho, this park is awesome. Come with the family and relive the Full house picnic that you always wish you did when you were a kid!! don't LIE! lol..", "author": "Je M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "I always try to stop by here with out of town friends for at least one photo-op. Sure they'll end up buy the post card version too but its always fun to walk the same spot the Olsen twins do in the opening credits of \"Full House\"", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-29", "description": "The view was great. I went to this park to take pictures;however, around 6pm you should leave. I was bitten by mosquitoes countless times.  And now it is swelling up, the mosquitoes ruin the experience at this park.", "author": "mike l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-16", "description": "it took me forever to find this park when i moved to the city (i refused to consult tour guides or look it up on the internet).  alamo sq is a beautiful park best known for its spectacular views of the city and the neighboring row of stately victorian houses (known as 'the painted ladies').  given it's proximity to the lower haight, alamo sq is a great place to lounge around until sunset and then walk over to haight and grab some beers at toronado!", "author": "Roshni R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-09", "description": "how the hell can you not like this park? great for dogs and great for reenacting the picnic scene where Michelle takes out the loaf of bread and sits on Bob Saget's lap. it's on a hill so you get a great view of the San Francisco skyline and its perfect for hill rolling. try to avoid of the turds.", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-24", "description": "its a really nice park on a hill. you get to see an amazing view of the SF city and the houses ( painted ladies) which are very uniquely decorated.. reminded me of full house. =] visit the secret shoe garden! saw lots of people walking their dog.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-13", "description": "okay, since the houses are on the cover of most of the tourist guidebooks, it wouldn't hurt to take a look.  yup, that's danielle steele's house.  click, click.  if you take the time to walk around the small park, you'll find a quaint shoe garden.  it's cute and unique.   other than that, it's mostly a park for dogs...maybe b/c it's too windy here to just hang out.", "author": "Immer E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-07", "description": "best park in the city, nuff said.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-05", "description": "our home away from home.  we go here with the dog 2 - 3 times every day and love it every time.  amazing old trees (that sometimes lose a branch or two!).  if you are not a dog person beware - few people follow the leash guidelines and there are some abandoned excrements from time to time.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-14", "description": "if you've even heard of full house, you must visit this location to see the painted ladies.  the park itself has great views and you have to be pretty lucky to be able to take a pic of yourself without a ton of other people in your photo.  visit this location at night for a nice view as well.  if you walk to the bottom corner, you can see the civic center down the street.", "author": "Bryce K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-15", "description": "on one side of the hill it's a spot for my brown baby to get his park on and on the other a breezy sunny spot for me to read, relax and have a spectacular view of my beloved san fran...and I heard that in the middle is  an awesome patch of shrubberies for gay boys to do the wild thing!!!!", "author": "hungry b."}
