{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "My favorite Chinese restaurant, as a former Mission then Diamond Heights resident now in the East Bay - if I'm in SF around dinner time, I travel across town to get some to-go. \n\nBest Shanghai Chicken and love that they will make Fried Brown Rice!  Nice staff, quiet atmosphere, completely lacking tragic hipness - support this local spot at 29th & Sanchez.", "author": "Marie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "My favorite place n my daughther favorite place! Customer service is wonderful and food is amazing! Want to join a nice experience this is the place you need!", "author": "Rocio M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "I've been eating at Eric's since moving to the city and recently heard about Alice's just a few blocks away. Started with the hot and sour soup which if you're a fan is fabulous!  I've NEVER had better - I'd call it spicy yummy good!!  The chicken with cashews was the 3 Fs - fresh, flavorful, fantastic!  And not to be outdone was the Alice's Spicy Eggplant. Shrimp, Chicken and Vegetables in a delicious garlicky sauce. \nFinally, the atmosphere is bright and charming and the wait staff friendly and professional. If travels bring you to Noe Valley make time for Alice's. Enjoy!", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "If you're looking for a good Chinese restaurant in Noe Valley, try Alice's. \n\nI went there with my friends on a Friday night. The service was warm and food was delicious. Our waitress was sweet and knowledgeable. We ordered : Sizzling rice soup, Pot sticker, Shanghai chicken, Alice's eggplant , Mooshu vegetables and Alice's chow fun. Soup was tasty. Pot stickers were home made, you could tell the difference from frozen purchases. Shanghai chicken was served with seaweed, so yummy. Alice's eggplants came with chicken, shrimp and basil, amazing. The waitress did a good job rolling mooshu vegetables with pancakes for us, professionally. Our water glasses and tea pot were filled twice. \n\nThe restaurant has a great atmosphere, busy and tidy. Most patrons are repeated local customers. We will definitely go back again.", "author": "Nina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "My absolute favorite Chinese food spot. Delicious, fresh and non-greasy.\nMy husband has been coming here since he was a little kid. \nStaff is friendly too.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "Have to knock off one star again, the flavors are starting to be the same for a lot of the signature main dishes like the mango chicken or the smoke pork dish. Bottom line, SODIUM levels through the roof! I went from 5 stars in late 2000's to 4 Stars in the early teens because of the rushed service. Now the avocado rolls are still delicious, but the last order we received, the oil spilled out of the roll....or to  o much oil. There are several yummy dishes like the orange chicken or the scallop dish. But I will say when they are busy, they're good at serving tables and being attentive, when it's dead....they are still in busy mode. there were only two other tables seated when we arrived and no came in for an hour after we sat. All of our food came out in one fell swoop covering the entire table. gone are the days when dishes would come out a leisurely pace. I hope they can refresh.....", "author": "brian k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Great service! \n\nAlice's Eggplant is so BOMB and the string beans were really good too. We had the avocado spring roll and I was not a fan. Everything else was delicious. The ambiance is nice and bright!", "author": "Fatima H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Came for dinner with a friend and we shared:\nAlice Cakes - Scallion Pancakes with a peanut sauce - fried crispy and delicious\nMango Prawns - have never seen before so we tried it\nHunan Lemon Prawns - soooo good with a smoky spicy sauce and lightly breaded and fried\nAlice Chow Mein - all kinds of meat, so I would probably ask for chicken only next time - not a red meat/pork fan\nI'll be back - and the setting was nice and clean - bathrooms too! Dining room was also quiet and you could easily have a conversation at your table.", "author": "Christine V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Have you ever gone to dinner right after really fun sex? If not, do that, and then go here. Trust me, it's the best food ever. ;)", "author": "Tom W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-11", "description": "One pill makes you larger, and one pill makes you small\nAnd the ones that mother gives you, don't do anything at all\nGo ask Alice, when she's ten feet tall\n\nJefferson Airplane. Haight Ashbury. Make Love, Not War. None of this has to do with this restaurant, but I just wanted an excuse to go ask Alice, man. This probably ain't that Alice, but I'm thinking Alice has something to do with Eric who operates a nearly identical-looking Chinese restaurant a few blocks north on Church in Noe Valley. Sister? Ex-wife maybe? If so, she didn't do well in the divorce settlement because her location is on the decidedly more residential Sanchez Street. Both are housed in refurbished Victorians though Alice's configuration felt more crowded for some reason.\n\nThe other difference, I have to admit, is that the staff is not as friendly at Alice's as emphasis was placed on speed over substance. I must have come at an opportune time since they gave me a table for four, a decision they likely regretted since a stream of diners in packs came in after me. I would have moved, but they already set out the tea and water for me. OK, I'll eat quick then. I first ordered the $5.50 appetizer of Garlic Eggplant, which they sliced into halves and covered in a sweet hoisin sauce with sesame seeds (photo: http://bit.ly/1UGknkt). It was Chinese eggplant, so it was good and tender if a bit oversauced for my taste.\n\nSpeaking of which, my entree was the $11.25 House Special Duck which was not exactly what I had anticipated. I was hoping for a crispier duck with minimal sauce, but instead it tasted more like a sweet-&-sour version heavy on the sauce with the duck hidden in a pile of cut vegetables (photo: http://bit.ly/1L5SNav). The duck was good quality and the skin well rendered, but the wok-fried preparation really wasn't what I was in the mood for. But I better finish because there are people waiting at the front door. There was no offer of dessert, but who eats dessert at a Chinese restaurant anyway?\n\nWhen the men on the chessboard get up and tell you where to go\nAnd you've just had some kind of mushroom, and your mind is moving low\nGo ask Alice, I think she'll know...but probably not THIS Alice\n\nFOOD - 3 stars...hearty dishes are heavy on the sauce here if that's your pleasure, not mine so much\nAMBIANCE - 3 stars...like Eric's twin sister...or perhaps look-alike ex-wife\nSERVICE - 2.5 stars....rush, rush\nTOTAL - 3 stars...go ask Alice...yeah, groovy, man", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Favorite Chinese food in SF! Best garlic eggplant ever. \nSo many vegetarian options, that's awesome. Love the place and the food. And the staff is amazing as well. Just love it!\nAnd parking is easy too.", "author": "Marianna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "Great food and was VERY good quality.  Also the food was NOT greasy either.  The eggplant and asparagus was VERY GOOD.  None of the chicken dishes were too spicy although I prefer it to be more spicy.", "author": "Ryan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Simply the best Chinese food I have found in San Francisco.  Simple and unpretentious, yet delicious and not greasy.   Every dish I've had here is fantastic, but the Pot Stickers, Mongolian Beef, Walnut Prawns, and Shanghai Chicken are not to be missed!", "author": "Benjamin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "We have eaten here several times, and really love the food, but as has been previously mentioned, the service can be really lacking during busy times. \n\nWe had Christmas dinner there -- I understand that's a busy time, but they didn't \"staff up\" for it at all. WORST: They had you put your name on a yellow pad for a wait list, but they didn't call names at all, or actually use the list. They just seated whoever was hanging around the yellow pad. It made for a very chaotic, competitive, and unpleasant atmosphere. They are so under-staffed that there is no time to make you feel welcome,  instead, you feel as though you are in the way. \n\nThat said, come at a non-busy time...the Mango Chicken is delicious.", "author": "M H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Cute neighborhood resturaunt. The food was served family style, so one entree can feed two people. Food wasn't amazing, but it satisfied my want for some decent chinese after a long day. Also appreciate the free hot tea!", "author": "Bethy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "I've read some of the other reviews and agree. However, I've been coming to this restaurant for over 15 years and have sadly seen a decline in service. The food is still good but the service is slow. Customers are not acknowledged when they enter the door, are slow to be seated and waited on.\n\nI miss the waiters and waitresses that used to be there and their friendly service.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "One of my favorite chinese food is San Francisco. The food is delicious. I love their won ton soup and pot stickers for starters and all the main dishes are good. Love this place. The service is quick, they are so sweet constantly refilling our water. We always leave a tip", "author": "Liset O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Hands down on of the best Chinese restaurants I've been too! From the garlic eggplant appetizer to their orange prawns and Shanghai chicken! G-d it's delicious! \n\nThe staff remembers you and always smiles. Good service and the food is always consistent. The atmosphere is relaxed and interesting. Keep up the great work and looking forward to more delicious meals!", "author": "Rich B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "A lot of folks these days seem to worry a lot about whether a food is authentic or not. I could care less if it's authentic, I just want it to taste good. And this food tastes really good.\n\nMy husband and I are on a mission to try every restaurant in Noe Valley, and this is our second Chinese place. I prefer this place so far to Henry's Hunan, but maybe we ordered the wrong thing at Henry's so I'll probably give it another chance in the future. But one thing Henry's doesn't have is crab rangoon, and Alice's crab rangoon ($7.25) was delicious and more flavorful than others I've had.\n\nMy husband had the Szechuan Pork ($9.75) and jasmine rice. He really liked his dish, but I thought it was really strange. The pork is laid entirely on a bed of bamboo shoots. So make sure you REALLY like bamboo shoots before ordering this. It's probably close to 2 full cups of it. Personally, water chestnuts, bamboo shoots, and baby corn are my three least favorite veggies found in some Chinese food, so this definitely was not the dish for me - but that's okay - I didn't order it!\n\nI ordered the Chow Mein and asked for chicken and veggies ($8.95). I was so surprised and delighted when the veggies that came out were all fresh, crisp but flavorful, high quality veggies. We're talking broccoli, asparagus, fresh mushrooms, zucchini, snap peas, snow peas, carrot - my dream. The chicken was also flavored very well and there were no chewy/gross parts (I'm picky about my meat!).\n\nWith tax & tip (we had water), the bill came to $36. Both my husband and I had enough leftovers for a huge lunch the next day. We will definitely be back!", "author": "Kendra N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Alice's is exactly what you would expect from a standard Chinese restaurant. Not the most authentic, but reasonably priced, fast service, and tastes good. I would come here if I were in the neighborhood, but wouldn't go out of your way to come.", "author": "Lucy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Good food, very friendly service, generous portions... a nice neighborhood standby that we'll continue to go to!", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "I took out of town company here because of the great yelps. What a disappointment.\nWe had sizzling rice soup that I like because restaurants usually make a big deal of making the rice sizzle. This waitress just dumped it in. Pot stickers were very tough, hard to chew. I mentioned it to the waitress, but no response. Broccoli beef also very hard to digest.\nNot very impressive for sure.", "author": "jane s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Clean fresh nice quality Chinese food. Approachable and friendly staff, very attentive. Big portions, fast service. Nice little chilled backstreet location. Clean and tastefully decorated premises. Way better than many other Chinese restaurants I have been to in SF. They actually try, by being courteous and offering quality! Our new go to!", "author": "Scundy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "This is our favorite Chinese restaurant in San Francisco. It's excellent. We have been here dozens of times. Some favorites are the walnut prawns and Mongolian beef. The beef is very tender and delicious. Also the pot stickers are great! They come with this delicious dipping sauce. We pick up take-out a lot from here. I believe they are open all day, so even if it's at a strange time, like 3:30 pm for lunch, they are still open, which we appreciate.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "One of my favorites. Been coming for over 20 years and still pretty consistent. Same menu as Erics but like it much better. Bit quieter and less of a scene.", "author": "Bilbao B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Love their food. Prices are reasonable. Usually available parking within a few blocks. Always plenty to  take home.", "author": "Nona B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Sometimes service is a tad slow but the food is wonderful. And I don't really like Chinese food that much. It's always clean and they will substitute things for you. Very friendly service", "author": "Rita B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-09", "description": "This used to be my favorite restaurant.  Unfortunately, the service and food have become really gross.  The dishes were bland and tasted terrible.  We ordered one bowl of white rice, and noticed on the ticket that the server had written in Chinese that they charged the rice which was listed as $1.50 for $6.00.  When we brought it up to the wait staff, they proceeded to argue and said that they brought a large bowl of rice, which is four servings.  We did not ask for four bowls of rice, we specifically told the server ONE.  Without our prior knowledge or consent, they charged 18% tip.  We didn't get any service from them, and attempted to dispute this and the staff resisted with more argument.  With that kind of poor service, unfortunately Alice's has lost our business.", "author": "Bonnie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-30", "description": "The potstickers were the high point. Tasty and nicely pan-fried. Lunch special curry chicken was mostly potatoes sweet and sugary. If you like very sugary and sweet curry this is the place to go! When I pointed out to the server that the chicken curry was in fact mostly diced potatoes and extremely sweet she expressed surprise telling me how much she loved the potatoes. I told her they should call it sweet potato curry! The mango beef was also very sweet and sugary. The soup was watery and tasted as if it were extremely low sodium. The location is convenient and clean. Maybe we just ordered the wrong things. Last time I ate here was over 5 years ago. I think I will probably not return for another 5 years.", "author": "Bob J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "One of the best Chinese restaurants I've been to in Bay Area. The Alice's Spicy Chicken isn't really spicy, but the chicken mean was tenderized so well. It's even better with steam rice. Other recommendations are Sunflower beaf and Orange beaf. The orange beaf is a bit sweeter than I expected, so it'd better to be enjoyed with soup. Their servings are quite large servings, so you probably don't want to order more than one dish per person. Meanwhile prices are reasonable. Waiters are generally very nice there.", "author": "Di W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "In a residential part of town, it's an asset to have a good restaurant order from just around the corner from home. Food is always ready within 20 minutes if you call ahead- my orders are always ready quick because I'm vegetarian so it might take longer for meat eaters. Always kind service and decent prices. Few Chinese places in SF make scallion pancakes just the way I like them, and Alice's cakes always hit the spot. No case of the Mondays here!", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Alice's is always on the itinerary when family visits SF, since 1996. Always enjoy the dishes and wonderful care give to the whole meal.", "author": "K W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "This is the worst Chinese restaurant I've ever eaten at in San Francisco.  I'm third generation Chinese American and grew up in San Francisco.  I know very little about \"authentic\" Chinese food, but a lot about Americanized Chinese food for San Franciscans.  I'm not above eating cheap, sort of gross, but really satisfying Chinese food.\n\nThis place is not cheap, not satisfying, and just gross, which is a pity b/c it's definitely cleaner than most other Chinese restaurants.\n\nI ordered pot stickers, corn chicken soup, special chow mein, mongolian beef, and tofu broccoli.  The soup had so much corn starch in it, the top layer had turned to soup jello.  The chow mein, beef, and tofu broccoli all had the same \"brown sauce.\"  When the waitress described the sauce as \"brown sauce,\" I assumed she meant some combination of soy or black bean or oyster sauce.  But it really is just brown, starchy gravy with no recognizably Chinese flavor.  The pork in the pot stickers had turned brown and dry because of too much soy sauce and overcooking.\n\nThere are no good Chinese options in this little part of Noe Valley.", "author": "Pearl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "delicious food, I had the wonton soup, and Mongolian beef with a side of white rice absoulotly delicious. food was fast, fresh and portions were generous. the staff are very friendly. highly recommend this place.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "I'm giving this restaurant two stars for good tofu skin salad and reasonable pork and Napa cabbage dumpling, but now their name has been changed to shandong taste in chinese but they are not authentic at all! All the dishes are so sweet with similar side ingredients for every dish, the spicy noodle claimed to be made with hand made noodles but it wasn't, came in a clump with no taste. The appetizer pork is so tasteless I had to add my own sauce.\n\n\nDon't go there. There too many better choices around.", "author": "SJ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Alice's Restaurant is one of my three favorite Chinese spots out in the neighborhoods, in this case Noe Valley and off a side street (Sanchez) so you really feel like a local.\n\nUnassuming but tasty food, particularly their mango anything (chicken, prawns or beef) and their lunch deals are pretty phenomenal.  As a city-dwelling family, its hard to beat their princess plates (for the little ones) and their vegetable fried chicken with extra eggs (or add chicken) and tons of fresh vegetables and nice umami flavor.  You won't feel guilty taking your child here, and its pretty delicious for the adult set too.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "I have been eating at Alice's for years. I love the place, and have tried many of the dishes. I even know the waiter by name. But today (Sunday) I had a very bad experience there. The owner arrived in the late afternoon to do the books. As soon as she walked in the door, the stench of heavy perfume was overwhelming. I have bad reactions to perfume and could feel a fever rising in my face. I told her that her perfume was overpowering, and she said she was not wearing perfume, she was wearing lotion. Who the .... cares if it's lotion or perfume? To the chemically sensitive, it's all horrible. As the owner of a public restaurant, this woman needs to be more aware of and sensitive to the environmental issues of her customers. If you have sensitivities as well, don't go to Alice's around 4 pm on a Sunday. I had to leave immediately and couldn't even enjoy my tea and fortune cookie.", "author": "mary h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "This is one of the best Chinese restaurants in San Francisco. Every time I come here I order the generals chicken. The general chicken here is the best. I would come here again. I would brink my friends her anytime they want good Chinese food in San Francisco.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "THE WAITRESS RAN AFTER ME FOR A TIP!! Never ever going back...the food was alright but not all that! I was visiting from Germany and just wanted some Chinese food, bye bye San Fran", "author": "Britney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "This place is unbelievable, with their service, food quality and price is amazing. A great spot for everyone. \nHighly recommended.", "author": "Maher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Best orange chicken I have ever had. Ever. The fried rice was also delicious. The duck dish was not great, but the fried rice and orange chicken I had more than made up for it.\n\nGreat service too, with a friendly staff, that's eager to please. I will be a frequent customer!", "author": "Miguel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "So good food is fresh clean other Chinese food places I see hair in my food all the time once I found a long pice of hair siting on top of my water but at this place is never find hair in my food and they have a clean restroom", "author": "Charlise E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-25", "description": "This place barely deserves one star. Just like other reviewers who dine at places like Toast, it seems those who frequent Alice's literally have no concept of what decent tasting food is.\n\nEverything was either flavorless or was sickeningly sweet - potstickers needed to be doused in chile sauce to get any semblance of flavor, spicy garlic beef was some of the worst quality beef I've had, and the sauce wasn't spicy (despite asking for it to be made extra spicy), but was instead very sugary tasting.\n\nSweet and sour chicken was incredibly sweet to the point of being completely inedible, and the hot and sour soup was neither hot nor sour.\n\nBoth my roommate and I felt sick after eating there, and none of the three of us who ate there together could understand how this place had any good reviews whatsoever.\n\nTo top it off, when it came time to pay the bill, which came out to something like $38, they charged exactly $40 to the credit card - it wasn't much difference, but that's SUPER shady. Needless to say they didn't receive much of a tip after that experience.", "author": "Kyle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "I just had my first of many lunches at Alice's. I'm as stoked about the food as I am about the service. Such amazingly nice people. Plus, Wow!!!, I got a lunch and took an appetizer home for later for less than $20 in Noe Valley. Sweet!!!", "author": "Marc R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-03", "description": "This place is very mediocre for there poor service and food. The customers were very rude and no responsive. The food also came out very late even though I was one of the very few people inside. While I was eating I felt something very weird and there was a string AND hair in my food. This was very upsetting and I will not return.", "author": "Nicholas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "It took us awhile to decide on a place that suited the three of us for lunch. Why? Because I come from a family of foodies. We either all agree on the same place or we have a hard time deciding. I think I am just more vocal about where to go, as I'm the yelper in the family. \n\nWe came to Alice's, it's a nice clean little restaurant In Noe Valley that serves tasty and inexpensive Chinese food. Lunch specials come with soup, entree and rice for around $6.00. The soup is an egg flower soup with tomatoes, yum. \n\nI had the Kung Pao Chicken, my Sister had the Salmon Vegetables and Mom ordered the Eggplant. Each meal was really good and I tried them all. :) \n\nIt was a nice little lunch accompanied by tea and lots of water. Food was fast and service was great. The whole bill was $21, a great lunch deal for 3.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "Been coming here for at least 15 years. I've always had really fast service, delicious food and excellent value for the large portion sizes. I have no idea if it's authentic Chinese or not, I really don't care. It's just super yummy and a good price, that's all I care about. I would give 5 stars if they delivered, but I think that's how they keep quality high. Now we drive over, call about 5-10 minutes before we get there, and our order is always piping hot (even when they are super busy).", "author": "Philip M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "We've been frequenting Alice's for many years, living close by in Diamond Heights and now in Glen Park.  The food is very good, and we always order the same dishes: pot stickers (ask for some plum sauce!), the won ton soup, and the mu shu pork (my mother-in-law constantly reminds us it's the best she's ever had).\n\nQuick service, friendly wait staff.  Pricing seems reasonable/market rates.\n\nThe only thing negative to mention is to avoid the take out.  Twice we've tried and been disappointed once we got home, especially the won ton soup (day old ...?).  Enjoy your meal dining in and you won't be disappointed.", "author": "Ron F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "This is hands down the best Chinese restaurant Ive been. For those who want to eat Orange chicken with real slices of orange peel and jalapenos, this is the best one that you will have!", "author": "Ariane C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-10", "description": "I am so surprised by all the 5-star reviews. Perhaps this was a first experience with chinese food, or there is a dearth of taste among reviewers, or just a kind desire to give 5 stars, but...this was one of the worst experiences I've had with Chinese food in some time. \nThe sizzling rice soup's brothe had what seemed like zero salt or seasoning of any kind. It was, literally, hot water. \nThe cashew broccoli tofu's seasoning was so coarse and amateur: basically thickened soy sauce. \nThe shanghai tofu was overly sweet and overall boring, and the tofu dry. \nThe only redeeming dish was the chow fun, which had a nice basil flavor. \nService was meh - the younger woman was completely unsmiling. The older woman, perhaps owner, was friendly and kind. \nI do not recommend.", "author": "China Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-11", "description": "Their Assorted Vegetable Soup is very good. The vegetables are always super fresh and crunchy. \nI tried Alice's Chow Mein tonight and thought that was pretty good too. It could have been tastier though. It definitely needed more flavor. \nMy favorite dish is Alice's Spicy Chicken. \nThe service has been good each time I've been there. It's kind of like a happier version of Eric's on Church Street.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-07", "description": "Oh yeah, I forgot to mention.  When we left there was a dead rat in the street out front.  I don't know where it came from or what it means, but it can't reflect well....", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-25", "description": "Had dinner here w/ my friend and it was okay. It's not your hole in the wall that you would serves you \"dirty\" Chinese food which is all you want sometimes. This place is a bit nice. We had hot and sour soup, mango prawns, string beans, and rice. It was alright. The mango prawns were a bit too mango-ey for me. We didn't realized the string beans were dried sauteed string beans and the hot and sour soup wasn't that warm when we got it. So it was just okay. I wouldn't come back. Service was just alright too. Nothing too special about this place. No wait either.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Really good for takeout Chinese. Really close to where we live and fast every day except for Christmas haha. We love the mango chicken, broccoli cashew tofu, and Kung pao tofu. Decent portions and price.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-24", "description": "Being vegetarian, we ordered 2 dishes -- portobello mushrooms and tofu, replace oyster sauce with just garlic. Buddha's delight that suppose to be spicy.\nThe tofu tasted funny. The Buddha's delight is not spicy and look awful. Waitress told us error on the manual. Should not be spicy... Well, first and last. Not friendly services....", "author": "Melvon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "My friends and I enjoyed a delicious lunch at Alice's restaurant today. The ambiance was beautiful and the food was delicious. The wait staff were friendly and we did not have to wait long for our food. The water and tea came right away. My friend asked for Walnut Prawns and asked for Mango over the dish, which were sweet and tasty. She loved her dish. We started off with Alice's Cakes, which are pancakes with green onion and a special sauce. It was tasty. My other friend and I both ordered the Shanghai Chicken with pine nuts and a spicy sauce. It was delicious! They will accommodate you with how hot your food is. We also ordered The Eggplant in Spicy Sauce and the Broccoli in Garlic Sauce, both very delicious. We all ordered Hot and Sour soup and Chicken Won Ton soup to go, all delicious. I ordered the Vegetarian egg rolls to go, which were just o.k. We will go back. We really enjoyed our meals.", "author": "Donna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "I have been coming here since I was a kid and It is my favorite place for Chinese. My favorite dish is their Orange Chicken... Literally the best Orange Chicken I have ever tried, and I have tried a lot! I seriously order it at all other Chinese restaurants and nothing even comes close. It's not overly sweet with a little kick in the spice department. All other dishes I have tried are amazing as well, The mango Chicken or Beef is Delicious especially when mangos are in season. My mom loves the Walnut prawns and their wonton soup. As far as appetizers go their Crab Meat Rangoons are the best I have had as well. Not too creamy and you can actually taste the crab. \n\nTheir service is amazing as well, they are friendly and accommodating. The service is usually very speedy except during peak hours which is understandable. They are a direct competitor to Eric's Restaurant which is down a few blocks on church. I have only eaten their a few times and its not even close. The only reason they are more popular is because of their location. But I dare you to walk a few more blocks up to Sanchez and try one of my favorite restaurants. You will not be disappointed. \n\nThey are great for take out as well but only if you live within 10 minutes and pick it up right away, everyone knows soggy warm food is not close to fresh! So i would suggest eating in for you first timers!", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Fantastic presentation, Fresh ingredients, Fabulous flavor.  I am still dreaming about the food.  I will bring everyone I know to this restaurant even if they have no taste, they could learn.\n\nUpscale Chinese neighborhood restaurant!", "author": "Celeste A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Decent Chinese food, with great lunch set!  I had fish with black bean sauce, it is really authentic!  Will definitely come back!", "author": "Ann B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-25", "description": "It is a nice clean restaurant and the service was pretty good.  If I weren't meeting friends there, I would have turned around and left when I saw that there were no Chinese customers.  For someone who likes Americanized Chinese food, Alice is great.  For someone who wants authentic Chinese food, Alice is not it.", "author": "Egen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "As a Asian, I feel like I have the right to be picky and critical about Chinese, Japanese, Vietnamese, Thai, and Filipino restaurants. You wanna really piss this Pinoy off? Then, serve me kung pao with rancid sesame oil or chow mein with La Choy's dry-catfood-like fried noodles.\n\nLuckily, Alice's does not disappoint this Asian a**-hole.  This place is clean, well-decorated, with pleasant staff checking-in regularly to make sure everything was o.k.  Tonight we kept it simple with mango prawns and sesame chicken with brown rice.  Both main entrees were really good and innovative.  The mango prawns was my favorite with a great sweet, savory, and kind of tangy sauce delicately glazing tender shrimp in a pool of largely diced mangos and a perfect smattering of roasted jalapenos.  The sesame chicken was great too; using ample amounts of black sesame seeds and a bed of sauteed yet crunchy julienned vegetables, this dish was quite innovative.  \n\nAlice's is a chill, low-key place to hang out, relax, and enjoy good modern Chinese food in the warm company of friends.", "author": "Paolo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "Nice neighborhood Chinese restaurant with easy parking!  My family came here to celebrate my brother's bday lunch and for the 6 of us we ordered 6 dishes.  Everything tasted fresh, wasn't swimming in sauce and came out promptly.  I would definitely make the trek out here form the Sunset district next time I wanted some Chinese food!", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "Stopped by earlier today for lunch and was not disappointed by the food or the environment. The restaurant was very clean which is always a good sign for me and the service was prompt. However, our original waiter left before we finished our meal and someone else came to clear our plates while my mom and I were still eating. I guess that's my only criticism. But the food was so tasty that I'll give that overzealous waiter the benefit of the doubt. The sweet orange slices that accompanied our fortune cookies were a lovely touch.", "author": "S. A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-09", "description": "Ordered salt and pepper tofu, curry prawn and house special hunan smoke pork. All are quite salty. Food is so so but services are good.", "author": "Ying C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Just stopped in for a quick Sunday night, post basketball game, dinner.\n\nWe don't go to Alice's for gourmet, we go there for the consistency.  \n\nSome of our favorites:\n\nFried Dumplings\nDrums of heaven \"yum\"\nGarlic Prawns\nOrange chicken - Jr's favorite\nShrimp fried rice - A staple", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Instructions:\n\n1) Go to Alice's\n2) Order at least pot stickers, Drums of Heaven, and General Tso's Chicken\n3) ......\n4) Belly Profit", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Great food! Very cool Semi fusion! Great concept, excellent service, no complaints except for parking,  definatelly Not your MSG heart attack 4.99 \"\nChinese food\" you never regret eating here, only regret is not ordering lunch for the following day!", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "The Best Hidden treasure in the Inexpensive chinese non america food. \n\nI have seen the owner work in the morning preping the food. \n\nWhen the boss is there consistantly, you know the food is going to be good.\nps. this isn't your panda express menu. its the real deal.", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "This is my favorite Chinese food in SF! Very fresh and very lite oil used on their food. Highly recommend the basil chicken, cashew chicken, sesame beef or won tons!!!", "author": "sean d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "I love this place. It is great to eat in their dining room or to get delivery. Every time that I have been to the city to visit my brother, we have had to either get it delivered or make the trip over to eat there. I love it!\n\nMy favorite dish is the Mango Chicken! There is absolutely nothing like it anywhere I have had Asian food. Alice's Spicy Chicken is also to die for.\nAll of their flavors are great...and with the plethora of Chinese/Asian food in the city, this place really stands out as unique and unlike anything you can get somewhere else.\n\n Mango Chicken, people, Mango Chicken.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-15", "description": "They did not have Shanghai Soup Dumplings as advertised here on Yelp. I was very disappointed by that. However, very nice environment and very clean. The won ton soup was meh and the crab Rangoon was the highlight.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-07", "description": "I am not sure who Alice is, or if she or he is a real person...\n\nBut, in any case, Alice's does provide a low priced and varied menu. I never ever order \"take out\" , I LOL at 1 reviewer's comments on the \"phone service\" calling to demand their grub and issue complaints in their review. Kinda like \"hey I a spendin $10. and I expect you to kiss my ring and bow down\". I may start a \"get a clue\" service (like call 1-800-get-clue). But at the same time $10 is as huge sum of cash for some people, so they have very high expectations. \n\nLiked the Walnut Prawns ( ok, I know this is a \"round eye\" dish),  also the eggplant ( w/ chicken ). Itsa cheap place with good service and good food. Been to Alice's 3 times, when in that Noe hood and liked it each time.", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-01", "description": "Alices, what happened?? I got terribly sick from your food this past weekend! Both me and my friend got violently ill on Sunday night and going into Monday. I'm still not 100% three days later! Worst food poisoning I've ever had!\n\nWe ordered takeout on Sunday night July 29 and ordered: walnut prawns, pot stickers, combo fried rice, mango beef, and the chicken with the pine nuts and sea weed. Something there was either bad or not cooked, either way we both are really sick and I'm sad to say: will not be patronizing your business anymore. It's a shame because I used to love your restaurant and would tell all my friends about it If they were looking for clean and delicious Chinese food. Clearly that isn't the case anymore. \n\nNot sure if anyone else reading this was there that night or that weekend and also got sick...we could not have been the only ones. \n\nPlease clean up your act and serve fresh food! You've already lost me and my network of friends and relatives that are in your area... Don't lose anymore by not addressing your food preparation issues and quality", "author": "Antonio G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "This is my favorite local Chinese food restaurant. The service is good and the food is great. I like to come here because the vegetables are so fresh. Two favorites are the vegetable soup and the vegetarian mu-shu. Highly recommend.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-04", "description": "Fast friendly service.  Great lunch prices. We took our food to go but I bet it's better when eaten at the restaurant.  Will try again soon.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-02", "description": "They use good fresh crunchy veggies. Check!\nThe wonton soup was so-so - good veggies, wontons were very gingery - but need more flavor overall.\nThe seafood entree was in a yummy finger-licking brown sauce.\nThe place is pretty inviting.\nOverall, good!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-31", "description": "We used to go to Alices once a week. It has gone down hill and my last experience with them has made me not want to ever go back. I ordered something with meatless chicken. Some of the pieces tasted okay and others tasted old and moldy. I left most of it on the side of the plate and just ate the vegetables. I told them that the meatless chicken had an awful taste as if it was old. They went back into the kitchen to check and told me it was a different brand they are using. This did not make sense to me as every 2nd piece tasted weird, so it could not have been the different product but rather a bad old batch they had used. I was waiting for them to offer a discount as they saw I had left so much on my plate. But they did not, so I will not go back there again.", "author": "Cos S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "A few of my favorite dishes: the prawns with broccoli and cashews, Alice's chicken, the dried fried green beans and Alice's onion pancake. Their lunch special is a good bargain and it comes with tasty soup. The only downside to this restaurant is the fact that it gets pretty busy and the service can be slow/bad.", "author": "John L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-28", "description": "I've come to this place many times, the food is Ok, don't like the fact that they hide the score given by Dept of Public Health (88), but I enjoyed some of their dishes.\n\nMy husband and I were craving some wonton soup, we both wanted to get our own container, so we decided to order two small wonton soups. For some weird reason the person that took my order last night had a problem with me ordering two and no one large soup.\nI thought it was strange but didn't want to think of it. He came and gave me our soups, gave him my credit card and before I left, He told me that \"next time I should order one large soup and no two, because it didn't make sense\".\nI wanted to say many things but there were children around,  I told him He neded to listen to what the customer wants. \nNow, there's thousands of restaurants in San Francisco, don't see why I need that kind of service, therefore we are not coming back to Alice.", "author": "Nancy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "Came here for dinner and I am glad! Their crab rangoon with sweet & sour sauce is perfect. The waitress was on top of things.\n\nMy favorite of all time: Mango Beef! Eeeeeehhhhhhh!!\n\nWill definitely be coming back for more, maybe this weekend?! *wink* *wink* I am happy that it's by walking distance. Oh yeah, next time I'll order two bowl of rice! LOL, and I ain't kidding! Seriously! Haha ;-)", "author": "Jackie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Had general tsao's chicken, pork dumpling, alice's cakes, and hunan fish and everything was delicious.  Fish could have been a little crispier (slight soggy bread texture) but everything else was top notch.  Looking forward to exploring more of the menu and hearing more about alice and eric!  Did they use the same designer?", "author": "Norman P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "This is the best of the 3 neighborhood Chinese places (the others being Henry's and Eric's). It feels very neighborhood and never seems to get overly crowded. The best dish is the orange chicken and the best appetizer is the potstickers. Cream cheese wontons are okay but not my fave. I definitely like the beef and broccoli for something slightly healthier.", "author": "Bobby H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "This is the closest restaurant to my house, by almost one full block. TRANSLATION: I'm glad this place is good, because I'd probably eat here twice a month even if they exclusively served shit on a shingle.\n\nThere are three Chinese restaurants in roughly a 3 block radius of this spot (Alice's, Henry's, and Eric's). It is hilarious to read people's Yelp debates about which one is superior to which because they are EXACTLY THE SAME. Seriously, I've been to all of them and they are remarkably similar in layout, decor, and taste/quality of food. I'm 97% certain that they just have one centrally-located kitchen with 3 different hallways, each one leading to the dining room of each separate establishment. This theory has proven extremely difficult to confirm. People get weirded out when you start skulking around the back of their restaurant, checking doorknobs.\n\nAnyway, Alice's has terrific Chinese Food For Gringos (kung pao, crab rangoon, etc.). You should see it on Christmas Eve, the place is PACKED with our Hebrew friends. I might even give 5 stars if they didn't put carrots & peas in the fried rice, that is, pathetically, a dealbreaker for me. But if you can't decide between Alice's, Hank's, or E-Dog's, just go wherever is closest. Science.", "author": "Trav W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "Best Chinese in sf. Great attentive service. Try the tofu with seaweed. Also the avocado egg rolls.", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-19", "description": "Came here with some friends a few weeks ago and was amazed by how awesome their food and service was.\n\nService :Upon arriving, we were kindly greeted with a warm smile from our waitress. \n\nAmbiance & Decor - Contemporary Chinese, it's not your usual hole in the wall Chinese Restaurant. Their wall separators are beautiful.. it gives the restaurant a very antique yet classy feeling\n\nI was told their avacado egg rolls were a must .... OMG if u enjoy avacados, you will definitely find this dish astonishingly yummy :)\n\nOrange Chicken - fried to perfection with the sauce being well balanced \n\nEggplants - I love eggplants, and Alice's did a fantastic job with this dish!\n\nWill definitely return to try the other items on their menu!", "author": "linda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-22", "description": "This restaurant is (similar to Eric's which I just posted) alsolike a spinoff of the Eliza Restaurant that used to be on 18th Street in Potrero Hill.  They cook (seems like) Hunan-style Chinese food geared a bit towards non-Chinese.  Nice decor.  The one time I came I think I ordered something with duck and it was good.\n\nThis restaurant is also neat in that it seems to be the only restaurant on that street (especially on that part) and not on the Castro or Church St corridor.  I like looks of restaurants that stand out by itself as such.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "Favorite Chinese food in San Francisco. The pot stickers are a must have, and so is the Orange chicken. It's ever so slightly on the upscale side. They have beautiful orchids in the windows on a center table. The staff is friendly and sincere. In the middle of the neighborhood, with nice street views.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "This is probably the best Chinese food I've ever had in San Francisco. If not the best, one of the best! \nAs for appetizers, the crab rangoons and potstickers are to die for. No question asked.\nFor entrees I usually order chicken fried rice, which is always perfect and delicious, there is enough chicken cut into nice strips, which I find comforting considering I don't like very large pieces of meat in my rice. \nAn order of beef chowmein. The beef is MAGICAL and not to mention flavorful, it also comes with fresh veggies such as broccoli, peas, carrots, mushrooms that are just as delicious in the wonderful sauce they use. \nThe mango chicken is another dish I order on occasion, you can order this plate from mild to spicy, I usually order mild for my taste and it is delicious. The sauce is delicious and I find that the mangos always taste ripe and fresh.\nMy mother says she is in love with the mango prawns, the sauce compliments the prawns well and adds a certain contrast that's irresistible. She has also mentioned that the prawns are always very fresh, which is great because some people feel berry iffy on shrimp.\n Every time I dine or take out I have never felt too full, the portions are nice and large there will be some to take home, and NEVER has this food made me sick.\nI truly recommend if you are in the area .", "author": "Andrea V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "I'd give Alice's 4.5 stars if I could. They have great Chinese food for a reasonable price. I eat here every week and my favorite dishes are general tso's chicken, vegetable chow mein, and avocado egg rolls. Definitely recommend!", "author": "Jane S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-31", "description": "The food was acceptable.  But when one if the over-rushed waiters spilled a soup all over my friend, they barely helped clean up their mess, never replaced his napkin, and didn't replace or give a discount on the soup.\nIt's a pretty space, but under the surface, they are classless.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-17", "description": "Dependable in terms of providing good tasting food time after time.  This place gets a lot of take out orders so keep that in mind if you go during peak dinner times.  Your wait will be that much slower if you come between 6 and 7PM.\n\nEverything we've ordered from here has been good and I can't think of any times we've had a bad experience with service.  It's been a reliable destination in Noe/Mission for chinese food.", "author": "barry a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "\"Good Chinese restaurant\" is a contradiction-in-terms. Not Alice's.\n\nExcellent General Chicken and Garlic Eggplant.\n\nPleasant staff, clean bathroom.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "The food is fast and fresh, a neighborhood favorite of mine.  One of the best items they have is the Alice's combo chow mien and pot sticker.  The only thing I want is more of that great pot sticker sauce they make, fresh green onions, garlic and other stuff but it isn't enough for six pot stickers.", "author": "Loretta M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Very good, very consistent, in service and food.  Family type of dinning, and very reasonably price.  One of my favorite.. Just be reminded its hard to park in the neighborhood but its worth the visit..:-)", "author": "Marnie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "Let me just preface that I was totally prepared to give Alice's a 5 star review, until I came on Yelp and saw their health score... looks like they have some work to do in regards to preparing safe food!\n\nNow as for the food, it was great and has been every time I have been there (probably over 10 times now). I particularly eat a Gluten Free diet and our waitress was very knowledgeable and able to make recommendations and substitutions for me. For the gluten free meals, we ordered the Chow Fun (with white sauce) and String beans and Chicken dry with just some pepper. It was delish! My boyfriend (not gluten free) ordered the walnut shrimp and said they were awesome!\n\nThanks Alice's, but work on that health score. Kinda hesitant to go back till that improves!", "author": "Lindsey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "Great place for lunch- how can you beat under $7 for rice + entree + soup?\n\nTasty, nicely cooked, well presented, but my kung pow was heavy on the salty side...\n\nResembles Eric's quite a lot in looks and menu and price...  so if one's busy, just hop skip and jump to the other.", "author": "Roni L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Love love love this place & the staff!\n\nAfter coming here for years, I've manage to try almost every dish on the menu at least once or twice and let me say, they are very consistent and delicious.  I especially enjoy having the orange prawns, shanghai chicken, and garlic string beans which they have lightly fried then sauteed with garlic. Yum!\n\nThe ladies are awesome and always smiling.  Seems like they never have a bad day. They are friendly and helpful in helping me decide on what to eat most of the time because I can never make up my mind.\n\nThe decor inside is very charming & the crowd never bad.  Another plus is that they actually have a clean restroom!  How many Chinese places have you been in with a clean restroom?", "author": "Soph T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "My friend and I got several dishes to try. We had sweet and sour chicken, chow mein, hot and sour soup, and beef & broccoli. Everything was great but especially the beef & brocolli!!! Mmmmm so good!", "author": "Madison H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "Great food! Eggplant with shrimp and chicken was my favorite. Mango chicken was delightful.", "author": "Kelly J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-06", "description": "Average Chinese American restaurant. It's not bad, but not great either. One negative, I ordered Spicy Basil Chicken and received the mildest dish I've had in a long time.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-16", "description": "I only write yelp reviews for disappointing or great restaurants. Unfortunately my experience last night at Alice's was the later. The two vegetarian dishes were over cook, bland and boring and almost not worth eating. I've head you can occasionally have a good meal but it's hit or miss. With so many great restaurants in SF that's it for me.", "author": "larry R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-17", "description": "The mango chicken is perfect. I also like the mango beef. \n\nLunch here is a major deal. Two can get a full lunch for $15 (including tax and tip!)", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "This is one of the cleanest and best tasting Chinese Restaurant's in the city.  All of their produce is fresh and the meat is a very high quality.  The lunch specials are wonderful.  We really love all their soups.  Especially the Chicken Corn soup.  A must try.  Too bad they don't offer delivery.  We can't decide if they are better than Eric's around the corner or if they are the same.  Highly recommended.", "author": "D.c.g G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "Our go-to favorite in Noe Valley.  The food is consistent and delicious.  They are kid friendly (special plates and cups!) and their service is efficient and pleasant.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-13", "description": "Good food and good prices.  I enjoyed the curry shrimp.  \n\nThe interior decor seemed much too busy with too many knick knacks.  For some reason it got on my nerves.  The wall said ALICE on it inside of the restaurant then all this stuff was all over the letters which were 3d.  Seemed kinda scary like a horror movie.  I am going to subtract one star for that.  It's cool how it says ALICE on the wall, but all the stuff all over it has to go.  Keep it clean looking.\n\nBut anyways, this is a good place for a family meal.  The staff is awesome and friendly.  I will go back for sure.  I would even say it's worth a trip.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "I live about a half a block from Alice's, so I order take out quite a bit.  Their menu is pretty diverse, and they are always on time, and the food is well prepared.  I have never had a problem with their service and the food is consistently delicious.  I would recommend them.  The dinning area is nice, well lit.  The service is very good, and the prices are very reasonable for the quality of food and service.  You won't be disappointed for a nice casual meal.", "author": "Tom W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-08", "description": "Above average food.\nVery take-it or leave-it, typical Chinese service.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-26", "description": "Living in San Francisco, the city is flooded with Chinese food, however, if you're looking for a NICE Chinese restaurant without all the loud conversations and bathrooms that look like port-a-potties, then Alice's is a MUST!\n\nThe service here is excellent. The servers are very nice, always smiling, and they don't rush you to place your order. The food is delicious. There are traditional Chinese dishes, but they also have some with unique twists on classic favorites. \n\nI have to recommend the salmon, and the portobello mushrooms. I get that every time and I still cant seem to get enough. The eggplant dish is also very good, even though I'm not normally a fan of eggplant. \n\nThere is such a \"home\" feel to Alice's. Great for family and friends. \nIt's nice to find a restaurant who still believes in excellent service and delicious food without having to charge an arm and a leg.", "author": "Linh P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-06", "description": "I haven't yet found anything quite like Alice's Shanghai Tofu, so I've been coming here to get it for the past six years. Its fried tofu mixed with fresh seaweed in an incredible sauce. They mix the tofu and the seaweed in front of you at the table so that the seaweed stays crispy and it provides a great compliment to the tofu. Even though Eric's has an essentially identical menu the quality doesn't compare to Alice's in my opinion. We end up walking by Eric's to go to Alice's.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-06", "description": "There are times when we go to Alice's and think this is some of the best Chinese in the city.  Then are times like tonight when we are sorely disappointed with the quality and taste of the food.", "author": "Elizabeth A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-16", "description": "Alices ALWAYS delivers!  \n\nThis is my favorite Chinese restaurant in the city.  I feel they make the best Chineese food in SF.  Kung Pao is my favorite.\n\n It is great for lunch, take out is always quick and the food is HOT!  \n\nI often go here for lunch when I am out and typically in a rush.  It is very comfortable for solo  lunch.  Service is fast!\n\nPrices are great and the service is always quick and polite.\n\nPlus - super clean bathroom!", "author": "Annette M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "I eat here at least 3-4 times a month and have for several years. I find the food is consistently good and the service is as well. Great addition to southern Noe Valley.", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-07", "description": "The walnut prawns are battered and deep fried, not to mention very small. \nPotstickers were doughy and needed more dipping sauce.\nAlice's Spicy Eggplant had a nice sauce, but was just ok.", "author": "ms s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "The lunch specials are so affordable and delicious! You get a cup of Hot & Sour soup to start, which I love. Then your entree served with rice. Everything tastes light and fresh. I always get the mango chicken. The mango is always sweet and compliment the chicken so well. The portions are filling and you get complimentary tea and slices of oranges at the end of your meal, and not forgetting the fortune cookies of course. 3 lunch specials for total of $21, not bad.\nI love the ambiance of the place, the blown vases, orchids by the windows, and cool looking wall divider. The service is always friendly and fast.", "author": "Juliette F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-29", "description": "I can see why this would be a popular neighborhood spot...\n\nThe prices are very reasonable...\n\nI ordered the duck, but found it to be too salty...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "The bang you get for the buck here is awesome! I had Alice's special eggplant dish, which is a modified version of eggplant in spicy garlic sauce. It adds a lot of chicken and shrimp, and is full of flavor. The prices were very reasonable... 9.50 for my dish. They brought out orange slices after the meal to help cleanse your palate, just before the fortune cookies. simple, but nice touch.", "author": "Leo I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-27", "description": "I'm here a lot. Since I often work from home and don't have time to cook dinner nor make a lunch. The food is not too greasy and very delicious. \n\nI would recommend\nMango chicken, \ngeneral tsos,\navocado egg rolls\nany of their soups", "author": "L R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-04", "description": "Standard Chinese.  It's not terrible like some of those buffet places filled with octogenarians stuffing mints and crab rangoon in their  pockets, but it's not unforgettable.\n\nIf you need a fix for regular, above average Chines in Noe, this is your place.  Atmosphere is very open air with high ceilings but quiet and stale, certainly not hip.\n\nGood food, but nothing to write home about.", "author": "Johny X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-28", "description": "This is my favorite place in San Francisco for Chinese food. With all the variety and options this fair city offers, just think what that means...?!?!\nGo for it!", "author": "Hilde L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "I'm sitting at home, as sick as can be and sipping on Seafood Party Soup which I wanted badly enough to walk all 90 feet from my house to Alice's.\n\nMaybe you think I'm crazy, but here's the deal:\n\nAlice's makes some of the best Chinese food South of Chinatown, East of the Sunset and North of San Bruno @ Silver. Ok, so the best Chinese food in the Noe Valley/Glen Park/Bernal/Mission area. \n\nThey're THE BEST Chinese restaurant in Noe Valley (sorry, Henry's Hunan and Eric's lovers). The food is well-priced, not too salty (like Henry's Hunan) and really flavorful (without MSG). The service is fast and friendly, their bathroom is clean and their restaurant is bright and airy and nicely decorated. \n\nJust a note, there's almost never any parking in Noe Valley. but if you must drive (they don't do delivery), try the hill above Valley St (West of Sanchez). There's always parking there but have fun on the 30% incline.", "author": "Elena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-19", "description": "Thanks to the chinese for figuring out tofu and mangoes make a delicious combination. And thanks to Alice's for letting me order the lunch special of the dish a few minutes after lunch hours ended.\n\nWallet and stomach thank you both.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "I received a very nice apology from the owner and a very generous gift certificate from the owner.  We took advantage of the gift certificate and enjoyed a delicious meal.  Alice's is usually consistently good, despite my diatribe.", "author": "Monte C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "A great local place for eating in or take out. The staff is always friendly and the food is always good.", "author": "Marcy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-11", "description": "Oh Alice's what happened to you. For years, Alice's had been my favorite restaurant. I took family and friends there all the time. Also did take out as well. My favorites were Coconut Curry Prawns and Alice's spicy eggplant.  Unfortunately they have been off their game for a while now:( The food doesn't taste as fresh or good - an opinion that my friends who went there regularly with me agree with. And they've messed up on the take out order more than one time. So going to not go there for a while. Hopefully they will bounce back?", "author": "N C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "The wonton soup here is incredible.  For the typical place, wonton soup is some broth and one floppy dumpling. a salty appetizer that doesn't really do anything but warm you up a bit.  NOT HERE.  The small soup is large enough for a meal, full of peas in the pod, huge mushrooms, chicken, shrimp, dumplings and flavor.  I found this place last week and have been back three times.  Get the soup.\n\nOther things I've tried and liked:  crab wontons (crispy pillows of creaminess with a hella sharp mustard sauce or a sweet red sauce), coconut curry prawns (good, but completely out-shined by the wonton soup).", "author": "Beth V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-17", "description": "3.5 stars.  There are a limited number of non-greasy dinner options after 9pm near my gym or home.  I can't eat burritos every night after all.  \n\nSo, we took a scenic drive around Noe Valley looking for this Chinese place that we did not know the name of nor the exact location.  Once we found it, I saw that it was not authentic and that it was not a hole in the wall.  Instead, it looked really clean with a lot of colorful glassware all over the place as decoration.  \n\nWe went with the salmon with asparagus and the portobello mushrooms with tofu since I was in a tofu mood.  Both were tasty and the portions were large so we didn't finish anything.  I wouldn't mind eating here again.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "I have lived across the street for maybe 3 weeks and have already picked up to-go twice and eaten-in the dining room once. Wait time on to-go was 10 minutes. Super fast!\n\nThe Alice's Chow Fun is delightful (I order sans crustaceans) and the Orange Peel Chicken is legit - you can taste the orange in it (unlike Panda Express' Orange Chicken, which is a little candy-like, though still delish in its own right). The special duck dish (i can't remember what it's called!) was super yummy and spicy. All in all, a great sitdown or takeout experience. Oh, and relatively inexpensive.\n\nOne thing to be wary of - we've noticed nearly every dish has an abundance of bell peppers, green and red. If you don't like them, make sure to order without.", "author": "Carissa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "This place is a block from my house, and we like it a lot.  The soups are especially good, and it is never crowded, if you are driving this neighborhood is soooo easy to park in.  I will have to say that Eric's on Church is slightly tastier, but it is a close call.  \n\nI like sitting in the window on a gray day (majority of days are gray in this part of Noe) and eating a giant bowl of sizzling rice or won ton soup. yum.", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "I'm impressed. Food was good. Prices were moderate, Service impeccable, and we'll definitely be back again. Plus I like the neighborhood too.", "author": "Joe V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "I love coming to Alice's.  After all, its named after me!  Well no, not really.  I've been coming here for years.  On the normal order list is:\n\nKung Pao Chicken\nPortobello Mushroom w/ beef\nHot and Sour Soup\nHoney Walnut Prawns\nScallops in Spicy Sauce\n\nAnother plus is that they have brown rice.  Chinese restaurants usually do not offer brown rice in their establishments.  Another plus is they are friendly and super fast!  \n\nI'm craving some now :(", "author": "Alice E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "I went here on a date and was pleasantly surprised. The decor was lovely. Definitely not your generic creepy florescent lit Chinese joint with cheap furniture, fake plants, and a bug zapper in the corner (you know which restaurants I'm talking about!). This place was class with a capital C.\n\nFor dinner we got some sort of combo for appetizers and spicy eggplant and walnut prawns with brown rice for entrees. We also ordered the house wine and were served black tea with our food.\n\nAll of the food was presented beautifully. Very colorful and appetizing. More importantly, it was delicious! Spicy eggplant was superb, or as my date kept saying, \"something special\". Walnut prawns were perfectly cooked and glazed. The tea was good but the house wine wasn't. Luckily I had a cheap date who drank the entire bottle anyway. :P\n\nDon't know how much the bill cost (didn't pay) but I would have been more than happy to pay top dollar for it. Definitely one of my favorite places now.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "This for me is the best Chinese food I ever had! Especially like their \"drums of heaven\". We get take out from this place at least once every couple of months and it is always super yummy!!! I would recommend this place to everyone. Really good.", "author": "Viola M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "Excellent chinese take out - not too salty or greasy which can easily be the problem at chinese food restaurants.\n\nThe restaurant looks cute - definitely will go back and sit inside.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-22", "description": "One of my favorite Chinese restaurants. Very authentic as I go to china often. Fresh and delicious! The potstickers are incredibly yummy!!! Never have a bad meal here. Go and enjoy!!", "author": "Joaquin G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-23", "description": "My boyfriend raved about this place for quite some time so when we were coincidentally in the area he suggested Alice's.  He told me how they've been in business for some time and that him and his family would go there whenever they were in Noe Valley so I expected good quality Chinese food. \n\nWhen we arrived at the restaurant I was impressed on the atmosphere and how they used mirrors and lamps to make comfortable lighting(we were there for dinner).  The dinning area was pretty small, so small that the person sitting behind me, I could feel their elbow hitting my back from time to time.  \n\nThe water and hot tea was complimentary but the water was difficult to refills because the waiters were often wondering about.  While I was trying to order food I had a general question on what was in a certain dish that I was not familiar with.  I guess he didn't understand what I was saying, or that he was trying to rush me into making my order that he spoke way too fast for me to even understand.  \n\nThe food was okay; I've had better.  Maybe my standards were too high since I've been predisposed to Asian cuisine; I was hoping for something that would fill me up as well as fix my hunger for Chinese.  But the food was.... eh.", "author": "Lea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-21", "description": "I believe I have solved the greatest mystery in San Francisco restaurant lore:  What is the mysterious relationship between Erik's, Alice's, and the two Eliza's?\n\nI believe it is a tragedy of operatic themes.  Here's my theory:\n\nErik's was married to Eliza's in Potrero Hill.  Theirs was a happy marriage and one day they brought forth a daughter, Alice's.  \n\nLike most children, Alice's shared many traits with each of her parents.  Like her mother, Eliza's, she has her name constructed into her right wall as viewed from the street, displays some Matisse reproductions and various artistic nick-nack displays, and most of the time is as charming and kind to visitors as Eliza's Potrero Hill.  \n\nAlice's food is more like her father Erik's--not quite as good as Eliza's--and at times her temper can be sharp, like when guests ask if she is affiliated with either of the other places.  Like Erik's, her parking is tough and her soup is bland.\n\nLike all operatic family dramas, of course, tragedy lurks in the second act.\n\nSomewhere along the way, Eliza developed multiple personality syndrome.  She literally become two Eliza's--one on Potrero Hill, the sunny, friendly, charming, welcoming Eliza's with the beautiful carved dragons and the perfect pot-stickers; and one in Laurel Heights, with the snarky, humorless waitstaff, rushed service, and indifferent attention to detail in the cooking.\n\nErik's heart was broken by the split, and sadly he could no longer keep up with two very different personalities in the two Eliza's.  So he refuses to say he has anything to do with them, even so far as to deny knowing about them.  \n\nAnd so what of poor Alice's?  Confused and torn between the two, she must follow Erik's lead and pretend not to know about her crazy mother.  But she pays homage in her own way, as a good daughter would, by refusing to toe the line her father sets and occasionally showing a wink of friendliness to the strangers who come to her tables.  And her potstickers take more after mama than papa.\n\nYes, it's all there--the striking family resemblance in all four menus, the similar interiors, the overall level of food quality, the virulent reaction when you ask if they're in a family.\n\nThe kicker, though, is when you prepare to write a review on Yelp for Alice's, and you click the Write Review button.  Yelp's software says, \"Do you mean Eric's Restaurant?\"\n\nIf the software can't tell them apart, how can we patrons be expected to?", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-18", "description": "Roaches... We were going here for years but the last few times we have had sub-par food. Either overcooked or too sweet. \n\nThey have great brown rice but we got a surprise visitor in the fried rice. It was a huge stripped cockroach. A beautiful specimen if you were looking for one to frame in a glass frame but not something you want to confront inches from your lips.\n\nI am sad. I love the food here but my wife and I are not going to be able to eat fried rice for a long time. If it was any other place we would swear not to eat anywhere else but Alice's but it was our favorite place. \n\nBye Alice's. Bye for now, hope you sort out the roach issue soon.", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-02", "description": "Okay, slightly annoyed with all the jabs at this place being for non-Chinese. I'm Chinese and I eat here! I think the better description is from the person who called the place \"Chinese American\" because they do in fact employ many fine Chinese cooking techniques to their dishes -- it just tastes a bit sweeter than probably it normally would in China. \n\nOur favorites are the pot stickers (chewy outside and savory insides with just enough crisp), orange beef (seriously, Chinese people really eat this!), mango chicken, green beans... mmmm, getting hungry. \n\nAlso, like others have said, this is a very family-friendly spot -- very fast service so you're in and out in no time. And their take-out holds up very well. It's one of our regular places for a quick meal.\n\nAnd by the way, we think Alice's is better than Eric's.", "author": "L. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-08", "description": "I've been coming here for a while and it seems to me that it has been going down hill for a while.  The quality of food has become worse and worse.  Now, so has the service.  \n\nWhen I ordered my meal I asked if the wonton soup had any seafood in it because my wife is allergic.   I was told there was no seafood in it.  Only pork and vegetables.  When I get home my wife takes a sip of the soup and quickly starts to break out.  I guess they didn't realize shrimp is considered seafood.  \n\nI called and they did return my money.  But they refused to take responsibility.  The manager said her employee informed me of the shrimp, even though I explained to her that he hadn't.  \n\nThis along with the crappy meal I got was the final straw.  I don't recommend this place to anyone.  Bad food!  Bad service!\n\nIf you're in Noe Valley I recommend Henry's Hunan on Church and 29th.", "author": "Vicente d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "Prologue: Scrumpdili-iscious\n\nThe Do's and Don't's of eating at Alice's:\n\nDO\n- Order the (small) sizzling rice soup--enough for 2 to share\n- Order the salmon and asparagus\n- Order the orange chicken or the black bean and shrimp\n- Eat here for lunch--great deal\n- Get waited on by the tall, thin waiter--he's great\n- Order take out and start the car--it'll be ready in 10 minutes\n\nDON'T\n- Get spoiled\n\nEpilogue: This place is one of the best Chinese in the City.  As good as Eliza's;  and a hair (ewww, hair!) better than Eric's and Ton Kiang.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-25", "description": "Alice's, we know you're related to Eliza's and Eric's. Stop denying it.\n\nThat said, Alice's is my favorite family member. I'm a sucker for the Wedgwood dinnerware and the orchids. Because I am white and was born hardwired with a weakness for imperialist decor. \n\nAnd, as far as white-people Chinese food goes, the Shanghai chicken with the toasted seaweed and the pinenuts is pretty fucking great. The rest of it can be inconsistent and starchy, but on a good day, sweet and sour chicken is not too breaded with fresh pepper chunks.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-09", "description": "I ordered food to go from this place last night. We ordered egg rolls, crab meat rangoon, chicken chow mein,  general  chows chicken.  \n\nPerhaps have I turned into a chinese food snob? When did this hybrid, non-spicy food come about?  I bit into what i thought was a fried wong tong and it was surpisingly cream filled with crab and onions-- is this the new asian fusion? fusioned with what? cream? i was sadly disappointed.", "author": "linda l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-23", "description": "I am always surprised at the foodies i know that have yet to eat here. It's asian-fushion, which is to say if you're looking for authentic, go somewhere else. This is more like an upscale thai restaurant took on chinese flavors. I especially recommend if you're someone thinks they don't like chinese that much, or if you're tired of being disapointed by chinese places.\n\nThings to try: Mongolian beef (something i usually find too greasy and meat too tough at your average chinese take out place- this one has a sweet sauce and comes over a bed of crispy noodles), spicy eggplant, mango chicken.", "author": "Sasha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-07", "description": "I agree with Tina S. that Alice's food always tastes fresh and clean.  Personally, I prefer the atmosphere of Eric's around the corner, but Alice's food is just top notch.  The shrimp they use in their dishes is always fresh tasting, and the chicken doesn't have a lot of fat in it.  Their sizzling rice soup is exquisite and never oily.  The vegetables are always perfectly cooked.  \n\nMy only complaint is that sometimes the dining room is like a freezer!  What is it about SF restaurants and not turning on the heater?  I would love to dine there one day without wearing a jacket.", "author": "ML P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-20", "description": "I take all of my non-Asian friends to this Chinese restaurant in Noe Valley.  Like most non-Asians, I love the food here.  For those of you who claim it's not real chinese food, fine - call me a banana if you want.  I've been called that many times before (over 10,000 times at last count).\n\nFood:  5 stars.   The food is innovative and delicious - you typically won't see salmon with asparagus or anything with chicken with pinenuts served at normal Chinese restaurants in the Bay Area.  Try the house specials, they're delicious.\n\nService:  4 stars.  That's pretty darn good for a Chinese restaurant.  They're always super friendly, attentive, and appreciative of their customers.\n\nAtmosphere:  3 stars.  It looks like what a Chinese restaurant would look like, except it's cleaner.\n\nHits:  Fried crab meat rangoon, wonton soup, china prawns, asparagus salmon, sesame chicken, star chicken\n\nMisses:  I haven't really found any yet.  The prices are slightly more expensive than what you would find at other Chinese restaurants.\n\nIf You Like This Place, You'd Probably Like:  Eric's, Eliza's", "author": "Keith C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-20", "description": "I LOOOOVVVVEEEEE me some Chinese food!!!!\nI LLLOOOVVVVEEEEEE me some Thai food!!\n\nI do not love Chinese food that tastes like a Thai chef cooked it!!\n\nIt's been a few years since I've been here, and it seems to have turned into a Thai/Chinese fusion of sorts...and not in a good way.\n\nWe ordered lunch and got a Curry Shrimp special that tasted and smelled like Thai food. The Chow Fun had large basil leaves and had a hint of peanut flavor, not the MSG we all know and love! The portabella Beef is just ok.\n\nWe did have an appetizer of little drumsticks that were fried and damn it they were good!!\n\nI would be interested to try this place again at night and see if the food is any different, but like I said, when I want Chinese food, I want Chinese!!!", "author": "JR H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-16", "description": "This place has almost all of the same awesome dishes as Eric's (and some Eric's doesn't have), with little of the wait or parking problems. One stand-out that you can't get at Eric's is the Sunflower Beef, where the sunflower petals are composed of tiny enoki mushrooms.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-11", "description": "Alice's.  A recent discovery thanks to my fellow Yelpers.  As a White Person, I wanted to know where I can go to have Chinese food for White People.....  Anywaz, enuf with the misplaced sarcasm and on with the review:\n\nMy bf and I've been there twice now and both times we've had wonderful, spicy, well-prepared food.  The won-ton soup had lots of fresh veggies, shrimp, and chicken (all swimming with the won-tons).  A meal in itself!  The spicy eggplant, tofu and green beans, and sesame chicken are all great!  They have avocado rolls too (just like Eric's)!\n\nAnd, it is so much nicer, quieter, cleaner, calmer, warmer than Eric's.  Sorry dear Eric.  I know there is this sibling rivalry.\n\n1/07: UPDATE:  I'm afraid in the Alice's vs Eric's rivalry... lately Alice's has been slipping up.  Our last meal here was so so, while our recent trip to Eric's was amazing and tasty.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-24", "description": "Excellent food with reasonable prices.  This is now my go-to place for Chinese.\n\nMake no mistake:  Alice's is without a doubt  the twin restaurant to Eric's no matter how much they deny the relation.  Consider the following facts:  \n1)  Virtually the same interior design\n2)  The same menu design\n3)  The food taste is identical\n\nThe only difference is that the wait staff is a lot more laid back and allow you to enjoy your meal instead of concentrating on rushing you through (probably because there aren't a million people waiting to be seated).  I love this place so much that I almost hate to Yelp about it for fear of it becoming too busy.", "author": "Peter Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-06", "description": "Talk about horrible service!!!! My mother and some of her nanny coworkers decided to go eat lunch at this restaurant, after great reviews from the other nannies in the area. Since she walked into the restaurant, the service was horrible and they were discriminating based on her \"lack of English\". This is the most disgusting service I could ever imagine happening in this century!! Welcome to San Francisco where if you can't speak the \"appropriate\" amount of English you'll get treated like shit, yet the manager can't seem to speak English so smoothly himself.", "author": "karen p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "I like Chinese food, but interestingly enough, I don't eat it all too often.\n\nHowever, when I do eat Chinese, Alice's is my place.  For starters, I never leave the place feeling like I just ate crumby Chinese food.  [You know what I'm talking about.  That whole, \"ugh, my stomach hates me for what I just put in my mouth\" kindof feeling.]\n\nUh uh, Alice's does Chinese food right, but in a light modern kindof way.  I really enjoy the Hoisin string beans and the Crab Rangoon.  Additionally, the Coconut Curry Prawns here are delicious.\n\nCome out to Alice's in the Misson/Noe Valley cusp and you won't be disappointed.  ;-)", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "Great Chinese food! Living across the street from Alice's was definitely dangerous! My sister and I ate here a few times a week... or more! The food fresh tasting and not greasy like most Chinese places that I have been to. The egg drop soup is one of my favorites but everything I have had there has been so good. I have taken many friends and family members here and everyone has always loved it.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "What I like most about Alice's is likely the fact that it is 17 steps from my front door.  From placing a to-go order to actually eating it is only a 10 minute process.  \n\nThat being said, we obviously eat here a lot and have found that Alice's is all about knowing what to order.  We have now boiled the menu down to a list of our faves:\n\n* Chicken Fried Rice (not that greasy, or even brown really.  More like white rice with peas and chicken in it.  nice side to share.  also makes great leftovers)\n* Kung Pao Chicken (if you want spicy, specify, b/c it is pretty mild as is)\n* String Bean Beef\n* Cashew Chicken\n* Orange Chicken", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-30", "description": "I've been to Eric's and Eliza's millions of times but tonight I set my foot into Alice's for the first time.  I didn't feel quite the same excitement going in here as I normally do going into Eric's or Eliza's.    It's partly due to its random location on a very quiet and dark residential section of Sanchez.  The bad fluorescent lighting also makes everything look a bit dusty.  That said, kudos to any Chinese restaurant that takes design inspiration from Chihuly the glassblower.  \n\nThe food is just about as good/average as the Eric's and Eliza's.  My partner Chris loves the Walnut Prawn dish he usually orders at the other sister restaurants and it's equally acceptable here.  The Walnut Prawns epitomizes what's  so un-Chinese about this place--battered shrimp tossed with mayo and glazed walnuts sitting in a bowl made of flash fried noodles.  As an Asian I wouldn't be caught ordering a dish so egregiously \"white\", but Chris is a white farm boy from Minnesota so I let it pass.  \n\nI had the Mongolian Beef, which surprised me because it was missing the usual spicy strands of green onion and red peppers.  It was sitting on top of these white, crispy fried noodles, which I think was originally intended to add bulk and serve as decoration for the dish, but the noodles absorbed the yummy brown sauce and provided a nice contrast to the soft strips of beef.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "Went to lunch here recently. Very well priced lunch selection come with soup & rice. Delicious hot & sour soup ! really must rave about soup and Hunan fish entree...fresh, well sized portion and lovely decor. I'm a fan", "author": "Jas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-02", "description": "Food at Alice's is not your typical MSG filled Chinese food. It's the same as Eric's on Church, but it's always less busy (they deny this fact for some reason tho - but, take at takeout menu and compare to Erics!).\n\nMy only problem is that the food is less spicy than I typically like my Chinese food. But, other wise, this place is pretty good. And, if you want soups, I really think they do an awesome job with all of the ones that I've tried.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-30", "description": "Average, but not bad, Chinese food. Definitely several steps above hot-plate.  It's your typical American-Chinese place.  \n\nAs many people have commented, Alice's is more or less a clone of Erik's down the street.  If you want a quieter meal, Alice's in the place to do.  \n\nSome people have said the service at Erik's is unfriendly.  I don't think it's that so much as Erik's is usually a lot busier.  The food, however, is almost identical, so you should decide based on parking and whether you want a louder or quiter meal.", "author": "Tullia F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-02-13", "description": "You can have anything you want at Alice's restaurant... provided that you want un-fresh, un-tasty, un-spicy, uninspired food.\r\n\r\nWas I in an alternate Alice's than the rest of you?\r\n\r\nThis place was bad. I mean BAD. I mean \"we didn't eat enough food to get full because the food was inedibly bad\"-bad. The mapo tofu was bland (this is rated spicy on the menu?) and the tofu was like cardboard. The potsticker wrappers were thick and gummy, the crispy side was somehow burnt and soggy at the same time (hm, reheated?), and the chicken in the General Tso's tasted distinctly freezer-burned. Even the rice was soggy and sad. They boxed up our leftovers without our asking, and we dumped them into a neighbor's trash on the way home. Yuck.\r\n\r\nEric's isn't good, but at least it will do in a pinch if you don't want anything authentic or interesting. This isn't even that good.\r\n\r\nThe decor is nice, though it seems caibrated to impress the sort of diner who would say \"Oh, this place is NICE. I hate dirty restaurants... This one is so clean! And I hate walking through the kitchen to use the bathroom...\"", "author": "anita c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "I live literally right beside Alice's and while it is kind of americanized for chinese food it is downright delicious!  I love all their vegetarian options and the people who work there are very friendly.  I hardly ever eat-in, for the most part I order for pickup, and unlike most places their to-go portions are just as large as their eat-in portions and that is one of the things I love about this place.  My favorites there are their vegetarian fried rice (I always ask for it with no egg!), the vegetarian hot and sour soup, the sauteed green beans, or the green salad with tofu!  I have never had anything from there I didn't like, so if you haven't been there you should definitely check it out!", "author": "Morgan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "I have been going to Alice's forever, the taste, prep, quality, and service has never really changed... The lunch specials are a great way to go, and you get a good amount of food for the price.  But as far as quality chinese in the Noe Valley-Glen Park area goes, this place has been a stand-by of mine for a long time.  \n\nMy fave dishes include: Shrimp with Snow Peas entree, their Sizzling ice Soup, and the Smoked Pork.  YUM!!!!!", "author": "Miss F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "This place had really good food, except for the flavorless vegetable soup to kick-off my lunch special.  But that's nothing that a little soy sauce can't fix!  We had the orange-peel chicken and the sweet and sour rock cod.  They were both very flavorful, sweet AND SPICY.  Loved them both.  Nice atmosphere, super-friendly service, very neighborhoody feel.  Prices were very competitive.  But the real reason I am writing this review is so I can ask what the hell are those things displayed on the wall?  http://www.yelp.com/biz_photos/g4vf4bYFhvSmkWZn3DMt-g?select=xKlfnf74M0w55nxge8rUcg", "author": "Tim A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "Something happened in my life recently where I have become intolerant of food with too much starch, grease, or too much of too much. I call it the fresh-yummy-SF-food effect. Or to be painstakingly honest with you, it's the IBS effect. \n\nI don't just get guilt about eating bad food, I double over and try to dial my mom's number on my cell phone. Naturally, I have learned to steer away from greasy Chinese. Both the mysteriously prepared authentic Chinatown version and the generic Mc-Chinese version. I have mostly not missed it, save for Chow Mein, the worst offender of my intestines.\n\nBut Alice's--she's different. She cares about me. She gives me fresh, spicy Chinese with veggies that snap! in your mouth and don't leave you praying to a neglected God for relief. \n\nAlice, baby, please open in my neighborhood.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-15", "description": "My friend and I got extremely sick after eating Mango Chicken from here..\n\nLooks like we weren't the only ones, I am filing a complaint with the health department\n\nWe spent 20 dollars just for one dish and one appetizer and our reward was getting food poisoning\n\nHere is a copy of a recent health report that they received a very poor score on:\n\nScore Violation type Degree of risk Date discovered Date abated Description\n64 061 (CFR) VERMIN - Rodents/Roaches/Flies Low Risk 19-AUG-11 29-AUG-11 Food\n  054 (CFR) Floors, Walls, Ceilings Improperly constructed, in disrepair, not clean Low Risk 19-AUG-11 29-AUG-11 Food\n  049 (CFR) Wiping Cloths not clean/inadequate sanitizer turbid/not properly stored Low Risk 19-AUG-11 29-AUG-11 Food\n  042 (CFR) Non Food Contact Surface Unclean Low Risk 19-AUG-11 29-AUG-11 Food\n  039 (CFR) Improper Food Storage/Improper Container ID Low Risk 19-AUG-11 29-AUG-11 Food\n  033 (CFR) Foods not separated or protected Moderate Risk 19-AUG-11 29-AUG-11 Food\n  019 (CFR) Inadequate/Inaccessible handwashing facilities & supplies Moderate Risk 19-AUG-11 29-AUG-11 Food\n  016 (CFR) Lack of Food safety knowledge: no food safety certification Moderate Risk 19-AUG-11 29-AUG-11 Food\n  009 (CFR) Food Contact surfaces not clean/sanitized High Risk 19-AUG-11 29-AUG-11 Food\n  002 (CFR) Hands not clean/improperly washed/gloves improperly used High Risk 19-AUG-11 29-AUG-11 Food", "author": "Juanita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "We eat at Alice's often. The restaurant is very clean. The staff is always courteous and helpful. And the food is consistently delicious. We enjoy the sizzling rice soup - chocked full of fresh vegetables. The walnut prawns, the pot stickers and crab rangoon are our favorites. Alice's fried rice selections are cooked to perfection. Light, fluffy and perfectly balanced. \nThis is a wonderful little neighborhood restaurant with very comfortable decor. We have never been disappointed.", "author": "Cody L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-30", "description": "Reliable, quality chinese food.  Good for take out! \r\n\r\nThumbs UP: Menu similar to Eric's on Church but no relation ( I dont belive it ),  fresh ingredients and consistant quality \r\nThumbs DOWN: Staff could be a little friendlier.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-04", "description": "I finally have a \"go-to\" Chinese restaurant in San Francisco.  I've been back  to Alice's several times now after a friend told me about it, and I've thoroughly enjoyed every dish I've tried so far.\n\nWill-not-let-you-down dishes:\n+Avocado egg rolls\n+Veggie rolls\n+Mongolian beef\n+Spicy beef with garlic sauce\n+Alice's spicy chicken\n+Veggie mu shu\n\nService is also great...not too much attention, not too little attention either.", "author": "Pete S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-21", "description": "Normally I'd pass this place off as a typical, boring SF Chinese restaurant.  It really doesn't come across as anything worth writing home about, and the menu is nothing spectacular.\n\nHowever, one bite of their Shanghai Chicken and I was mesmerized.  Juicy glazed chicken served with crispy seaweed \"noodles\"?  Awesome.\n\nThe crab rangoon had a little too much cream cheese and not enough crab, and the ma po tofu was a little on the weak side.  I don't really like mushrooms in my ma po tofu, just tofu, pork and sauce.\n\nThat said, this place is right across the street from our place and I cannot wait to get the chicken again.", "author": "Tim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "Best chinese food in the Bay area.  Clean and good service.. My favorite place...", "author": "Allan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "I went here with friends because it was close. Good food. Not a destination restaurant. An average, clean, friendly Chinese joint with a name that made me think \"Hey, can I really get anything I want?\" Seriously, though. What's up with the names of Chinese restaurants along/near Church street?", "author": "David Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-11", "description": "Food is above average.  But the great price, service, speed and clean environment launches Alice's to 5-star status in my book.  Ingredients always taste fresh.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-06", "description": "Consistently better then Eric's.  Great food, cleaner, fresher tasting, well priced, good service, can always find parking.  There is never a wait for a table.  Great find in Noe Valley!", "author": "Craig A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "Great pot stickers.  Super Sexy Hoisin String Beans.  Made my night!  Will go back for sure. \n\nIf you eat here you will not be disappointed!", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-27", "description": "I used to eat here often, many years ago and the food was good as was the service.  More recently my mother and I popped in for some lunch.  The place was 3/4 full, we quickly found our own table, sat down and were ready to order.  We sat for about 15 minutes.....finally a woman came over and asked (more like yelled) (and I quote) \"WHAT YOU WANT??\".  I guess this was her attempt at taking the order... My mother began to ask a question about the mixed vegetable plate on the lunch special, what type of vegetables did it have..she started to explain she has a heart prob..She was promply cut off by (and I quote)\"BECHTABO, BECHTABO, IT SAY MIX BEVETABO\", followed by eyes rolling.  Now she is practically yelling at my mother who is trying to explain that she cannot eat brocolli per doctors order.  At this point I step and and it wasn't pretty.  I cut her off and pointed out that she was being completely rude, I told her we wouldn't be eating here because she was soooo F*&king rude.  Suddenly she changed her tone to \"Oh, what kind bechtabo you wan?\" \"Any kind okay, we can do, we can do\".  Too late lady.  \n\nAs I said earlier I've been here many times in the past, the service was fine, the food was good, the prices were very good.  BUT, I don't need to put down good money to be treated like crap by some bitter hag.  If you are in the mood to be treated like crap then by all means check it out.  If not then go to Eric only a few blocks away with the exact same decor and menu...WTF??", "author": "Wendy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "This is a perfect place for a lunch.  The room is open and light, the decor pleasant in an unforced way, and the service quick and efficient.  We had some succulent, crispy pot stickers, to-die-for avocado spring rolls, fried rice, and, in a moment of nostalgia, General Tso's chicken.  Everything was flavorful, fresh, and precisely cooked.  We haven't been there for dinner, but have enjoyed several lunches and look forward to more.", "author": "Bruce A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "I LOVE Alice's.  Their Mango Chicken is my favorite!!!!  Service is good and I've never had to wait for a table.  I've never had a bad meal here and everything is fresh and cooked just the way it should be.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-08", "description": "My husband and I are thinking that Yelp steered us wrong for a change.Tonight we got a shrimp curry and the shrimps were mealy, tasted as though they were frozen. I've got a icky feel from having eaten that one shrimp. Never had such a disgusting shrimp. Ewww. The Mu Shu lacked flavor.  Cannot recommend. Avoid. Nothing redeeming.", "author": "BETH T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-18", "description": "Pretty good chinese food in a nice atmosphere. There are a couple of places that the food is a little better- but lets face it- I dont necessarily want to sit down and have dinner in them.\n\nThe orange chicken has good flavor, but its a bit dry.\nAsparagus yummy, chicken chow mien excellent, kung pao dishes spicy and the helpings are generous.\n\nThe price point is good and your food is ready fast!", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-21", "description": "Nothing like being Yelp reviewer #58, eh?   \n\nAlice's is what I consider \"safe\" Chinese food.  It's where you take your relatives from out of town, or friends who don't want to be particularly adventuresome in Chinese food.  \n\nHaving said that, the Shanghai chicken with chopped up seaweed and pine nuts if very tasty.   The orange beef was as well if a bit overcooked, making the beef strips more like beef jerky.\n\nService was attentive which hasn't always been the case when I've eaten there before.\n\nThe collection of art glass is fun to look at while you wait for your dishes to be served.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "We went here for lunch the other day...\n\nThey have a lot of specials.. all very affordable... 6 bucks and it includes soup...\n\nThe restaurant is clean... bright... Our waiter was really nice... \n\nThe parking is a real problem if you go at night... It can be depressing...\n\nWe will go back...", "author": "Joe B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-19", "description": "Alice's has taken a downhill turn over the past couple years.  We used to order take out all the time and totally enjoy it (but didn't enjoy Alice's scowls and moodiness when we picked up our food).  As for dining in, the service has always been really impersonal and borderline rude.  \r\n\r\nThe last couple times we've ordered, the food has been seriously greasy, over-sauced, and unpleasant.  I swear, I feared that I would wake up with a full face of acne due to the grease factor. What happened, Alice?!", "author": "Abby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-08", "description": "If you're looking for Chinese food that delivers solid dishes every time without the hustle & bustle of Eric's then Alice's is the place for you. I've been there about a dozen times and I always walk away with a smile on my face. \n\nAlice's spicy eggplant is incredible. Its wedges of eggplant served with a bunch of shrimp & chicken in an amazing spicy sauce. The flavors are so spot on we can't go here without ordering it. Its one of those dishes that just talking about it anytime, day or night, makes you want to go eat it... MMmmm. Spicy Eggplant...\n\nI'm a big egg roll snob and to be honest the first time I tried them here I wasn't very impressed, but they grow on you. The crispiness & veggies are all great but they put cinnamon in them so that really took some getting used to. I wouldn't order them particularly but they come with the combo platter which is a great way to start.\n\nThe walnut prawns are sinfully good too, I'm sure they're completely unhealthy and probably take days off your life but its worth it for those crispy sweet little buggers.\n\nI've tried a bunch of other dishes and they all range from decent to fantastic. Some of the more interesting flavor combo's (Orange Beef?) don't quite tango with my flavor pallet but I've discussed with others who go nuts.\n\nEveryone thinks Alice's is Eric's is Aliza's but they've all got their own variations and are all worth visiting - the plus with Alice's is that you also save a buck or five.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-19", "description": "Good food. Friendly and fast. Something eerily similar to Eric's around the corner and a few blocks down, but somehow it tastes better.  I have only ever eaten take-out, so I have little to say about the service other than that they are fast and have yet to screw up an order.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-17", "description": "Yes, I also think that Eric's and Eliza's and Alice's are all the same scene. They have the same food and the same flatware... Anyway, I like Alice's best as its a restaurant where there shouldn't be a restaurant. Its in the middle of a sleepy Noe neighborhood and has nicer staff. \n\nThat said, food is OK. Its typical and tasty.", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "Always tasty, and very rarely so crowded that you have a long wait.  Alice's is every bit as good as Eric's, with less difficult parking and friendlier staff.", "author": "Linda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-27", "description": "The best Chinese restaurant I've ever been to, and I've been to lots. No one can match their Orange Beef or Orange Chicken -- it's unparalleled. Everyone else's Orange Chicken/Beef = just can't hold a candle. It's like meat candy. I can't crow about it enough. I'm craving it just writing this!\n\nAlso love the Shanghai Chicken -- delicious, different, more-ish, savory, nutty. My husband gets the King Salmon with Garlic Sauce, which is heavenly delicious. The Alice's Cakes are scrumptiously decadent. Even just their Chicken with Mixed Vegetables is a step above.\n\nAlways consistently good, every time.", "author": "Brooke H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "this is always my go to neighborhood Chinese spot.  always good.  always has a friendly staff.  love it.", "author": "Helpful S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-27", "description": "I used to live on the same block as Alice's and so I had either their mango chicken or walnut prawns every week. It's very clean and pretty and their take-out service is quick. The parking and the wait are better than Eric's since it's not right on Church St.", "author": "Liz O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "This is my favorite place for Chinese in San Francisco (and, yep, it's in Noe Valley!)  The food is always cooked just right and served hot.  On this trip there was a private party for 40 there.  I was concerned that the kitchen wouldn't be able to \"keep up\" with all of the goings on, but I was wrong.  Our appetizers (Potstickers) came right out.  As soon as we finished them our main dishes (Moshu pork, General Tso's chicken and the house combination rice) came out just as fresh and hot as usual.  Well done!  Will be back next trip.", "author": "Dave E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-14", "description": "Went in early...600pm.  Less than half of the tables were occupied. We ordered three dishes plus rice.  The first one took 45 minutes. After we finished it we sat for another 30 minutes and then they came to clear off the table.  Uh, still waiting for two more dishes. Another 20 minutes and here they come and were plopped on the table.  \n\nI've eaten here once before and the food this time was tasteless, unlike the first time.\n\nNever any refills of beer or water offered. Had to ask for the check and again plopped on the table. No apology, no thank you, nothing.\n\nIt was obvious that they were short handed, only two wait persons. It is Valentine's Day...which common sense tells you it will most likely be busy, but at least apologize for service failures...and a thank you is not asking too much.\n\nTotal dining time for 2 people:  2 hours and 10 minutes.\n\nI will NEVER eat here again.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-28", "description": "I went with 3 other people and everyone liked their food a lot.  We had two different prawn dishes, chicken, and vegetarian.  The servers were very nice and the atmosphere was relaxed.", "author": "Lily B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-21", "description": "Service: 3.5/5\nFood: 3.5/5\nWait: 4/5\nPrice: $\nPresentation of food: 3/5\nPresentation of restaurant: 4/5\nOverall: 3.5/5\n\nThee boyfriend and I came here last night to try this place out because we we're feeling Chinese. We arrived around 9:40ish pm and didn't realize they we're about to close because the OPEN sign was still lit, we walked in and the waitress warned us ahead of time if we can order a little quicker because Kitchen is closing. I'm surprised they still took our order, so that was really nice of them. We hurried and ordered their Alice Fried Rice, Alice Chow Mein, and Beef w/ Broccoli. The Fried Rice wasn't really what I prefer, the way they cooked it was WITHOUT Soy Sauce, so they use either Salt or MSG instead. I feel weird eating Fried Rice w/o Soysauce, and i didnt wanna add soysauce myself because the dish was salty enough. My Chowmein was good, except that there was a lot of stuff on there, kind of overwhelming. But i did love how the noodles are the thick noodles i liked and the sauce was good, just a little too much sauce for me personally. The Beef w/ Broccoli wasn't too bad, except we didn't order any White Rice with it cuz we had Fried Rice; so if you order this, be sure to order white rice NOT FRIED rice. lol.", "author": "Eva H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-12", "description": "We really enjoyed the mango chicken and spicy eggplant dishes after reading tips from other Yelpers. Service was speedy and I like how they leave a ceramic pot of tea at your table. Will definitely return!", "author": "Justin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-30", "description": "As a 15 year Noe Valley resident, this is the best  and ONLY Chinese take-out (or sit-down) that I even consider!  \n\nWhen my family visits from out-of-town, they INSIST upon Alice's.\n\nFavorites:  The seafood medley, orange-peel beef, and of course, the (decadent) walnut prawns!  Oh, and don't forget \"Alice's: special fried rice\"...yumm...", "author": "hugh c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-13", "description": "It's a toss-up between Eric's and Alice's. However I do feel that it's easier to get in and out at Alice's. Overall their fried crab ragoons are amazing. Great for take-out if in the area.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "Terrific lunch specials. I had the garlic chicken special, which included hot tea, rice, and soup. The meal was only around $7.00, and the service was excellent!", "author": "Kurt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-30", "description": "The closest restaurant to my house also makes some damn fine Chinese food.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "With Firefly and Shanghai 1930 closed, we just played a bet and went. Off the hook good. The shrimp were so good, I ate the whole order. The fried rice had some nice veggies in it, served very fresh and hot. And the rest of the food on the table - mu shu, Orange Chicken, etc.. were all amazing. Well worth a 30 minute drive into the city. Next time I want to leave room for Michele's Ice Cream, but the food was so good, I didn't want to waste it.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-24", "description": "Great Chinese food at a great price. Can't ask for much else. Place is low-key enough to bring the kids without any issues which is a plus for me.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-26", "description": "It was just \"fine\" Chinese food. Nothing spectacular, but nothing terrible. We ordered beef with broccoli (decent, though not the best pieces of beef), chicken chow mein, moo shoo chicken (good), and hot & sour soup (probably the best thing we ordered).", "author": "Sally M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-12", "description": "After two years of frequenting Eric's, I decided today to see what all the VS is about. I popped in for their lunch special and pretty much found it to be very similar.  The service might have been slightly friendlier and it was a tad bit less crazy in there.  I think I might switch it up now and start coming here instead, see how it goes.  My alligence is to neither/both.", "author": "e w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-27", "description": "I only give it  a one star because very recently I noticed a large cockroach on a table in the restaurant.\n\nBeen eating hear for years and never saw this problem, but I feel if there is one in the restaurant then there must be more near the food source which is the kitchen.\n\nI hope the owner reads this review and brings in a professional to rid the restaurant of the pest problem.\n\nNice staff and good food. Too bad about the problem.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-03", "description": "Decent, quick and cheap. Nothing spectacular, but good and I expected that going in.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-23", "description": "This is one of our go-to places for a quick mid-week dinner with the kids.  I wouldn't necessarily call it authentic Chinese food but I mean that in a good way.  It's not too greasy and I don't get an MSG headache after I eat there.  The service is fast and the food is always fresh and cooked to perfection.  We have frequented Alice's for the past 12 years and have never had a bad experience.", "author": "Julie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-10", "description": "I love Alice's. Their food is absolutely delicious. Typical Chinese food always has something in it that I'm kinda like... what did I just put in my mouth? Was that chicken or a hunk of fat? Alice's is not like that. Their meat is trimmed and cooked to perfection! If you want good Chinese food... go here!", "author": "Meghan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-22", "description": "Alice's is distantly related to Eric's, probably some big family drama...not sure about Eliza's.  The big difference is that I have never seen Eric's or Eliza's place rice back into the big pot after it's been on the table.  At another visit, I accidentally bit into a big piece of MSG (didn't even know it came in solid form).  I see these two incidences as isolated, as this place is always pretty full and I can't imagine that people would be back if they regularly bit into MSG or saw rice being put back into the big serving pot.  But for me it will be Eric's from now on; their staff is way nicer and food is similar, but better.", "author": "Lulu H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-25", "description": "Good if you want Chinese without MSG and healthy options like brown rice.  I doubt the food is very authentic, but it's consistently good.  They're friendlier at this location than Eliza's (Potrero Hill), and the presentation and cooking is inferior.  Eliza's cooking is more refined, but I still don't go there as much (less convenient location for me, and grumpy or apathetic wait staff).  One of the waiters is so sweet and shy, I have to tip extra when I'm there (even for takeout).  Alice's Spicy Eggplant is a don't miss dish and Mango Beef can be fun.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-30", "description": "The food is ok but pricey. It seems better if you eat there versus take-out. That is probably because after you've fought for 40 minutes looking for parking, you're hungry and need some sustenance before the 20-mile hike back to your car.", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-28", "description": "I happen to think the food at Alice's is pretty darn tasty.  They have some of the best pot stickers I've tasted anywhere in the world.  And the service is always friendly and perfect.  But here's my big, big, big problem with Alice's:  some of the customers there are disgusting, snot-nosed pigs.  Every single solitary time I dine-in at Alice's, I inevitably encounter some customer who is so affected by the spicy food that he/she must blow his/her nose into a napkin while sitting in the dining room. Yum!  My egg drop soup and the gelatinous sauce on my lemon chicken become so much more appetizing when I listen to a repulsive pig blow snot into a paper napkin.  I'm not a very squeamish guy, and I try not to get hung up on archaic forms of politeness, but, my god, I draw the line at snot blowing in a dining room.  Where does it end?  Is it ok for me to pull out my kid's potty chair and let him take a dump at the table?  Can I just go ahead and vomit mid-meal if I need to?  Ok to clean out Uncle Jim's catheter during the appetizers?  How about watching my sister change her tampon before dessert?  Is zit popping ok while we enjoy our tea?  Yeah, my nose sometimes runs because of the deliciously spicy goodness at Alice's, but, you know what, I duck into the bathroom or out onto the sidewalk if I've gotta blow my nose.  And there's also the amazingly simple option of not ordering spicy food if i know it might affect the production of mucus in my nasal cavity.  Now, if I were the esteemed owner of Alice's, I'd probably politely ask nose-blowers to do their snot expelling in the bathroom or on the sidewalk, and if they didn't follow those instructions, I'd toss their sorry butts out the door and 86 them evermore, but that'd probably hurt people's feelings and hurt business too--I guess there's a good reason why I'm not a restaurateur.  So, here's how I deal with the veritable snot-fest at Alice's:  I no longer dine-in at Alice's--yep, it's all take-out all the time for me.  But be forewarned:  if I'm ever at Alice's picking up some take-out to enjoy at home in my own snot-free dining room, and I'm subjected to your blowing your nose at your table, I'm gonna walk right over to you and spew some type of my bodily fluids or some excreta onto your plate--even if you're eating those delicious, world-class Alice's pot stickers.", "author": "clover s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-07", "description": "Great American-Chinese food.  Local haunt.  Reasonable prices and consistently good.  They don't kick you out (at least when they are not busy) with rings fantastic in my book!", "author": "M W W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-20", "description": "One of the best Chinese restaurants in San Francisco. Don't  miss their orange beef. It is excellent!!!!", "author": "Michele M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-28", "description": "The lunch specials have the nice price ($5.25).  Check out the GIANT won-ton soup.  Tons of fresh mushrooms.  It's the most elaborate I've seen.", "author": "Big Stu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "love alice's:) u can always get a table, hardly a wait. lovely and clean restaurant, reminds me alot of regent thai. food is very good and service is great! parking can be a little tough but most of the time its ok. really great and chinese food, love the kung pao prawns!", "author": "vicki g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-07", "description": "Solid Chinese food, not expensive (although not cheap).  Well lit.  Decent service.  I would come here if for some reason I was craving Chinese and stuck in Noe and couldn't get to the Inner Sunset to eat at San Tung (mmmm...).  Favorite dish:  eggplant something.  Don't get the avocado spring rolls (it sounded good when we were starving and ordering, k?).", "author": "S J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-13", "description": "Pretty darn good food, had a few bites but was happy w/ their selection of dishes. I went here for a dinner for a bday event and was definitely satisfied.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-04", "description": "There is  has not been a wait whenever I have gone. the food is good and not greasy like some chinese food. I love the hot and sour soup. I am not sure if it is like Erics but whatever I think it is better. Not all of the food is fried and at erics it is ready in two seconds which kind of scares me. The pot stickers are good as well as the orange shrimp.", "author": "Carli M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-06", "description": "Went to Alice's for the first time yesterday and while the food was fresh, it was too bland for my taste.  The Schezwan pork was decent but will not win any awards.  The string bean dish and the soup were both very bland and forgettable.", "author": "Shawn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "I love this restaurant!  The service is great and the food is plentiful and tastes great!  I'm a bit partial for their Hunan Prawns...a great spicy sauce and crunchy with large prawns.  I usually order it less spicey, but great either way!\nIt's a wonderful place to go for lunch, even if you want to dine alone with a good book and a glass of wine.\nA wonderful neighborhood restaurant!", "author": "D A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-20", "description": "We read the reviews and thought this place would have more potential than Eric's in Noe, but unfortunately Alice's disappointed as well. \n\nTheir egg rolls and corn soup were average. However, the main dishes we got (string beans/bean curd, spicy chicken and basil) were very sub-par. Chinese food should never be drenched in salty \"brown sauce!\" Whoever invented this type of \"chinese\" food?\n\nI grew up eating asian food so maybe I am too picky, but I know I will never eat at any Chinese food restaurant again in Noe (I gave them all a chance!) - - I'll have to go elsewhere. Sorry Alice's! I wanted to like you!\n\nOn the plus side, the waiting staff are all very courteous, attentive, and nice. Their restaurant is also clean and well-lit.", "author": "E M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "The food is inexpensive and plentiful.  I was there on a Saturday night and the place was nearly empty, but they must have put out almost 20 take out orders while I was there.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "Alice's is not better than Eric's. They are one in the same. It's a philosophical conundrum.", "author": "G J J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-04", "description": "It's a tough choice but I have to give the slight edge to Eric's over Alice's, just more flavorful food, although you really can't go wrong at either, and Alice's is always less crowded.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "I went here this past weekend with Sergio and my dad.  The food was so awesome!  I loved the family style and the service was great.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "The hot sour soup was yummy, but the best item we ordered was the sesame beef - it was really good!!! We also ordered noodles and a shrimp dish...everything was pretty good. It's close to me so I am going back!!", "author": "Z A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "We have given all the Chinese restaurants in our 'hood a try and definitely think Alice's is the best! We like Henry's also, but kind of think most of the dishes there taste the same.  \n\nAt Alice's, a couple of our absolute favorites for take out are:\n\n*Mu-Shu Vegetables! \n*Sizzling Rice Soup!", "author": "L S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-27", "description": "Alice's lunch menu is quite a deal...you begin with a bowl of soup and then you are served is perfectly sized portion of rice and your desired entree.  I also love the feel of this restaurant: bright, open and airy (so different from many chinese restaurants) and the food is always good. Their won ton soup is very fresh and delicious...that actually sounds good right now...I think I'll go get me some...", "author": "Karen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-12", "description": "the big debate is alice looks like erics look like elizas -good or maybe it is okay they look like each other--the food varies between names.  i like Alices and Elizas but always find myself going back to Erics.  and the \"crowds\" at Erics are manageable.  \n\nBuen Provecho!", "author": "Jaime Patricio M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-28", "description": "Ate here a few years ago, and still remember the experience. After ordering appetizers, we found that there was hair in not one, but several of the items. I'm not going to knock them for that, I mean, stuff happens, right? But we pointed out one of the hairs and they were totally unapologetic. And when they brought the plate back, it was clear that it was the same plate, and they had just picked out the hair that we showed them...but not the rest! We had lost our appetite by then and no longer wanted the rest of our lunch. And they still charged us for the appetizer. Definitely won't go back.", "author": "L G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-13", "description": "The best Hot n' Sour soup in the City; it's like medicine for a cold.  The food is great, too, and the high ceilings and big windows make it a nice place to sit.  However, the owner, \"Alice\" is a cartoon character of a nasty horrible greedy boss; she has been known to steal tips as small as a dime away from her staff, who are gentle, kind and kinda scared, so try to slip a tip when she's not looking and they'll look at you with poignantly grateful eyes.", "author": "Carma K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-05", "description": "So so Chinese... it is walking distance from where I live. Will only go if I really deparate for Chinese and want it quick. Nothing too special about this place.", "author": "Ervinna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-05", "description": "Decent chinese food in a nice neighborhood.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-01", "description": "I used to do takeout from here years ago. I can't tell if this place has gone downhill or if I'm just much more picky about Chinese food now. It's pretty cheap and that's about the best thing I can say. I'm sure that I'll be back (because it's three blocks from my house), but very average food and very below average atmosphere.", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-19", "description": "A Chinese restaurant favorite in San Francisco. I'm picky when it comes to Chinese food and I've never had a reason to get squeamish at Alice's. The chicken dishes are tasty, never any chewy bits, and the pot stickers are great. Nice neighborhood (Noe Valley) but parking can take a few minutes.", "author": "Alden C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-07", "description": "not your typical chinese restaurant.  it's more new style where they don't cook with a heavy hand of oil.  \n\n3.5 stars", "author": "Will I A m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "So this place is literally two blocks from my house, and the closest to me. It is very consistent, but I have been there on occasion to sit down and there are a few dishes to avoid (the ma-pu tofu comes to mind). Otherwise, most of the other dishes are decent and I am very happy with the establishment.", "author": "Hans H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-09", "description": "The Chinese food here is mediocre.  I ordered the chicken and basil plate but it came with mostly water chestnuts.  There was barely any chicken or basil in it.  The dish was still tasty and flavorful but I walked out still hungry for more chicken.  The reason I gave it 3 stars is because of the service and the option of having brown rice instead of white.", "author": "Toni C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-30", "description": "I'm really confused about the number of Chinese restaurants in SF that are named with basic English names like Alice's.  Where I grew up we went to places called Sun Ming, Imperial Wok, Lum's, Grand Sichuan.  But, alas, in SF we have Eric's, Eliza's and Alice's.  Of them, I vote Alice for President.  The food, although very basic, is consistently flavorful and reliable.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "Its good food. I've been told that the soup is really good, but I haven't tried it.", "author": "doug d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "I have been here several times, and I guess I keep going back because the food is delicious. The ladies are really friendly, but once again, I think its because the company I go with are frequent visitors. But, the food, and I have gotten something different each time is delicious, and there is typically no wait, but the service is prompt. Go try it!", "author": "Jenna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-04", "description": "good fresh chinese food  for what it is i think alice's is a hit.  mango chicken.  yum.  quick, cheap, easy, good with kids, service is amazingly fast and they're always pleasant.  eat in or take out.  yup.  glad they're around:)", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "The minute I walked in, I felt that it would be a nice surprise.  The service was nice, the food was good.  They were nice about my baby making a fuss.\nPotstickers were great, soup was nice.  The portions were generous.  The decor was good and made me feel that it was not cheapo restaurant even though the price was very good.\nHighly recommended!", "author": "Miinno N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-30", "description": "Alice's used to be one of my favorite Chinese restaurants in SF. Now the only tasty things are the fortune cookies. What a pity!", "author": "D'Andy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-16", "description": "I felt like copying my review for Eric's and just substituting the names. We go here for the mango prawns, sesame beef and stir fried green beans with tofu. But then again, that's what we order at Eric's. I think the atmosphere is what makes it a different restaurant. A lot more laid back, definitely more out of the way - and, may be just far enough from the Noe Valley PTA and their brats to make it a totally different experience.", "author": "Rey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-29", "description": "We used to live in Noe Valley and were so lucky to be just blocks from this restaurant.  Nearly every week, we enjoyed Alice's food.  Now we are down in Redwood City but we still make sure to get the yummy Alice Cakes and Shanghai Chicken at least once a month.", "author": "Kate S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-15", "description": "I've been to Alice's twice and I really wanted to like this place since I practically live across the street, but unfortunately the place isn't for me.  The food isn't bad, but I guess it just isn't my style.  The first time I ordered the mu shu vegetables, and I believe instead of serving it with crepes, they actually gave me flour tortillas.  There is nothing wrong with tortillas, but I was really looking forward to those thin Chinese crepes.  On the second visit I decided to play it safe and ordered the vegetable soup and that wasn't even good.  Too salty and bland and the veggies were seriously lacking.  \n\nI guess I'll have to trek down to Yuet Lee when I'm craving for Chinese.", "author": "Rachel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-23", "description": "a favorite that is worth leaving your neighborhood for. Parking is easy and the food and service consistently good. their ingredients are extremely fresh and of high quality. don't miss the Hunan smoked pork, alice's spicy chicken, mango tofu, and a host of other delectable dishes. a veritable bargain.", "author": "John T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-10", "description": "Their entrees are good but I must say I did not like the wonton soup very much. The service is usually pretty good, the orange wedges are great after the meal. I've had Cashew & Brocolli Chicken, Cashew & Brocolli Prawns, Fried Rice, and their must-have Pot Stickers.", "author": "Gabriela R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-19", "description": "I don't mean to be unkind, but anyone who gives this place a good review simply has not had the pleasure of having good chinese food.  This is not just so so, but really really bad.  Even if I had spent 1/2 the amount I did for Walnut Prawns (a house specialty) spring rolls and rice I would have still felt ripped off.  Spring rolls...greasy, bad tasting plain awful.  Walnut Prawns.. I just don't get it.  prawns battered and deep fried and seasoned with what I would guess to be mayonaise?? served in a \"basket\" of fried something that was totally inedible over 4 little pieces of a bitter green with 1/2 slice of lemon too thin to squeeze for juice and finally (get this) a marchino cherry?  I'm sorry I don't get it.  Just a really really bad culinary experience.  The best part of the meal was the white rice, with a little tamari (soy sauce) was by far the best part of the meal.  Two stars was being generous.  New York Chinatown where are you when I need you, for that matter ANY place on clement street is much much better than Alice's.   Noe Valley you have million dollar homes why can't you get good Chinese food.", "author": "Art B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-17", "description": "I started going to Alice's in Noe Valley when I live around the corner on day street. Now I am there every Sunday like it's a religion. The place is very clean, the wait staff is very helpful and the food tops it all. Normally when I eat Chinese food I feel very heavy after, but at Alice's it's perfect. The best thing about it though is that you can have 5 dishes for about $35.00 for two! WOW can you beat that anywhere else?  Keep up the good work and see you on Sunday!", "author": "BOB M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-26", "description": "This is the best Chinese food in town for non-Chinese people. I mean it is a sort of westernized menu, is all. The Shrimp with portobello mushrooms is magnificent. My friend and I have a long standing feud about which is better: Eric's or Alice's? I know Eric's (around two blocks away) was there first, and Alice's copied the formula, but I feel that Alice's is an improvement on the original! Please let me know your thoughts. My friend thinks Alice's is declasse, whatever that means.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-28", "description": "for those of you who were not fans and also eat meat, please go back and try the sesame beef. it is insanely genius. please", "author": "Hillary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "The only reason that I have given them this many stars is because they are sooo much nicer then the a-holes at Eric's. The food is the same. However, I am now concerned about the roaches and the recycled rice.", "author": "Alulubeth O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-14", "description": "the food here is great i always have the mongolian beef is the best, potstickers, wonton soup are all really good im yet to have a dish from this place thats bad . the service is really good to try this place its great.", "author": "mike b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-10", "description": "i used to go at least once a week when i lived in noe, and now that i moved away i take every opportunity i am in the neighborhood to eat here. they should have alice's all of ther city :)", "author": "papa c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-28", "description": "Nothing to write home about, but it's reliable. The mango chicken (or mango tofu) is very good, and my husband adores the string beans with bean curd. The only truly bad dish I've had here is the chow fun. Normally, that's my favorite, but Alice's chow fun kind of tastes how my cat's breath smells. Yuck.", "author": "Hilary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-02", "description": "Fresh food and great service at a very reasonable price. Everything is delicious but I highly recommend the orange chicken or mango prawns. Their mushu pork is wonderful and their pot stickers are a must. Try Alice's...you will not be disappointed.", "author": "G A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "We like this restaurant for Friday-night takeout -- food is excellent, and they always have it ready when they say they will.  Because it's so convenient for takeout (parking is relatively easy), we've actually never eaten in the restaurant, but it's always crowded when we come in.", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "Alice's has some great Chinese food. It's pretty clean and consistent. Great mushu, great potstickers, shanghai chicken and the list goes on. it's never too long of a wait and the owners are pretty rad. Way better than Eric's. I grew up in Noe Valley. You can trust me...go to Alice's if you want a salty chinese fix", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-20", "description": "i'm going to echo Billy. its exactly the same. i read in a best of sf one year that it was the best restaurant inspired by a family feud. Its by far the best chinese in the city when it comes to parking. to the neighbors on sanchez I'll give you my apologies now.", "author": "David T."}
