{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "I have to say this is my favorite pho restaurant. Their portions are pretty large and filling and very decently priced. I love their chicken pho and combo pho. \n\nIt's a little stuff inside the restaurant but that doesn't ruin the flavors of the noodles.", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-29", "description": "The restaurant had off scent. It was not super bad but it was noticeably unpleasant some funky food and cleaning product?\n\nOrdered Large Pho Dac Biet - Combo Beef Noodle Soup $9.50 big portion and comes with rare slice of steak, brisket, flank, tendon, tripe and meatballs. As a self-claimed only person who makes her own 100% organic Pho broth at home in SF, this pho was too funky for me. The tendon was too chewy and the meatball had gamy flavor. No depth in the broth. One good thing was I could tell they use not much msg.   \n\nI wish there were organic Pho in SF....", "author": "Chie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-28", "description": "I like this spot for a casual takeout. Never been inside physically but I ordered through UberEats and I thought the food was pretty good. Now, I'm Vietnamese and I know what authentic Vietnamese tastes like. I live and breathe Vietnamese food. And, I can be a tough critic when it comes to my origin's food but when I ordered takeout here, I was willing to give it a shot knowing it won't be exactly how I would imagine for it to be but if it can replicate some Vietnamese flavors then I'm okay with that.\n\nI got the spring rolls and banh mi.\nSpring rolls were good. Nothing too special, they were just spring rolls and tasted like spring rolls. The sauce was nuoc mam(fish sauce based) which I liked because I usually make my sauce out of nuoc mam as well. That's my staple. \n\nAs for the banh mi(Vietnamese sandwich), honestly, it doesn't really compare to the ones I've had in San Jose. It was also pretty small but It wasn't as disappointing. I can deal with that. I do wish they can make it a little bigger. I mean it didn't make me full but it was enough where I wouldn't stay hungry.\n\nI'd come back for their simple meals. I don't think I would actually get the noodle soups and/or the more traditional items. It might make me change my mind about this place.", "author": "Ngoc P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "What the pho?!?? Why am I just now finding out about this place? It's so delicious!! Their chicken! They roast or caramelize it or do some type of razzle dazzle magic to make this so flavorful! I just wasn't expecting that! \n\nService was super fast and friendly. I like that they were able to explain things to me, because sometimes I'm doubtful when trying something new, and even if someone tells me it's good, it always isn't. But this time it was spot on! \n\nThis place is located off Mission, so parking can sometimes be sketchy (although I was able to find parking right out front), so plan accordingly. There should be parking up some of the side streets, and you can always ride share or use public transportation to get there as well (in addition to old fashioned walking, if you live nearby). \n\nPrice wasn't too bad,either. This will literally be my new go-to for Vietnamese food!", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-28", "description": "Believe it or not, I've actually never physically been here BUT according to my UberEATS app, I've ordered a total of 18 times - 17 of which were amazing.\n\nHere's where they've temporarily lost me:\nPho Dac Biet - the ingredients were great and it was a perfect portion for my non-stretchy stomach but the broth was beyond disappointing. Keep in mind, I was actually STARVING by the time my food arrived so one would think that literally anything would taste scrumptious, no? Nope. The broth was oddly bitter and extremely lacking in any other flavor. I was thoroughly confused.\n\nI think I've held this joint to a pretty high standard considering that I absolutely love their rice plates and banh mi, and their Bun Bo Hue and Bun Rieu are pretty bomb too! Iced coffee? Delicious!\n\nI guess like the saying goes, \"the most simple thing is the most difficult to get right\" (or whatever). I honestly hope that this was just my misfortune that maybe their cook is out today or something because MAN, that really sucks to have the most easy seller fall below expectations.\n\nI'll just stick to their BBH from now on, that never fails me.", "author": "Joyce Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "A reasonably priced Vietnamese spot that hits the spot, but the food isn't superb.\n\nThe regular-size pho is plenty of food for an average eater. The broth is average and I don't like their sliced ribeye. But they give you big portions of noodles and meats (like meatball, tripe, tendon, etc) Their bun rieu and bun bo hue are ok. I thought the bun rieu didn't have much flvaor, but was a big portion, especially the seafood part. The bun bo hue wasn't spicy enough for my tastes, but I tend to have a high spice tolerance, too.\n\nTheir banh mi is always a solid choice, too. My favorite is the pork cold cut, but the chicken teriyaki and tofu are also good. I'm not a fan of the beef banh mi because I find the meat too sweet. \n\nMy bf really enjoys their Vietnamese iced coffee because they do it in a proper drip when you order it for-there. It's strong, bitter and not too sweet. If you take it to go, it's already pre-made for you.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "This is the go-to spot when I eat with my dad!\n\nI highly recommend the pho + banh mi combo because it is such a good deal!!  My dad ordered a large pho and I wanted a banh mi that night, then our server told us that he'd give us the combo deal.  For less than $14, you get both!  The grilled pork banh mi that I got was one of the best I've had.  I especially liked the sauce dressing that was used as it packed so much flavor!\n\nThe spring rolls are really good!  They satisfy cravings for Brodard.  The pho and vermicelli are great here as well and they give generous portions.\n\nProbably would not order again: Bun Rieu - it tasted pretty watered down and not what I expected from a tomato base.\n\nVery friendly service and plenty of seating.  I've been slowly trying other items on the menu and can say that this place is pretty solid!", "author": "Stephanie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "Pho in the Mission!  Hole in the wall that makes sizable pho and other homely pho bowls!\n\nSpring rolls are rolled up fresh and pho is fair. \n\nIced coffee is delish.  They recommended this crab udon that warmed up the soul of one is freezing cold from the outside weather. \n\nGot my Pho on and pivot on.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Solid four stars for this little pho joint. An Chi is a hole-in-the-wall mom and pop joint with expedient service and fast, hot food. I literally sat down and ordered my dac biet combo (large bowl of beef pho with a delicious banh mi for only $13) and had that bowl within 5 minutes. The broth was hot and savory without being overly salty, and the slices of beef were perfectly pink. The only thing I would have to say is that the speed at which they do things means they skimp on portions. There was one beef ball, sliced in two, and one piece of cartilage. There were probably two or three slivers of tripe. Everything tastes great. It's just, for what's advertised as a large bowl versus the usual one, the bowl itself was larger, but I think portions are the same.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Went to grab a bite with the roommate and we order the Bun Bo Nuong and the Bun Ga Nuong. Basically chicken and beef. I added an egg on mine and it was absolutely delicious. Small spot in the excelsior and super affordable. \n\nWe got tea right away and come & Thai ice tea. All delicious!", "author": "Alex A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "This is probably the most decent Pho places around this area. \n\nThe pho here is a good price (Regular: $8.50 and Large: 9.50 but certain Pho will cost a little more). For the price of it and the portion, it's really good. The broth is pretty average but it does have flavor. I can't complain about the noodles and meat because it's always good. Definitely recommend dipping the meat in hoisin sauce (and mix it with sriracha for a bit of spice)! \n\nI also tried their Thai Tea and it comes with boba! The Thai Tea is good and not overly sweet. \n\nThe service here is okay. I just think the lady serving us looked unfriendly and didn't say much. She speaks Chinese and didn't bother to speak Chinese either. But maybe she wasn't having it that day. \n\nOverall, if you're looking for pho around mission st/Geneva this is a place I'd recommend!", "author": "Angelina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I found this place based on the reviews, and I'm glad I stopped by. This place is a cozy little spot that offers a good variety of dishes. I ordered the bun ba hue since it was recommended. It was spicy, full of meat, and the noodles were full and plenty. The service was decent: not attentive but not avoidant, and the guy who helped us was really nice and friendly. I found street parking near the place, but I'm sure it can get a little tight at times. In the end, the food was good, the service was good enough, and the price was affordable. I would definitely stop by next time I'm in the city.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "This place is so so tasty\nYummy.. portions r food and prices good.. I really need to come back and orde Sandwiches.. \noh there r meter parking lots a block away.. if no street parking ..is worth a try here .. yay..", "author": "Crisy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-25", "description": "Sometimes you just want the food of your peoples. Yesterday, that was me. Unfortunately, I left, craving unsatisfied.\n\nI will say that when I was first presented with my bowl of bún bò huê (beef noodle soup), I was rather impressed... It was the largest I've seen. Ever! But that's all it was. A big ass bowl. Full of noodles. And very little meat. The broth was lacking in depth so much so that I had to request some extra mám tôm on the side (fermented shrimp paste). Sadly, the disappointment was real.\n\nI will say, though, that the server was very earnest in her efforts to... well... serve me. 3 stars.", "author": "Vi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "Came here for Pho and Imperial rolls.\nThe rolls were tasty and crispy, the pho missed a bit.\nIt felt under seasoned and the noodles were a bit firmer than my fave places. I tossed a bit of sambal in and that brightened it up. Almost felt like it was low on salt? Dunno. Its fairly convenient and clean so I will come here again.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "So happy to have a good pho spot in the excelsior! I've been quite a few times now since they've opened & I haven't had one bad experience, I always get the rare beef pho, but their rice plates aren't too bad either if you aren't in the mood for soup. Love this place, and the workers are actually polite and helpful.", "author": "Jasmine T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-22", "description": "We ordered delivery through Doordash. Overall their food is 3 stars. \n\nBun Rieu (tomato crab noodle soup) - $10.50 - OK. It didn't taste like authentic Bun Rieu and was too salty. They relied too much on shrimp paste for flavor. I would not order again. I'll try their pho next time and see if it's any good.\n\nBanh Mi - $6 - my husband liked it.", "author": "Theresa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Hell yeah I love this spot whenever I'm in the excelsior doing my bidnezz, I come by and get me a rice platter!", "author": "Jray M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-19", "description": "Ordered the beef pho on Uber Eats and it was fine but nothing special. The broth was a little flat, maybe even a little too sweet? I appreciated the generous noodle portion though!", "author": "Megan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-15", "description": "I'm Vietnamese and moved to SF about 8 months ago. This place is walking distance from my house and to be honest I've actually had a very difficult time finding good even decent pho in this city. This place gets three stars because it has been the BEST that I have tasted in SF so far and for a decent price. But it's not close to being the best that I've had in my life (guess I'm somewhat of a pho snob, I blame my upbringing). That being said, what keeps it from getting four stars is the broth can be a bit too salty at times and my biggest grievance is that I get about four slices of tai (eye-round steak) in my pho. I may have counted. I feel like a few more slices wouldn't hurt. Meh.", "author": "Margo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Favorite pho spot in the city. Great price for quality and quantity of food!\n\nThe broth in both pho was shots of flavor with every bite!", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "Pretty good for take out. We ordered through Amazon and it was delivered Luke warm. No biggie, just had to reheat pho soup and toast the sandwiches.\n\nRoast pork spring roll. Really packed with ingredients and fresh veggies. The fish sauce dip was a little too salty/fishy. Could've added more vinegar, or even have a side of peanut sauce.\n\nRoast pork sandwich was good and filled with meat. Combination sandwich was tastier as it had more layers going on. The bread is a bit too dense for my liking in a viet sandwich. \n\nPho with sliced beef. Not sure why they delivered the beef raw...... Like.... By the time the soup gets to the customer, it's not gonna be hot enough to cook the meat. Good thing we got it delivered to home so we can heat everything up in the microwave. Average soup base. Not bad. \n\nSolid place for viet take out", "author": "Susanna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "I can't say I like this place. It was great they were open at 9 am on a Sunday. My second time trying their noodle soups. This time I tried their new item Five Spice Chicken Soup. I would have opt for the rice option if I ever go back. The soup is lacking flavor by it self. But if you take the time to put a piece of the chicken on your spoon of noodles and remember to use the sauce, then it is okay. Basically if you love Ben Tre's version of Five Spice Chicken Soup, this place will not satisfy your craving.", "author": "Suzy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "One of my favorite Vietnamese spots in SF! The portions are HUGE! My boyfriend and I both got the large pho and banh mi ($13.50 each) and that's two meals within itself. The pho is huuuge, it can definitely be shared! They don't skimp out on the meats either! We also got the Vietnamese coffee, pretty good as well! Definitely recommend coming here!", "author": "Katty X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "I really enjoyed this place! I wanted to try the spicy beef noodle soup this time instead of the regular Pho Tai and they really did not disappoint! They give you your own side plate of veggies which is different from regular bean sprouts. \n\nI also liked that I had the option to order one fried egg roll instead of a full order. The fish sauce is tasty and really good!", "author": "Helen z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Ordered rare beef noodle soup and the nem cuong for delivery. Arrived fairly quickly. The pho was really good! The broth was flavorful and perfect for a rainy day. The star of the show was definitely the nem cuong rolls. Oh man, I've been dying to find these rolls all over SF! I've actually never found them at a viet restaurant in sf yet, so when I saw this on the menu, I died. It was super delicious!!! If all this food was that great with takeout, I can't imagine how much better it will be when I actually dine in.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "solid vietnamese place in excelsior, parking can be a challenge at times, the service was fast and friendly and quality was good", "author": "Long C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "They charged a lot for the Vietnamese dishes that they serve but boy does their food hit the spot. Was in the bay for a couple of days and I was craving Vietnamese food so badly. Luckily I found this place close to where I was staying. Walked here and they were opened. Ordered their bun bo hue. The Vietnamese food here is as good as it gets for being in this area where there's minimal Vietnamese cuisine.", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "This relatively new option in the crowded space of outer mission Vietnamese options is pretty solid. Their grilled pork bánh mi is perfectly sized and fairly priced. Thick crunchy yet soft bread, a decent amount of meat, and the usual toppings. The pickled veggies were a little too wet for my taste, and didn't pack the crunchy punch I wanted. The meat is of typical middle grade quality and was decently seasoned but not the best I've had. \n\nWhat made this spot a real winner for me are the Goi Cuon, or fresh spring rolls, which were actually some of the best I've had in recent memory. Very well rolled and full of crisp bright flavor I can't wait to order them again. The peanut sauce they are served with is stellar as well - a little sweet and not too salty - total winner of a dip!", "author": "Sean S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-08", "description": "I like this restaurant because it's close to my house and the flavor is really good. \n\n2.5 stars because I try a new item on their menu. And the table smell like fish sauce was spilled. \n\nCrab noodle soup $13 (udon noodle). The price is expensive! This comes in a big bowl, right amount of udon. Nice chicken broth! The only bad thing was a quarter of a crab, 2 small legs. 1 tiny fish cake. THAT ALL! I would go back to My Canh for this type of soup. \n\nI would give 4 stars if they add more meat to this dish.\n\nI would give 5 stars for bun bo hue. It's my favorite!", "author": "Kyaw T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Came here for a quick bite w/ my gf yesterday! \n\nWe got a banh mi (combination pork) and an order of spring rolls, $5 each. \n\nBoth tasted great, what'd you'd expect at a standard Vietnamese place. The banh mi was smaller than what I'm used to, but you can't complain for $5! I loved that they put a generous amount of pate in it (my favorite part)!\n\nService was awesome. Our waitress was all smiles, incredibly warm, and made us feel right at home.\n\nSide note - it's not located in the best neighborhood so things might get a littlleeee strange. For example, a guy came in, grabbed a cup, and went into the bathroom for water. Someone who works there offered to give him  water so he wouldn't have to get it from the bathroom sink, but he said no. \n\nThat being said, I didn't mind toooo much, so I'll stop by again if I'm in the neighborhood and try out their pho and other dishes.", "author": "Debbie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "Very friendly and fast\n\nBad food. I'd never had Vietnamese food I didn't like until here. The problem was that it didn't taste fresh - it tasted like old veggies and left a bad taste", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "About time I tried this place. Pretty excited to try this new vietnamese place. Prices look decent (all under $10) and reviews seem to be good. I ordered take out on a friday evening. Sad they didn't have pork for the rolls so I settled with shrimp only. The lady was nice and read the order back to me. Prep took about 20 mins. They accept credit cards. One thing that bugged me was that she charged me the full price of a shrimp&pork rolls. I didn't get pork in my rolls, so this should have been cheaper... rip.\n\nFor 3 entrees and 1 app, it wasn't that heavy to carry... When I got home, they got my order right thankfully. The Shrimp rolls were ok. Definitely fresh and comes with peanut sauce, I believe. The combo beef pho was just ok. The broth wasn't really anything to die for. The portion for this was pretty big for a regular. The imperial rolls and pork was ok. The pork lacked a bit of flavor. The vermicelli and imperial were good. The lemongrass pork with rice was just ok too. The meat had some flavor but it wasn't like I wanted more. You can get fried rice with this instead for $1 more.\n\nBasically, everything was just OK to me. Kind of disappointed. I didn't want to eat more of any particular dish. For the price it's not bad but it's not cheap enough for me to want to come back.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "Came here on a Thursday night and it was pretty empty. The imperial rolls here are SO GOOD. Best I've ever had in SF. They are super crispy, fresh and there's rice noodles and lettuce that you can eat with the rolls. \n\nWe also were able to try Bun Bo Huy. It's a bit spicy compared to other Vietnamese restaurants so be sure to request a mild spice. \n\nI gave it 4 stars just because I haven't tried enough food here yet but I cannot wait to try more.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "On Saturday night, I came home buzzed and excited...just in time for Lifetime's biopic of Britney Spears! Thirty [something] year-old fan girl here. I even did a speech in college about her....yah, don't ask. \n\nTwenty minutes in, I sat there utterly confused and thought maybe I was watching the wrong channel. Or, maybe it was the Fernet goggles because I didn't see Britney anywhere so I watched the re-run again last night...sober.\n\nDammit, Lifetime with all the blondes in Hollywood you could of least found a girl that resembles Britney's seventh cousin...that actress looked nothing like her! \n\nAnd, don't get me started on that Britney and Justin post-breakup dance off. It was like walking into the room to find your parents wheelbarrowing - awkwardly bad. \n\nPretty sure all of Britney fans who saw that atrocity felt duped. \n\nThat's how I feel when Yelp leads me astray (duped, that is)....\n\nAn Chi came up as one of the \"hot and new\" businesses on Yelp. Boosting all 5 star reviews, I thought maybe this was the unicorn of all Asian restaurants in Excelsior! If you're familiar with the area, you know the area has great Mexican eateries where you can stuff your face with offal goodness for under $10. But...everything else? Ehhh. \n\nAn Chi's menu is surprisingly small for a Vietnamese restaurant with just 3-4 options each for appetizers, banh mi, pho, bun, and com dia. They have Vietnamese iced coffee but no che or Vietnamese drinks (e.g. coconut juice, sugar cane juice, etc). \n\nThe prices are reasonable with everything under $8.50 but with smaller portions compared to other Vietnamese eateries. Cc's accepted. \n\nGiven how condensed the menu is, I assumed the food would be solid since the chef can perfect a handful of items as opposed to 100 items on the menu. Not to mention all those glowing 5 star reviews....\n\nUnfortunately, the food at An Chi was less than average and comparable to 3 star Vietnamese eateries in Daly City, South San Francisco, and San Bruno. \n\nWe started with the Cha Gio: Imperial Rolls ($5): http://bit.ly/2ldRP4Q which were decent. Hot and crunchy, you can never go wrong with fried anything. The accompanying vermicelli was a clump of overcooked noodles though. \n\nI ordered the Lemongrass Pork Rice Plate ($7): http://bit.ly/2ldRCPo. The pork chop was thin and had a lot of bones. Seasoning was on the sweeter side. The server was honest about their light usage of msg which I greatly appreciated. I was thirsty afterwards but didn't get the usual tongue numbness, headache, and heart palpitations so the msg usage is minimal.\n\nMy friend ordered the Pho Dac Biet: Pho Combo (Large - $8.50) which was meh. The broth is chicken based and the meats were dry and chewy. I had a sip of the broth - it was salty and didn't have that clean chickeny flavor. \n\nThe staff is nice but one of our orders was wrong. My friend had asked for rare beef on the side and it was well done in the bowl. We told the server, \"Sorry, but we asked for rare beef on the side\" to which he replied, \"Well, the cook put the beef in the bowl\" and then walked away. All he had to do was to ask the kitchen to put several slices of raw beef on a plate to rectify the issue. Not a good impression for a grand opening but this has no bearing on my rating since you don't visit Asian restaurants for the stellar service. \n\nParking is very difficult so unless you live in the area, An Chi is not worth trekking across the city for. \n\nSorry, I'll stick with going to the TL or to Ben Tre in Millbrae for solid Vietnamese food.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Great place for pho and banh I'm without all the hustle and bustle of so many their places in the area. It is rather clean and does not have much of a wait so it has become a favorite of mine in the excelsior area of San Francisco.", "author": "Joseph K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "New place in Outer Mission. They are going for a healthy style pho, maybe, as the broth was not salty and oily as I'd prefer. The portion here is smaller than at many pho joints but the price is lower so that's fair. Service was friendly. However, my waiter forgot to bring out the veggie condiments and then not doing so after mentioning he will.\n\nThe Spring Rolls menu stated shrimp and pork. The rolls came out with only shrimp and mostly fillers of lettuce and rice noodle but no pork. Again, likely healthy but not for me and I wouldn't get it again. I returned to try the Bun Rieu and it was good! A variation as it was full of tofus and types of special pork rolls.\n\nSo, the first impression was me not wanting to return but the Bun Rieu and Charbroiled Pork Rice Plate changed my mind.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "TL;DR - Home-y, filling, and so satisfying.\n\nI love bahn mi and this place is the closest alternative to driving down to San Jose.\n\nGet the pho and bahn mi combo :D", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "All I can say is if you're looking for some delicious piping hot bun bo hue this is the place to go! They only serve it large so go big or go home! And you don't even need any of the sauces unless you're trying to go diablo hot. The shrimp rolls are also delicious and so are the pork rolls. Cheap, delicious, and fast service. Every time I go here I get my food in 5 minutes or less.", "author": "Dianne E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Fresh and Fun.\n\nThe vibe, the serving ware, the food. All of it is presented in a modern fresh bistro style. Simple menu with a few headliner items. Just the way I like it. \n\nI ordered a #1 Combo Pho Bo. A few pieces of meat in their #1 Combo Pho Bo is a bit chewy and gristly, but the tripe is cut into dainty pieces and there is melty tendon. The broth is on the subtle side... but if you are looking for a clean tasting broth, this is definitely it. No MSG after effects for me after--yay!\n\nThe Caphe Phin (iced coffee) was a bit too milky for me, but otherwise punchy. \n\nLooking forward to bringing my family back here to try more items.\n\n\nAddendum: Feb 11, 2017\n\nReturned with damily to try the combo special--out came a LARGE combo Pho Bo #1 and your choice of Banh Mi. Holy Pho! That's a lot of food for $12. \n\nPho was pristine and very good. Forgot to ask for less noodle.\n\nThat Banh Mi was also street food grade--crackling baguette, terrine like cold cuts, earthy pate. Snappy cucumber and mild jalapeños. Superb.\n\nWe also ordered Cha Gio. 2 large rolls cut into 6 pieces. A bed of rice noodles and shredded carrot rested on a lettuce leaf. The roll was crispy and delectable inside. Just like good street should be.\n\nFor the exemplary Cha Gio, Banh Mi, and outstanding value for money, I have upgraded this review to 5 stars.\n\n\nAddendum 2: Feb 16, 2017\n\nI ordered Bun Cha which featured one of the fabulous Cha Gio rolls, more vegetables and vermicelli and a generous amount of sweet savory caramelized roast pork. Very more-ish.", "author": "Lu-Shien T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I first discovered An Chi on UberEats when I was searching for \"best bun bo hue\" in my neighborhood. I decided to give it a try and it turned out to be pretty good for SF BBH. Price? $10- $11 for a decent size of BBH and the quality is not bad at all. I never got a chance to dine-in at the restaurant but I did go in to pick up my take-out orders. The restaurant itself was very spacious and clean, staffs were very attentive and orders are quickly prepared and made. An Chi can be found on Eat24, UberEat and Postmates, delivery is available through these apps but not on Yelp... \nI will definitely suggest this restaurant for their (BBH) to all my friends and families in sf...", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-17", "description": "This place is really not good and I feel the need to balance the scales here. I like supporting independent businesses and love Vietnamese food but this tastes nothing like it. \n\nSF in general has subpar Asian food, Vietnamese even more scarce so I have such high hopes for every time a new place shows up. Sadly it's just your run of the mill Chinese run place (maybe 越南華僑) and the food is a poor facsimile of what real VN food tastes like. \n\nBun rieu was almost hard to finish, it's been a while and I just remember watery fish sauce broth which tasted nothing like I know. Cuon was standardly mediocre that I forgot what it even tasted like or if the sauce was house made, I think it was the typical overly sweet nuoc mam, both of which are really easy to make. \n\nMaybe I'll give them another shot eventually but there are other \"Vietnamese\" restaurants nearby that are more passable.", "author": "Peel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "It looks like they raised the prices now that summer is coming to an end. Regular is now $8.50 and a large is $9.50. A regular is enough to fill you up! They have also increased the price for a banh mi from $5 to $5.50. Makes sense because the other Vietnamese sandwich places here are now $6. The bowls may look small but it's actually a pretty deep bowl. They give you a generous amount of noodles. I wish they added more onions! Thai tea is still bomb - they give you more of the actual Thai tea drink than the milk.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "I definitely will come back to this restaurant again. Don't be scared of outside where bus stop is not too appealing. But who cares? Once you stepped into the restaurant, it is an open space, clean & the staff/ waitress was friendly to us. She immediately greeted  us w/ 2 cups of tea. I ordered grilled  pork cold noodles & my friend ordered tomato crab meat noodle soup. They were both delicious.", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "I enjoy Vietnamese food but I don't eat beef phò. So my standard of measurement is with a restaurant's vermicelli. An Chi's shrimp vermicelli was probably some of the best I have eaten.\n\nMy son had the traditional Phò tai and enjoyed it.\n\nThey have boba pearls, a big favorite of his.", "author": "Holly N B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "super cheap & super delicious! they have an assortment of different sandwiches, pho, & boba! if getting boba i recommend you to get the coconut boba it's the best!", "author": "Gabriel T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "I've ordered from here several times via door dash and have loved it every time except the last time. I always order the BBQ pork banh mi and deep fried egg rolls and they're usually on point. However, my last order was sub par. The BBQ pork tasted off - almost sour.  The deal breaker was the deep fried egg roll, which my 2 year old usually loves. On this particular order, I broke down the egg roll with the intention to feed it to my son and found a black rock about the size of a quarter. I'm glad I broke it down rather than just handing it to him because it was for sure a choking hazard and at the very least something he could've broken his teeth on. Although I've had great experiences prior to this one, I can't get myself to order from this place again.", "author": "Venice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "Wow!! This place is really good. Their service is incredible, and everything was cooked perfectly . Really flavorful and transitional pho. Thumbs up ! We are definitely coming back.\n\nMay 8, 2017\n\nFirst time trying the spicy beef noodle soup. The soup was bombed! Great job An Chi!", "author": "Cathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Finally. I got a chance to stop by this place and I am glad I did.  One of the few places for Vietnamese Food that was as good as places in San Jose.  When I first got in I was greeted and sat immediately.  There was a few other family inside, but not too busy on A Saturday afternoon.  I ordered the combo special and it was a large bowl of Pho Dac Biet and a Vietnamese sandwich for $13.50 plus tax And tip.   \n\nThe pho can put quickly and it was really good.  The been sprout and leaves seem fresh. The meat was also correctly sliced nice and thin and the meatball also seem fresh.  They give you plenty of noodle and broth.  The sandwich i took home with me and that was also really good.\n\nThe place was clean and well decorated and there was plenty of room.  I will come back again for lunch and there other items", "author": "Tam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "The first time I ordered from here was through UberEATS. \nThere food is really tasty. I love their food. I can eat this every day.", "author": "Romina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-05", "description": "There are so many Vietnamese restaurants in the neighborhood, and I chose this place because they were open late on July 4th. I ordered to go, (use EAT24 so you can pay with a credit card, or else it's cash only). The food was ready in 10 minutes. They also have free delivery within 2 miles and $20 minimum. The restaurant seemed nice and clean when I picked up my meal. I ordered the large pho dac biet ($8.50), and it was enough for 2 people. The pho had a flavorful broth, but they don't give you enough vegetables. Other than that, it's a pretty solid place for cheap and easy Vietnamese.", "author": "Ha D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-13", "description": "This review is for to-go order.\n\n1. Pork sausage spring roll - very cheap on the meat. The sausage doesn't cover the full roll. Taste was average.\n\n2. BBQ pork over rice with egg and imperial roll - again very cheap on the meat. I got two small pieces. It's also very dry. Saw a lot of good reviews on the imperial roll, not impressive.\n\n3. I ordered the sugar cane drink, but I got the ginger ale. Lol....\n\nNot a fan of this place. I will not recommended.", "author": "anita s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Since opening, this was my new neighborhood Vietnamese place and so happy to finally have one back in the excelsior when it opened since  the last good place closed a few yrs. back, but lately it's been hit & miss. \n\nToday got worse ... 3/30, off work & just finished laundry; so craving imperial rolls so grabbed my usual order to go. What a big DISAPPOINTMENT!!!  Imperial rolls were so oily on inside, just tasted a mouthful of oil & nothing else ... oil even squirted in my mouth ... UGG! And to boot, they were burnt all over, like blackened toast after leaving in toaster on high setting - think they don't change oil until it's so bad, rolls just burn on outside & absorb all the crudy old oil on inside ... again UGG. \n\nThen the pork with vermicelli entree, another go to dish, pork was ice cold ... did they give me an order that was not picked up earlier by another customer? Order was done much faster than other times? I was there waiting for it & then back to my house just 5 minutes from place if that. \n\nAfter biting into oily roll & a bite or two of cold pork, I just had to call them to tell them how disgusting this food was, it's been so, so sometimes, really good other times, but never inedible like this order.  All he said was sorry ... well, I am too, even gave them a nice tip as I've done the many times I've been to this place since first opening & getting same order to go 2-3x weeks. Then quality went down so tapered off  ... he definitely knew who I was getting orders as much as I did even if not on a 1st name basis. Well they lost a regular and really loyal customer! ... until now ... figured they would try to make good on this crappy food & at least offer another order to replace the INEDIBLE burnt, oily imperial rolls and cold pork! ... not that I really would want it after this mess, but it would show me they cared about their regular customers. Nope!\n\nNot going back to An Chi ever again and suggest you do same so not disappointed like I was today ... still looking at food on my plate & ready to throw it out ... if I could give it 0 Stars, I would just based on this order & their response, but looks like I'm forced to do the 1 * on Yelp.\n\nFind another place for good quality Vietnamese food you can actually eat and enjoy!\n\nFor future imperial roll cravings ... I get them a lot as I love them so much, I'll go out of my way now, for so much better food you can eat without stomach turning. Will start going back to Lotus Garden @ Mission & 29th. Yeah, pay a few $ more, but all the yrs. I've eaten there, never had a bad meal or imperial roll ... like this mess of a meal of burnt, oily imperial rolls & cold pork from An Chi today!\n\nHere are two photos of the oily burnt imperial rolls from my to go order today.", "author": "Donna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "An Chi makes tasty and consistent Vietnamese cuisine. Luckily we live in the area and can opt for a quick pickup. A few of my favorites include the raw beef with lime juice salad and the combo pho. I think we've tried almost everything on the menu and highly recommend stopping by for your Vietnamese cravings!", "author": "Erinn P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "This is a first place that did not have any veggie options so they came up with tofu pho for me but the soup did not have a lot of flavor and it was only ok and was made with chicken broth ;( \nStaff was nice but was disappointed\n\nCC accepted", "author": "Magda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Always come here for my bun bo hue and Vietnamese coffee fix! I'd say most of the other soups are ok but 100% recommend the bun bo hue or even the sandwiches. Really nice to finally have a go to spot in my neighborhood.", "author": "Jocelyn G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "I've been here twice since they've opened and both times were less than satisfactory. The first time, I came for the bun rieu and they came back a few minutes later and said they didn't have enough ingredients to make one portion. I opted for the pork vermicelli bowl, which had good portion size and looked great. However, the pork was really salty. \n\nOn my second visit, I was finally able to try the bun rieu. Once again. The presentation was good, portion was huge, and the ingredients looked on point. Sadly, the soup was bland and neither tasted like tomato or crab like it's supposed to. The toppings like the fried tofu and the sliced pork patty were exactly what I was looking for in a bun rieu, but without the flavor in the broth, it was not even worth finishing. Very disappointed! Really wanted to like this place since it would've a great new addition to this stretch of mission if the food was actually good.", "author": "Diana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "So gewwwd. Love the sandwiches, they're for a great place and really delicious plus the staff is super sweet. One of my favorite places in the neighborhood. I like to take it to go though because the atmosphere isn't a highlight.", "author": "Anastasia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Our go-to delivery place. The imperial rolls are crispy and very tasty. Worth getting extra! Their pho is excellent, and packaged well for delivery. My favorite is the pork chop + egg + imperial roll rice plate (Com Suon, Cha Gio, Trung).", "author": "Jiwon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "I ordered vegetarian banh mi, which turned out to be delicious. The service was quick and they were very friendly!", "author": "Anita R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "We came here yesterday and enjoyed it so much that we came back again tonight. Both times I stuck with the beef broth pho noodle soup, which I thought was delicious, broth was flavorful and not an overwhelmingly amount of noodles which happens sometimes at other spot.\n\nMy boyfriend had the seasonal seafood udon soup, comes with crab, fish cake and shrimp, he loved the soup and raved about it all night. Tonight though he went for the pork chop rice plate, which he just inhaled. He enjoyed it, but was still longing for the soup.\n\nGive this spot a chance and I hope you enjoy.", "author": "Belen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "This place seems to have a loyal following of locals. I stopped in here for a bánh mi  sandwich. I tried the barbecued pork, which was really, really good. It was nice that they included complementary hot tea. The sandwich had a very fresh, crusty baguette. The spices and the veggies were delicious.\n\nNice staff and fast service.", "author": "Donnie Mac M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "Best place for Bun Bo Hue in SF! On good days make sure to try the limited seafood udon! Amazing each time I've had it and they never disappoint. The serving is a bit on the larger side. They are generous with the portion of noodles and the soup. Had their shrimp rolls the last visit as well and was good. I believe they also deliver with Uber eats or Postmates so they take online orders!", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-23", "description": "Asked for lemongrass chicken and it was not lemongrass at all it was like BBQ chicken and I go to the bathroom and look in kitchen and they have big plastic bin of raw chicken just sitting on a bottom shelf underneath a prep table... for who knows how long... keep raw products refrigerated... this place should be check by health dept", "author": "Chris T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-01", "description": "Ordered bun rieu. It was my first time there. My bowl was nice but the soup was bland. I don't think I'll be coming back.", "author": "Joe T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "I ordered number 22, the combination pork banh mi. A good sized sandwich, with the bread being perfectly crispy on the outside and warm and soft on the inside. Not too chewy either, which is what I dislike about bad banh mi' s. The inside was sweet and flavoured well, the meat was tasty. I also got a thai tea. The whole meal cost me $8, which was fantastic! Definitely coming back.\n\nI recommend anyone who visits takes the bus, because parking, although not the worst, looks pretty bad around there. The 14 muni stops right in front; it's so much more convenient in my opinion.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": ".......Everything is delicious and reasonable. The Vietnamese milk Coffee is great as well. Food here is my taste so that I can't find somewhere else better than this one in this neighborhood......", "author": "Anh N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-03", "description": "Oh my god, their pho is too salty. On top of that, their services is unbelievable slow.", "author": "Aniko N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Best Pho, Banh Mi, and imperial rolls in the Excelsior.  Sometimes online orders don't go through properly so I just call the restaurant now. Other than that, it's a great place.", "author": "Scott V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "I ordered a large Pho Tai and a chicken Banh Mi to pick up and the total was under $14.  The Pho was really good and the portion was very generous - enough noodles and broth for two meals, but only enough meat for one.  The meat tasted very fresh (it was packed raw in the container with the noodles (wrapped separately in plastic).  The chicken Banh Mi was totally standard, the bread was a tad more like a french roll than traditional Vietnamese sandwich bread, but still really good.  I'll order again because of the value, fast preparation and freshness!", "author": "Emma H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I love this place. It's new and different from the pho places I usually go to, but after the first time I tried it, I've been back many times. The pho is good and the service is pretty good also. They have an awesome combo deal where you can get a Banh Mi and a large Combo pho for under $14. Both are super tasty!", "author": "Corinne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "O. M. GOODNESS....  They have the best beef sandwiches in SF I have ever had (beef, carrots, and some more stuff on an deliciously toasted roll, and I never really like carrots much let a lone on a sandwich but they work!!!  )! I have to get them when I am in town and need to eat.... Ok maybe not need to eat, because I am never on this side of town and drive usually from the other side! Last time I tried something new.... I don't know what I ate but it was soooooo good!!! It was a soup, a huge bowl of soup! It was so good that I hurt myself a little bit because when I made it halfway thru the bowl and half of my regular sandwich I still continued to eat because it was soooooo good. My stomach hurt afterwards. So I had to walk to the corner and actually walk up and down the hill before I could go. I was not able to exercise self control well at all, and I am usually real good at that. The customer service is really nice! Very pleasant family feeling place, it feels like a mom and pop place, you know family owned business!!!", "author": "Angel A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-27", "description": "I orders their vermicelli and an fish cake roll and a coke \nWas disappointed that the fish cake roll had so much mint in it it overpower everything \nThe vermicelli also had mint which I had to remove \nThe pork in the vermicelli was very dry and tasted burn \nThe worst thing is all was soda was expired and the still sold it\nAlso they had forgotten to give me utensils for my takeout order \n\n\nWas very disappointed by their food", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "I think I found the best bun rieu in San Francisco.  Hefty portion, flavorful broth. Everything on the menu is quite reasonable.    Will definitely go back again.", "author": "Eva E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Always fresh and welcoming the flavors are mouth watering thanks for the smiles when I walk in,good food but better yet great owners makes it a 5 on my book!", "author": "Cardenas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Price and portion size is good will come back every time when I am in the area. \n\nThis time I for the combination pho and bbq chicken sandwich. The chicken sandwich is surprisingly high quality and pho is pretty good!", "author": "Oliver K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "The papaya salad is very tasty and healthy, a lot of diet fibers, the spicy beef needles are also good and unforgettable", "author": "群"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Decent pho near the area. The chicken pho is not the best but the regular beef pho is solid and hits the spot when you need it. My friends and I come here when we're too lazy to go all the way into SF where our other fave pho places are.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "Walked in. Place was empty. We were seated and then ignored for the next ten minutes. A woman was behind the counter making sandwiches, but two men were back there just milling about. Walked out.", "author": "Kris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "For the price the meals were decent.  I thought the plates didn't have enough meat.  The peanut sauce for the spring roll was too sweet for my taste.  Overall a typical, standard Viet restaurant, nothing memorable bad or good.  It's average.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "Simple menu...\nBasic rice plates, phò, appetizers, banh mi, & drinks. \nIt's not the best in town, but it's definitely good enough to kill the phò cravings. Not my first choice to dine in. My go to place when I'm otw home and need to pick up something for dinner. Fairly priced, food is ok. I think this place can last a long time.", "author": "Mono L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "So happy to have found An Chi!  We had a family lunch here, ordered the pho special, chicken pho, cold vermicelli noodles dish, bun bo hue, five spice chicken and a side of imperial rolls... everything was good!  Place is pretty clean, staff were nice and prices were reasonable.  Lots of people were ordering the banh mi sandwiches so I have to come back and try those next time.  Definitely recommended for a casual quick meal.", "author": "Le T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-26", "description": "Bland ass pho. Does not deserve 4 star rating, more like 1 because that shit taste like watered down Campbell's soup with some gamey ass beef. \n\nThe water they serve is straight up tap water with no ice cubes.  I ordered an original pho Dac biet large but they just served it in a big ass Bowl with stiff noodles and really chewy beef.\n\n\nIf you are looking for pho that is convenient, don't come here, make the drive elsewhere.   This is honestly the worst pho I have ever eaten.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Heard about this place from a friend so decided to check it out. Service was great and place was very clean. Ordered the pho and banh mi combo. For $12, I think that's a deal. Pho was very hot and tasty and sandwich was really good as well (nice meat to bread ratio). Would definitely go back again and also will definitely recommend.", "author": "Raymond C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-26", "description": "Tried their pork sandwich. Once and never again. Extremely salty and bread was not crispy. \n\nAll show no go. Ha ha.\n\nAlmost forgot $5+ for a shitty sandwich.", "author": "Thomas N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-03", "description": "I was so excited when this place opened near my house  since I tend to go all the way to Clement for good soups& Sandwiches. \n\nThe service was great. We had our food to go, and were greeted when we went inside the place. Staff was very friendly over the phone & there. \n\nI ordered the chicken noodle soup, crab paste and tomato vermicelli soup and  a chicken bbq sand which. The crab paste tomato soup was cold when we got it, so we had to reheat it once we got home (about 5 minutes after picking it up). I could not eat the chicken noodle soup. Once I poured it into a larger bowl i got a whiff of the chicken and soup and It smelled disgusting, almost like rotten eggs or a milk spill inside your car that's been under the sun for the whole day. I don't think they washed the chicken, they just placed it into the pot to boil. I had to throw it away. The bbq sandwhich was okay, the chicken in it didn't reek. \n\nI really wanted to like this place since it wouldve been super convenient for me to get my fix here. \n\nAlso, the parking sucks so id recommend you go with someone or just walk.", "author": "Veronica N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Fantastic place with friendly service. Good local hole in the wall restaurant with delicious food.", "author": "Sam I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Rare beef pho was huge. It's wasn't the best I've had but it was delicious and amazing value", "author": "Rich C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "Been here probably more than 50x since it opened so I think it's time to leave a review. This place is really great, an awesome addition to the neighborhood. \n\nSome pet peeves of mine from popular \"factory\" pho restaurants around the peninsula:\n- sticky sauce bottles\n- watered down Sriracha/Hoy Sin Sauce\n- broth just barely hot when served\n- really dry throat after eating (broth likely supplemented with MSG)\n- noodles not Al dente/mushy\n\nAn Chi is NONE of those things. This is a quality establishment. \n- the broth is light without being bland\n- the price is still reasonable (they raised prices maybe 6 months back) Good portions and the pho + sandwich combo for 13.XX is a bargain \n- the owner brothers + the entire staff are very nice\n\nPerfect for this winter season. In fact, after this review, at 9am when they open, I'll make my usual 7 minute walk down there to get me some pho.", "author": "Gary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Very bland pho.... Dishes are heavy on noodles and low on substance.  Spring rolls ok.  Decidedly mediocre Vietnamese food, better options around!", "author": "Mana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Yummy Vietnamese food. The price is reasonable, the food is good, and the owners are nice.", "author": "Gerry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "This is literally one of my favorite restaurants in the city. I go here 2-3 times a week. Great Vietnamese food and excellent customer service. Great meals under $10. They deliver food too. I've placed large orders here for delivery in my line of work as a pharmaceutical sales rep. My clients love the food. Bomb delicious springs rolls. Combination beef chicken pork salad rice plates. Pho. All the good stuff. I'm their #1 customer now. They hook me up with free desserts . Hope nobody takes my place.", "author": "James N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Newly opened and looking good. Modern and clean  ++ Ordered imperial rolls, lemongrass pork chops, combo beef noodle soup, bbq sandwich, Thai tea and Vietnamese coffee. Get the large bowl of pho, delicious! Broth yummy and great quality meats. Will be back. Came on a Monday at 4:45. Parking a bit tough. Service was quick and super friendly. I heard the staff say they aren't doing much marketing until all the kinks have been ironed out. Good business sense. They will do well. We will be back.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Great foods and service! I always get their #1 noodle. Yummy! This place is very convenient just right next to 14 bus station on Mission street.", "author": "Meiteng L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Stopped by a friend's house nearby and saw that this place just grand opened. Decided to stop by and check it out. My friend ordered the #2, and I ordered the BBQ chicken sandwich (forgot the #), the deep fried imperial rolls plus a Vietnamese coffee. Everything tasted pretty good, especially the deep fried imperial rolls (cha gio)! It's made the traditional way which I really like!! I can only name a few restaurants that makes it that way. The Vietnamese coffee hit the spot! My friend liked pho as well, I will try that next time. I ended up getting full before I got the chance to try my sandwich. Definitely a nice addition to the area but parking is a bit tough.", "author": "Cheryl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "I stopped by before close and my party of 3 really enjoyed their meal with no complaints. We got the #1, 3, and 6 (combo beef, chicken, bun bo hue) along with some Viet coffee. Service was extremely prompt, and food came out great -- tons of flavor with rich broth. Way better than Pho Nice down the block. Normally after pho from Kevin's, Turtle Tower, or Pho 2000 I'd have to drink tons of water because of how much salt they pack into their broths, but I didn't need to after this meal which at the very least, tells me that they don't confuse salt with flavor. I'd definitely make this my go to for pho in the neighborhood because of their taste to price, service, and general cleanliness.", "author": "Zhi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "They make very good and delicious pho and veit sandwiches! They open early morning too which is good if you wanna get a warm pho for breakfast or a good sandwich. Moreover, the place is very net and organize. All staff are very friendly and quick order! I recommend this place to anyone who wants to try good pho! The place is easy to find too!", "author": "JeHsz Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "We're looking for pho around the area and decided to try An Chi. They have a awesome pho and Vietnamese sandwich combo for only $12. The pho is big and the soup is perfect. The soup is not too salty and not too bland, just right. The pho have a lot of beef balls and beef tripes! My hubby is not a big fan of Vietnamese sandwich but he said the sandwich here is really good. We also order a grill pork spring roll. The sping roll is as good as the other pho place but I love their dipping sauce. Their spring roll dipping sauce is so good and not too fishy salty. I will definitely come back for more!", "author": "Shelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "I tried this place last night. I ordered the beef pho and it was pretty good. It was a little too sweet than most other places which I didn't like. If they decreased the amount of sugar in their broth, then it would be so much better! I also got an order of the imperial rolls which were good as well. I wouldn't order them again though because $5 for only 2 egg rolls is pretty pricey. I'd rather have another egg roll than the side of noodles they plate with it.\n\nOverall, it was good and I would come back again for sure but only for the pho. I'll try the chicken pho next time!", "author": "Patricia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-20", "description": "Pork chop was tiny, service was poor. When they brought out beef broth instead of chicken broth, they didn't apologize. Then when they finally brought the broth out at the end of my meal, they didn't acknowledge their mistake. There's a ton of better Vietnamese places better than this", "author": "Jon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Delicious and cheap food in a clean dining room. Very glad to have this place so close to my new house. So far I've had the pho tai, spring rolls, and bbq pork banh mi. All spot on. Both times I've been there were really hot days and the staff was very attentive and kept our waters full. You don't get many 100° days in SF! I definitely will make this a regular spot", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "My sister and I love Vietnamese food so we like trying as many spots as we can in the city, especially those places with bun rieu! We happened to come here after my nail appointment a few blocks away and came across this place via Yelp. It wasn't crowded at all and we got a table immediately. They have all your Vietnamese food staples like imperial rolls, pho, rice plates, vermicelli bowls and even Viet sandwiches! We both went for a bowl of noodles; me the beef pho and my sister got bun rieu. both at 8.50 each, both large which is a  really good price! They only offer the large option for bun rieu and for the beef pho they have a regular size also which is an additional +$1. The large bowls here really are big! I had so much leftover noodles but the meat and broth were soooo yummy with tender meat and broth is not too salty. This was perfect for the usual SF foggy weather. Not to also mention this restaurant is really clean! I would totally come back here again when I'm in the area since I don't visit this part of the Mission much.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Found this brand new Vietnamese restaurant for pho and banh mi right at the 14 Mission bus stop.  Glad they open early at 9am daily.  Who doesn't love piping hot noodle soup on cool San Francisco mornings?", "author": "Wendel T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-01", "description": "Sandwich are okay and the prices are good though I don't like the bread of the sandwich. I ordered a Vietnam coffee for about $3.75 and it was less than half of a grande cup?!?!", "author": "Danyang W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "So happy there is a decent pho place in the mission! I had the Bun Reui, it was delicious! The broth was aromatic and it was plenty! Will be coming back to try the Bun Bo Hue.", "author": "Alyssa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Ordered the pho and banh mi combo for $12. The pho was an extra large so I had to take the banh mi to go. I'm impressed. I'm Vietnamese and I'm picky about pho. It was good and so was the banh mi. Definitely coming back.", "author": "Leilani L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-08", "description": "(Sea Food Noodle Soup to go, large, $10)\n\nGot my standard pho dish for any Vietnamese Restaurant: Sea Food Noodle Soup. Unfortunately less than impressed to the point where I could not finish it.\n\nBroth has no flavor,\nbarely any seafood inside dish (3 shrimp, two and a half fish balls, and one small piece of squid). \n\nOnly thing cooked well in the dish was the noodles, but due to the lack of other flavors they did not bring anything new to the table.\n\nI was excited for a new Vietnamese restaurant in the neighborhood, but I cant honestly recommend this place to anyone after the dish I was served. Was only given one small packet of hoisin sauce which with the quantity of liquid in the dish does not serve any extra flavor profile.\n\nIf you are looking for a Vietnamese restaurant in the neighborhood, I would instead refer to Mission Noodle House. They [mission noodle] are not at all the best pho in the city, but they are a far cry better than what I experienced today.", "author": "Alexander F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-23", "description": "Less than mediocre Vietnamese food. The meat quality in the pho is pretty low.i ordered the cha gio but they never came. The server didn't seem to care at all that she got our order wrong.", "author": "Joann C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "I ordered through uber eats. My pho arrive hot and tasty. The only reason they received 4 stars was because there was not much chicken in my soup order. I also ordered imperial rolls. They were perfectly cooked. I would like to try dinning in after my delicious lunch.", "author": "Gabriela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Great place! Alex the owner was awesome. Get the combo a large pho and bahn mi for $12!!!", "author": "deliA p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "I've been craving pho for a while in San Francisco to get a warm hearty meal whenever it gets chilly outside. \n\nI got the combination pho for $7.5, which is arguably pretty cheap. The broth surprised me with its subtle flavors and it definitely made me warm and completely satisfied. The meat was cooked nicely and I wish they had included a bit more to complement the large amount of noodles in the regular sized bowl. All in all, this place is a nice addition in the area.", "author": "Anson L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-13", "description": "Ordered two items over the phone for pick-up at lunch. The lady taking the call confirmed the two items that I wanted and confirmed again that there were two items. I paid for and picked up the order, only to find that one of the items was missing upon returning home. I called back twice to explain the situation and was transferred and hung up upon. There are so many good Vietnamese places along the Mission corridor, this lack of attention to detail, rude staff, and poor customer service should not be tolerated.", "author": "Ross C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "Portion seemed generous until you notice they pad a lot of noodles instead of giving you a fair amount of meat.\n\nBroth was pretty bland.\n\nWorse part and congratulations by the way for being the only restaurant that made me throw up, I suspect it's either  the bean sprouts or the beef as both tasted off.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "Bun rieu broth tasted like water. Whoever thinks this is good bun rieu has obviously never been to San Jose. I asked for shrimp paste to add flavor, but then it just tasted like watery shrimp paste. DON'T BE FOOLED!!\n\nThough, I will say the imperial rolls were good.", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Finally a Vietnamese neighborhood restaurant that is enjoyable. Nice and friendly team. Well priced, quick and straight forward menu. Only one thing is missing .....a couple of vegetarian options especially on the soups and rolls.\nI was told they are working on it. I really hope they will.", "author": "lucia f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "Went there to get pho couple of weeks ago.  It is suppose to be a new restaurant.  Pho was solid and priced fair.  Will be returning to try other items.  Service was friendly and good but keep in mind I went late around 2 pm so it wasn't very busy, only about 6 other customers...  I actually wanted to try porkchops first but they said they didn't have it.  Then I asked for lemongrass chicken over rice (was craving for rice that day) and they also didn't have it.  Pho was my last choice that day...", "author": "Frank M. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "I randomly found this place while going to the bank haha. I was in the Excelsior district looking for a quick bite and stumbled on this awesome pho place. I can be picky when it comes to Vietnamese pho noodles because I am particular about the taste of broth and texture of noodles. This place offers a great combo deal which includes a big bowl of beef pho with your choice of a sandwich. The food is excellent and the quality is definitely there. This has become one of my favorite pho places. Very reasonable prices and good tasty food. I hope to try out their other dishes in the future like appetizers and rice plates.", "author": "Ming L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "We love their Bbq Pork Sandwich and Fresh Spring Roll with Shrimp!  Rice plates are great as well!", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Came in for dinner last night with the family and I think we found a new go to pho place to go.  The restaurant was clean and the prices were very reasonable. Portions were LARGE.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "This place is pretty good pho place if you live around the neighborhood or don't want to far out the mission area. I was recommended by a friend who eats here quite often and it was awesome food, Good pho and rice plates. I ordered pho with rare steak it had good flavor and a lot of noodles I came out full and happy. I would definitely recommend anybody to give this place a try!", "author": "Tommy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "This restaurant just opened! A convenient location by my house. Great food and service! Definitely will come back.", "author": "ABC Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "I dropped by a few months after they opened. The folks running the place are really nice, and the place is great. Very clean with a bit of a modern feel, and the food was on point. I got the pho ga, and it stood up to Turtle Tower (Tenderloin location), which is high praise. Chicken pieces were high quality, broth was clean and flavorful (e.g., not greasy or cloyingly sweet), and portion sizes were good. There's some nice combos too (e.g., Pho with a banh mi) that I'll definitely try when I come more hungry.", "author": "Ray N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Their BBQ pork sandwiches are perfectly balanced. On par with the best I've had in San Francisco", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "The pho was yummy! The staff was incredibly friendly and the location was really clean. Everyone was sweet. Added bonus is its so close to my house. Definitely will be a regular!", "author": "Alicia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Really enjoyed the pho here. I got the combo beef noodle soup in large for lunch and felt stuffed afterwards. Definitely worth checking out- I will be back to try their other menu options", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Nice food, nice brothers that run the shop. We're very glad to finally have a decent Vietnamese restaurant in the area. Pho, bun, etc. were good! No more need to drive all the way down Ocean anymore!", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Just saw a grand opening Vietnamese restaurant in my area. I ordered egg rolls, pho and bun bieu, the foods so good, the egg rolls is so crispy and the noodle soup is delicious, and the portion is so big. Moreover, the Vietnamese coffee tasty like hazelnuts favorite is so yummy. They serve good food with good service, so I highly recommend this restaurant to you!", "author": "Gill L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-25", "description": "This new place is lacking. Bun Rieu was flavorless. Basically water with a teaspoon of paste. The crab meat was foamy like fake/ not your normal paste. Anyways, their spring rolls were lacking shrimp but probably because of the price too. They cut it in half but did not bother to take out the black stuff... gross. Their sandwiches were mediocre; lacking taste and meat. But again that's why the prices are low.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Excellent services, foods taste delicious, and a very clean place to dine in. I would like to recommend their \"Bun Thit Nuong Cha Gio\" with their special fish sauce!", "author": "Ricky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Pho broth is authentic and rich. Service is good and friendly here. Right next to the bus stop and at a convenient neighborhood. Recommend and will go there again soon!", "author": "Yun L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-26", "description": "The food is okay the service is good but the Quantity is Medium less meat than the normal Vietnamese restaurant .", "author": "Jose C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Food was delicious and service was great! I loved the vermicelli with pork and spring rolls! Prices were very reasonable. I can't wait to come back!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Ordered to-go from here today to try out this new Vietnamese restaurant in the neighborhood; I mean, who doesn't like pho on a rainy day!?  I ordered the #2 pho-rare steak pho size large and when I got home, I was so disappointed in how small the serving was!!!  I couldn't believe it was a \"large\" sized portion because I ate it all and was still hungry and I've never been able to do that ever...at any other Vietnamese restaurant!  I did not have an abnormally big appetite or anything today but considering the restaurant is still new, I hope they are still working out some kinks and I hope portion size is one of them.  I will give them a try again later on because they are a neighborhood restaurant but hopefully won't be disappointed again.", "author": "judy l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Quality pho broth, perfect imperial rolls & tasty sauce, crunchy sandwich with quality ingredients, friendly service + so spacious. 10/10 will go back again. Glad to know this place.", "author": "Pammy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Very good. A lot better than the spot on Geneva and Mission welcome to the Excelsior An Chi!\nNo get a beer licence and you'll get six stars!!", "author": "Phil B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Excellent sandwiches. The place just opened (January 2017).  I had the BBQ chicken sandwich and I will definitely come back to have it again. Price was very reasonable too", "author": "Rusty S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Came here on a Sunday afternoon and had a great experience. Small family owned restaurant featuring Vietnamese food. Ordered the Pho Combo with Banh Mi $12. I have to say though the broth was lacking in flavor and the banh mi was small in portion, but it wasn't too bad. Great service, friendly staff. I'll probably come again when I'm in the area.", "author": "Fion H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "The soups are amazing and full of flavour. The atmosphere is not fancy but the food is so good. Prices are reasonable too. Food was awesome would definitely go there again. All four of us were very happy with our meals. Nice and close to where we were staying", "author": "Charles A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Awesome egg rolls, tasty flavor beef noodle soup and chicken Vietnamese bread...so good that we forgot to take the picture...totally recommended", "author": "Gigis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "i was gonna originally give this place only one star. the tables were dirty. there was food in my cup of water. the cleaner they used for the tables smelled like an old man's armpit. ,,,but the food...god damn. sadly i'm gonna wash down this wonderful meal with a shake from mcdonalds:/ but oh well. it's a bop in there and the staff was super nice and did everything they could to make sure your order was up to par.", "author": "Xavier L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "I was excited to see a new pho Vietnamese joint here.  Based on the previous reviews I figured that I'd at least give them a shot.  Ordered the pho tai and I thought it was nothing special but fair.  The soup could have used more noodles, it was quite stingy for a large size.  The broth was just ok, it was sufficient enough to eat I guess.  At this point I'm willing to try again in the future.  Yesterday I was craving pho and since I saw this place opens @ 9am, I remembered I told myself I'd give them another try.  I'm sad to say I was less enthusiastic than the 1st time.  I ordered the pho/bahn mi combo priced at 12$.  Yes the price is nice on the wallet, but the soup was absolutely terrible this time.  As the waiter brought it too the table I noticed a pungent fish sauce smell.  I know that fish sauce is used to flavor the broth but this was going overboard.  I've never been able to smell fish sauce emulating from my phos elsewhere.  I tasted it, whoaaaaa, it was nothing remotely close to a pho beef broth.  It was str8 fish sauce salty city.  I barely got through a quarter of it.  There was no hint of star anise, cinnamon, and others.  It was totally masked but the irresponsible use of fish sauce.  The bahn MI I got was beef, and it was sub par at best.  This place will not get a third chance by this customer.  This is sad because I really wanted to have a go to pho place in the excelsior/outer mission area, which there is none.", "author": "Pedro N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "First time eating here. Food is great. Service is excellence. The place is really clean. They just open about 4 months ago. This place is a plus to the neighborhood. Will be back for sure!!!!", "author": "Tary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Simple menu with traditional items that packs a ton of flavor. Fresh and piping hot food all made to order.. great food and nice location with a friendly staff!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "I really liked this place. My boyfriend and I live walking distance from it and we went for their grand opening. We had the rare beef pho, bbq pork spring rolls and they gave us imperial rolls on the house. Everything was delicious, even their tea which I'm pretty picky about. I definitely see us coming back here to get our pho fix!", "author": "Angie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "I drove by this place, yelped it and bookmarked it. We got to try it for the first time today and was very satisfied. I had the tomato crab noodle soup and it was very tasty. We also had the Pho, the chicken over rice with a fried egg and the beef over rice. We also ordered a side order of the  egg rolls. I really liked the skin on the fried egg rolls, its very different from the chinese egg roll skin. There are only a handful of Vietnamese restaurants that use this type of skin. Its thin and very crispy. The portions were big and the price so reasonable. The place is clean and the utensils were nice and new.  We will definitely be back!", "author": "Ravenous T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Came by when they're grand opening.  We ordered beef and chicken pho, and banh mi.  Nice and friendly staff as they customize my banh mi bread for me (I don't like it toasted hard).  Both broth tastes great but I like chicken pho more.  Will definitely come back to try their bun rieu as it's not on menu yet.", "author": "Toni H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "The soup is pretty okay! This place is pretty small and it's family run, so there is so little options for each category of food, but I tried the regular combo pho, and it was good. The only issue I would say is the big difference in size between regular and large.", "author": "Hannah C."}
