{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "Arabi is one of my go-to spots for lunches during the work week. This restaurant is a small hole-in-the-wall in the Rincon Center, but seating can be found in the area right outside of the restaurant.\n\nI usually get the chicken curry or chicken shawarma plate. Your taste buds will be delighted, since the food is spiced properly and is flavorful. I consider this place to be relatively healthy, since the food is not swimming in oil like some other Mediterranean food places. However, because of that, I find the chicken in the shawarma plate dry and have to cover up the dryness with a sauce.\n\nThe lady owner is extremely friendly and nice, and recognizes me as a regular. The prices are reasonable, especially for downtown SF!", "author": "Ganeev S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-01", "description": "Ordered the beef and lamb with rice. It comes with hummus, pita, salad and soup. The plate wasn't very good. The meat was dry and everything tasted that of a bad cafeteria food. The soup and rice itself was the highlight. I end up mixing the meat into my soup, to give it a bit of life. Perhaps their other dishes on their menu is a lot better, but I wouldn't get this dish again.", "author": "Mandy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "The chicken shish kebab was delicious. It might not look like much, but it was full of flavour, and permeated deep inside; it must have been marinated really well.\n\nThe yellow pilaf rice too was pretty tasty, and slightly zesty, and made for a very good combination with the kebab.\n\nIt came with a nicely seasoned yogurt dip which was just right for the half pita bread, and some steamed broccoli and carrots.", "author": "Umesh T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "I ordered the lame and beef shawarma plate from mealpal. One of the worse lunch I have around here.\nIt was very dry and no flavor and the humus do not taste the same, worst than the one you get from cheap supermarket.", "author": "Jay Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Love the owner here she's the sweetest! A little pricey however it's the financial district and I always make my own plate!", "author": "Kiana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "Excellent small walk-in cafe.  There is no seating inside but plenty in the court yard/mall in Rincon. Middle eastern fare with other breakfast type of items. Very clean and well-maintained restaurant and the staff is extremely hard working and friendly.  The food is really good.  I've only had the egg white scramble and chicken shawarma.  But all is good!!!!", "author": "Jill P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-30", "description": "I came here with my wife and a coworker of hers. I've been here before and found it adequate as far as food court food goes.  However, I'm writing my first review of Arabi because of the terrible attitude I received from one of the other ladies working behind the counter (not the register lady).  And no, it wasn't just towards me.  It was to other customers including my wife and her coworker.\n\nFirst lets talk about the food.  I ordered a falafel pita sandwich for myself and a Middle East Plate for my wife.  I ordered the ME plate and then also said I wanted a falafel pita.  So the rude lady whom I ordered the food made the ME plate and then I said \"I also ordered a falafel pita\".  Her face got really shitty in a second and she forcefully said \"You ordered this ME plate!\"  I responded professionally and said \"No, I ordered this AND a falafel sandwich too\".  After telling her that, she still had that sour face and handed me the tray.  I paid for it and the lady at the register was pretty nice.  \n\nAfter returning from the back to make my pita sandwich, the rude lady came back w/ the sandwich about 2 mins later.  When she handed me the sandwich, zero eye contact but still had that sour face.  Just held it out.  I took it and waited for the other customer to finish paying for his food.  While waiting, another customer behind me asked for some sauce.  Literally the lady slammed it on the top of the counter. The young African American woman I saw was startled by it and we look at each other and gave each other the \"WTH is that lady's problem?\"  After joining my wife and her coworker, I asked them \"Hey was it just me or was that lady rude?\"  We all agreed.\n\nOh yeah as you can tell, my main focus on the rude lady distracted me from talking about the falafel pita sandwich.  The falafel was cold, not freshly made and it was more lettuce than falafel.  I'm back at the office hungry, but I still brought it back.  But still debating on whether to eat it or not or go downstairs and get something else.\n\nI won't be returning again.  And if you're the owner of Arabi (I'm guessing it's the nice lady behind the register), you really need to tell your employee to smile, be courteous, etc.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-12", "description": "I went here for lunch and ordered the lame and beef shawarma plate.\nIt was very dry and not flavorful, the rice was the same. As well as the humus taste was off and the tzatziki was so watery. I will not be going back.", "author": "Micheal M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-07", "description": "I've been here twice for lunch, good service, the food is good as well. Would give it 4 stars but the coke I bought with my meal expired 7 months ago. \n\nThis is downtown SF in a popular food court. How do you have Coca Cola that is this old?! I'm upset they sold me that.\n\nStill an A-Ok lunch spot.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Omelettes and yes falafels!\n\nSince my last review I have discovered that Arabi makes omelettes too! To make it even better, they make their omelettes the way omelettes are supposed to be made; with real eggs and fresh ingredients! The size of the omelettes are huge, which may not be good for my waistline, but heck, it is not like I am eating omelettes everyday, so what is an omelette here or there?!\n\nWhile I was waiting for my omelette the nice lady who is the owner and operator of the business handed me one of the hot steaming falafels they were making from the scratch. Oh my goodness! Falafel has never tasted so good to me! I wish I had asked for some kind of a falafel omelette! why not?! A few falafels, some spinach, cheese and eggs on top! Come to think of it, that is a great idea,   maybe I ask for it next time, the hell with the waistline!!", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-03", "description": "I went here for lunch today to get the lamb shank Wednesday special, by the recommendation of a couple colleagues. What I didn't realize was that Wednesday Special meant that lamb shank was only offered on Wednesdays, not that it was cheaper than usual. I looked at the receipt afterwards and to my disbelief I paid over $14 for a lamb shank, some rice and vegetables, and apparently a cup of soup. \n\nFood:\nThe lamb shank I ordered was really good! Definitely a flavor I hadn't experienced before, and the meat was very tender and easy to eat with a fork and knife. I had it served over some lentil rice, which also had a nice blend of flavor and texture, and paired with the vegetables and meat quite nicely.\n\nService:\nService seemed to vary. The cashier was super nice and chatty with everyone she interacted with, but the woman gathering the food and putting it into the containers seemed upset when I didn't know exactly what was going on. There also wasn't much explanation as to what was included with the lamb shank. My colleagues got different sides (pasta salad, something else) with their identical orders but I was only given the option of soup or salad, so I'm not sure what happened there. The woman serving also dropped a couple vegetables out of the bin and missed the container, having them end up on the (sanitized) counter beside the container. She just grabbed them and threw them back in, but missed a couple and still moved on. Was I cheated of some potatoes!?\n\nRecommendation:\nThe food was good, but seemed inconsistent between myself and my colleagues. One person's container was filled with food but also almost overflowing with grease and other juice, which made for a soggy and messy meal. My meal was fine, but the portion size was not worth the money I paid for it. It was definitely a unique flavor and style of food but not worth visiting more than once to experience it, if that.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-02", "description": "The lamb shank is the only one entree to be worthy to get here.  That is only served up on Wednesdays.  Their other meat choices, were too dry and not enough flavor.  \n\nThey give generous portions and I did like their cold pasta salad as well as their dolmas.  \n\nTheir sauce and quality of their dishes, doesn't entice me to come back for more!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "I cater from this place for work meetings often. The customer service is always great, and the food is always on point. I can't speak to their meat dishes because I always cater vegetarian, but the vegetarian food is very very good.", "author": "Marina O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "I wouldn't go as far as saying \"mouth watering\".   Well far from it.    But in generally not bad.  Except their kabob meats are dried out.  The seasoning is ok. Not the top.  But they seriously have to do two things.   Not dry out the meats (especially the chicken).   And secondly try to make the pieces of chicken a bit bigger.   They're thin and dried out skewers.     Rice and vegetable quantity is good.   Hot sauce is good- unique.    But for almost $12 for lunch dry and chewy is not right.  Real kabob should be juicy and should have a nice bite to it.", "author": "Tony P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "If I could give this place more than 5 stars I would. The food is absolutely amazing and I highly recommend people coming here!", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Delicious mouthwatering food!! Highly recommend this place if you like middle eastern food, falafel, and chicken shawarma. Reminds me of my grandma's traditional cooking.", "author": "Carolyn E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "Very solid place in rincon center. They have daily specials for lunch and their breakfast is also a very tasty option where they utilize gyro bread instead of tortilla/muffin/toast which is pretty neat.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "I've been here many times, but this last time was the last time for me.\n\nI walked in as the employee was finishing up helping someone else, but instead of helping me after she decided to stock lids. After standing there waiting for some assistance, she finally asked what I wanted. \nI had to repeat my order twice because even after I asked for the kabob plate she continue to stock lids.\n\nAs she was finishing putting my plate together, I asked for hummus as I pointed at it! But this employee went to the back pulled a tub out and gave me some red sauce.\nMind you, the cashier helped and rang up two other people, who arrived after me as this employee was in the back.\n\nAs I was stood there wondering what was going on, the cashier told me she was grabbing me a red sauce that was really good...? Hmm..I asked for hummus. The one directly in front of me..\nI did not eat the mysterious sauce and I won't be back.\nIf it's too much of an inconvenience for you to serve me I'll go elsewhere for lunch.", "author": "Reb _."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "If you're looking for some food that reminds you of a homemade meal then Arabi is the place to go. This food reminds me of my mother's meals when I was a child. Coming here is more than satisfying, it's nostalgic. The owner is the nicest woman you could meet and makes sure you are more than well taken care of. Definitely a place I would come to more than once in a week.", "author": "Anwar M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-03", "description": "Half a chicken, rice & soup for $10 - not bad for the financial district.\n\nThe chicken was a bit dry and not enough rice - but all was tasty. The soup was a type of tomato soup, which was nice to warm me up on a cold day. Probably will give it a try again, but order something else since I work right upstairs.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "I've been here twice now and both times I got the same thing, the Wednesday special - Lamb Shanks. \n\nLamb is a really underrated meat and they do a good job of making it. Flavorful, tender, and entirely delicious. If the rating was based on just that Arabi would have 4 stars, but I have to factor in the sides that come with the meal. \nChicken Soup - barely any chicken and vegetables practically mush. \nHumus - surprisingly bland and off putting. \n\nNext time I'm going to see if I can just get the shank, because while everything else is a pass I'm coming back for more lamb.", "author": "Boris K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "My coworker and I decided to venture out for lunch instead of dining upstairs in our cafeteria. I never been tried anything at the Rincon Center so I decided to branch out and try Arabi food. It reminded me of Greek food but only less delicious.\n\nFirst off, the food is heated up in the microwave! Secondly, I was overwhelmed by the sheer abundance of spices. Last but not least, the meat was dry and mealy! \n\nI wish I could say I liked this place, I am after all a big sucker for small mom and pop shops but the food just did not deliver. \n\nOverall Thoughts\n\nQuality control and execution is lacking. With a little refinement there might be hope for Arabi", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Really fresh, delicious, healthy food with lots of variety. I like the chicken skewers with steamed vegetables and beets. The salads are delicious and the falafel is perfect. Love the hummus.", "author": "Lori S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-15", "description": "Meh. Extremely mediocre, bland, very salty overpriced food. Just what one would expect from a food court. The falafel is fresh but not warm and basically consists of lots of batter filler with hardly any beans, no spices and no flavor. Ditto for the tabbouleh, hummus and baba. Just being prepared recently (the only reason I rated two stars instead of one) doesn't cut it. So flavorless. And the pita? Pretty sure it's Thomas's or Pepperidge Farm. Bread is key in this cuisine and I would be embarrassed to serve this Midwestern grocery store quality pita. I adore middle eastern cuisine, it is a huge part of my heritage. And honestly there are not many good options in the Bay Area like there are in LA, Chicago and the Northeast. \nI like to give places a chance, but I have now been disappointed by Arabi three times and I won't be back.", "author": "Jennie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "If you're lucky it's a Wednesday and lamb shank is the special. Usually, the special is whatever a restaurant is trying clear out. In this case, it is truly special. This is coming from a person that hates food courts. Don't let the humble food stall and signage scare you off. This place is legit. This is no corporate chain, serving you dumbed down ethnic food. This is the real deal, ostensibly prepared by real mothers. The lamb is perfectly moist and pulls off the bone with the gentlest touch. It's rich and fatty in the best possible way with crusty caramelized bits in all the right places. 12 bucks seems a lot for lunch, until you realize you're getting a hearty dinner portion with a soup that's just as tasty as the main. No afterthoughts here. Just soul-satisfying homestyle food.", "author": "William B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-30", "description": "Overpriced and generic, served cafeteria style. I found the staff to be a bit short-tempered and the menu inconsistent from online to offline. I work right upstairs and love this type of cuisine when done well, but doubt I will be giving them another visit any time soon.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Great middle eastern food from wonderful people. The falafel is just the right spice level, the hummus is creamy goodness and the rice with lentils is out of this world.\n\nI'll be back many times!!!!", "author": "Adam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "When I work up an appetite biking to work, the shawarma plate over hummus with included side salad is the best option downtown for a healthy and protein-packed meal that fills me up for the afternoon. \n\nAll the Mediterranean classics are good (hummus, babaganoush, tabouli), plus good grilled meats. Falafel is okay but usually not as fresh as Sunrise which does more turnover, but all the sides are way better, and service is faster. \n\nIf you frequent healthy lunch spots near Embarcadero and you're not in the mood for long lines at Mixt Greens, high prices at Heyday, or a quinoa bowl that leaves you looking for a second lunch, you should give Arabi a try for great taste, value, healthy ingredients, and fast and friendly service.", "author": "Boaz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "TGIW. Lamb shank Wednesdays. Comes with a 1/2 pint of salad/side of your choice - there are a lot of choices.\n\nNow I look forward to Wednesdays.", "author": "Vena V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Outstanding food, fresh and supper flavorful. I was really surprised of how fresh and tasteful the food was! I'm definitely coming back to try something hong else!!!!", "author": "Dene T S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Took a journey from pleasanton to embarcadero to see what their famous lamb shank is all about. I was told wonders about it. It's available only on Wednesday for a limited time and sells out within an hour and a half. \n\nFirst bite and I was blown away. This lamb shank earned my first review on yelp. Lol.  It's the absolute amazing thing I have indulged in. Huge portions, rich in flavor, and it's incredibly moist it falls off the bone!\n\nCustomer service is amazing! I had called earlier and didn't leave any information, then as I was almost around the corner from leaving the Bart station the lady from Arabi called to see if I was nearby to let me know they were closing within minutes. I made it just in time and she was super friendly despite having to close shop so soon.", "author": "Jenee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "I support this small business but I don't support Rincon Center relocating smaller businesses to undesirable location and month to month leases. Renew your options before the due date. Read the fine print.\nTinyurl.com/keepTheo", "author": "Theodore H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "I am surprised there are only 60 (now 61) reviews for Arabi.   And after reading some, I'm surprised at all the negative reviews.  I did NOT notice a microwave (perhaps this was the previous owners way of cooking dishes), I did however notice a GRILL.  Notice most of the reviews are OLD and outdated . . .  give this place a try, you will be glad you did.  Now for my review. . . \n\nFor several years now I have been shopping for lunch at the Rincon and I tend to be a person who does not venture out far from the tried and true.  SHAME ON ME!\n\nToday, as with every other day of the work week, the lines were freggin RIDICULOUSLY long at all the tried and trues, I decided to try Arabi - and I am sooooo GLAD I did!  \n\nHonestly I have overlooked Arabi so many times in the past based on one reason, they are next door to the WANNA-BE Indian restaurant (which if you care to read, I've reviewed).  Lord have I been missing out!!!  Seriously, I truly made a bad decision based on the unknown.  \n\nArabi hands down has the best AUTHENTIC Mediterranean food in the area - I am very impressed with the variety of FRESHLY made salads, veggie and meat plates.  The Med-salad was so delicious I had a hard time parting with the dressing.  Seriously, the med-salad was that good!  I think what I loved most, it was SPICY!!!  \n\nI LOVE SPICY food, and I cannot tell you how many times I ask for spicy and I get lemon.  Arabi gets SPICY PERFECT with its exchange of the lemon zing and the zam of the jalapeno pepper.  \n\nWould I recommend Arabi - ABSOF_CKINGLUTELY!!!!  you fill in the space.  8^)  Oh, and give them a try, really, the food is that TASTY", "author": "Cris B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-11", "description": "Nice people however this is located in a food court with thousands of people and they never make enough food to even sustain the actual lunch hour. Salad and chicken are gone before 12:30. Waste of time even to walk over. No clue why they can't make enough food like every other restaurant in this food court.", "author": "Brenna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-17", "description": "I usually come here for the breakfast. They make a great egg scramble or breakfast burrito. However, the staff can be quite rude. They have messed up my order multiple times and get frustrated when I ask for my food to be fixed. I feel that I should mention this as it has happened multiple times.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "I don't know what I was served today. Either the server didn't understand me or she just didn't give a dang.", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-29", "description": "Wanted to like this place since I'm in the hood often. I've tried all the other places in the building courtyard and saved this one for last. Counter was friendly and helpful, prices reasonable. My wrap was just so dry it needed some sauce bad. I even thought they might have forgotten to put any in, but I did see evidence of some tahini in there . Lots of chili, which I usually like but just didn't work here. The meat seemed more beef than lamb and was disappointing. The tabouleh salad tasted old, that fridge slightly decomposing cucumber taste was just aweful. Maybe I'm spoiled with Truely Mediterranean on 16th street, this place just fell well short for me even to try again.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-22", "description": "Get:\nTheir salad lay out is impressive; tons of choice and they all looks delicious.\n\nAvoid:\nTheir Lamb Shawerma is seriously terrible.  It is shredded, mushy, too salty and just didnt' taste good AT ALL (i had to throw away 2/3s of my Shawerma Plate)...  I would stay away from these two items.\n\n\nHowever that being said, I actually would probably be back on a day i didn't want to eat meat for lunch.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-30", "description": "I ordered a Lam Shawerma over hummus with Soup, it was terrible", "author": "Elias S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Holy Moly. Their Lamb Shank special is DELISHHHH. \nthe shank is huge and its only 11 bucks. Great find!", "author": "Dee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "Review is for the lamb shank and breakfast burrito.\n\nOn the first and third Wednesdays of each month, Arabi has a lamb shank special. The shank is served over a bed of rice/couscous with two sides (free to choose anything from their salad bar, usually go for tabouleh and hummus) and pita bread. It is a TON of food and I think a great value for a little over $12. The lamb is perfectly braised and falls off the bone. The rice/couscous soaks up all the braising liquid and is exactly what you're looking for in a hearty meal.\n\nNow, for the burrito. Although I am a huge fan of Cicil's veggie wrap, if I'm in the mood for something a little more hearty, I'll go for Arabi's ultimate wrap with bacon. The burrito includes sauteed peppers, onions, potatoes, and mushrooms, your choice of cheese (feta, jack, cheddar), and a smoky and flavorful hot sauce. But wait, it gets better. They toast the burrito on the grill! It only costs $6.50, and you'll be stuffed until 2PM. \n\nFor all of the disappointed reviewers below, please do give the lamb shank and/or ultimate wrap a try. If you don't like either, reach out to me, and I'll buy you a Yank Sing pork bun! And if you don't like that, you have no soul :).", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-13", "description": "They are very nice in there, but the chicken schwarma wasn't.\n\nA typical lunch stopover, while my company was entertaining, we both left very sad with 1/2 eaten schwarmas.  The chicken was very dry, and overcooked, there was nothing tender about it.  The Lavish seemed stale.  It was quite a disappointment.\n\nThey get 2 stars, only because the staff was very pleasant and kind.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-22", "description": "Three of us dined here and none of us were even slightly satisfied. The things we ordered and recommend not to get:\nChicken kebab \nRice \nHummus\nShawarma with pita and lamb\nTomato soup\nEggplant salad \n\n.... The carrots were good.", "author": "Ava N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-06", "description": "They treated me so nice with compliments and jokes. I wish your beef/lamb shwarma wasn't drier than summer.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "Horrible food. Microwaved falafel was most likely left overs and the hummus was really stale in taste... Don't go there unless you want to get sick.", "author": "Yogesh J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Very good food, but make sure you come early! They generally run out of the salad early.  I got chicken kabob, very good, moist,salad and hummus.  The food is wonderful and priced well.  The staff is very friendly and welcoming.  The lamb shank looked awesome!  Will try next time.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "You know that feeling when you started eating at a restaurant over 20 years ago and you fantasize about their lentils and rice with the best carmelized onions you've ever had and you are in the neighborhood so you treat yourself to some just because you know that it's going to be just amazing as you remember?  Yeah, that.", "author": "Melinna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "Always happy to get breakfast burritos from here (sausage ultimate wrap). The sauce is special. The burritos are large, so I cut mine in half and eat half for lunch.", "author": "Charles D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-14", "description": "Quite possible the worst middle eastern wrap I have ever had!\n\n I walked in at 1:30, which is still lunchtime and they were out of almost everything. I asked for them to put hummus in my wrap and the ENTIRE wrap was hummus. It was soggy and impossible to eat. I just threw it away. With tax it cost me around $9. I can think of SO SO SO many other things to spend $9 on, and I am so mad at myself for giving this place my money.\n\nI seriously want my money back, but there is no website and no way to contact the owner. I wonder why!\n\nVery disgusting. The shawarma was shredded and dry, not like I have ever seen before. \n\nI will never go back, and neither should you. Do not waste your time here.", "author": "Alanna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "This place is very hit and miss. You have to know what it is that you are ordering and it can be difficult since most people are not familiar with middle eastern food.  Also, the ladies who work here have thick accents so asking may or may not get you an answer you can feel confident with. I do agree with other reviewers you get pleasant service but it can be a confusing experience. There is no formal line and the odd shape of the inside makes it hard to know who's next to order. For the order itself, you have to ask for specifics to know what it is. It took me two visits to remember to ask them to grill my shawarma. Otherwise, a shawarma is just a burrito.  \n\nI also bought a slice of what looked to me to be lasagna.  I figured out only after I ate it that it was eggplant and meat (who knows what kind).  It was interesting and ok. I am told people go there on Thursdays for such a treat.\n\nIt's never too crowded and again, just ASK and be persistent with explanations for how to get what you want.  If some of the display items seem enticing, just get the middle eastern plate and select items that looks good.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "I fell in love with the lamb shank and now come back every single Wednesday for it. BTW, they are very nice and friendly with the customers!", "author": "Natânia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-25", "description": "My expectations for lunch always sink when co-workers suggest Rincon Center.  Arabi is the Middle Eastern-esqe option in this food court of office workers slobbering up cheap grub.  The food is bland and menu doesn't really dive into the depths of exotic food from their culture.\n\nPastitisio: Anyone who eats this will at least be the \"Big Fat\" part of this Greek dish.  It's creamy, it's meaty, it's hearty.  Will fill you up for sure, but not necessarily a gourmet delight.  The meat could be spiced a little more.\n\nSpinach & Lentil Soup: Super bland.  Felt like just lentils and spinach in water.\n\nZa'atar Bread: A pre-made pita wit za'atar spices sprinkled on top.  I prefer when the bread is baked from dough state with the spices on it so they meld in.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-24", "description": "Their menu on Seamless has no resemblance to the options they actually offer and the staff is completely unhelpful when you try to call in an order.\n\nI would have liked to try their food, but they did everything in their power to prevent that from happening.\n\nIf you are really craving Middle Eastern in the neighborhood walk out the door head up to Mission and check out Sausalito Espresso on Mission and Beale.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Went here to try the breakfast because I heard good things from a friend. He was not lying. The fresh ingredients used in in all their plates are fantastic! The service was amazing also. They let me add more fillings than I was allowed on the menu for free! They also offered me samples of fresh falafels they just made! I totally recommend this place for a great lunch or even breakfast.", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Can't get enough of this place. I've had a few quick serve Mediterranean places in Berkeley and they don't compare to what this place is dishing out! And their portions are enormous, for around $10 you get a ton of food. Get a plate and if you really think you can eat it all get a plate plus extra salad.", "author": "Abby H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Jamie and the staff are nice and the lamb is GREAT as well as the salads. I used Whirl and got two free meals (www.getwhirl.com) Side note Wednesday's are the days that lamb is served it used to just be once a month.", "author": "Iman P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "Had the Thursday special, moussaka with a cup of chicken barley soup. Excellent. And only ten bucks! I love how the moussaka seemed homemade. It's like Mediterranean lasagna.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "My favorite is lamb/beef shawarma with onions/spicy sauce = Deelicious! The owner is always there and great customer service! Salaams.", "author": "Wallace A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "I've been coming to Arabi for lunch every few weeks for years now.  Super-friendly staff and good food.  My personal faves are the falafel, madfouneh (the Tuesday special) and the triple-salad combo on Fridays.  Oddly, I'd not tried the famed lamb shanks until just this past week.  But now I understand what the fuss is about -- they are tasty!  Great to have as an option for lunch in the Market/Embarcadero area.", "author": "James M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-13", "description": "Came here on a Wednesday and tried their specials which was Lamb shanks. Was disappointed, didn't have much flavor to it! Maybe I'll try something else later on and see if it's any good.", "author": "Jackie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "Best Breakfast Burritos in the area. They have an awesome spicy hot sauce that's got a mediterranean, sun-dried tomato taste to it. My favorite, Sausage with Feta and potatoes with an extra side of hot sauce. The owner is super nice and often gives us free, freshly fried Falafel balls while we wait. \nThey're rewards card is awesome, only 5 burritos and you get your 6th free.\nIt's not the fastest burrito ever though, so call in your order if you're in a rush", "author": "Hamish F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-13", "description": "Regrettably I tried this place couple of times. \nShawarma meat was not freshly cooked but microwaved.\nTasted awful!", "author": "DImitry G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "I went here for lunch with some co workers.  I wasn't intending on going to this place, but rather we went to the Rincon Center to see what was crackin.  Even though it 's a food court, the Rincon Center does deliver.\n\nI was in the mood for some fallafels (not sure if I spelled it right) so Arabi immediately caught my attention.  I went in and browsed the selection.  It looked pretty typical of standard Mediterranean food, not that that's a bad thing.  Sometimes it's better to keep it simple.  There was one item that caught my eye, which was the kabob burger.  It sounded pretty unique, though I wasn't sure if it was a pita or burger.  \n\nBut as I stated, I was in the mood for a fallafel, so I picked the super fallafel or whatever.  Fallafel, potatoes, and egg plant yum!\n\nI got my order (very friendly) sat down, and took a bite.  Pretty good!  I wouldn't say the taste was too strong with spices or salt or anything, but I did order eggplant and there was no meat, so what did I expect?  In either case, it was still tasty, and for six bucks, you indeed get a mouth full.  By the end of lunch I was stuffed and satisfied.", "author": "Andy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "Yes, this place costs $2 more than your average lunch spot in the area. However, in turn you get larger portions and healthier, fresher food. The kebobs and shawarma are good quality and lean. They also have a great selection of salads (anything from steamed veggies to dolma to tabouleh). This is like a home-cooked lunch; perhaps a little on the basic side but it is the only thing in the area that is truly low-fat and not over-processed or over-seasoned.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-01", "description": "I am a big fan of Middle Eastern food - Israeli or Arab - and I have experience with both courtesy of spending a lot of time in Israel. I decided to head over to Rincon today because I work across the block and I was getting a bit tired of going to Rincon Grill. \n\nOne of my favorite Middle Eastern foods is definitely shwarma so I decided to get a shwarma sandwich. I was quite surprised when the only question she asked me when taking my order was if I wanted the sandwich in pita or lavash and what kind of meat I wanted. I asked for pita and lamb. What I got was definitely not a shwarma sandwich, although I can't really complain, for $7 I got an awful lot of meat and she piled on a lot of lettuce. \n\nMy complaints, however, was that this was not really shwarma! I got a lot of slices of thinly cut meat in the bottom of my pita after I had ate five mouthfuls of lettuce that were spilling out of the pita. There was no tahini, hummus, hot sauce, or even salad or onions besides the lettuce! Additionally, the top of the pita was drenched in sauce that I wish was more evenly spread throughout the sandwich. I ended eating the meat with the included fork separate from the pita because it had just collapsed because the sauce had made it soggy. The meat was heavily, heavily spiced. I'm talking about, I needed to chew two pieces of gum afterwards to not return back to work smelling like a shuk. \n\nWould I eat at this place again? Maybe but I think I'll definitely get something besides the shwarma because it simply was not shwarma. I've definitely had better Middle Eastern.", "author": "Rick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Tried their lamb shawarma in a pita (not the plate version) for lunch today, and the only thing I'm sad about is that it took me so long to discover this place! Generous portion of tender lamb, flavorful sauce with just the right amount of spice/heat. A tad heavy on the parsley for my personal taste, but overall it's a great dish. Friendly service behind the counter, and an incredible spread of salads and side dishes which I look forward to trying soon!", "author": "Peter B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "No lavash surcharge. No oil soaked wrap. No reason not to be a fan.\n\nBeen having some disappointing Mediterranean recently, so it was nice to find a spot without extra charges and extra oil.\n\nArabi offers a choice of meat in pita or lavash, and requests like swapping out tahini sauce for hummus are no problem at all.\n\nMy rather large chicken wrap was given to me by a lady with a rather large smile without a rather large price.\n\nIt was rather delicious.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-17", "description": "Bad.. Bland..  stale food. It tasted like it was cooked atleast a couple days ago. The Chicken was so dry, I could have thrown at a car and it would break the window.\n\nVeggies so soggy and wrinkly that they must have been cooked over the weekend for the whole week or something.\n\nSave your money and eat fast food if you are really in mood for some bad food! You'll be doing yourself a favor...  and maybe serving the humanity at large by not putting money in the pockets that dont deserve!", "author": "Sumit G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-22", "description": "Wow, I am totally impressed!  A good meal at any price.  \n\nYelping does promote consumerism.  If I can buy a cheap sandwich a half block away, why would I go to Rincon Annex and spend twice as much for lunch?  Because there's this Arabian shop that I haven't reviewed yet, and it's calling me.  \n\nNice menus greeted me on the sign by the door and over the counter.  It looked like a Mediterranean plate would be diet-friendly, so there it was.  Hummus, falafel, baba ganouj, tabouleh, dolmas, pita, and a diet Dr. Pepper for under $9.  \n\nOh, wow!  The falafel was crisp on the outside and moist on the inside!  The dolmas were double-long, and packed with garbanzos!  The tabouleh was tart and sweet at the same time!  The baba ganouj and hummus were fresh and moist, too!  Look at all those exclamation points!  \n\nArabi, if you were a Yelper I'd fan and friend you right now.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "I love this place. I have been going here for the past five years. The ownership has since changed but the service has remained the same. I have told the owner this as well but they have the best falafels I have ever had.  And their breakfast burritos are awesome as well.  I have called and ordered the same one so many times that now when I order the owner already knows my voice.\n\nThey also have lamb shanks for lunch that I have not tried yet, but I will soon.", "author": "Lydia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-04", "description": "Updated on 16 Feb 2007:\nAfter reading ROTD of Arabi by David, I noticed that I only gave 2 Stars to this place.  I initially reviewed this place when I first came to S.F. from Michigan, where I ate some of the best Middle Eastern food.  So, I was quite harsh on my review.  Since then, I've had lunch at Arabi numerous times with great satisfaction.  I learned that most of Rincon  food is average and that Arabi is one of the better ones.  Now, with lower expectations, Arabi is thumbs up!  \n\nLunch meal prices are around $5-8, which is the average for Rincon Center.  Their chicken shawarma was pretty good.   When I ask for extra pita bread, they usually give it to me at no extra cost.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-23", "description": "I got the lamb/beef shawarma plate and the beef was very dry.  It was $7.99 and came with either rice or hummus, some lettuce, tomato, onions and a side of green dressing.  I know it's Rincon and it's doesn't have the best places, but I'd rather go to the Thai restaurant in there. Next time I'm craving Mediterranean food, I'll pick Sausalito Express next to Justin Herman Plaza- everyone there is so nice and good chicken shawarmas. Or Oasis Grill around the block on Drumm, but there's usually a line.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "Mediterranean food can be really hit or miss, but I think I might have found a new go to when grabbing lunch at Rincon.  Arabi is clean and easy to navigate when you come in.  Their main dishes are laid out easily for the untrained eye. Luckily, one of my friends ventured in with me so I got to try some of her plate as well!\n\nI went with a falafel pita while she got one of the combos.  The falafel was excellent but I found myself dipping into the gratuitous amount of hummus that they had heaped into the combo. I will definitely be back!", "author": "Dan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "Love, love, love this place.  I used to work a block away for almost 8 years and I have to say this was always my lunch of choice.   Pastitisi, Moussaka, Spanakopita,  tomato/cucumber/red onion salad and so much more.  I used to have a greek room mate who cooked all the time and I have to say this food is close to what I used to sample then.  Very home style feeling.\nThe women that run the place are so friendly and got to know me.  I still go to this area to get my hair done, but sadly they are not open late.  I usually end up at Rincon center and get Subway and since it is later (after 5) all the crowds are gone and I sit and listen to the water fountain and wish I was eating Arabi instead of a boring sandwich.", "author": "Debbie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "hands down the best Falafel in SF, I'm glad that I've found this hidden gem.", "author": "Aziz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-10", "description": "Love this place.  The breakfast burritos are to die for.  That's right - breakfast burritos.  (I think they call them wraps, but they are burritos.)\n\nSO good!  Especially on Friday morning after an especially late Thursday night.  Highly recommended.\n\nAnd their lunch is good too.  Convenient, fresh and delish.  And the management is about as nice as they come.  She is always there with a warm smile and a genuine thank you for the business.  \n\nThey will continue to get my business.", "author": "Christie d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "I'm a big fan of their middle eastern plate.  It is part of my weekly lunch rotation.  Plus, the lamb shank special on Wednesdays is a fantastic when you want to go big for lunch.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-09", "description": "Went here on a Friday.  Service is slow, because one of the workers does not speak any English, so I had to wait for another worker tell the first worker what to do.  I ordered beef kabob plate.  Came with rice.  UGG!  The rice is not authentic long grain rice that you might expect from a  Mediterranean joint.  It's this fat grain stuff that you get from a box of Uncle Ben's, and you get plenty of it to make it seem like you're getting a lot of food.  Doesn't taste good.  Screams \"CHEAP\" to me.  EVEN WORSE - The beef kabob:  you get 4 small chunks, and was MICROWAVED with the rice and veggies in order to heat it up.  Guess what - it became beef jerky, and the veggies were totally dead.  Also, whatever marinade they put the beef in is too sour.  All this for $10 - NO THANKS!!!  Avoid.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "Just had the lamb shank that I've been hearing about.  It's now served every Wednesday.  Fast and friendly service at 1:30 on  Wed.\n\nSeriously one of the tastiest and tenderest lamb shanks I've every had including in any other full fledged swanky restaurant.  $11.95 buys a seriously large amount of food and I eat a lot.  Was barely able to finish it.  Meat was falling right off the bone.  Didn't even have to use the knife.\n\nIf you want dessert, the baklava is very good too.", "author": "Ezra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "I thought I had done this a long time ago, but I have to write a rave review of this place.  Their Lamb Shank is absolutely the best lunch downtown every Wednesday.  Made with love and tender as can be.  It's a culinary highlight of my week. I eat here often and have never been disappointed.  Solid Mediterranean food and lots of variety.  Their Moussaka is delicious and served on Thursdays.  The owner is also one of the nicest people you will ever meet.", "author": "Bubba K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-27", "description": "disgusting. uncooked eggplant with soggy/chewy old chickpeas soaked in oil, wrapped like a burrito in a giant pita and some wilted lettuce. they asked \"spicy?\" i said yes. apparently that meant turn my pita into a sponge with bland tomato sauce. no flavor, terrible texture, bad temperature (microwaved then grilled, like a taqueria)...nothing was good. \n\non top of the awful food is the awful service. people mill about in total chaos trying to figure out where the line starts and ends. there's no number system or names. orders are prepared randomly and then no one can tell who is next or who gets what. \n\nafter i couldn't force myself to eat another bite of their disgusting food i returned it to the cashier. she asked me \"how was it?\" odd question, i thought. \"not so good\" i replied. she paused for a second, said \"oh\", took the food from me and turned away.\n\nthe person i came with was much smarter. after they told him they were out of vegetables to make a sandwich he immediately said \"WTF\" and walked out. how can a sandwich place with a deli counter full of vegetables not be able to make a hungry customer with money a sandwich? yeah, don't go here.", "author": "Mulberry S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-05", "description": "I usually don't bother with writing reviews but I was so disappointed here considering the line was out the door.  Ordered a Shawarma  Lamb & Beef plate for lunch.  Got back to the office to find the meat was too dry.  Figured I'd just eat the rice and salad but found not one but TWO strands of hair in my food.....The Sesame Snaps were good.", "author": "Ron N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-23", "description": "GREATLY IN NEED OF SOME QUALITY CONTROL\n\nMy first time here, I got breakfast: I waited 10-15 minutes for a breakfast burrito. That burrito was great.\n\nMy next time here, I got lunch and things went very badly:\n\n- My falafel deluxe sandwich was filled with horrible and bitter creamy red sauce. It was disgusting. I THREW IT OUT AFTER A COUPLE BITES. Maybe that sauce went bad. I doubt anyone would make food taste like that on purpose.\n\n- Like many of their salads, the couscous looked awesome. However, it was ridiculously sweet. I expect some sweet and tart flavors mixed in, but this was sweeter than candy. I ALSO THREW THIS OUT AFTER A COUPLE BITES\n\nMy advice: I suspect it is possible to get a decent meal here, but be careful.\n\n(BTW If you have a falafel craving near the Embarcadero, consider Oasis instead. Theirs is flawless.)", "author": "R L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-10", "description": "Perhaps you get different Falafel when your order the combo? The falafel I received was dry.  \nThe hummus, which deceptively appeared like that pasty, tasteless thick stuff which sometimes masquerades as hummus, was actually quite yummy.  \nDolmas . . eh, they were alright.  Overall, it was just that, alright but nothing I'd go out of my way for.  Might try it again if a Mediterranean craving descends upon me during the work week lunch hour.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "I like this place.\n\nI've gone here about 6-8 times and I have been satisfied each time.  You can get  a 3 salad combo plate for $7.95 which is cheap for Mediteranean food.\n\nMy fave is their yogurt w/cucmber/tomato salad.  Only negative about this place is that they only accept cash.", "author": "Marie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-14", "description": "I hate giving one star reviews, but hopefully my review will save you from wasting your money on this place.  I ordered the Chicken Schawarma plate with hummus, tabbouleh, and wheat pita.  Extremely disappointing. The hummus was decent, but nothing else was worth eating.  The chicken was dry, bland and generally not good. Pretty sure it was microwaved to death, but I don't think it was seasoned well to begin with. The tabbouleh was one of the worst I've had... the tomatoes were terribly mealy and it was unbalanced.  Way too much acid, no salt.  The pita was a complete throw away... incredibly stale.  Too bad... I really wanted to like this place since it's close to my office, and convenient for take out.  Clearly they do not care about food quality. Too many other great choices to waste your time and money on this place.", "author": "Mistie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-20", "description": "Let me start by saying the I am hesitant to give 1 star reviews. I am aware it is based on a one time experience and I may have caught a business on simply a bad day or I was not in the right frame of mind, but this was the worst kebab I have ever had and I want to warn others so they do not waste money as I did. \n\nI had lunch there today. I ordered the shish kebab with vegetables and I assumed salad per the menu, but the menu is clearly not followed at this restaurant. It must just be for decor. \n\nFor example, on the dry erase board right outside their door, they advertised a half chicken lunch. This was also on the menu on the wall. That sounded good so I ordered it, but was told they didn't have it today. This was perplexing as it was on the board at the door which utilizes the technology of rapid modification through the use of an eraser and marker. It could have easily been updated to reflect the current status of their lack of chicken, but I decided to bypass this perplexing turn of events and plow on. \n\nI ordered the beef shish kebab which on the board had two listing for shish kebab, one for 7.99 and one for 8.99. Both listed coming on rice with salad, so not really sure what made one a dollar more expensive, but, again, menus are not to be trusted there. I noted the man behind the counter grabbed one kebab and put it on the grill. All of their kebabs were sitting in an open air bowl and had previously been cooked. He was heating it up for me on the grill. I asked about a second kebab and was told it was an extra $2.99. I debated about asking for clarification about the menu situation and the difference in price, but the man appeared to not be solid on his English and I decided not to overcomplicate the process. I was hungry, so I ordered another kebab and, as I am low carb boy, asked for broccoli instead of rice. I was expecting to be asked which salad I wanted, but that was passed by as my food was shuttled to the cashier. Now, I could have asked about salad, but figured they just tossed in the green salad that was there. Nope. No salad. As I said, there appeared to be a language issue present and they were not following the menu as everyone behind the counter kept looking to what I assumed was the owner and she would rattle off a price to them for what was there. The gentleman in front of me clearly ate there a lot as he knew them by name and was telling them he wouldn't see them until next week as he was going on vacation. I took that as a good sign that they had regular, committed patrons. He also order a beef shish kebab, so I figured it meant they must be good. Boy, was I wrong all the way around.\n\nThe Good\nLet me tell you, I am scrapping for the good here. The staff was friendly, but I am not sure what was going on with the staff. It seemed like they don't make decisions without the owner telling them what to do. The people behind the counter were not very helpful and I felt like I had to direct the transaction. That being said, they were friendly. Well, they smiled. They also had lights, so I could see everything. Oh yeah, they had what appeared to be a wide variety of salads and other foods that look tasty. Mind you, looked tasty. Looks can be deceiving as I soon discovered.\n\nThe Bad\nFrankly, the beef shish kebab was inedible. It is generous to say it was well done. It was more like cubes of beef jerky and I was ever so grateful for the cucumber-yogurt sauce they gave me to help add a smidgeon of moisture to the food to help me swallow it. Awful. Simply awful. I debated about returning it, but the line was long and I needed to get back to the office, so I powered through. Also, no salad, just the broccoli.  The broccoli had been sitting, but was fine. The best thing about my meal was my diet Snapple, but I can't really give them credit for that. This was simply horrid and should never, ever be experienced again. I know I won't make that mistake again. \n\nTotal cost for two crusty beef shish kebabs, 5 pieces of broccoli and a diet Snapple = $12.84. Did I already say never, ever again? There are plenty of other fine establishments at the Rincon Food Court, please visit them unless you like overcooked, overpriced crap.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-05", "description": "I still crave for the Middle Eastern food we got in Europe, especially the Kebabs. It just doesn't seem that the same thing exists here. This place does a nice Shawarma in Lavash, not the same thing at all, but it's okay.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-25", "description": "Unfortunately I am unable to give this place even one star today. In fact I should call the Health Dept and request an investigation.\n\nToday I ordered the Pastitsio lunch special and after cleaning nearly all of my plate I noticed a small brown item on one of the spaghetti noodles that resembled an insect. I inspected the symmetrical item for a minute or so and determined that it was a beetle that had been dead for a little while. I took the plate with the beetle back to the manager and without causing a scene I politely explained the situation. Her first response was to say that the beetle had most likely flown onto my plate but I made sure that she understood that this was not the case. She was kind enough to return my money without an argument but the damage was done. \n\nObviously this was some type of harmless flour beetle that was in the pasta bag/container before they cooked it but I don't do insects. Find another Mediterranean place with higher kitchen standards.", "author": "Damien S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "Wednesdays are reserved for Arabi as they have their special lamb shanks, which are awesome, and they have other great options as well such as kebabs, shawarma and salads. \nTaste: all the dishes I listed are quite good, they have quite a following for the lamb shanks and a building following for the meatballs. Shawarma and kebabs are tasty and the hidden jewel is their choice of salads. When they say salad they really offer up a variety of dishes that include: Greek salad, tomatoes, cucumber/eggplant, beets, sweet potato, and assorted bean salad. \nValue: their flexibility with mix and match creates a lot of value, only a little bit hungry? Have some salad, hungry for really healthy food? Have a few different salads mixed together. Meat, they got it and with salad. They price out what you want and I think you will be happy with the price for their portions\nVariety: in addition to the dishes above, they also have daily special. I think there's quite a bit to choose from. I suppose it doesn't quite offer up a diverse a taste palette as some places but if you come here with Mediterranean food in mind then you will probably be happy\nOverall: quite happy with Arabi and it's a staple in my weekly lunch rotation. Not only is it enough food, also has healthy options so I can feel good throughout the day", "author": "Aldo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "I decided to give this place another go.  they've got some solid food at a decent price.  this time, i went with the daily special (chicken and spinach over rice with a side salad, $8).  It was really good, moderately healthy, and the lady who served it to me was old and sweet.  \n\nalso, i got a piece of falafel on the side (no sauce, wrap or anything), and it was excellent.  maybe i just got a dud the last time around.  anyway, if the falafel is this decent next time, maybe it will be possible to score lunch in the financial district for less than $8.", "author": "Sunil A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-16", "description": "Got a groupon now deal for Arabi and I thought I'll try something new today.  For $8 (including tax), I get to choose a hot plate, a salad, and a drink (along with some pita bread). \n\nI ordered a beef Shawarma and I saw them microwaving my food...um, this is SO not worth $8...Can't imagine the horror of paying more than $8 to eat microwaved food!!  As expected, the beef was dried...VERY dry to be exact but very flavorful, which gave it a plus.  The rice and sauce is okay.  The salad was amazing tho!  They gave me enough food to split it into 2 meals, so that was good.  Plus, I get to choose any drink in the store for my groupon deal, that's also a plus. \n\nThe service was really good though!  The counter server was very patient as I choose my dish.  It's my first time here and it's been a while since I had middle eastern food, so it took me some time to make a decision.  The cashier lady was great too.  Was also very patient as I stood there choosing my drink. \n\nOverall, this place is okay.  Considering that it's sitting right in the financial district, their price is pretty good but I could've gotten better food as well.  I'll come back if there's a groupon deal and I'm craving for some Shawarma, but won't if there's no more deals :/", "author": "Icy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "Office-lobby food courts don't usually inspire culinary confidence, but then, how many office lobbies have their own walking tour (dedicated to the gorgeous art-deco murals), and how many food-court shops make it into the Food Lover's Guide? (Stonestown, don't hold your breath.)\n\nNow, in a more competitive neighborhood, Arabi might only get 4 stars, but to the desperate office workers awash in a sea of mediocrity, it's a beacon of hope.  Besides, while you can nitpick the quality, you can't argue with the prices and portions (the $6 deluxe falafel sandwich with potato and eggplant is monstrous).  And they even offer a few lesser-known sides like mujadara, a scrumptiously seasoned pile of lentils, rice & such.\n\nEven if you don't work nearby, you really should find an excuse to visit the Rincon Lobby at some point, and if you don't want to shell out for Yank Sing, Arabi's got you covered.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-18", "description": "How did this little gem escape me?  Tucked deep in the bowels of the Rincon Center, it's not hard to believe, actually.  For such a tiny hole in the wall, this place manages to crank out a nice diversity of dishes, and very tasty too.\n\nI had the bargain plate and a bargain it was--only $3.95 for a heaping pile of a nice dish I've never heard of before and, shucks, can't remember the name of, but it's got brown rice, lentils, sauteed onions, and herbs & spices.  They offered to heat it up and I accepted, and I'm glad I did.  It seemed to bring out the subtle complexity of the seasoning.  I also got a nice dallop of baba ghanouj, one falafel (room temperature, but large and quite tasty), and pita (white or wheat--I went with wheat).\n\nYou can also get a \"Greek\" salad instead of the rice dish with the bargain plate, and I just might do that on days when I'm not as hungry.  When your hungry, though, go with the rice dish.  It'll keep you going all afternoon!", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "I've been going to Rincon for about 2 years and never decided to eat at Arabi - until today. What was I thinking, I wish that I gave this place a try a long time ago. Now on my bi-weekly visits to the Rincon I'll be here most of the time. \n\nI had the Special Moroccan Chicken and it was tasty, affordable, and very filling. The three ladies providing the service seem to enjoy helping customers, a rare find in the Rincon. All the salads, wraps, and other items looked fresh and tasty. \n\nCan't wait to go back tomorrow. \n\nI wanted to give this place 5 starts but they only take cash - just annoying.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "I am in shawerma heaven.  This beef and lamb number on lavash bread is ridiculous.  The meat is perfectly grilled kebab, and the sauce is a delicious mix of yogurt, parsley, and ...chives, maybe?  The bread is crisp on the outside, soft on the inside.\n\nI am also a huge fan of the three salad deal on Fridays ($5.99, I believe), but since it's Thursday, I'm in meat-lover's paradise.  If I were a cow or a lamb, I should be so lucky as to end up in this shawerma.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-12", "description": "Listen this is crappy 'ole $4.95 mall food, so I'm not expecting much.  But today's falafel was the NADIR in a history of disappointing falafel pitas.  \n\nI understand that people (apparently from Michigan or wherever else in the middle of nowhere) cannot discern authentic middle eastern food.  \n\nAnd I support your right to 5-star horrible food.  \n\nBut their falafel is just WRONG.  No crispy outside.  No delectable inside.  Just mushy innerds with mushy outards.  Slap on a few stale sesame seeds.  Bleh!!!", "author": "cookie v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "This is the most amazing Arabic restaurant I have ever visited. First off, all of the employees are the nicest and kindest people you could ever meet. They are very helpful and keep a smile on their faces. The food is so amazing. Everyday I go in for breakfast and lunch, and I don't think I will ever go to any other Arabic restaurant in my life! This is the only place I'm not afraid to try new things because ever thing, from the salads to the hot plates, are delicious in every way possible. I recommend everyone going in and trying their delicious foods because I guarantee you all that you won't regret it! Arabi is the best in the west, as the Middle Easters would say... Lol", "author": "John A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-02", "description": "I can't say enough good things about this place. I come here a few times a week mostly for bfest. The owner is super nice & always gives me free falafels fresh out of the fryer, AMAZING. They cook bfest to your order & it's always really really good. They have bowls of fresh fruit, pastas, rice dishes & other Mediterranean items that look pretty bomb. On Mondays they serve this pasta type of dish, I have no idea how to spell it but it's pronounced piss-tee-shee-oh & it's grubbin! This is a great place for lunch or bfest if you work nearby.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-11", "description": "I'm addicted to the 3-salad combo:  You can pick out any 3 items from the cold salad table.  They have nice leafy greens, pasta and rice salads, fresh broccoli, and the standard hummus/ babaganoush/ tabouli options.  Really nice folks there, too.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "i love this place!  Come here for lunch all the time.  You cannot beat the prices, for 10 bucks, i get shawarma, tabouli, humus, and mujadra.  It is all really tasty and they make great sauces to accompany their dishes...really like the parsley tahini sauce.  I don't care for falafel much, but the sandwich here is super good too...i'd replace the tomato tahini with the parsley though ;)  The owner is also super nice and friendly.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "Great place for a falafel sandwich. Fast, convenient location at One Rincon. The falafel deluxe with eggplant and potato is a very filling and delicious lunch option. Happy to go back often!", "author": "Annu K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-05", "description": "The service (yes, I know, how bad can service be at a take-out counter) was excellent, so props for that, if it means anything.\n\nAlso, you get a ton of food with the order.  A ton.  But if someone gave you a ton of kicks in the lower-back, would you consider that a good thing?  Exactly.\n\nHad the lamb shawarma plate.  I love me some lamb shawarma, and have been in a slump with new places I've tried for this dish, so I thought this could get me out.  Basically I went 0-5 with 5 strike-outs, and got drilled in the head on a run-out.   First off the meat doesn't appear to be on a doner, but rather just stewed in a pot.  After they stew it, they leave it in a chafing dish until you order it.  The end result is basically chipped lamb (I think it was lamb) in a horrendously seasoned broth... too much of two spices, I think clove is one but it's hard to parse them apart.  Literally, the lamb was splintered - the biggest chunk I found was about 1cm across and 2cm long.  So the texture was no good, but the flavor I couldn't handle.  It is an extraordinarily rare case where I just can't bring myself to eat something (maybe twice in my life), but this was one.  Just couldn't do it.  Tried mixing it with the bland and watery humous, no good.  Mixing with the overly-dill'ed tahini, no good.  Tons of hot sauce, still nothing.  \n\nHad a side salad of veggies with jalapeno, which was decent but because the jalapeno had been sitting in the bowl with all the veggies for so long, everything sort of tasted the same.  Oh well.\n\nMaybe the other dishes are great, but avoid the lamb shawarma.  Overpriced as well.  If I'm back in the area I'll give the chicken a shot, but otherwise I'm benching myself from this place.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-05", "description": "Perhaps my expectations were set too high with all the other relatively glowing reviews.  But I simply can't rate this place very highly.  First, I was disappointed that they only offer pita, not lavash.  The woman behind the register claimed that it was because lavash broke apart too easily.  huh?  Since when does anyting fall apart more easily than pita, especially when it's stuffed to overflowing?  If it weren't for the paper it was wrapped in, I wouldn't have had a sandwich; I would have had a pile of food.\nSecond, perhaps this is just a matter of taste, but my \"chicken shawarma\" was nothing like any chicken shawarma I've ever encountered before.  The sauce was strange (and very overly acidic and sour - quite off putting.  It almost tasted like hollandaise sauce or something.  Where's the tahini?), it was WAY over-spiced with the purple stuff (not sure quite what it is) to the point that I could hardly taste anything else, and the arrangement of ingredients was very poor - all spice and sauce at one end, chicken in the middle, and lettuce at the other, when it should be a mix all through.\nSo while some of this can be chalked up to personal taste, there's an awful lot that was just not well done.  Not worth a return trip.", "author": "Don H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-01", "description": "Great spot for lunch in Rincon Center.  Fresh food and changing specials to keep things interesting.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-29", "description": "Another of my favorite lunch spots from my SF office-job days, the thing to get here is the falafel pita *with* hot sauce, thank you very much.  They do have a variety of delicious salads as well, and a rotating vegetarian special that's different every day (though few of them should be construed on that basis as health food since they're often heavy on carbs and cheese...even though those are the qualities that are conducive to yumminess, they're not really doing your body any favors).  The woman who runs the place is very sweet and caring, too, and loves to chat with her customers while she rings them up.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-10", "description": "Everything looks good here, but I can't help always ordering the chicken shawarma sandwich. The marinated chicken is soo delicious and they use lots of sauce. I always ask for hot sauce and they usually put in enough to clear out my sinuses. The service is very friendly. One word of caution: when getting the sandwich, ask for a plate to go with it. That thin wall of pita stands no chance against the flood of sauce inside, and the thing inevitably explodes after bite one. Which means a trip to the dry cleaners.\nBeware that going to Arabi requires a trip into the twilight zone that is the Rincon Center. Everything about this place seems...fake. There's always someone playing something mild and unnoticeable on a piano, giving it a department store vibe, the offices upstairs look like they belong on a stage set, and the inexplicable fountain rains down in the center of the lobby like an enormous shower. I usually get my shawarma and run the heck out of there as fast as I can before the Truman-show-eggshell-thin-reality crumbles before my eyes.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "Amazing! Great place for continental breakfast and Middle Eastern lunch. Hummus is awesome and the sandwiches are amazing.", "author": "Saadi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "Used to be my favorite lunch spot when I worked at Harrison & Embarcadero.  Very tasty middle eastern food with great daily specials.  Awesome selection of veggie and meat salads.  The owner is terrific and great at remembering her regular customers.  Downside: pretty spendy, especially given that they are only open for lunch, which kept me from going there more than once a week on average.", "author": "Galen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-16", "description": "Really one of the strangest lunch experiences I have had.... Stepped up to the counter at around 1:00 or so on a Friday.... a little past the mid-day rush but hardly closing time, or I would have thought.\n\nI'm about to place my order, when a tidal wave of grey, sudsy water washed towards me, from somewhere in the nether reaches of the kitchen.  Apparently, the behind-the-counter area is designed for this type of cleanup, with a drain somewhere in the corner.  But DURING SERVICE  HOURS?  I was a little amused, but a little horrified.  The poor lady serving me had to walk on her heels to avoid getting her feet wet.\n\nThat, and the horribly sour shawarma plate make this a 1-star experience for me.", "author": "Mahau M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "Good place for lunch; everything I ordered was fresh, well-made and tasty; definitely above average for a lunch place, especially in a busy food court type of place, as Rincon center is.  I especially enjoyed the falafel and my Mediterranean plate; Also worth mentioning is  that the folks that work there a very nice and helpful (which is also out of the norm, for a food-court type of place).", "author": "Laura K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-01", "description": "by far, the very best hummus in this part of the world. other things that are to die for....pastisio, greek salad, bbq chicken, falafel, chicken curry and a tomato/cucumber/red onion salad. unbelievable variety and the best part of all is everything is fresh, healthy and homemade. so not only will you get some yummy in your tummy, you'll be served by the sweetest staff, be loved and cared for, exactly how mom would treat ya.", "author": "Liz R."}
