{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Ordered dinner via Caviar from here for myself and my colleagues. Delivery was fast and the food arrived still very warm.\n\nOrdered: pollo sandwich, yuca fries, veggie guisado, and très leches cake.\n\nMajor YUM to everything we ordered!! So satisfying, well-prepared, and delicious.\n\nWe will try to come in person next time!", "author": "Erielle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "Right off the bat looking at the menu you notice the biggest downside to this restaurant - the prices. \n\nI have a lot of positive things to say about the rest of the experience. It's nicely decorated, the staff is way nice, there's outdoor seating, and the food is really tasty. The prices, though, are up toward the $20 mark for most entrees. I'm sure that's why their sandwiches are so popular. \n\nIf you come in during happy hour (like I did), $2 off beer, wine, cocktails, and tapas helps...their mango cocktail (which is super delicious) is a very solid drink for that price. Even with the discount, the food is good (not amazing). But combine happy hour with a five stars $2 off deal, and you can get 2 tapas and a cocktail for $23...not too shabby. \n\nAs you can see, I'm all about the discounts, and it really helps here. Combining $6 in happy hour discounts, $2 in five star, $10 in allset, I still paid $40 for 2 meals and one cocktail. \n\nI got a the steak, which was my favorite item, it was cooked perfectly and served with some really good mashed potatoes and a very tasty salad. I added two tapas, which was more than I could eat. The truffle Mac and cheese is super generous, although it suffers from the same curse as many american dishes with truffle oil - the truffle oil is PROMINENT and doesn't leave a lot of room for other flavors. The empanadas are super good, and a bit unique in style. \n\nTop it all off with the hot sauce, which is delicious but not very spicy... use copiously. \n\nSo yes, this place solidly hits the mark of good food I'd come back for, I'm just not sure it's worth the price...outside of happy hour, I'd definitely skip.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "Najib and his team at rigolo / artesano was so wonderful and made our wedding weekend incredible. We had them cater Friday night welcome party and Sunday brunch. We were impresssed by the quality and quantity of food. They went above and beyond and served everything in a timely manner with great presentation. I would 100% use them again - great to work with and easy to get hold of. A+!!!!", "author": "Alexa F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "WHO knew? - this place is owned by the same guy who owns Rigalo (in the same shopping center).\n\nI have lived about 4 blocks from this place since it opened - maybe 7 + years ago and never been, and this gal LOVES a Cuban sandwich.  I think the \"meh\" reviews were throwing me off.\n\nIt was Friday night, we had already had a couple of glasses of wine - did not want to drive and/or lose our parking space.\n\nI thought of this place, we got there around 7:30 - it was pretty empty. I had my mind set on a Cuban sandwich - but there was a special of Cuban eggrolls (presumably the same ingredients but fried into little wrappers. \n\nWe ordered a bunch of things to split:\n-the Cuban egg rolls - could have been crispier - but good\n-rice and beans - good, just what it should be - but a small portion\n-the bowl of chicken soup - comes with fried plantain chips - VERY good\n-the regular plantains - sweet and tasty\n- with Yelp check in - you get a free brownie with Ice cream - Meh - but FREE. and apparently rarely used, our server said he has only seen it 2x. - I guess the \"Richy Riches\" in Laurel heights don't like to save money :)\n\nI would still like to try that Cubano sandwich", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "I love Cuban sandwiches and Artesano's Cubano was excellent!  It's made with slow roasted pork, sliced ham, melted Swiss cheese, house made pickles and dijon mustard sauce which is then pressed on the griddle--mmmm.  It was moist and flavorful and pared perfectly with the bread it was served on.\nI added rice and beans and a light Mexican beer and all was right with the world.\nLove the interior.  Loved the comfy booths. Free street parking after 6!\nService was excellent.  \nClap! Clap! Clap!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Owner called me about an issue I had, clarification was established & away we go. Owner cares about doing the right thing!", "author": "Henry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "This is a review for the Coconut Bread Pudding. I got this to go and the order came with a big slice of bread pudding along with a container of rum caramel sauce and several thin sticks of white chocolate. While the bread pudding was warm and delicious, it was the sensational caramel sauce that captured most of my attention. I didn't leave a drop behind. The chocolates were a thoughtful and tasty addition. Even though the bread pudding was a bit pricey at ~$7, you can get 20% cash back through Groupon and this restaurant participates in Skymiles Dining so there are many added perks for dining here.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-11", "description": "Mediocre quality. Not value for money. For $60 we had ceviche, plantain chips, unpulled pork entree and dulche de leche brownie. The fish in the ceviche was not fresh, but the marination was yum. Unpulled pork was disappointing and small portion. The brownie was okay.. nothing to write home about. This is my second and likely last visit here. The mango-orange juice is super watered down and the coffee is $3:49 for a flipping K-CUP. ARE YOU KIDDING ME?! \nClean, chill vibe and semi-friendly service.\n3.5/10 wouldn't EVER wanna try this again.", "author": "Gia P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-09", "description": "3.5 stars\n\nI was done with a date with my orthodontist and of course, the first thing I think of after I leave the office is (I gotta floss?) nah dude. It's \"where can I eat?\"\n\nIt was another twenty minutes til my next bus ($@&! Muni!) so I got myself a grilled chicken skewer with sweet plantains. The portion read like an appetizer sized plate so I made sure to order an additional side. Coz roasted sweet plantains got me feeling like * hearts emoji *\n\nYou know what else? A glass of sangria! Too bad there aren't happy hour prices here (because I make MUCH better sangria at home) but at $6.29 a glass, it ain't so bad.\n\nI wolfed down my food and was completely satisfied and service was made with a smile. Despite the high prices for \"casual\" food, Artesano is cool with me. \n\nAnd made it on my bus right on time.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "I'd characterize Artesano as the Pasta Pomodoro of Latin food. Reliable, tasty, well-made, freshly prepared, convenient...but knowingly not super-authentic or original. I'm not throwing shade at the place either. It's solid four stars for the food, and similar for setting and service, based on my experience. \n\nTheir French Fries are really good. Kids would go to Artesano just for the fries.", "author": "Lanny B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-19", "description": "I used to really like this neighborhood spot since it was reliable, good portions and the service is always great. They have good Happy Hour and agua fresca made fresh.\n\nMy go-to is always the quinoa kale salad with stead added on top. Over the years, the price of this crept up and became a $20 salad! However, the flavors are great and it's healthy, and best of all, the portion size was good (a lot of quinoa and kale that has been seasoned and massaged in oil, and a sizeable portion of steak).\n\nUnfortunately, this place either got a new owner or something happened to quality. I ordered the same salad (via Caviar) and was very disappointed. Instead of kale, it's mixed greens, a little bit of quinoa, and this ridiculous topping of fried hominy which is too dry to swallow. Worst of all, the steak was cooked well-done (almost burnt) and I had requested it to be rare. The portion of the steak was awful, maybe half the size of my very small palm of my hand. I had unfortunately ordered two portions and both were equally terrible.\n\nThere is no substance in the salad now that it's mixed greens, which is all \"air\" so it was sad to know I paid $20+ for this salad (in addition to Caviar fees).  Caviar was nice enough to reimburse me for the added cost for the steak and also gave me credit for my next order.", "author": "Mai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "So far so good.  Amazing ceviche and a damn good sangria.  Would definitely come back!", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Absolutely delicious! I've had delivery twice and it was soooo good. The chicken, steak and macaroni & cheese are incredibly good. Can't wait to dine in. You won't be disappointed.", "author": "Bernadette K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Dropped in randomly to this place, was wholly surprised at how good it was.  Really delicious food,  and great staff.  We got the steak sandwich and the Cubano.  Both awesome.  Plantain chips/dips to start were also perfect.\n\nI'm pissed that I've lived here 3 years and didn't know about this place.", "author": "Spencer H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "So disappointed. I used to frequent this place for their chopped salad with chicken, a little pricey for a salad but it was so good. After taking my to go order home this time, I was very surprised at how much it had changed for the worse. What used to be a generous serving of marinated shredded chicken, turned into 1 small skewer of chicken, no more jicama, and a pile of corn & black beans. I could have made a better salad at home. Not what I was expecting, and don't think I'll be back. Too bad...", "author": "Jacky V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "This place is delish!! Stopped in for a quick bite and had the shrimp appetizer (substituted coal slaw for rice) and my fiancée got a Cuban. Both were amazeballs.", "author": "Sara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "I had lunch at Artesano today. I don't think I have been here for a year. The steak was so delicious. Tender, flavorful and perfectly cooked. I lived in Argentina for 18 months and learned to live chimichurri sauce. Their sauce is delicious and salty. Argentines love their salt and I know why. It makes the meat and sauce delicious. \nI love their rice and beans too. The food came in good time and the staff was great. I love the new mural and the colorful, twinkling lights. \n\nSome people have said in previous reviews it is going downhill. That was not my experience today. They were hiring so maybe  when they were spread thin, the performance was hit or miss but today, everything was fantastic. So good!", "author": "Nettie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I would highly recommend this place for its superior food quality and excellent service. I went there for lunch and had a great mix of greens with an amazing steak, very well seasoned - add to that, I usually eat more than the average person and was satisfied after I was done so good portion size. The atmosphere is very casual and I was very well treated from beginning to end! Unfortunately, I do not live in the area, but if I'm ever there again that'll certainly be my food choice!", "author": "Israel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "Suboptimal food, nice big space.\nI went here for a late lunch 2 weeks ago. I ordered the Lomo Saltado: Steak strip stir fry with red onion, tomatoes, red bell pepper, cilantro, soy sauce and papas fritas, served with a side of Brazilian rice $19. I asked them to hold the red onion. The nice lady at the cash register helped me with the menu, took my order, and gave me a 10% JCCSF discount. Food came out promptly and hot. The steak strips were salty and tender; everything else was drenched in soy sauce and salt. I have never cooked that salty in my life. All vegetables were inedible despite the rice. I ate the beef strips and left everything else. I gently told the lady the beef was good but everything was oversalted. What a shameful way to treat good meat and vegetables.\nPrice: reasonable\nAmbiance: 8 to 9/10\nFood: 5/10\nCustomer service: 9/10\n\nAbout a year ago, I came with hubby for lunch. We ordered a white fish plate that came with salad (cod I think) and a steak sandwich. The fish was overgrilled by 2 minutes - rubbery and dry. The steak was not tender.\nPrice: reasonable\nAmbiance: 8/10 (a homeless man was pestering patrons outside)\nFood: 7/10\nCustomer service: 9/10\n\nAll in all, my husband and I had suboptimal meals on two occasions. We sadly would not return. I would continue patronizing the Magic Flute, Beautiful, or Picnix Bistro for lunch instead of this place. I would recommend those 3 places over Artesano.", "author": "G D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-20", "description": "2 stars... why? Food is way overpriced for the quality. The chicken ceaser salad was ok, was not worth $20 - NO WAY. I've had much better.  Sandwiches are good the plates are decent.", "author": "Belle Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Ordered delivery through Caviar--delicious! Also timely arrival (unlike a lot of other spots). I ordered the Un-pulled pork and it was crispy on the outside,  tender and fell apart/melted in your mouth when eaten. Good order for the portion and variety in the meal. Definitely a new go-to (both for delivery and restaurant visit).", "author": "jackie h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Still \nTotal\nYum!\n\nGreat with my kids (1 and 4 year old). As the service is fast and it's just loud enough that occasional squeals or noises aren't horrifying to us parents.", "author": "Dan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "I was in SF over the weekend and this place was across the street from where I was staying so I decided to give it a try. It is a decision that I do not regret. I ordered the \"cubano\" sandwich and wow was it good. Their pork is amazballs, like, wow I could eat this everyday, good. It was so yummy just by itself but it also came with this amazing sauce that I can't really describe other than to say it enhanced the sandwich. It was bold and full of popping flavor. They already won me over with the delicious sandwich but then I got a free treat out of it too. I found this place through Yelp and it had a little advertisement that said if I checked in I could get a free brownie. I ordered it to go and picked it up. They were so polite, prompt and my food was spot on. I'd expect a free brownie to be small and not particularly amazing but they blew me away with a very large, rich and perfectly cooked brownie with a side of homemade whipped cream and homemade caramel or butterscotch or buttered toffee sauce. Whatever that stuff was I'd buy it by the jar it was so good and not too sweet. Also their menu is fantastic, they have lovely choices and I wanted to try them all but alas I'll have to wait till I'm back in SF.\nI've only been here once but they made a fabulous first impression on my so I highly recommend Artesano!", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-13", "description": "Something is going on here.  I know they have a new manager and such with longer hours, but I have to say that food prep is not as good as it once was.  i used to give them 4 stars.\n\nThe other day I was here and when they normally serve you the Yucca Fritas it comes with 3 sauces but I was only given one.  Another time I came in and ordered a Mexican Coke with my meal and they were out, but wasn't told til after I paid!\n\nThen tonight my gal wanted her pulled chicken sandwich to go.  We waited the 10 minutes and when it was handed to her it was already soaking through the paper.  The bread was soggy and the meat was not even luke warm.  I really don't want to give this a 2-star rating only because I have loved their other dishes so  much in the past.  Now she is telling me she never wants to go here again!\n\nI hope these changes aren't for cost cutting purposes, but it doesn't seem to be working very well so far.  I will give it a chance again on my own, but for now I'd recommend that people eat the food there rather than to take it to go.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "Grabbed some food to go for lunch today, overall impression was pretty good!\n\nOrdered their chicken entree, and the Peruvian veggie stew dish.  Both came with rice/beans/salad and were pretty tasty, perhaps a little on the bland side, but overall a decent plate of food. Good hot sauce to go with it too!\n\nLoses a star for the mild flavors, and perhaps a touch on the pricey side for what you get.\n\nSolid all round tho.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "A fun place to get good gluten free items in creative Latin comfort food. Sangria is super good and refreshing.", "author": "David N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "This place is in a convenient location in Laurel Village and has wonderful ambiance. The staff was very friendly and the menu was super appealing- almost reminiscent of Sol Food in San Rafael. \n\nHowever, as excited as I was to try their chicken and rice to see if it compared, I wasn't that hungry so I ended up getting the fish sandwich that claimed to be light but filling. \n\nFor me it was a little lacking in flavor and the fish was dry. It had lettuce tomato and a pineapple salsa in it. A little disappointing but I would come again to try another dish.", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "I've been here many times and although overpriced, (due to being in an expensive neighborhood) it was pretty good Latin American food. However, I think there have been changes at the restaurant. During my recent visits not only has the price gone up, but the portion size and quality has drastically dropped.", "author": "Joey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Very authentic Latin American from a number of different places.  I'm definitely going to be coming here often.  Good Latin music as well.", "author": "Ignacio G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "How do they do it? The Chicken Artesano is ALWAYS so juicy and flavorful, my mouth waters just thinking about it. When I first saw the \"Latin Comfort Food\" tagline I was unsure, but intrigued - but that's exactly the right description. The simple yet delicious rice and beans served with almost every meal give you that home-made feel that calms you - then they throw down a vibrant and \"spicy\" chicken, or pork, or meatball...so much punch and flavor but never overdone or overwhelming. The atmosphere is the food, and the food is so good. I would recommend to anyone looking for a great meal that will fill you up and hug your insides like a mother's warm embrace.", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "This place is phenomenal!  I have a new favorite place to eat out in San Francisco.  The environment, the food, the service, the wait time, the ambience and the friendliness is unrivaled.  Viviana and the other waitress there were excellent and genuine.  The owners have done a great job.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "A yummy random pick for dinner! Nice atmosphere, very friendly staff, delicious drinks! My sister had the Cuban sandwich, she said it was the best she's had so far in the Bay Area. I had the grilled fish which was cooked perfectly. Ended with brownie and dulce de leche...\n\n\nWe can't wait to come back and try more on the menu, but I might start with dessert so I can eat it all! Servings were huge.", "author": "Stacei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Omg.. this was a wonderful experience.. I had two dishes and they were so good... The service was excellent, and the atmosphere was very clean and i really enjoyed my time here watching the cooks do their thing.. The manager here is great and made sure I really enjoyed myself.. Overall the food was so amazing. If ur in the area and craving latin, come here!!!", "author": "Victoria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Was going to a booksigning at jccsf and looked for aplace nearby to eat.  One block away what a find.  Wonderful flavorful food and friendly services.  Reasonable prices and clean.  I had a great steak sandwich and french fries", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "First time in this Restaurant. And It was the best experience trying Latin American food. Great ambience, perfect music (salsa, which I love) I went with a friend and she's from el Salvador and I'm from Colombia and we can tell you that our experience here was amazing. Every thing that we tried was delicious. And the service was excellent, Javier was really nice and explain us the dishes that we ask. I'll definitely come back and bring more friends.", "author": "Dennise R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "This is our go-to spot when we have visitors in town. Their Cubano Sandwiches are the best and so is Victor!", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "South American style food made with fresh ingredients. Najib made our lunch visits outstanding. We will definitely return!", "author": "Deborah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "We went for dinner with our son. Our picky boy ate everything without complaining and asked for second serving - we shared. We had their steak special, un-pulled pork, plantain chips. Everything was so good, especially pork. So tender and delicious! BTW I am in love with their red sauce. Yum!", "author": "Adriane J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Latin comfort food at its best. Friendly! Great service! Must try! The Steak is awesome!", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "I was a bit thrown by the high prices the first time I came here- more than I expect for a counter service place even in SF, but once I tasted the food I understood why. It may have a causal atmosphere but the food here rivals any fancy sit down Latin restaurant I've tried in the bay. Every dish I've had has been cooked to perfection (especially the meat- they are so on point with it). The portions are also very large so it's well worth the price. Great stuff!", "author": "Bryn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "I had the best steak dinner I've had in a long time with fresh beans rice and salad.\nI  recommend it wholeheartedly\nSalads are also delicious", "author": "Carole L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "I live in the neighborhood and have really wanted this place to be a regular place for me and my family. The food is pretty good but the prices are high. The one thing I can't get over though is the consistently bad service. I usually just get food to go, but the wait is often long, even when just getting a salad to go and the place is empty, I can't figure out what they're doing... \n\nThis last visit was a bit of the last straw. I show up at 11:20, the doors are locked. The employees inside look at me and go back to eating.  So, I think maybe they open at 11:30. I double check on yelp and realize they open at 11. I go back, knock on the door and someone walks over, unlocks the door, and barely opens is as they walk away. I ask, 'don't you open at 11?' He responds with a very brief and annoyed sounding 'yeah.' \n\nSorry to interrupt your meal time and chit chat with your co-worker... This is not the first time I've interacted with this guy (he's Asian) or observed him 'working.' He really just seems like he doesn't want to do his job, and I think he might be a manager. They really need to work on their customer service hiring/training.  He's not the only one who has poor service skills. \n\nI'm willing to pay the high prices because there are items we really like (Caesar salad, artesano bowl, steak) and they're so convenintly locatrd but always have to prepare myself to leave frustrated by the poor service.", "author": "Angela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "It really is a spectacular place to enjoy good food in a Latin setting. You really can appreciate the type of food as home made, I have tasted other places throughout San Francisco but Artesano is one of those that has a very Latin flavor.\n\nThe pork The sangria and The dessert of tres leches, are exquisite. It's really worth it", "author": "Oscar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Amazing gem in Laurel Village. A great spot to grab lunch, happy hour, or a tasty dinner - and they do quick, easy takeout! Service is excellent. Say hi to Javier for me!", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Got some great cuban sandwiches, albondigas and dessert! They really care about making great food from south america at a more than reasonable price. One of the few places in the city with true Spanish sangria!", "author": "Stefano C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "The food was on point!!! I ordered the lomo saltado and some appetizers, it's was delicious! \nThe service was friendly and on time . It's a good spot to have a quiet and nice dinner but with some latin character in it for sure!!", "author": "Rodrigo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Excellent food with a modern twist!  Loved it completely!  The owner is from Columbia and knows his cuisine.  Bravo!!!", "author": "Julie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "The sauce they have at each table is delicious !! Found this spot by going to different places every weekend. their steak sandwich is my favorite thing they have so far  only down side is the portions... wouldn't hurt to have them be a little bigger. Other than that everyone is amazing including the owner! Location is also great", "author": "Lesley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "I'm in love, guys. I'm in love with the steak sandwich that I ordered. It perfect sandwich bread, toasted and soft on the inside. The steak was cooked medium and had an aioli spread. I was craving the Cubano sandwich, especially after watching the movie, 'Chef' multiple times. The Cubano was not what I expected. They included a pulled pork marinated in some type of spice, reminiscent of curry, which I'm sure it isn't.  Along with our sandwiches, we ordered the yuca fritas and the ceviche. The ceviche was tangy and fresh, perfectly paired with crispy platano chips. The yuca fritas was yummy with the two sauces that came with it, one of which was garlic cream similar to ranch dressing. \n\nNo five stars given only because it's kind of pricey. This lunch consisting of two sandwiches, an appetizer and side, one beer and an agua Fresca cost $80. Yes, they are located in the boutique neighborhood of Laurel Village, but please, it was only a sandwich!! Don't get it twisted however, I would come back.", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Revising my review because, as before, the owner is very responsive and apologetic. Wishing him more success in getting his staff to live up to his standards. That will mean we can continue to enjoy one of our favorite sources of take-out.\n\nInconsistency seems to be the operative term here. Tonight's take-out jicama salad had one small problem: no jicama! I like the food here...when they get it right.\n\nUpdating my review. The owner messaged me that my review prompted him to investigate and to discover that a new employee had erred on the shrimp quantity. He wrote a very nice note and offered a comped salad which I had tonight. It was back to the original excellent salad!\n\nArtesano - you have just lost a very regular customer. I take out your jicama salad with shrimp skewers probably twice a month. The shrimp used to be plump and succulent- and I'm pretty certain there were 6. Now there are 4 puny dried out shrimp....for $8.99!! And there used to be two containers of dressing. Now there is one and it's not full. The lettuce and jicama is $10.99.  Now my nearly $20 salad is pathetic. Last week I thought it was an anomaly. But tonight was a repeat of the same.\n\nGoodbye Artesano!", "author": "R. P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-04", "description": "I really want to like this place, but can never rationalize the price tag. \n\nEnvironment: 7/10\nFlavor: 6.5/10\nUniqueness: 4.5/10\nValue: 1/10 \n\nDuring most recent visit, I tried the carne sandwich. Overall, it was a pretty tasty light lunch. Nothing special, similar to a Panera  bread steak sandwich. But $14.99?! That's way more than what the quality of the food justifies. The meat was charred and well done (overcooked for my preference), but it had good flavor. \"Garlic aioli and zest chimichurri sauce\" is a pretty generous description. It was pure mayonnaise, I could not distinguish anything special about it. Mayonnaise on a $15 steak sandwich?! No thank you. Mayonnaise on a $9 steak sandwich seems a little more appropriate. The redeeming factor was the bread, it didn't validate the price, but was quite good. Light and airy, not doughy, and crisp golden-brown exterior, not too chewy. For my side, I opted for the \"Organic mixed green salad,\" instead of the fries. One of my biggest pet-peeves with salad is having excessive amounts of dressing applied BEFORE serving. Let me choose how much or how little dressing I prefer. The salad was DROWNING in oil. It could have been good, could have been bad, who knows?! All I tasted was thick oil and couldn't stomach more than a bite or two. \n\nI would love to come back and be proven wrong, but the price does not match the product. I would love to see prices reduced on the more commonplace entrees, or step up the quality of the product to justify the $$$. This place has potential to a be a boogie, artisanal, Latin specialty dining experience, OR a local dig for reasonably priced, quality bites. But it CAN'T be both.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "I'm work less than 10 mins away from this place-walking distance. I really like this place, but there are a few annoyance that I have encountered here. The first time I tried this place, I had them cater a retirement party for one of my co-workers. I work with a bunch of doctors and surgeons so I had to make sure I ordered something good. \n\nFor the retirement party, we ordered the Ceaser salad and the chopped salad. It was really good and the portions were just generous. Then for the meal we had the unpulled pork and the chicken Artesano. I remember it because really juicy and tender. The were spot on with the flavors. Then we got the shrimp skewers. Everyone had a hard time taking the shrimp off the skewers. I mean it's not rocket science, but the shrimp did not budge. \n\nFor dessert we had the brownies which was just ok and the tres leche which was completely melted because they had the hot items on top of the desserts. \n\nBut when we ordered it recently for our Staff Appreciation Day, we ordered the Caesar Salad, beans, rice, and the Artesano Chicken. Everything was good except the Artesano chicken. It was so salty!! Everyone was complaining how bad the chicken was. \n\nAlso, when we had our food delivered for our staff appreciation day on March 6th, they gave us a to-go menu. My co-worker and I ordered food. The menu said the Ceaser salad was $7.99 and the 2 piece chicken Artesano was $10.99. So the bill should of been about $19.00. They have raised the prices in less than a week or someone is passing out old menus. \n\nToo cheap to reprint new menus? \n\nAnyway, when we picked up our food, the workers must have been so lazy.. Our salad that we ordered had the lettuce sticking out of the container with the lid already closed. So unsanitary..", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "A lovely respite from the normal locals, brought our little One for happy hour and their team couldn't have been more welcoming or attentive. Everything was delicious", "author": "Michelle Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Artesano is the place to be at! Great service, food is delicious, and their happy hour is the best I've been to in awhile. Drink specials are great, and the food is delicious. If you com during happy hour, you have to order their sangria - especially if it's the red one. Hands down 5 stars!", "author": "Claire M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "This place is really good. I had the cubano sandwich and was not disappointed at all!!! The only problem with this place is that they are very overpriced. Everything on their menu leaves you wondering why the price is so high.... try at your own wallet risk.", "author": "Cupcake 1."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "Normally I adore this place. However on a Sunday having a driver steal your dinner, when you where waiting 2 hours for your meal, is just heart wrenching. \n\nIf this place had half the decency of a classy establishment they would of got me my meal I am disappointed and will never order from this place again , and most likely blog about this a great deal to relieve my mental anguish due to this travesty.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "This was my first time into Artesano. I went in with a few friends and two of us ordered and shared the Cubano and albodigas sandwich. Both were very good! I added French fries to my order and they were ok, but not worth the extra $3.  \nThe staff was very courteous and friendly, the restaurant was clean and had a nice environment. Everyone seemed to really enjoy their food but I think it was a little over-priced. I paid just under $20 for a sandwich, small fries, and a can of coke.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "The food was good. The service was horrible. Our server Victor seemed angry and maybe depressed. Never smiled. Never came to see \"how we were doing\" ... this was our first time here and sure, maybe people have bad days but don't bring it to work. Our server is the face of our experience and we shan't return , which sucks cuz for the next 6 weeks we'll be in the neighborhood every sunday. If you can ignore service and don't mind if it's bad for good food, Then come heron otherwise stay away.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Heyyy Artesanos! It's the Super Hangryo Bros Super Dinner!\n\nActually not all that. I mean yeah it's a nicely textured ciabatta with ok meatballs but places do meatball sandos - they're a thing. I just don't see what I'm suppoowtf there's plantain banana all up in this sandwich #instigating amidst the savory this is dope!\n\nAnd #donttrip about the coleslaw - kicka spice is different & tasty.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Yo 5 stars. The food is incredibly tasty and the service I just received was so welcomed it made my day. I recommend this place for anyone who is in the neighborhood and wants something savory.", "author": "Alfredo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-28", "description": "This restaurant isn't the same anymore since they've changed management. The service is slow and the food is mediocre at best. We used to come here for the unpulled pork. It was the best. Tender, juicy and tasty. Now the same unpulled pork is tough and rubbery. Another favorite was the chicken guisado. The sauce was awesome. Now it's no longer a part of the menu. The vegetable guisado is literally watered down with a mysterious bland liquid.", "author": "Stan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "Meh. That's all I can say about the food. Jicima salad was super bland.  I wanted to like this place, but the whole thing lacked flavor and zest.", "author": "Caroline I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Best chicken, black beans and rice I've ever tasted. The staff were wonderful and the to-go service was fast. I'll be returning often.", "author": "T R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "I am from out of town & my daughter & soninlaw recommended this place. As I am Latina, they thought I'd enjoy the foods. It was...'meh'. Not horrible, but definitely overpriced. And the other reviews are correct: no sides. I had the Cubano Sandwich and Yuca Fries. I make this at home. These are foods I grew up eating and know how to cook. The Yuca Fries were bland. The sandwich was good only for the pork. My daughter said the steak sandwich she had in the past was good. I'll have to try that next time. \n\nIt has great potential, if the owner/crew cared enough. I believe it's a hit-&-miss kinda place. Try it once and if you get a \"hit\", that's a good thing! I always like to give establishments a 2nd chance, so I will return another time...perhaps next year when I return for my annual visit. I am not interested in trying it again while I'm still here, though. For now, I'm good.", "author": "Denise R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Today, Artesano upped their game.\n\nI had the yucca fries (solid, just like the first time I had them), the black bean soup (amaze, I tell you, perfect flavor/decorated with fresh jalapeño rings and crema), and mango-orange agua fresca.\n\nYou got it right this time, Artesano. I shall return.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Heaven on North American earth for a South American. \n\nI fell in love with this place for a number of reasons:\n\n1. Delicious food. A variety of options from Brazilian food to Venezuelan food. The food was well seasoned and represented each cuisine it advertised to a tee. \n\n2. The mango sparking water juice was absolutely phenomenal. They also offer watermelon and lemonade versions. \n\n3. The variety of decisions dessert makes it hard to choose, but it also makes he hard to make a mistake. Everything was delicious. \n\n4. Service was outstanding. Friendly staff and people who appear to enjoy their job. Such a graceful ambiance. The decoration was authentic and a beautiful representation of artesanato. \n\n5. My idea of a great place for comfort food. \n\n6. The shredded chicken sandwich is messy to eat but worth every single stain on your clothes. ;)\n\n7. Definitely coming back....", "author": "Monique T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Just had lunch here and it was incredible! Lime coconut shrimp with black beans and salad were packed with flavor. The roasted plantains were incredibly sweet. The bread pudding was a wonderful indulgence. Quick service and lots of flavor.", "author": "Char E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "The Sol Food of San Francisco, great latin american cuisine", "author": "Arthur M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "I love this restaurant.  Don't miss the bread pudding desert.  It is out of this world!!!", "author": "Randall S. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "I stopped after work just to have \"my\" plantain dish and sangria... nothing too unusual;however, I was approached by one of the best waiters in town, in my opinion, Victor from Venezuela, who was unafraid to present his culinary ideas, introduced new dishes in the menu, provided a  taste of white sangria which i had being reluctant to try... this guy can make you feel at ease and comfortable on your own skin.  I recommend his positive attitude, creativity, openness in sharing, exploring.  Unafraid to be himself in doing what he does best!!! awesome!!! I enjoyed my  brief stay there and was well worth it! Keep it up Victor and Artesano :)  Doug, hope you are listening! and yes! I live in the neighborhood! :) cheers!", "author": "I. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "Are we allowed to use an expletive on Yelp? \n\nWell, if the answer is \"yes,\" I wanna tell you 'bout the chicken: Damn! F-ing #Amazing!! If I gotta keep it PG, I'll just say the chicken was \"so damn yummy, it'll make you wanna slap yo' mamma!\"\n\nEither way, we had lunch for 14 catered to our weekend retreat: HUGE success. Generous portions, an array of spice & aromas to tickle the senses and satisfy the tongue.\n\nThe vegetarian options were equally as tasty (or so I'm told) - I couldn't tear myself away from the \"Chicken Artesano\" marinated to perfection in oregano & garlic. Once again, DAMN!", "author": "Nick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-15", "description": "Food is good and good options. But their order sustem is really bad. I felt under pressure to decide and order as you need to do it at the cashier instead if at your table.", "author": "Ellen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Excellent place for fast casual good food. I absolutely love the Ablondigas (meatballs) in a spicy sauce with white rice and black beans. The new Burrito is also the best, the new menu items keep me coming back, try the lomo saltado too, is super. I live near by and this has become my go to, have never had a problem here.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "The food was great and reasonably priced. My fiancée and I ordered that albóndigas and pulled chicken sandwich which they split it for us without even asking which was  appreciated. Will definitely come back to get more things on the menu.", "author": "Keren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Such a fabulous meal!  We hosted a luncheon for 10 and everyone's meal was perfect. The salads were not soggy and so fresh--unlike some other delivery foods can get.  The hot foods were still a perfect out of the kitchen temperature and taste.  The flavours were so different and appealed to a variety of palates. And the owner was so attentive in making sure our delivery arrived perfectly on time without one mistake in the order--best customer service ever!!  So nice for local owners to take such pride in their business.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-18", "description": "I went here for lunch since it was recommended by one of my instructors during hospital orientation. I've always passed by it and I've been meaning to try it. When I walked in, the smell of their sauce stung my nose. It was like the smell of Sriracha and sweet chil My coworker and I ordered the cubano sandwich and fries. The fries are nothing special. I should've gotten it with plantain chips. But the cubano is delicious! It comes with their house-made pickles. It's a mix of sweet and spicy. \n\nOverall, I give it 3 stars because of the price (expensive!!) and my disappointment in the fries. I'd be willing to come back and see if the other meals could change my score. I'm looking at you, ceviche!", "author": "Czarina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Read the mixed reviews on this restaurant.  Had to see for myself.  Unfortunately I only tried the Cubano.  Can't quite judge a restaurant on one sandwich.  However, if the food is as good as the cubano then they've got my thumbs up.  Excellent Sammie,  juicy pulled pork,  love those pickles!  This could be a bad habit for my waistline", "author": "Jayn' W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-26", "description": "What I ate: Churrasco flat iron steak, watermelon aguas frescas\nVisit date: January 30, 2014\nFirst time? Yes.\n\nExpensive. And I didn't even have leftovers (i.e. small portion sizes). My meal plus tip came out to $24...for lunch.\n\nBut on a good note - the food was flavorful and I left with a happy belly. The churrasco steak is served with a green salad, black beans, and rice. The salad dressing - a nice citrus vinaigrette - was refreshing. The flat iron steak could have been more tender (I found myself chewing for too long), but the chimichurri added much needed moisture. Definitely also add lots of the sauce you find on the table. It'll add a spicy kick and also enhance the flavors on your plate.\n\nThe watermelon aguas frescas was on a different level than most aguas frescas past. This one had sparking water and mint! Yum! I've been back since this visit specifically for a tall icy glass of the watermelon aguas frescas.\n\nFun note: lots of free parking in the back (and metered in the front).", "author": "Erin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "This is a great spot for a week night meal when you don't feel like cooking. The food is savory, the atmosphere is laid back and the portions are generous. I'm glad that I live close by.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-13", "description": "Artesano claims to serve \"Latin Comfort Food\". \n\nSorry, but there is nothing comforting about Artesano's dry AND bland food. Neither is finding a bug in my salad. \n\nMmmm, protein. Thankfully, I'm not a vegan. \n\nP.S.- Poorly executed food + apathetic owner = NO BUENO. \n\nOTHER NOTES: \n*Same as owner Rigolo Cafe: http://www.yelp.com/biz/rigolo-café-san-francisco-2\n*Budget-friendly Americanized Latin  dishes ($5-$16) \n--Beer ($5) and Wine by the glass ($6-$7)\n*We ordered the Grilled Yellowfish ($15) and their Signature Pollo de Artesano (2 pieces - $11). \n--Both were terribly dry and bland. My chicken tasted like overcooked, boiled chicken with dry oregano sprinkled on top. \n*Mr. NSS saw a bug crawling in my salad. \n--Waiter apologized and brought me a new salad; dish was not comped. \n--Owner was 2 feet away, saw/heard what happened, and did absolutely nothing. \n*Casual and lively decor with open kitchen, counter seating, communal table, booths, and fireplace.\n*Free parking in shared private lot in back.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-31", "description": "Stopped by after a disappointing lunch at Rigolos (same ownership) hoping that artesano was spared. Unfortunately doesn't seem like it. They reprinted their menu on paper- no obvious food changes but their prices did look higher. Last time I was here the staff highly recommended the brownie with dulce de leche, so I figured now might be a good time to try it. Raise my spirits after a terrible lunch at Rigolos. \n\nDon't get the dulce de leche brownie. \n\nSore bought mini brownies. The guy scraped the bottom of a bin to smear on a bit of tastless \"dulce de leche\" sauce. For $6, next time I'll go buy a can of condensed milk and a tub of store brand mini brownies and make my own damn dulce de leche sauce. \n\nDepressing. Really depressing. What used to be two great restaurants...\nTo contrast with the first time we ate at artesano- right when thy first opened, my husband ordered the chicken guisado. They had run out, so instead the chef whipped him up a dish from scratch that was hands down one of the most incredible and complex chicken dishes we'd ever tasted.  Simply phenomenal. Now incredibly disappointing.", "author": "Heather K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Big shout out to you guys! My sister is visiting SF this weekend, and I was able to call in from Roseville, Ca and order! I ordered my fav plantain chips, and I was able to pay over the phone! So thank you guys! It's been a long while since I've been able to enjoy your oh so wonderful plantain chips!! Oh! Ordered a bottle of pique sauce too!! Woo!!!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Artesano happy hour is the best here! Javier was a great server. They have good food and drinks for a very good deal. Would definitely recommend coming here", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Stopped by on a chilly evening for a bowl of amazing Chicken Chipotle soup.. Wonderful lively vide and very fast attentive service !!", "author": "John K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-09", "description": "Sandwich: 5 stars\nBang for your buck: 3 1/2 stars\n\n$13 steak sandwich with no sides included. Excellent and tasty sandwich but they should throw in some fries. \n\n$4+ for the Agua Fresca. Tasty but pricey. You can skip this and grab a free water. \n\n$19 and change for 1 person for the items mentioned above.  Lower your prices and you'd have me coming here every single day!", "author": "Ivan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-18", "description": "The pork is very flavorful. The prices are a bit high and doesn't include any sides like fries.", "author": "Julian T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-27", "description": "Artesano is a casual establishment with a casual attitude.  The food is good - not spectacular, but solid and relatively consistent.  During the day the have \"counter service\" - order at the counter and get a number.  In the evening they now do \"sit down service\" - more traditional restaurant style order at your table.\n\nI have been here a handful of times for both lunch and dinner.  The menu is the same for both.  In addition to the food offerings they have beer and wine - including Agave wine cocktails. \n\nOver the past year I have sampled about 10 different items on the menu.  They ranged from good to very good.  For the starters I particularly enjoyed the Yellowtail Ceviche and the Albondigas as well as the Black Bean Soup.  The Quinoa and Kale salad was flavorful and healthy - two things that don't always go together.\n\nFor the main meal item I usually get a sandwich (often because I am getting it to go or I am there for lunch).  I enjoy the Cubano - while I have had better elsewhere (Miami, L.A., Buenos Aires), I haven't had a really great one in the SF area.  This is probably the best I have had so far in the area (Note: I have not yet been to Parada 22).  I also have to say, I have been getting Cubano sandwiches long before the movie Chef came out - seems everyone says that since they saw the movie the need to order them.\n\nThe Albondigas Sandwich is good, but I think I prefer the meatballs on their own as served in the starter item. I also enjoy  the grilled fish sandwich, though I think the sandwich masks the more delicate flavor of the fish.\n\nFor main plates I prefer the Grilled Yellowtail.  The steak has been ordered twice - once very good and once it was sort of tough.  \n\nSo overall I would say that it isn't my favorite place in an area filled with plenty of good options, but it is good enough and convenient enough for me to keep coming back on occasion.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "This is our first time coming to Artesano, we were looking for a good sandwich to satisfy our appetite and we found just that with the Cubano sandwich and the steak sandwich. Both supper yummy! Great customer service as well.", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "I've been here a few times and I love love their their pulled chicken sandwich, Caesar salad and fresh squeezed limeade. \n\nThe pulled chicken sandwich is comprised of pulled chicken with sweet-spicy cole slaw and cilantro lime crema, $8.99. This sandwich is messy but I love it anyways. \n\nThe Caesar salad is made of chopped organic romaine with creamy serrano Caesar dressing, shaved parmesan, and house-made croutons. It's $7.99. \n\nTheir fresh squeezed limeade is $3.75. It's actually one of my favorite drinks of all time. it's so refreshing on a long day. \n\nThere is a lot of seating inside the restaurant and some seating outside. \n\nI've always gotten my food to go so I can't say what it is like to sit there and eat your food but it does make for great take out. \n\nThe to go service there is great in my opinion. When I call, they are always nice on the phone. When I get there, they usually have my food ready and all I have to do is for them to make my drink. \n\nOverall those three items are great and I would recommend them to others.", "author": "Joyce H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "The pork was so lender it melted in my mouth.  My youngest daughter is gluten free and she suggested we check it out.  I'm glad we did and I'll return.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-16", "description": "Food is good but their Health Inspection grade indicating 100 is from 2014. The latest is 87. They should really not mislead people. Also there were 4 mouse traps under the entry bench inside.", "author": "Pablo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "The danger of randomly picking a place to eat at, is that you never know what you're going to get.. Sometimes good sometimes bad. Well this was definitely one of the good ones..at least for the 2 items  i chose for my light lunch. I ordered the Jicama salad and the Yellowfin ceviche. Both were quite good. I especially enjoyed the refreshing citrus dressing of the Jicama salad. The Ceviche was good as well despite a little lack of salt...and i couldn't get enough of the Plantain chips which comes with Ceviche. Good stuff..the meatballs look interesting, i guess i have to go back ;)", "author": "Orlando J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-11", "description": "Not the Latin food you are looking for. the place sounded like a good idea but after a few attempts the conclusion is that the food is clearly no good, this is at best a very weak attempts at Latin food, the ingredients where bland, all que preparations are \"Mexican style\" the drinks are not even close to the real thing.", "author": "Lonnie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "After a difficult time picking a place for a Sunday dinner with friends, we decided to try Artesano. We all enjoyed the ambiance of the restaurant very much -- it is very bright, open, colorful, and modern.\n\nThe food itself was great. I had the steak churrasco dish and loved it. The entire plate was flavorful, and my steak was cooked at a perfect medium-rare. Everyone at our table ordered an agua fresca and they were all delicious and refreshing.\n\nI didn't experience the poor service that it seems like a lot of reviewers did.. In fact, we all enjoyed our night and loved the vibe/ambiance inside the restaurant.\n\nMy only gripe with Artesano was the portion size, specifically on the appetizer I ordered. My main dish was good, but the shrimp skewers appetizer is literally just four shrimp, for $11.99! I felt a bit cheated by that, and definitely was not expecting so little.\n\nI would come again, but will likely stay away from ordering the same appetizer!", "author": "Greg J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Amazing.. I loved their peruvian vegetarian stew.. it had perfectly seasoned squash and a medley of veggies simmered in only what heaven could be made of. I loved it so much I even started to lick my bow towards the end.. yeah I'm pretty embarrassing. Oh and their ceviche was good too, it comes with a side of fried plantains, but the fish was marinated in a fruity mango? maybe? juice along with the lime. I prefer it without the fruit juice, but some others might like that. Overall this place was awesome.. their prices were super reasonable too and their service was quick!", "author": "Eleana H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-10", "description": "The Artesano once aspired to be a great Latin-inspired restaurant, but has degraded into mediocrity.\n\nPrice: High for the area and quality. The price of a salad with steak has grown to near $20. \n\nFood quality: 2.5/5 . I ordered a steak with rice/beans. Despite being one of only three customers, it came out twenty minutes later overdone and tasting of freezer burn. \n\nService: 2/5.. Two employees (presumably the manager and a new employee) were arguing about unlocking the register in front of us when we placed our order. We were basically the only people waiting in line, signaling that it was probably something systemic. \n\nAmbiance: 4/5.. Nice interior, one of the nicest remnants of when this place aspired to be great..\n\nArtesano has potential, but really needs some serious management. Know if you pay their relatively high price, you are gambling.", "author": "Stewart A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "I have been here several times, I like the chicken sandwich and the hard limeade really good! I like the limeade the alcohol one and the non alcohol one both are really good! They taste the same the one with the alcohol gives you the warm buzz.  I also order the rice and beans with the chicken sandwich, really good and flavorful.  Just enough food to leave full, but not overally full where you say ugh I ate too much.", "author": "Alix J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Delicious food and great customer service. Really can't go wrong here. \n\nManagement and cashiers awesome!", "author": "Samantha Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "ARRTTEESSSAANNOOOOO! You had me at the light fixtures and the breezy vibes.\n I finally came here tonight and was so pleased at the food and the service.\nI felt like dabbling,so I created  my own entree. I ended up picking a few sides ; bb n rice, plantains and sautéed kale... 'twas perf.\n\nThe kale was exceptionally tasty, just enough salt- and the plantains were neither too sweet, nor too starchy. The texture of the rice was fluffy and a little sticky, just how I like it. \n\nAnd then let me get to...the Tres de leche cake. OMG. A single massive cut piece of heaven with a thick runway of whipped cream atop it was what was brought out to the table.Being the mannered person that I am, I could not let my mom eat the whole thing on her own, so I obliged. :)  It arrived chilled, and the cake itself was really airy, though it was magnificently coupled with a hint of density from the caramel.  Anyways, it is made in house and the recipe is a secret...those are always the tastiest!!\n\nStaff was 5 stars-  friendly, very aware  and hard workers! :)\n\nCheck out this hot lil latin restaurant - it brings much needed heat to Laurel Village. Meow.\n\n\nPS: IT IS IMPERATIVE THAT YOU GET THE YUCCA FRIES. OMFG.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-19", "description": "Food needs to be fresh, especially at the prices Artesano charges. Day old yucca fries taste rancid & bitter and the texture is not crispy. Also, black beans need to be fresh -soaked in water overnight and cooked slowly the next day. Onion and garlic a must. Artesano's beans have the bitter after taste of a can... not good! I think kitchen staff is not paying enough attention or they are not of Latin American origin like me. Regardless, well prepared comfort food is awesome but needs attention to detail! \nNet out: Too expensive for mediocre tasting Latin American food. Okay in a pinch but I always walk out feeling disappointed in the quality and ripped off. Lacks love in the preparation.", "author": "Patufla P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "The chicken artesano was phenomenal! I'd say easily one of the best cooked pieces of chicken I've had in the last few months. \n\nIt was definitely on the blander side so I had to add some of the salsa picante they had on the table. \n\nThe rice and beans were tasty, though very average. \n\nThe side salad was just a few pieces of lettuce and dressing. It felt a little out of place with the rest of the meal. \n\nIf you're looking for something reasonably priced, reasonably healthy and you're not feeling like taking a risk, this is your dish. \n\nSuper friendly service and a lot of other tasty looking items on the menu so I'll be back for sure!", "author": "Geoffrey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Delicious comfort food!\nOne of my favorite places for grab-and-go meals. The taste of homemade without the time cooking/doing the dishes. I adore their un-pulled-pork, such a delicious meal served alongside rice, beans, and a citrus garden salad. Their portion sizes are great, can easily be split into two-meals or shared. All of their staff is friendly and upbeat. Each visit I walk away with a great meal and time-shared with their wonderful staff.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Pretty good comfort food. The chicken Artesano is great value. \n\nThe food is usually ready really quickly. \n\nIf you go to the JCC nearby you can get a discount on the menu.", "author": "The Brave I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Great spot that I frequent. They have happy hour every day (even weekends) with buy one, get one free drinks and great deals on appetizers. Try the Chicken Artesano (I get this dish every time and love dipping the chicken in the spicy red Artesano sauce) which comes with beans, rice, and a salad (which has a great flavorful dressing) and the Yucca Fries which come with dipping sauces; I also like the Caesar Salad, Ceviche, and the Grilled Shrimp Skewer. I also love that they have desserts, which I'm sometimes in the mood for--I've gotten the Tres Leches Cake and the Dulce De Leche Brownie, and both were delicious. The prices are totally reasonable and many of the dishes can also accommodate healthy diets. The staff are super friendly, give very full wine pours, and are great with kids (my friend brings her toddler, and the staff always interact with him, don't freak if he spills something, give him crayons and paper to color on, and a little wax toy to play with, etc.). They also do takeout and offer delivery through Caviar. And, not like you need any more enticement to go, but they often have 10-20% off Groupon+ Deals. They're in a pretty low-key location that I think gets passed up a lot, so it's typically never crowded. But they're open seven days a week, near a bus stop, and also have free parking in the back of the restaurant. Check it out--you won't be sorry!", "author": "Christina Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-08", "description": "Although there were very few people in the place, service simply didn't happen. Staff is disinterested clearly more interested in their own lunch and break schedule.  I waited twenty minutes for a soup that never came.  Server couldn't be bothered checking on the order, saying, \" I put the ticket in. That is all I can do\"\nC'mon people!  At least try to look like you care about what you are doing.\nI left without getting my soup.\nI think there must be better options for a snack in that neighborhood.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-27", "description": "Aggressive sidewalk advertising, definitely got us into the restaurant with the plantain chip samples which were divine. I didn't wanna get a whole order of chips so I got the chicken soup (comes with a side of chips). It was good but quite salty. My friend got a salad with steak and it was pretty big but she was underwhelmed by the flavors. Based on the prices, don't know if I'd come back when in the neighborhood. Those chips though... damn. The space is also really cute, the whole strip really. High ceilings, long dining room layouts. Friendly staff.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "I tried the albondigas and chicken skewers.  The albondigas were a bit dry.  Not sure if they're cooking frozen meatballs or not, but they weren't fresh with moisture.  The chicken skewers were a bit of a let down.  They have their own hot sauce on the tables, but the texture is too watery.  Barely tip the bottle and most of it comes out.  The flavor of the hot sauce is ok.  The table I sat at wasn't sturdy/leveled and it kept moving - which was slightly annoying.  The restaurant appeared clean and tidy for the most part and I was there post-lunch.  I'll try the place one more time and will definitely try something else on the menu.  Hopefully it will be a hit.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "Was just walking by and smelled something delicious.  Walked they the doors and it was quiet and empty (4:15pm on a Fruday), but smelled even better inside.\n\nThe portions were huge, and everything was delicious.  Also, I recommend the Agave Wine Cocktails. Uh huh.", "author": "johnny j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Went in for a quick bite and had the kale salad along with their Cubano sandwich and both were excellent. This a great little spot and ez to grab that coffee after your done as it's right next door to Peet's.  \n\nLook forward to stopping here again when we are in the neighborhood.", "author": "Glenn P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-17", "description": "Went to check out Artesano just a few days after its opening. I was pretty excited at first reading the reviews, then after carefully looking at all 6, it seems like only a few of them are \"legit\" reviews. Which made me a little nervous since they weren't as complimentary as the other ones. \n\nFood: Food is okay. If I lived around here, then I'd probably stop by more often. However, not living in the area means I probably won't come here again any time soon. \nSignature Chicken Dish: Disappointing. LIke another reviewer said, it was dry (shocking considering it's dark meat) and not particularly flavorful. It didn't even look nice-- had this pasty white look to it. \nUnpulled grilled pork: pretty good. I would order this again. It was much more tender and pulled apart more easily than the chicken. Surprising that the rice that comes with it is \"sticky\" and not as grainy.\nYucca fries: Standard. Nothing special but it's not horrible. The dipping sauces were weird though.\n\nService: Considering it's brand new, the service was pretty good. It was a little bit confusing because when I first went in, a hostess/waitress asked me if I were dining in or getting takeout. I said dine in... and she started walking towards a booth and I wasn't sure whether to follow her or not. Instead I stood around awkwardly and just asked her whether they seat us or it's first come first serve. she said to grab our own seats, but later I saw another guest being seated by a waiter. Our waiter often checked in on us, which is nice, but it was almost excessive. I know it sounds nitpicky but when you're trying to have a conversation with someone it gets annoying to be interrupted often.\n\nSummary: If you're in the neighborhood and hungry, by all means try Artesano (but not the chicken). Don't go out of your way to try it though. Much prefer paying a little more for Limon Rotisserie or La Fusion.", "author": "Nanette W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "Stopped by after a SF stairway walk.  Cuban sandwich was fairly standard and tasty.  fish sandwich was good, only the fish was a bit dry, but still had good flavor.  The strawberry lemonade was refreshing with plenty of chopped strawberries.  I also tried a side of their cilantro lime crema, which I thought was very good.  Nice place, great service, clean, plenty of parking and an overall nice atmosphere.  I will return!!", "author": "Brian K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-09", "description": "I like the place is new and cute \nGood food\nThe wine list was ok nothing special but for a small restaurant I would say it is ok \nAlthough the amount of wine served on the glass was a joke \nThe glass  was half down I asked the waiter is this right????\nHe responded ...that is the owner's rule \nUhummmm", "author": "A. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "Being hungry and in a rush sometimes makes you want just about everything. I passed through this place on a busy day and I said to myself, \"I have to try it\" \n\nI'm giving this place 4 stars because it was a little different in terms on the layout of the restaurant and the food itself. When I first walked in, I thought I was going to order at the registers with the menu up on top. It turns out they actually sit you at a table and then give you an actual menu before you order. It was unusual but ok. I had the Albondigas sandwich which was really good. It had meat, chocolate and a fruit of some kind. I'm guessing either mango or papaya. I'm not really sure. I had to order serrano peppers to spice it up for me just to make it taste just right. I would try this place again when i'm in the area.", "author": "Hector C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-08", "description": "This place is far too expensive for what you get. I just had a terrible $19 salad. Yes, a $19 salad. I always get my food to go as I live a couple blocks away. I have a feeling that the register boys take offense to not receiving a tip as the quality of my food has continued to decline each time I order, that or the food quality is just declining.\n\nTo the owner: I will no longer be frequenting your establishment. We had a good couple months. Please let the register boys know to not expect tips for putting a $19 salad in a $.10 plastic bag. Also, please let them know that your cost of doing business is lower for those diners who take food to go and that you actually should prefer that business. Important lesson to be learned here. \n\nBest of luck.", "author": "Steve J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-11", "description": "SF hit in the making--the ambiance is there, but the food isn't quite there yet.  \n\nThe shiny new storefront fits right in with the quiet, pleasant neighborhood, almost reminiscent of Carmel.  You are first greeted by the perky patio furniture, which has such a colorful and minimalist design that it could be a subliminal iPhone 5c commercial.  Inside is a fun, casual atmosphere.  The high ceiling is crisscrossed with strings of lights, and the open kitchen spans the length of the restaurant with an accompanying bar stool seating area.  The modern stainless steal chairs are comfortable, contrasting the rustic wooden tables (fusion ambiance?!)\n\nService was friendly.  I don't think I've ever encountered a server respond in such a courteous manner when I asked for water.\n\nAfter much thought, I ordered the Pollo Guisado, $13 (slow-cooked chicken with vegetables, pineapple, and fresh chipotle sauce, with side salad, beans, and rice).  I expected the chicken to be more memorable, but it was rather bland.  There wasn't much to it that would categorize it as Latin comfort food; the cooking style was homemade but closer to American-homemade than secret-recipe-from-Latin-America homemade.  The salad was fresh and the balsamic dressing was tastier than the standard out-of-the-bottle salad dressing.  Nothing special about the beans, but it's healthy and fills you up.  The rice was meh.  Not only are there no options besides white rice (yes I am one of those health freaks who is adamant about brown rice), but they don't even cook it correctly.  It's sort of mushy and in aggregate clumps.  Other than the rice, the food is not bad, but I would expect something more unique and/or organic.  It came out to $14.40 total, which I consider a pricey lunch, even in SF.\n\nOverall it's a nice place, and casual enough that you could probably even stay to do work like at a cafe.  Since it's right next to a Peet's, you can mooch off their wi-fi with no problem.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "You Yelpers are such idiots. \n\nThis place so amazing... first bite and its 5 stars all the way.\n\nI am eating the fried Yucca with the 3 diffrent sauces and the shrimp skewers. Plus who doesn't love Mexican coke? ;)\n\nI feel like I just saw Jesus or something.\n\nHalleujah.", "author": "Chastity C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Chicken Artesano is a hidden gem, delivery times are acceptable and quality of food reminds me of New York ( Hometown). Flavorful, simple, clean, Latin comfort food. Chicken Artesano a must!. If you're feeling adventurous try the  coconut bread pudding and or the tres leche cake you won't regret it. My only advice would be to share this meal. Generous portions.", "author": "Miko F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "I've driven and walked by this place numerous times and this is the first time I've ordered take out. In the past it didn't seem busy so I was apprehensive. I have to say I was really happy with my food. \n\nI ordered the kale/quinoa salad. It's soooo delicious -balance of citrus salad and thrown in nutty cashews and sweet stewed raisins. So GOOD. I ordered a chicken with side of beans and rice for my daughter. They gave me the child portion for $7. It was perfect and she ate it all up. \n\nI think people may have passed on Artesano in the past bc of the unfamiliarity of latin comfort food as I was. But actually the food is relatable and excellent. I hope others will give it a try !", "author": "Sam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "So I was way harsh on this local joint when it opened. But it was deserved. However, we've been back a few times (after getting gift card) and we've been very pleasantly surprised. The menu is tighter and the service is crisp. The food is very tasty. I'd only add that the stake need more chimi churri.  This is also a great spot for kids. So thank for getting better and making us regulars.", "author": "Donald C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-21", "description": "I tried this place two times. The first time was a disappointment but since I love Cuban food I decided to give it a 2nd shot.\nThe 1st time I ate here, I ordered the Cubano. Absolutely nothing special. It was actually burnt a little on the bread. The meat was not tender and tasted plain.All foodies know that Cubanos aren't supposed to be burnt at all. And for over $13 you would think that would include a side salad or at least have organic ingredients , but no such luck here. I guess you need to go to Miami to eat a true Cubano sandwich.\nIn addition to this first sandwich, the guy at the register forgot to bring me my fresca drink and completely ignored me when I stood waiting for a good 6 minutes to ask for water.\n\n2nd time I ordered a fish sandwich.  It took forever for them to get it to me. Then I noticed it just lying there on the counter. By the time I ate that fish sandwich it was pretty cold, and very soggy. It was actually soaking. The liquids had completely soaked through the bread and it was a hot mess. Not appetizing in the least.  And for over $14 a sandwich , again one would expect a side salad or fries without any additional charges.\nThis place is over priced but not that good. I don't mind paying a lot for food as long as it's good and worth it, but stear clear of this joint. Seems like it's overpriced and the employees don't really care. In fact, it's downright mediocre. I will not be returning.", "author": "Mary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "3 great sandwich experiences has made me a fan.  First was the yellow-tail sandwich- relatively light but tasty and filling.  Had a great side salad.  Next experience was a pulled chicken- messy and indulgent.  And finally- the Cubano- a big winner and something I will never turn down!  Also love their fries (papas fritas) and the staff has been friendly and courteous on our visits.  Take-out has been great, and oh by the way- they have a delicious spicy chili sauce on the tables- make sure to ask for some for takeout.  Great casual experience with excellent tasting food.  I will be back for sure!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "This place is amazing. The Cuban sandwich is incredible as well as the pulled chicken. \n\nOrder a fresh mango drink to wash it down and you won't be disappointed. \n\nI'll keep coming back here until I try everything.", "author": "mark l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "The food is good here, service is fine\n\nTry:\n\nChicken skewers, meatballs and a side of roasted veggie!\n\nDO NOT GET:\n\nStrawberry lemonade,  extremely overly sweet.\nUnless you love drinking a bag of sugar", "author": "Moto B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "I've only had the classic Cuban sandwich. And it did NOT disappoint. SO good. Very authentic and very tasty. $10 for one. \nThe decor and atmosphere are just great. LOVED it. It's open kitchen so gets loud. But kinda feels like being in Cuba so.. \nThe drinks are a must. Incredible lime, watermelon and mango drinks. \nThe chocolate dessert  is very disappointing. It's very descriptive and the dessert menu uses the words dolche leche a lot but $6 to $7 (give or take) is way too much for a cold brownie with a little dollop of caramel sauce and the same of some cool whip style cream. Not good enough.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "Great food.  Lots of Gluten free options.  Little pricey, but sooo worth it.  Everything was fresh and restaurant was clean.  People were nice.  Only found it cuz I had to get an MRI across the street, but would definitely come back next time in area.  :-)", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "I've never been disappointed by this place.  Their chopped salad is a staple of mine! The dressing is delicious, I love the addition of the jicama, and it is always fresh. Adding the pulled chicken puts it over the top [in a good way]. I could eat the pulled chicken every day it is so darn good! No it is not cheap but it is authentic, fresh, well made, delicious food.", "author": "Andrea A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-12", "description": "What do you get when San Rafael's Sol Food stubbornly refuses for years to open a location in San Francisco? This copycat. Artesano's rotisserie chicken and side salad are better; but most importantly the sweet plantains are worse than Sol Food's.\n\nSkip the strawberry lemonade unless you enjoy sucking on a bag of sugar.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "I've rated this place as three stars because of the price. If I could order everything I got and they charged $5-8 less, I would give this place 5/5 and return every day. The food is really, really good and they have a variety of options to fit whatever mood you may be in. I wish there was a way to give 5/5 stars for quality of food, and then 1/5 stars for pricing, but I guess I'll average it out with 3/5. \"Well isn't higher quality food worth more?\" Absolutely! But this restaurants prices are pretty outrageous.", "author": "Neil T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Brownie points.\n\nTwo points for the grilled yellowtail sandwich. Average amount of OK fish for a way above average $13 price. Pineapple salsa was too subtle. Not impressed.\n\nFour points for the grilled chicken skewer. Impressive amount of delicious poultry plus two roasted plantains and shredded veggies for $7. Really enjoyed.\n\nFive points for the dulche de leche brownie. Overwhelming amount of rich chocolate, nuts and hint of caramel with a side of namesake sauce for $6. Maybe the best ever.\n\nExpansive space has plenty of seating with cool Mason jar lamp accents. Casual for dining in and efficient for taking out. Staff was pleasant and welcoming.\n\nThese points add up to four stars.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-01", "description": "Low stars for the service. They were disorganized and i watched everyone behind me in line receive their orders first. Food is pretty good but inconsiderate service really put me off.\n\nWalked in late afternoon and it looked fairly empty - figured we beat the lunch rush. We put in an order for a steak sandwich, cubano sandwich, and small fries. We were the first to order and suddenly several others walked in behind us. 15+ minutes in i see plates of food ready - just sitting. Moments later a girl who was on break then gets up from her seat. I'm like \"woohoo!\". Unfortunately she goes to clear one table and ends up just looking at some of the food. She does nothing with the plates and sits back down. Maybe her break wasn't over?? I was about to go up to the kitchen and pick up my own food. One of the guys in the kitchen finally comes around and starts fumbling with all the tickets. Everyone who ordered after us was served their food first! Once he gets to our ticket and reads our order he probably realized it's been sitting around and touches the sandwich with his hands to check if it's still even hot... \n\nThe sandwiches itself were great. The steak had a lot of flavor, cubano was filling and the french fries were perfect. If they can find the right staff to help the kitchen i think Artesano would have provided a much better experience.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "I agree with what seems to be a consensus here... decent food, good flavors, maybe just a little expensive.  SF is getting expensive these days though.  Maybe I expect it to be cheaper for a place where you order at a counter.\n\nThis was my first time here, and I got takeout.  For $29 I got the grilled shrimp entree with the quinoa upgrade and the yucca fries.  There's six prawns (about 21-25 size) and seven yucca fries.  Dipping sauces are good.\n\nI could probably find the sweet spot at this place where I knew what I liked and thought it represented a reasonable value.", "author": "G M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-25", "description": "Not much to write about here except their vinegar hot sauce is very tasty. You'll need it to spice up whatever dish you order. Sangia is eh, pitcher which is two glasses exactly the same price as two separate glasses which I find humorous. my chicken was dry and desperately needed the hot sauce. My friends fish very dry. Not a lot if choices in this area at night maybe that is why it stays open", "author": "Matt A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "It is on the pricey side, and I think the waiters are pointless. With that huge to-go ordering area, and kitchen running along entire room, it doesn't feel like a sit-and-be-waited-on space. Also, in such a family neighborhood, they should have a kid-specific menu for picky-eater kids.", "author": "Pickles P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-15", "description": "It's difficulty to screw up a meatball sandwich, it was pretty bland and not worth the $14 price.", "author": "Lane B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-12", "description": "11/11/14, around 4 PM, was the first and most probably the last visit we'll do to \"Artesano.\"   \nWith the fried platano/plantain; what is so difficult about serving some nata or cream or sour cream when a patron asks?  We did not ask for whipped cream, however, that's what the cashier placed on our table!\nMaybe by turning the loud music down?\nThe steak sandwich was eaten a knife and fork; chewy meat on hard, hard bread.\nThe new name for this place should include \"not authentic style to any one country.\"\n\n\n\n11/11/14, alrededor de las 4 pm, fue la primera y más probablemente la última visita que haremos a \"Artesano\".\nCon el platano frito / plátano; lo que es tan difícil de servir un poco de crema nata o crema agria o cuando un cliente pide? No pedimos para la crema batida, sin embargo, eso es lo que el cajero colocado en nuestra mesa!\nTal vez girando la música a todo volumen hacia abajo?\nEl sándwich de carne se comía un cuchillo y tenedor; carne masticable en, pan duro duro.\nEl nuevo nombre de este lugar debe incluir \"el estilo no auténtico a cualquier país.\"", "author": "Corinne d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "this place was amazing! I went the other day for my first time and already want to go back. I got the tortilla soup which was so good and served with plantain chips which I loved. also got the chicken and beans with a salad and the chicken was amazing and so tender, salad dressing was nice and fresh tasting too! it's nicely priced too nothing ridiculous that you usually see.", "author": "B G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "I've had the Chicken Artesano, Unpulled Pork and the Churrasco Steak. The food is solidly good with flavorful meats. Have also enjoyed their watermelon fresca, yucca fries, and sautéed organic kale. Kudos to Artesano for offering food that is safe for people with allergies. The kid portions are a reasonable price and size which makes it a family friendly restaurant for us. I have had poor service on the phone when I was ordering to go and the person helping me claimed that the Churrasco Steak could not be made into a kid portion when we've had that a handful of times in the restaurant.\n\nLast time I was here with a friend, I was served my food immediately but my friend waited more than 10 mins for hers when she had ordered before me. A server apologized for the kitchen mix up and she got a complimentary side of vegetables. Good call, Artesano, since it was her first visit.\n\nMy first visit was 10/14 (I hadn't tried it until then bc of the poor Yelp reviews) and I've become a regular since.", "author": "Chew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Love, love, love Artesano.\nI love the concept. Fast, casual, healthy Latin food. I've come mostly for their salads which are delicious and healthy. I had a kale and quinoa salad and their chopped salad - both were out of this world delish and I love that you can pick a meat to add. I've had their chicken which is fantastic, but their steak is super flavorful, juicy, cooked perfectly, great quality, and they actually give you a reasonable portion for the price. SO AWESOME! And their black bean soup is really flavorful and wonderful as well. I've come at lunch and received my food quickly, and at dinnertime - well let me just say dinnertime is the time to go. When everyone else in SF is getting gussied up to grab an uber and wait for a seat at their favorite restaurant, Artesano has the space for you to hang out or get takeout. Totally worth it and I sure hope they stick around!", "author": "Celeste R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "This place actually keeps getting better and better. \n\nFrom a food perspective there's little resemblance to my original 2 star review; this restaurant has really turned it around.\n\nCame for lunch yesterday, had a really good steak and quinoa salad, my wife had prawn skewers. Great grilled flavors without going overboard. \n\nService is quick and there's plenty of room for the stroller.", "author": "Marten A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-29", "description": "After debating with myself back and forth about whether I should give Artesano 3 or 4 stars, I finally decided on 3 (as you can see).  The reason for rounding down instead of up, is because of the arrogant service.  Our server seemed annoyed of us the moment we walked in.  I understand that everyone has a bad day, but jeez, this guy needed to lighten up. \n\nAside from that, Artesano (now open for about 7 months), was pretty enjoyable.  The atmosphere is cozy and vibrant, with a warm fireplace at the entrance, perfect for those chilly San Francisco evenings (aka perfect for every evening).  The food was also pretty good!  The bf and I ordered the ceviche for our appetizer and the jicama salad with yellowtail and the pulled chicken sandwich as our entrees.  The food was nothing to call home about, but it was good enough that I will definitely come back to eat again.\n\nIf you are in the mood for a relatively quick, casual dinner that will leave you feeling satisfied, then Artesano is your place!", "author": "Juliana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-07", "description": "ordered the black bean soup to go.  the way they packed it caused it to leak and as I grabbed the bag from my car, it leaked enough to saturate the bottom of the bag and out came the soup -- splat!  Black bean soup all over the sidewalk, my shoes and pants.  Thanks much Artesano.  Wasted my time waiting (at least 10 minutes) for them to put $8 soup in a cup to have it spill everywhere.  awesome.  thanks.", "author": "Sabine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "Healthy and delicious and lots of options - I really liked this spot and can't wait to return. The sweet limey salad dressing was addictive!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "I was a little heartbroken when I learned Asqew closed... but Artesano is now in its place and is set up exactly like its predecessor. I loved this location when I lived in Laurel Heights, so I was glad to return to the neighborhood and find a restaurant with a lively menu and friendly staff. I opted for the shrimp dish which came with rice, beans and a little salad- similar to the blackened prawns that I always ordered at Asqew. The shrimp came on little skewers and had an amazing flavor paired coconut-lime rice. Yum. I had a limeade to complete my little meal and it was the perfect combination. There's also a lot of sides, salads and sandwiches to choose from!", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-22", "description": "I have fallen madly in love with Artesano's Chopped Salad and Grilled Shrimp! Because of my love affair with said salad...it's been challenging to try other items on the menu. Taylor, the mastermind behind the menu, is a very integral fixture of Artesano, and every time I've been, he's been busy working in the open kitchen, out cleaning tables or manning the register and greeting customers. I always enjoy when the chef cares enough about his food to come and ask the customers what they think!\n\nArtesano is one of my lunch-time favorites. The service is fast and the food, superb! The yucca chips with sauces are divine, and of course, my all-time crush...the coconut lime shrimp. I seriously dream about this shrimp!\n\nI've also sampled the pulled chicken sandwich - delicious!\n\nSo glad Artesano is in the 'hood - see you around for lunch!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "Loved the flat iron steak - comes with tasty rice & beans and side salad... good portion for the price! definitely a much needed addition to Laurel Village.\nService was prompt as well.  Will return!", "author": "J D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "Not-at-all surprisingly delicious!  Laurel Village has needed a breath of fresh air for a long time now and because I live across the street, I was getting tired of my options.  Cue Artesano, a fantasic, delicious, quick nosh spot to steal my heart as the Laurel Village restaurant du jour!  \n\nWe called in to place an order for pick up and within 30 minutes we were feasting on albonidgas and plantains, steak sandwich and sides of rice, beans and mixed greens.  The albondigas were large (big enough for a light dinner serving), SUPER flavorful, moist and had just the right amount of heat.  Served with plenty of sauce for dipping and a side of plantains that brought me back to Costa Rica.  Hubby's steak sandwich was also delish- the mayo totally made the dish and the steak was awesome.  Beans & rice just like they serve 'em in Central/South America- basic black beans and rice.  \n\nAll in all, I'm very excited to have this place in the 'hood.  Minus 1 star because it really is a little pricey **BUT** that's to be expected in Laurel Village.  Absolutely will be a regular here!", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Been here half a dozen times, and everything is consistently good.  The plantains and coconut bread pudding are standouts.", "author": "Tony V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-21", "description": "I've been going here since they opened and the quality continues to go down and the prices continue to creep up. Bad combo. Two sandwiches with fries and two drinks used to be a little over $30 and now it's a little over $40. Fries don't come with a lunch sandwich? Seriously? That's some nickel and dime stuff. The food is usually pretty good but at this point I think they are just trying to cash in on affluent customers in Laurel Heights who probably don't care how much their lunch costs anyway.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "A fantastic new addition to Laurel Heights for a casual dining option.\n\nThe service here is fantastic.  Melody was super sweet, kind, and really knowledgeable of the menu.\n\n - Chicken: We split the 3 pc meal, and it was plenty. The chicken has a nice crust to it, served along side beautifully prepared rice and beans, and a nice garden salad.\n- Yucca Fritas: Light and crispy. The three dipping sauces all hit different taste buds, but I preferred the cilantro lime.\n- Ceviche: According to my fellow diner, he said it was fresh, clean, and well seasoned.\n- Cucumber Lemon Aqua Fresca: Man! This was good. While I chose wine, this drink is perfection. If only it had some rum, I would feel like I was on vacation\n\nOverall, this will become a staple for us in the hood. Casual dining, with reasonable prices.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "Oh yum! Ate here for the first time today, a working lunch with my husband, and we can't wait to come back for a date night. Everything we ate was delicious. (It's his 2nd time dining here since they opened earlier this month.) Fun atmosphere, great service! Owner and chef both stopped by our table to make sure everything was good (it was!)\n\nWe tried the \"don't miss it\" artesano Pollo entree, DIVINE, even the rice & beans were delish (& yummy green salad too)! And loved the ceviche too - crudo style, (we're going to try that at home, less chopping & more yummy chunks!) Husband had the pulled chicken sandwich on his first visit and thought it was really good too, plenty of food for your buck too. \n\nGreat, attentive service (table service if dining in, slightly different than their other restaurant Rigolo in Laurel Village - a nice addition to local dining options on California Street). \n\nLove the way the checks are delivered in phrase books. \n\nWelcome to the neighborhood, Artesano. Can't wait to visit you again (& again & again!)", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "The food here is really good, but the portions could be bigger for how much you're paying. First time I got the Albondigas Sandwich, which is sweet in a good way. For a $9 sandwich, it's very small and not very filling. When the waiter brought it out, I was definitely disappointed at how puny it looked. The second time I went I got the Lomo Saltado. This is by far my favorite Peruvian dish and I had high hopes. The Lomo Saltado was delicious, but I don't know if I'd pay $17 for it again. For such a high price I expected a huge dish of rice, steak, and fries, but by the end of the meal I was still a little hungry. The habanero sauce on the table is also something special - definitely spicy and complimented my Lomo Saltado very well.\n\nSince I live so close, I'll definitely be coming back and will try to find the best dish that will fully satisfy me.", "author": "J. D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "This new spot is terrific - run, don't walk!  Casual setting, tasty and fresh food with a warm wait staff.\n\nPerfect for a causal dinner, or perfect for families.  My two little ones gobbled up the rice and beans, Cesar salad and chicken dishes.\n\nA terrific addition to Laurel Heights - yah!", "author": "Dj F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "This place is great. Food comes quickly, though fresh. They have wonderful healthy options. For those trying to do paleo or gluten free, there are great options. We had the 3 piece chicken, kale and quinoa salad, and cole slaw.", "author": "Ron H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "I reviewed Artesano right after opening and was on the so/so side.  They have come a long ways and I couldn't be happier to have em in the 'hood.  The cubano is fantastic, they are nice people and the various sauces and sides are legit.\n\nI still think the steak sandwich could use some avocado, grilled onions, cheese and time on grill but it's probably a bit healthier as is.  Nice!", "author": "Eamonn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "Es muy rico!! Latin comfort food at its best... it reminds me of a place I used to go to on Lincoln Road in South Beach Miami. The food is robust, flavorful and easy... And an unbelievable price point for SF (wine, apps, entree and dessert under $100 for 3 people!!). The food is NOT over spiced like so many Latin restaurants in California. Instead they depend on good ingredients to bring out the flavor.\n\nWe started with yucca fries (an absolute must) and mixed ceviche. The fries came with 3 sauces: one sweet, one smoky and one creamy. The yellowtail in the ceviche was very fresh and perfectly paired with crispy plantain chips. For entrees, we had the Churrasco steak, chicken and non-pulled pork (muy sabroso!)... All three were very rich and tasty on their own but we were BLOWN AWAY by the spicy/sweet table sauce. If the owner is reading this PLEASE START SELLING THIS SAUCE NOW!\n\nWe finished with the best tres leches I've ever had in California. My friends (native Califns) hadn't had it before and we ended up having to order another cuz one wasn't enough. \n\nI've had good South American fare in California and its usually pricey and/or too intricate. This is casual, easy Latin food... A place you can go to several times a week and not get bored or go broke!!!", "author": "Jay E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "Yummy food but very expensive for me what it is - I ordered the steak sandwich. I would eat here a lot more if it was regular overpriced, but not super duper overpriced", "author": "Foodeater F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Let me start off by saying.. 3.5?! I eat at the same nice restaurants in SF that you snobs do too. For what this place is, it's a 5! The Cubano sandwich is awesome! Yellowtail ceviche was a great starter and the drinks are fantastic. Very impressed here and I would highly recommend it if you're looking for a quick and easy place to get good Latin food. I'll be back soon.", "author": "Kenny S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-28", "description": "Good cubano sandwich and sautéed kale. I've been here twice and both times had a pretty good meal.\n\nThe interior still looks like Asqew.", "author": "Christina K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-21", "description": "Expensive for very, very average food.  $13 for 4 shrimp that were definitely reheated and chewy. Fish sandwich was mediocre at best.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-05", "description": "3.5.  We were coming back from the Richmond one evening, when we spotted Artesano and saw a parking spot in front.  Sold.  \n\nI had the kale and quinoa salad with yellowtail, and Tintin had the yellowtail fish tacos.  We  also got the guacamole and albondigas as starters  The guacamole was creamy, and a lighter color than avocado, so I assume something was mixed in.  It tasted fine but I wouldn't order it again. The albondigas were pretty good.\n\nWe both liked our entrees.  My salad was a good sized portion and the fish was cooked well.  We got a couple of desserts to go, the coconut bread pudding and the plaintain custard(?), but both were too rich for either of us. Service was good.  \n\nIt's not cheap, but I thought everything tasted fresh and well prepared, so I'm sure we'll be back.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Great food! Just a little pricey!\n\nI thoroughly enjoyed the \"un-pulled\" pork. My food came our piping hot with a tangy, sweet mix of flavors that'll I'll probably come back for.  \n\nJust wish I didn't have to shell out $15 for a meal !", "author": "Michael F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "Shockingly mediocre\n\nTook the kids here for lunch. It's a standard San Francisco \"cute\" place. All the right schtick: \"Latin Comfort Food,\" etc.\n\nThe food was mostly flavorless. Not simply bland, but generally lacking any interesting flavors, textures, anything that makes my mouth say, \"yeah... this makes me happy.\"\n\nThe prices were absurd for the tastelessness of the food. $13 for a sandwich... want fries with that? Another $3.\n\nThere are tons of really good places in San Francisco, and this is not one of them. Avoid it and go to Beautifull next door.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-13", "description": "Have been here once before with a large group- Maybe 10 people.  That was a bit uncomfortable because they have only 1 large table, in the front which is communal like supenkuche. \n\nA fan on Sol Food in SR, decided to try Artesano's cubano via take out tonight. Order was ready on time, a server provided extra sauce to go after asking- felt happy!\n\nThen I got home..? I put the sandwich in the palm of my hand, and it left room!! I had a tiny baby kitten size sandwich with a purse 12$ lighter.\n\nAsked for extra pickles on this tiny specimen-$1 extra. I have pickles at home I could put on, was just lazy n wanted takeout..\n\nSide salad or fries would = $2 extra\n\nPosting pic in relation to my hand, and I assure you I am not a giant!\n\nTasty, dif. than Sol Food, and won't be going back anytime soon despite the fact I'm walking distance.\n\nXo!! Happy yelping!!", "author": "Osh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "This is quite possibly the best random lunch place I've encountered since I left Washington, DC -- more and more, the food in this city gives me hope!\n\nSo, where to begin? For the gluten-free amongst us, this place is an absolute godsend. I had my first cubano sandwich that tasted anything like I remember from the old days, and I mean it was really really quite good (I kid you not, including the bread). Both of my companions actually downed their portions faster than I did. Maybe I was just savoring, or maybe I should have just ordered the pork shoulder... I had a bite of the pork, and it was very juicy and flavorful.\n\nGiven the location, the price seems right, the food came out relatively quickly during the middle of the lunch rush, and the limeade was really quite good, if a bit pricey. This is something I couldn't find on the east coast, and I'm surprised. Here, west side obviously does it better.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "Yea!\n\nSuper surprised by the flavors here. When I go to Latin restaurants in nicer neighborhoods I prepare myself for milder flavors but not so here. \n\nVery casual family-friendly restaurant that offers to-go at the counter, or sit down service (beer/wine) and friendly servers. \n\nHappy I took a chance on this place and will  be back if I'm in the area. :)", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "The BEST Cuban sandwich I have EVER had, and I lived in FL where you eat a lot of Cuban Sandwiches.  Truly amazing!! I can't wait to go back and try other items on their menu.  Also had fabulous fresh brewed iced tea!", "author": "Catherine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Love the food, been here twice and plan to slowly try everything! Love Caribbean fusions. Had the Cubano sandwich and this time the chicken skewers, great service and good prices too!", "author": "Eva R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-04", "description": "Love a restaurant with parking in the city and I was able to find a space right by the back door at 7pm on a Wednesday night.which was great.  Upon entering I was greeted by a smiling waiter and chief Jeff Gambardella and owner Doug Mathieux on my way to the hostess stand.  She cheerfully greeted the party of six that walked in before me to eat in and informed them that in the evening they offer table service and promptly showed them to a wonderful  communal table near the front window.  Very good vibe for a very casual dining space.\n\nWhen I was greeted by the hostess I let her know that I had only noticed this place last week when driving by and wanted to stop and check it out for take out.  She let me know that it had only opened 3 weeks ago and offered me a sample of their yucca chips.  \n\nI ordered the char grilled steak served with a zesty chichier sauce and the gulf shrimp grilled with coconut lime glaze. The order was prepared promptly and smelled great on the way home.  Unfortunately when I got home and was about the split to the two orders to share, instead of the gulf shrimp grilled with coconut lime glaze I ended up with  fresh grilled line-caught yellow tail served with homemade pineapple salsa.   Since I had worked all day, then had spent 2 hours in the gym, I was in no mood to hop back in the car to return dinner.  So,  I divided up the steak and Fish along with the rice and bean and we have it a try.\n\nWhile the steak was cooked to medium rare I think it may have been sliced incorrectly with the grain as it we VERY tough and was also under seasoned.  It needed a lot more chimichurri sauce than what was provided and I felt the sauce was also under seasoned.  The grilled yellow tail was well cooked but also under seasoned and while the pineapple salsa was very good there was not enough of it to make up for the under seasoning. \n\nI think we will give it another try as dine in.  It was open less than a month so kinks need to be worked out.  The staff seemed great, very inviting and all seemed happy and cheerful.  The owner and chef have good reputations so I am sure they will work out the bugs,", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Good, wholesome and well prepared food served by a friendly and knowledgable staff. What more could you ask for? Dishes are generally healthy and can be made gluten-free. Bonus.", "author": "Kailey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-24", "description": "Their chopped salad is good but not worth the price (12, 13 after tax). It should probably be worth 8. It had a lot of veggies and the vinaigrette is delicious. But seriously. It isn't that big.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-21", "description": "7:47 pm 2/21/2015 I tripped and fell in their restaurant because I needed to use the restroom in an emergency. I went to the restroom right after a 30s year old female customer got out. There was no sign detailing that there was a spill. I went in and tripped and hurt my left leg. I talked to Angel and he said there was a sign as he told another employee to cover the mess up. It's extremely shady. He told me to get out but I said I had ordered things and must be served. He told me in didn't matter and needed to get out or he would call the cops. I should be the one calling the cops.", "author": "Nestor A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "This place is GREAT.  I've come here twice so far, and it's been a perfect lunch/meeting spot for me when meeting people.  I've had the chicken stew with plaintain chips, and the steak platter the other visit.  Both really good, with fast service.  Tons of seating, free parking again and reasonable prices.", "author": "Geri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "I've been coming here since they opened and this place just keeps growing their strengths. The staff are consistently polite, the fire place inviting and food comes out pretty quick.\n\nDrinks are zesty with Mango orange being the best! The pulled chicken sand which is peppery and leaves a nice slow burn once finished. Comforting dinning indeed!", "author": "Steph S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-26", "description": "This place has good food! But just way over priced!!!! I live near by and have gone a few times....only because its close and not many choices. \nI had the steak sandwich which was very good but not for $10.99! It only came as a sandwich a side salad or rice beans was an extra $1.99. Would be nice if salad was served with sandwich especially for the price and size( i was still hungry). \nThey can get away with charging these prices because of location(presidio heights) and no competition(laural heights plaza)  everything is $2.00/$3.00 higher then should be", "author": "kevin b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-14", "description": "The food here is great. I live in the neighborhood and come here often. However I just paid $14 for the chopped salad which was tasty but essentially a pile of lettuce. I'm still hungry. I had this complaint when Artesano first opened and this salad had improved (with more stuff in it) but today it was again mostly lettuce.\n\nA chicken skewer makes this salad $20 which is robbery.\n\nArtesano needs to get it right or stop charging so much.", "author": "Dara T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-30", "description": "Boggles my mind that a shrimp salad can cost $23...and there isn't even avocado in it!\nOrdered a salad for lunch for takeout last week and thought they'd charged me for two salads.  Nope--their chopped salad is $12.50 or so but \"2 shrimp skewers\" set me back another $8.50.  I was a little surprised to find that \"2 shrimp skewers\" = 4 shrimp total (2 per \"skewer\").  What a rip-off.  The salad was fine but I would take Blue Barn or similar in a second--a heartier, better salad for $10 less.  Insanity.", "author": "P E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Love the steak at this restaurant!! Their Artesano chicken is good too but their steak is just so yummy.", "author": "Xbbygirl X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "The grilled yellowtail and shrimp is fresh. Shrimps with coconut smells taste good and good for dry white wine. The bean in the dish of yellowtail is soft and keeps their shape. I just wonder does it taste like original flavor in Latino area?", "author": "Siyat U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Love this spot! Reminds me of Sol Food in marin! Great steak sandwich! Awesome authentic flavors! Pleasantly surprised!", "author": "Shakira M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": "Meh, not impressed. I live in the neighborhood and was excited to finally try it. I got the fish sandwich which was 13$ and paid 3$ for a tiny tiny mediocre side of salad which I thought came with the sandwich? Apparently not. The fish sandwich was pretty bland barely any flavor or spice! However the pineapple salsa on it was delicious. I will go back and try something else but overall not impressed", "author": "Milla K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-09", "description": "This is the first review I've ever written; I'm moved to do it because I am home today with food poisoning.  Not okay, especially when I'm 8.5 months pregnant.  \n\nI had the kale and quinoa salad.\n\nLike the other person who posted about their food poisoning, I ignored warning signs:\n\n-  I did notice the bathroom was horribly messy, that a full dumpster was up against an open bathroom window.\n\n-for some reason, a chef was bringing small plastic containers of what looked like quinoa and kale from the back.  I kind of wondered about that...\n\nAll I know is-- I am livid and pretty upset that I would get food poisoning from a salad, especially when I have a baby and his well-being to worry about.\n\nI don't feel like this restaurant is taking the well-being of their patrons seriously.  They probably need to close down for a day and do a thorough scrubbing and throwing out of food past expiration dates.", "author": "Austy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "I was here again today. I really love their chicken and the plantain chips. I'm starting to realize I have a thing for Peruvian food.", "author": "J C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-01", "description": "I had lunch here with my boss and strolled on in at 11:30am, empty!  We both ordered the chopped salad, he got the yellow tail add on and I got the steak.  I threw in some yucca fritas because I LOOOOVE yucca!  The salad itself was delicious!  Boss man could have done without the fish since it was overcooked.  My steak was a little tough too but nothing a fork and knife couldn't fix.  The total came to about $40 which is a little steep for two salads and \"fries\".  Oh and by the time we left, around 12:15, the restaurant was 3/4 full.  \n\nI would definitely come here to have the salad again or maybe try something else on the menu.  But, it's a little too pricey to come here for my normal lunch spot.  Sevice was also very friendly.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "My best friend who was visiting me from LA wanted to check out a neighborhood she's never really been to before. I decided to take a stroll in Laurel Village and we randomly stumbled into Artesano. I loved how they had both outdoor (it was a sunny SF day) and indoor seating. At first we went with outdoor but then realized service would be a lot quicker indoors, so we went inside. I loved how there were menu booth options - so much more comfortable!\n\nThe menu is huge and has tons of pesce and veggie options! We weren't TOO hungry, so we decided to split the chopped salad and the black bean soup. I was very happy that the chef was able to split both the salad and soup into two separate bowls / plates. Most restaurants won't go through this hassle and will just give you an extra bowl/plate and have you do it yourself. Presentation was great and the portion was just right. I can't imagine that I would be able to finish an entire salad or soup! I loved how much crunch the salad had and the plantain chips that came with the soup were AMAZING! The soup itself needed a little more flavor, but the salad was just perfect and I highly recommend it. I asked for croutons to be added to the salad (do it - they're homemade and delish). Also, their homemade hot sauce is amazing. Next time I come here, I will definitely have to ask for a little to go! \n\nService was excellent! Everyone was extremely nice and very helpful. I loved the decor of this place. The mason jars all around the restaurant are a great little decorative touch. This place is very healthy, which is an added bonus. My friend and I were both very full but didn't feel as though we overate after dining here! I'll be back!", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "This place was really good ordered a albondigas sandwich which is a Latin meatball sandwich it was pretty small but i tried it and boy was it delicious and full of flavor definitely coming back here again!!", "author": "Bryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "Chicken literally melted in my mouth. Best chicken I've had since I was living in Chile.", "author": "Jacob C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-11", "description": "ugh.  i thought this place SUCKED.  service was awful and their black beans and rice tasted like they just dumped black beans from a can and cooked up some rice.  yeah, yeah, it's cuban food but only if you think all cuban food tastes like the stuff from the special period after the USSR fell and even salt became a rare commodity.\n\ni grew up in a cuban family, and man if there is one thing that got hammered into my head, it's that black beans are tasteless if they aren't seasoned well.\n\nso yeah, also, the servers were super rude.  it's not even like they had to DO anything.  we got the side eye and evil looks the whole time and for the life of me i have no idea why.  for walking in and getting food?  good lord.\n\ni got the unpulled pork which i had to douse in mojo to make tolerable.  half of it was straight fat, which is just sick.  some fat is fine for flavor, but yuck. this was sick.  my husband said the cubano sandwich was decent.  my theory is that some people figured out how to make a good cubano sandwich and decided they were cuban chefs from there on out.  so bad.  so so bad.  i haven't had a lot of cuban food in the bay area yet, but stay away from this one.  so far, i'd say cha cha cha is far superior.", "author": "maria f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-04", "description": "I came here after an appointment at UCSF. I love Latin food so I thought, this will be great for lunch! I ordered the yellow tail fish, black beans, salad and subbed the rice for roasted plantain. I love plantain. \nThe food was just okay. It was already cooked I guess and was served hot, but the plantains have  a mushy, overlooked texture like they've been sitting under a heat lamp? The fish came with mango salsa. Great presentation, but dry and flavorless. The black beans needed some spice, and also seemed to have been sitting for a while, NOT fresh. The salad was good. I paid $17 for my lunch. No drink. I won't be back. SF has too many great eats to deal with that again.", "author": "Cali N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Another review from my 4.5 year old:\n\nI liked the black beans. They were gooder than the ones we have at home. I didn't like the chicken (chicken artesano) the next day (reheated) but I liked it the first day. I liked the carnitas (unpulled park).  I liked the rice.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-16", "description": "Don't see why this place have gotten such good reviews. Food didn't taste much and they didn't give me everything I ordered. I should obviously have checked that before I left with my order - but I don't think that I should have to do that. Chewy and slimy  chicken does not help on my impression of the food either. My meal turned out to be rice and beans.", "author": "Andre O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "Great Latin home cooked style food, friendly staff, and fast service :) Perfect choice for a working lunch.", "author": "Abhimanyu Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "The multiple times I've been here the food has always been tasty and never short on flavor. My favorite is their ablondidas. They're flavorful and melts in your mouth. And the first time I went there, they had a sauce on the tables that was amazing. They usually aren't for sale but I talked the staff into selling me a bottle. So now they might be selling it on the norm. And I love their casual decor. They did a great job decorating it. A lot better than their predecessor, Askew.", "author": "Hao T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Tasty food great  for a quick lunch. Frenzy staff and plenty of space. Would come again for a quick bite.", "author": "R M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-06", "description": "This place is a huge rip-off. The 11$ steak sandwich ($12 with tax) is the size of a whitecastle slider. Absurd prices for tiny portions.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "Inauthentic Latin cuisine at best. Ordered the cubano and was nothing like what a cubano should have been. I was super bummed!", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-23", "description": "Ordered the takeout from them. I had a yellowtail platter, when i opened it and try to cut the fish,  I thought they mistaken for order with Chicken. That is how dry the fish was. It was way overcooked. Very Disappointment.", "author": "Vivian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "Great restaurant. It's the best place I've dined at in the City that's emphasized their gluten-free menu. The food is high quality and fresh and they provide ample portions. (Note: One of my pet peeves is feeling like I should eat before I go to a restaurant so I either don't end up feeling hungry or demolish my bank account.) \n\nOne of their salads with steak on it will cost about $18, which is considerable for a salad. However, they are serving you high-end restaurant quality food. And it's a full  meal. This isn't a grab-and-go salad like you'd get at Whole Foods. Their combinations are less expensive and range from $12 to $17: you order the entree and get rice, beans, and greens on the side. They also offer quinoa instead of white rice. \n\nIf you have dietary restrictions, their menu makes it easy to customize exactly what you'd like for your meal. And there's plenty here to satisfy everyone (vegans, vegetarian, meat-eaters, gluten-free types). I passed on their desserts, but my dinner companions confirmed that they were exceptional. \n\nThe decor is casual and fun. I love how mason jars are used for wall sconces.", "author": "Louise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "I wish this restaurant was in my neck of the woods - but then again, I'd likely go broke...Our lunch at Artesano was the highlight of our recent visit to Laurel Heights. Since having 2 kids - I've become even more selective of the restaurants I choose to dine at - weighing in the time, cost and the \"can I make this at home?\" factors. I was unsure of this previous Asqew Grill spot - but my husband said he'd heard this place was similar to \"Sol Food\" in San Rafael. My hand was already opening the door before he could finish his statement. \n\nWe feasted on the below (4 adults 1 child):\nApp: Plantain Fritas  - my 2 year old couldn't get enough of this with their cilantro lime crema. Works for me - she was getting her daily fruit, calcium intake with a lil bit of greens \nApp: Yellowtail Ceviche - Anytime there is a ceviche on a menu I must have it. This was light and fresh with a perfect amount of flavor. \nUn Pulled Grilled Pork - My mouth salivated as my fork easily cut a bite sized piece. Amazing flavor and texture. This was so good I shut my mouth during the meal to avoid having others ask me how my dish was and want a bite.\nPollo De Artesano - For once I was delighted my daughter didn't finish her dish (the kid's (likely too many plantain fritas) - this was delicious. How do they get the chicken so tender? My mouth didn't know which to devour first between this dish and the UnPulled Pork.\nCuban Sandwich - The hubs and his dad had this - honestly I was just trying to keep him away from my unpulled pork, my daughters chicken and my ceviche. I took a bite of his sando but I'd stick with my dish or the lil ones.\nGrilled Fish Sandwich - I didn't try this - but my mother in law, who only takes 2 bites of any dish she orders ate this whole sandwich. \nThe sparkling Limonade was refreshing and we enjoyed our meal at their communal table. \n\nGiven the factors in my restaurant selection - I felt Artesano was well worth the time, cost - and I definitely couldn't make these dishes at home. As for comparison to Sol Food - dare I say that chicken combined with the special sauce that's on the table - oh and the beans and rice - definitely rivals theirs. I'm happy I don't need to drive across that GG Bridge to get my fix and this place offers more variety in their menu. I'm already trying to justify my next trip to Laurel Heights just to visit Artesano again.", "author": "Wendy L. V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "I was weary about coming here because of the 3.5 stars, but after taking the risk I am even surprised they have that rating. I had the steak sandwich and my husband had the Cuban sandwich (which I also stole a few bites from) and both sandwiches were delicious. Very flavorful, light and yummy. I highly recommend stopping by this place for a tasty lunch!", "author": "Aed L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "The reason I keep returning is that the chef's are wonderful.    I order vegetarian dishes & like the varied spices & sauces (the bottled table sauce is $7.00) used.     99% of the time the service is horrible.    From the minute I order, they rush me through.    The servers run around delivering food & then avoid the tables until it's time to clear them.    If I ask questions, they seem offended.     Even the management rarely talks to the customers.     What a great location, food, chefs, but the service is so impersonal.", "author": "Margaux C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "The food here is ok. The first time I was here I had the cuban sandwich. It was ok. I've had better, but I enjoyed it. The fried platains are pretty good, but the dipping sauces are mediocre. The red sauce that they have on all of the tables has way too much of a vinegar taste with no other flavor, other than it being spicy (actually a good level of hotness). What dissappointed me was their ceviche. I tried it two different times. It is waaaaaaaaaaaaay too over flavored with lemon juice. You don't taste very much else!!! I like to taste the fish and the other additions in my ceviche, but this one is just plain nasty!", "author": "Mari G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "I've been here 3 times since it opened in my neighborhood Laurel Heights area. Good customer service & good food! They've even given me a free entree coupon since I waited for a longtime on one of my orders. I have yet to try anything else besides the pulled pork entree it's delish! Place is clean, quick & friendly.", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Stopped by for lunch today. Tried the albondigas sandwich. The taste was unexpected combination of flavors.  I'll definitely get it again. Welcome to the neighborhood.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-16", "description": "...$16 chicken salad...what the hell is this \"Latin Comfort Food\" restaurant assuaging - post-playa depression?", "author": "Eric J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "Albondingas sandwich, plantain fries (really good with awesome sauces), great black beans and perfect Brazilian rice. Desserts excellent - banana custard with caramel sauce and triple lechwe cake. Go now!", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "Artesano is a great little restaurant for casual dining in a part of the city that is replete with fancy eateries. Serving Latin American cuisine outside of the usual Mexican/Cuban matrix, I found the warm, well-lit (but not too well-lit) space inviting on a cold, foggy night. For my first visit I tried the Pollo Guisado, a hearty chicken dish accompanied by rice, black beans, and a salad lightly dressed with citrus. Dinner was delicious, though I will say that the chicken thighs/breasts were a bit dry and overcooked, something the sauce generally made up for. Desert was the coup de grace for me--I ordered a delicious tres leches cake, which provided a perfect light accompaniment to the fortifying chicken dinner. The above average quality of the food, and the consistently good service, means I will be returning to Artesano very soon.", "author": "Tory A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "I had the Cuban sandwich with rice and beans. First time I had a Cuban with pulled pork. It had a nice smokey flavor. The pickles were cut very thin so I got the flavor without the crunch. I really enjoyed it", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "We stopped in for a quick dinner because the location was convenient for our later evening plans. What a wonderful surprise! I shop at Laurel Village all the time yet never stopped in before.   The food is freshly prepared in an open kitchen. We had several dishes and shared each one. Chose albondigas to start, then marinated chicken and chopped salad with steak for dinner with beer and wine. All were great. Our waiter, Brandon, was so friendly and solicitous - he really ensured we were taken care of and is a big reason we'll return. All around a lovely, neighborhood spot with delicious food and attentive service,", "author": "Rita G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-15", "description": "I won't be back. I ordered the unpulled pork entree. The entire thing was fat. Disgusting and completely inedible! The serving size was small for $15 and the salad was 5 pieces of lettuce that's it. So disappointed. In another review someone compared this restaurant to sol food in San  Rafael. While I only had one meal here I have had many meals at sol food and there is absolutely no comparison.", "author": "Nicki D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Great Cubano!!!!! This place rocks! I love spicy warm flavors and I was not disappointed:-). I can see this place becoming one of my favorite lunch spots. In addition: the staff were friendly and efficient. I was in and out with no time lost. The restaurant was clean and inviting:-)))))", "author": "S K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Nice new addition to Laurel Heights.  The food was yummy, and the cucumber melon agua fresca is my new favorite thing.... had to go back and get another one to go, brought it home and added a little tequila... delicious!", "author": "Lili L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "Its very hard to find a truly tasty and satisfying veggie entree, but their vegetable stew really hit the mark for me. It was served in a deep bowl full of nice sized pieces of  veggies in a rich and yummy broth that just coated and flavored, without drowning the vegetables. It came with that creamy  rice (abrosio I think) and fresh, firm, lightly seasoned (not mushy) black beans. Our table also had the cerviche (shrimp and yellow tail) in an orange/ citrus/ spicy juice that we all loved. And, we ordered two more orders of the long, super crisp plantain chips after devouring the first order. The service and vibe was so friendly and  fun. We will definitely  be back!", "author": "Alison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-04", "description": "Delicioso! The unpulled pulled pork is amazing as are the grilled plantains. 3rd time here in 2 weeks as I must have the unpulled pulled pork! And, all the staff are very friendly, too.", "author": "Angelique V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "The service was excellent and we loved the food.  Simple homemade food.  We had the small plates and were super full.  The dessert was delicious, too, some kind of coffee cake that was sooo different.  Good wines.  We had a couple of glasses it was sooo good!  Shrimp skewers, Yucca, Jicama salad, the meatballs, all great!  The white sauce other patrons have dissed is some foam with a limey cilantrowy flavor that is just super delicious!  Not yogurt no cream...it's a mystery!  Really different and reasonable  UNIQUE! and common all in one.\n\nWe will be back and also I will recommend it to all my friends and co workers!", "author": "Emily G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "We walked into Artesanos a few minutes before closing time and the wait staff kept the kitchen open a bit longer so that we could enjoy this delicious cuisine. I loved the food. I had the pollo guisado and I thought it was delicious, very true to the original.\n\nMy boyfriend had the albondigas sandwich and it was fantastic. The meatballs were flavorful, the plantains were sweet and complemented the meat and it all magically came together in an artisan roll. I will continue to go back to Artesanos for that sandwich and the super friendly wait staff.", "author": "Ana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "I really enjoyed the meal I purchased from Artesano... this neighborhood needs more choices...and for the price one has to pay for food around here...well sandwiches and salads are not cutting it anymore!\n\nI read the reviews here before walking over there, even though there are some not so positive reviews, I was determined to try it out for myself.\n\nI enjoyed my food, unpulled grilled pork dish with rice, beans and salad,\nI probably would have enjoyed more if I had the time to stay and enjoy the atmosphere - it looked fun, but nevertheless it was tasty and the portions were not bad at all. One thing, may just be my personal quirk, I would have enjoyed my salad more if it came with a little dressing.\n\nI think some people think all \"Latin\" food should look and taste like Mexican food and that is not the case...as I recently had to educate a coworker - there are other countries south of Mexico, with their own culture(s), language(s) and DELICIOUS cuisine(s).\n\nI am curious to try the chicken with all the mixed reviews and also their Yucca and Plantain Fritas. Yum!", "author": "Ingrid G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Great gluten-free options.  Fresh ingredients and tasty seasonings.  Friendly and helpful staff!", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "I just went to Artesano from Berkeley to meet my friends. It took me more than 40 minutes from Embarcadero and I was not happy about the rough bus ride through China Town. When I finally got off the bus, I was pleasantly surprised with the location. The organic tea was refreshing and the chopped salad I had was very good. There is no waiter/waitress in this restaurant and $12.00 for a meatless salad would be on a pricey side in East Bay but the shopping center has a pretty large parking lot in the back so it's okay for its location. Next time, I'll drive or at least take a UBER to get there.", "author": "Puppyface F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-11", "description": "Hoping this would be a great new option in Laurel Heights. Although portions were generous, my chicken was all dark meat and over-cooked. Not impressed, and I thought the pricing was just a little high. Generally mediocre in a town where that's just not enough.", "author": "Tierney T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Big fan of this place.  Good food and good service.  People seem genuinely happy to be working there.  The cubano sandwich is really good, love the sauce they have on every table too.", "author": "mark h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-21", "description": "$2 extra for a green leaf salad side - enough said.\n\nIts not clear what this place has to offer. High prices poor quality.", "author": "Oren W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "This is a nice little addition to the neighborhood. It falls pretty squarely into the \"I don't really want to order in but I also don't want to change out of yoga pants to go anywhere fancy' category.  The food is solid but not amazing. \n\nWe went for dinner the other night and it was decent. We started with the meatball - good but not something I'm running back for. Then for entrees, I had the pollo guisado which was a chicken stew and my husband had the flat iron steak. The stew was pretty good although the salad that came with it was pretty soggy. My husband thought the steak was good but not great. \n\nThe only real stand-out of the night was the melon cucumber agua fresca. Yum!", "author": "Kathleen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "I work in the neighborhood and this is my \"go to\" restaurant a few times a week.  Even more.  Love, love, love their chopped salad (without the onions).  I eat half for lunch and take the rest for dinner.  If you want protein, add the chicken skewer.  Yummy.  Excellent service, smiling servers.  Reasonable.", "author": "Barbara A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-26", "description": "Sadly I was not impressed by the food at Artesano.  I got the churrasco steak and it came with rice, beans and a salad.  The chimichurri sauce might have been the best part of the dish.  It was pricey for the portion and the taste of the steak and everything else was just ok.  I was also still hungry after I completely ate every single crumb possible on my plate.  Hm......", "author": "Shirley T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Been here a four times and had a bad meal here once. Thus earning 4 stars. The meal here can be either as quick as you'd like it or you can take your time. It's tough to take your time though as your inner fat kid can't stop eating the two piece chicken meal or the steak sandwich... Or the chicken sandwich!\n\nService is great, everyone is happy to help and very positive, signs of good management. Really bummed to not see this restaurant doing better as it serves solid food at an affordable price.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "It was a beautiful sunny saturday when my boyfriend and I decided to venture out into the neighborhood of laurel heights! We passed by many potential lunch places but latin comfort food definitely sounded like a new food adventure for the both of us. I got the Albondigas Sandwich while my boyfriend got the soup on the special. It looked a little empty when I first got the plate, I was expecting some tiny portion of chips/salad/fruit to go along with the sandwich but that wasn't the case. So I just digged into the sandwich and oh boy! First, it was messy so do bring hand sanitizers to clean off your fingers afterwards. But it was WORTH IT!! The deliciousness of the yummy meatballs along with the hint of lime! I could probably eat this sandwich over and over again for days. I can't wait to go back and try more of the food here!!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "Just had an excellent, super tasty dinner at Artesano! I work in the hood but hadn't checked this place out yet, and I sure am glad they opened up.  I've traveled throughout the caribbean, central and south america and the dishes and flavors they offer are fantastic, really just like home made food!!  We had the grilled shrimp, ceviche, pollo artesano and pollo guisado and everything was so tasty, including the rice and beans.  Me, my wife and 2 year old son gobbled everything up and wanted more, but we were so full.\n\nAnd the wait staff was awesome, super nice, friendly and knowledgeable about the menu. Our kid could not stop high fiving our waiter Verlance?? and jamming to the back ground music.  The fireplace was also inviting especially since it was a cold night.\n\nNot sure why other people had some bad reviews, maybe they've worked out the kinks since it's a new operation, but we had excellent dinner service and everything we ordered was cooked perfectly and soooooo tasty.\n\nI can't wait to go back to try everything else on the menu for lunch and dinner!!", "author": "Kirby L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "Comfort food! Simple and fresh! Good for lunch! I got the pulled chicken sandwich! It was good. They have plenty of salads that you can add toppings to those! I'll try salads next time. Overall, there was nothing negative about this place!", "author": "Mahgol S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "I come here all the time. They have a secret kids menu for my five year old. Their french fries are delicious. Their pulled chicken and pork sandwiches are really tasty. I also really like the skewers. The Aguas are original and delicious. One of my favorite spots in SF.", "author": "Gina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "Good food. The meat-balls sandwich was tasty and the bread soft. Not a big fan of the watermelon drink, just because i don't like carbonated juices.", "author": "Nima S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "We liked it! Met another couple there for dinner. We had a few apps. The yuka fries a salad and plantains. Was all tasty. Someone had the unpulled pork I really liked that. I had the chicken something. It was good as well. We all got watermelon mint drinks and loved them. Very casual and relaxed experience.", "author": "Satoshi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-30", "description": "Interesting menu. Ambience was nice. Service was good. Food was extremely bland and I am not even a fan of spicy food. No salt and pepper shakers at the tables. Had to ask for salt and pepper and although they brought it, they looked at me as if it was the most bizarre request they had ever heard.\n\nDinner was served on a piping hot plate, which is great, however, this included the salad. Who wants warm salad?", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "I work at UCSF and as a result have been here a few times. Everything I've had has been REALLY good. The plaintain chips are phenomenal, so are the rice and beans. The chipotle chicken soup is also delicious. Two thumbs up!", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "LOVE Artesano!  If you haven't tried it yet, put it at the top of your list on next places to visit.  Artesano's Latin comfort food offers both traditional Brazilian, Peruvian and Argentinian dishes, as well as ones that blend modern California cuisine sensibilities to create some seriously memorable dishes.  Try the succulent pulled chicken or pork, or the organic quinoa and kale salad, or yellow tail ceviche.   Delicious.  Everything is beautifully presented, extremely fresh and prepared with the greatest attention to detail.  Really a delight!  Bravo Artesano!", "author": "Linda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "Modest but satisfying place self-described as Cuban/Latino comfort food. 2 pieces of scrumptious chicken Artesano (boneless thighs deliciously marinated & barbecued) came with very generous portions of rice, black beans & very fresh salad greens, nicely (lightly) dressed. Paired well with a very drinkable Rioja. The tres leches cake was amazing, but be warned, this will easily serve 3-4 (possibly more) - basically the size of a pound cake load! Staff very friendly - a nice stopover in Laurel Heights.", "author": "Bern S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "What a nice surprise! Great Latin food at affordable prices, right in the neighborhood. I'd been resisting trying this place since it opened several months ago, I guess because of the strip mall setting. But now I regret that I didn't try here sooner! The plantain chips, kale and quinoa salad, \"un-pulled\" pork, and mango agua fresca were all totally solid--the dulce de leche brownie was out of this world. Our 10-year-old loved it, too... We will definitely be back. We ate in this time, near a cozy fireplace, but will try taking out soon.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "The negative reviews are way off!   I had expected this casual little joint to be fine at best, but it far exceeded my expectations.\n\nWe started with the fried plantain chips, which come with three dipping sauces.  The chips were good (light, not too greasy), but the sauces were amazing.  For my entree I selected the pulled chicken sandwich with a side of black beans and rice.  All I can say is wow!  The chicken was moist and tender and it was coated in a wonderfully flavorful, complex sauce.  I may go back again this week for another round!  \n\nMy husband had the veggie guisado de calabaza, and he loved it.  I think he told the waiter three times, maybe more, that the dish was fantastic.  He also liked the sparkling agua fresca.  \n\nWe didn't opt for dessert , but we'll give it a shot next time.\n\nOh, the service was totally pleasant and quite proficient...I'm not sure I understand the nitpicky reviews.   \n\nGive this place a shot.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-30", "description": "Have you ever been to Sol Food in Marin? That place is awesome. This place is not Sol Food even though it seems like they have almost the same menu. It's either too bland too sweet or just generally mediocre :(", "author": "Sasha A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "Artesano is a new spot in Laural Village. It's great because of the 90 minute parking lot. The steak and pulled pork comes with beans and rice. Both dishes were satisfying. The cucumber melon drink is also great for a hot day.  Will be back to try the other dishes on the menu.", "author": "Jennie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-24", "description": "I was headed to Gordos for a carnitas burrito when I remembered I wanted to try this spot.  I went in and tried to order at the register  but said it was for here and he said I would have to order through someone else and then handed me a menu.  Maybe I'm just used to asqew even though I only went there twice but the layout is awkward. So I decide to get it to go - ordered the 2 piece chicken with rice and beans - it came out in 30 seconds and tasted pretty good - wasn't blown away but would eat there again, just not a spot that will be added in the rotation.  I would suggest they pick an identity - fast casual and order at the counter and grab a number or full sit down and cook to order - fast casual will save some cash which I think this spot will need - hope I'm wrong", "author": "Tim G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-20", "description": "Way to expensive. Food is good and the place is clean but no salad should ever cost $20. Sorry we're not in New York City. My wife got a salad $12.00 added shrimp $8.00 more. Salad came with only four shrimp. When we were there we saw a few people come in and look at the menu board then turn around and leave. Lower your prices.", "author": "Tom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Wow, this place was fantastic!  \n\nPlantain chips with 3 amazing salsas.  \nI had the butternut squash vegetarian dish, and it was awesome.  My wife had the pulled chicken sandwich, equally awesome.  Try the Watermelon-Mint Sparkling Agua Fresca too!  \n\nService was very good and friendly.  \n\nOne of my new local favorites.  Highly recommended.", "author": "Jahan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "We walked in on a Saturday afternoon on the earlier side to beat the lunch rush.  We were a group of 10 with 4 small kids.  When we arrived the space was very empty since it was early.  When we asked one of the servers on how we can be seated she was very rude and non-accommodating.  She basically said she could put something together outside but not inside.  Luckily a gentleman who was sitting alone at the large common table offered to move which was very nice of him.  Then the same rude server proceeds to talk shit about us to her co-workers for making the man move.  When she turned around I confronted her and asked if there was a problem.  She said no and continued about her business.  The place was empty.  We had 10 paying folks.  You could be a bit more accommodating to families.  Thanks for the awesome experience and service.  I will not be back and I will tell all my friends with kids not to go to your restaurant.  You messed with the wrong family lady.  I will say the rest of the staff was very nice, but it only takes one bad egg to screw up the bunch.  Being there in Laurel Village you think you would be a bit more accommodating to families given the neighborhood.  I rarely write negative reviews, but this lady really set me off.", "author": "Vince B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "Really nice good, looking spot. Nice decor and environment. Doing a lot of things right. With that said, I got the Albondigas sandwhich  ($10) and it was tasty but I couldn't keep the meatballs in the sandwhich because the bread was too chewy. Same issue with my girlfriends yellowfin sandwhich ($13) which she likened to Rubios or Baja Fresh. She may have been a little harsh maybe because she paid. Which brings me to my final gripe. The . Food wasn't bad but in our opinion was grossly overpriced. $18 bucks + tip for a sandwich, fries, and an ice tea.", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-17", "description": "Ordered a jicama salad with shrimp. Got a bed of lettuce, 4 pieces of shrimp, no jicama - cost me $21 bucks.  You be the judge.", "author": "Suzy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "I hosted a farewell party for a coworker at Artesano, which included 15 guests in the late afternoon. The manager was very helpful with reserving a table, pre-ordering food, and making sure the event went smoothly. The only glitch was that I pre-ordered dulce de leche cakes and tres leches brownies. When I arrived for the party, they had tres leches brownies and macarons, which I assume they bought at a neighboring restaurant. This was disappointing, but they threw in fried plantains and non-alcoholic drinks for make up for the last-minute change.  Everyone was happy to have the drinks and salty snack in addition to the sweets, so this change worked out fine. All in all, I would host an event at Artesano in the future.", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-20", "description": "Pretty good food, but don't bother with the ceviche.  It was overpriced for what you get and not eye appealing.   I'm a huge ceviche fan and I was a bit shocked and hugely disappointed to see large chunks of red onion that should be better sliced and the fish looked so unappealing.  Not your traditional ceviche so beware!\n\nThe grilled shrimp dish however was delicious and the seasoning was amazing!  Great value for $15 compared to the overpriced $11 ceviche.  \n\nI'll go back and hope this place can make it!!!", "author": "Bev T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-06", "description": "I had food catered to work from here and it was delicious with the quinoa salad and pesto pasta with chicken. As for my order to-go with my boyfriend, I was a bit disappointed. I wanted to order my artesano chicken with my salad replaced with the quinoa and they didnt let me, and my boyfriend's order of chicken guisado was delicious but didn't let him change his salad to rice either. Talk about bad service... the food was good but the service was bad. Not only did they not allow us to swap out our sides (even if we didn't mind paying more), they were slow and took too long to get our orders, and the people who took my order at the counter seemed super unhappy too (which also put me out of the mood to eat there too). Also the mango orange fresca was carbonated and delicious, and probably would've gotten a better rating if it wasn't for their service. AND they charged my boyfriend twice, which now we have to go through the process of adjusting that...", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-20", "description": "This was my first time here . I was looking for Asqew grill but I guess they went out of business and this place took over. I will never ever come back here ! My husband and I decided to try it out before his doctors appointment. We were both disappointed!  I orders their chicken plate with a side of fries and he ordered the shrimp ceviche. My rice was not cooked well, it was too wet and mushy. The fries were too salty and just average.  His ceviche had way too much lemon and was almost I edible.  Furthermore please train your runners to know what dish goes to what table number . Don't ask is if we ordered something that we clearly did not. Read the ticket please! This place was overpriced and a rip off. I don't mind paying a higher price for food but I expecting to be good at least! It was so bad we had to eat at Noah's bagels next door since we were still hungry!  I would not recommend this place to anyone! Do not go here! Save your money!", "author": "Louise T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "I've had to visit the near by hospital a lot recently and have made Arteseno a staple when eating near by. I've enjoyed every meal. Especially the albondigas sandwich and the veggie guisado.", "author": "Loren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "I stopped by at Artesano on Friday and I was told they had just opened the door the same day.  The place looks great, with vibrant colors.  Kitchen is open so you can see the cook making the food.  The place was busy has everyone was looking forward to check the new restaurant.  Met the owners which made the experience very personable!  Very friendly too!  Sat down at a booth and the waiter explained what Artesano was about and then I got to sample the food (Ceviche appetizer and Pulled Chicken sandwich), both excellent!  A great start on the first day of business.  You can tell the owners are trying really hard to be successful.  And I'm sure they will.  Remember folks, they just opened!  Welcome to Laurel Village!", "author": "Yann D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-12", "description": "My 2nd update as the owner of Artesano was so lovely and insisted on sending a $20 gift card to encourage me to try the restaurant again. Generally, I feel uncomfortable with this sort of thing for it feels like a business is trying to buy a better review. And indeed, it is awkward as I went back to Artesano last night and still did not have a stellar experience. My recent experience was far better than my initial 1-star, but I really can't honestly say it was better than a 3-star and a good portion of the bump is due to the owner earnestly caring about my experience and trying to make it right. Yet, the service was still slow and awkward (too much attention at the wrong times and not enough at other times) and the food was good, but not great (smallish portions for the price and the fish was overcooked). We had a child with us and no kid menu. It wasn't until we asked the waiter about one that he told us there was a $5 kid's plate not listed on the menu (this should be on the menu or offered verbally anytime a kid is with the party). The section near the fireplace is too hot to sit in and the rest of the restaurant is so cold they need unattractive space heaters. The lighting is also way too bright. All things that need to be considered for the prices charged. Again, I hugely appreciate the effort the owner has gone to try and \"right the review.\"  There are a lot of businesses that just don't care and clearly this one does, but the concept and formula still aren't 5-star for me.", "author": "Kristin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "On a late Sunday, when everyone else is rolling up the sidewalk, to have a locally owned, locally sourced restaurant with such a hip vibe is welcome. But, have I mentioned the wine? I'm a vino tinto drinker, and although the selections aren't Merlot, Pinot or Cabernet, the wine is delicious and cheap!! $7 or $8 per each generous glass, accompanies equally generous plates of food. I, who am always on a diet, ordered the jicama salad, and it's definitely meal-sized. And they put six (!) grilled shrimp on for the add-on. It was delicious. My husband got the grilled yellowtail tuna for about half what we've seen charged in other places. The service was perfectly paced, and it was an added bit of fun to watch the cooks shaking' their booty in the kitchen.", "author": "Margaret B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-05", "description": "That was a great dinner.  The best part? The fries. I haven't had such good fries ever. The whole bunch of us agreed.  And the kids loved their dinner.   Friendly, fast and free parking. Perfect.", "author": "Neil A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "Good eats!  Very flavorful.  The meatball app was great (has a mole sauce, which I normally don't like, but the sauce didn't overpower as moles often do IMHO), also loved the yucca fries. I had the pulled chicken sandwich with a small side of rice/beans, which was way too much for me to eat, but nicely seasoned and on a yummy bread.  I had a bite of my friend's tres leche cake and wish I would've started THERE, but that is my sweet tooth talking.  Glad to have a new place in the 'hood that is tasty, well-priced, with takeout, and stays open late enough for some of us workaholics to actually get food in the evening.", "author": "Jackie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Deeeeee-licious! We had the Ceviche and the Pollo and the Albondigas (oh, and the fried plantains!), and all were scrumptious. I highly recommend this place. I especially liked all the different dipping sauces, and the relaxed, low-key atmosphere. Great wine too, and good prices ($13 for a large plate of chicken with rice and a just-right green salad). Worth the trip, even when coming all the way from the East Bay.", "author": "Iris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-04", "description": "There is no wait. Also the frescas are done right. The rest is like a long walk waiting for a destination.", "author": "Fzarond K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-06", "description": "The food here was very disappointing. I ordered my favorites: fish, agua fresca, and alfajore. The grilled fish was bland and tasteless. The agua fresca was watered down. And the alfajore was nothing more than 2 thin sugar cookies slapped together with runny caramel sauce.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "Got a veggie stew, great portion side, nice healthy side of salad and beans. The stew was very flavorful with a nice variety of vegetables. Friend had a cuban sandwich, it was small for $12 and no accompaniment. A salad on the side would've been a better fit for the price. Love veggie stew a lot!", "author": "Olivia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "Was looking for a quick healthy bite to eat ! And I did. The chicken skewers were delicious. Forget ordering regular fries. Get the yuca ones. You won't be sorry. Can't wait to go back and try more items from the menu. Big plus for gluten free on most of the items. Very happy I stumbled upon Artesano", "author": "E. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-29", "description": "Stopped in for lunch the other day and experienced one of the most creative yet somehow still traditional Caeser salads out there. There is a spicy kick to the dressing, which is totally addictive, and just the right mix of homemade croutons salty, shaved parmesan. Fabulous with chicken. Artesano is an excellent lunchtime meeting spot with friends or colleagues, and would be a good place to stop before catching a lecture at the JCCSF.", "author": "Josie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Lovely new addition to Laurel Village in San Francisco.  Latin-flavored dishes prepared with imagination, served promptly and with a smile.  Hubby had the flatiron steak, I tried the unpulled pork after reading the rave reviews.  Both were absolutely delicious.  Rice and black beans are the standard sides;  when mixed with the spicy sauce (a bottle is on each table), the result is heavenly.  Portions are on the small side but that's OK, you'll  want to leave room for the tres leches cake which as far as I'm concerned is THE best dessert on the planet.   (Hubby and I split an order, next time we'll each get our own!! ) Try a limeade to go with your meal -- different and refreshing.", "author": "Bonnie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-02", "description": "My g/f and her friend went here last night (11/2/13) and my g/f was served an agua fresca in a glass jar with bright red lipstick on the rim that wasn't hers. Her friend ordered the Yellow Tail entree and it was barely cooked. Both items were sent back and neither were taken off the bill. Isn't this standard operating procedure for decent and reputable restaurants? They've decided to never go here again even though they both live and work in the neighborhood which has very few options for affordable eats.", "author": "M H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "I got the pulled chicken sandwich and it was very tasteful. It had a spicy coleslaw on it !! The only down part is I'm not a big fan of dark meat chicken and they used a lot of dark meat but that is the Latin way I guess. Overall food was solid and the sauce they put on the table is really good I wanted to take home with me.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "I love this place.  I live down the street and come here as my go to.", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "This place has become my new go to spot for lunch and dinner! I fell in love at first bite with my steak sandwich that was garlic deliciousness. The meat itself was really high quality and really tender. The unpulled pork is also amazing and extremely tasty and tender. So glad that this place opened up near me :)", "author": "Adriana S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-20", "description": "After watching the movie Chef (2014), which featured mucho Cuban food, I yelped Cuban near my neighborhood and found Artesano, which actually isn't that close to where I live. I hope this doesn't cause the chef here to have a scene like Jon did in the movie when he lost it with Oliver (I'm not a popular blogger, so probably won't matter much except to yelpsters). Hence, I was severely annoyed when my food came out less than mediocre. Perhaps I ordered the wrong dish, but the shrimp on skewers dinner was horrid. HORRID. The shrimps were way overcooked and just about inedible. I had to pick off the black carbon on the shrimps and the edges of all pieces of shrimp were hard as rock - inedible. The rice tasted really funny too - can't quite put my finger on it but it tasted funny. The black beans were ok though. I was so frustrated towards the end of the meal, I threw the last piece of shrimp on my plate in disgust. I would have eaten it since I was still hungry, but it was just too upsetting. Maybe I should have ordered a salad. Guess I will have to run to the Mission for Cuban food. The waitress was nice though. I should have known that it might not have been great given the empty tables there - when I walked into the Inner Richmond later, both Burma Superstar and its sister B had long lines out the door.", "author": "Frank S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-05", "description": "I ordered the grilled pork entrée with rice, beans and salad.  Although the waiter instructed me that this was not pulled pork but more like a steak , it would be so tender you could pull it apart as though it was. So disappointed that this meat although spicy  was in large part fatty and tough. My knife and my teeth got quite a workout!  The rice and black beans were plain but the salsa on the table was very tasty and I used it on them. The salad was just plain greens that you pull out of a plastic bag at the market, nothing special about the light dressing either. The cucumber cantaloupe fresca was pretty looking and served in a huge jar for $3.00.  I could only drink 1/3 of it.  It could have been sweeter.  For $17.40 plus tip I kept thinking about El Faro where I have ordered the most delicious pulled pork, rice and beans for 1/3 of the price.  I might return in the future for the chicken that has been reviewed more highly.", "author": "Anne N."}
