{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "This place is goood! If you love bacon come give it a try. There's some fun things on the menu. I was torn between the classic breakfast burrito and the breakfast sandwich. So I got both, because why not?!? But I have to say the breakfast sandwich was to die for. The bun is out of this world. Then the bacon jam and gooey cheddar cheese and bacon and fried egg. YUMMMM\n\nDONT get me wrong, the breakfast burrito was good. But it was exactly as ordered a classic breakfast burrito. It was good. There's just something about that bacon jam and that bun on the sandwich. \n\nOh and I got a Vietnamese iced coffee because I've been up since 4 AM, and I need a mid day/morning pick me up. \n\nThere's a cute little mechanical pig you can ride. There's sweatshirts, hats and T-shirt's you can buy. And my food came out within 5 minutes. I highly recommend it!!!!", "author": "SA M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-29", "description": "Wanted something quick and delicious for breakfast so we stumbled across Bacon Bacon and followed the reviews!\n\nI ordered the breakfast sandwich and my fiancé ordered the breakfast burrito (with pork). \n\nOur food came out incredibly fast - sandwich had their special bacon jam, which really looked like pulled pork, but wasn't anything too special to me, though it seems to be a hit with everyone else! I don't have a huge sweet tooth, so I'm sure I would have enjoyed this more if I was more of a sweets fan. \n\nI loved the gooey cheesiness of this sandwich and the bun is really a star! The bacon, of course, was great. \n\nThe sandwich was delicious, but not the best breakfast sandwich I've ever had. I think the pricing is fair and though the sandwich may look small, it's the perfect amount of food. \n\nIf you're a coffee fan, they have a pretty good Vietnamese coffee. I especially like the ice that comes in it. Almost slushy like. \n\nI'm definitely wanting to go back to try some more of their menu items. Bacon on everything is the way to go!", "author": "Cecilia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Bacon Bacon was so good that we went 2 days in a row. We both ordered the breakfast sandwich, and I venture to say it's the best one I've ever had. The bun is fluffy and soft but slightly crispy around the edges, the egg is perfectly gooey in the middle, the bacon is crispy and thick and delicious, and the bacon jam is the most perfect balance of salty and sweet. Dear God it was amazing. \n\nThe first time we went, we got iced Vietnamese coffee- YUM!! Creamy and strong and slightly sweet. The next day we got iced Havana coffee and it was somehow better than the iced Vietnamese coffee. Omg. A hint of cinnamon, a tiny bit of chocolate. And omgggg so good. Thank God we don't live in SF or we'd eat there everyday. \n\nService was quick and the staff was great. The guy gave us the coffee recommendations each day and they surely didn't disappoint. We'll definitely go back next time we're in town!!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "I love bacon just as much bacon bacon loves bacon. The breakfast bowl and the burrito were great. Took awhile for the order but the wait was worth it. I ordered to-go and enjoyed it at home. The staff was friendly.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "The breakfast burrito and breakfast sandwich were both amazing! The sitting area on the inside is a bit small and crowded during the morning, but it was still a pretty cozy place. My boyfriend and I both enjoyed it", "author": "Toni S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "So I decided to get two burritos for lunch. Some of my coworkers thought I was being ridiculous, but I didn't care. (Apparently two burritos is too much?) I went ahead and did it anyways. Our office lunch delivery arrived by Caviar on Friday, April 20th around 12:30pm.\n\n*Bacon Fries: French fries tossed in herbs, parmesan, spicy olive oil, homemade bacon bits, and bacon jam served with a side of blue cheese vinaigrette ($7.50)\n*Breakfast Burrito: Scrambled egg, pork shoulder, bacon, avocado, and cheddar ($8.50)\n\nI got the breakfast burrito, but also tried some of my coworker's bacon fries. Both items were chock full of bacon and meat. The burrito was stuffed with filling which I appreciated. Not sure if they offer hot sauces at the location, but this was great with some heat. (I always have multiple hot sauces at my desk.) The fries were good, but suffered from the transport time as they were soggy. Still good flavor. Though they didn't deliver the blue cheese vinaigrette, so I was missing that cheesy element.\n\nGreat breakfast burrito. If they were close to work, I'd get it more often. Maybe the next time Bacon Bacon rolls around as an office lunch option.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "Awesome little easy to miss spot on Franklin that serves incredible grilled cheese with bacon sandwiches and also excellent burgers.\n\nNot much to look at, and they also serve pastries and other sandwiches, but the grilled cheese with bacon is a winner. Comes with bacon jam.\n\nBurger was super delicious, juicy and awesome.\n\nYou can even ride on an old-school pig ride.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "If you're in the neighborhood and looking for something to remind you of the bustling Manhattan street deli's then look no further. The New Yorker B.E.C is reminiscent of a classic bacon, egg, and cheese sandwich from the city that never sleeps. The one called the breakfast sandwich is delicious as well with bacon jam which is #tdf. I will definitely return if I'm in town. The view outside is phenomenal and the staff was friendly. The bread was quite delectable and the cheese was ooey gooey goodness.", "author": "Ron B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-11", "description": "I've been eyeing this place for quite some time. I consider myself a bacon aficionado and I was failed. You can easily miss this place but it's on Franklin off Ashbury.\n\nFYI street sweeping is 8 to 10 on Tuesday or Friday depending on where you park. \n\nI ordered the breakfast sandwich. The bacon jam was a major disappointment. It's nothing like your usual jam but more like burnt pulled pork. I got about 3 slices of mediocre flavorless bacon.\n\nFor $9 I could've made 4 tasty sandwiches! At least I can say I tried it. But don't waste your time.", "author": "Tiffany B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "I'm feeling a little boarder line about the 4 stars - mostly I just don't feel like I know enough to appropriately rate it, but from the look of the menu  it seems like I would go with 4 if I knew it better.  \n\nI got the classic breakfast burrito which was really quite good. Not the best breakfast burrito I've ever had but they did a good job of having simple flavors that each came out - I could taste the bacon, egg, and avocado clearly.\n\nMy husband got the Breakfast Burrito - which really just tasted like meat - so not as well balanced. Both were good sized - we came out full.\n\nGood light in the space. Counter service. Very few people there when we went in, so it was quick, but might be different if it were busy. \n\nBut don't go here if you don't like bacon - it's on pretty much everything, and is the point of going.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "I came here with family for a quick meal before exploring the city. The restaurant is quite small, with about 4 bar-height tables and a longer counter that can all seat about 20 people.\n\nI ordered the banh mi, while others in my party ordered the breakfast sandwich, cobb salad, bacon cheeseburger, and the cuban.\n\nAs we sat down, we all noticed the crazy amount of flies around our table. After a few seconds of looking around the restaurant, we noticed there were flies EVERYWHERE. They're all over the walls, merchandise (sweater, mugs, etc.) that they sell, napkins, cups, water cooler, everywhere. This made me lose my appetite really quickly.\n\nWhile my Banh Mi sandwich was good, I couldn't get over all of the flies. Additionally, the bacon was really overcooked - not crispy but rather really hard and inedible.\n\nThere are restrooms, but you literally have to go through the kitchen and up some stairs across an extremely greasy floor.\n\nOverall, I'd say the food is good, but the restaurant really needs to put some effort into cleaning the place. I understand that cooking bacon all day and having grease spatter everywhere doesn't help, but I would think it's health hazard to have grease on the floors and allowing flies to breed here. Gross.", "author": "Nina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "The bricks-and-mortar version of the popular Bacon Bacon truck, with the added advantage of having everything on the menu - and then some - that all too often runs out when offered at the truck itself.\n\nThe only drawback about this location is that it's not open in the afternoons and evenings. If you can get here earlier in the day, they serve breakfast items until closing, and they start serving lunch items at 11am. Familiar offerings from the truck, like the bacon double cheeseburger, bacon fried chicken sandwich, and bacon bouquet are all available here, are just as good, and are prepared quite quickly.\n\nBut, while you're at it, why not try some items you haven't had before? They've got a bacon banh mi here, and even salads and chicken, tuna, and turkey sandwiches that are enhanced with bacon. The breakfast sandwiches are to die for as well. I had a daily breakfast special that featured special cuts of cured bacon alongside egg, cheese, and aioli on an English muffin. It went down quickly, but boy was it scrumptious, and at least for me it was worth it.\n\nService is friendly, fast, and professional here, and there's a limited amount of seating at a window counter and at small tables. Endearingly enough, there's an amusement park ride-style pig that you can ride. A great option to have in the neighborhood (even if folks nearby complain of the bacon smell) and something work trekking to. It's not far from where the N-Judah MUNI line emerges from the tunnel in Cole Valley.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-16", "description": "Ordered from Bacon Bacon a few times for delivery. Two things that are consistent, the food is good and the delivery will always be 25-30 min longer than expected. I recently ordered right when they opened and still waiting an hour and a half to get my food. That said the food is good but doubt I will order delivery from them in the future. The original breakfast burrito is the best of the two. The pork burrito is ok but very greasy and not that much flavor-you will need hot sauce for sure. Should I feel like having food an hour and a half after orderring it, sure I'd order from them again.", "author": "Kaylin-Marie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Sooo good! Best burrito I've had in California. The egg was runny and perfect. The bacon bits were tasty. It had so much flavor, add salsa and ketchup! So bomb.", "author": "Brenda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Bacon Bacon is the PERFECT name for this eatery. The food was so tasty and the bacon jam was to die for! Sit back and relax with a latte at the window seat and enjoy the calm atmosphere!", "author": "Amber G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "This place is a great spot for rich and savory breakfast/lunch eats! The menu is obviously bacon-themed, but the vibe is more cool hole-in-the-wall diner than classic BBQ joint. The bacon fried chicken sandwich comes w/ bacon strips and bacon mayo, both of which were well-proportioned to the rest of the sando. Next time I'm in town I'm definitely gonna go back to keep eating my way through their menu!", "author": "Julien I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Attention Foodies!!!! This place is an absolute must. \n\nMy husband and I stop by anytime we are in the Bay Area, even if it means going out of our way. My favorites are the Grilled Cheese (of course) and the Porky Fries. My husband trys something new every time and has yet to be disappointed. The service is always great and the vibe is always chill. \n\nIf you're in the area and love yourself STOP BY!", "author": "Nila B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Bacon bacon is the bacon lovers heavon! Bacon is in everything on the menu! We ordered the breakfast bowl which had eggs, bacon, pulled pork, onions and avocado, it was amazing! We also split the Mac and cheese bacon balls, they come with four and a chipotle dipping sauce! The restraint is small, maybe seating for about 20 or so within tables on four, but definitely delicious and worth going to try if you love bacon like I do.", "author": "Alicia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "This place is tucked in the midst of a neighborhood, but it's a good 15 minute walk from the nearest bus stop. \n\nMy boyfriend and I decided to go here because we both love bacon and we weren't disappointed. This small cafe is all about the bacon, they even have a fun pig ride for kids and adults to ride on. \n\nMy boyfriend and I decided to come here for breakfast because their lunch menu wasn't that diverse (it had mostly burgers) and we felt their breakfast menu was more interesting. I ordered some bacon tacos ($3) and my boyfriend got their breakfast bowl ($7). \n\nI also got a horchatta tea latte which was a equal balance of sweetness and cinnamon. It was probably the best I ever had and would probably come back again for it.\n\nThe bacon taco and breakfast bowl tasted almost the same with the filling. The filling was egg, bacon, and avocado which was good. The tortilla that came with the taco wasn't toasted and came with 2 mini tortillas so I ate some of my boyfriend's breakfast bowl. \n\nOverall, it was pretty decent meal and we enjoyed ourselves. The neighborhood is fairly safe, there's 0 homeless people loitering around and I saw many parents hanging out with their children around.", "author": "Kristi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "Bacon Bacon Bacon Bacon Bacon! Dank. Wet. Lit. Poppin. Smacks. This place has been bookmarked for a minute, because I LOVE BACON, I just haven't found a chance to try it until now. I'm a fan, I will be back. Price point is typical of an SF restaurant, so expect to spend about $10-15 for a meal.\n\nCame in around lunch on a Sunday, place was packed, but saying that, there isn't much seating to begin with. I would say about 20 seats. But we stood in the short line and ordered pretty quickly. We got the bacon maple scone and the breakfast burrito (regular, not classic). We sat down at one of the tables and waited for our food. I started on the maple bacon scone, I love scones, but I've never been much of a fan of maple bacon, but let me tell you, it was pretty damn good! Not overly dry, not cakey, it was what I expect of a scone. It even had a pile of bacon up top with some maple drizzled over it. YUM. Finally our food came, and I took one look at that breakfast burrito and instantly fell in love. I love when you can see the distinct layers in food, especially my burritos. Much appreciated. Added the Valencia hot sauce (sits on each table, along with Ketchup, sriracha, and mustard). MA DAM. I only had to take 1 bite to tell it was incredible. Juicy. Took another bite to make sure it was real, and boy was it. My friend devoured it in a split, 2 seconds. I saw another table with fries and it looked like perfection as well, nice size with a crispy outer layer, that looked pretty soft inside. Anyways, I will be back to try the fries, the mac and cheese balls, and the chicken sandwich. They all looked sooooo good. I had eaten a late breakfast so I wasn't hungry enough to eat more, otherwise, I would have went in.\n\nFood = dank\nPrice = normal\nService = good\nSeating = limited\nParking = hills + limited", "author": "Eva C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Basic but artery filling good;-)\n\nI  tried Swiss croissant which was disappointing as croissant was over cooked for my tastes. \n\nI decided for research purposes only to try the breakfast sandwich   Love has been found :-). \n\nThe egg  oozes as you  you crunch into they bacon deliciousness.  \n\n\n\n\n\nYum yum", "author": "Phil W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "The best breakfast sandwich I've ever had. The bacon jam is amazing. Great little place!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "What an amazing shock to the tastebuds.  The food is amazing and fresh, the half pound burger was incredible to the very last bite.  The French Fries has the perfect amount of seasoning.", "author": "Alexander A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "This place went downhill. My delivery order was missing most of the ingredients.  Breakfast Burrito lacked cheese and pork.  And my bacon egg cheddar sandwich just had egg in it.  Not ordering from them again.", "author": "reza n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "If you believe that Bacon is good for you, you are guaranteed to be happy here. \nThe place is small with limited seating but has an extensive menu offering snacks, sandwiches, and salads with bacon & cheese as the main ingredients.  \n\nI really liked the Cubano- a hot sandwich with 3 kinds of pork, pickles, and mustard on ciabatta. \nThe porky fries were piled with pork shoulder goodness. \nAnd the mac and cheese balls were ooey gooey delish! \n\nRandom fun fact: There's a mechanical pig you should ride!", "author": "Mitzi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "Got delivery from here. It was pretty good but not as good as I expected. \n\nBreakfast burrito: pretty good with a lot of meat and a tasty toasted tortilla. Kinda wish they has some salsa on the side or something to balance out the flavor. \n\nPorky fries: pretty good with generous amounts of yummy pulled pork. Wish they gave a little more bacon. The fries itself were kind of dry. \n\nI would eat here again if I happened to be near it", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "The name says it all. Great for breakfast or lunch. Burgers, salad, breakfast burritos and bagels (and even pastries). This place is pretty tasty!", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Best breakfast burrito with the best almond Chai latte I ever had. Using superlatives and I'm not American. Crazy", "author": "Kris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "During my visit to San Francisco, I went to Bacon Bacon twice for breakfast in five days.  I am blaming this on the fact that I was in a burrito state of mind while visiting.  But another factor is that their breakfast burritos are DELICIOUS.  I never imagined that combining bacon, pulled pork, egg, avocado and roasted red peppers in a burrito would equal the greatest meal on earth.  This is no exaggeration.  \n\nFor all my burrito lovers and bacon enthusiasts, Bacon Bacon is a must-try spot for all occasions.   \n \nUnfortunately, I did not get to try any items off their lunch menu but that is on my food bucket list. Next time I head back to SF, this will be stop #1.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "I ordered food from my hospital bed. I received cold bland food why add special instructions when the restaurant does even follow through with the original order never mind a request.", "author": "Will L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-20", "description": "Staff was great, but the breakfast burrito was terrible.  As soon as I took a bite, grease started pouring out.  The burrito was in a little paper bag that was half filled with grease after a few bites.  I ended up throwing it away, because it was pretty gross.  \n\nPerhaps I chose the wrong thing??", "author": "Sasha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "The jam on the breakfast sandwich was the highlight. The egg was runny and the bread was fluffy. Wait time wasn't too long, but went on a Sunday morning and couldn't find seating. 8 dollars is a good price for a breakfast sandwich but it wasn't as filling as I would have hoped. The classic breakfast burrito was a little bland and had very little avocado. Would recommend if you're nearby but I wouldn't go out of my way to get it", "author": "Bito M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "There are lots of places that have caught on to the bacon craze, but there still is truth to going to a place that focuses on bacon to get the best of the best.\n\nWhile the trucks still work as great advertisers to new people to the concept, this original location in the Haight still is my go to place although the owner, Jim, spends more time at his bigger 3rd street location.  \n\nWhile the menu has changed over the years, many of the classics are still there like the breakfast sandwich and breakfast burrito.  The Banh Mi sandwich recently returned to the menu at this location as well.  \n\nMany menu items have returned after the historic battle with anti-swine neighbors that resulted in a nice plug on SNL, but the casualty is the pork belly sandwich I figure just became too expensive.\n\nThis location gets packed in weekends while the other location is more for the working crowd so be prepared to grab a cup of coffee and wait.  Parking can be difficult as well, but it is all worth it right?\n\nWhat did I have this time around?  We split the breakfast burrito and sandwich.  \n\nYes they will always have me at Bacon!!", "author": "Erik H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "Over rated place was dirty and the manager was very rude. I ask to use the restroom he told me to wait they're very busy wtf! I'm a paying customer it's obvious this guy doesn't know how to treat patrons or knows how to manage. Food was garbage bacon burnt. Won't come back here !!!!", "author": "Joe K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "During a recent visit to SF while staying in the Haight a friend suggested going here and my group was not disappointed.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Despite walking half a mile that felt like 10 due to the incline of the hills, this little spot called Bacon Bacon is heaven for those bacon lovers. By the way, who doesn't LOVE BACON RIGHT!!!  If it wasn't good for us then why did the lord put it on earth for us. Things that make you go hmmm.  \n\nAnyways, we came for breakfast so i can only speak for that part of the menu. The breakfast burrito is to die for . So don't ask for the calorie count, JUST EAT IT!!! Your taste buds will thank you later. The rest of the menu must be good too, especially since it has bacon. Sandwich with bacon, burrito with bacon, fries with bacon, SALAD, yep, with bacon.  So don't miss out on this place if you are a bacon lover. \n\n2 thumbs up . Best bacon spot ever!!", "author": "Andy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "Order: Cuban sandwich and Mac and cheese balls \n\nThe mac and cheese balls were a little salty dipped in the sauce. Not over powering but when I took a bite my partner and I both said it without thinking. \n\nThe Cuban was to die for the meat was tender and felt like it was cooked for 8 hours plus. The bread was nice and toasted the bell peppers were a nice twist \n\nThis place is a nice spot to drop by for a bite on your way to somewhere. \nSitting is nice also.", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Amazing. Bacon Bacon. A must visit spot. \n\nDid i mention it was amazing?\n\nSo much delicious food, i wish my stomach was bigger so i could ingest more delicious bacon. \n\nI've never had a bad experience here, and i doubt i ever will.", "author": "Dave B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "I was craving bacon after an early morning flight into SF and behold this gem! I got the Frederick and was NOT disappointed! Phenomenal salty flavors. Omg. Bacon lover's dream spot. Walk up & order.", "author": "Debra B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "Anything you order here will fill you up! There is a lot of food for your buck. For two people you can share fries and each person can get a sandwich. Another wonderful brunch place since they open at 11am and breakfast is served late. They're Havana coffee is also delicious. Iced coffee with condensed milk!!! I will definitely be coming back for some coffee and breakfast.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "If I could leave no stars I would. The service here is horrible. The cashier kept running in and out of the restaurant. At one point he got into a car and drove off. I ordered 3 sandwiches, almost veggies with No Bacon. I was very adamant about NO Bacon. We waited well over 10 minutes. When we left with the sandwich's, I asked again \"no bacon, right?\" And was assured that there was no bacon. When I got back to the house. BACON.  I understand the name is Bacon Bacon. But the order should have been right. The cashier argued with me when I brought hem back. His attitude was poor. I will never go back. Which is a shame because I love their coffee.", "author": "Leah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Such a great place. Have been multiple times for breakfast and once for lunch now. I had the fried chicken sandwich and was so great! The flavors were on point and the chicken was nice and crisp. Also had the fried Mac and cheese balls. This obviously isn't a place to try if eating healthy. The breakfast is also great but the breakfast burrito has always been so extra greasy I wouldn't recommend that. Will definitely be back sometime tho!", "author": "Emily F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-26", "description": "This place is overhyped, super bummed it wasn't as good as what I dreamed about. I've been to both locations. The one in Haight I got the Cuban and there was a decent amount of meat on there but it was super dry. The meat was good though. My husband got the Bird and he had the same problem, not enough sauce. \n\nWhen the King St. location was open I had the Breakfast Burrito and that was good. It was super heavy and I felt like my heart was going to stop after I was done. It wasn't anything outstanding, just a typical breakfast burrito. \n\nThere is no parking ... so good luck. Pricing is average.\n\nIf this was the only place to eat in the area I'd go here again but it's not a spot I crave or keep wanting to go back too.", "author": "Mal L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "Got the breakfast burrito and it was unfortunately a little, WET, which is great for certain things....but not my egg filled burrito.  Maybe I just caught them at a bad time because everything on the menu looked good.  Must come back to give it another try but for now...be careful of the breakfast burttitooooo", "author": "Vince L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Great grilled cheese bacon sandwich.  I had it for the first time yesterday and it was fantastic. I'll be coming here again.", "author": "Henry V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Food: \nBreakfast bowl: tender pork, delicious avocado, and tons of flavor in this bowl. So yummy! \n\nAmbiance: \nDecent amount of seating. Ideal for groups of 4-5 at the high tops. Open and clean with nice, large windows. \n\nLocation: \nParking in this area can be tough. We came early (before 8) and had a little bit of a walk. Maybe it's better later on when some more people have left for work?\n\nService: \nFriendly and prompt! No complaints here :)", "author": "Susan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Ain't nothing like a good breakfast burrito!\n\nThat being said, it takes a bit longer than usual for your food to be prepared. For counter service, I would generally expect 10 minutes tops for my food to be ready; here, it took probably 15-20. \n\nOkay, so maybe I was a little impatient, but when that glorious golden burrito landed, I was filled with delight at every bite. \n\nThe food here is delicious, but they would improve on their service time. Still a solid choice for all your bacon-y cravings!", "author": "Fiona F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "I had been to the food truck so said I would give the bricks and mortar place a go! We didn't have breakfast... had the burger which was excellent and my partner had the salad... also excellent... the place is a little rough and ready... but the staff are friendly... if in the neighbourhood it's worth it... I will give breakfast a go next time!", "author": "Reg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "WHERE HAVE YOU BEEN ALL MY LIFE?! The name of Bacon Bacon is like... meat that is so epic it just echoes when you say it once. My boyfriend and I live in the Castro District, so we decided to take a nice Sunday stroll here.\n\nWe ordered the Breakfast Sandwich and Breakfast Burrito to split, then the Porky Fries and Bacon Chili to save for later - yes we were feeling ambitious that day. Our food seemed to take forever to prepare. There is also not a lot of seating, so you might have to wait around for a bit and snatch a table when someone leaves. In the meantime, we enjoyed a tasty Hot Havana Latte.\n\nThe wait was so worth it though. The Breakfast Sandwich was my favorite out of all those choices. The egg was messy but the flavor was perfect. How could such a simple sandwich be so good? Would recommend. The other foods we got were also good. Would not recommend saving any of these for later like I tried to do.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "Tried the breakfast bowl. Really yummy, but it felt like half a serving, for $7. Coffee was alright. Small space, but at least they have a restroom (upstairs).", "author": "D M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Everything Bacon!\n\nI ran into an article in the Chronicle about Bacon Bacon opening at a new location near AT&T Park. I had never heard of them, so I thought I check them out at their current location in Upper Haight and that is how we ended up having breakfast here.\n\nThe coffee is very good (BIG plus) and the sandwiches are great, but I went with the Breakfast Bowl. It is small, but delicious and filling. The space is small and has limited seats, so get there early or be prepared to take out. The young man behind the counter was very personable and nice.\n\nIf you want a taste of delicious bacon, visit Bacon Bacon!", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "The breakfast sandwich with avocado added vs breakfast burrito - definitely get the sandwich as it'll have more texture. The burrito was a bit too mushy. Perhaps if they added some crispy bacon or French fries (; it'll give it a little more texture with the delicious flavor.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Yumm!! Definitely a fan of Bacon Bacon. They used to be food truck but now they opened a restaurant! The staffs are super nice, food comes out fast, great quality and they sell T-shirts! I actually got a shirt that made me laugh, \"You had me at bacon\" lollll! \n\nI came here for breakfast with my roommate and we ordered the breakfast burrito and the breakfast sandwich. We both were not too cray about the breakfast burrito even though they recommend the best thing on the menu. It didn't have much spices and could use more ingredients. As for the breakfast sandwich, it was bomb diggity! The egg was cooked perfectly (yoked) and the bun was sweet and tasteful. Definitely recommend the breakfast sandwich over the burrito. \n\nOverall, great breakfast spot and they also do lunch as well. I'll come back here again.", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "My boyfriend actually found this spot because we were both craving breakfast sandwiches and we absolutely miss Eggslut down in Southern California, so this was pretty much as close as we could get to eggslut (minus the whole menu being about eggs). Parking is EXTREMELY difficult, so I would recommend either taking public transportation here or finding parking a couple blocks away.\n\nMy boyfriend and I both ordered the bacon breakfast sandwich because we wanted something that had a runny egg in it,plus we were both intrigued by the bacon jam it had. We ended up taking it to go because we were double parked and luckily, Haight and Ashbury wasn't too far away. We drove over there and enjoyed our breakfast sandwiches, but my boyfriend ended up forgetting that the egg was going to be a runny yolk and it exploded all over his car + pants (LOL). The breakfast sandwich was VERY light, especially with the amount of bacon in this sandwich. Definitely something worth getting in the morning! \n\nThe second time we came here,we wanted to order something off the lunch menu and we ended up getting the fried chicken sandwich. I have to say that I wasn't expecting the sandwich to be so big. There was TONS of fried chicken in that sandwich and to be honest, I couldn't finish it. I ended up getting a bit tired of the taste towards the end because of the bacon jam and the fried chicken, but honestly, it was still a pretty good sandwich (I can only eat half of it at once though).", "author": "Trisha L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-13", "description": "Been seeing this place pop up in my search feed on yelp and decided to finally give it a try! I've been searching for breakfast burritos, but when I came here I ended up getting something else. Would give it 3.5. Will come back to try their breakfast burrito though!\n\nOrdered:\n-bacon fried chicken sandwich: this sounded so good and I was super excited to try this, but when I finally got to it, I thought it was okay. Chicken was a little dry, but that's not surprising for a fried breast. The bacon wasn't crispy, wonder if I could have asked for them to make it extra crispy? I think I would have loved this if it had brown sugar/maple glazed bacon. That's just my opinion though~\n\n-CA bacon bbq burrito: boyfriend got this. It was pretty good! I liked this a bit more than my sandwich. We both agreed that this needed more bbq sauce.\n\n-mac and cheese balls: nice and crispy exterior, yummy mac and cheese goodness interior. Can't go wrong here.\n\nService was nice and friendly and seating can be a little limited during lunch rush, I'm sure. If dining in, you can clean up after yourself and put away your plate and cups off to the side of the register. Parking can be a little bit of a pain too. We had to drive around a little bit and ended up parking a few blocks away. Good to walk off the meal though, taha~", "author": "Tina N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-24", "description": "This is a small spot my friends and I stopped by before heading to Golden Gate park. We came around 1pm on a Saturday and managed to snag the big table in the back, but I think that depends a lot on luck. Hearing that the breakfast burritos \"were to die for,\" my friends and I went for that and the Banh Mi. \n\nAfter watching a number of customers behind us get their orders first (maybe because they were to-go? still unknown...), we finally (and slowly) got all our orders. The sizes of the portions are definitely overwhelming and filling, but I think that the breakfast burrito is average at best. I'm not usually a fan of bacon, but I was a bit disappointed to see that the bacon at a place known for bacon was not very impressive. \n\nOverall, the service was slow, the food was average, and it's a tight squeeze to find a place to sit. Would think about it before going here again.", "author": "Cindy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Came across this place while visiting San Fracisco.... OMG, it was soooo Good! Had there Breakfast Sandwich and it was to die for! Bread was fresh and fluffy, the bacon jam was amazing. Very flavorful . Their Mac n Cheese Bacon fried balls are a must!", "author": "Eva Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Absolutely will be visiting this place again!!! Such a welcoming, chill atmosphere and their hot sauce just proves the authenticity! Love this place!!!", "author": "Cassie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "This place is pretty underwhelming as a breakfast spot. Putting aside my dislike for over-the-top bacon worship, I just don't feel like Bacon Bacon nails any of their dishes. \n\nThe breakfast sandwich is okay (good bun, good \"bacon jelly\"), but not substantial enough for me as a stand-alone. Maybe it could benefit from a sausage patty or something. \n\nThe breakfast burrito is also serviceable and more filling, but less appealing/satisfying than what you'd get at most Mexican restaurants. I feel like their pulled pork texture doesn't jive well w/ the rest of the burrito. \n\nFinal nail that keeps me from hitting Bacon Bacon breakfast more often is that they put crushed ice in their coffee instead of cubed -- watery iced coffee really gets my goat (or pig)!", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "This place is as bacon as it gets! I was looking for a good breakfast spot in the area and happened to find this gem super close by! Being a bacon lover, I had no idea on what to order since everything on the menu sounded good. Ended up getting the breakfast burrito and it did not disappoint! A little pricey (as expected) but definitely would order again!", "author": "Joshua H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "Solid place!  When -every- dish (well almost) has bacon, what's not to love?\n\nNestled in a nice area on the edge of Haight-Ashbury, Bacon Bacon is just a fun place to be. The menu is very broad, and I was torn between several things. Cheaper than I expected, though portions were not especially large. Expect to order a few things if you're hungry. Atmosphere was nice, and you can eat with a great view of a neighborhood you probably can't afford ;)\n\nI definitely recommend the breakfast bacon taco and the BBQ burrito. Both were amazing and quickly quelled my hunger. The bacon grilled cheese was also worth the trip. I love how many of their dishes incorporate pork belly or pulled pork as well as bacon. ALL THE PORK. Coffee wasn't bad either.\n\nCan't wait to return for another weekend craving!", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-08", "description": "This is my second time eating here. I didnt like the bacon chedder scone. It reminded me of cornbread. Bacon cheese burger was good but def get the double. Not much meat on a single. Good fries", "author": "Candy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Breakfast Burrito was da bomb! Loved it, and not a potato in sight! Just pure meat and eggs. Well worth the journey from downtown SF. Saturday morning and no line. Highly recommend!!", "author": "Mark-Jenni E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "The burrito was wayyyyyyyy too bacon-y for me on the first try. I had to ask for a lot more eggs and less meat on the second go (can't handle the 20:1 ratio they put originally) and that was excellent. Great place!", "author": "Joe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "So I walked in on a whim for a breakfast burrito after a long night of work. I was not disappointed. \n\nThe burrito is mostly meat too so I was so full afterwards. And the pulled pork was delicious. Only regret was not eating it with hot sauce!!", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "So good! Great customer service. \n\nMaybe I set my expectations too high because I saw the word bacon twice, but I kind of wanted more options and to be a little bit more wowed by their feats of bacon making, you know what I mean?\n\nThe coffee I had was extremely good. \n\nReally nice ambiance.", "author": "Casey K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "I went to their physical location with my sisters. First off there is basically no seating in the place so don't try bringing more than 2-3 people. It's going to be difficult to find seating. And the seating is bar stools (no backs) so it's not the most comfortable of dining experiences.\n\nThe food itself is okay. I got a bacon egg and cheese sandwich. Beware the egg is not scrambled so if you're not careful the liquid yolk will spatter everywhere! Like what happened to me.\n\nI didn't think the sandwich was anything special. I didn't think the bacon jam really added anything to the dish. It might be because I like my eggs scrambled instead. I have eaten better sandwiches sorry!", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "The Bacon-Bacon truck has to be one of my favorite stops from the trip to San Francisco with Yelps ACRONYM squad! We visited the SOMA StrEAT food park on our first day in the city and were graciously treated to several tickets to use for our meals and drinks. The Bacon Bacon truck lured me in with their bacon fried chicken sandwich (consisting of : bacon *duh!*, panko encrusted chicken breast, spicy slaw and bacon mayo!!). \n\nService was fast, friendly, and attentive and I had an amazing conversation with the guy who was taking orders. He recommended several places for me to check out during my weekend in San Fran as well as provided recommendations for items to try from the other trucks in the lot. \n\nMy sandwich was HUGE and received a ton of \"ooohs\" and \"aaaaahs\" from the other ACRONYM members as I sat down to devour it. The chicken breast was perfectly cooked and juicy and the bacon mayo left me craving more. \n\nThe Bacon Bacon truck was able to show me that you don't need fancy ingredients to make one hell of a sandwich - all you need is a little love, and a lot of bacon!", "author": "Zoie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "\"We finally made it.\" When we arrived on foot, he turned to me and said it slowly. He looked impressed, as if he did not believe that we'd ever make it out here. I remembered distinctively that day when I sent an online review of this place to him, and said, \"you should go there.\" He replied back \"Yes plz\" but he never came here on his own even though this was damn close to his house. He was waiting for me to go with, as it turned out. \n\nBut you see, I had seen their food truck in SoMa, I never paid much attention to it really, until a nice article about the store front showed up. I go where the reviews tell me to go. I'm a follower and not a leader. And I like to stereotype.  You know how some people stereotype Asians, I stereotype the Midwesterners. If you announce to me that you are from Nebraska, Indiana and Iowa, I immediately think you are raised on a farm, harvested corn and ate bacon until you can't stand it any more and then you headed west. I'd be wrong, of course, but I'd be right about him liking bacon, who is one of those (wrongly) stereotyped Midwesterners.\n\nI knew because we had spent weeks last winter discussing bacon. Yes I like to spend time pontificating bacon. \n\nThe restaurant is hidden among a bunch of stately Victorian homes, \"stately\" maybe an overstatement, it's pretty and pristine, and well maintained. Fredrick street is residential, except for Bacon Bacon, there were just bunch of Victorians. You'd think you'd smell the bacon from miles away but you'd be wrong. The store front is not very large. I missed it, he spotted it. Once inside, you'd feel that it's got a bit of an odd combo: They also serve espresso drinks, fanciful ones with their own blend of coffee beans, along side with down home cooking of bacon themed sandwiches.\n\nFor $7, you get a gourmet breakfast sandwich with googy eggs and bacon strips. For a little more, $9, you get the stack of meats piled on with bacon as one of the meats, inside of a fresh roll, yes that's the Cuban and it was wonderful. If you are into pork belly alongside of your thick cut strips of bacon.\n\nAmericano for the after this-piggie-went-to-the-market meal drink. Foamed just right.\n\nInside dining spots are very sparse, but, on a weekend holiday, one could withstand a little bit of a wait and your patience will be rewarded with the front window counter space, where you get the view of the pretty Victorian homes across the street. Turning the other way, you'd often see someone riding the electric pig doing the photo op thing. Earlier, I had mistaken it for the horsey until he asked me to get on top of it like every other tourist. No, thank you, I look ridiculous enough without hopping on that piggy. \n\nI don't think I've ever had a sandwich that tasted this good. \n\n\"It's worth the wait.\" He concluded. \n\nIs it? Must all good things in life withstand the agony of wait? Now it's been found, can we declare every day be bacon bacon day from here on out?", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-10", "description": "I've been to Bacon Bacon twice now - once for the California Burrito and once for the breakfast burrito. Honestly, I found both to be underwhelming and lacking flavor. I think most disappointing was that the bacon both times was average. A place called Bacon Bacon - you'd think the bacon would be top notch! It wasn't.\n\nI'll eat here again (probably hungover) because it's easy and local to me, not because it's particularly good.", "author": "Russ S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "Went there with my daughter and husband as it is a neighborhood place. My daughter was startling and we asked to get her order first.After waiting 30 minutes, the cashier told me their printer was not working and the order had to be redone. Then when\nthe food came out, it was boxed to go. My daughter asked for the bacon on the side and that was not done. The cashier was rude for messing up our order. $42 for 2 burgers and a mediocre salad is a rip off!!! The french fries cane afterwards. Very disappointed. We want to support local businesses and understand why people would want to go to bigger chains of customer service is do abominable.", "author": "diana b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Bacon? Bacon.\n\nThere's a reason they say bacon twice in their name, because they take this delicacy veryyy seriously. Everything on their menu is chock-full of bacon! From the salads, to the wide array of their sandwiches, to even their desserts and drinks (my friend ordered the Mexican Hot Chocolate which was topped with bacon, a fun and delicious treat!)! \n\nThe place is rather tight, but what they lack in size, they make up for in the close care and attention they have for their customers and food. The service was very kind and helpful, and our food came out at a very fast time! \n\nNow onto the bacon. we ordered the Cuban, the Bahn Mi, and the Bacon Grilled Cheese, which all came in a fairly large serving, so we were all fine sharing. While putting bacon in a Bahn Mi and bacon \"jam\" in a grilled cheese may sound unusual, it made our dishes surprisingly much more savory and added that salt component without being too overwhelming. There is so much precision to crafting all these dishes with bacon as to not be excessively greasy, salty, or fatty, and the people here have perfected their recipes so much, it makes me want to come back and try everything, especially their desserts!\n\nWhile seating may be sparce, the atmosphere is very fun as there are photographs of satisfied customers all on the walls, and we (and you!) will be glad to be on it as well.", "author": "Kyrie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Umm excuse me did I tell you to smile?\nI saaaid did I tell you to smile.\nDid I give yo dreezyazz PER-MISS-ION to be\nMzfzn infectiously joyous w every word u say\nAnd to serve me such radscrumplicious\nBrekko #DeanFspiration while we all\nRock the eff out to the 1st Weezer album?\nOh I didn't?\nSee that's what I thought. Tripsta.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "The food here is decent, and everything tastes fine.  But.  When 'The Fries' that are supposed to come with 'herb and Parmesan' come with a negligible amount of both, what am I really paying 4 dollars for?  A small thing of greasy fries?  Pretty disappointing", "author": "Dylan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "What a fantastic place! I stop by every time in in San Francisco. The name says it all but there's more. I cannot think of a better place to recommend for a good sturdy breakfast in SF!", "author": "G N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "I ordered the Cobb salad via Postmates, and it was delicious. Pork belly, pork shoulder, bacon, guac and a good Cobb dressing.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-10", "description": "Ordered takeout from here- a breakfast burrito and bacon fries. Was unfortunately thoroughly unimpressed. The burrito was missing avocado included in the description and overall flavor was meh. The fries were also not so great and they forgot the blue cheese dip.", "author": "Brittany B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "Meh, long wait time, not cheap. Apparently the breakfast sandwich and the burrito are pretty good, my breakfast bowl was super disappointing, didn't finish it.", "author": "Nicolas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "You'd figure a place with 4.5 stars after 225 reviews would be a good place to try some chow. You would be remiss to think otherwise.  OMG. This place is the absolute best burger in town.  I satisfied my urge for some healthy greasy options by going here.  As a native Chicagoan escaping the cold for a few weeks into the sunny skies of SF, I found this to be an awesome joint.  \n\nThe man behind the counter was helpful and very polite.  The place closed at 3pm, and I walked in at 2:55 and got a burger and coke.  It was delightful.  Minimal greasy and goo, well cooked, but not overdone.  The bund was soft and delicious and the whole thing went down fast.  \n\nYou won't get attitude or negativity here, and you will definitely leave with a smile on your face.  The Uber driver was late picking me up tho. That guy sucks. I almost passed out on the sidewalk from food bliss.  Be careful ;)", "author": "Brian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "Note: Food truck by Market Street review. This hit the spot! I Ordered the California BBQ Bacon Burrito and it was absolutely fantastic. It was ready almost instantly and the staff were very friendly. I ended up eating it before I even got back to my desk at work. The bacon was crispy and it had a perfect blend of pulled pork and cold slaw. The BBQ was sweet honey and it blended perfectly. Mixed in with French fries this was literally the first time I've almost gone back to get seconds from a food truck. I enjoyed this immensely and will definitely return again!", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Small little place, Great bacon wrapped pork breakfast burrito... in a historic building near haughty-asbury", "author": "Pat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "The best breakfast burrito I've ever had!! Plus great coffee and customer service. Definitely coming back!", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "I love BACON.  So does my son.  He can have it everyday if he had the choice. \n\nI've been wanting to try Bacon Bacon for some time but have never had the chance, until today.  My mom and I were in the area and were a little hungry so we decided to stop by Bacon Bacon.   It was just around breakfast so we decided to stick with the breakfast menu which I regret now!  I think I may have ordered the wrong items because upon reading other Yelper reviews, they all seem to love it. \n\nMy experience on the other hand was just OK.  My mom ordered the  breakfast sandwich and I ordered the breakfast burrito.  We split both of the items we ordered.  \nHonestly I thought my sandwich was pretty bland and the burrito was just OK.  That won't deter me from coming because they had other items that I definitely want to try. \n\nThe restaurant is fairly small but there is definitely room to sit and eat.  They also have a mechanical pig that your little boy or girl can ride! I don't know if I would sit on that thing as an adult with the fear of breaking it. But it's a cute, kitschy thing to have in the restaurant.  They also sell Bacon Bacon shirts, chocolate dipped bacon, cookies and popcorn which I skipped out on but may try in the future. \n\nOverall verdict: I will come back to try the rest of the menu.  The breakfast items I did order were just OK.  But I love bacon, so this place is definitely a plus in my book.", "author": "Christine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "I was in San Francisco for a bachelorette party. I had dropped a pin on my map so I knew where our Airbnb house was. After dropping the pin, I was looking at the surrounding area and noticed \"Bacon Bacon.\" Who doesn't love bacon? I knew I had to check it out! Cute little cafe. I had ordered two breakfast tacos, which had scrambled eggs, chopped bacon, avocado, cheddar cheese, banana peppers, and hot sauce on a corn tortilla. Soooo good! Lots of people constantly coming in to eat or pick up an order.", "author": "Nina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-26", "description": "WHAT?\n\nI was looking up places to eat on a Saturday morning and found Bacon Bacon. I've seen their truck various places, but I've had a few of their dishes. Found the breakfast sandwich was a popular dish here so I figured - Saturday morning with nothing to do, so i decided to take a bus and get there. \n\nThe breakfast sandwich was delicious! The egg was definitely really gooey and messy, but oh so good.  Bacon, bacon jam - definitely added to the amazingness of the sandwich.  Amazing and loved it. \n\nMust try some of the lunch sandwiches next time.\n\nProtip: breakfast sandwich is messy, but OH SO GOOD", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "I love bacon, and I want to love this place, but I always leave a little disappointed.  I've been there on three occasions, and each time the bacon was chewy and flabby.  I realize this is a matter of opinion, but I think most people prefer their bacon slightly on the crispy side.  I find their bacon underdone.\n\nFood takes quite a while to arrive, so perhaps they're cooking each batch to order.  It takes time to perfectly cook bacon.  Perhaps they could pre-cook a bunch and warm it up as necessary.  It'll taste just as good.", "author": "Lucullus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Apparently I'm #2 when it comes to Yelp check-ins, so it's about time I wrote a review! \n\nBacon Bacon is one of my go-to for quick weekend brunch, especially since I live so close. Not only do they have an amazing selection of bacon-products, but it's also not crazy expensive as brunch can sometimes be. My favorite is the breakfast burrito, and the porky fries are also bomb if you're hungry enough! \n\nThey have a limited amount of seating (4 tables and a bench), so weekends can get a little hectic if you're planning on eating there. But luckily service is pretty fast so people are in and out quickly!\n\nDefinitely a must-try if you love bacon. Also try their food truck if you're at off the grid!", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "We ordered two burritos, filled with pulled pork, pork belly, coleslaw  and french fries. My sil had the fried chicken sandwich. He loved it. I  had the grilled chicken sandwich. I  would love to go back and try the porky fries. Fun atmosphere and excellent staff. Deliciousness", "author": "Alicia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Upped your game at the store Bacon Bacon. Interior is open and inviting, not to mention spotless. Great prices on coffee drinks that taste top notch. Like the fact that vegetarians can eat here too due to thoughtful menu.  And of course it is still a temple to the fatty meat we all love. Great breakfast AND lunch spot. I will be back. Btw nice counter service today so keep that guy around.", "author": "Miss F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "Stopped by here after a morning of hiking around Mt. Sutro.  It's a small little cafe space with lots of bacon on the menu.\n\nI order the LGBT (heh) sandwich, which consists of lettuce, goat cheese, bacon, and tomato.  Also picked up a bag of chips, a lemonade, and a chocolate dipped chocolate chip cookie topped with chopped bacon.\n\nBest idea I've ever had.  This had such a great combo of flavors, and, hello, it has bacon.  BACON THE EVERYTHING!\n\nI know it's a fad/trend, but it certainly helps that it tastes so amazing.  Bacon has been a staple of great food for a while, and a bacon everything place may (or may not) be sustainable forever, but why not enjoy it while we can?!  Such a great way to spend your lunch!", "author": "Jes G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Tried to breakfast burrito, should of got more bacon! Filled with pork and all the goodies. Tasted fresh, wish there was a salsa that came on the side but that's just me", "author": "Rainier V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "Great place to have breakfast at. Though seating is definitely sparse, if you're looking for a great breakfast sandwich or burrito with iced coffee to go, this place is perfect. Like the food truck, this place is happening!", "author": "Juan T. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "We drove from the peninsula into SF just to try their breakfast sandwich.  Moving from NYC, we've been dying for a good hearty grilled breakfast sandwich but haven't been able to find an ideal one yet.\n\nTheir breakfast sandwich was unique and quite good but I still wouldn't write home to about it.  The fun surprise was when my fiancé and I both took a first bite and the perfectly cooked fried egg oozed over our hands. Delicious food is meant to be messy!  It was good. You could taste the bacon jam and the slices of bacon were just the right thickness. I just wish the brioche was a little smaller, otherwise wish the proportion of sandwich ingredients was more balanced. I'd say the bread : ingredient ratio was about 1:1, I think it should be more 1:2 to get more flavor and texture. \n\nGood sandwich overall, we'd probably come back if in the neighborhood next time.  \n\nThe cafe is cute. Ride the pig and snap a photo for the wall!", "author": "Angela K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "LOVE their Bacon Bouquet - I get it every time I see their food truck even if I'm not hungry because #bacon. Their food is generally pretty fantastic, but I have a few gripes. I've had their fried chicken sandwich a few times and I like it (would give it a solid B), but it honestly leaves a bit to be desired. I wish it had a fried egg or more moisture in the chicken. Also, their garlic fries get a B for the same reason as the sandwich, they're missing that extra oompf. Bonus points for their side salad and dressing though, it's on point!\n\nNext time I go hear I'm getting their breakfast sando, I hear it's the best one in the city.", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Best bacon and grilled cheese in Nor Cal. We made over an hour drive for this craving and it didn't disappoint. The super friendly service makes it even more enjoyable. This is an experience you must have!", "author": "Cristina O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "Found this place on trip advisor and decided to check it out! As you would guess with the name of the restaurant, everything pretty much has bacon in it. I got the bacon and pulled pork burrito which was pretty good! It looks small, but it's much more filling than you would expect. Had a glass of fresh orange juice on the side also. Perfect quick breakfast meal! The restaurant is pretty small and there is limited seating, so if it was a busy day you might need to take it to go. Also, it's in a residential area so good to walk to but no parking besides street parking. Neat little hole in the wall restaurant! Would definitely come back if I was in the area. Staff was very friendly.", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-11", "description": "Service was friendly joint was clean... Wished we were able to try their lunch fare during the morning hours ;( \nBreakfast was not knock your socks off I have to come back... \nWill return for lunch and update this.", "author": "Liz N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "It's all about the bacon.  I love them just for that.  I ordered the bacon bouquet.  4 strips of their friggin delicious delicacy, all wrapped up in a paper cone.  I also ordered the Mexican hot chocolate.  Yes, it has bacon, too.  Here's what happened...\n\nI took one bite on my way out.  Handbag hanging from the crook of my elbow, hot choc in one hand, my cone of bacon w a bunch of napkins in the other...\nI couldn't stop eating this bacon.\nIt was a block to my car, & I was inhaling this bacon like someone that had just gone without food for a couple of days.  I get to my car, & resume.  Really, just a shameless display.  All customary dignity & decorum out the window.\nAnd you know what?  I'd do it again.\n\nDo you have any idea how well hot chocolate & bacon go together?  A perfect marriage.  \n\nBacon Bacon is back.  Love.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Bacon Bacon is a great casual breakfast & brunch spot, I couldn't be happier to live as close to it as I do.\n\nMy favorite things to get consistently are the breakfast burrito, the cup of chili to-go, and iced almond milk lattes.\n\nTheir sandwiches are also very good!\n\nI love the staff and also their use of compostable materials. \n\nAlso, mochas with bacon crumples on top!!!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-04", "description": "This place was good. I got their breakfast burrito, which I expected to be more egg-y but instead it was full of meat...I guess that's what you expect from a place that's called BaconBacon. Just not exactly my cup of tea. Their coffee is really good, and the guy that served us was really nice.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-05", "description": "Really wanted to love this place, but honestly the food can easily be made at home for a fraction of the price. The tortilla for the burrito wasn't fresh, and the bacon in the breakfast sandwich was definitely reheated from previously being cooked. Staff are super nice and friendly and the place is very cute!", "author": "Kristin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Delicious Breakfast Burrito \nAmazing Cuban Latte. \n\nStaff was extremely friendly and did a great job on a busy Saturday morning.", "author": "Cynthia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "This place is amazing. The breakfast sandwich is one of the best breakfast sandos I've ever had. The breakfast burrito is also scrumptious and not your average burrito- shredded pork with eggs, bacon, avocado + cheddar. \n\nThe iced coffee is also great. They have crushed ice and almond milk.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "This little restaurant has a theme that they passionately stick to. Bacon everything.  \n\n:: The Almost Veggie Sandwich - One of the few menu items with vegetables. It was great how they packed everything in to this sandwich, and it somehow all stayed put. I asked for the scrambled eggs instead of over easy, so it wouldn't get all oozy and messy. Some people may prefer the liquid richness of the runny egg yolk though. \n:: Breakfast Sandwich - The brioche bun was SO FLUFFY! They've really perfected this baby. \n:: Porky Fries - The bacon bits were quite the salty bunch. They were almost like porchetta. A total splurge, but it was a fun one.\n\nGreat place to stop in for a quick bite or even a brunch when you don't feel like waiting in a long line.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Food was amazing and reasonably priced. The man who greeted us and took our order was so nice and helpful. Would definitely recommend coming for breakfast!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "This little hole in the wall restaurant had good tasting food, good service but very little room to sit and wait to be served and the bathroom is tiny and dirty so if you are running in to get some tasty food to go its perfect!", "author": "Shellee P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "I love bacon and am tired of restaurants being stingy with my favorite breakfast meat. My brother lives around the corner and on my last visit, eating at Bacon Bacon was at the top of my list. Unfortunately, I didn't get here until my last day otherwise I would have eaten here for breakfast and lunch every day. Finally--a restaurant that fulfills my bacon cravings!!\n\nI got the breakfast sandwich as I was totally intrigued by the bacon jam. Not the best name for this saucy delight but I can't think of any other one that fits. The counter person said it was their signature sandwich and it totally lived up to its designation: Brioche bread, with a sunny-side up egg, bacon, more bacon, extra bacon, and bacon jam. So good, I got one to take on the plane for my husband back in NYC. \n\nGood strong coffee to wash it all down. \n\nBest last breakfast in SF. Will definitely be coming back next trip--first thing ;)", "author": "S P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Amazing. \n\nIf you are a bacon lover this place has to be tried.\n\nBacon chocolate chip cookies.\n\nBacon breakfast tacos.\n\nBacon and pulled pork breakfast burritos.\n\nBacon scones.\n\nYou get the idea........... They serve breakfast all day and lunch is supposed to be pretty amazing. If you go early in the morning there isn't a wait, ever.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Such a great spot. I had a breakfast burrito that was to die for. My gf and I were getting a bit overwhelmed with the crowds at every spot, so we only went in because it wasn't crowded at all. As soon as we started eating it got packed. I'm glad we saw it when we did or else we would have missed out. Can wait to visit again.", "author": "Zhakiry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "All things wrapped, covered, and associated with bacon is heavenly.\n\nSince my first father's day coincided with my son's sixth birthday my wife had the beautiful task of finding a breakfast spot that would satisfy both of our stomachs. Naturally, she pulls through and finds the bacon bacon cafe. Note my son and I tried this fine cuisine last year at Eat Real via it's food truck. To say the least it's one of our most favorite trucks.\n\nAeden enjoyed their breakfast sandwich while I got my favorite breakfast item, a breakfast burrito. At $7 it's reasonably priced and filled perfectly. No rice or potatoes which was fine by me. Satisfying, not overwhelming. In my college days this would have been disappointing, however, as a father being more mindful of my diet this was a worthwhile treat. \n\nOn top of that I had an incredible iced Havana latte (mixed with condensed milk). It honestly is the best iced latte I've ever had. I even wondered for a second if some bacon was sprinkled for good luck ;)\n\nThe cherry on top or better yet the apple in the pig's mouth were our parting gifts. The young man staffed as the cashier that morning was a wonderful host. Warm smile and greetings for everyone. Anyway, I bothered him with plenty of questions/conversation during his shift and mentioned why we came to the cafe. As we were leaving he gave my son a piece of chocolate covered bacon for the road and for me a free sandwich card to use at their fisherman's wharf location.\n\nIt was a generous gift for my son and to include me was a bonus (Thank you again if you happen to read this review!). These are the kind of gestures that should not go unnoticed and encourages me to return to try the rest of their tasty menu.", "author": "Patrick Gabriel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "This place was amazing!! My bf and I were in SF for the weekend and came across this small place. They had a very simple menu. I had the breakfast sandwich and my bf ordered the breakfast burrito. the sandwich was good but that breakfast burrito was soooo delicious. The coffee was your typical medium roast but it was ok. I think we will definitely pay a visit when we're in the area.", "author": "Karina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Pros:\n\n-Bacon fried chicken sandwich was awesome. Ordered it with the bacon mayo and bacon jam. \n\n-Chocolate covered bacon with heath pieces. My bf loved it. I thought it was subpar. It tasted like chocolate shell, or very cheap chocolate enrobing the bacon. Some like it though, just didn't do it for me. \n\n-Some very creative bacon menu items\n\nCons:\n\n-Soon after opening, they ran out of root beer. I was there as off the grid had opened and had my eye on this place and it seems as though the planned poorly and came with a nearly empty keg of root beer. So that was disappointing.\n\n-Staff was not friendly. The cashier was ok, the guy calling out our orders for pickup was, eh- a bummer. Spoiled the experience, because I was so happy to be there and patronize them. They just seemed bothered when interacting with patrons. Sad. \n\nNegative one star for the two cons.", "author": "Stardust N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "The food is awesome, and the service is even better. Got the breakfast burrito and couldn't have been happier. Pretty sure the guy behind the counter was the owner, and he was the man. Definitely coming back for lunch.", "author": "Dean H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "Finally made it to the brick and mortar spot for Bacon Bacon and I could not be happier! Yes, there were many items that you cannot find on the truck, but I was on a mission to try the breakfast sandwich with a fried egg, cheese, yummy bacon, and bacon jam. It was sooooooooo good that I damn near finished it in under 3 minutes as the ooze of egg yolk ran down my hand. \n\nMy next mission: banh mi sandwich.", "author": "Vanessa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Bacon fried chicken sandwich is ridiculous..... Love it!!! Great mix of salty and savory. \n\nGot the Cuban as well. Decent, but not amazing. \n\nThe homemade pork rinds were grub #100%", "author": "Jeffrey O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "The service there really sucks. The guy at the counter always looks grumpy and the paper bags they use are cheap and fall apart easy so your food falls through it. The food is good but service makes you want to run! Picking up food should not have to be an ordeal.", "author": "Miche P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "Pretty good breakfast burrito.  They have the Valentina hot sauce.  Not as good as Olive's though.  Solid dirty chai.  Might make your digestive system feel a little funny afterwards though.", "author": "Alison D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "The bacon here is delicious!! I had the breakfast sandwich and the breakfast burrito. Both were good but I enjoyed the sandwich more. The sandwich was messy but the flavor of the egg and bacon stood out. The bun was toasted to perfection. \n\nWe had the maple bacon scone, once again I was not disappointed. The bacon did not dominate and the overall flavor was mild and sweet. \n\nGreat job Bacon Bacon!!!", "author": "James W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-12", "description": "Three strikes...you're out. \nOrdered three things all failed--\nChicken sandwich: They make it with chicken thigh which is not good for biting into for a sandwich (too tough) and had a odd texture and flavor was lacking complexity of even a fast food chicken sandwich. \nThe hamburger: was Very poor quality beef or at least was old meat. \nThe bacon bouquet: most of the bacon was undercooked and had to pull away half of each piece because pure fat.", "author": "Danielle O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-26", "description": "The sandwich I ordered was great and the French fries were ok but the chicken salad my friend ordered had a bug crawling around in it", "author": "Jacquie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-05", "description": "After reading reviews, looking at photos, researching thoroughly, we made the trek to Cole Valley. This seemed like a bacon lover's dream come true, but now that I've been here , I don't need to return and here's why...\n\n1. This place is tiny with very little seating. Read that as noisy, cramped and super annoying when you're sitting next to the mechanical horse thing with screeching children a foot away giggling gleefully ,so you feel like an asshole if you say anything. \n2. It took forever, ok the figurative forever, about 25 minutes, to get 3 sandwiches. That's an average of 8 minutes per sandwich! Understaffed? \n3. It ain't cheap. With all the extra money you're making, how about hiring more staff. See point #2. \n4. Most importantly, it's called Bacon Bacon you'd think they would use quality bacon. Come on!! Instead the bacon was thin, flavorless, barely there and tasted like the cheap Kirkland (aka Costco) brand. Sad face. If they had used Applewood smoked bacon, you'd be able to taste it. Instead everything tasted like pulled pork. if you add hot sauce, you'll definitely not taste bacon and you'll have to change the name of the sandwich cause now it's just misleading. \n\nThe Cuban tasted like pulled pork with melted cheese and bland roasted red peppers. \nThe breakfast burrito tasted like pulled pork with melted cheese and squishy baby food consistency avocado. It was so \"wet\" and greasy, the smell stuck to me for hours. \nThe bacon chicken burger had the thinnest slice of really crunchy overly deep fried Panko crusted chicken breast known to man and by now you could probably guess...the bacon was not noticeable and bland bland bland. \n\nEchoing what another reviewer said, due to blandness, condiments have to be added. Bbq sauce would make more sense as something available to use. \n\nAll these people who gave this place 5 stars are either friends of the proprietors, getting kick backs or living under a rock so anything would taste amazeballs. I was massively disappointed.", "author": "Betty V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "I was super hungry at work so I decided to order from Bacon Bacon! I had one of their burritos and bacon cookies a couple years ago at Off the Grid and I thought the food was pretty good. This time, I tried ordering a \"chocolate bacon\" which is literally chocolate sauce on one slice of bacon; would I order it again? no. For the taste as well as the price ($3). I also ordered a breakfast bowl, and a side of fries just because. I usually check my bag before I walk off from picking up a delivery, but didn't this time. They forgot the fries, which I was specifically looking forward to at 10am, and when I called, the guy who answered pretty much shrugged me off. \nHe said he could refund the cost of the fries and when I asked why he told me that Bacon Bacon doesn't have drivers and Grubhub could not send another one. He rushed me off of the phone and started taking someone elses' order without ending the conversation or confirming he got my information.\n\n I paid $23 not including tips for a slice of bacon and a soggy breakfast bowl, but luckily and deservedly I am getting a refund (after confirming with a second call). I will not eat Bacon Bacon! again. Customer Service 1/5. Taste 2/5 Quality 1.5/5", "author": "Kiwi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Best of all things bacon. We enjoy the food truck more often, but always love to get by the brick and mortar. It feels like a secret venue sometimes. No wait no lines just amazing bacon Ness.", "author": "Marc R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "pro's:\ngood food\ngood for take out\n\ncon's:\nparking sucks\nnot much seating\nprice is high for what you get\nsmall portions", "author": "C J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Their breakfast tacos are so affordable and amazing. I used to grab a coffee here every morning on the way to work and the people that work here are always so friendly.\nThey have a great assortment of different foods and beverages and are totally down to change things up when they can. \nHaving this place nearby is seriously the only thing I miss about that job.", "author": "Trouble B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "I hardly find any really good egg sandwiches that compare to my favorite breakfast joint in LA. This place is just as good! Really yummy food and friendly staff :) they took our pictures on the pig for their wall of photos haha", "author": "Darelle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Wait, how have I not reviewed this place before? Since they moved into the neighborhood, we've had them in heavy rotation for weekend breakfasts/lunches. We also hit their food truck pretty frequently at Off the Grid in the Haight on Thursday, where their hamburgers frequently play the role of \"only thing our toddler will eat at the food trucks.\"\nI won't waste your time by noting that pretty much everything but the croissants has bacon in it, but I will note that my favorite items are the breakfast sandwich and the tuna sandwich. I've tried just about everything else on the menu at this point, and I have yet to have a bad item. I'm not a coffee drinker, but I also have it on good secondary authority that they make a mean latte.", "author": "Pat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "The breakfast burrito is more like a carnitas burrito with bacon and egg. Not exactly what I expected, but still pretty damn good.", "author": "Huey N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "Giving 3-stars because I've tried other items on the menu I enjoyed.  But the breakfast bowl I had this morning is an embarrassment.  The eggs looked like they've been cooked in burnt butter or something.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "An impromptu trip past Bacon Bacon made for an excellent post-run in Golden Gate park. Out of the two items we ordered (Bacon breakfast sandwich and breakfast bowl) the sandwich was the winner. Perfectly fried egg where the yolk soaks into the bacon and roll. The avocado on the pulled pork bowl was a little disappointing but good mix of protein. While I didn't order coffee, I did see a few people only walk in for their java (drop and latte/cappuccino)", "author": "Kaitlin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "With a name like 'Bacon Bacon' how can you go wrong? I tried the burrito and the breakfast sandwich and I was pretty amazed by both of those choices. The girlfriend and I went to two of their 'brick and mortar' locations and the food was exceptional at both places. This will most definitely be our spot for delicious and savory breakfast when we go back to visit San Francisco. In addition, I purchased a 24 ounce coffee and added a little bit of half-and-half. The coffee was worth it as well. Lastly, their pricing are very reasonable! If you are staying anywhere near Haight-Ashbury or you can get to the downtown location, it is well worth it.", "author": "Jay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "Small restaurant off of Haight x Ashbury serving up my favorite food: bacon. I had the burger and it was pretty good, I also got the bouquet and was slightly disappointed that they weren't rolled up pieces of bacon to look like roses (but at least they were perfectly crispy and delicious).\n\nSeating is kind of hard, and the bathrooms are awkwardly upstairs and accessible through the kitchen, but this place is good if you live nearby or have an extraordinary craving for bacon.", "author": "Patricia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "The food is great but you'll never get it.  They're drowning in Caviar and Postmates orders and don't prioritize orders actually in the store.  After waiting 30m for a breakfast burrito I had to get a refund and leave.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Discovered this place through an episode of chopped where the owner was competing and knew right away I needed to try it! Was not disappointed at all! My friend and I tried the grilled chicken sandwich, the cuban sandwich, and the Mexican hot chocolate - all were delicious!", "author": "Corinne K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-16", "description": "Tried this place again for hot food. Disappointment again!!!!!!!!!\nFirst of all- the cashier shook his tip jar pretty rudely to the woman in front of us. I found that extremely rude. She was so embarrassed that he did this in front of a very long line, that she walked back and gave him something.\n\nWhy else I'm mad?We ordered their parm/ herb fries. When we opened the box they were plain!!!! Nothing on them. Ughhhh. Barely any salt and definitely no cheese or herbs. \n\nMy boyfriend loved their bacon burger. Im still pissed about the fries.", "author": "Erica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Awesome breakfast burritos. Good size, not too big but full of flavor! The pulled pork in there was really good. I would have liked more avocado but it didn't bother me much.", "author": "A C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-14", "description": "Bacon bacon!! Love the name and they make a solid breakfast burrito (breakfast served all day) but sadly this place is just a-ok for me.\n\nI got the Almost Veggie Sandwich but it was pretty oily and I felt it lacked flavor but the broccoli (an odd choice for a sandwich) made it all taste weird when I added the hot sauce. I ended up just picking out the broccoli first and then it tasted better. The egg was super runny which I love and I probably looked like a savage eating that sandwich but hey, I was hungry!\n\nNext time will be back to try something else on their menu with some of their fries (porky fries anyone?!)!", "author": "Jingxi Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "They never called my name and apparently someone took my food. Won't be coming back. #hangry", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "I LOVE the food here!!!  I wish there were more around town.  The Bacon Fried Chicken is the best fried chicken sandwich I've ever ever had.  The Melt is the best grilled cheese with bacon I ever had.  The bacon popcorn is beyond delicious and addicting!!!  And the staff is beyond friendly, it makes it like eating at home.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "That is an EXCELLENT breakfast burrito. So simple, just some scrambled egg, BACON bien sur, pulled pork shoulder, avocado, cheddar. Perfect proportions so it's not like all egg filler or anything, and delicious every single bite. Throw on some hot sauce at the table.. DIVINE. Also a really good size -- had half in the AM and half at night. Tried their breakfast sandwich too, which was also awesome. This is dangerous, guys. May be a good Zazie substitute for fast brekkies.\n\n$7, takes credit card. Opens at 7 am for the pre-work (or for me, post-night shift) crowd.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "I had delicious iced coffee (crushed ice) and the most amazing breakfast burrito! The burrito of course featured great bacon, but also had amazing egg, cheesey cheese, fresh avocado, which\nmade for the perfect Sunday Funday starter!!\n\nWould love to try the Bahn Mi and other treats.", "author": "Will O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Have only been to the cafe location, not the truck, but have had great experiences. They do an effective job of setting expectations in the name - you should know what you're getting into here. They creatively, or sometimes obviously, incorporate delicious, delicious bacon into everything on the menu. \n\nI first ordered the breakfast sandwich and the first couple bites (non bacon bites mind you, since the egg was spilling outside of the bun) felt like a standard breakfast sandwich. Then I hit the bacon, and it vaulted this hand held to probably top 5 breakfast bites in the city. \n\n I've had the burger as well, and while also quite tasty, I might recommend venturing into more interesting territory when ordering. The cafe and service itself was excellent, and there's a giant pig you can take a pic in front of if that's you're thing.", "author": "Andres B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Amazing find on our way out of SF! The entire family loved it. Highly recommend the breakfast burrito that is very different that would you would expect. The wife had the bacon grilled cheese. Coffee was so good that we had to get some more for the road back home. We will def be making this a regular visit on our next SF road trip.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-20", "description": "The truck came to SFSU and wasn't prepared to serve. A group of 5 people had waited for about 15-20 minutes for the truck to start taking orders. When one of the girls asked how long it'd be before they're ready, they said some amount of time and the group started walking away. The moment they stepped away, the truck started taking orders. They were pissed (I would've been too. That was messed up!) but I was glad I didn't have to wait for them to order either. \n\nI had the bacon fried chicken sandwich and the porky fries. The sandwich was ok but the fries were disappointing. The fries tasted like they were frozen at some point. They weren't crispy, nor were they soggy. They were in that weird in between when fries aren't fresh and so they had the texture of cardboard. Not worth it. Would I go back? Only if I had no other options.", "author": "Susana T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-03", "description": "I wanted to love this place, I mean the name alone makes me happy. The bacon chicken sandwich got great reviews so I ordered it and was sadly disappointed. It was over fried to the point where it was near impossible to bite into and of course this also means it was incredibly dry. It was even a little burnt on the edges. \n\nNow, I will probably try this place again as anything can get messed up once. \n\nBut my current three star review is because when something does go awry where the quality of the food is visually a mess I expect businesses to not serve it.  \n\nSo, overall I am bummed.", "author": "Karina B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-05", "description": "almost $20.00 for two just OK breakfast sandwiches? With mediocre bacon on them? Now in fairness, this bacon might be someone else's favorite bacon, but not mine. I like thin and crispy bacon. Bacon Bacon bacon is thick and soft. Coffee is all right. Very friendly and informative guy at the cash register who took our order. But the food did not justify that price, won't be heading back here anytime soon.", "author": "James P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Great little eating place. Went for a business meet up, just 2 of us. And it had perfect room to sit. Didn't get to crazy busy! Lots of food choices! Had the almost veggie and added avocado, YUM! Also had the chai iced tea, soy milk, also yum! \nI am looking forward to bringing my boyfriend, he works for Yelp and he LOVES bacon haha", "author": "Mary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "My boyfriend and I have been to their truck over a year ago and really enjoyed their grilled cheese sandwich. It's simple but delicious... I mean melted cheese, perfectly cooked thick cut bacon, bacon jam (can I buy a jar please?!) and nice toasty bread? I'm not sure how that can not be amazing!\n\nSo more recently I've been craving a fried chicken sandwich and felt it was the perfect opportunity to visit their actual cafe... If you walk from 16th and mission bart you will definitely feel like this was a very well deserved meal! Lots of uphill walking..\n\nAnyways..\n\nI got their fried chicken sandwich. To my disappointment it was a little dry.. Not bad though! It was still flavorful thanks to all the smokiness from the bacon. Although it wasn't burnt my chicken did come out black..which seems darker than other people's I've seen walking around with at off the grid and in pictures. That could be the reason for the dryness (but why would you serve it to me if that were the case?).\n\nMy boyfriend got their burger plus egg. This threw me by surprise. It was actually realllly good. It was juicy and flavorful..while he liked it he personally preferred my fried chicken sandwich to his burger.\n\nI also got their bacon cookie to go which was good but nothing really special. Needed more bacon and chocolate chips.\n\nThe service is awesome and the cafe itself is hard not to love just by walking in... I mean you can ride a mechanical pig and there's bacon everywhere! \n\nFun and yummy spot to eat at..definitely want to come back for some more bacon goodness (can I get a bacon caramel latte though?!)!", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "when you're called BACON, BACON, BACON what is NOT to love?!?!?\n\nThis place has all the delicious bacon menu items you dream of, just make sure you come early. My favorite menu item is the bacon bouquet, get one for your loved on TODAY!!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Bacon. Enough said. If you like bacon, you would like this place. \n\nExtremely friendly, courteous, accomadating staff.\n\nAmazing!", "author": "Joe Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Just OK. I wouldn't go out of my way to come back. \n\nFood: pretty good. I got the burger. They asked how I wanted it done and I said medium, it came out well done. It wasn't the worst but it too dry for me to really love it. D got the Cuban which he really enjoyed. We shared the porky fries which were good but missing salt. If you've been to Lardo in PDX, they're similar but not as tasty. \n\nService: eh. The guy that took our order was great. He was friendly, efficient and pleasant. There was also a girl working the counter and her attitude made me so uncomfortable that I tried to avoid all interaction. When I asked for a side of mayo for my overdone burger, she looked at me like 'how dare you ask me for anything?!'. Yeah- NOPE.", "author": "Autumn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-24", "description": "I should start this off by saying my boyfriend and his friends are all bacon fanatics. So with that in mind, we drove here one day for lunch because my boyfriend could not stop talking about this place! Parking was actually pretty easy to find. We just drove around the streets and found parking in the residential area nearby. \n\nComing in here, I wasn't sure what to expect. I thought the place would actually be bigger and with chairs and tables and stuff, but no. There's just the window sitting which worked out for us just fine. The staff was definitely friendly and welcoming! They even replaced one strip of bacon that my boyfriend had dropped on the counter. :) \n\nI ordered their grilled cheese for $8 and let me just say, the first bite was HEAVENLY. Their bacon jam was somewhat sweet and it worked well with the cheesy goodness and salty bacon. It was like a party in my mouth as I took each bite. \n\nMy boyfriend had ordered their bouquet of original bacon and he enjoyed that, but he had to order The Burger afterward to fill his hunger. No complaints, though. He was satisfied! \n\nAnd while I have not tried the coffee... 2 of my friends got it and said it was the best coffee ever. Definitely have to come back and try it! Along with their Mexican hot chocolate which includes little bacon bits!\n\nOverall, this place deserves all the stars I give. There's no beating them!", "author": "Venus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Impressed! From the moment you walk in to order, the service is fantastic and the wait is actually surprisingly not long considering it's a Sunday. I ordered the famous breakfast sandwich and breakfast burrito which blew my mind! My husband loved the sandwich much more than when we had Eggslut in Las Vegas. We will most definitely be back very soon!", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Absolutely delicious! The breakfast burrito is amazing. Get it for sure. They have the perfect blend of cheese, bacon, veggies, and sauce. My mouth is watering...must go back.", "author": "Mio W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "There's few things in life as perfect as the Bacon Bacon Breakfast Burrito. The pulled pork is tender and juicy without being over seasoned. The avocado is creamy, the bacon crisp and meaty. Momma Lil's peppers pop with flavor (ask for a double shot, they're incredible). With egg and cheese all wrapped up in a tortilla. Just the right size too, big without being obnoxioous.  I like to add a little hot sauce, salt and pepper on the side to dip it in. Add a coffee (I do) and there you go, a great morning for $11 and change. Jim has a great operation and his staff are very friendly and welcoming every time I pop in.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Excellent place for a quick breakfast while I was on vacation. The breakfast sandwich was just the fuel I needed for a long day of sightseeing. I wish I could have tried everything on the menu, and my only disappointment is that I didn't get to stop by here for their lunch menu!", "author": "Monica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Food is 4 stars but service for large orders gets 3.5 stars. \n\nFood is great and your belly will leave happy, but if you order from this place for larger lunch time orders (or in my case, for group lunch work meetings with 5+ people), there is a slight chance you'll experience a delay. When I ordered for a specific pick up time, I've experienced one 10-minute delay and another time, a 45-minute delay (granted we placed a fat huge order for 10 hungry people; I placed the order with a 90-minutes in advance).  \n\nBest advice I can offer is to place the order many hours in advance. They get super backed up during the lunch hour so if you let them know far in advance, you'll have a better chance of getting your order on time. \n\nParking around here straight up sucks by the way.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-13", "description": "The reason  I'm rating it 1 star is because I found a bug on my sandwich. It wasn't just a dead bug but an alive bug crawling from my bun to the avocado... IT'S ALIVE.... I'm glad that I always check my food because the only thing worse than finding a dead bug in your food is half a dead bug after you've taken a bite.....", "author": "Ke'Leiha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "It was around lunch time and we were driving around San Francisco trying to figure out where to eat. A list of restaurants came up on our map, Bacon Bacon being one of them. Of course, the name immediately got our attention, so we had to come check it out. It did not disappoint. My son and I ordered the Breakfast Sandwich. My daughter ordered the Bacon, Swiss Croissant. My husband ordered the LGBT.  Three out of the four devoured our sandwiches. They were definitely outstanding. My son, who's a picky eater, was sad that his sandwich came with a fried egg instead of scrambled (my bad, I know he doesn't like fried egg, but wasn't thinking when I ordered). The super sweet and awesome guy working the counter noticed my son was unhappy and offered to make him another one with scrambled instead of fried. How awesome was that??!!!  My son had such a huge smile on his face!  Outstanding customer service!  I would definitely recommend this place to anyone who likes breakfast foods and burgers.", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "modern and minimalistic...red pig statue...a menu board over the order counter...airy cafe vibe...coffee and breakfast sandwich...coffee and breakfast burrito for other...burrito or sandwich are both $7 each...burrito is bigger, heavier, meatier and more filling deliciousness...bacon, pork, cheese, eggs and loaded with flavors...rolled tight and dense...the breakfast sandwich has perfect quality...fluffy brioche bun....perfect fried egg and of course thick cut bacon...cheese melting and holding together....just a great quality sandwich...good coffee to wash it down...excellent...don't expect a quick meal...nearly empty and it took some time to get our orders...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "They have a sign saying \"Bacon Makes Everything Better,\" & this place indeed made that happen! Came here for Sunday brunch & was really impressed w/ the food\n\nPorky Fries - these were just absolutely delicious! The fries were cooked & seasoned perfectly. The pork, yellow peppers & shredded cheese on top completed the fries altogether. Highly recommend! It is a big portion, but I was able to finish it b/c I have a huge appetite. I suggest sharing this between 2 people b/c it'll fill you up\n\nBBQ Pulled Pork Sandwich - absolutely amazing! Taking my first bite into this, I literally rolled my eyes & was in awe. The bread was soft; the pork was so tender & flavorful; the bacon was cooked jst right, not too crispy & not too soft; the bbq sauce wasn't too overwhelming but added some good extra flavor; and the slaw had a nice little crunch. Highly recommend trying as well! \n\nOverall, I thought the food was really great. Definitely check this place out! I will come back to try their other bacon goodies that they have on the menu", "author": "Trina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "This is absolutely my favorite place for breakfast/lunch in the Haight and maybe the city. I generally crave Cuban sandwiches and Bacon Bacon knocks theirs out of the park. The breakfast sandwich and breakfast burrito are the best thing I've ever used to satisfy a dehydrated morning :) the coffees are excellent as well. The staff is very friendly and helpful and it is thankfully off the Haight Street path. Love. This. Place.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Order the bacon fried chicken. \n\nAnd I'll quote myself here:\n\n\"The best use of my cheat meal calories in a long time.\"", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "What a sandwich! The BBQ pork on a brioche bun was outstanding. Enjoyed the tangy bbq sauce.\n\nThe Cuban on a ciabatta roll was good but a little on the salty side. I enjoyed the spicy heat, though.\n\nGonna try the bacon fried chicken sandwich next time. Don't think I can try the fries.  The sandwiches are generous in size. No dinner for me, tonight!\n\nVery friendly staff.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "On our visit to SF, I managed to go twice to Bacon Bacon in our four days there.  That is how good it is.  The Breakfast Burrito is killer - I ate a half at a time, so for like $8 a burrito was two meals! Score for me.\n\nVery helpful staff, great coffee, and just an amazing taste.  Perfect mix of salty and savory and creamy and crunchy and wonderful.", "author": "Emily P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Yum!   Delicious breakfast sandwiches!  Must try when in SF.  Short menu but what they do have is amazing!", "author": "Deb W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Quaint little place in a neighborhood. So different. LOVED LOVED LOVED our food. Got the chicken fried bacon sandwich with regular fries. 100% A++++. Will definitely try the porky fries next time.", "author": "Sherri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "The food is wonderful! Love the Bacon Bowl with the pulled pork. I think a little bbq sauce would put it over the top. We eat here whenever we're in town. You can't go wrong getting a meal from here.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "A chapter in my life has now closed...The search for the perfect breakfast burrito is over. \n\nEvery bite of this burrito will reveal and new flavor. The texture is nothing but smooth and creamy with perfectly crisped tortilla and the Valentina sauce is a fantastic smoky edition to the symphony of flavors.\n\nThank you Bacon Bacon, you complete me.", "author": "erika s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "This place is very good. You have to be to call yourself Bacon Bacon. I had the fried chicken sandwich and fried mac and cheese. Little bit on the pricey side but it is very good so I guess you get what you pay for.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "The only thing better than the food is the customer service. \nThey've got their website dialed and make it super easy to order an individual meal all the way to catering parties. \nI placed an order for catering and Jim was in touch with me in just a a couple of hours and gave me his cell phone, which came in handy as I had a special request to make the night before my breakfast platters were to be baconed up and then scarfed down by my morning party guests. \nI'll be ordering again and so should you!", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Just got a speedy delivery from Bacon Bacon's cafe location via Caviar. YUM 28 minutes to breakfast bacony overload! Diet disclaimer: I try to eat low-carb normally but today I caved to the un-Caveman way. Time will tell if I am a fat bride next June or not...\n\nThe graded items du jour: \n\nA\nBreakfast Burrito - $8.50 delivered / $7 in-house - A dense log of breakfast fatty delicious pork, bacon (you know it), scrambled eggs, cheddar cheese, guacamole, hot sauce and everything nice. Nicely toasted tortilla. Very satisfying, even if Richard Simmons watched you eat this, he'd cry. PETA too.\n\nA-\nBreakfast Sandwich - $8.50 delivered / $7 in-house - A close second to the burrito but if you want maximum overload and your full money's worth, grab a burrito. WARNING: the egg over easy yolk hiding under the bun WILL explode in warm yellow orange fireworks all over you and your surroundings when you bite into it. Eat with a plate underneath if you don't want an egg clean-up. I have egg globules in my hair right now and I am only sort of sorry about that.\n\nB+\nMuffin - $2.50 delivered / maybe $2 in-house - Luck of the draw revealed blueberry. A normal-sized muffin like your mom used to make, no 500+ calorie monster. Nice crumb, freshly baked, but could use more blueberries, imho.\n\nOverall, I feel 5 pounds heavier now but content.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-02", "description": "Bacon bacon bacon.  Who doesn't love bacon?\n\nAnd who doesn't love bacon combined with boneless fried chicken breast and tangy slaw?  Cooked upon ordering.  It comes piping hot and very crusty and crispy.  Served on an brioche egg bun.  Chomp down with your first bite and watch the steam.   It's that hot.\n\nGood fries too.  Sprinkled with shaved Parmesan and herbs. \n\nI also ordered a strip of dark chocolate covered bacon.   Thick bacon slice but not crispy as it's totally coated in chocolate.  You've got to be a real bacon lover at $3.00 a strip.\n\nIt's a small storefront.  Five seats at the counter facing the street, and four bar stool high tables that seat three comfortably.  \n\nAnd an amusement bright red mechanical hog.   I think it works.  But we didn't try it.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Bacon Bacon's burrito is pretty solid all around :) the sandwich is great too as is the coffee. Kill 2 birds with one stone: go check out the Grateful Dead house and then walk around the corner to get some delicious baaaaaacon!!!", "author": "Phil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "I am 90% sure that their breakfast burrito is the best one I've ever had. Holy F. \n \nI was just in town visiting and needed a spot for lunch... I yelped \"burrito\" and Bacon Bacon came up. And I am so pleased that it did. It's about two blocks from bustling haight street, so there aren't huge crowds or lines that you have to fight through to get here. Once you walk inside you are greeted by super friendly staff members who will efficiently take your order and leave you smiling. The food quickly comes out and then you may feast on your delicious meal. You will not regret making the decision to enter Bacon Bacon.", "author": "Jamie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "If you enjoy bacon, this is the TO-GO PLACE to satisfy your bacon fetish. This cafe (more of a takeout) is tucked in the residential area and it was quite hidden! I was there in the morning, therefore the menu was quite limited. I had the pork belly bahn mi sandwich which was a good and well-executed. OMG, the bacon bouquet.... quality and seasoned thick bacon presented like a bouquet! I highly recommend sharing this with your dear friends or you may have a heart attack if you are to finish it alone.", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "I love having this place in my neighborhood. \n\nI mostly stop in for coffee or a latte, but have enjoyed a variety of their breakfast noms too. The scones are probably my favorite - they bake them fresh and they have a great texture. The breakfast burrito is also tasty if you like a LOT of meat. \n\nAs good as the food and coffee bevs are, however, the people are probably the best thing about Bacon Bacon. The people who work there are great and other customers always seem to be enjoying themselves.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Breakfast burrito is legit. Great portion of pulled pork, the peppers added a great touch. Top but it off with some hot sauce and we're in business.", "author": "Joey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "YUM. I love bacon, and I love Bacon Bacon. We got food delivered from here to Finnegan's Wake while watching football hungover on a Sunday morning and it was basically like a miracle worker. I had the bacon cheeseburger and my fiance had a breakfast burrito. Both were so good, writing this review now makes me wish I could order it to my apartment on a Wednesday at 11pm.", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Im lucky enough to have this spot right down the street, it is AMAZING. Favorite items are the breakfast sandwich and croissant with bacon jam. OJ is fresh squeezed and coffee is always tasty and strong. Not to mention the staff is always awesome. Do yourself a favor and get some bacon in your life asap!", "author": "Kelsey T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-30", "description": "I give you a Haiku about the LGBT sandwich:\n\nWas that Safeway bread? \nThere was not enough bacon. \nI had such high hopes.", "author": "Russ S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Great coffee drinks \nDelicious breakfast - burrito, sandwich, taco - all delicious! \nThey're relatively fast even if there is a long line. \nEven though there are few tables, people usually rotate pretty quickly. \n\nMy one qualm is its a little bit expensive, but gotta say I prefer the establishment over the food truck.", "author": "Allie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "*This is for the ashbury heights location, not the truck \n\nBEST BREAKFAST BURRITO THAT I HAVE EVER HAD. Straight up. It is absolutely unreal. The breakfast sandwich is also really good but the burrito is just next level. \n\nVanilla bean latte- unreal, esp cause I can opt for almond milk \nFresh squeezed orange juice- actually unreal\nThey have Sriracha- unreal, because Sriracha is life \noverall, Bacon Bacon- unreal \n\nMy only warning & complaint is that the food takes forever.. so call in your order ahead of time so you aren't waiting 20+ minutes for your dank burrito. ESP when you are starving and your hangover demands greasy yummy bacon enriched deliciousness in an immediate fashion.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "If you want an awesome meal any time of day, go to Bacon Bacon. My wife and I went here twice while we were in San Francisco and everything we tried was delicious! The breakfast burrito was fairly small, but it was so full of flavor that I looked past the size.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "Love coming here every time they send me to work out in the area! I always get the Bacon fried Chicken sandwich! It's a must try!", "author": "Antonio C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "This place is hands-down amazing. There aren't many items on the menu but I think there's something for everyone! The coffee is really good, too.\nI had the \"almost veggie sandwich\" (broccoli rabe, roasted bell peppers, provolone, fried eggs and bacon), it was delicious and very healthy! My roommate had a small breakfast taco and a maple bacon scone with bacon jam. You'd think that is enough bacon but we also got a bacon bouquet. You can never have enough bacon, and if you, too, believe that then you should go to this bacon-lovers paradise.", "author": "Dodi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "As not much of a meat eater, I can confidently say this is a great place to go on a weekend for a great sandwich. I got the grilled cheese which was awesome and filling for the entire day. The staff was very nice and the place was clean. Not a lot of seating but you can always go take it to a park nearby. \n\nLooking forward to the next visit!", "author": "Meaghan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "Went back to bacon bacon. Moved away from SF and was excited to be back and get breakfast here.  Unfortunately the recipe has changed. It is now a totally average burrito.  I'm not unhappy with it, and if I lived down the street I'd visit, but I won't make it a point of visiting when I'm back in SF.  It used to be majority bacon and carnitas with egg as an addition.  Now it has two strips of bacon and more eggs.  This is fine...but just fine.", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Sweet baby Jesus, thank you for giving us pigs. \n\nI came to Bacon Bacon on a Sunday afternoon, having been jonesing for a good burger all week. After a quick search of the web and Yelp - Bacon Bacon seemed to be the best option in the area. Boy, I was not disappointed! \nThe menu offered many options for breakfast that looked and smelled delicious on my fellow diners plates, but I had burger on the mind. The breakfast burrito with Chicharrónes I saw 1 table over will definitely be my pick next time though. \nThe walkup ordering was super easy and the staff was more than helpful with questions about menu items. If you're looking for a soft drink, your options are limited, but let's be honest you're not coming to a place named Bacon Bacon for the sodie pop. If you're cool with aqua like me, there is a water cooler with cups in the back, so no need to buy a bottle. There are also a variety of teas and coffee beverages if you so choose.\nI ordered the Bacon Bacon Double Cheeseburger with fries and it came to about $16. In a quick 8-10 minutes, it was ready. Seating is fairly limited so it was a perfect timeframe to wait for a table. Get a pic riding the pig while you wait!\nThe burger is prepared to complete perfection - two .5\" patties ensconced in a sharp melty yellow cheddar and sauce sitting atop thick cut meaty greasy delicious bacon and sautéed onions all on a soft fluffy brioche roll (the perfect vehicle for all of that deliciousness). The bacon made me believe in bacon again. I didn't consider myself a fan of bacon before coming here, but I have since realized, I just wasn't a fan of the crappy thin, chewy, garbage that surely the pig making it would be ashamed of. Bacon Bacon's bacon is what bacon should be - thick and juicy. This was the best fast casual burger I've ever had - it blows Super Duper, Shake Shack, and Five Guys out of the water.\nThe fries, in my opinion, were fantastic. They were a basic, thicker cut (not steak fry), with shaved parmesan on top - no salt.\n\nI will most certainly be returning to try other menu items. You get AMAZING food, a huge portion, and friendly service. What more do you need? Maybe a stroller, because when you leave you'll have twin food babies.", "author": "Patrick K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-07", "description": "I really supported this business when they were going through the planning issues with the City - not because I like bacon (actually, I try to keep Kosher and am a recovering vegetarian) but because I support small businesses in my neighborhood. I really want this business to succeed, even though it's not ever going to be my cup of tea. \n\nMy spouse has told me he's had Bacon Bacon's turkey burger and enjoyed it in the past. So it was disappointing when my spouse came home from here today, reporting that he'd ordered both a chicken burrito and french fries with NO cheese on either item. My spouse also said when his fries were delivered, they had cheese on them, so they had to make him a second order without cheese. As my spouse unrolled his burrito at home, he found - you guessed it - cheese on it. He called up, told them what had happened, and asked for another burrito without cheese, which he received.\n\nYou'd hope that when the server was told about the cheese on the fries, and was correcting that mistake, they would've stopped and thought for a moment about how to be sure the rest of my spouse's meal was up to par. But that didn't happen. \n\nEvery business has its bad days, and maybe today was theirs. When there's so many good food offerings in our neighborhood, it is hard for me to imagine my spouse ordering from Bacon Bacon again any time soon.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-10", "description": "best easy breakfast spot in the neighborhood... Probably the only one actually. \n\nI just think its weird that they dont have crispy bacon. Isnt that the best part about bacon?\n\n7 dollars for a corner store style BEC that is not as good as the corner store BEC thats \n$3.75 where I normally go. \n\nService is okay. Efficient but not friendly", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "THIS PLACE! UGH This place! (I mean this in the most loving voice ever)\n\nI lived just a block away from Bacon Bacon so I was here every day for my morning coffee and when I was feeling fancy, a maple bacon scone. I became friends with all of the staff as they are all very wonderful.\n\nList of my favorite items Bacon Bacon has to offer in no particular order:\nDrip Coffee\nVietnamese Iced Coffee\nMaple Bacon Scone\nParfait\nBreakfast Sandwich\nFrench Fries, both regular and Porky\nBreakfast Burrito\nBurger\nBahn Mi\nThe Cuban - No longer on the menu\nGrilled Cheese\n\nI do regret not being able to say goodbye as I suddenly moved to Orange County. I miss the people and I miss the food here. Next time I visit SF, I will definitely come by and say hi. I hope you guys don't miss us too much!", "author": "Bethany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "This place is unique and lives up to its name. We got a bacon bacon breakfast burrito and let me just tell you.... it was divine! It had pulled pork,peppers, and lots of bacon! Also grab a stick of chocolate bacon which is absolutely delicious. When I travel to San Fran again Bacon Bacon is the place I will go!", "author": "Tyler R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "Great bacon-egg and cheese. It was really cooked to perfection, and the rolls were awesome. I had to go back before i left SF.", "author": "Brendan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-26", "description": "Took my nephew for lunch, and it was great, my pie overcooked, but tasted amazing. My server suggested a swap, but the taste was perfect.", "author": "Alani R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Battle over the bacon?  Can't believe that one of my favorite SF eateries has temporary closed due to neighbors complaining of the smell of the discarded bacon grease.\n\nWant to know an ancient Asian secret? I use my discarded bacon grease to make fried rice and it taste great!", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "If you love bacon, come here!! The breakfast sandwich was pretty tasty. In the fridge they had slices of chocolate covered bacon, I brought one home as a gift for my mom....holy sh*t it was so good. I was so upset I didn't bring home a bunch. But prob for the best. Was soooo good tho. Deff give it a try!", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Awesome spot. We each had the Breakfast Sandwich. The brioche bun, eggs, and bacon were perfect. Seriously it was amazing!!!  Wish we had a spot like this back in Denver.", "author": "J W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "Nothing special. I was expecting a lot more out of this place. The food isn't bad, and the bacon is really good. (I think it'd be even better if it was crispy though). The place is super small, so there's a pretty good chance you won't be able to dine in if it's around lunch time.", "author": "Elena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "I've been to the Bacon Bacon food trucks a few times and it has been consistently yummy! You can expect, of course, lots of bacon, and filling comfort foods. The sizes are a bit small for the price but the portions are definitely filling. \n\nI enjoyed the California Bacon BBQ Burrito, which was packed with pulled BBQ pork, bacon, french fries, and crispy belly. Though there is a LOT (and I do mean a lot) of meat, it doesn't taste too greasy, and at $9.50 (without tax), you are getting a lot of meat (although the burrito is considerably smaller than other ones of the same cost in the Mission district). The bacon grilled cheese sandwich is also very good: the Texas toast are treated immaculately with bacon jam (definitely beats the fruity stuff any day!) and the melted cheddar cheese with the bacon is perfect for a simple but delicious treat. I'm not sure that I would pay $8.50 for it though, but I was craving grilled cheese and tomato soup today, so this definitely hit the spot!", "author": "Vickie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "We came, we ate and we BaConquered! Yup, not a word but I made it up... If you love bacon, do yourself a favor and stop into this awesome spot. We had the grilled cheese, the bacon fried chicken sandwich and porky fries... Delicious! We left in a BaComa, another new word. I love bacon bacon!", "author": "Kristy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "GO early on a Sunday to beat the crowd. If you have to wait in line, don't worry - it's worth it.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "Updated Review!\n\nBacon Bacon has won me over again. In the past two months I've had only good experiences. Ingredients and dishes haven't been out of stock, service has been friendly and quick - and most importantly of all - their grill is working and they're on their full menu again! If you're looking for heart-stopping and delicious greasy breakfast I haven't found any better than their full menu, and I still drop in for drip coffee at least twice a week. Bacon Bacon is back, and my heart is rekindled!\n\n\n\nOld Review **\n\nTLDNR: Tasty, pricey, cafeteria, friendly, slow, broken stove they won't fix, inferior menu as a result, terrible americano, often out of ingredients \n\nI want to love the Bacon Bacon cafe, I really do. I'm loving on momentum long after the fire is out. Bacon Bacon, you've changed and so have I. \n\nWhen we first met, it was like it was meant to be. If just moved to the neighbourhood and you had cheap coffee. I fell for you gooey sandwiches, cheap drip coffee and friendly staff, and overlooked your faults like broken wifi, lack of hustle and second rate atmosphere. You charmed me with your $0.10 mechanical pig and cute logo colour scheme, so I dealt with the facts you overcharge for a cafeteria and you're always out of something without posting it. \n\nThey say love helps you pull through the hard times, so when your griddle broke and you had to make a whole new menu of largely inferior foodstuffs we stuck with you. We say you trying and we tried back, supporting you. \n\nI don't know when I started to realise the fire was gone. Maybe the third time I sat around long after I order had been forgotten. Maybe it was when I finally said \"never again\" to the most awful American in town (despite good drip). Maybe it was the second time I waited in line to find out when ordering that you were put of bacon... In a place called Bacon Bacon. \n\nNo, it was when I learned you never plan to fix your grill and get your menu back. I know it's expensive, but you broke my heart. I'll still visit, and I still love things about you (like the reuben), but the love affair is over. Look me up if you ever change your mind. *sniff*", "author": "Avery A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Great little food place that's like a bacon-inspired take on taquerias. We both had the breakfast wrap, which very very tasty. We also had a bacon bacon Elvis bar, a peanut-buttery bacon-studded sweet. And the coffee was quite good. \n\nOverall, a neighborhood gem, but it only has 3 tables and a small counter for dining in.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "EXCELLENT SERVICE! Recommend the double double bacon. So good! Chocolate bacon, basically hot chocolate and bacon with chocolate pieces. Prices are perfect. No complaints. Clean place. Bacon is well made. Its not like the bacon you get in the stores, its filling. Friendly service. A++", "author": "Cristian A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Got the breakfast burrito here. The burrito was mediocre. Comes with a small sliver of avocado and soggy eggs. We ended up waiting 30 minutes to get our food.", "author": "Matthew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "Awesome food!\nTried the pork belly and cuban sandwiches, both were great.\nA tiny but cute place.", "author": "Peter O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Never underestimate the force of the bacon side. \nBacon this, Bacon there, Bacon today and tmw!\nHad a bacon chocolate chip cookie, bacon fused breakfast sandwich and bacon coffee. No wait, I just had coffee. Oooof, bacon everywhere. \n\nNOM!", "author": "Pepe W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "had porky fries from their food truck. no bacon in it even though the description said differently. the sprinkled \"herbs\" (I'm guessing) looks fuzzy, not sure if that's suppose to be like that.\n\nand then I had a mild food poisoning right after finishing. \n:(", "author": "YY M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "The breakfast burrito is AMAZING. Make sure you try some of the hot sauce on it!", "author": "TJ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Had a very good breakfast burrito at Bacon Bacon last weekend.  The best part was... you guessed it... the bacon.  Before moving to San Francisco, I only knew about the basic ways to cook bacon.  Thick-cut, or not... and crispy... or not.  I've tried the Millionaire's bacon at Sweet Maple and its all well and good, but it doesn't compare (in my opinion) to the simple, yet delicious, all-american, you-don't-have-to-be-a-foodie-to-appreciate it, bacon.  The only reason I don't give Bacon Bacon five stars isn't because anything was wrong, but just that other than the bacon, everything else was 4/5 star-worthy.  Will be back.", "author": "Joe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "bacon    The breakfast burrito was so amazing!  Avocado, pork, bacon, pepper, eggs.  Great flavor!", "author": "BB S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Small place but once you try the food you won't care. The staff was super nice as well. I would go back especially for the grilled cheese!", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Unbelievably delicious breakfast burrito pork shoulder was so tender only thing I could say would be a nice side of yogurt or sour cream to dip it in would be awesome where are the ability to add some veggies.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "So many times SF has let me down.  The restaurants seem to be getting more snooty by the minute.  And the self important Tech upperclass is bringing the diversity of the city down day by day.  So i was skeptical walking into Bacon Bacon.  I didn't want to try their truck because their restaurant has more stars.  I couldn't have been more pleased with my decision.\n\nI got the breakfast burrito because it was recommended on yelp.  It was delicious.  I wasn't the only one that thought the place tasted pretty good.  I had a classmate with me and he thought the same.  I also tried the bacon hot chocolate.  It reminded me of a mexican hot chocolate.  I could feel the tiny fat globules in every sip adding that savory flavor.\n\nI would highly recommend Bacon Bacon.  Come for the laid back atmosphere and the tasty food.  I also highly recommend the breakfast burrito.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Amazing food! Came here for a Sunday brunch and was very impressed with the food quality and taste. The restaurant is pretty small but luckily my gf and I were able to find seats quickly. I ordered the porky fries and the daily special which was a cuban sandwich and boy were both great. Porky fries were covered in pork and cheese, very good amount of fries as well. The cuban sandwich was really good, great cuts of meat and the bread was freshly made and soft. Overall really happy with my experience here, would highly recommend it!", "author": "Josue V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "The food was pretty good, but not worth the long wait in cramped quarters.  It was a very cute place and the staff was very nice, but feel did not have a place to sit there which I didn't realize when we went.  I ordered the fried chicken sandwich which I enjoyed, but it wasn't particularly memorable.", "author": "Sandy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Ordered (via Postmates) The California Bacon BBQ Burrito and The Cuban - both were very good! I was skeptical about The Chocolate Covered Bacon, but it was delicious!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "Good god, this food is incredible.\n\nI live right across the street from this fine, fine institution. If I wasn't able to restrain myself I would probably be there every single day, resulting in heart disease or coronary artery issues.\n\nThe breakfast sandwiches are among the best I've had. Perfect egg, bacon, cheese, bacon jam... Mmmmmmm! But the real treat, in my opinion, is the bacon fried chicken sandwich. It is truly god inspired. It was a gift from Jesus, Moses and Allah--they all got together a couple of years ago and collaborated on their finest creation. This sandwich is LIVING PROOF that not only does god exist, but he wants us to enjoy delicious bacon (even Allah).\n\nThere you have it. Read no further, because the rest of these reviews are irrelevant now that you know this place is top-tier.", "author": "Evan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "The burger was quite small to cost 9$. The ingredients tasted good, meat was cooked perfectly, the bread was not sweet, no crazy ingredients or sauces added.\n\nChicken sandwich was alright.\n\nWith that name one would expect some amazing bacon, it was average, nothing to phone home about.\n\nBottom line: decent food, a little over priced.", "author": "Xavier R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Get the bacon grilled cheese! It's so good! Don't do it with a sweet drink because that's just too much for your stomach. My friend tried the breakfast sandwich with hot chocolate and it didn't do her stomach well. Which is why I ordered a lemonade.", "author": "Moriah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "So, yeah, I am jumping on the bacon band wagon. Er, food truck.\n\nWho HASN'T heard of Bacon Bacon? Who ISN'T sick of the bacon on everything except, well, what the hell why NOT in your coffee too craze? And lastly, who WOULD turn down bacon in any form, I mean for real - say it's just sitting there, in your kitchen or at your desk. You wouldn't nibble? You would have a bite? You would \"accidentally\" devour it all? Ok. I guess it's Lie to Us All Day. My Bad.\n\nYou would and we all would and even Vegetarians would THINK about it.\n\nTHAT'S why Bacon Bacon exists and that is ALSO why they thrive.\n\nBacon Fried Chicken Sandwich. Is it a mistake that I always erroneously type \"friend\" instead of \"fried\" 9 times out of 10? No. It's psychology at it's finest and fried IS my friend and SO is BACON!!\n\nThis seems like when you look at it you will get short of breath, when you bite into it your heart will skip a beat and when you stuff that last bit in way to quickly after receipt when you were definitely not going to eat it aaaalll, you will feel guilt but you will also feel like a badass. Because you survived it, you were a pig on it and you loved it and you know it.\n\nDo it.", "author": "Katie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "I regret ordering the Cobb Salad...should have gone for that breakfast burrito everyone raves about. My husband enjoyed his double cheese burger. The fries were perfect. My son liked the grilled cheese with Bacon. Order your to go. Restrooms are behind the counter through the double doors upstairs to the left. I'll be back to order something better. Efficient service. Clean. Worth a shot as well as a return...oh grab the lemonade.", "author": "ann s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Great place if you love bacon! Plus they make an excellent cafe latte! Not healthy though. Lol", "author": "Lance P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "We had to stop here before we headed back to Long Beach... We ordered the Bacon Bouquet, Bacon Grilled Cheese Sandwich and Chocolate Covered Bacons... I wanted to love the chocolate covered bacons but I just wish the bacon could stay on a crispy side somehow... We were happy to have tried:-) We LOVED the bacon bouquet the grilled cheese though! The bacon jam inside the sandwich was so yummy!! We will definitely be back! Oh and it's located in a quiet neighborhood away from all the noises which we loved, we took our food to go and walked up to the Vista Park to enjoy yummy food and a great view:-)", "author": "Anna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "It's hard to say no to bacon. Especially when it's yummy bacon. 3.5 stars for a yummy lunch/brunch place.\n\nWe had the bird and the hot italian- both flavorful sandwiches. We were a bit disappointed that the bacon in the bird was a bit dry and cardboard-y. They do have awesome bacon chocolate chip cookies though (with full sweet bacon goodness)", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "The good is always good, the service always nice. Their fries are delicious but I have yet to try their porky fries because I haven't come here with anyone to split them with. Very small site but a nice vibe, always have music playing in the background. The menu stays relatively the same, with a few changes & specials often. The sandwiches are packed full of meat or whatever is on the sandwich. You get your money's worth. Their chai tea lattes are delicious and you must try their Mexican hot chocolate (with chocolate covered bacon & mini marshmallows on top). It's rich but you have to try it once!", "author": "Hitomi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "Hang over food heaven! Breakfast burrito, amazing. Breakfast tacos, so good. Bacon always wins.", "author": "Lindsey A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "Stopped in for lunch on Tues afternoon. Service was good and the food was delivered to our table wthout much waiting time. I had the bacon bacon double cheeseburger and a side of chicharrones. After all the great reviews I was hoping for an amazing burger. I was rather disappointed. The patties were overcooked, and the burger was just overall dry and bland. The burger was so dry I actually had to resort to putting ketchup and mustard on it. The bacon on the burger was the only good thing the burger had to offer. The chicharrones were very good. I'm not sure if I would go back or not, maybe.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Soooo good. I had a latte and a bacon & swiss croissant. Delicious!! Good service, relaxed little cafe, and outstanding food with bacon in it. What more do I need to say?!", "author": "Ashley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Ordered the breakfast burrito to go. Oh man is this good! it's pulled pork, eggs, cheddar cheese, guacamole, a green pepper, and BACON! I'm used to disappointing breakfast burritos with more eggs and tortilla than anything else but this burrito was all pulled pork and bacon delight! and the egg was there to compliment the meat. DUDE this is the real deal ! Add in cheddar is one of my top choices of cheese and it's been a great Sunday morning already. Ordered picked up avoid the lines. Took 5 minutes. Thanks bacon bacon. A+", "author": "Christian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "I love bacon period. Highly recommend this nice lowkey spot for all BACON LOVERS! Gotta get yourself a 'Bacon Bouquet' or a 'Mexican Hot Chocolate'... So much to choose from, i'm sure anything you get will satisfy yours  GET HERE!!!", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "Good pork tacos and well done fries, what more could you ask for!", "author": "Colin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-03", "description": "No longer just a mobile food truck, you can now go to Bacon Bacon's brick & mortar location in Cole Valley for breakfast Monday through Saturday. It has the look of a temporary location since the signs and menus are hand-written. It's also where they prep items for their food truck. For breakfast they had breakfast sandwiches, parfaits, pastries, and coffee. They also sell Bacon Bacon t-shirts, caps, chocolate dipped bacon and bacon popcorn. \n\nThere isn't any seating but they have counters where you can stand and eat. The framed vintage bacon advertisements are a cute bacony touch. \n\n* Scone ($3) http://www.yelp.com/biz_photos/AMhmArFJ0IAeknI1mDE6ew?userid=NOUfyJW-BAo_-Cbfo8edww#AIvMuPCHkRe7M-6FMK7b9Q: A warm, triangular large scone, sweet and tender with tiny bits of bacon inside, it was sweeter than I expected. I liked the crusty saltiness of the cheddar cheese they added on top. The scone was excellent on its own. The thick bacon jam they put on top was cloyingly sweet (sweetened with honey) with lots of tiny hard pieces of bacon and caramelized onions. I think I'd prefer bacon butter or some other saltier bacon condiment. \n* Coffee ($2): Honduran, good and strong, just right for bacon treats", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "My friends and I needed some morning fixings after waking up in the afternoon during our stay in San Fran, and we decided to walk over to Bacon Bacon for some bacon (duh). This place makes a mean breakfast sandwich, and breakfast burrito. The meal ended up putting us in a food coma. It's just a vicious cycle you just can't get away from.", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "the food is absolutely amazing. been slowing trying everything on the menu and so far it all rocks. the place is small and cute and cute guys work there.", "author": "Salah Kal-El B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-17", "description": "I love bacon which is what drew me here but their breakfast menu just didn't cut it for me the first time around. I had the breakfast bowl and the almost-vegetarian sandwich and both just lacked the overpowering bacon taste I desired. Maybe it was just my first experience and maybe lunch is better but combined with their prices for the small portions I will probably try out other spots before returning.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-14", "description": "Bacon Bacon or Barkin' Barkin'?  Management Does Not Care.\n\nAnother day with more Bacon Bacon patrons tying their dogs to the tree in front of the cafe -- followed by endless barking, crying, yipping, whining and growling of the dogs whose owners ignore them.  \n\nIt is clear it is disturbing the peace of the neighborhood -- even clearer that the in-store patrons are no happier.  Yet Bacon Bacon won't respond to calls and pleas to management to address this persistent nuisance (and by persistent, I mean repeatedly every day).\n\nResponses by Bacon Bacon managers/employees include the following: \"It's not our problem -- we don't own the tree and the dogs aren't ours,\"  \"You have to talk to the owner [do they mean of the store or the dog?],\" \"Too busy to address this [click],\" \"I can't do anything about it.\" \n\nMany small business are respectful to their neighbors and post signs about respecting the neighborhood.  Not Bacon Bacon.\n\nAs for the dog owners: leaving your pet outside barking and crying over a period of time is not quality time with your animal -- and clearly your animal is not happy.  Put your order in, wait outside with your dog then go to a park where you both will be happy.  Please don't be the d'bag who puts other people in a position to have to confirm for you what you already know: your dog is annoying.\n\nSince direct pleas to address the Park and Bark issues are not addressed, let's see if social media captures Bacon Bacon's attention.   Bacon Bacon, please tell your patrons who leave their dogs outside your store making noises that this causes a disturbance and is disrespectful to those who live in the neighborhood and cannot escape it.  Thank you.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Stopped by for breakfast and it was a really good find.  As the name would suggest bacon is on everything but they do it well.\n\nI opted for a light breakfast of a cheese and bacon scone and split a bouquet of bacon(6strips of bacon) with everyone else.  It didn't disappoint, the bacon was the high point and they are doing it well there.\n\nMy dad had the breakfast sandwich which was huge and covered with cheese, egg and of course more bacon.\n\nI would definitely go back if in the area.", "author": "Kev R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I'm from NY and their \"New Yorker bacon egg and cheese\" is hands down the best I've ever had.  It's safe to say I've had 1-7 B.E.C.'s per week for 29 years of my life.", "author": "Hailey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Yes, everything is bacon themed.\n\n- Pork belly: on the same bun as the burger. The pork belly is well seasoned and rich, and it comes with arugula and an egg. You can't really go wrong with this combination.  The bun holds the meat well and I like that they just don't use a brioche because a more buttery bread would make it too heavy \n- Fries: with herbs and Parmesan... Yes, we added an egg to this, too...\n- Burger: with bacon, sautéed onions, cheddar, and we added an egg (of course...). The patty itself was moist and well seasoned. I could have done without the house sauce since I don't like aiolis\n\nCondiment wise, they do have ketchup, and I really liked the house mustard.\n\nEven though everything has bacon or pork of some form, they don't overdo it, so it's all pretty well balanced.  My one tip: what's better than bacon on everything?  Bacon AND a fried egg with a runny yolk on everything.", "author": "Marilyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Oh goodness. I thought I couldn't possibly love bacon more than I already did. I was wrong. The burger (a double cheeseburger with  needless to say, bacon) was perfect, and the porky fries (fries, peppers, bacon, pork shoulder) were astonishingly good and filling. Only slight negative remark, no fountain drinks or refills. But really, this is a delicious place to have lunch or brunch.", "author": "Stefano Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "The food and service was good but I'm a big bacon fan so I expected great bacon and didn't get that. Honestly was disappointed because I couldn't taste the bacon in the cali BBQ bacon burrito I got. I got also got the fried mac and cheese bacon balls and barley taste bacon but they were pretty dam good. The chocolate covered bacon was also good but not that great.", "author": "Angel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "This is place is the bomb. The bacon bomb. They know their bacon and they do it right every time. I generally get the breakfast sandwich, but the scone is a winner too.\n\nMy most fun experience was actually with the Bacon Bacon food truck. They hosted a 3 course dinner for two special in their truck. My girlfriend and I went and it was awesome! We got to sit in the front of the truck and were brought course after course of delicious bacon treats for the next 1.5 hours. Yes, my arteries are now clogged.", "author": "Milan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-05", "description": "I honestly can't tell wether these guys don't understand \"vegetarian\" or if they're just trying to piss people off to stay cool.  \nTL;DR: Don't ask for substitutions, they're not really okay with it and won't actually do it - but they're not willing to tell you that to your face either. \n\nWhen I walked in with a bacon loving boyfriend, I was hopeful that I too could have a warm kitchen item like his breakfast sandwich, and asked if the almost veggie sandwich could be made vegetarian. The guy behind the counter said yes, so that's what I ordered. But it's not what I got.  \nTo be perfectly clear, It would have been just fine if he'd said \"no, we don't do substitutions\" or \"no, we won't do that\". I'd have gotten coffee and a pastry and no harm done.  \nInstead, I got a standard bacon sandwich. The server returned to the counter, had someone from the kitchen pull the bacon off, and brought it back. So I got a really greasy looking sandwich that had been piled in bacon a minute ago, which is gross and definitely not vegetarian.\nI wouldn't have minded waiting for them to make a sandwich that wasn't covered in bacon grease. But at this point, I didn't trust them to do that, so we just left when the boyfriend finished his sandwich. We wasted $10 on a sandwich I didn't eat.", "author": "Brigitte B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Very clean, advertised on yelp as breakfast...I'd suggest more lunch focused. Ordered the breakfast burrito & parm fries. Both delicious. Very pleasant staff and nice simple neighborhood gem. Relaxed. .take& go recommendation.", "author": "Sharine d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "This place is amazing! I go practically every weekend to satisfy my breakfast burrito craving. The employees are very friendly, the location is great, and the food is superb. They have so many great options and a full coffee bar. I don't have a negative thing to say, except that I do not think the quality of their food from the food trucks is as high. They also offer a punch card so I am rewarded for all of my purchases.", "author": "Kristin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "Good but don't think I'll have a craving to come back. \n\nDefinitely bacon crazy menu. So I was pretty excited since I love me my bacon. \n\nHad the bacon fries. Good. Had a little hint of rosemary I believe. I really liked the blueberry lemon soda. My cousin ordered a sandwich. She liked it but I preferred mine more. I ordered something very banh mi inspired.", "author": "Glessie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "I have only tried the Breakfast sandwich from here and it is so yummy! Love the sweet/salty combo of the shredded pork with the bacon. The egg is cooked perfectly where it is still a runny goodness. Everything together with melted cheese on a soft brioche bun makes the breakfast sandwich perfect. I also tried a sample of their bacon scone and it was also delicious. What can go wrong with bacon? \nIf its your first time going to the cafe location, the store can be hard to find since it doesn't have any clear sign.", "author": "Arda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "I eat here every weekend because it's that good. The breakfast burrito is always the move. Don't be fooled by the food trucks, this is the real deal. Bacon, avocado, egg, pulled pork, pepperoncini, cheese. This will save you from any hangover and fill you until dinner for 8 bucks and some shitty change.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "I am in love with this place!!!!\n\nCoffee is great; smokey with an almost chocolatey rich flavor. One of the only coffees I've had that I can drink without any kind of sweetener in it. \n\nTheir maple bacon scones are probably the best breakfast pastry I've ever had. They are nice and dry, as a good scone should be, with just a hint of sweet icing. They top it off with little pieces of candied bacon... It's heaven. Perfect with coffee. There was a time were my fiancé and I literally had them for breakfast 5 times in one week. It was becoming a problem lol. \n\nAll of their sandwiches are great, the bread they use is so fresh and delicious and soft. The LGBT (their version of BLT) is my fave. \n\nAs far as the actual bacon they use in their dishes, it's cooked just the way I like it. Crispy, but not TOO crispy; you can still feel the chewiness of the fat and meat content. \n\nOnly problem I have is that it's expensive for what it is.... But people pay a lot of money for their addictions, so I guess they are just being smart about it.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "I love how the food truck now has an actual sit down location to eat yummy bacon. My kids love how you could ride a pig even!", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-28", "description": "I come here every time trying something new. This time, I got a Cuban sandwich off their new menu. \n\nUnfortunately, it wasn't anything special. The bread was kind of dry so that ruined the sandwich for me. The turkey in it was okay and the bacon was just okay. I guess I'll just stick to the breakfast burrito from now on.", "author": "Cathy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "Omg! This place is amazing. We stopped by here while visiting San Francisco for breakfast/lunch time. The menu has so many choices! I went with almost veggie sandwich and my boyfriend got a Cuban sandwich. The staff at the place were very nice. Highly recommend for all bacon lovers!:))", "author": "Nadia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "Breakfast sandwich was great! It had thick slices of bacon that was the perfect brunch sandwich for me.  My friends had the breakfast wrap, and felt that it was a bit heavy but still good! \n\nPig ride didn't work--waste of a dime.", "author": "Em L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "One word...delicious!!! Everything had bacon in it, I had the breakfast sandwich with bacon, fried egg and cheese no picture to post as I couldn't wait to dig in...it was amazing.  The cashiers were also so nice service was fast.", "author": "Katherine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Our all time favorite food truck! We even hired them for our wedding. The food has never left us wanting anything more! I recommend the bacon fried chicken- my mouth is watering", "author": "Lyndie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "I took a chance coming here and was not disappointed.  Nice neighborhood and parking was easy for me to find.\n\nShop is small, but inviting with some modern amenities.  I tried the breakfast sandwich and was impressed.  The bacon of course was delicious and I loved the bread they used for the sandwich.  Would definitely go again!", "author": "Ricky S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-19", "description": "This is for the truck in pleasant hill. I have never had bacon with so little flavor that it did not even taste like bacon. Had the chicken fried bacon sandwich and it was not that great. The chicken was dry and the bacon didn't even taste like bacon. I am wondering if they left off an ingredient because there is no way anyone with any cooking skills would think that tasted good. I am picky but my husband who is not even said it had no flavor. Over priced and under spiced. Skip it!", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Awesome breakfast spot. The service is quick and the combinations are so good...I mean...it's bacon. YES.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Had the bacon ruban. It was porklicious! Service was quick wasn't crowded and the place is nice and clean. Prices arnt to outragous.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "East Coasters will love and appreciate Bacon Bacon, for their signature bacon, egg, and cheese breakfast sandwiches! This is something that is near impossible to find, in California (done right) - a nice-sized roll, with plenty of delicious, thick-cut, perfectly-cooked bacon, a nicely fried egg, and topped with plenty of melty cheese. \n\nThe ingredients were high quality, and everything was perfectly cooked, and well-presented. \n\nBe careful, though: that fried egg comes sunny-side up, which means that in addition to being delicious, it's also quite messy! Since I almost always order my eggs scrambled, I completely forgot that fried eggs usually come with soft yolks, and this immediately led to me squeezing yolk all over my shirt! \n\nBut, even though I almost exclusively prefer hard-cooked yolks, I was pleasantly surprised to find out how delicious it was, on this sandwich.\n\nThe bottom line: fear not the Yolk--at Bacon Bacon, the Yolk is Bacon's friend. But keep your napkin at the ready!", "author": "Steven P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "I had the breakfast burrito - it was OK, nothing spectacular. There was not that much bacon in it. For a place called Bacon Bacon, there should be ALOT of bacon, but this is not the case here.\n\nThe bacon fries was another case of lacking in bacon. It was more like Carnitas with some bacon bits. We asked for well done fries which they followed and the fries came out very nicely and tasted great.\n\nAnother low mark is their system - they will take orders from a long line of customers, cook a lot of burritos, prepare all the sandwiches ordered then release them in no particular order. You got your food randomly. We ended up being served last in a batch of about 10 people and we were there first!\n\nNot worth going back.", "author": "Rico R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-27", "description": "I have driven from the Sac area to eat at Bacon Bacon! Never a disappointment.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-23", "description": "Bacon Bacon... where to begin? Let me start off by saying I am a huge fan of bacon and all things carnivore. When I realized there was a cafe in my neighborhood where almost every option on the menu contains bacon, I freaked with excitement. Not to mention, I often catch the 6 in the morning right outside, so it's a fantastic spot to grab a cup of coffee to sip with my commute.\n\nThat being said... this morning I ordered a breakfast burrito for the first time, and I must say I feel way more hungover than when I woke up this morning. The hell? Their burrito is 95% greasy pulled pork with a small smear of avocado and a tiny portion of eggs and bacon. In fact, it was so greasy that I saturated three napkins with fluorescent orange and had to go back for more. By the time I was half done, the bottom of the second half was literally soggy with the amount of grease that had pooled in the bottom of my to-go container. Yuck!\n\nLast week I tried the cheddar bacon scone, and it was tasty, but I'm pretty sure they sold me a day-old for full price - it was quite stale. \n\nI want to love you Bacon Bacon, I truly do: both the owner (I think she's the owner? A ginger I see there time to time who LOVES to chat) and all of the employees have phenomenally friendly customer service. I also love the pics of neighborhood kids on the stop's old school horse-riding toy. The coffee is cheap and super convenient - I'll always keep coming back for that. But step it up with the food! Maybe next time I'll try the frittata and see what happens.", "author": "Simone B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "Great, fresh, wholesome food. Good ingredients to go along with their amazing bacon sandwiches. My only.complaint is the coffee. The coffee is just plain atrocious! But otherwise, a fantastic eatery overall.\n\nOwners!: For the sake of your establishment, look into other coffee.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "As it is seriously one of my deepest wish in life to Always have a Bacon Bacon as my neighbor no matter where I live and I worry sometimes because they're not ever crowded when I go, and they close early at 3p most days... Why?? Has the neighborhood with all the gatzillion companies and businesses and residential bldgs. And ballpark nearby- Still not discover you?? Maybe it's your very subdued subtle signage, I would miss you too if I was not a bacon bacon foodtruck planned to stalk bersearcher... I had just heard about ur food truck on 11th and had a scheduled attack plan but then found out, whuuth? New Bacon Bacon cafe opened 2blocks away??!! Only then did I really believe in destiny and karmic fate... or that maybe I really am one of the luckiest people alive as some have said. (Tho still not a full believer, definitely there r luckier peep esp. in sf.. but digressin..I'm ok lucky, grateful no matter, Love Life!) in any case, the Bacon is here and he is mine! \n\nThe only taint on the pork train is that I can't go there everyday as its a bit on the spends side for me. Though you have some well priced items I find it impossible not to have the Cuban every time, altho well worth the $10+ sandwych$ but then the porky fries are necessary to the essential Cuban (u will understand why)then the bacon desserts, sometimes caramel, sometimes chocolate, a bacon flavor chain that u just let happen since u didn't wish to interrupt it anyway...\n\nI think there are other items on the menu, I've split halves of other sandwiches when I can spare/share the Cuban. Love the bacon fried chicken too.. but beyond that, me and my bf find it hard to venture further. He's pretty stuck on the Cuban too. It's not the absolute best sandwich in the world necessarily, as this town is not lacking spots, but the special Cuban flavorings+ extra crispy crunchy bits of fried belly with just the right amount of grease light  +perfect light dusting of salty +convenience of proximity... ok so I am absurdly rav right now, no bkfst yet, need to food shop and waiting impatiently for 11a lunch menu to start...  but still I'm only exaggerating slightly.... for today as with most days, it is give me Cuban or give me death..\n\nAnd peeps are super nice there too, they insisted on cooking a fresh batch of sandwiches when I was really late for a pickup order the other day.. rare... tho wouldn't blame them if they ate it;) i just truly hope biz has picked up as they should not ever close shop until we've agreed where to move together next! ps:not promoting pork eating as the piggies are damn cute and smart! Intellect of a 3yr human supposedly... so sorry, I will try to abstain.. i will try not to be a weak human....hmmm...uh oh..stomach grumble...", "author": "Carmenchu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Three words: bacon maple scone \n\nBest thing ever!!!!!! Like a biscuit. So happy this place joined the hood. Can't wait to go back. Dangerous at my bus stop :)", "author": "PK R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "What can I say about Bacon Bacon? A+\n\nI'll start off by recommending the burger, grilled cheese and breakfast sandwich as my three classic favorites. The Mexican hot chocolate with chocolate-covered bacon is a must-have on a rainy day. Also, they bake some heavenly bacon cheddar scones, so grab one by the cash register before you leave.\n\nHere are some fun tips to enhance your Bacon Bacon experience: Try all the different bacon bouquet flavors! Chicken fried is amazing, but you can never go wrong with maple. Ask them what the Giant Giant Bacon Bacon Burger Burger is, too. It'll make your day. Or break your heart, if you're a calorie counter.\n\nThis little spot in the Haight is great for brunches and dates. Bring your bros and girls here, and they will appreciate you for it. How can you not love everything about this place? Especially the Wall of Bacon. Jim, Tom and rest of the crew make the atmosphere so fun and incredible that you just want to set up camp here forever. Keep up the great service, you guys, and God bless America.", "author": "Ines C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "On my first day in SF, I woke up jet lagged and, most importantly, starving. A quick search on Yelp lead me to nearby Bacon Bacon, which was simply serendipitous since I was badly craving some porky goodness. \n\nMy bf and I entered the tiny eatery already knowing what to order: the breakfast burrito. Though seemingly small in size, it is packed to the brim with scrambled eggs, avocado, cheese, bacon and, the piece de resistance; pork shoulder. One hearty bite and I was in bacon heaven. A few bites later I spotted bottles of hot sauce (Sriracha & a mexican brand) and couldn't resist the urge to add some spice to the meat bonanza.\n\nKeep in mind that the place is very small, with limited seating. We went on a late Saturday morning and had to wait around 10min for space to free up and it did get pretty crowded. \n\nI definitely plan on making a few more visits to Bacon Bacon (either the B&M location or the food truck) to try more menu items. I'm especially looking forward to the bacon flight!", "author": "Elsa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-25", "description": "I wouldn't say the breakfast was anything too special. I'm not really sure why it cost so much either. We ordered to go because the inside was full and just over 20 minutes later we had our food. So this place is not super quick if you're in a hurry.", "author": "Tanner B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Favorite spot in the neighborhood. I get my morning coffee here and order greasy breakfast food for my weekend hangovers. The porky fries, breakfast burrito and the daily special, which is a cuban sandwich, are delicious! But the real treat, in my opinion, is the bacon fried chicken sandwich. Bacon Bacon is a local treasure and just a gem.  Delicious food, nice folks, great sense of humor. Stop by their storefront if you're in the area - yummy sandwiches, great bacon, everything I have tried so far has been wonderful! Bring by your friends and family, I'm sure they'll love it!! Don't take my word for it, just have a look at their other reviews and you'll see that this small  restaurant is a gem.", "author": "Alicia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "We had some great eats here during the S.F. Beer Festival.  We ordered the Bacon fried chicken sandwich + porky fries + chocolate  covered  bacon....it was simply awesome!!!!", "author": "Alex .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "The breakfast burrito with bacon AND pork shoulder is wonderful.  The first bite melting in your mouth is divine! Totally worth the calories.", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Awesome food! Great service! And really good price point for what they're selling!! I definitely will come back when I'm in the bay area again :)", "author": "Lorene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "I wish everyone could taste their bacon cookie it's truly savory goodness! It was the only thing I tried here but if the food is as amazing you'd be in bacon heaven.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "I consider myself a dedicated bacon lover. I am always looking for places that share my appreciation for bacon as its own food group. Bacon-Bacon is a dream come true where I enjoyed the best BLT with goat cheese and topped it off with a Mexican hot chocolate. Maybe in the future they will find a way to add bacon to the hot chocolate. Trying to show some restraint, I didn't try the maple bacon slices, guess I will have to come back another time. This place is truly great.", "author": "Jillian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "Breakfast burrito was tiny, but delicious.  Stuffed with tender pulled pork, eggs, avocado (which is the only reason i ordered it - worth it), red bell peppers?, and of course, bacon.  Leaning a TAD on the salty side, but let's be honest, that's all some people (me) want in a breakfast burrito: hearty, salty goodness.\n\nAlso tried the fried chicken sandwich.  The flavor had a real \"je ne sais quoi\" to it.  As in, there's no way I could replicate the flavor at home.  It was tender, and the bread was outstanding.\n\nWould definitely eat here again.", "author": "chelsea c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "It's hard to beat an eatery that focuses on bacon and delivers it in meals of high quality and thoughtful design. Our first go around with Bacon Bacon was via their mobile truck which has since burned to the ground (not a grease fire, but an engine fire. New one on the way we hear), and that was amazing. Amazing savory combinations, some with excellent spicy options. For me, it just did not get much better than that.\n\nNow, visiting the store, the excellence continues. I had the the Hot Italian. My lady had the fried chicken sandwich. We split a side of Porky Fries.\n\nHere's the thing: these sandwiches and the fries could have been served sans bacon in any other restaurant and they would have been MAGNIFICENT. But here, they are thoughtfully paired with bacon and their magnificence increases exponentially. \n\nIf you like great lunch [or breakfast] food at a reasonable price, the Bacon Bacon is worth a visit. If you like great lunch [or breakfast] food at a reasonable price and also love bacon, THEN YOU MUST VISIT.", "author": "Stephen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-24", "description": "Best breakfast sandwich in SF. Need I say more?  \n\nOh, good coffee and friendly staff too.", "author": "JT N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-21", "description": "First time here and I am so amazed by all the bacon here! Parking was easy to find, the store is partially behind a tree. Coffee here is great, I'd recommend it to people looking for a small cafe. If you can handle the bacon smell, you're in the clear!", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "egg. pork shoulder. bacon. avocado. cheddar. \n\nthe best breakfast burrito I've ever had", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "I went to the food truck at off the grid. I had been looking forward to trying this place for a long time. I ordered the burger and fries. Unfortunately, they forgot the bacon jam and cheese on my burger. So it just tasted like an over cooked burger with bacon on it. Also, the fries were supposed to come with Parmesan and herbs. But they were just limp fries. Maybe you would have a better experience at the restaurant.", "author": "Kenzie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-24", "description": "Oh My!  A restaurant called Bacon Bacon?  Of course it's a win and perfectly logical excuse to venture out into the city!\n\nLet me give you a little secret in which I hope the owners do not mind me sharing!   (Slightly creeping into your personal space and whispering with a low voice) They also have a \"secret menu\" that isn't published on the board.  \n\nIt's a good thing that we found this out!  My boyfriend ordered the Bacon Bacon Bacon burger (yes, three bacon in a row!).  That massive burger was huge!  My poor boyfriend trying to eat that large thing.  At least I know he has a pretty little mouth there.*  Joke lang, joke lang!  Of course he loved it as I did with my Hot Italian Burger.  As soon as I got that little bastered in front of me, I was saddened with how fast it came and went.  Pork belly was too good to believe!  \n\nI'm really surprised that this place didn't get slammed busy considering that it's location is so close to haight / ashberry street.  But then again I think the lack of other customers at that moment we arrive was in our favor since we had no clue on what to order.  The guy at the register (who I can only assume to be the owner)  gave us a little informative run down on their different burgers (Much needed and greatly appreciated!) \n\nA must do if you're on the prowl for a new taste!", "author": "Lea M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-13", "description": "As a bacon lover I had high expectations but unfortunately during this visit the bacon fried chicken sandwich was overcooked and the fries were hard and bland. A disappointing experience in this instance", "author": "Ray H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-10", "description": "Oh dear goodness, this place is absolutely amazing.  I'd heard about the truck, but when I realized how close it was to my apartment, I hightailed it over to their kitchen.  My friend and I arrived too early for their lunch menu, so we tried a breakfast sandwich.  Wow was it amazing.  I don't typically eat breakfast sandwiches, but this one was worth it.  We also took a maple bacon scone for the road. Best. Idea. Ever. Do yourself a favor and get one.\n\nAnother day I decided it was in my best interest to try the Bird.  Bacon, panko encrusted chicken breast, spicy slaw and bacon mayo on a brioche bun. Holy crap this thing was amazing. I recognize that it wasn't the healthiest choice I've ever made, but you only live once!\n\nThe prices are right and the food is amazing.  The gentleman behind the counter was happy to answer all of my awkward questions and even make a joke or two.  If you like Bacon, which I know you do, go over there and devour some.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "First day off for holiday vacation, best friend in town and she's craving a breakfast burrito.  I say let's try some place new, and off we go to Bacon Bacon.   Each ordered up a burrito which was HUGE, hot and tasty.   Topped mine off with an Americano while she had a delish Mexican Hot Chocolate.   You cannot go wrong with a bacon burritto during the holidays.", "author": "Beth J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-17", "description": "I am saddened about this review.\nThe LGBT was super bland. I added a fried egg for only $1 which was nice and to my surprise it had a runny yolk because I forgot to mention over medium. You should make note though cause not everybody likes that.  I winded up salting the drippy egg and dipping my sandwich in it with utter disappointment. \nI did not count the slices of back  like another yelper  did but it seemed like enough. The tomatoes were not ripe and there was not a whole lot of goat cheese. The lettuce was plentiful and fresh and the roll was crispy and perfect. It was just like dry, needed more goo. Like mayo first and then goat cheese. Or shoot maybe a mayo spread already mixed. The bacon itself was not hardly salty and I am now thinking that was the problem.\nI didn't even hesitate when I saw the name  Bacon Bacon. I thought everything would be amazing. I would try it again but highly unlikely that I would be around there. I should have done the sandwich with the jam.\nSurprisingly disappointed. :(", "author": "Rene V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-16", "description": "I love bacon and who doesn't. the food is innovative M pretty good. although I've had better. to me it feels like the passion of this food truck has dwendrled a way.  I always fine the people who work for bacon bacon to be very unfriendly. they support and attitude as well. it's too bad because it's a great idea and could be good food for great food and it slowly die", "author": "C D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "I went in the morning for the breakfast burrito, came across the food truck on Fishermans' Wharf and decided to have the fries. Both were very delicious.", "author": "C B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Impressive. I've been to the Bacon Bacon truck before, but it's nice to go to the brick and mortar store as well. Definitely will be back.", "author": "Martha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Very tasty but it is a little pricey. I got the burger and herb fries. I only wish that the burgers came with the usual tomato lettuce etc. It doesn't really need them bc it's so flavorful but that's just my personal taste. The meat seemed good quality and the guy at the front was very friendly", "author": "Pilar J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "*everything about bacon done right*\n#pork\n#50shadesofbacon\n\n\"Order quietly, Steph has a hangover\", said the sign in front, and I completely agreed with it due to my cocktail flu. However from my parking spot 2 blocks away, the strong aroma of pork gently revived me until I was standing in front of the store. \n\nThis place is exactly what you'd expect from a place called Bacon Bacon. Think any sandwich, burrito, salad, ice cream sandwich, whatever with a nice thick slice of bacon. This is no Denny's 1/16\" think slice of bacon, but a solid hefty meal in itself. For the purists, you can order a \"bouqet\" of bacon which is exactly what you think it is. \n\nI ordered the bacon burrito which albeit small, had a generous serving of avocado in it. And as if there wasn't enough pork, there was shredded pork shoulder in the breakfast burrito that was cooked and simmered to the point of melting in my mouth. \n\nMy friend's sandwich was a little bit dry, but no worries, we got a side of baconnaise with big fat bacon chunks in it. \n\nTo top it off they had some great coffee to settle all the bacon you just consumed. A great place and great menu for bacon enthusiasts and casual bacon-ners. Could use some seating, oh and maybe leave a bottle of the bacon hot sauce for all to try!", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "Bacon fried chicken sandwich,  porky fries,  Bacon infused chocolate chip cookies... Direct hit.", "author": "Fred S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-29", "description": "I have been dying to try Bacon Bacon after seeing them on a couple of food specials.  I went to Bacon Bacon for breakfast this morning and I was in bacon heaven.  I love my bacon!  I had the breakfast sandwich, maple bacon scone with bacon jam, and a their drip coffee.  Everything was absolutely delicious!  The bacon jam was a pleasant surprise and is inspiring me to learn how to make it myself but I'm sure it won't be as good as Bacon Bacon's.  \n\nTheir kitchen/storefront is small with little seating, so you will most likely have to take your meal to go or stand and eat at the counters.  The place was very clean and the staff are friendly.  It was worth the drive from Walnut Creek.  For all you bacon lovers, this place is a must.", "author": "Mary K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "As this is my first yelp review, I feel obliged to confirm to the standard of an unnecessary and overly personal intro. Feel free to skip ahead to the fourth paragraph, I will not know and have a strong constitution anywho.\n\nMy Aunt visits weekly from Berkeley, where she lives at the corner of University and Milivia, top apartment. Now about that Aunt. She recently finished dental school, bottom five percent of her class, but hey everyone who walks is called a dentist (right?!). She also suffers from crippling agoraphobia which, to make a long story short, keeps us local when we want to eat out. Bacon-Bacon's kitchen is just around the corner and it has become our go to place. You might find their cuisine at one of the many food truck gatherings around the city, as the majority of their food is slung via truck, but if you didn't know, they also have a kitchen in Ashbury Heights.\n\nAs a local I've had time to sample the entire menu. If you are a vegetarian, you might want to just sulk your way down to Haight Street, as the only vegetarian option is a parfait (I think... now I'm questioning my knowledge of the menu... look what are doing to me veggie-lovers, I hope you are happy!). But if you do eat meat you like bacon, and you've come to the right place.\n\nNow, for the omnivores who are reading on, enough with autobiographical nonsense, let's talk about the food. The bacon in each dish is always perfectly cooked. Their kitchen is consistent. Each dish is also clever, some might call it a \"foodie\" take on bacon-y comfort food. But I'm not calling it that. Don't put too much thought into what you order, as everything is excellent. If possible order extra, or with a buddy or two split your order so you can get a good sampling of as many dishes as possible.\n\nThat said, I do have favorites. For breakfast I love their standard bacon and egg sandwich. Quick warning, be prepared to manage the tasty egg yolk as you take your first bites, it can cause some difficulty if you aren't anticipating it. Also, you really need to order a maple bacon scone. If you have been there before and haven't had one, go ahead and punch yourself in the face (or do something nonviolent that will help you remember next time) as you have been missing out on bacon awesomeness. This is the best scone I have ever had; all other scones should be ashamed of themselves.\n\nFor lunch, I usually mack on their LGBT (best sandwich name ever). It's like a BLT, but it has goat cheese to complete the flavor profile and clever name. Or I go for their pastrami sandwich. It has a run of the mill name, pork belly, pastrami, cheese, and an olive red pepper relish that brings it a whole nother plane of kick-buttness. \n\nTo top it all off, they have great customer service. They are friendly, cook everything to order, and routinely serve excellent meals. I am a big fan of this place, and so is my Aunt. I give it my overwhelming endorsement.", "author": "Mac B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "The best breakfast in San Fran! They're bacon is perfectly thick cut, crispy, and a hint of maple sweet!!! Yum!!!!", "author": "Dani L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "I love Bacon! so I was really excited about trying this place. It lived up to all the hype that I heard from my friends. I had the bacon burger and fries. The burger had a great flavor and the bacon was cooked perfectly. I'm not a huge fries person but the fries were delicious. The staff was very friendly and talked with us for a while. I really wish there was one close to where I live because it would be a regular stop for me.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Never disappoints. Consistently amazing every time. The Almost Veggie Sandwich is a mixture of always perfectly fresh bread, sautéed veggies, a fried egg (slightly runny) and, of course, bacon. Try the Bouquet for your fill of crispy bacon every time. Even excellent coffee and a sunny, relaxing atmosphere. Go out of you way for Bacon, Bacon!", "author": "Andre M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "Tried the breakfast burrito.  It was delicious on the greasy side and I really only should have eaten half, but I have to say I thought it was one of the best I've had.", "author": "Diana E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "We got the cheddar bacon scone, LGBT sandwich, latte and brew and everything was delicious! On top of that, service was great. Would def return.", "author": "Ana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Just tried the Burger today was like an orgasm for my mouth this place just keeps getting better.  So far everything I've had is excellent and the people who work there are so friendly and upbeat love it.  They also just stared a new event at El Rio called Bacon Babes and Bingo went to the first one and loved it was a blast, I think I was like the only straight girl there but was a lot of fun.", "author": "Nirea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "Bacon makes everything better. I'm guessing that's what they were going for here. Great breakfast frittata, flavorful scones, cookies were a little too salty with the dark chocolate and bacon, but I can see how some people would love it. Cute shop with friendly staff, not a bad stop if you're looking for something to eat on the go.", "author": "T P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-30", "description": "Did not meet expectations.  Bacon Bacon has been on my radar for some time...it was tough to chase down truck locations...it became my \"great white whale\" for over a year!  But when a friend told me they opened a store in the Haight (not far from the office), I jumped at the chance to finally try it out...and so did my fellow co-workers.  It was a new experience for all of us, so we ordered 2 types of sandwiches:  Burgers and the LGBT.  The pics of the burger were very enticing....the LGBT description stated that each sandwich would have 5 slices of bacon.  \n\nWhen we got our food...man, the overwhelming consensus was disappointment.  The burgers and LGBT's we're plain tasting and the breads used were Grocery Outlet quality.  Each of the LGBT's had a maximum of 3 slices of bacon...WTH???\n\nI will not be returning anytime soon....what a let down!", "author": "Rodney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Not too much of a sit down place but the food is amazing! best Bfast burrito I've had in the city so far. I've also had their belly sandwich... totally worth all the pimples that came along with it! Great prices aswell!!", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "Very yummy. Quiet location.  Neighbors are upset about all the traffic to this isolated spot so be quiet while munching on your delicious menu item.", "author": "April M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "I had possibly the best breakfast sandwich of my life from this place yesterday!  I moved a block and a half away from this little gem a couple months ago and I can't believe I waited so long to stop in.\nThe handwritten sign kind of turned me off from checking it out I think... felt temporary/makeshift (get a real one, guys!).\nI ordered the breakfast sandwich.  Ingredients are: Bacon, fried egg, cheddar, bacon jam, brioche bun - $7\nIt typically comes with an egg over easy but I substituted scrambled eggs as I'm not a fan of runny yolk.  \nAll I can say is this breakfast sandwich is heaven!  You can tell the ingredients are all the best possible.  All of the ingredients compliment each other perfectly.  The bacon is thick and cooked perfectly.  Not rubbery or overly cooked.  The bacon jam gives the sandwich a slight sweetness and makes it even richer.\n\nThey have great coffee too, which is a nice surprise.  I love a full - bodied cup o' Joe and it's hard to find around these parts (La Boulange has good coffee but it's a little bit of a walk).  \n\nHugh was working and was super accomodating, nice and helpful.  Looking forward to my next breakfast sandwich!  They also have bacon scones which are very intriguing.", "author": "Alisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "*On our quest to try 52 places in 52 weeks*\n\nSO MUCH BACON. Bacon overload. But in a good way. I am not a die-hard bacon fan (I know), but of course, I appreciate it just as much as the next person. The hubs however LOVES bacon and this spot is in our neighborhood (Cole Valleyyyyy) so we sauntered over on a Saturday morning before college football. The hubs got some sort of Bacon Burrito (which had more pork belly than bacon, but still delicious according to him) and I had The Croissant with Bacon Jam...which was..,interesting. I mean, I signed up for bacon, right? And it was bacony! \n\nI would love to come back for lunch and the Oakland roasted coffee was delish!", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Breakfast burrito is top notch, especially if you're looking for a meatier option. It does not include breakfast potatoes (which I typically like to have in my breakfast burritos) but the pork shoulder and bacon are quality meats and the avocado, cheddar cheese and peppers add some great flavors too.", "author": "Charles F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "Delicious food, difficult to choose from all the options. Their fries with pork belly was great. Highly recommended", "author": "Burak G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-13", "description": "Items ordered:\n1. The breakfast sandwich\n2. The almost vegetarian breakfast sandwich\n\nThe reason for the low ranking is that both sandwiches were remarkably bland. The only flavor that comes through on the regular breakfast sandwich is a mild hint of the bacon syrup. While this is a nice flavor, it is quickly absorbed by the cardboard (brioche) bun.\n\nThe almost vegetarian sandwich is similarly dominated by one flavor, but in this case it is the broccolini doing the heavy lifting. With a little salt to balance the bitterness of the broccolini and more red peppers to add sweetness, this sandwich could be improved. However, the floppy, flavorless brioche bun ends up sucking any life out of the sandwich, so like it or not, the flavor disappears anyway.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "The problem with a place like this is that I literally want to eat everything on the menu.  Since that was impossible, I went with either the fried chicken sandwich or the pulled pork sandwich.  One I got and one I dreamed I was able to get.  As I write this, I wonder why I have not been back.  Sorry, I need to run somewhere...", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "Bacon goodness and nice service. They forgot bacon in my bf's breakfast sandwich and remade him another one just heaping with bacon & bacon jam. I had the breakfast wrap - tortilla filled with bacon, pork shoulder, avocado and cheese. Filling, hot, hearty, delicious. They have iced coffee, blueberry lemonade, orange juice, etc.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "Happy place to stop for a bite. I ordered a sandwich, it was good and the guys were really friendly. I will definitely go back.", "author": "Armando A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "As soon as you walk in the door the smell is intoxicating and makes your mouth water, the restaurant is homely and clean, the menu of delectable bacon goods is amazing, if you like bacon this place will make you love it, I met the owner last time I was here and he was incredibly polite and showed great hospitality, the staff on my second visit was just as professional and pleasant, 5 stars no question.", "author": "M. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "I used to have recurring dreams about a world made of bacon.  Bacon Bacon is a step in the right direction of making my dreams a reality.  \n\nBacon is good.\n\nThey have a lot of it here. \n\nIncluding bacon breakfast dishes, bacon lunch dishes and bacon desserts.\n\nEnough said.  Come get yo bacon.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "What a great little spot! If you enjoy the truck, you will enjoy the kitchen more.  All of your favorites are here, plus much much more, including an espresso bar.  On my visit I happened upon a Saturday special - bacon-wrapped chicken sliders! Delicious! Their regularly featured chicken sandwich is wonderful as well.  I'm not often in this area, but Bacon Bacon will be a target for me when I am.  Highly recommended & reasonably priced!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Bacon Bacon was all I expected! Try the Bacon Fried Chicken Sandwich! Great service too and definitely ride the piggie", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Stop reading this immediately!!! Go to bacon bacon and order the best breakfast burrito on this planet!!! What are you doing!!! Your wasting time, you could have been there by now being worshipped on the altar of your tastebuds!!!!!!  Hurrrrrrryyy!!!!", "author": "RD r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "I brought my bacon-bewitched boyfriend to Bacon Bacon for his birthday brunch and it was beyond belief! Our best bite? The Bacon Bouquet! This was a flight of each of their bacon preparations including: chimichurri, bbq, breaded & deep fried, and candy (brown sugar bacon). We were less excited by the LGBT (BLT with goat cheese) and Bacon Grilled Cheese that we shared, but want to go back to try the Bacon Burger and another flight of bacon. This was the first time that I ever saw my boyfriend so satiated with bacon that he was unable to finish it. \nI was sad to hear that their food truck burned, but I look forward to visiting that once they get a new one running.", "author": "Kris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "poor service at lunch time. They prefer to prepare the orders to go that they had over the phone than serving you.", "author": "F Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Fantastic from start to finish. My kids actually made nom-nom sounds while eating the Cuban sandwich, which was hot, oozing with cheese and pork juices and goodness.", "author": "Nevada L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-16", "description": "I came here with my good buddy and my little baby for lunch the other day. I walk past this place every day with my kid thinking, \"Huh. Another eatery *obsessed* with bacon. I guess I'd eat here but...eh.\"\n\nLong story short, we tried it and it was amazing. Really top notch, fresh food, prepared well and not at all leaning on a gimmick. I had the Italian sandwich and my friend had the Club. We split the pork fries. The Italian was delicious: warm, crispy, moist and really focused on the flavor of pork belly cut with cheese and arugula. The pork fries were intense, covered in bacon chunks, peppers and...pulled pork (I think). It was rich but not overly so, incredibly tasty without being too salty, and almost too much food for two hearty eaters.\n\nMy daughter chowed on her quinoa and carrots (she doesn't gnaw at pig like papa), we made a huge mess and the owner was totally cool with it. Thank you SO much for being chill with us and for the tasty lunch. This is probably the best place to have lunch in the Haight.", "author": "Alee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "Saved my bacon.\nMoved to the hood and could NOT find a cup of coffee on a Saturday morning that didn't involve a line or the lack of cash (only had plastic).\nJust as I had given up I walked by Bacon Bacon where they allowed me to buy a coffee with a CC (usually places have minimums) but then I saw the scone.....and it changed my life.\nThe coffee is rich and wonderful.  \nThe scone is unreal! The perfect mix of savory and sweet thanks to the bacon chutney. It was a food moment.", "author": "J H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "My love affair with bacon has truly begun.\nI think i may just become a regular here yet.\nAs it was my first time visiting Bacon Bacon i asked what was good, and received the breakfast sandwich. Mind. Blown.", "author": "Genni V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-05", "description": "Truck is better. The cook is not accommodating and punitive. Staff is nice other than that. Will return when there's a different cook.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "Bacon Bacon is an unexpected treat:  an island of indulgence amid a sea of residences.  This location houses the kitchen and operations of the vaunted Bacon Bacon food truck.  I marvel at the delicious sandwiches and breakfast treats here, particularly the bacon scone, croissant with bacon jam, and the ultimate breakfast sandwich (featuring an egg over easy, bacon, cheddar, and bacon jam on a toasted yet fluffy brioche bun).  The \"almost veggie\" breakfast sandwich -- comprised of scrambled egg with broccoli rabe, roasted red pepper, bacon, and melted provolone between a toasted brioche bun -- comes close to assuaging my guilt for eating here.  But perhaps that would be asking for too much.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-14", "description": "Meh. Neither dish I had (the grilled cheese and the porky fries -- which is fries with bacon, pork shoulder, and cheese) was particularly memorable. A little too greasy, a little too much bread (yes, even for a bacon place).", "author": "Gabe E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "The staff here are super friendly.  My friend is a bacon lover and was excited to go and see what they had.  She got the chocolate covered bacon and loved it.  They also had tshirts to purchase.  It was my birthday and they gave me a free treat and took a picture of me on the mechanic pig to put on their wall.  On the other hand there was obviously no options for my vegan friend at Bacon Bacon!", "author": "Julie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "First time here and the food was amazing!   The breakfast burrito was delicious and my son had a hamburger that was juicy and super delicious.    Will come again for sure!", "author": "Karen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Great food at great prices. This is our go-to neighborhood breakfast nook every weekend. The breakfast burrito is a tasty tube of pork, but if you're not hungry enough to handle it, the taco is a tasty alternative.", "author": "Niels .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Just got into town, my brother took me to bacon bacon and good god, it is fantastic. I sampled a number of dishes as I had already technically eaten breakfast. But I couldn't resist. Giant pulled pork, egg, bacon, avocado and cheese burrito was fantastic, the pork well cooked and everything just glommed together perfectly. The breakfast sandwich was probably the best, delicious bread and I really appreciated the runny egg for some dipping. The folks working there, especially some fellow known as \"Daddy\" were super friendly and we were even given a cheeseburger to try for free. Thick slices of bacon, again w delicious poppy-seed bun, was surprisingly easy to eat considering the feast we had just sampled. Oh, and the coffee options are outstanding. Bacon Bacon and the great folks that work there got my weekend off to an ideal start.", "author": "Jacob C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Quick foodies and service is ok. Get the breakfast burrito! Half of it was cold, oddly. Do not get the breakfast burger-- it's tiny and not as yummy.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "SO GOOD! we got the breakfast burrito, the fried chicken sandwich, and the Bird - everything was amazing! great flavors without being too salty or \"fatty\" tasting. friendly and great service - can't wait to go again and try more things!", "author": "Hannah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "Great food.  I had the Belly sandwich twice (my favorite) and the bacon, chocolate cookie.  I also recommend the Bacon Chicken Sandwich.  The staff and cashier are very friendly.  Try it! Can't wait to go back and try more items off their menu.", "author": "Logan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-20", "description": "I went for lunch, the sandwich I had was eh, fried chicken and bacon and slaw....nothing to write home about, the fried chicken was pretty dry, but it sounds like they're known for their breakfast.", "author": "S M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "Wow spectacular flavors. First visit and throughly enjoyed a breakfast burrito and Mexican hot chocolate supercharged with espresso. I may need to make sure I walk here because this is habit forming.", "author": "Manny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "Great chicken sando.but a Cubano that isnt grilled not a fan.", "author": "Russ H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "A joyful surprise as we wandered from Corona Heights to NoPa our first morning visiting relatives for thanksgiving. I jumped in with the breakfast burrito - a cornucopia of goodness anchored by pork shoulder and highlighted by avocado and pickled peppers. L opted for the very extra special veggie frittata on bed of bacon bacon with sliced tomatoes and greens. Three days later I woke in a post-holiday fog pondering bacon and ventured out in the city clouds to gather another burrito from this little protein haven. I am truly thankful.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Stopped by Bacon Bacon while in SF for the weekend at the recommendation of my boyfriend. I visited the physical location in Ashbury and had a delicious breakfast burrito. I love pork shoulder and was excited to see it included in the burrito so I had to get it - it did not disappoint. Many of the yelp reviews warned of the lack of seating in the cafe but we went around 2pm and there was plenty of seating at the window barstools. I can see how it can get crowded though if you go at peak hours. Later in the day we were at Outside Lands and saw that the Bacon Bacon food truck was there. It had quite a line so I'm glad we were able to go to the cafe beforehand and avoid the crowds.", "author": "Denise V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon, bacon.....come here for some tasty bacon centric sandwiches.  the grilled cheese and the cblt were tasty!  \n\nthey have coffee too, bacon for breakfast, lunch, dessert and even bacon flights.  portions are generous on each sandwich and the sandwich itself is very filling.  \n\ndelicious, tasty bacon!", "author": "Caesar R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-14", "description": "Bacon Bacon staff has behaved rudely to me and others. I cannot recommend anyone visiting this establishment.", "author": "Ej M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Cuban sandwich was fuego! Great service too. Would def. come back next time I'm in sf.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "I REALLY wanted to like this place because I LOVE bacon but unfortunately had a sad experience. I don't remember the name of the sandwich that I got but it was basically fried chicken wrapped in bacon, sounds amazing right? Well unfortunately the way they cooked it, the underside of the bacon was completely uncooked... whhiicch kind of made me nauseous. *sigh* However, I will say that the bacon grilled cheese and the bacon jam were FABULOUS. So maybe get those to be on the safe and still really amazing side. I will definitely go back just for that grilled cheese.", "author": "Melanie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-16", "description": "good food, terrible service.... I ordered from here via UberEats today @ 2:55 (closing time listed as 3 pm)... They rejected the order around 3:10... I called UberEats customer service and they told me that you have to order well in advance of \"closing time\" to get your order - like an HOUR ahead of time... Okay, then just list \"closing time\" at 2 pm... Is that so hard??", "author": "Liz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Small menu and almost everything has some type of bacon ingredient. I like places with small menus as that means they can focus on making a few things really well. Bacon bacon does a decent job at that and I very much enjoyed what I got (breakfast burrito and a croissant with bacon jam). That said, I felt like I didn't get enough of their namesake in my food. The rate of bacon was overwhelmed by everything else.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-18", "description": "I have eaten there the past 2 Thursdays and on both occasions sandwiches have not been good. \n\nThey have changed the menu in the cafe. \n\nThe old bird sandwich:\nTurkey, Chicken Fried Bacon, Provolone, Cole Slaw and Avocado on Soft French Roll.\n\nThe new bird sandwich:\nTurkey, Bacon, Cole Slaw, Hard Dry Stale French Roll toasted in a panini maker.  No cheese, No avocado.  And really dry.  \n\nI also tried the Cubano sandwich.  It was a bunch of meats with a slice of cheese on a hard dry roll toasted in a panini maker.  \n\nMaybe its the sandwich maker that works on Thursday.  I don't know but I won't go back for a while. Sorry.", "author": "Samantha J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "Service was fantastic - super friendly! My husband loved the breakfast burrito & the almost veggie sandwich was to die for, especially on the toasted brioche. We also picked up two chocolate chip bacon cookies on a whim-- delicious! If we lived in the area we would definitely make this a (terrible) habit.", "author": "Savannah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "I love visiting this location cause they have more to offer on the menu over the truck and the mission street location. Before this one closed I would come often and the place looks nice. My food was made to order and wow the food was AMAZING. I recommend trying everything on the menu every visit you get. This isn't a grab and go food that eat in five minutes. This is art that you sit down for 30 minutes take a bite and enjoy it.", "author": "San F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "God bless America. Only in America is it possible to have a cafe menu where 1/3 of the items are just various ways to prepare strips of bacon: maple, chicken fried, regular bacon, and 4 others I can't recall. One order of The Flight bouquet (a sampling of their 7 preparations for bacon strips) is a heart attack waiting to happen according to a calorie counter, that puts the entire order equivalent to one day's worth of sodium and over a day's worth of saturated fat. There are real food items for breakfast and lunch but given that I already ate 6 strips of bacon (left one for tomorrow to demonstrate restraint), I figure that I should give Bacon Bacon a least a week's rest. My only qualm is that they close at 3 pm. Who says a bacon craving can be limited to only the mornings and afternoons?!?!", "author": "Gwen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "Enjoyed it.  The ham and cheese croissant was delicious and the burger was too.  I'd go back and suggest others try it too.", "author": "Kris C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-16", "description": "I been there 2 weeks ago. It was sunday we went for late breakfast but the bread is not fresh also there is nothing special with bacon wrapped chicken. Do not waste your time. Simple. They are just trying show different.  there is nothing special.", "author": "Emre E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-05", "description": "It's bacon! Onomonomon.....bacon! I came here with my friends and wow hands down. I loved the bacon fried chicken. I could not stop eatting it. It was getting better at every bite. I was left fulfilled and satisfied.The spicy mama bacon :)....ummmmm yummy.", "author": "Thu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "Went there today with a friend and his infant daughter for lunch, still feeling the after effects but was it ever worth it. I got the Bird, which had turkey, chicken fried bacon (oh yeah), avocado and purple cabbage. It was meaty, filling and delicious. I also shared an order of the fries which had pulled pork, bacon and hot peppers on it. It was a guilt-inducing amount of food and calories, but again, worth it. \n\nThe space is clean and welcoming (though a bit small) and it required a lot of hill climbing to get there, but that's probably a good thing considering the food. The staff was incredibly friendly as well. My friend's daughter made a bit of a mess, spilling some food on the floor, and they didn't bat an eye, just thanked us for coming by. \n\nWill definitely be heading back there soon to try out some of the other sandwiches.", "author": "Tae K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "bacon all on my tongue \nbacon all in my guts\ndont believe me just eat there \nhungry hungry hungry\ndont believe me just eat there\n\n\nall bacon errthang\n\nget the mixed order that comes with all the different flavors you wont regret it", "author": "Cruz, J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "Is there something more than 5 stars I can give?  OMG, BACON !!!!!  This was our 2nd visit and my brother and I both got the bacon cheeseburgers, fantastic.  Parking is hard to find but work the effort.  Bacon Bouquets are the ultimate guilty pleasure.  I can't say enough about this place, you have to go.", "author": "Colleen J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "Sorry it took me so long to try this place out! Just had the best breakfast sandwich ever. Free double cappuccino (they are debuting their new machine) was beautiful. A most welcome addition to the neighborhood.", "author": "Joby P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-13", "description": "Holy pig, this is some damn good bacon!  Just the perfect thickness and amazing flavor.  I had a breakfast burrito which, while not the largest, it may have been the single most flavorful I've ever had.  I also tried the bacon scone, which was awesome as well.  The wife had a breakfast sandwich, which was just ok (besides the bacon in it, which was of course excellent).  My son got a regular bacon bouquet, which I proceeded to eat half of.  Did I feel like a giant greaseball afterwards?  Yes.  Do I regret it?  Not for a second.  The one thing I wasn't a huge fan of was the bacon jam.  But I guess you can't win 'em all.  I wish they'd drive one of their trucks down to So Cal!", "author": "Tim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-16", "description": "Last sunday my friends and i went to go eat brunch at Zazie, but it was a nice day and it would have been at least an hr and a half wait and we didn't have that much time, so we happened upon Bacon Bacon. This is more of a counter eats place, or takeout, and obviously, it is full of bacon. They advertised some yummy looking mexican bacon hot chocolate, but they were out. They were also out of some tasty looking scones. They did have potato balls, which they'd just invented the thursday before. They were yum, made out of mashed potatoes fried with a little bacon inside. The guy said he's still perfecting the recipe, they were a work in progress, but tasted good to me! I must say, i'm not really a bacon fan, personally, but I just went because it was there and who knows it may have changed my taste buds and i just wanted to go with the flow. My friends had the pork belly breakfast sandwich and the almost vegetarian breakfast sandwich (which yes, has bacon) and enjoyed them. I also had the almost vegetarian. LOL it wasn't for me. I can vouch that it's good if you enjoy bacon but if not, it's my fault for being there. Fresh squeezed OJ was also thick and delish! The sandwiches were on the small side and my friends ended up sharing a dessert crepe elsewhere, so you may want to get your OWN potato balls with your sandwich instead of sharing them btwn 3. ppl. Friendly, fast service. It's a shame some neighbors are trying to shut them down. Rude! I hope they don't. If you love bacon, come here, breakfast and lunch sandos, plus flights of bacon.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "Great breakfast sandwich, best I can remember.  Easy, casual and quick.", "author": "Ian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "I ordered the LGBT and was not too pleased with the result,  it was lacking in the  bacon department. Thank bacon  my bf ordered \"the bird\" and it was so delicious we will definitely be going back to try more items.", "author": "Monique H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "Absolutely love this place!\n\nThe breakfast sandwich is incredible: the mixture of egg, bacon, cheese and whatever awesomeness they use for the bun consistently delivers a melt-in-the-mouth taste that is really hard to beat anywhere else.\n\nThe staff is super friendly and welcoming as well with fast service.\n\nIf you are in a hurry for a quick and delicious breakfast (or even if you are not in a hurry), this is the place to go.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-09", "description": "how in heck did I just find you? You are delicious, I got the cobb salad which has bacon and pork belly in it, and oh man I'm in love with my taste buds right now. This place is excellent, great service, and next time I'm trying those PORKY FRIES!", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "You can search for the truck around town or just walk right into the kitchen on Frederick. Flights of bacon are awesome. Some unique creations, but we tend to resort back to old faithful... original, w/ a drizzle maple syrup. Want more than a snack? Bacon fried chicken sandwich covered in slaw will satisfy. Hit up Tacos on Tuesdays too.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "I have had a serious change of heart in regards to the Bacon Bacon location on Frederick, everything I mentioned in my hateful review before has changed! The menu no longer has five items only, and the coffee actually tastes like coffee, and the biggest difference is the customer service! They are actually HAPPY to see you and make you food (which has greatly improved)! In the end, I am very happy and excited to see this little neighborhood joint improving :)", "author": "Kelsea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "Bacon is hot right now. It's an Internet meme; it's a running joke; a favorite morning side dish; a sandwich accoutrement and all around preferred flavor. It makes sense then, that someone somewhere would devise an entire food service around the concept of bacon. Bacon Bacon does not disappoint, with its succulent, satisfying meals, which, while all incorporating some bacon, are essentially quality deli market food with hearty ingredients and an inviting atmosphere to the establishment.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-26", "description": "I stumbled across this while looking for vegetarian friendly restaurants.\n\nThis is NOT for vegetarians by any means. As soon as you walk through the door, your senses are blasted with the aroma of delicious bacon. I was taken aback by the lack of seating in the establishment (I remember 4 stools in the entire seating area)\n\nI had ordered the Hot Italian, and while it does not have any bacon strips in it. The sandwich itself was quite delicious with a generous serving of pork belly layered inside. On top of that, I had an order of pork belly fries. While the pork belly was indeed tasty and seasoned the fries just perfectly. The fries, themselves, seemed a tad stale.\n\nMy friend, on the other hand, ordered the Free Bird, which she complained was too dry and the bacon-fried bird lacked any taste of bacon.\n\nPerhaps it was an off day for them or the fact that we did not order anything with a pure strip of bacon.\n\nI am still intrigued to try other items on their menu, but in due time.", "author": "Jason N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-20", "description": "Bacon, bacon I am a fan.  I had the new chicken and bacon sandwich today...quite yummy but my favorite is still the bacon jam on the bacon scone!", "author": "lisa g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-21", "description": "I don't know who writes some of these reviews, but know one thing:  If you only \"like\" bacon you'll love this place.  However, if, like me, you love bacon it IS Nirvana!  And the friendly staff and ambiance are akin to having friends who let you eat the best bacon stuff right there on the premises!", "author": "David C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "Bought a burger from their food truck and found out that the bun has mold on it. YUCK. Stay AWAY!", "author": "D Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Holy Cow!\n\nDropped in for lunch on Friday 3/1 and got the burger.  I can say that it is the best burger I have had in a long time.\n\nI am not a regular but have been here a few times and everything I have tried has been really good.  Last time was the grilled cheese. Yum!  Oh, and I had these french fries with meat on them.  Way too much to eat at once but really good.\n\nStaff is always friendly and I get in after the normal lunch rush so I can either stand or sit at the window counter.\n\nCan't wait for the truck to be up and running!", "author": "Todd S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-16", "description": "heard on the news today that the neighborhood has rallied to get this place closed down due to the bacon smell.  wtf?  right, because the stench of piss and vomit wafting up from the haight ashbury is sooo much more appealing.  rock on bacon bacon!!  crash and burn ashbury yuppies!!!", "author": "howdy d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "You had me at 'bacon'. Anyone that DOESN'T give this place 5 stars must be a damn vegetarian.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "breakfast burrito. so heavy. so delicious. porky awesome. would pass on the coffee next time, but there will definitely be a next time.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "OHHHHH MAAAAAN! After a long drive from LA, my girlfriend and I were on the search  for a place to grab breakfast.  While the line at Mama's was incredibly long, we just decided to come here. First of all, they did not disappoint with the food! The breakfast sandwich and burrito were AMAZING! Although I preferred the sandwich over the burrito. Way better than EGGSLUT in my book!", "author": "Frank H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "stopped by for a breakfast burrito before going camping, and it was bomb. it's a large breakfast burrito full of tons of pork should meat. Very filling and satisfying. My boyfriend got the breakfast sando, which was also worth buying.", "author": "Katherine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Likely the best breakfast sandwich in the history of the breakfast sandwich. Loved the almost veggie one (yes, it has bacon). Others had the regular breakfast sandwich with bacon jam (think pulled pork BBQ) and the burger. The 2-patty cheese burger with bacon and grilled onions was quite something. Delicious.", "author": "Margaret B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "I was staying with a friend who lives near Buena Vista park and was lucky to find this place for a late breakfast/lunch. I had the bahn mi one day and went back for the breakfast burrito the next. Both came out fast and were fantastic. Combine great food with great prices and super friendly staff and you've got a winner. Thanks Bacon Bacon, for keeping it real and knowing what it's all about.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "Got lucky and arrived in time with no line, by the time our food came out the place was packed.  That was a big bonus.  We ordered the BBQ Pulled pork sandwich and the breakfast burrito, side of porky fries.  The sandwich was packed with three styles of pork, pulled, belly, and bacon.  The sauce was on the sweet side.  The roll nothing special but I didn't feel it was grocery store quality either.  Not the best pulled pork I've ever had, but definitely up there.  The breakfast burrito was very good.  Eggs nice and hot. Needed more avocado, would have paid more if I knew there would be so little.  The side of porky fries was ok, really the reason I couldn't stretch the review to be a five star, that and each item was good but not the best ever.  The fries were nice and crispy, but not enough of them.  The pork thrown in was a good sampling, but nothing really stood out.  Next time I'll just order the regular fries because I probably will get enough pork on the other menu items.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-24", "description": "This place is awesome.   We stop by the Frederick storefront as frequently as we can on weekends and are SO glad they're now open on Sundays!  Note - it's not always super easy to find parking around there, as it's smack in the middle of a residential neighborhood, but whatever - hop on the N line, take a bus, or circle the block because IT'S WORTH IT!   I'm a huge fan of the breakfast sandwich, which is an egg over easy with cheddar cheese, lots of delicious, thick-cut bacon, and bacon jam on the most delicious roll!   Never a fan of runny eggs, I order mine with scrambled and they have always been happy to oblige.   Bacon jam sounded weird at first, and admittedly, I did order the sandwich once without it, but never again.  It totally pulls the sandwich together and is delicious!     Otherwise, the bacon cheddar scone is also really good.  If you're a bacon connoisseur, you would probably enjoy the bacon bouquet, which is just a bunch of bacon, wrapped up together, ready to eat. :)   I have yet to go there for lunch, but the menu looks divine so it's on my list.  The storefront is teeny tiny, but there are stools and there's room to eat at the countertops.   It's not uncommon to see people standing outside with their friends, kids, and/or pups enjoying a delicious sandwich.   The staff are super friendly and overall, it's just a great experience.  Check it out!", "author": "Amy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-30", "description": "OMG...I will never come here again...I've never had a Burger so dry and tasteless in my life, the Bacon had no flavor, the Arnold Palmer was tart,  my fries were ugly with a few flakes of parmesan and diced onions all for the low price of $14.00, never ever again, plus my coworker ordered the Vietnamese sandwich that had not shedded pork but a pork pattie that looked like cooked spam,lol disgusting, I've been belching up grilled onions all day!!!!", "author": "anita b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "if you're going to eat bacon why go to a place called 'sweet maple' on the other side of geary if you can stay in the haight and eat at a place called 'bacon bacon' seems logical but i practically came to blows with my companion that day who couldn't get clear in their heads what 'the other side of geary' meant.  anyway we kissed and made up and found parking right in front and walked into a relatively quiet restaurant at that odd hour around 1030am.  i got the brisket my friend got the meatloaf (with a 15 min wait so you know it was fresh fresh fresh) and it was yummy i have to tell you...my mother said if you can't cook and you choose to cook...wrap whatever comes out of the oven in bacon and they will love it...and this place does all that and doesn't even have too both the brisket and the meatloaf could stand alone but i say bring it on anyway what can it hurt.  Kim was behind the counter and she was all that answering questions and showing us the ropes this is one of those high tech places and I'm getting the hang of them and i like it especially when someone like Kim is there to show you how to touch the screen to pay the bill to collect the food while popping the fanta's non twist-able and showing us how the takeaway boxes work...she was very very smart and a big part of us having so much fun.   thanks Kim!", "author": "tom l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "Bacon Bacon is a local treasure.  Delicious food, nice folks, great senses of humor.  Hopefully they'll get their truck running again soon but in the meantime stop by their storefront if you're in the area - yummy sandwiches, great bacon, everything I've tried so far has been wonderful!", "author": "D W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "Favorite spot in the neighborhood.  Get my morning coffee here and greasy breakfast food for my weekend hangovers.  The burger, breakfast burrito and porky fries are delicious!", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Bacon Bacon's web-presence via Yelp, Facebook, Twitter, the establishment's actual site, and other media outlets provide a body of messages and reviews that are not entirely on the same page. The questions raised by their virtual persona warrant further investigation. First and foremost, one might wonder how a restaurant survives in the organic/vegetarian/vegan obsessed food culture of San Francisco with a menu that is made up entirely of pork-based dishes. To answer this query, an initial introduction is provided by the company's website, baconbaonsf.com, where the clean and quirky aesthetic suggests a sensitivity to a design oriented market as well as their location in the famous Haight/Ashbury neighborhood. Based on these queues, an interested patron may guess that Bacon Bacon is more aligned with serving up novelty rather than just a greasy comfort food. The company's roots in the food truck tradition, where contradicting dishes, such as a pad-thai taco, might draw hordes of hungry diners, further re-enforces this deduction. Upon visiting Bacon Bacon at their physical space, customers are greeted with a boutique café, more hip coffee shop than gritty BBQ joint. The food it's self is very much in keeping with the image provided by the company. Although some reviewers suggest the fare is underwhelming, it is more accurate to describe the food as simple. According to general consensus, the dishes taste fresh and straightforward with the creative inclusion of some bacon-related feature to provide the restaurant's signature flair.  That is to say every aspect, from the warm maple-bacon scone, to the dainty track lighting, to the clean and simple website, ensures the entire experience provided by Bacon Bacon is satisfyingly cohesive.", "author": "Matthan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Terrific bacon.  Bad scones.  Like lead. Inedible.  Go for the bacon.", "author": "Yella W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-21", "description": "wow, what a great sandwich. i got the chicken fried bacon turkey one with cole slaw . just a very nice experience. i highly recommend\n supporting this business, they are quality.", "author": "molly d."}
