{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "Mediocre food. Coconut soup (tom kha) extremely bland and flavorless. Veg eggrolls were soggy in the inside and crispy in the out. The only thing I enjoyed was the thai iced tea.  Glad they at least knew how to make that tasty.   Don't think I'd come back.. unless iws in the area and wanted their tea. \n\nHappy eating", "author": "Tru T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-12", "description": "We got pad Thai wid chicken and chicken satay. Food was greasy, small quantity and not fresh. Sweet flavor was overpowering in pad Thai. Would not recommend this place.", "author": "Nidhi D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-12", "description": "We ended up at Banana House, because when we got to our first choice restaurant, it was closed. Granted it was Labor Day, so that is to be expected, but luckily Banana House was open. They greeted us at the door and were very friendly and attentive. We shared the Pad Thai with chicken and upgraded to a combo which comes with a salad, rice and egg roll. Then I added peanut sauce, because I like to dip things in there. The portion was generous enough for us to share, and we pretty much finished off the plate. The Pad thai had a good taste, but was not spicy. We could have added more heat, but ended up incorporating the peanut sauce, which was delish. The peanut sauce had a smooth consistency but packed a good peanut flavor. The egg roll was tasty too. Overall it was a good place to stop by for lunch.", "author": "Sandra V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-07", "description": "I ordered the tofu pad Thai and mango sticky rice. The service was great, but the food was mediocre and restaurant is pretty run down.", "author": "Mallory S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-02", "description": "This place sucks.  I walk in at 8:35 and they said we close at 9 And I said that's OK I will be out of here by then and they were like no we don't want to serve you and then they were just completely rude after that I would not go here ever ever again I highly recommend you go anywhere else", "author": "Steve N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "This place wasn't awful but man, it sure wasn't great. The only thing that was nice about it was that it was walking distance from where my mom and I were staying. We had walked over 7 miles that day and my mom didn't want to hoof it too much more for dinner.\n\nWe ordered a stir-fry dish and a curry and DAMN that food was spicy! I grew up on spicy food and my mom is Vietnamese and adds jalapeños and chili paste to everything and we were struggling.\n\nTwo other things that stick out was the rice was old (it had crusty hardened grains) and when I ordered regular hot tea, the water wasn't even hot. I saw they just put tap water in a cup and microwaved it.", "author": "Jasmyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "I get pad Thai here for lunch pretty regularly. It always tastes good, the service is great and efficient and it's generally very convenient. I haven't dined in here, but as a pick up and go lunch option it's really good.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "Bad service, did not get an order started till 20 min later. Did not like the food taste like frozen food. Definitely not coming back", "author": "Christina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "Sometimes a few simple words best describe an experience at a restaurant. I think this is the case with this one. \n\nLet's try it. \n\n- Impersonal: You are just a bag of money to these people. They won't smile at you, won't recommend anything, don't appear to enjoy their job much. \n\n- Pushy: You can't really have a conversation with your friends or colleagues because they want you in and it as soon as possible. This means throwing the check at you as soon as you are halfway through your meal and constantly hovering waiting for you to leave. \n\n- Overpriced: yes, this place is in a great spot for work lunches or tourists near Union Sq. Area. Still doesn't mean you need to come. The food is OK, depending on what you get. Chicken is dry, usually, and the noodles are super oily. For that, you pay 3x what you should. \n\nOne more word. \n\n- Skip.", "author": "R. B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-21", "description": "This place was not worth the money.. $12 per plate with portion sizes that can probably not make you very full... I ordered the a banana house special (or something like that) and a pad Thai. They are both stir fried noodles with one being a thick flat noodle and the other a thinner noodle. The banana boat house special was abundant in vegetables but it was way too oily. The pad Thai didn't really taste authentic and definitely did not taste like the pad Thai I'm used to eating.. \n\nI don't think I would come back here mainly because of the price and the quality of the food that I'm paying for.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "This is a decent choice if you're craving thai food in the Fidi. It was fairly busy when I visited around 12:30. Plenty of seating, good spot to grab lunch with a coworker.\n\nI ordered the yellow chicken curry through MealPal, and while the flavor and spice level was on point, the carrots and onions were really underdone and few and far between.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "Same experience as others on here, except I may have got food poison.. \n\n  The menu said parties of 5 or more would get gratuity added in automatically, yet our party of four did as well. We almost double tipped but caught it.\n\n  Here I am the next day in my hotel hurting bad in the stomach. I got the green curry, and had to pay extra for white rice (really??) The rest of the table did like thier meals however, but we we're all famished.\n\n The cups with what I assume was tap water were very dirty. A woman was cutting Basil at a table behind. The whole place is dirty.  Thier cute sign is all they got going for them.  For shame.", "author": "Sign S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "Ample seating in a seemingly small restaurant- they have another floor downstairs that they seated us in for our party of 6. Service is quick, food comes out pretty fast. \n\nTried both their Pad Thai and Pad See Ew. They were ok - pad see ew here is a little sweeter than what I'm used to. We also ordered spring rolls for the table, which was not what we expected! Came in two big pieces with tofu, lettuce, other vegetables... the wrap wasn't in the clear rice paper that I usually imagine spring rolls to be in. \n\nOverall, I would say that Banana house is a convenient restaurant to get your quick Thai fix. Since service is fast, this place would be ideal for a lunch break or even just a quick meal while walking around town.", "author": "Esther K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "Had Panang Curry with brown rice. The curry was spicy, with lots of veggies and tofu. And avocado as well. I loved it. The service was quick and usually there's no wait time. A lot of Thai places add too much ice which dilutes the Thai Ice Tea. This place had just perfect.", "author": "Shreyans M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-15", "description": "Pretty small portion of Thom Kha coconut soup. Veggies didn't taste very fresh nor did the tofu. Considered sending it back but was pressed for time at lunch so ate It begrudgingly.", "author": "Jose U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "This place saved me because I was majorly hypoglycemic prior to finding it. I agree, it's expensive - $12 + tax for my chicken pad Thai. It was a tad too sweet but it was made to order and came steaming hot with lots of chicken. It made me smile to eat in the corner window seat by myself and gaze at L&L Hawaiian Drive-inn across the street, because I am from Hawaii.", "author": "KJ N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-09", "description": "This review is for the dessert that I had - the mango sticky rice - and the experience in the restaurant itself. I always have super high expectations for desserts since I have such a large sweet tooth, but I typically raise my expectations for any mango dessert because... well mangoes are amazing and are my absolute favorite fruit!\n\nAll in all, this mango sticky rice wouldn't be something that I would pay for again. Maybe if they decreased the price (I honestly expected a bill of $4-5 max for a dish that small, but I was charged almost $8 not including tip!). My main issue with this dessert is the price though. The actual dish tasted fine - mangoes were sweet, even though it was a small portion size, and the sticky rice was perfectly cooked and had a really nice marriage with the coconut milk that it was mixed with. Again, I have to stress the fact that the small portion size and the fact that the dish wasn't THAT extraordinary made me think that it was not worth the price that I paid. \n\nIn terms of the restaurant experience, it wasn't bad. Servers were prompt and polite, though not the friendliest group. There's lots of seating in the restaurant, so I'd expect there not to be a huge wait at any time.\n\nOverall, there just wasn't super memorable about my experience at Banana House. I guess I'll have to try the savory foods at some point to make a more informed impression of the restaurant in the future...", "author": "Sheila D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-11", "description": "Sorry, this place used to be pretty good, back when it had the hot table for lunch. Those days are long gone, and now after several experiences of waiting way too long for to-go orders, amounting to $12+ for rather small, unexciting portions, I'm not going back.", "author": "Wayne Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "Not a repeat.  Overpriced, small portions, and food not so good.\n\nWaitress soft spoken and that gives them 3 stars.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-21", "description": "Came here for lunch at noon. Come here before noon to get seated if you're rushing back to work.\n\nComparable with Vanda Thai Restaurant on Sacramento Street.\n\nHad tom yum soup with shrimp and pad kee mao with beef.\n\nIf you need to eat within an hour and get back to work, this will suit your needs. Again, it does the trick of getting you full for lunch! \n\nTom yum soup had a smoker flavor more than the usual sourness. Lots of mushrooms and the shrimp was a good addition.\n\nPad kee mao had enough noodles. I'm glad because other restaurants tend to add more veggies than noodles and protein.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Hole in the wall place for sure. But the pad Thai was lit (flavorful). Customer service was great! Food was served quickly and my water was refilled promptly.", "author": "Alexa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "The food is good, and authentic Thai food (my favorite)!! Only thing is the bad customer service, they are rude and unprofessional. I feel like I am inconveniencing them by grabbing lunch from them. It is not a culture issue, even tho they make me feel like they are discriminating me. I had my 4th unpleasant encounter with the man at the register today, and I have decided to look for an alternative near work. I cannot subject myself to having this unpleasant feeling while eating my lunch. You have to feel good when you pick up lunch, you have to make more effort to make your patrons feel good about spending money on your establishment.", "author": "LoveAlways J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-20", "description": "The food was decent. I think the value is very low. 11 for pad Thai and for most basic dishes? No thanks. I know this is the fidi, but the food isn't amazing, the decor and ambiance are bad and non existent.  $8 might work, but $11 plus tax, plus the health tax, plus tip puts you in the $14 range for simple non- fancy dishes. Nothing fancy in the plating and crammed very close to other diners.\n\nNot something I'll be back to anytime soon and definitely not a go to place. \n\nI don't like to bash places, I just think the prices are too high and what you get in food and experience just isn't worth it.  Sorry.", "author": "Ty C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "3.5\n\nATMOSPHERE:\nVery quiet when I came. It was a little after lunch, so I assumed people went back to work. I was seated in a small table in the corner since it was just me.\n\nFOOD:\nI ordered the red curry which came with rice and salad and it was on point! The spiciness was perfect and there was enough meat that came with the curry. Usually, the problem I've faced with this was that there wasn't enough meat.\n\nCUSTOMER SERVICE:\nIt was on point. I would assume since I was one of the very few patrons in the restaurant. My waitress was nice and seemed like she knew very little English. However, this did not deter her from helping me out by answering all my questions.\n\nI also find it a little amusing that they charge people to use the bathrooms for $2 haha.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "I absolutely love this place if you're looking for authentic Thai food this is the best spot. This place is also very convenient and fast. The people that work here are very friendly as well. I had the spaghetti kee mao with chicken if you're looking for something a little spicy. All in all I would give this place a 10/10. I would love to come back here again!", "author": "Kathy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "this is my goto Thai place for lunch.  Great yellow curry.", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-27", "description": "Recently I had the chance to go to Banana House during the lunch hour, it is definitely a very small space but luckily the seating was fast. My friend and I ordered our food and the food was decent.\n\nThe reason I am giving Banana House 1 star is because of the quick service however, when my friend and I paid for the bill with card and left a zero on the tip line we were attacked by staff with complete unprofessionalism (name-calling), attitude, and were asked to leave because we didn't leave a tip, which I believe was not the appropriate way to a approach the situation. \n\n-Normally I leave cash tips, not tips on my card.\n\nAdvice to peeps- if you plan on eating here don't expect above and beyond service but expect to leave a tip for it anyway.", "author": "Jocelyn P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "The Thai food is good but I don't feel the meal is a good value.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-15", "description": "This place definitely isn't great. There are many better thai restaurants featured out here in San Francisco. The Pad Thai was gummy, and the Thai Ice Tea was AWFUL. It left an awful chemical taste coated throughout my entire mouth, and the restaurant isn't very clean to begin with.\n\nCheck out Kin Khao nearby, or another spot. Your money is spent better elsewhere!", "author": "Anders Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-28", "description": "It's a solid three stars. I personally add one more star since it's right next to my office and they were fast. I had chicken pad thai, which was good. I might consider returning when I need a pad thai fix that's convenient but not something that stood out to me.", "author": "Rose R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "I popped into Banana House in the middle of a weekday lunch rush.  I've had this place, along with several other Belden Place establishments, bookmarked for months.  Although they were busy, I was determined to tough it out and try their lunch takeout. \n\nFirst of all, they are available on the Eat24 app.  Yay!  I'm a big fan of punching in an order and having it delivered or ready for pickup.  (Next time I'll remember this!)  The takeout ordering area is pretty much non-existent, so online/app ordering is certainly the way to go.  After I placed my order I stood outside to make way for dining room patrons.  There really isn't a waiting area option here.\n\nMy order was taken promptly and my takeout order popped up in about 7 minutes.  \n\nWhile I waited, I watched the line chefs and wait staff frantically buzz about.  These folks are quick and on the ball!  I did overhear a frazzled single dining-in customer complain about slow service and other takeout customer complain about long wait times.  Personally, I wasn't in a rush, so I found the entire process to be fair.  \n\nI went with #31 with chicken, param with steamed chicken, broccoli, and carrots.  The peanut sauce was packed alongside rice (choice between brown or white) and a small salad.  The sauce was excellent and the steamed meal was even better.  In an area filled with authentic speedy Asian food it was such a welcome relief to find a mean that wasn't fried, drenched in oil, or overly heavy.  The tiny salad on the side was a nice touch.\n\nI will certainly be back for pad see ew, curry, papaya salad, and pad thai.  I peeked at several plates in the dining room while I waited and they look excellent!\n\nFinal verdict:  Don't let the hole-in-the-wall facade fool you-- this place is legit!", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "They charge $2 for non paying customers to use the restroom so I decided to buy the mango sticky rice. It was good. Everyone was polite.", "author": "Neda O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-21", "description": "Pretty tasty pad see ew with tofu but is it worth $13.05? You'll definitely find Fidi price here. I'll think twice about coming here for this reason.", "author": "Jing D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-21", "description": "This place is awful. The tom yum soup broth is decent, but the vegetables in it were bland and scarce. The fresh rolls (pictured) were almost inedible, and the sauces they came with were even worse (a sickeningly sweet plum based thing and an overpowering peanut concoction)! \n\nI paid $20 for these two unfortunate snacks and regret every cent. Avoid at all costs.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "The place was not clean and tidy. And the water didn't look like it was safe to drink. No, seriously don't drink it. But the food. Specifically the in-house Banana House duck noodles was perfection. Cannot really put it in words, it was sooo good.", "author": "Ganesh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "The Banana House, what a strange name for a Thai place! I was walking by and I slipped in, for a little late afternoon meal! The place was pretty empty around 1:45pm on a Sunday, only one other customer and a few pick up orders! \nThe service was great, speedy and I was in and out the door in 20 minutes! \n\nThe Yellow Curry was really good, maybe not spicy enough for some but I thought the flavor was pretty spot on. The tofu was the perfect amount of crispy friend goodness! Not many veggies here, but the potatoes hit the spot! \n\nI do dig that they offer you steamed white or brown rice, and that I was in and out the door so fast! Heck I'm in San Fran I got stuff to do, and it much better to do on a tummy full of thai!  In other words slip in sometime.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "My friends and I decided to go here and eat since we saw it on our way to Plentea (I also reviewed Plentea). Banana House is a pretty small to medium sized restaurant.\nAmbience: Pretty much like any authentic Asian-like restaurant. It's nothing extremely fancy but it's not super dirty either. It's just in between.\nService: The lady was very kind. There was not that much interaction besides the occasional \"how are things?\" and \"would you like more water?\".\nFood: We had ordered the Fresh Spring Rolls, Pad Thai (tofu), and Green Curry (chicken). Let me just say that everything was absolutely delicious. I've never tried a Thai Spring roll and it was really good. The flavoring of the Pad Thai was tasty and the green curry was pretty spicy but the spices and flavoring of it all was yummy.\nOverall: I enjoyed this place a lot.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "This one of the dozens of places on Kearny and thereabouts that earn their profits on the lunch rush.\nAs far as the basics go it's good verging on great. The fried rice with tofu is awesome as is the thai style tea and coffee. It's hard to go wrong with pad thai. \nI've never had any issues with the service, even during peak rush, and I've always had great meal experiences. \nThis place is totally on my lunch rotation.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Delicious food. Great prices. We shared 6 dishes and loved them all. Service was great. The coconut mango desert was to die for.", "author": "Paras B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-09", "description": "I spend twenty dollars which was not cheap for the simple lunch but the quality of food was far less than the price I've paid for it.  The spicy cat fish wasn't that fish dish because there was only a few tiny pieces of fish and rest of them are plain vegi.  Everything was below expectation and nothing special.  I wonder how this place can sustain in the future.\nI will pass it next time.", "author": "Piano B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-04", "description": "Staff was very polite and helpful. Very cramped place so get cozy!\n\n$9 for a red curry with chicken. It was very small... One scoop of rice, one ladle of curry and a small scoop of salad. Curry is ok. Mildly spicy. A lot of oil though... Chicken was well made and not dry. Still prefer Osha's curry. I might come back to try other dishes on the menu.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-07", "description": "We just ordered lunch for 16 people to be delivered to our work. I asked them for menu to show my coworkers and choose what to order. They gave me the printed version which appeared to have an old prices. When they called me with the total price - I decided to come there and ask why it it about $20-$25 more than suppose to be- the answer was -We have a different price now    but gave you the old printout. No apologies- just told me- we can cancel your order if you want. Do they think- we will ever go there again.\nIf I read people review- I will not go there and would order lunch at the other place", "author": "Lyuba S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "Food taste okay. Not bad but portions were tiny. Like super tiny for $12. Service was slow. Attitude when asked for extra plates and forks. Only Thai restaurant where I work. My only options so I will be going back but not any time soon.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-26", "description": "I don't usually write reviews but this place sucked! I ordered Pad Thai with beef and it came out with 5 pieces of beef and when I paid them tip according to the service I got the manager comes and and tells me you're only tipping x amount, and asked me to tip more. I'm never going to go there again. Shitty service and shitty management.", "author": "Iyvin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-06", "description": "I had been on a long walking tour of Chinatown, and in the afternoon was making my way back around to Union Square when I started looking for a place to eat. Preferably a quiet place, but not empty, and with seating. This was the place, and the fact that it was Thai I considered a bonus.  \n  \nThere was one other customer inside, at a window table. He was a middle-aged businessman, engaged more with his phone than anything else.  He left before he finished. It seemed like a work-day kind of place, unpretentious. Un-touristy.  \n  \nThe menu was printed in plain text on a white laminated sheet. Numbers next to the names of the dishes. I was offered a cup of ice water. There was no beer. I ordered #35 Pad Kra Pao (ground chicken in spicy garlic sauce with beans, onions, bell peppers, basil) because I wanted a meat dish, and I was looking for some inspiration for what to do with ground chicken at home.  \n  \nMy phone battery was dipping so I mostly watched the traffic go by while I waited. Nobody else came in during my visit and the staff talked among themselves while the cook worked. The street is interesting, short buildings with tall office towers rising behind them from the other side of the block. An adequate supply of pigeons.  \n  \nThe food arrived shortly. The ground chicken with vegetables were in a small bowl with the sauce, and a mound of rice was presented on another dish. I pressed down the mound and added the pad kra pao to it for each bite, and found it a satisfying meal. The sauce was delicious, I wanted more before I was done. At length I ordered a Coke to supplement, and it was served as an unopened can with a cup of ice.  \n  \nOverall I had a good experience here. The menu had something that interested me, it wasn't too busy, and although the presentation was basic, it advertised itself as Thai food, and it tasted like Thai food. I got the feeling there might be a restaurant in Thailand that would not be too dissimilar to this one. Just a regular place, but authentic.  \n  \nAs to the food safety advisory, I noticed a carton of half and half sitting out the entire time (maybe 40 mins). I had no problems myself.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-11", "description": "They served me raw chicken. If i get sick in the next few days you know where i got it from. Their meat smells old.  Never again.", "author": "Jorydude r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "Good chicken yellow curry. salad and egg roll and thai iced tea combo was $13.50 plus tax. A little pricier than Thai Noodle House on O'Farroll street. They charge $2 to use the bathroom for non customers. Again the food and service were good!", "author": "Ben L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-13", "description": "it's pretty hard to find a decent price thai restaurant in the financial district since almost everything is overpriced. i ordered the beef pad thai here because i love eating pad thai. it was just okay tasting, nothing special. but then again, most restaurants in the financial district aren't that great. there are definitely better thai restaurants in the city. my pad thai was a bit spicy. whenever i order pad thai at other thai restaurants, it isn't usually spicy :/ (i'm not a spicy eater)  this place gets pretty packed during lunch time on weekdays. there's lot of seating and there's outdoor seating too.", "author": "Sylvia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-08", "description": "I came here for lunch with my sister kind of by default because we're still scoping out new eats now that her office building has moved locations. She had been here before with coworkers, so I figured it would be an easy standby. I ordered the papaya salad and my sister got the pineapple fried rice. My sister finished her meal easily and mine was pretty satisfying. My serving was decently sized (luckily I wasn't too hungry anyways) and came with a few large shrimp. It was nicely dressed and crisp to perfection.\n\nThey have a counter with food in hot trays for quick and easy takeout (for that hardworking crowd that can barely step out of the office for lunch). The dining area itself is definitely no frills and I probably wouldn't have tried this place if it weren't for my sister's suggestion.\n\nIt was decently priced and the food was solid. I may come back, but there's definitely plenty of other places to try in the area.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "We stopped by this Thai restaurant for lunch while walking around Chinatown today. We came in around 1:30 PM and found the place to be about half full so we were seated fairly quickly.\n\nI ordered the Pad Kra Pao (ground chicken in spicy garlic sauce with beans, onions, bell peppers, basil) and my girlfriend ordered the Pad Thai. \n\nThe Pad Kra Pao was delicious! The meat was well cooked and it was full of flavor. Dish also came with a salad (eh, basically lettuce with vinaigrette) and white rice. The rice perfectly complimented the stir fried ground chicken and vegetables!\n\nThe pad Thai that my girlfriend got was also really good. They threw in extra vegetables for her which was nice since she didn't want any of the protein options. They had just the right amount of all of the ingredients, but maybe could've used a little more flavoring. \n\nThe only con I would note is that the service was not great. We had to ask multiple times for chopsticks and straws for our drinks. The waitresses did not seem as attentive, but this was honesty not a big deal.\n\nOverall we left with empty plates and full bellies!", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "We went out for lunch during primetime and were met with long lines just about everywhere. My buddy had eaten at Banana House before, and mentioned that while they looked full, they also had a secret downstairs area, so we were able to get right in. I was absolutely starving, so I got a combo, which was an egg roll, small salad, thai iced tea, and green curry chicken. It had just the right amount of spice for me- a little kick but it didn't leave me crying. Service was slow but they were very crowded, so that's to be expected. Lunch was about $20 for me with tax and tip. I'd definitely come back here.", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-22", "description": "Came here for lunch with my coworkers and since we had a large group (party of 7), we got a table in the basement. I had the duck curry with brown rice which was decent, although the coconut juice left much to be desired. \n\nService was fast and efficient. They provide free soup for lunch.\n\nDecent spot for lunch, although slightly on the pricier side with no lunch specials menu.", "author": "Christina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "Pretty good Thai place on Kearny, Banana House offers food I usually crave for dinner at lunchtime. The restaurant is cute: white table clothes atop little tables, wood walls, big windows. The wait staff is nice, fast, and attentive.\n\nI get the lunch special Green Chicken Curry and my friend gets the Duck Curry, both are very good and filling. The meal starts off with a small cabbage soup, then comes your plate with salad, brown or white rice, and your main dish, full of bell peppers, tender chicken, green curry sauce, eggplant, and basil. They have chopped peanuts, chili peppers, and hot sauce to add kick to your dish. I like to add a little hot sauce to the cabbage soup since it's kind of mild and bland.\n\nKnocked off one star because it's a little pricey for an Asian-style lunch special (I'm used to $6-$8 for lunch spesh): around $11 per meal, but since the food is good and likely healthier than getting a sandwich or pizza, it's a go-to spot for me. Lunch takes around 20 minutes or so once you're sitting down, so plan accordingly if you're like me and have a measly half hour for lunch.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-23", "description": "I've been here a couple times. The first time I had pad thai and it was really good. The second time I went for their thai iced tea to go. She filled the WHOLE cup with ice and just a small amount of tea. I asked for less ice, and she said it'd be 50 cents more. Kinda ridiculous. The service here has been pretty unfriendly.", "author": "Madeleine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "I don't know why Banana House only has 3 stars, I've been coming here since I worked in the Financial District and I've never had an issue with them. They're always really nice to me and make sure I have everything I need.\n\nI LOVE THEIR MANGO STICKY RICE. Honestly, I could eat it every day and never ever get sick of it. \n\nI love their yellow curry and their chicken satay. Lunch special for around $10 and enough food to have two meals. Yep, I'm happy. \n\nSeriously tho... mango sticky rice.", "author": "Devyn P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-07", "description": "Omg was very bad food. Wings were salty as ever!  We asked for a little spicy and got fire truck hot!! Plate was dirty. You have to put your mouth on a plastic glass as no straws are offered unless you purchased a specialty drink like Thai Iced tea or something. I give this place 1 star!", "author": "Cornelius J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "Totally get the \"poor food safety\" alert that just popped up. Let's just say the cook isn't big on hygiene. That said, the Tom Ka Gai is DELICIOUS. Probably not a place for someone with a weak stomach, but worth a try.", "author": "Darija W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-04", "description": "Just an ok Thai restaurant in fidi. I've been on the lookout for a year now for some good Thai restaurants in the area, but I haven't been very successful. This is one of the only ones I know about and it's not amazing. \n\nI've ordered the pad kee mao, red curry tofu, and basil tofu. The texture of the tofu is pretty good but this food is VERY oily. After eating just half of my meal, I always feel very bloated and kind of sick. The taste is decent but I don't think this is good quality Thai food. The dishes are pretty spicy so beware - ask for mild if you can't tolerate spicy food. Red curry doesn't have any veggies except for bell pepper and even then, there's not a lot of them. I usually expect Thai curry to have a lot of vegetables so I'm not a huge fan of the curry. Pad kee mao and basil tofu are both decent. \n\nSince this is the only Thai place I know of in the area, I guess I'll keep going, but I still be on the lookout for a better place!", "author": "Malika R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-12", "description": "Lunch was packed but the food was disappointing. Chicken Penang curry was bland... Didn't quite taste like curry. The chicken was very dry.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-21", "description": "I never write reviews on Yelp but really wanted to share this since I got food poisoning from here.\n\nAbout 2 weeks ago, I ordered a glass noodle salad here for lunch. As soon as I tasted it, I knew something wasn't right. I even joked and told my co workers that I might have to go home that afternoon after eating it.\n\nBy 6pm that day, I was throwing up in the bathroom. I was sick for the next week and kept waking up with cold sweats in the middle of the night. I felt so sick I couldn't eat any solids and took me a good 2 weeks to recover.\n\nNow that I am finally well enough to type again, I wanted to post this immediately. \n\nThis review is purely to help all of you out there who don't want to get sick. Please do not order the glass noodle salad here and make sure the food you get here won't make you feel sick.", "author": "Eva C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Food was excellent and relatively well-priced for the portions (I barely finished my plate of fried rice). My friends are vegetarians and were both able to find meals that not only fit their dietary restrictions, but were also appetizing. It seems like I came in during an off hour between typical lunch and dinner times, so it was empty but for my party, and so service was quick and attentive without being overbearing. There's lots of space in the restaurant, and overall is a nice small business I was glad to support, and would willingly do so again.", "author": "Gina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-19", "description": "A tiny container of green curry - $11. \nTwo bland pad see ew - $22 \nNot worth it. Will never order from here again.", "author": "CY C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "FOOD\n- Chicken Pad Thai (3 Stars): I love me some Pad Thai, so this is always my default dish to order. I was a little disappointed that you had to pay extra for prawns...it should be included! But they provided an ample amount of chicken and it wasn't dry. Noodles were firm and not squishy. Sauce was sweet with some slight heat. But the sauce wasn't sickenly sweet either, which is a pet peeve of mine. $7.95 for a generous portion (my friend was able to fill a whole take-out box with leftovers). \n- Thai Iced Tea (5 Stars): Finally a place that doesn't dump sugar into your Thai iced tea! I feel like boba places and other restaurants are very heavy handed with the sugar or syrup that is in the teas. I didn't even have to ask this place to half the sugar. It was a perfect combo of tea, milk, sweetener, and ice. A huge glass for only $1.95.\n\nATMOSPHERE\nThis is clearly a busy lunch spot for ppl working downtown. The interior is so-so, but this isn't meant to be a classy restaurant. Yummy food is often found in hole-in-the-wall places!\n\nTOTAL\n3.5 stars overall--nothing really stands out except for the Thai iced tea, but the price is good for the amount of food you're getting.", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-22", "description": "The banana house fried rice was very salty. I had to drink 2 cups of water just to get it down and the cups didn't look very clean", "author": "Nick N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "an aye-okay place to get thai food if you're in the fidi district. i got the pad thai to go, and got it relatively quickly.  decided not to get the thai tea from other reviews, and they didn't have boba.\n\nthe portion was good for what i paid, but there wasn't enough sauce to make it taste as good as normal pad thai.  if i'm craving thai, maybe i will come back. but at this time, it was just an okay meal.", "author": "My An V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-21", "description": "Not much spazzy flavor to Thai cuisine!\n\nMy coworker helped me order up their Pad See Ew while my manager treated us to lunch.  It was bland compared to other Thai restaurants that I have tried of the same dish before! \n\nThey provide a nice dining area to lounge at, but their Thai food isn't up to par!\n\nThey need to spice up their dishes in order for it to be called Thai food!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "I had first come to this place in early January of 2010. I had just landed in SF for my job interview the next day, and was looking for a place to grab a bite before I fall asleep (had just gotten back from india and was really jetlagged!)... I got out of my hotel and randomly walked around town, and somehow ended up in the financial district where i discovered this completely empty restaurant (sunday afternoon in FiDi).. The thai curry was pretty good, and being their only customer, service was fast!\n\nYelp did not have check-in's back then, and I did not really care to remember where I ate. Three years down the line, I suddenly remembered this place, but couldn't, for the life of me, figure out where it was and what it was called. I only vaguely remembered the interiors of this place, but knew absolutely nothing else about it.\n\nWTF Yelp, why can't you get into my head and tell me about the restaurant I am thinking of! Their search team needs to get their act together and index my brain!\n\nAnyways, last week, as I was making my way down to Enjoy Vegetarian in Chinatown, a sudden pang of laziness directed me into the nearest decent-looking restaurant, and lo and behold.. I had finally found it !!!\n\nI consider music and restaurants to be things that people associate memories to, and then irrationally like or dislike based on how their lives were going when they initially encountered it. For example, I really love Rainforest Cafe in Fisherman's Wharf because I had first visited it whilst on an epic vacation with my friends back in 2008. I don't care how bad or overpriced their food might be today, that place will always be one my favorite places in the city because of all the great moments it can remind me of!\n\nSimilarly this place takes my mind outside its current petty worries and tribulations, and make it consider the past 3 years of my life as a whole. As they say, fruit flies like a banana! A lot happens over 3 years, and most of it seems to have been for good! This place will definitely gets 5 stars from me as well as a lot of future check-in's!\n\nTheir yellow thai curry and vegetarian egg rolls are pretty awesome!", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-18", "description": "I went there with my friend who is a vegetarian, there was a male taking our order, we were asking him if we could order a Pad Thai without meat, he was ignoring us and talking to his coworkers. We called him again and he finally came over and yelled out :\"Pad Thai supposed to have meat, I can't make you no meat!\"\nHow mean was he?? Then we said ok it's fine, we go somewhere else and thanked him, but he was in a bad temper and threw his pen on the table! \nI would not go back again!", "author": "Jo L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "Crazy busy during the lunch rush, so everyone ignores you. Ordered 2 things:\n\n1. Thai iced tea, no cream (not a huge fan, prefer it without). Instead, I got one that was 80% cream. Couldn't even taste the tea. Sometimes Thai restaurants give it to me with cream and I let it go. They ran off before I could even protest. I'll take it with some cream, but not that much!\n\n2. Fried tofu with peanut sauce. It's an appetizer, I get that. But he told me it came with peanut sauce and I ordered a little extra just in case. It definitely didn't come with peanut sauce and it came with 8 pieces of tofu. The place I go to in Marin comes with way more for less money.\n\nFor $13+, I'll take a hard pass in the future. As a member of the service industry, I try to not rate 1 stars, but I had to. Unfortunately for the lower-star reviewers for this business, it won't take the advice to heart and make any changes due to the FiDi lunch rush.", "author": "Brituhknee S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-26", "description": "I knew I shouldn't have ignored the 3-stars on yelp.\n\nEnded up coming here for lunch with coworkers because the curry place next door was closed. I was very skeptical of the 3-star reviews but my coworkers wanted to give it a shot.\n\nFirst of all their setup for ordering takeout is terrible. Everyone's just waiting at the very narrow entrance and it's cramped. While ordering, my coworker tried to add on additional spring rolls, and got straight up denied: \"We're very busy now and have bad communication with the kitchen so we can't add more spring rolls.\" WTF does that even mean? Why did he get denied food??\n\nAfter I received my food, I asked for hot sauce and received one container filled with it. I realized my coworkers didn't get any to go so I asked for two more, and was told that would cost me 50 cents. WTF? Did you just charge me for hot sauce that you can eat as much as you want at the restaurant? I told the lady it was for my coworkers and not all for me, so she didn't end up charging me.\n\nSo now we're eating and a few bites into my pad thai I find a super long piece of hair. Disgusting.\n\nNobody was satisfied with the food either. All in all a terrible experience and you shouldn't waste your money here.", "author": "J. D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-25", "description": "Decent Thai food with quick service and tables. It gets noisy with all the small conversations going on. I ordered the pad see ew noodles and cousin got the pad Thai. We both thought they were tasty. Portions were ample for lunch. It's not the best Thai food I've eaten and it's not the worst either - a solid 3. The Thai iced tea was a little watered down. I typically go to Osha but I like supporting small business so I will start coming here more when I am on Kearny street.", "author": "Bebe W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Walking back from China town, we happen to stumble upon this inconspicuous Thai restaurant. You're not going to ever stop me from going into a Thai place. It was decent inside, standard decor, but I'm ready for the fare.\n\nWe started with their spring rolls, which were very different from any other place. The texture was similar to an a Filipino Lumpia, very crepe like. It was surprising, to get that instead of the traditional fried or fresh rice noodle wrap. I had a bite of the pad thai, which was good, rich in flavor and having it's own unique touch from this place.\n\nHowever, I concentrated on the dish Traffic Jam. It's a dish that has all three curry styles; regular, red, and green.  What's wonderful about this dish is that you can literally go from one curry flavor to another and each time refresh your pallet with an amazing new flavor. It's genius! One minute, I thought green was my favorite, then it was red. Amazingly confusing to have them side by side like that. For several bites, I was loving the green, it's a little sweeter and tart compared to the other two, but when I switched back to red, I'm sold, throw in the towel, I'm a red curry kind of guy. This was so much fun to eat. The regular curry flavor was my least favorite, that's not to say it wasn't good, just not my favorite compared to red. I would certainly get this if you want to have fun eating and playing around with flavors.", "author": "Randy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "low life garbage - they ripped m e off - i ordered a plate and told them please add vegetables- she did not add anything and charged me 16.50 for a plate that consisted of rice and 5 pieces of shrimp- this low life useless eater- i hope they go out of business and put all their money in the hospital.low life thieves", "author": "Marbi F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "I went to this place for a to-go dinner order. It was very empty but several people were waiting for their take-away food.\nThe manager (I assume) is a very friendly and chatty guy who makes you feel welcome at his restaurant. He even sat down with me on a table to talk about my order and about other stuff.\n\nI ordered the Pad Thai. This is most of the time a safe order and mostly tastes good. This one was good. I would not put it on the list of my top Pad Thai's I've ever eaten but it was decent and the portion was more than filling.\nAs drink I took the Thai Iced Tea and must mention here, that this one is in my top list of Thai Iced Teas, it was the way I liked it!\n\nThe reason why I gave this place four stars is, because the owner was very friendly, the thai iced tea very good and the pricing for decent food very affordable. I would definitely go there for another dinner to-go.", "author": "Vera H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Duck curry and pad Thai were very good. Spring rolls were different from any I've ever had but we're also very good.", "author": "Erin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-24", "description": "Unfortunately I decided to eat at this place as soon as I arrived in San Francisco because it was close to the hotel. I ordered some egg rolls which turned out to be nothing more than a greasy mess. I attempted the soup twice, first I sent back because it was cream based despite not being explained on the menu. And the second kind was barely edible seeing as the shrimp still had feces attached and the chicken looked like something that had been pressed and pieced together. I would have just been content with the broth had there been any flavor. What a waste of money and time.", "author": "Lisa V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-28", "description": "Ordered Spicy Eggplant with chicken, which was good.  We also ordered a papaya salad and tom yum soup, both with shrimp.  While the shrimp were fresh, none of them were deveined.  none.  that's about 8 shrimp.  We did it ourselves.  I cannot recall ever going to a restaurant that doesn't devein their shrimp.  It wasn't busy either.", "author": "S e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-17", "description": "Kind of just average. I ordered my usual Thai dish - pad see ew. I quite enjoyed the soup that they served with it which was pretty unconventional for Thai places. It was some type of onion/vegetable blend that was pretty tasty. The pad see ew wasn't as flavorful as I would have liked, but it wasn't as bad as many others that I've tried before. The chicken was very tender and they were generous with the vegetables in the dish. The decor and service were both average.\n\nWith the wide selection of restaurants within the same block and area, I'm not sure I would come back. However, I will still note that it's one of the better Thai restaurants around FiDi.", "author": "Sunny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-26", "description": "Good for lunch but nothing special. Don't make it a destination, its not that great. \n\nIf your looking for something different for lunch stop on in but its not special. It's OK for the area I guess.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "Very simply, they refused to accept cash.  I ordered a to go meal. It was $10.90. Tried to pay the last 90 cents with three quarters, one dime, and five pennies.  They refused the pennies and insisted on a credit card or something other than pennies. Five pennies. It's not like I dumped 73 cents on them during a busy time.  And they wouldn't just take 85 cents and leave the pennies.  So I left. The food's not bad, I've been here plenty. \n\nI can't believe I'm writing one of these stupid  senseless Yelp reviews, but this place earned it.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-24", "description": "If I'm craving Thai food for lunch this is where I usually end up. Their curries are good, pad Thai so-so. They really need a better lunch special. For $5 you can add a spring roll, a few leaves of lettuce, and a small ice tea. Totally not worth it. Way overpriced for mediocre food.", "author": "Anastasia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "I came on a Monday during lunch hour (12:30) and ordered take out.  It was bustling but they still got my order out in a very reasonable amount of time. \n\nI ordered the Thai Basil Salmon and it was pretty great.  The salmon came out cooked in a manner you would expect it to be when it's been stir-fried, and the taste of the sauce that the salmon was cooked in was delicious.  It's spice level was perfect and exactly what I would expect from a Thai dish, just enough to sizzle your tongue a little but not enough to over power the fresh Thai basil and peppers.  I should mention that I love spicy food.  If you're sensitive to spice, you might find it very spicy. \n\nI made the order a combo for $4.50, which comes with a side of thai salad, an eggroll, and a drink (I got Thai tea).  The salad was very weak and tiny. I ate it like in one bite.  The eggroll was pretty bland.  I would not opt for the combo next time and just get the Thai tea for $2.50.  The tea was delicious. \n\nI ordered take-out and the transaction was very rushed, as expected for as busy as they were.  I would not have expected anything more such as chit chat and friendly demeanor.  So friendly personable customer service is not on my radar for a place like this at a time such as lunch.  As long as they get my food out in a timely manner, which they did, that's all I ask for.  \n\nOverall, good experience and food (the main course at least).  I would come back.", "author": "Heather G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Great curry and spicy eggplant. Peanut sauce for the thai salad and the vegetarian eggrolls good too. Fast and friendly service.", "author": "Heidi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "2 Thai restaurants on the same block. I will give Banana house the edge over Bangkok Express. The food was much better. Against my better judgement, I ordered the fried rice and fried chicken dish. Yeah I know, not very healthy.  But it was pretty good. They did mess up my friend's order and got him the chicken pad see ew instead of the tofu pad see ew that he ordered. No harm, no fowl, it happens.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-19", "description": "I usually order the Pad Kee Mao whenever I'm at a new Thai restaurant.  That's one of my favorite dishes, so if I was to try out somewhere new, why not start by judging them with my favorite noodle.\n\nTasted better than expected and it's pretty good for the financial district.  Our order took a little longer to come and they all came at a different time, which I thought was kind of weird, plus it wasn't even busy! It's a good place to go on a cold day if you want something tasty and hot....totally hits the spot!", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-01", "description": "Tried the peach curry: choice of chicken or tofu in red curry sauce w red bell peppers and basil.\n\nIt was tastey and different; I like peach curry with chicken!\nThe side of rice was fluffy,fresh and sweet tasting; and the side salad was fresh too.\n$7.95 is a nice price.\n\nCustomer service: fast and good.\n\nParking: none outside; you need to find a parking area; this place caters to FiDi\nworkers, like me!\n\n3 stars is fair.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-28", "description": "I had did my yelping and was actually bringing my friend to the curry place right next door. I guess I didn't yelp hard enough because that place didn't have seating so we came here.\n\nThe outer decor is very modern and every time I walk by there is a lot of people inside. We arrived around 12PM and the place was at half capacity. It did get full after 5 minutes after our arrival. Watching my weight I ordered the seafood salad with silver noodles. My friend ordered the silver noodle entree dish with beef. Our waitress was a bit hard of hearing. \n\nWaitress: \"What kind of meat?\"\nFriend: \"Beef\"\nWaitress: \"What kind of meat?\"\nI eye my friend while thinking, \"Is beef not a meat?\"\nFriend: \"Beef\" \n\nMy salad came out a good 5 minutes before my friend's noodle dish came. It was a bit awkward. I was also a little disappointed on how small my meal looked BUT the dish is very deep so I was actually pleasantly satisfied after finishing. \n\nMy friend's dish looks good too but it is more of your general noodle dish. \n\nThey refilled our water and was attentive enough. They did give us our check after 15 minutes of our arrival so it was a bit unsettling. It felt like they wanted us to leave. We just started eating our food. I suppose it is understandable since there was a line of fidi people on their lunch break waiting in line. \n\nNot sure if I would come back.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-02", "description": "There's nothing spectacular yet inherently bad about this restaurant. The decor is simple and leaves much to be desired - not much of a Thai feel can be found. \n\nMy dish, the curry with beef, was better than expected. The beef was quite tender and the curry sweet and slightly tangy, great for lovers of the savory and sweet. For $10 during lunch, it'll come with a serving of jasmine rice and salad, and the whole dish was enough to last me 1.5 meals. Not bad overall, but for $10 there are many better options in the immediate area.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-28", "description": "Tried this place on my way Super Duper Burger. Decided to opt for noodles instead of a burger.\n\nI ordered Phad See Eiw. The noodles were over cooked and had a mushy texture. Also the wok wasn't clean or it had carbon deposits. I can still taste that burnt flavor in my mouth. Moreover, no other flavor. It would be plain bland if I didn't taste burnt wok.\n\n13$$ for that? I won't go back", "author": "Steven V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-26", "description": "I came here with coworkers for lunch this week, they were really busy so we ended up sitting down stairs in the basement. \n\nTo start we ordered the vegetable egg rolls. They were pretty good, a little too greasy for my taste, but the filling was yummy.\n\nI ordered the green curry lunch special but we all ended up sharing our food. We had the house fried rice and the sinta green noodles, both with chicken.\n\nThe green curry came with eggplant, bell pepper, chicken, and some green beans. It was served with jasmine rice and some salad with a creamy peanut dressing. \n\nThe fried rice was probably my favorite dish. It was different than any other fried rice I've ever had, the seasonings on it made it unique. It also had raisins, pineapple, and cashews mixed in, also things I've never come across in fried rice. Overall it was a really great dish everything came together really well.\n\nThe green sinta noodles were also very good. They came with chicken, chopped tomatoes, and broccoli. \n\nI like the food at Banana House but the service was pretty slow we were there almost 2 hours! I will be sure not to dine in for lunch again. I will try taking it to-go next time.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-02", "description": "This place is not bad if you want some quick Thai food in FiDi. I always want to come back for more to support the friendly Thai family/friends that run this store. :)", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "I'm highly susceptible to suggestion. Sometimes that can be a very, very bad thing. \n\nToday, however, it was a very, very good thing. \n\nThis morning my foodie coworker emailed me a New York Times article about Southeast Asian curry soups. The delectable descriptions and photos left me with no doubt that I would be having curry something, curry ANYTHING, for lunch. \n\nFortunately, this same foodie coworker followed through with a great suggestion: Banana House. \n\nWhile mere steps from my office, I had never tried Banana House, but all it took was one taste of my mango chicken curry to know that it would immediately go into my regular lunchtime rotation. \n\nSide benefit: The fiery curry helped boost my water consumption for the day!", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-19", "description": "I probably should have verified when my order for one entree and a Thai Iced tea came out to ~$18, but they gave me shrimp instead of the beef I ordered (which right off the bat was an extra three dollars). Didn't bother asking them to fix my order because I had waited at least 20 minutes for take out. \n\nWhen I went to eat it, the shrimp weren't fully de-legged, and I was still hungry afterward. For that quality of food, I expect to be full if I'm going to spend that much. Overall, a really poor experience. Overpriced, mediocre food and a long wait.", "author": "Camden A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-26", "description": "This place is Ehhh!\n\nI came here for lunch and just randomly chose this place.  I had the lunch special of chicken with veggies and a side of peanut salad.  My boyfriend had the beef with green beans.  Both entrees took awhile to come to us, it was cold and lack of flavor.  The only thing I could taste was the peanut dressing of the salad.  Also, they put us downstairs with no one else.  Either seat other people downstairs too or just have us wait.  It was really sad and lonely down there.", "author": "Melinda T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-08", "description": "My coworkers and I ordered takeout from Banana House today for lunch. Since no one had cash and we didn't want to deal with splitting the bill onto 3 different cards, we each called to place our own order. I ordered the pad broccoli. \"Chicken, beef or tofu?\" \"Can I have half chicken and half tofu?\" \"Sure. What kind of rice do you want? White, brown or sticky?\" \"Sticky\" \"Ok, see you soon\"\n\nThe first guy was told 10 minutes, I was told 20-25 minutes, and someone else was told 15 minutes. So we weren't sure when to head over. Fortunately, when we arrived about 10-15 minutes later everything was ready.\n\nI was surprised when the woman handed me my bill for $11.30 as I had ordered off the lunch special menu which was 7.95. She then explained they had charged me extra for both chicken and tofu, and extra for the sticky rice. \"But you didn't tell me on the phone that those things cost extra\". After several minutes of awkwardness they ended up charging me the right price. But the damage had been done. \n\nWe brought our food back to the office and it was bad. I thought my stirfry lacked flavor and the \"sticky\" rice wasn't even sticky. My coworkers gave their curries 2.5 stars.\n\nWill not return.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-04", "description": "I believe this is the theme song of this hectic eatery on Kearny. Let me get my banjo... http://www.youtube.com/watch?v=ksuObVszb-Q\n\n\"Yes! We have no bananas \nWe have no bananas today! \nWe have string beans and onions...\nCabbages and scallions \nAnd all kinds of fruit and say \nWe have an old fashioned tomato \nA nice juicy potato, but \nYes! We have no bananas \nWe have no bananas today!\"\n\nThey do have a lot of standard Thai dishes though. Business is at a fever pitch during the lunch hour here. Madness, sheer madness. For some reason, I was given a table for four all by lonesome, just me and my iPhone. Not sure why, but I got glares from shopping whores looking to park their bags.\n\nI went for one of their signature dishes, the $8.95 Pumpkin Curry. Decent. Just decent. It was served in a little square bowl with about four small strips of chicken, four chunks of pumpkin and ancillary vegetables. The scoop of rice seemed skimpy for the amount of curry, as was the salad which had a smear of peanut sauce on top. There were these flavorless chips served, but at least the crunch made a nice contrast.\n\nI'm sure I'll come back at some point since I'm working nearby, but it would be nice if the quality of the food on the Kearny corridor could get a bit more of a lift. And yes, they do have bananas - fried with a scoop of ice cream. But not for me...have to get back to the office.\n\nFOOD - 3 stars...a decent lunch-time option if you have a hankering for Thai\nAMBIANCE - 3 stars...just a blur to me...lots of yellow and green and that was just the diners\nSERVICE - 3.5 stars...speedy\nTOTAL - 3 stars...I'm a banana in a banana house", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "I'm a regular here since it's right next to work. They are always so nice and generous here. And the food is delicious and comes out fast. I always get the mango fried rice or pad see ew. I can't speak to authenticity but the flavor and freshness is always on point.", "author": "matthew m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-13", "description": "It's wet and cold outside, and we needed someplace close and fast for lunch.  Reservations for five at Banana House is what we come up with.\n\nTaking advantage of their Weekday Lunch Special (any order of curry or Banana House plates come with an order of rice, fried wonton skins, and a side salad with peanut sauce), I had the Pumpkin Curry, soft pumpkin in spicy red curry sauce with tofu ($7.95), as recommended by Kam O.  It was tasty and had lots of pumpkin and tofu in this dish, with a nice spiciness to heat it up as well.  I think if the pumpkin was cooked a little longer, it would taste even better.  It wasn't exactly what I call \"soft pumpkin\".  \n\nMy colleagues had the Gang Dang, red curry in coconut milk with bamboo shoots, bell peppers, and basil with tofu ($7.95); Yellow Curry, yellow curry in coconut milk with onion, carrot, and potato with chicken ($7.95); Prik Khing, sauteed string beans in spicy sauce with basil and bell peppers with tofu  ($7.95); and the Seafood Curry, prawns, calamari, and mussels in red curry in coconut milk with basil and bell peppers ($8.95).  There was also an order of Thai tea ($1.95) as well.  Everyone finished their lunch, or took home the leftovers.  It was a nice comfort food for the dreary weather outside.\n\nMy colleagues arrived at the restaurant before I did and were seated downstairs.  As I made my way there, the waitress handed me the menus and directed me to bring it to my table.  Wtf?  Too lazy I guess.  I orders arrived VERY quickly and we appreciated that, especially with it being a weekday lunch.  However, soon after our dishes arrived, our check came too.  Now, we all know what that feels like.  They just can't get rid of you fast enough, I guess.  It wasn't super busy for a 12 noon lunch, and there was plenty of seating still available downstairs when we left at 12:40.  \n\nWe were actually very surprised with how quickly our food arrived and how fast we finished lunch.  With 20 minutes to spare, we took our time heading back to the office.  They also play Wild 94.9's Wild Workout at Noon downstairs, so I wasn't sure if I wanted to eat or dance around.  Maybe that's why we ate so fast, with music like that, how can you not?  Then again, this place has made me want to do my power walks at noon again.  Now, if only I can find one of those Walkmans with radios! \n\nTotal bill, tax and tip included: $53.00\n\nUpdate! 12.05.07 - Went back again, but this time I had the Gang Keaw with chicken ($7.95), \"green curry in coconut milk with eggplant, zucchini, basil and bell pepper with chicken, tofu or prawns.\"  Pretty tasty stuff, and lots of eggplant and tofu.  I like to pour out all the curry on my rice so I can enjoy all the sauce!  Mary C. had the Pad See Ew ($7.95), \"pan-fried rice noodle with egg and broccoli; choice of chicken, pork, beef, or tofu.\"  I enjoyed this dish too, and usually Mary C. has leftovers, but this time she finished it all herself!  Good stuff and loaded with broccoli! \n\nIt does get busy around the 12:30 mark, so head in there early.  It's hard to get the waitress's attention when you're sitting downstairs as well.  But the food does come out quickly and it's a pretty good deal.  Can't beat that for a weekday lunch!\n\n(You can find pics of our recent eating in the business profile!)", "author": "Teri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I had the fried chicken over fried rice (definitely a winner). The chicken doesn't have a greasy extra crunchy shell like most fried chicken do, instead it is lightly breaded and very tasty, especially with the sauce it comes with. The fried rice is also very tasty. The staff is very friendly and attends you as soon as you get there. I enjoy eating at Banana House.", "author": "Jessica U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "I have been here several times already and each experience has been positive. It is always packed during peak lunch time. The food is decent and so far, it has not made me disappointed yet. I have ordered the yellow curry with rice several times already. The portion,  the taste and presentation are good each time. I would definately come to this place for lunch.", "author": "Anonymous B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "People in San Francisco can be so difficult when it comes to food. Come on people, it's not a Michelin starred restaurant. It's inexpensive, tasty Thai food with fresh ingredients cooked to order and even when delivered to your door, measures up better than 90% of Thai places anywhere in the country.  \n\nTonight they delivered a meal with damn near perfect green papaya salad, spicy eggplant and chicken laarb their Thai ancestors would be proud of. The ONLY thing I could find fault with them was I think rice should be included with entrees. But really, the folks panning this place with one and two and three stars have some unrealistic expectations. I WILL order from them again and expect to be just as satisfied next time.", "author": "Patty M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "This place was great! Especially for the price you're paying. I have only tried one dish but I thought it was delicious. \nI placed my order 15 minutes before the lunch rush, walked  right over, and my meal was already prepared and ready to go. \nI got the silver noodle salad which comes packed with chicken, prawns, and some other seafood. The chili lime sauce was superb! They also have a bunch of sauces that you can take in to go cups- like peanut sauce and sweet and sour. \nI decided to sit outside since there were some open tables and one of the waitresses brought me a glass of water even though it was clear that I had gotten it to go. Very sweet of her. \n\nThe portion was also really huge so I saved some of it for later. I can't wait to go back and get this salad again. It was packed with flavor and I catch myself craving it every now and then.", "author": "Cesie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-19", "description": "Decent lunch portions. They're very flexible about the items you get (allowing for half and half of rice and pad thai).", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "Pretty sure this place uses some serious MSG, because I got an incredibly nasty migraine after eating here, along with the usual stomach issues that I get when I ingest MSG.  The food is pretty good and pretty cheap (a 3-star kind of place) but if you are MSG-sensitive it is TOXIC.  They should state this on the menu.", "author": "Emmy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-29", "description": "This place really seemed like authentically cooked Thai food.  It didn't have that mass produced or frufry over-the-top chic Thai presentation that you see in Ohio or Pittsburgh.  \n-Mussman Curry, rice and bottle of water for around $11.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-11", "description": "Since I'm a big fan of pumpkin season (and brews, lattes, bread, you name it) the pumpkin curry caught my eye. It was a lovely dish with plenty of spice and everything nice and all around well-crafted for the price (a lil less than $9 and portioned well). The chicken and pumpkin = tender in their own respective ways; the curry had a nice heat to it that didn't overpower. \n\nYummy crab rangoon, made in a way I've not had before. Less greasy and with more interesting and tasty filling...!\n\nBasically, this is an unpretentious pleasant Thai place with staff working almost meditatively in the back skewering what looked like curry kebabs. Prompt and efficient service. Definitely will be back for my Thai fix when I'm in the area and want to drop in for a quick lunch or dinner!", "author": "Lily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "Been coming here for years.  Almost always get the Garlic Pan with chicken.  You're out for $10 and it's awesome every time.  Nice little salad and a good amount,  consistently fresh and excellent.   Don't know how they aren't more crowded. The free soup you get isn't to my liking, but it's not necessary so I just ask them to not bring it.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-10", "description": "My bf is a regular here, but I finally joined in with him for an early dinner today. I like their combo deal: an entree with 2 egg rolls, salad (yummy peanut-y dressing!), rice and either a Thai iced tea or coffee - awesome deal for about $11.50 before tax/tip. \n\nI had the chicken with cashews, pineapple, onions, red bell peppers and chili peppers - yum, very tasty (the sauce melds it all together so perfectly)! And my bf had the pad see ew, very good and tasty as well. We'll definitely be back for that entree combo!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "(See pics)\n\nMore of 3.5 stars.\n\nHave been here quite a few times, either after work or lunch. Always solid food and good service.\n\nThe food can get quite spicy if you ask for it. It's with good sauce and juicy meat. While the meat is more of pre-frozen taste it's inexpensive and the seasoning makes up for it.\n\nThey have a basement as the upstairs can get packed quite frequently. It was spacious but I really don't like the smell. Upstairs was nice with open windows even it's more crowded.", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-23", "description": "After the disappointment at Ebisu, my coworker (Jennifer M.) and I decided to check out Banana House across the street.  \n\nThere was a girl ready to take our order and the place was pretty packed for lunch.  I got basic fried rice with chicken, onions, tomato, cilantro, and snow peas for $8.70.  It took about 15-20 minutes.\n\nThe onions weren't cooked thoroughly with the fried rice so it was super fresh and had quite a bite.  (I love onions but usually, they cook it down a little so it's not so spicy)  The fried rice tasted lighter than, lets say, King of Thai fried rice but it was missing something.  Even after I smothered it in spicy chili sauce, it was missing some key component that I can't identify at the moment.. maybe it was Soul...\n\nSeriously, can't beat King of Thai chicken fried rice for (less than) $7 PLUS free Thai iced tea!  \n\nCareful of the door.. it swings in and out when someone closes it and if you're standing too close, it could seriously knock you out.  (It hit us a few times on the shoulder and it hurt!!)", "author": "Kat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Fantastic food at a modest price. Great place to pop into on the run being that it's in the financial district. Only negative point was a rush to bring me the check - twice.", "author": "Ed Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "This is a decent spot for lunch.  We ended up seated downstairs.  This was a bit like eating in a dingy basement.\n\nThe service was friendly and fast.\n\nThe food was fresh and good.  I had Pad Krao Prao which is a chicken dish.   It came with rice and a nice lil salad.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-22", "description": "When I first walked into this place, I was expecting typical financial district thai food that would be overpriced and underflavored.  I was wrong!\n\nBanana House has a wide variety menu, but I went with the classic green curry with chicken, and didn't regret it for a minute.  Before my meal came, I got a bowl of soup (comes with lunch eat-in orders) which was really great.  Unexpected, but very appreciated.  The meal itself was very tasty, and a good quantity.  My one gripe is that the chicken to veggie ratio is a little high, but I'm guessing I'm in the minority for wishing they had less meat and more eggplant (which was real tasty).\n\nI was very impressed by the speed at which my meal came.  Less than two minutes after I ordered I had a bowl of soup in front of me, and 2 minutes after that my food had arrived.\n\nBanana House has become my go-to thai lunch place, and it should be yours too.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-17", "description": "I was so hungry and there aren't a lot of options in the area on a Sunday afternoon. I start digging into my food. And as I start digging more into my steamed rice, I see a little black thing. Hungry, I pick it out and toss it, and continue to grub. But no, I dig further down the container, and black pebble like things throughout the container. They don't clean their food properly. Gross! Waste of money!", "author": "Tina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-08", "description": "PRICE: affordable, especially given it's location in the city. The servings are medium so you aren't getting less because of the cost.\n\nSERVICE: the employees are pretty friendly, a lot of times they are hectic from the busy lunch rush that comes daily, being located in the Financial District means catering to thousands of hungry people.\n\nFOOD: pretty darn good, I've eaten at a lot of Thai restaurants, but this place actually falls into the top 70 percentile. All the basics are delivered well; pad thai, papaya salad, red curry, green curry. \n\nSPACE: the seating is packed pretty tight on the main floor, but there is also seating one floor below. It's an older and less updated looking restaurant overall, but who cares? It's not dirty, just old.\n\nCall in your order ahead of time if you are ordering takeout, you'll cut your wait time by 75%.", "author": "Kristine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "I used to go here for lunch every time I crave for good Thai food.\nTheir Pad Thai is one of my favorite pad thais, prik king with chicken is good even their sticky rice.\n\nI have brought co-workers, hubby, my mom here.  I wish I still work around the area so I can get their pad thai.\n\ncall in for pick up if you don't want to it in.  it can be crowded during lunch.", "author": "Learnee L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-27", "description": "Came here for lunch with a friend... BIG MISTAKE!!!!  I had the pad broccoli and beef, which was the worst meal ever.  A bowl filled with boiled beef, broccoli, and oyster isn't my definition of a good meal.  I really want to go and show the chef how to cook..  The only thing good about the place is the staff, since they are friendly and nice, hence the one star.   In my opinion, if you want some good Thai \"food\", go elsewhere, this place is a dump!!  You'll be much happier spending a few extra $$ for the quality.. I know I would in hindsight!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "Setting isn't the most trendy or updated but the food is excellent and the price is good. We got the Green Curry Beef and Pad Kee Mow. Great choices with flavor and balanced spice.", "author": "Clint H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-27", "description": "Let me start off with this, banana house has no banana dishes! xD \n(except for fried banana, but that's not the point)\n\nI went here for my birthday, and everybody seemed like they were having a good time. The waiters were nice, and the dishes were good! Well worth my money. The curry on the Gang Mussaman was perfect.\n\nThe only downside is that they charge you for rice, even if you're ordering curry. The owner picked up the fact that it was my birthday and gave me rice for free, so I guess I shouldn't be complaining. (: \n\nHe also handed out all ten of us some lollipops afterwards! Sure was a sweet finish.\nDefinitely coming back!", "author": "Winnie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-19", "description": "When I first walk into here, I was confused, did my friend just rent out the whole place for dinner?  since there are suppose to be about 30 of us and this place look like it barely fits.  And where is everyone else?!  I am already 10 minutes late due to the ebil bay bridge traffic and I can't be the first one here.  (luck out on parking, usually its hard to found parking around here, but guess the parking god was on my side that day)  I finally realize there is a whole downstairs level for private parties.  Now this make more sense!\n\nThe service here was great, the waitress were attentive while not overbearing.  Seeing they have to carry the food down steep flights of stairs, I was pretty impressed.  The price was pretty reasonable for thai food too.  Average $8 per dish.\n\nHowever, the food here was kinda hit and miss.  Some dishes taste awesome, while others are lackluster.  I really like the gang traffic jam dish, which is like 3 curries in one.  The spicy catfish were good too.  However, the thai salad was slightly too sour, and the mango in the sticky rice and mango wasn't ripe, thus not sweet and kinda stringy,   While most of the noodle dishes are standard.  Next time, i will stick with the curry dishes here and no dessert.\n\nRemember to get the combo deal, with only $3.50 more, you got 2 spring rolls, some thai salad, and rice, along with thai ice tea/coffee.  (where the thai ice tea/coffee was $2 by itself, and the rice was $1 by itself)\n\nOne last thing to remember, the bathroom door is next to a pretty steep stairway, so watch your steps if  you don't want to break a leg or two.", "author": "Jim H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-05", "description": "We ate at Banana House on a whim: we were in the area doing some shopping on a Sunday and they were one of the few places actually opened. We came in and were the only ones in there, so there was no wait which is a plus. \nI ordered the silver noodle salad with a side of jasmine rice. Unfortunately, I got regular rice. The seafood on the salad was pretty good, but overall, the dish was very hard to eat. The noodles were hidden under all of the seafood and the dressing was under the noodles. So, I didn't even see the dressing until I was almost done with the meal. \nI also got the sweet and sticky rice with mango for a dessert and it was a great way to end the meal. Overall, the service was pretty good. But, if I ate here again, I would order a different dish.", "author": "Alycia N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-19", "description": "Definitely should not have ignored the low reviews. After calling once to confirm my seamless order, when I called again 35 minutes after the delivery time the young man at the restaurant said, \"I was supposed to call you after 5 to see if you would still like it delivered.\" When I asked him why he had not called yet or whether he did not get the earlier message from the first person I spoke to he just repeated the above. I don't have time to waste on incompetent delivery services.", "author": "Jeremy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-25", "description": "I've tried this place a few times in the hopes that the first 2-3 were flukes but i've now come to terms with the fact that it's just not good. Agreed that there is a lack of good thai food in the FD but this place is not helping. I've tried multiple things: Tom Kha, egg rolls, satay, pad thai, various curries etc and nothing was even mildly inspiring. A lot of the food lacks flavor which is saying alot because these dishes are normally filled with strong flavors. More grease than real spices which is unfortunate\n\nCheap and fast but won't please your taste buds.", "author": "sasha h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "The Mango Curry w/Chicken is phenomenal! You can have it in house or take out, either way it tastes the same. The dish is served with your choice of chicken or prawns, mango, white rice or brown rice and a small salad drizzled with peanut sauce.  \n\nWhat makes the dish is the mango curry sauce. The flavors I can make out are Red Bell Pepper, which adds a tangy taste with a hint of bitterness, Serrano Pepper that infuses the entire dish with enough heat to give flavor, but not burn your tongue, and the Mango Juice from the fruit itself that adds the sweetness to the curry. All of the flavors combine together to give you one satisfying mango curry infused with multiple levels of flavor in each bite. \n\nEvery time I order the dish the flavor comes out consistent to each order, which makes it a reliably lunch time dish. Ordering online is super easy or if you want to order take out your order is ready in about 20 minutes. I highly recommend the Mango Curry w/Chicken.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-31", "description": "Yellow curry with chicken with brown rice ($6.95) Yeah I got brown rice! It's Halloween ok?! I gottah fit into my slutty costume tonight. Anyhoo....\n\nOnions in it were completely RAW. WTF? Only veggie's were two sad ass potatoes, a few carrots and then the completely raw pieces of white onion. Chicken was dry. Curry flavor was pretty good but not spicy at all. The rice was well cooked though. The complimentary soup it came with tasted like celery and carrots in boiled water. At least it had tofu in it but it was bland and no bueno. The salad had a yummy peanut sauce on it but the salad itself consisted of nasty sad ass shredded iceberg lettuce and raw red onions. Again, no bueno. \n\nSide note: Service is lightening fast. They gave us the check like 2 seconds after we got our food. Oh wait, I think that's they're way of saying \"hurry the fuck up, eat and get out.\"", "author": "Beverly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "We stopped by Banana House today for lunch since a lot of the restaurants I wanted to try were either closed or swarmed with people.  The restaurant was fairly empty, and service was good; they paid attention to us but didn't smother us.\n\nI had the mango chicken and my friend had the pad thai with tofu; both were very good.  I highly recommend the mango chicken.  For the price, the pad thai was more food than I expected, and my dish was about the size I expected.  I've been charged more for less, and for less tasty food, so no complaints there.  We also each had a Thai iced tea/coffee: pretty sure they're the same thing since I asked for coffee and my friend asked for tea and we got the same thing, or just about.  It was also very good.\n\nThe restaurant is small, so I can see their being issues with waiting and takeout during rush hours, but the staff we met today were very pleasant.  I give four stars since it was a nice, solid meal but nothing exceptional.  I'd go back though, if I were in the area and in the mood for Thai.", "author": "Grace K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-27", "description": "I ordered my fave thai dish- the infamous Pad See Ewe with tofu and no eggs. It wasn't bad and the portion was just right for someone getting dinner after a nice workout. Nice enough people. Not sure if I would make it a point to come back.", "author": "Zannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-01", "description": "Enjoyed a very good simple meal of Thai food.  My son and I had the Green Curry and it was tasty, my other son had the fried chicken which was ok, we had a chicken and cashew nut which was good and a yellow curry which was good.  Appetizers looked store bought vs made in store but they were hot\n\nNo alcohol which would have been nice with the curry\n\nAtmosphere was simple \n\nWe would go again for the food", "author": "Bart F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "We were walking to a vegetarian restaurant at Kearney. As we are turning to Kearney from Bush. We saw a small Thai restaurant around the corner. \n\nThe first impression is clean. The lunch menu is not especially unique, except for a few with house name. We ordered noodle curry and its house special fried rice. The food is good. We will definitely be back when we are in the area.", "author": "Lionel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-22", "description": "OK food but I prefer Osha Thai better. This place is just a bit more convenient to my office. Restaurant is small and colorful. Portions smaller than other places, but enough to fill you up. Gets busy during lunch rush. There are many other places to eat on the same block, but if you're craving Thai, this will do the trick.\n\n- Papaya Salad: refreshing\n- Noodles: OK nothing special, not spicy\n- Thai Iced Tea: very milky and sweet", "author": "Linda C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-29", "description": "Thai food is mediocre here for the price but nothing exceptional - we ordered fresh spring rolls wrapped in crepe, which I thought was unusual (instead of rice paper)  but I like the concept!  Unfortunately, the crepe was not fresh but rather hard around the edges, difficult to bite off -not soft as one would expect for crepes.  Plating was also sloppy and there was only 1 other couple in the restaurant besides us - not a full house.  The Pad Woon Sen was very tasty but very spicy, and I thought how odd that the waitress did not bother to ask how spicy we would like our food.  The best dish for the entire evening were the mangoes, which were fragrant and just perfect in ripeness!  They covered up for the sweet rice that fell sorely flat, a clump of mess, a day or two old and embarrassed to be next to a delicious fruit.  Banana House, I think you guys could do a lot better than this on Christmas day.  Don't cook if you need to stay home and rest.", "author": "Susie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-05", "description": "We get there on a Sunday afternoon. The restaurant nearly empty. We sat and wait for the next 15 min for someone to come get our orders and bring us water. Nothing. So we left.", "author": "Lorrayne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-04", "description": "Are you kidding me?? You stupidly forget my meal and people came and ate and left while I waited. Don't ever sit outside, you are invisible to staff. Enormous mistake!! Won't be back, of course.", "author": "Crissy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-09", "description": "Ordered pad see ew.....and didn't like it. I've tried this dish in many Thai places, so I know what to expect. The worst part: the meat. It was baaad... On top of that....small serving portions. I left hungry. The staff was friend tho. Not coming back.", "author": "Guillermo N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-26", "description": "This place probably doesn't need another person calling them average, but *damn* this is average.  I'm giving them an extra star for having brown rice available, except they charge an extra dollar.  For an extra dollar I could buy 10X as much rice, so no extra star.\n\nThe layout really sucks -- if you order to-go, then you are shoved around by every child of the corn that walks in.  How does this place attract so many people?  Zombie style.  Sorry, so the food lacks flavor, the portions don't justify the cost, and they used squash instead of pumpkin.  I know, pumpkin is a squash.  But this squash was not a pumpkin.\n\nI do like the paint color, but enough to reward some points.", "author": "Lost S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-11", "description": "Wow hate to break it to you but this was terrible.  I ordered the pad kee mao which was supposed to have broccoli, tomato, basil and bell pepper and tofu.  Instead, it had only rice noodles, broccoli (with the stems and leaves..that's not basil) and the worst tofu I've had in years.  There was literally a point that I was mid chew on a tofu cube and decided to forego and spit out my mouthful into a napkin to throw away.  No flavor, cold and disgusting.  Definitely won't be coming back here.  Sad because I love Thai...", "author": "Madeleine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-31", "description": "Working in a close proximity I often visit this place and get takeout. Spicy cat fish and salmon curry is awesome! The absence of the website is really taking this place down. Very behind the modern times. But the food is authentic and tasty. Some dishes like papaya salad is a miss. Finally brown rice option, way overdue but welcome of course. \n\nPrices are average. Recommended.", "author": "Xela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "Just delicious.  Even though the place was packed, I was still seated right away and received my food quickly after ordering.  The service was really impressive and I loved being able to sit outside on such a beautiful day.\n\nThe food was also delicious.  The salad has a wonderful dressing on it that is cooling and perfect for any of the main dishes, especially the spicy ones.  I ordered the Prik Khing with chicken which was just heaven on a plate.  The veggies were perfectly crunchy and the chicken was great quality.  Warning: this dish is for those who love spicy food!  If you can't take the heat, order anything but this. I also tried the Pad See Ew which is always my favorite thai dish.  This one had a lot of fresh broccoli and did not disappoint.  I needed some chili paste to bump up the flavor a bit, though.  \n\nAll in all, I highly recommend.  I'll be back to try some more dishes and next time I'll splurge for their mango sticky rice dessert.", "author": "Jordan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "I came here with a co-worker for a lunch yesterday and it was really good! I had Pad Thai with tofu and she had red curry with chicken. My pad thai was hot and a bit spicy which is a nice change. I have tasted pad thai dishes all over bay area and must say that this was a very good one. The tofu was prepared very well too! I am a vegetarian, so i am picky about how I like my tofu cooked. As i've heard, the red curry was a bit spicy too... she didnt finish it. But thats understandable, since spicy dishes will fill you up faster. \nThe atmosphere was nice too, even though we ate outside. (they have a couple of tables outside). Definitely recommend you check out this place. Their prices are below average for FiDi too. :)", "author": "Yuliya K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-29", "description": "Food was good they do not bill separately if multiple people go together.", "author": "R N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "I had the banana house ground chicken special on recommendation. A bit different than what I've seen on typical Thai menus which is nice. Taste was good. Not the cleanest place though.", "author": "Allen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-17", "description": "I walked into Banana House randomly one day during lunch without checking the reviews first - and I probably should have. I ordered the Mango Chicken, and, while the dish definitely looked very appealing (full review and photos on my food blog here: http://temptingdelights.wordpress.com/2012/07/13/banana-house-mangos-chicken-and-fog-for-lunch/), I found the curry sauce to be a bit watery and bland. \n\nBanana House is an okay place if you just want to grab a quick meal, but a bit on the expensive side if you're looking for something mind-blowing. I've definitely had way better Thai food before for cheaper. However, I did only try one dish, so I may have missed out on some of their specialities, which may be a lot better.", "author": "Krystal L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "Stopped in on a whim on my walk to work. Reasonable prices, great Pad Thai and excellent staff! My glass never went empty, service was quick, and they were very kind. I'll definitely be back!", "author": "Kristina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "I wandered in off the street, really just looking for a place to park and a little lunch.  Even average quality Thai food would have been fine.  I then ordered the eggplant with garlic sauce, and my day got a whole lot better.  Spicy but subtle, and cooked with pride.  I noticed a lot of regulars filing in as I enjoyed my meal.  I'll be back, and give Banana House a strong thumbs-up.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-29", "description": "It was...okay.\n\nMy complaints:\n1. WAY too loud\n2. The pumpkin curry was made with butternut squash\n3. I ordered a thai coffee and got a thai tea\n4. my spring roll was cold\n5. I didn't see a single banana in the entire place\n6. It smelled funny (I think it was the candles on the tables)\n\nWhat was good:\n1. reasonably quick\n2. reasonably priced\n3. reasonably tasting\n\nmeh. three stars, but there's got to be something better out there...", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-27", "description": "A solid three stars but 4 stars for value.\nAmbience: Not much to speak of. Basic settings and menus that could do with a clean.\nService: Very friendly waitress and fast response. \nFood: A pleasant surprise. We stopped in here on a whim for dinner and weren't expecting much but found a the two mains we ordered to be tasty and interesting. The sizes are more than enough (with the extra side of rice) for all but the biggest eaters. I had a spicy calamari dish and my friend a chicken cashew dish. Both were well seasoned and not your run of the mill \"just drop lemongrass and ginger in it and call it good\" type dishes you can get at some Thai places.\nPrice: ~$11 for a main with rice.\nI'd go back as it was a cut above any other Thai I've had in SF.", "author": "Geoff A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-10", "description": "Right when we walked in, it looked really dirty and disorganized. The waitress didn't understand English much and we had to ask for refills and utensils multiple times. Food wasn't any special. Never go back again.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-19", "description": "This place is really close to work an I was craving Thai food so I figure why not give it a try. The place is quite small and seating is very limited and there can be a wait time to be seated but they offer a to-go menu and are quite quick with getting you with your order out the door. \n\nI got the yellow curry with tofu and made it a combo which includes soup, salad, spring rolls, and your choice of Thai Coffee or tea. \n\nThe soup is served in a very small bowl and tastes like vegetable broth.  The Thai Coffee was pretty good, not too sweet.  For the salad they used some type of curry/peanut dressing and it was delicious.  The Spring Rolls (2) were accompanied by a dipping sauce and were also very good.  Finally, the yellow curry tofu was just ok.  The curry was a bit oily/watery and the tofu was kind of dry. \n\nThis place does not compare to Osha Thai but for the price, the food is pretty decent.  I'd probably go again and order the Pumpkin curry instead.", "author": "Cynthia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "The usual thai fare.\n\n+1 star for some dishes that I don't see regularly - try the the spaghetti kee mao, like pad kee mao but with spaghetti noodles, its great, takes more thai-eem (time).\n\nThe fried chicken on fried rice is pretty damn good too", "author": "Noah P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-31", "description": "The place is just average, especially consider other alternatives in the area for Thai or other Asian.  The lunch specials seem like a good deal but the quantity is a little less than other places because they put your entire entree into a bowl which is on a plate of rice and small salad.  I also decided to upgrade my meal with the Thai iced tea, spring rolls, and jasmine rice, but it's not worth it.  All of it was just ok and there wasn't enough flavor.  \n\nI had the spicy eggplant with tofu and there was a good variety of vegetables and sauce but it was a little soggy and lost some of the natural flavor.  A friend had the pad thai and didn't have any complaints while another person also had the spicy eggplant but had the chicken.  The chicken was dry but passable due to the sauce.  Overally, a place I'm not interested in returning back to.", "author": "Jay N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-05", "description": "2/5 skip it.\n\nit was whatevs. i got the beef ginger lunch special, and the beef came out in that odd state where it's been overcooked, but could have been cooked longer for slight salvation. it was pretty bleh, and the roll that came with you could squeeze the oil out if it between your fingers. combined with the long wait for food when the lunch rush was over...meh.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-25", "description": "This place has gone downhill since I worked in the area 2 years ago. It used to be consistently above average. Now . . .\n\nMet some friends for lunch and I got the duck curry lunch plate ($7.95) with their combo special ($3) which adds 2 egg rolls and choice of Thai iced tea or coffee.\n\nThe flavor of the curry was OK, but there was hardly any duck and a few too many fresh grapes(??). The jasmine rice came preformed in that upside down bowl shape and I had the hardest time pulling it apart. That stuff was like a brick and obviously not fresh.\n\nThe side salad had some shredded cabbage on top of lettuce, but the lettuce consisted of two wedges off the end of the head of lettuce. You know the hard stuff where all the leaves connect? Inedible.\n\nMy friend that got fried chicken over fried rice said \"Well, it's better than a Chicken McNugget.\" If that's not glowing praise, I don't know what is! ;-)\n\nThe eggrolls were alright and apparently the tofu noodle dish another friend got was tasty, but all in all a disappointing dining experience.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-18", "description": "This place is pretty much par for the course.  Cheap thai food that's decent.  I had the pad see ew, and it was no better/no worse that other ones that I've had.  This all is pretty mush 3 star material.\n\nHowever, I used to work long hours in the financial district, and the 4th star is for how fast the service is.  We used to have food delivered in, and these guys are extremely fast getting food there.  Most other places required a wait of 45 minutes to an hour.  We were able to get things as fast as 15 minutes.  Granted, it's not very far from Banana House to the Transamerica Building (where I worked) but I still think it's commendable.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-13", "description": "3.5 stars.\nThis is just above average.\nCame here with work colleagues for lunch - arrived early so place was empty. It did fill up later on.\n\nThe others mostly ordered some seafood basil curry which looked ok and judging by the fact they ate it all was a good sign.\n\nI had the mango curry which I was pleasantly surprised with. It's not the biggest portion but for an ok price and it being lunch time it was fine.\n\nThe pad see ewe was a bit dry and not flavorful enough - tasted like bland rice noodles...\n\nThe service was fast and water filled up regularly. No complaints there but nothing had that wow or stand out factor.\n\nAn above average place for lunch.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-15", "description": "It's cool. They have a secret downstairs space. I likey for a quick Thai sit-down lunch. They are not afraid of serving spicy food and I am not afraid of eating it.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-19", "description": "The place (tables, chairs, walls, plates, lights above the counter and tables) all need a very good cleaning.\n\nFood was fine. Service was fast. Lots of choices. Good location -- but need to clean the place up. Make it look better.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "The place was OK.  Decent and quick lunch but nothing special.  \n\nThe duck curry that we ordered was a little bit oily to me.  The Pad Thai was ok.  Good portion.  Fast service.\n\nBanana House is an OK place for lunch.", "author": "Liza T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-20", "description": "Nothing really special about this place. The dishes are run of the mill - I got the pad thai, which was pretty good, and my friend got the pad see ew, which was way too salty. Average overall, but they are one of the few places open for dinner (until 9 pm) in the fidi.\n\nI will say that my vegetarian roommate is not a fan of this place at all. I personally have not tried the vegetarian dishes, but would probably steer clear of them.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "I work nights and some weekend days in the FiDi -- they're open late and 7 days a week, and their pickup/delivery speeds are blinding. Instant plus.\n\nBut, nobody gets excited about readily-available bad food. And that's the lovely thing about Banana House, their food has been uniformly pretty great. I don't agree with everything they do (grapes in duck curry for example) but generally I've had a good eating experience. \n\nStory: One time it was very cold, windy and rainy out and I ran down here to get my food and had forgotten my umbrella. The woman behind the counter took one look at me and poured me a hot cup of tea in a styrofoam cup to take with my pickup order. Awesome. I got rain in my tea. Double awesome.\n\nThe food's not going to change your life, but it's solid and dependable. Highly recommended over its next door neighbor, Bangkok Best.", "author": "Dara K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-09", "description": "Came for a late lunch with my friends the other day so it wasn't really that packed. This is a pretty mom and pop shop I think. \nThe food came out pretty fast which was good because I was STARVING! \nThe thai ice tea didn't do much to quench my thirst since it was too sweet but eh most are aren't they? \n\nWhat I really liked was the fruit curry that they had. It's a vegetarian option and the fruits are lathered in a spicy red curry. I really like how the fruit gave the curry a tangy flavor. I've never had avocado or grapes or mango in a curry before but it was quite a surprise and is a DELICIOUS combination. If y'all want to try having fruit served in a different way I do recommend this!\n\nThe Portion size was just right though I can be a little more greedy to say I would have liked more rice to soak up the curry goodness. \n\nI do have to say that the side salad that came along with the curry and the rice was not good though. I dunno the veggies looked pretty limp once covered in this peanut derived sauce that they ladled overtop. I wasn't too fond of it and barely touched it. Too much sauce over the salad gave it kinda of a soggy texture. \n\nIf I do come back it would be for the fruit curry!", "author": "Sharon Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "Mango curry with chunks of mango and basil leaves. Tasty!\nFast service.\nDidn't expect to be charged an extra $1.50 for rice.\nDessert of fried banana was fried in a plain batter with a vaguely chocolate (corn) syrup.\nThe plain walls and kitchen counter prevent any ambiance of Thailand.", "author": "Ethan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-22", "description": "Entrees here all around $6.50. I highly recommend the garlic pan with beef (beef with garlic & pepper), though I do kinda wish there were more veggies. (Other people's dishes had more veggie-wise).\n \nGood quality beef & great taste.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-29", "description": "A nice Thai option for a quick, cheap FiDi lunch.  They've got things down to a science, so expect the check on your table before you finish your last bite.\n\nI was hoping for a little more heat from the Prik Sod with pork, which comes with sauteed onions, bell pepper, and jalapeno pepper.  It left a little sting on the tongue, but I was expecting to perspire.\n\nIt was good enough that I'll give it another go down the line.", "author": "Daryl E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-16", "description": "Fine in a pinch. Not horrible, but certainly not great either. Don't go out of your way to eat here, but if you're in the neighborhood and looking for Thai food, it's fine.\n\nThe mango curry was a bit on the oily side, but mighty tasty.  Pad thai was pretty good, but I've had better.  Mango sticky rice was some of the better that I've tasted, but of the Thai restaurants I've been to, none of them have butchered it.\n\nAmbiance is SORELY lacking, and it doesn't feel like the most hygienic joint, which is what bumped it from a 3 (for the food) down to a 2.", "author": "Kali M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "Decent Thai food in the financial district.  But lots of competition around, and there is nothing particularly special about this place that distinguishes it.  They have everything you are used to, but if it were me, I would take the hike and go to King of Thai a few blocks away if possible.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "Quality was horrible. The food tasted like it had freezer burn and the food looked revolting. I got food poisoning, never going back.", "author": "Soo Hyun K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-17", "description": "Havent  been  there   for  about  a  year  (now  i  know  why)  I  had one  of  the   wost  Thai    meals  ever  in  San  Francisco...The   prad  pam  vegtables  tasted   like  they  were  cut  up     and  left   in  the  fridge  for  a  week.  (   and  they   still  gouge   you   for  rice  by  charging  extra)   its  probably   crappy  ownership  as  it  wwas  dead  @  1pm ..really  bad  stay  away", "author": "Tom J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-13", "description": "They say the definition of insanity is doing the same thing over and over again and expecting something to change.\n\nSadly, that's what the repeat visits here feel like...\nWith it being close to work and having a pretty decent set-up (limited but available outdoor seating and plenty of seating with the usual FiDi basement area), perhaps I keep hoping it'll be better next time.\nBut as said by many other reviewers before me, the flavor is bland and the dishes are not prepared well.  \nMy Pad Kee Mow was all lumpy and soggy and not spicy at all.\nThe spring rolls were wrapped in tortilla-like wraps and really bland.\n\nWould appreciate a good Thai option on Kearny...", "author": "Carol K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-11", "description": "3 stars. The Roti with Green Vegetarian Curry was decent though I wish they gave more Roti to go with the curry. Not a bad choice for fast and delicious Thai food a few blocks from work.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-17", "description": "We stumbled upon this place. I always love Thai food so figured we would try it out. It's a tiny little place and the tables are tight. But it's a perfect place for lunch as food came out quickly, service was efficient and friendly. Everything was good. However, my Tom Kha was completely devoid of spiciness. From past experience with Thai places, Tom Kha is usually incredibly spicy or at least has a bit of heat. That was the only problem I had. Don't know if this is the norm here or if they thought I looked like a wuss who couldn't take it.", "author": "April S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-23", "description": "This place is okay if you absolutely must have Thai food in the midst of FiDi and nothing else is close by. Otherwise, it's a true \"Meh. I've experienced better.\" in terms of take-out.\n\nI stopped by to pick up an order of pad see ew and the employee was quick in taking my order. They have this weird counter covering where if you are anywhere between 5 ft. and 5 ft. 5 inches, you end up eye-level with the cover and have to either stand tippy toe or hunch down in order to make eye contact with the employees.\n\nThe food came out before the ten minute estimation. What irked me was that no utensils were provided, they included two very thin napkins that could withstand nothing, and to top it all off, the portion filled up maybe half the take-out box. For almost $9, can I at least get a fork?", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-12", "description": "I suppose I cannot rate a restaurant based on one dish; however, I took a look at the other dishes that my co-workers ordered and it just looks OK. \n\nI ordered fried spaghetti (which was cooked in a Thai style). It was OK, but looked messy. The presentation could have been made to be decently appealing. The portions are just a bit smaller than expected.\n\nFor delicious Thai food I like Osha's near Post and Leavenworth. I haven't been to \"King of Thai\" for a long time but I remember it being satisfying for those late night meals.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-11", "description": "I was walking around the area at lunch time and was deciding what new place I wanted to check out.  Outside the door they had a sign saying \"Free Soup\" with purchase of any entree.  I thought, ok, I will give this place a try.  I went in and in the menu it had a combo that you can get a \"Free Salad.\"  I thought this sounded great.  I will buy one entree and get a free soup and salad!  So I was looking at the menu deciding which soup and salad I wanted to choose with my lunch.  \n\nWhen the waitress came, I told her I wanted to get the mango chicken curry that came with a free salad.  I told her which salad I wanted and she said, \"Oh, you don't get to pick which salad.\"  I said ok and told her which free soup I wanted to get.  She said that I don't get to pick that either.  I was a little taken aback by that , but was still optimistic.\n\nWhen the food came, the \"Free soup\" advertised was in a tiny tiny TINY minuscule bowl.  The free salad was more like garnish on the plate which was only some lettuce and maybe a piece of tomato.  The curry was ok, nothing special, but again the portion was really small.\n\nI felt that I was lied to about the free soup and salad. I didn't get to pick which one I even wanted, and the food wasn't even that good.  One star because I left there hungry and mad!  I will NOT ever being going back, EVER.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-09", "description": "Strolled past during a quiet midweek lunch hour. The on-table special (roti with yellow curry and tofu) was very very very good but the pik pao w/calamari was a huge miss. Service was a little slow (it almost seemed as if the guy was new, though?). Good Thai tea but even that is hard to do incorrectly.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "I tried the green curry and manga curry combo plates while here. Green curry (it's called something weird on the menu) had cucumbers in it, while the mango had big slices of fresh mango cut in.\n\nIt's good, but everything tastes rather heavy and dunked in grease (especially the egg rolls). Was also not a fan of the oily peanut butter dressing on the salads. I'd say that for the price, there's better places to be eating on this block of restaurants.\n\nService was also very slow and the dining area really loud. It does clear up significantly after 1pm though.", "author": "Janet J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "This is my favorite Thai restaurant in the area. \n\nJust make sure to call your order in ahead of time if you're ordering to go. There isn't much waiting room in this place.\n\nIt's gets pretty packed around 12-1:30pm so be prepared if you plan on dining in. They also have more seating in. what seems to be, their basement. It's more spacious than the main floor, but unless you request to be seated there or have a large party, they won't seat you down there. It's less noisy and more private as well. (don't worry, it doesn't feel like a basement.)\n\nNot too expensive and I'm almost always pleased... only had one occasion where the food wasn't up to par, but I've been going to this place FAITHFULLY for 2 years. Love it!!!", "author": "Marie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "I ordered food for delivery here and they cooked and delivered within 15 min! That's a great thing when you're starving. I prefer this \"fast food\" over the others.\n\nPros: fast delivery", "author": "Jenn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "Delicious!  Roti with green curry is a must. Decent prices. Cute hole in the wall eatery.  Friendly service.", "author": "Malia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "We flew in a candidate from the East Coast for a senior developer role.   A full day's worth of interview pretty much drains anyone emotionally, but we are kind enough creatures as to offer a decent lunch to people whom we might decide to hire.   One of my coworkers suggested Banana House since I veto'ed Osha Thai before anyone even had a chance to mention the name.   Since I'd never been here before, I was happy to acquiesce.\n\nThe decor leaves a helluva lot to be desired.  This place, with a small and very crowded upstairs and a slightly more spacious downstairs (though beware if you're claustrophobic because you're eating in the basement!)  We took a table downstairs and I ordered the Gang Traffic Jam, a curry combo with red curry, yellow curry, and green curry.  I made it a combo lunch, which includes a Thai Iced coffee and some egg rolls.\n\nI must say the dish was very tasty, with extremely generous portions, and I think the quality is far superior to what you get at Osha Thai.   Next time I'm looking for good Thai food for lunch I'll certainly be heading this way from now on.   In short, if you're into decor and trendiness, go to Osha Thai.  If you just want some damn good Thai food,, head on over to Banana House.", "author": "David O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-28", "description": "Perfectly serviceable Thai. They were busy the evening we went, but our server was attentive and kept our water glasses full. This is good, because the curry I got was pretty darn spicy! I do like spicy food, so this was a good thing. A surprise was that my curry came with brown rice, which was a nice, healthy, nutty option that went well with my dish.\n\nWe got the spring roll appetizer which was pretty good, though a bit pricey for what you got (but it's an app - isn't that always the way?). Overall, a tasty Thai joint, but not necessarily something to go out of your way for.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "Huge, delicious crab rangoons. Prik Sod is scrumptious with a bit of spice from the jalapenos. Thai Iced Tea is one of the best I've had in San Franciso. I definitely recommend for lunch in FiDi or if you are feeling lazy and want takeout for dinner (as I did tonight, ha!).", "author": "Kandace H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-28", "description": "I usually don't rate thai food so poorly, but this place really disappointed me today. I needed something soft since my teeth were bothering me, so I opted for tofu pad see ew and a Thai Iced Tea to sooth my aching tooth. Oh, and I really mean pad see EW...\n\nThe tea was fine, the food was not.\n\nThe pad see ew was so overdone, it smelled burnt before I even opened my to-go container. The tofu looked ok, albeit dried out, but it literally tasted charred, and my eggs were fried beyond recognition. I've eaten here  before, years ago, and felt that it was ok, but today just ruined it for me.\n\nI think the veggies were fresh, but the noodles, tofu and eggs had probably been sitting in a pan all morning already.\n\nIt was quick and friendly service but my last \"chewable\" meal before getting wisdom teeth taken out, was NOT a wise choice to be had from here. Sadness.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-10", "description": "I want to share my experience with all Banana House customers and worn them to be careful and check bank statement after visiting this place. On 10/2/2012 I went with my friend for dinner. The service was horrible and super slow. Food usually was good but not anymore. I gave them my card in order to charge me for my dinner and after a while the waiter got back to me and said that they will not charge me because they run out of paper. Instead, they asked to pay in cash. I paid the whole amount in cash and I left. When I logged in to check my back statement online, I figured out that Banana House waiter have already charged me twice for the dinner. At the end i paid triple. Now, I am super piss out and will try to find out what happened. I want my money back!", "author": "Natalia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "This place is great!\n\nI just ate here for the first time today with a coworker and had a great experience.  We were seated immediately, despite it being the lunch rush hour.  The place smells amazing!  As soon as you walk in it just reeks (in a good way!) of yummy Thai goodness!  Our service was fast and the food was great.  We both ordered the yellow curry and were no disappointed!  I'm a fan and will def go back.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-05", "description": "The pumpkin curry is good but that's about it. Their other food is average and you can get better quality at Osha's. It's always crowded so you need a reservation.", "author": "Kat P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-19", "description": "I gave this place another chance since my friend was craving thai food. I told her no, but that was the closest place for thai. My before experience was gross. Gross customer service, gross food. Anyways, it has not changed, the water is not even cold, the waitress takes forever to bring me hot sauce. (Isn't the hot sauce suppose to be on the table anyways?) Now, the waitress doesn't even say \"thank you\" when we leave.  It's still a no go. Still giving us the check in the middle of eating! If you are big on being treated nicely, great customer service, and having and getting respect, don't go here!", "author": "Poison I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-20", "description": "I ate here for the first time the other day. While not a fancy place, the staff was friendly and the food came quickly. I had ordered the Pad Thai which is my favorite Thai dish. The version they served had a really funky underlying flavor that I couldn't place, but also couldn't stand. My dinner companions tried it too and agreed that it tasted really weird so I ended up sending it back. I got the Pumpkin Curry instead which was really good. \n\nTo their credit, when I left the kitchen staff asked for feedback on the Pad Thai and seemed to honestly want to improve their menu which really impressed me. Would definitely eat here again.", "author": "Deb M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "MANGO CHICKEN TAP DANCING ON MY PALATE!!!!\n\nThis place is on Kearny and you can sometimes expect big suprises in small restaurants. It's always a toss up between Bankok's Best and Banana House, all the other thai restaurants next door are passed up. But I ate at Banana House first before Bankok's Best and I still come to Banana House more too. My coworkers and I would come here at least once every week or two. We stick to the picks we like. \n\nWhen you first walk in the waiters and waitresses great you and seat you down right away. I think they know we're regulars and seat us. For the longest we never really knew there was a downstairs. One time we were seated downstairs and I felt like I was in the basement. But usually we're seated on street-level by the window. The seats and tables suck. They're not comfortable. We get fast service and we can watch the cooks prepare our food. Their dishes are proportionate to the price you pay and the taste is SO GOOD. \n\nI love how they serve the dish with a scope of rice and salad, another cute bowl on the plate with the dish! It's so cute!\n\nI've order a good handful of items off of their menu:\n- satay\n- fried calamari\n- pad thai\n- garlic pan\n- some green noodle dish\n- fried banana with icecream! (yum)\n\nbut my favorite is MANGO CHICKEN! I cannot get mango chicken anywhere close to how this place services it. I can go on a streak and eat this everyday for lunch. It's THAT good. Definately yummy and knocks me palate!", "author": "Jane A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-23", "description": "Passed this place several times before deciding to try it. We only did takeout, so I cannot comment on service.\n\nTempted by the pad thai, as it my gauge for most Thai places, I decided to be healthier and went for something completely different: Duck Salad.\n\nIt was quite tasty, and despite its small size in appearance, quite filling. The salad was unique, and I would order it again. If I eat there again I would do a followup review, but overall it is an inexpensive, decent Thai lunch place.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-02", "description": "The food was fine. Not great, but good for lunch. The atmosphere is more divey than I'd expect, but that was fine too. What really got me was the service. We had to stare (Intently) towards the kitchen to get a server to come over and take our order.\n\nAfter waiting quite a while, one order came out and mine was no where to be found. After about five minutes I tried to flag someone down - which was quite a chore. By the time we got our food I had to eat quickly and get back to work, but not before the obstacles of getting a to go box, our check and our receipts. \n\nThanks Banana House, but there are a lot of other (better) places to go spend my lunch money.", "author": "Ixchel F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-01", "description": "My office ordered dinner here while working on a late night project. Due to said project, we absolutely could not leave our desks, even for dinner. This is where Banana House comes in, because pretty much all restaurants in the FiDi are closed at that hour, except for here and CPK. Thai food was majority's vote, and thai food is what we had for dinner.\n\nBanana House gets +1 star for free delivery before 9:30PM and + 1 star for quick delivery service. However, they got my order wrong (I ordered Pad Kee Mao with chicken; they gave me tofu...okay) and while they were thoughtful enough to tape the straw opening of my thai iced tea to prevent spills, they forgot to include my straw. Food was decent enough, about expected, and thai iced tea was delicious - still sweet even when water diluted. Compared to my lunch at Bangkok Best, I'd say they're both about the same, food wise.", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "I've eaten at Banana House for lunch or dinner for several years, so I should probably weigh in.  \n\nI've had better Thai food, and I've had much, MUCH worse.  Banana House is reliable.  It's open when I need it to be (lunch and early evenings), the food is okay, the service is okay, and it's cheap.  I like their pumpkin curry and their so-called \"garlic pan\" (I never did figure out the \"pan\" part) with chicken.  The latter will keep the vampires away from your door for days.  They do a barbecue chicken dish (take longer!) that's just a plate of boneless chicken thighs with a sweet/spicy sauce that I adore.  I like that they have brown rice available most of the time.\n\nI like you very much, Banana House.  You're not the Ritz, but I don't always want the Ritz.  You're cheap and easy (like some folks I know), and you're open when I need you to be (like...oh, never mind).  I will continue to patronize you and continue to be happy that you're there for me in the FiDi.", "author": "Earline A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-29", "description": "Busy little lunch spot.\n\nI ordered the spicy catfish expecting a filet. It was actually cut up pieces of pan fried catfish which was pretty good, very spicy, but ultimately not what I thought I was ordering.\n\nI like that each table has a number assigned to it and you go up and pay for \"Table #2\" or whatever, but it makes me wonder if anyone ever abuses the system...?\n\nService was pretty bad. I really needed some water after my spicy fish and had to wait 10 minutes before anyone came back to check on me. Meh.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-18", "description": "The calamari is wierd.  It's all batter.  The food is really greasy.  I don't think I need to elaborate.", "author": "Maria V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-25", "description": "Meh! Not the best Thai food place I've been to. Food is just about okay and the Thai iced tea was bad. I will not recommend this place, because of the more awesome restaurants around this very spot.", "author": "Saberi K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-28", "description": "I hate to do this...if you know of another thai place then go there.  I only go here when it's really empty.  They're already really aloof, and not so nice, God forbid they put you in the moldy downstairs room during rush hour.  Get ready for cold chicken if that happens.  I'm sorry, I appreciate the businessman's venture and all and I'm a strict capitalist, but damn get it together.  And I love thai food.  I'd drink curry sauce if it would hydrate me.\n\nthumbs down", "author": "Amir B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-01", "description": "I ordered here from Gopago and I will honestly say that this was my worst experience from any restaurant in San Francisco. Ordered - 15 minutes later, they messaged to say that my order was ready, so I walk over and show them my receipt. They find my receipt and take it to the kitchen, where they proceed to start preparing my order (Pad Won Soon). It took them 20 minutes to get me my order and four people who came after me received their orders (having waited 5-10 minutes) and left. This restaurant's staff is clearly not prepared for takeout orders - not to mention that their portions were also small.", "author": "Dexter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "Of the two places on this block (the other is Bangkok Best), I definitely prefer Banana House.  The service is always very fast, and it's a great option for a quick sit-down lunch (a rare find in the neighborhood).  I got the mango chicken both times I ate there, and quite enjoyed it.  Nothing to write home about, but a solid option for a workday lunch.  There's also a big downstairs area so don't worry if it looks really crowded from the street!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-10", "description": "3 stars average sounds about right for this place.\n$10 for an order of pad thai. it was dark brown instead of the usual pink that i'm used to. not sure how that affects the taste, tbh.\nit will fill you up probably, but there's not much meat compared to noodle. also my chicken was extremely dry so it wasn't that tasty anyway.\ni was waiting at the front for my order and an employee brought it out but didn't give me napkins or any utensils, lol.\ni work right nearby so if i wanted something quick and easy and were craving thai in particular i'd probably come again but it wasn't great at all, honestly.", "author": "Skinny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-30", "description": "I ordered the sweet & sour dish with chicken.  I can't speak for its authenticity, but I thought it was very good!  The food in general was good, and the portions were the perfect size for me (as in, they aren't super-large).\n\nThe only thing that got me was the prices.  Everything was just a dollar or two more than I preferred, and you had to pay extra to get rice.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Oh hell yes.  I have always been slow to steer away from my usual choice of pumpkin curry but the Banana house has two options that are now going to be in my permanent rotation.  Mango curry and Fruit curry.  I had the mango and killed the whole thing in about four minutes.  The fruit curry sounds even better so I am gonna attack that next time around.", "author": "Dru P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-23", "description": "Cheap Thai food. My friends love the soup named Broken Patroon (sp check?) but I found it very sour. Personal taste. I don't like the chicken satay with peanut sauce because it looks like sheets of eggs and there is no peanut in the sauce, bit like water mixed with peanut butter and call it a sauce... My friends thought she ate a piece of fried egg LOL... Fried rice with shrimp was quite nice with a hint of curry. The green curry with beef is not recommended because the sauce is too sweet for my taste and the beef, oh dear, did we order beef jerky? I like the papaya salad, I also ordered egg pancake because I were at one point confused that with the egg pancake I had in some Korean restaurant haha. My bad. So, everybody had a bit of egg omlette for dinner. \n\nService is 5 stars. The waitress was friendly and easy going and know when to come to our table. When I wanted to add the egg pancake order I were just thinking of walk over to the counter where she stood chatting with her coworker. However, as soon as she saw me stood up holding the menu she stopped talking with her coworker and quickly come round to our table to take my order. \n\nCustomers come in twos and groups. I think this place is great for a quick meal. Maybe we could come back for other dishes if we happened to be in the neighbourhood.", "author": "Bella A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-23", "description": "Part of knowing where to eat is figuring out which places are sit down vs. take out places.  Banana House is definitely the latter.  I wouldn't take my boss or client here, nor would I come here to propose or take my mom out for her birthday.\n\nBut I do come here for a quick take out meal while working late in the office.  It's quick, relatively cheap and relatively good (albeit a touch greasy).  \n\nQuick observations: \n1.  For some reason, they don't serve brown or jasmine rice.\n2.  Their open for Sunday dinner which is helpful if one's stuck working over the weekend.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "As is said in other reviews, it's a madhouse around the lunch hour and there is really no place to wait for your food if you're ordering to-go. The menu is large and vegetarian selections are noted for you.\n\nI had the Mango Curry with Tofu. Portion size was excellent for FiDi lunch, large enough to satiate but not too much. Flavor was good and curry seemed well balanced, my only complaint is that the mango chunks are ENORMOUS compared to the size of the other ingredients.\n\n+1 for being staffed by actual Thais. A good, solid choice for reasonably quick lunch in the area.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "Good, quick service. Tasty food and reasonable price. In the Finanical District, Chinatown area, Banana House is a good option (and costs less than the \"fancy\" chain Thai restaurant that has bastardized Thai food and has much higher prices).", "author": "Flynt I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-12", "description": "Pretty good place for Thai food in the Financial District. We went there because it seemed to be the only decent non-Chinese place open for dinner in that area. The owners were very friendly. Food was very tasty and fast. You could see them cooking it in the wok in the kitchen, which was interesting to watch. A bit pricy, but quite understandable for that location. The Tom Kha soup was delicious.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "Stumbled upon this gem when the restaurant across the way couldn't seat us. Went with a group of 8 people. Everyone loved what they got. I got the tofu satay appetizer. Best peanut sauce I've had. Would go back! Again and again.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "How can you not love this place for a cheap lunch?\n\nThe Pad Ke Mao with Tofu is awesome.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "Decent Thai food. Cant expect that much considering the area. Prices are decent for the togo buffet style.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "My boyfriend and I were in downtown and trying to find a good place to eat. We searched Yelp and Banana House won our votes. I had the Pad Thai and it was pretty good. But what I really enjoyed about the place was its service. The waitresses were really nice and honest. I wanted to have mango sticky rice for dessert, but she said their mangos aren't very good so she suggested I don't order it.", "author": "Samantha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "I ordered Spaghetti Kee Mao to go - the restaurant itself looks like well organized and the order was first come first served - I received my order  timely fashion.  When my order arrived it looked pretty decent as described on the menu - it was delicious but a little on spicy side - its not perfect but well above average and prices are cheap.  Highly recommended.  I should have added rice to go...definitely next time.", "author": "Lar G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-11", "description": "I've been here maybe three times spaced out months at a time.  Twice I got the mango chicken curry and the other time i got some noodle thing which obviously didn't leave much of an impression on me.\n\nThe mango curry was full of flavor.  After an hour or two I did start to get really thirsty so my guess is the salt helped the flavor along.  Anyway, the chicken in the curry was tender and there was a good amount.  The mango pieces were good too.  Overall I really like the mango curry - obviously since i remembered liking it enough to get it again.  Anyhoo, for the financial district the pricing is about the same.  The portion is a little smaller than I'd like it to be.  I did run out of rice before I finished the curry but I am pretty heavy on the carbs so I guess that could just be me.\n\n\nwe got there a little before 12 and got seated right away. there were a few more tables open but i imagine they fill up quickly.  the service was quick.  our table was oriented sorta weird but it was alright.  I'd come here again if I felt like thai curry.  It wasnt spectacular but it did the trick.", "author": "S T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "I'm upgrading this to five stars because it is so consistently good in quality and delivery,   Really dependable.\n\n\nWow, really good especially for the money.\n\nI order a lot of delivery via eat24 and I tried Banana house a few times now.\nThe Masaman beef curry is AWESOME.\nThe Yum Nuer is very good.\nThe Larb Gai is good.\nThe Tom Kha Gai is bland and watery.  \n(What is it about SF that you can't find good Tom Kha anywhere?)  Hit SJ or SoCal for that.\n\nSo, there are enough really good things here that I'll keep ordering.  Prices are BELOW MARKET.", "author": "erin b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "I had a Chicken Yang Dang and it was spicy & nice.\nMy girlfriend had a Mango Curry with Prawns. That wasn't so good.\n\nOverall, it's a good Lunch place.\nI recommend it and would myself go there again.", "author": "Bhagya D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-07", "description": "We came here after visiting some art galleries, and were quite hungry after drinking a bunch of free wine. We were also looking for something reasonably priced, which can be somewhat difficult to find north of Market street.\n\nOne of the members of my group strongly advocated for this place, so we sat down. A bunch of people got the Thai Iced Teas, which looked good, but I stuck with water.\n\nThe menu has pretty much all of the Thai foods that you could want. Everything comes with beef, chicken, pork, or tofu. I'm not eating a lot of meat these days, and happen to be allergic to tofu, so I actually went for the fried rice, which had the option of pineapple.\n\nThe pineapple actually went pretty well with the fried rice. It also had cucumber, tomato, and a lot of green onion. Oh, and of course egg. An hour later, my breath still smells like green onion. Overall, the food was solid if unexceptional.\n\nThe decor was plain but clean, and the service was fairly good. They split up our checks without us asking - we had a party of seven people, and they added a gratuity to that. My meal came to $10 all inclusive, which seemed a bit stiff for fried rice, but it wasn't a complete ripoff.\n\nOverall, not a bad place to go. Decent food that isn't horribly expensive and is edible.", "author": "Dana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "Up in SF for a (successful!) meeting, I stopped into this restaurant on Kearny.  It is a tiny place, jam-packed with customers.  I was in search of some healthy-ish Thai food.  I found the Thai salad, which is a chopped salad served with boiled chicken and peanut sauce on the side.  Conclusion:  Thai Salad:  healthy for sure.  A bit boring for sure.  \n\nI looked around at the other dishes, and they looked reasonable.  Some folks were sweating profusely, so the hot food must be hot.  Not sure.  I just had cold veggies with a tiny bit of peanut sauce (I held back).  I might give it a higher rating if I ate something better...", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-06", "description": "I hate to do this, it is my first one star review but literally this was the worst Thai Food I have ever eaten and there was nothing redeeming about the place. \n\nI should have been tipped off after sitting down and then sauntering to the bathroom that I saw not one but two microwaves on my trip but I didn't think much of it at the time. \n\nI ordered the Pad See Ew and the meat was extremely overcooked and the flavor of the noodles was way to sweet. \n\nMy group ordered Tom Kha to start and it was overcooked and under flavored and we ordered Thai spring rolls, instead of the usual sticky-rice-paper clear wrapping they were wrapped in some cheap knock-off paper and tasted like it. \n\nThe worst part was the vegetables - they were mealy and gross - clearly not ripe or even in season, please do yourself a favor and do not go to this place.", "author": "Marissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-24", "description": "I'm a huge fan of Thai food and have once again begun my never-ending search to find the best Thai restaurant within 20 miles.\n\nBanana House doesn't take that honor, but I would definitely go back. Menu has some interesting options you don't always see, and I was very happy with Basil / Octopus curry. My wife's yellow curry was a little less exciting but still good enough.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-28", "description": "No Food, no stars.  We were seated promptly and then no one came over to take our order or give us some water and utensils.  Nothing for 10 minutes!  So we left went over to a great middle eastern food place a few doors down called Balade Cafe.  We ordered and we were eating in about 5 minutes.  True.", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "Nothing fancy that's for sure but decent, good, fresh food. The mango curry was very good. Service was good as well. Looked like a lot of folks ordered to go.\"", "author": "Gail M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-11", "description": "Not good. I read the other reviews but went in with an open mind to try some appetizers and will not be returning.\n\nShrimp Bolster (deep-fried prawns rolls with S&S sweet chile sauce, $7.95):  Yuck, shrimp was squishy and was sliced in half - so you don't even get whole prawns! Worse yet, the shrimp was not \"de-veined\" - meaning there were giant turds in each one of them. Really disgusting. I order the same things from Chai Yo on Polk, or Koh-Samui on Brannan and they're clean, crispy, and poop-free. Do some people not mind eating shrimp poop??\n\nTom Kha Gai (coconut milk soup, vegetarian-style, $6.95): There were barely any vegetables in it aside from 3 or so mushrooms, some canned baby corn, two tomato slices, and some unhealthy/crinkled and wilted lettuce. The lettuce had speckles on the stalk area that looked like some sort of plant disease.\n\nIn all, a very expensive lunch and I threw most of it away.", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-30", "description": "After a meeting with a client, my co-worker and I were standing in front of the client's building discussing where to have lunch.  Someone overheard us saying we wouldn't mind some Thai food.  This stranger piped up and said we should walk down the street and less than a block away on the right was a really good Thai restaurant.  Well, I'm not sure if we went to the one he was recommending, but Banana House was a disappointment.  The food was tolerable, but nothing special.  Service was also just tolerable.  The interior was dingy and not very clean.  We were seated downstairs, which was claustrophobic.  I definitely would have checked Yelp first if I had had an Internet-enabled mobile device with me that day!", "author": "Sherri C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-31", "description": "Banana House has risen to the occasion many times for group lunches with my co-workers.  It is one of the few places we have found in the financial district that can ALWAYS accomodate our group of 10, without any wait.  The downstairs seating area is their secret weapon in being able to do this.\n\nI really have no complaints about Banana House.  The food is pretty good, and the prices are reasonable.  The service is decent, although their kitchen seems to be on the smaller side because we are usually served two plates at a time, every couple minutes or so, until the entire group is served.  It takes a little while, but they have been very consistent over our many visits.\n\nFor entrees, I'd recommend the Yum Talay \"Salad.\"  It's a refreshing salad of silver noodles and a tangy chili/lime dressing, served with pieces of calamari, mussels, and prawns.  I've also enjoyed the Chicken Cashew Nuts, as well as the standard Chicken Pad Thai.  An added bonus is when they play old episodes of Mr. Bean on the downstairs television.", "author": "Tim N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-08", "description": "We were walking around on a Saturday and this was one of the only restaurants open on a weekend, so it already gets an extra star.  Overall the food was decent.  I had the special, mango fried rice and everything was really good.  I tried the sweet and sour and it was fairly boring and disappointing.  The sweet and sour gets 2 stars and mango fried rice gets 4, so that is the 3 star total.  The place itself seems a little dirty and run down, but what are you going to do when you are starving and everything else is closed.", "author": "Jonathan U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-09", "description": "Cons: \nBland - NOT what Thai food should taste like.\nThe little green card posted next to the door... or what's written on it.\n\nPros: \nFast, cheap (relatively).\nClose to work!\n\nSaves me time on my one-hour lunch break, but I was expecting a little more. Okay, maybe a lot more. I'm Indonesian and thus crave Thai food a lot (as close as it gets to my culture around FiDi), but I don't think that's even enough to make me come back here, judging only from taste. \n\nI know I have a weak stomach and immune system, so I won't assume this is their fault, but I did get stomach ache and go to the bathroom a lot after this lunch... ... ...", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-24", "description": "*sigh* \n\njipped.\n\npretty sure the mango chicken curry i ordered was supposed to have more than just mango, chicken and curry. otherwise, i wouldn't have ordered it.\n\nlooked to my left. my friend had bell peppers & zucchinis in her pumpkin chicken curry. looked across. my friend had basils & beans in her pangang tofu curry. looked at mine again. the mango & chicken swam in a bowl of loneliness.\n\ndon't know what compelled me to sit quietly and not mention it to the waitress. maybe i didn't care for the food. possibly. maybe i wanted to wait til i'm back at the office to shed my tears. probably not.\n\nfood was mediocre. the mango was too ripe, and therefore, became too soft after being cooked. the curry lacked heat & flavor. \n\nslow service too.", "author": "Marti L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-19", "description": "This little colorful Thai restaurant on busy Kearny street is always bustling with people. But don't be deceived, they have a downstairs as well so getting seated is usually not an issue or as low as a 5 min wait. I like to sit at one of the little tables out front when the weather is nice. \n\nAfter being seated is when the wait usually comes, even though they have a lot of servers, you usually have to wait 10-15 before they take your order. \n\nThey have a great menu with your traditional appetizers like satay and spring rolls and new items like Thai sausage. I usually get the pad see ew noodles with steamed tofu and it is pretty delicious. They have a large variety of curries if you're into that. \n\nI love their mango with sticky rice dessert. It is super yummy! \n\nI've also been getting to-go and the wait is usually 10-15 min.", "author": "Gladys C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-06", "description": "I got their Papaya salad for lunch today. It was super liquidy. It had lumps of sugar or something like that. The lettuce was soggy(ew!). The shrimp tasted a little stale. The salad was also very stinky. I have a cup of cinnamon tea on my desk to get rid of that smell.", "author": "Fashfre C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-07", "description": "Ew. The people are nice but the food is disgusting. I lived in Thailand for a while and am a huge Thai food fan - this is not good Thai food. Ordered the pad se ew - and it was burnt. Pieces of black char on the noodles and veggies. The summer rolls were literally pieces of tofu in this weird rice roll that was kind of grainy - not the typical rice wrap you'd see for summer rolls. Disgusting, I couldn't even eat it. And they charged me $3 extra for shrimp ($11 for summer rolls when you can get it for $6-7 anywhere else with shrimp included). They forgot to give me the rice with the pad ka prow....the only thing that was good (very good) was the mango with sticky rice.", "author": "anjali s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-24", "description": "I ordered the Tofu Pad Thai from here the other night while staying late at work. Let me start off by saying my office is one block away and that it took about an hour to deliver. We had to call once to find out what was taking so long before it arrived. \n\nTo keep the story short, WORST Pad Thai I have tried. It was dry, the noodles were completely stuck together and it had no flavor. That was just my dish. My other coworkers who ordered there food also complained their food was awful. One coworker order the curry and it didn't even come with rice!", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-12", "description": "Banana House...hmmm...sounded like an all-male nude revue to me. I thought maybe Boy was going to leave me here with a stack of $1 bills and come back for me when the show was over. Unfortunately, it's just a lunch place in the fidi. \n\nFortunately, the food is damn yummy. Even my anemic-looking mound of boiled chicken breast (they *do* have breasts...just no bananas) over iceberg lettuce with limp tomatoes and too much cucumber was magically brought to life with a delicious peanut sauce dressing. It was gone in about 5 minutes. It was A LOT of chicken for around $7. Boy's pad ka somethingorother with wide noodles and burning hot spices was really good too, if a little small for $8. \n\nUnfortunately, it took about 25 minutes to get our food (this is not a fancy establishment and therefore I had guessed it would be a little faster). \n\nFortunately, there is ample seating and the there was no wait to sit at a big window table during the fidi lunch rush.\n\nUnfortunately, for $20 we could have had two tomato soups in puff pastry at Jeanty at Jack's and it probably would have come faster too.\n\nI may do take out from here in the future- they have a pumpkin curry I'm dying to try. As it stands, though, I really think this block could use an all-male nude revue a lot more than it could use another Thai restaurant. They wouldn't even need to change the name...Just a suggestion...", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-20", "description": "DO NOT GO!!!\nI was really tired and hungry the other day, so I randomly picked this restaurant on the street. My sister tried to stop me, but I was too tired to listen, so I just went in without looking at the menu outside. \nwe both ordered ice thai tea, and my sister tried to tell them to put less sugar, but the waitress said \"they are already made.\". SO here they come the sweetest ice thai tea I have ever tasted...\nwell I thought the food may not be that bad, so I ordered my favorite thai dish, which is roast duck fried rice. But I was really really disappointed!!!the rice was a mess..and the egg was not combined with the rice, as well as the duck...LOL \nMan, how is that considered Fried Rice???\n\nI think this restaurant has no heart, no passion for food!!!", "author": "Christy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-13", "description": "Banana House needs a coat of paint; It seems like what was once a very modern, stylish restaurant has been weathered by years of waiters running back and forth, and office workers sitting down for a quick lunch, or waiting to be seated, or waiting for a take out order. Mostly doing a lot of waiting.\n\nSee, compared to many of the lunch spots in the area, Banana House is painfully slow; We waited around 25 minutes between ordering and eating, and it's even worse when your table is right by the entrance to the kitchen area and the waitresses walk by you with plate after plate of food. They almost appear to want to say to you \"Check out this steaming plate of Pra Ram Chicken that someone else is going to enjoy! And I wonder who's gonna get this delicious looking Pad Thai? Not you! Sorry!\"\n\nWhen your food finally arrives, you may find that they make a pretty good plate of Pad Kee Mao, plenty spicy and a less greasy than you'll find at a lot of places. The basic chicken salad isn't anything out of the ordinary, except that they make a tasty peanut salad dressing. \n\nI could be persuaded to come here again. There aren't lots of Thai options down this way, and Banana House has a pretty extensive menu (though missing the Gaeng Ped that I had there on a Saturday two or three years ago.) Try to miss the lunch rush.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-17", "description": "The food is very tasty and well spiced, portions were good, the menu is extensive and they have the best desert on earth - Mango and Sticky Rice.\n\nIn short, If I have a hankering for good Thai again and I'm in the Financial District I'll head back.", "author": "Todd E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-11", "description": "There is nothing better than a good Thai restaurant close to work or home.  Sadly, I'm still looking for one.\n\nYou'd think that if the Banana House folks were veg-savvy enough to offer veggie versions of many dishes, and ask if egg was OK in my Pad Thai, they'd know not to add fish sauce.  But they didn't.  Ick.  \n\nGreasy + fishy = queasy afternoon.  Ick ick.\n\nI'll give them another try and see how the pumpkin curry and brown rice fare, but I have to put some time between my tummy and the BH for a while.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "I am not a Thai food connoisseur... I just know at some places I like it more than others.  I like it a lot here.  I almost always stick to the soup, because they have one that I absolutely love.  If I feel crazy, I'll get the mango and sticky rice for dessert, which happens to be my favorite dessert in the entire world.\n\nI'm not one to care about fancy decor, but even I noticed the ambiance here is naught.  Just a simple coat of paint could make a world of difference.\n\nThe service is generally fast, though, to be fair, I've never been here during a busy time.  I live in my own time zone, so I tend to get hungry at odd times.  Sometimes the staff isn't terribly attentive, but they have always been polite.\n\nOverall, it's conveniently located,  fairly priced, and I really do love that soup.", "author": "Krystal K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "Yummy yummy yummy I've got Thai in my tummy!!!!!\n\nToday I met my noodle-caboodle here for a mid-week alcohol free adventure.  We got a quick chance to kvetch about our jobs over curry goodness.  The amount of food was just about right.  I felt full, but not like I was going to explode.  It was $22 for 2 lunch specials and 2 diet cokes - before tip..\n\nFYI - The tables are close together, so this is not a good place to do any insider trading.  But we did learn that the girl at the table next to us had a real Cartier watch on, and the girl with her had a similar fake one at home.", "author": "Nikki c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-06", "description": "This place is solid and inexpensive.  And, having sampled pumpkin curry at many Thai restaurants, I think the pumpkin curry at Banana is, well, solid (there's that word again).  I always order the pumpkin curry with tofu, because frying tofu is something I think they do especially well at this establishment; it's perfectly braised and tender with a thin golden skin.  \n\nAdditional solid menu items include: spicy catfish (actually spicy!), pad thai, pad see u, and, as mentioned above, the pumpkin curry.  I'm curious about the fried eggplant and the papaya salad, but I've somehow not gotten around to trying these things, though I'm sure I will since this place is on my lunch venue circuit.  That tells you something there.\n\nThe appetizers are not worth it here from my experience- they're basically a selection of things straight from the freezer to the fry basket, and despite the dexterity shown with the tofu, the fried calamari and fried corn patty appetizers (more patty than corn) are seriously OILY, a sensation I think caused by the oil not being hot enough during the frying.  And this is coming from a person that likes oily things.  Really.\n\nIn closing I'd just like to say that this is a satisfactory lunch time eating experience.  It is not, however, THAI FOOD TO DIE FOR, nor is it as good as Osha.  That being said, you do get what you pay for here, and as long as you aren't expecting a mind-blowing experience, but instead some solid grubbing, then you'll be happy dining here.", "author": "Chalk A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "Nice place to go for lunch in the Financial District area.  The food is good but nothing stands out amazingly.  The staff is nice and the service is pretty quick for it being really busy at lunch hours.  Overall not bad, try this place out.", "author": "Jesse C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "This place has good honest well-priced Thai food. That said I don't have anything very interesting to say. My boss did get some avocado in her curry.\n\nThey didn't tell me they were out of brown rice until they brought my order to the table. Their duck in red curry with pineapple, peppers and basil is spicy good.\n\nI guess I have no business writing a review of this place tonight.\nI did not like the iceburg lettuce with sweet peanut sauce on it. Blech.\n\nUpdate: I apologize for this boring uninformative review. The truth is, I'm so sick of Thai food I wouldn't care if I never saw it again.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-22", "description": "My co-worker Nate A. is the poster child for sales.  Young, ambitious and ripe for the picking, this self-starter has managed to crush it his first two quarters on the job.  However, he is also a self-confessed emotional eater...which is awesome for me because he always comes into the office with new grub.  Now he NEVER shares his meals, but he will tell me where he bought it so that I too can lean on a stress-induced food crutch.  \n\nOne particular doozey of a morning, he decides to order pad Thai at 10 a.m.  It was huge.  It was aromatic.  Did he share it with me?  No....but I did trot right up to Banana House to get some for myself.  I ordered before lunch hours, so the food was ready in about 15.  I then proceeded to eat delicious chicken pad Thai for the next day and a half due to all the leftovers. \n\nDecent for takeout, gets pretty busy during lunch, dine-in questionable....", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-29", "description": "Four a lunch spot, I give Banana House 4 stars.\n\nGood size portion for the price, fresh ingredients - the veggies in my Pad Kee Mao (spicy pan fried rice noodle with broccoli tomato, basil and bell pepper with chicken or tofu) - retained a good crunch.\n\nCheck out their weekday lunch specials - for curries or Banana House Plates, you get a side of Rice, Fried Wonton, and Thai Salad.\n\nService is friendly.  The inside is a bit cramped, but good for those cold SF days.  They have a few tables outside for those nice golden ones.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-25", "description": "I felt compelled to write about this place affter just one visit.  My friends and I were really hungry and all I wanted was some simple pad see ew.  I just wanted something fast and I wasn't looking for the best pad see ew ever.  \n\nFirst of all, service was not good.  Not everyone was hungry so not everyone ordered dinner and the waitress was extremely mean about it.  Not cool.  Even throughout dinner, service was poor and the waitresses were rude.\n\nSecond, the food was terrible.  Almost everything had too much sauce, and that was true for the pad see ew.  It was just really thick and saucy that you couldn't even taste the underlying food.\n\nOverall, it gets two stars for poor service and poor food.  Not recommended.", "author": "Aron L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-29", "description": "I came here by \"accident\" when I attempted to go to Muracci's next door, but they were FRIGGIN CLOSED this whole week for thanksgiving (understandable, but hmph, disappointing still) anyways -- I had a red curry w/chicken, pretty standard and all, but still good, good enough I might come back (even after reading the cockroach comment/review? possibly maybe..) \n\nthe staff was pretty nice and accommodated to my request to replace bamboo shoots (hate those things!) with broccoli instead.  I asked for spicy but it was more mild for my taste.. guess I have to say EXTRA spicy next time..", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "This is not one of my favorite places, but I always give it a chance. I figured, I might get lucky one day . But truth be told. It really doesn't do much for me. Of course, that is just my humble opinion. \n\nThere are other options out there for lunch, this certainly is not one I recommend. It is just ok and leaves me wishing I would had gone elsewhere. My main complaint is that it just feels too greasy, soupy... I can't put my finger on it... but the consistency is just not right with the sauces. And from the looks of the other reviews on here... it isn't just me. Hopefully they will work on it and make it all better. Places like this make me miss the dungeon on Bush and Kearny (Damn the fire!)!", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "LOVE the pad see ew with chicken! Best I have had so far :) Im so hooked Im going today!", "author": "Stefanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-10", "description": "Great lunch menu. Big portions at cheap prices. \n\nI went with the yellow curry with chicken and tofu over rice. It was PERFECT. That with a little salad and thai iced tea all for $10. Standard lunch price, but very very yummy!", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "Banana House is a staple of my financial district diet.  There have been periods of time when I ate four meals a week here.\n\nAll the curries I've tried are great.  I recommend getting the combo meal version of anything, as the salad, spring rolls and thai iced tea make a great compliment to the main courses.  The Salmon Curry is delectable; big chunks of salmon and avocado make it feel like one of the healthiest things I've ever consumed.\n\nBanana House is not particularly fancy, but it is delicious.  I wouldn't take a date here, if I had a date, but for workweek lunch or even dinner, it is Highly Recommended.  I'm a known repeat offender at the Banana House.", "author": "Oliver N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-11", "description": "This is one bustling lunch spot!  But when I got here there was a table available and service was prompt.  Ordered the spicy eggplant with chicken and it was pretty good - a balanced, spicy sweet sauce with chunks of eggplant and tender slices of chicken.  The heat came from green chilies and the sweet came from sugar in the stir fry sauce and from slices of red bell pepper.  The steamed rice was okay, but I got a heaping portion.  And the side salad had a good peanut dressing that wasn't too sweet or overpowering.\n\nI've been here with coworkers before and had green curry which was also pretty good.   \n\nThree stars for being a good, inexpensive and quick Thai lunch place.  I've had better flavors, but then again I've also had worse.  Banana House is alright.", "author": "Eileen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-09", "description": "Meh. That about sums up my experience here. Came in on Monday and since i was dining alone was put in a corner facing a wall. Took the servers about 10 minutes to realize I was there... almost walked out. Ordered the lunch special. Salad was good. Had green beans with chicken but was so spicy I almost couldn't eat it.\n\nDoes okay in a pinch but... I thought 10.00 was a little steep for that.", "author": "laura f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "Came here for lunch for a work thing.  It's not gourmet Thai by any means, but it's fast.   Our server was funny and was quick to respond to jokes.  I like that.  One extra star for her.\n\nVarious orders all around, so I will only speak of my Yellow Chicken Curry and my co-worker's Chicken Pad See Ew.  Two of my favorites in any Thai restaurant.  I won't say it was the best I've ever had, but it was good.  My curry had lots of juicy chicken and it was spicy !  WHEW!  Pad See Ew was loaded with chicken and veggies. \n\nIt's a little out of my  way for a quick lunch, so you won't find me there too often.  But if you're in the area, I would recommend trying it.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-16", "description": "Came here for lunch today....just a note to everyone, during the lunch hour this place is packed and the wait for a table isnt that bad but dont expect to do anything else after eating other then heading back to the office.\n\nAnyhow, so Wilson, Alex and I waited about 5-10min at most for a table which wasnt too bad during this hectic time of lunch. The waitress gave us our menus and noticed how they had a nice lunch special in fine print at the bottom of the menu. The funny thing is that they have a big box on the menu for a jasmin special (i think thats what it is called) that you add on for 3.50 or so. The lunch special comes with rice and a small salad added to your order so this will technically be the bang for your buck.\n\nI had the yellow curry with chicken, Wilson had the red curry with beef and avocado and Alex had a chicken with rice noodle. Overall its pretty good. The yellow curry wasnt too salty or heavy and Wilson seemed to enjoy the red curry quite much. Not so sure how Alex enjoyed his food but he seemed satisfied and finished the entire dish.  Banana House gives you a good amount of food so you are not too full and wont fall into a food coma at work.\n\nOverall we all paid about 10 bucks a head which isnt too shabby and it seems to be the norm around these parts of town during lunch anyhow.", "author": "phillip w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "Decent service and moderate prices keep me coming back to this place. Banana House is one of my go-to lunch spots in the Financial District.  It has swift service so you can easily get in and out in less than an hour. The food here is warm and comforting though certainly not the best Thai that SF has to offer.", "author": "Jamie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-20", "description": "My stomach:  I'm in the mood for noodles, J.\nMe:  Uh, alright, S.  Hmm...  Can I interest you with a visit to Banana House?  And can we invite a real friend? \nMy stomach:  O-kay...(begrudgingly tags along).\n1 hour later...\n\nMe:  Well, stomach.  How was the meal? Did you enjoy the company?\nStomach:  Silence, with the occasional digestive gurgling.\nMe: I guess that means she's full, happy...and sleeping.  \n\nMe:  I've been to Banana House a few times already, each time really enjoying my meal.  This time my stomach wanted Pad See Ew which was incredibly alive with fresh thick rice noodles & broccoli.  But ya gotta like fish sauce & the sweetness.  And for a little extra moolah, you can overindulge in some egg rolls, Thai ice tea & rice.  I don't quite get that combo though...\n\nMy stomach and I will return here again, when we've got hankerings for Thai.  Bring a friend or your stomach at least.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-30", "description": "My coworker's favorite - Mango Curry with Chicken.  \n\nI don't have a favorite here.. I try out bunch of stuff:\n\nSpicy catfish - S-P-I-C-Y!  no joke!  Hecka tasty tho\nYellow Curry - Big portion.  Pretty good.  Not too special however.\nPad Thai with Prawns - T-A-S-T-Y with big prawns.  Very generous.\nPineapple Fried Rice - yum!\n\nNext time imma try the House Yellow Curry fried rice with.... i think it said raisin there... hmmm interesting....", "author": "Gigi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "I went here for takeout at lunch today.  For a value lunch it was great!  I had the pad see ew with tofu and have to say i was pleasantly surprised!  The broccoli and carrots were not overdone and the tofu was soft.  The portion was perfect, not too much.\nDefinitely crowded at lunch time and not much atmosphere, but excellent for takeout.", "author": "lena m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-11", "description": "I'm a fan of Thai food, and this place is one of the best.  The prices and the food are amazing, especially for how much you get.  The Gang Dang is the perfect amount of spicy, and their lunch special includes rice and a Thai Salad as well, so you can't go wrong for under $10!\n\nIf you have to grab lunch in the Financial District, definitely check this place out.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-10", "description": "this place is a DUMP.  it constantly smells like bleach or piss and if you sit downstairs it is like a dungeon.  two thai places around fidi closed and sucks that this place is open now.  always check your credit card statements because they double charged me.  place is totally shady.", "author": "F S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "This place is a regular favorite for my coworkers.  I find it alright.  Nothing amazing, but I'll still go there with them.  If you can try to sit upstairs.  Downstairs is dark and not as nice.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-20", "description": "Whatever I tried there was good! I don't eat spicy foods and they always made it very mild for me and i was able to enjoy it. I work in the neighborhood and I come there quite often (especially if I go shopping at the Loehmann's near by) :-)))))\n\nI don't like their downstairs floor; it's stuffy and just not good! They couldn't fit a party of 6 at the top floor and we had to sit downstairs and I couldn't wait to get out. \n\nTheir menu has some perfect choices and the service at Banana House is excellent. Not once I had to wait for my to-go more than 10min and it was well prepared and nicely packed. \n\nBanana House here I come...:-)", "author": "Katja S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-29", "description": "They have a room downstairs as well and they accommodated 9 of us for lunch. The service was pretty fast and the food was good, but nothing outstanding.", "author": "Yoko S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-17", "description": "When a mango curry costs 7.95 plus tax I expect the taste, portion, or something to match the price. It tasted ok, but the portion was so small. Luckily I came in during lunch time which at least it meant the entree came with a tiny scoop of rice and some salad otherwise I think I would have had a heart attack., but it still was ridiculously EXPENSIVE! \n\nTo top it off, I had a piece of plastic in my rice. I told the waitress. She took the piece from me, said ok and than walked off. Uh, not even a sorry? Thanks, it made me really want to come back again. Not!", "author": "Erica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-30", "description": "I tried the string beans with chicken lunch plate today and it was too spicy and too salty. I probably just ordered the wrong thing because it was pretty crowded during lunch and the service was fast.", "author": "Helen Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-12", "description": "They serve pumpkin curry! YAY!\nThe entrees come with a small salad. Neat!\nMost of their veggies are unripe and taste like cardboard. BOOOOOO...", "author": "Dave M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-15", "description": "Pumpkin Curry - bland, yet overly greasy. There was an inch of oil floating on top.\n\nEggplant with chicken - bland yet overly greasy.\n\nPad Thai - overly sweet.\n\nPapaya salad - overly sweet, but still satisfying.\n\nIn terms of Thai food in the city, Banana House gets 1.5 stars. They get an extra 1.5 stars for being the only Thai place that delivers to my office (essential for those days when I forget to order dinner through our service and it's raining or I'm too lazy too pick up takeout from Golden Star). The food may suck, but it's sucky food that's DELIVERED, and between having bad food and having no food, my stomach would rather have bad food (although my taste buds would rather have no food).", "author": "Deb I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-29", "description": "I just finished eating my take out from this place.  I have never had \"spring rolls\" like this.  It was almost like they were wrapped in tortilla or a lavash or something, with barely anything on the inside.  That was pretty much really gross, and super disappointing since the place I really wanted food from (but was closed) has pumpkin and mint in their spring rolls.  \nI also got a green curry, it was standard, nothing that spectacular, but not as gross as the wrap rolls.  oh and the rolls had a pile of egg on top.  gross.", "author": "Katherine K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-30", "description": "THIS PLACE SUCKS.\nWe just ordered 4 lunch entrees to be delivered to the office, spent over $45, and not only were the orders totally incorrect, but also the food was super spicey, rather than MILD, which we specified several times when the order was placed.  \n\nI tried for 20 minutes to get someone on the telephone, and when i finally did the woman did not speak English, and had the nerve to ask me to call back when they were less busy.  I refused and told her the issue and so I \"held\".\n\nThe manager or whomever got on the phone and asked me to COME IN to return the food.  I told him it was not an option, since we had it delivered in the first place.  He asked me to call back at 3 when they are less busy.  I refused to do this, as well, so he said he could not help me.  I told him that if he did not either 1) get our orders right or 2) compensate us now, or I will tell everyone I know to not eat there.  \n\nHe finally took my telephone number to \"call me back\" 4xs--yes!  4 times before he got the number right.  This place might as well have rats, because not only am I never ordering from there again, but also I am spreading this story like the plague.", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-04", "description": "Great place for Thai during the week.  It's close to work, and better than the other place which is just a couple of doors down.  However, the cooking is just okay.  You can definitely find better Thai food somewhere else in the city.  \n\nThis place gets my \"3\" based on authenticity (it's staffed by Thais), price (moderate) and location.", "author": "Rod '."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-09", "description": "See my review of \"Bangkok Best\"\n\nThis restaurant is basically the same restaurant, they share the same chefs, same servants and etc.  The decor is just different between places and they're only less than a half block away from eachother.\n\nI highly recommend though, if you're looking for some good and inexpensive Thai.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-10", "description": "I love that the wait staff here pays such close attention to the state of my water glass, or maybe that was just today.  I drink a lot of water.\n\nI was all set to order my gang panang - combo style with my thai iced coffee, veggie spring rolls, and salad (overly drenched with warm (ew!) chunky peanut butter?), but my companion was adamant that Thai food is ALWAYS served family style, that if it wasn't family style that was like saying I like to eat my steak on the ceiling...  I argued that this was a FIDI lunch spot and maybe people want to eat their own food, and not pine over a dearth of pad see ew that Bob from accounting just shoveled on to his own plate, leaving you a few flat noodles and a sprig of broccoli.  \n\nSo I acquiesced and we ordered the pad thai, and the gang panang.  The gang panang was pleasantly spicy, but skimped on oversized chunks of avocado and chicken.  The pad thai on the other hand was overpowered by someone's heavy hand with the fish sauce.  I couldn't stomach it.  You do realize how fish sauce comes into existence right?\n\nI've had much better thai, but it wasn't greasy and is reasonable and fast.  It'll do in a pinch for lunch, if you twist my arm.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "One of the great things about my life is that I've always been surrounded by people who are amazingly smart, shockingly talented, and occasionally even really nice.  It's all really more than a simple cowboy lawyer ought to be able to ask for.  Case in point: in law school, I met a woman who was an Ivy League grad, former political science professor, and now a classmate.  And she worked with me in the hallowed halls of the DOJ (local division), trying to make the world a better place.  And she LOVED Thai food.  They serve a lot of that in Boston, apparently, not so much back where I come from.  She made it her personal mission to educate me about the wonders of Thai food, and in the course of several dozen lunches, I became a fan.  We had our last Thai lunch when she was amazingly pregnant, and before I moved (never to see her again), I got to meet her daughter, who was at that time 5, and who apparently loved Thai food as well, likely from all the neonatal doses ingested by her mother in my presence.\n\nBy the way, that story makes me feel old just telling it.\n\nMy standard for measuring Thai food is the duck curry.  If the restaurant doesn't have it, or has only mock duck, I'm dubious right out of the gate.  Banana House has a great duck curry, and from that I deduce that they have other great foods, although I've never had anything else, because when you can have great duck curry, why have anything else?\n\nAnd it is the blessing (and curse) of the particular functioning of my memory that every time I sit down to a big bowl of delicious duck curry, I think about Robyn, and I wonder how big her daughter is now, and I remember where I was in my life when we first ate duck curry together.  I don't know whether such unshakable memories are a blessing, a curse, or both, but I have thousands of them.\n\nNot all associated with duck curry, though.\n\nBen P: Free story with every review.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-19", "description": "The waitresses were nice.  We surprised them during a slow time of day(evening-dinner) with a group of 22 so it's kind of fair that the food didn't come out all at the same time or anything, but....\n\nThere was plastic in my food. Like plastic wrap that had gotten cooked.\nMy vegetarian friend got chicken.\nEven beyond the plastic, my standard pad see ew was disgusting tasting.\n\nI'll give it another chance because I've heard so many good things about the place, and the staff was nice, but not anytime soon.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-18", "description": "Gets very crowded during peak lunch time but thats true for pretty much any good place. They have this dish called Traffic Jam which gives you multiple curries (I think 3) in one entree. Its very good.\nI like the food here but some how I feel pretty much everything tastes the same.", "author": "Homer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-21", "description": "I don't like vomiting at work. It makes me look...sick. Not to mention that it fully blows when I have to scrape my own barf off my shoes when I'm not even buzzed.\nI went here once before and got some bland Thai Food. Then I went back the other day. My boss was crapping all over the place and I was puking. While an interesting bonding experience I wouldn't recommend it to an enemy. Luckily, it passed in like a day. But I've been wondering was it the oil? Egg? Something in the hair I ate was the ongoing joke at work... Pineapple? Somebody wiped their butt with my food???\n\nAVOID", "author": "mike l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-10", "description": "I was craving Thai food and saw this place - there was a good sized lunch crowd so thought we should give it a try.  We ordered our food to go - I had the pad thai and thai iced tea and my co-worker ordered the duck curry.  I assumed that it was safe to order the pad thai - how could you go wrong with it, right?  I was wrong - even the thai iced tea did not taste right.  It tasted really bad - not sure if it was the tea or milk, I think they used a powder mix because the flavor was not sweet and it was bitter.  The pad thai noodles were so dry and plain.  I didn't try the duck curry, but it smelled pretty flavorful.  My co-worker said it tasted pretty good.  \n\nI don't think that I will return here for seconds.  There are plenty of Thai restaurants in the city that offer more scrumptious and appetizing dishes that will satisfy my craving.", "author": "Regina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-16", "description": "Standard Thai fare, which means tasty in my book.  The downstairs is a little musty and the food can sometimes take a while, but it's a good place for lunch if you have an hour.", "author": "Mike F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-03", "description": "Oh man...  I really don't enjoy their service.  When I am hungry, I just want to get some food, even if not so good one.  I don't really want to have to deal with service attitude.  One day I ordered something to go and the bill came out to $9.97.  I tried using credit card but they wouldn't take it, they said their policy is minimum of $10.  Hello!!!  I'm only 3 cents short!   To top it off, it was late dinner time and raining night, I got off of work late and really just want to dry at home.  \nAfter minutes of arguing, with huge attitude, she finally took my card and said, \"next time bring cash\".   I thought to myself, next time.. I woudn't come here.\n\nThe food isn't all that bad; it's acceptable for thai \"fast\" food.  Eh..", "author": "N. C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-14", "description": "This place almost made me cry. Granted it was cheap, but I was HUNGRY after licking every bit of sauce left on my plate. Food itself tasted fine, but I think I will give other Thai places a try. 2 hours after lunch, I rushed to Starbucks to grab a pastry, because my stomach kept roaring.", "author": "Su K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-03", "description": "Food is decent, service used to be decent but has since gone to hell, they often forget orders (forgot my appetizer order), bring plates with big time gaps between, difficult to understand waiter can cause the wrong food to be ordered, bs the bill is not in english, affordable.", "author": "King O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-21", "description": "I should have read Deb I.'s review before ordering here.. \n\nGot the pumpkin curry also, and I think the captain of the Cosco Busan must be part-timing here while he's waiting for his ship to be allowed to leave the bay, because there was a massive oil spill in my bowl. \n\nI would have shrugged it off, but it also took an hour for the food to show up, and I was one of the first people sent to the basement seating.\n\nIf you're standing in front of this place and want Thai, just walk a few doors over.. its neighbor is a little better.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-16", "description": "Good chicken Pad Thai, which is what I always get.  Gets busy during lunch hour.  Has a street-level and downstairs dining area.\n\nDon't like to be seated near the window and look at the people sitting 2 feet in front of me eating outside.  It feels like I'm in a zoo.", "author": "Casey F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-23", "description": "Great for a quick lunch during the work day. Good vegetarian options and the best Thai Iced Tea I've had in awhile. The other reviews claim poor service and food quality- that has not been my experience. I will say, like most SF eateries, it could use a good scrub down.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-24", "description": "oooh affordable thai food with good portions in fidi? no waaay!\n\ncame here at 12:30 with 3 colleagues and didn't have to wait for a table during lunch rush...nice!\n\nplenty of seating upstairs and downstairs.\n\nfree soup if you order a curry or rice plate. spent $12 with tip for mango curry with brown rice and side of salad and soup. totally worth it.\n\nthe mango curry was actually pretty bomb with lots of chicken! and the service was good.\n\ni will definitley come back.", "author": "Kathleen J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-07", "description": "Food is salty and unremarkable. The Thai iced tea is below average. The service was good", "author": "Greg C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "I ordered the spring rolls, thai coffee, and Green Curry with Chicken. Spring rolls were fresh, but greasy. Coffee was good, and the Curry was Spicy! \n\nFriends ordered Pad-See-You (sp), Soup, and Curry Fried Rice. Noodles were ok, Curry fried rice was great! \n\nThis place was small. Upon enterance you'll see plates stacked up with salads that they add main dishes onto. Tables are small and close together.\n\nWould eat here again, maybe for take-out.\n\nPrices were cheap!", "author": "J-nine I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-26", "description": "I was so hungry, that I ventured in here with my friend for a quick bite...never thought Thai Food would make me want to barf.\n\n1 - First of all, our table sat eye level with a layer of dust on the kitchen counter - the whole kitchen was exposed to patrons, but that obviously doesn't mean they will go out of their way to make the kitchen spotless. Disgusting.\n\n2 - The first cup of tea I got had FOOD stuck to the rim of my cup. Gross.\n\n3 - The second cup of tea I got had FOOD stuck to the side of the cup. Double Nasty.\n\n4 - The food was cold and tasted like it had been sitting out all day. Do they just reheat things or actually cook them? How many days old was the tofu in my meal? I'm not sure, but it was grainy.... Ewwwww.\n\n5 - The waitress only came to our table when she felt she had to...but there was no one in the restaurant except for a overly-lovely couple who kept kissing. (uhhh...get a private room)\n\nI'll never go back, and I might give a nasty glare every time I walk by. Just awful. Total waste of money. Couldn't eat the food, couldn't drink my tea. The best thing was the white rice...that's just sad.", "author": "Katy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-08", "description": "This place gets a lot of flack, but they do Som Tam just the way I like it, incredibly spicy and fresh. I was however, not overly impressed with the spring rolls. They used some weird gelatinous rice paper which did mesh well with the other ingredients.\n\nI have never actually eaten in the restaurant, but find their takeout service to be efficient and courteous. It is hard for me to find good eats downtown in the evening, and being that my Tu/Thurs are 12 hours days, I like having Banana House as an option.", "author": "C P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-25", "description": "I keep trying to like this place...I try, I reallly do. I try because I love thai food.\nI am not a super picky eater either. But tell me how chicken can be dry while it is in soup??? And why is there a layer of oil floating on top of this Tom Yum soup?\nI called in a group order, and she kept trying to hang up on me before I was finished ordering. Ok lost in translation there, I dont think it was intentional rudeness. And lastly the price is not great for what you get. Its about the same as some other thai places that I find much more enjoyable.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-23", "description": "I had lunch here today for the very first time.  Is this place cramped or what?  My friend and I sat at a tiny table across from one another.  I spent the whole lunch worrying I might accidentally stab him in the eye with a fork.  Not that he doesn't deserve it, but . . .  Just kidding.  The tables were really close to one another, which gave waiters, busboys and patrons an excuse to keep bumping into my chair.\n\nThey have a wide selection of standard Thai entrees, ranging in price from $5.95 - $9.95.  For $3 more, you can make your meal a combo (McDonald's flashbacks, anyone?).  $3 more buys you a small salad, 2 small egg rolls, jasmine rice and a Thai iced tea OR a Thai iced coffee.  Most places charge you $3 just for the drink.  Definitely a good deal.\n\nI ordered chicken Pad Thai + combo, and my friend asked for #46.  #46 on the menu was Kaw Nah Gai (sauteed chicken with mushrooms and bamboo shoots in gravy sauce).  For whatever reason, the waitress did not like his order.  She stared at him, then the menu, then reconfirmed - \"#46?\"  That was all she said to us throughout our entire lunch.  I am still not sure why she was confused by his order.  It's not like he ordered a triple venti non-fat latte or a Fillet-o-Fish extra value meal.\n\nIt took a while to get our food.  When it did arrive, the food was mediocre and lacked flavor, but what do you expect for that kind of money?  My Pad Thai was huge, although pieces of chicken were pretty hard to find.  Lots of bean sprouts and crushed peanuts, though.  Still, very filling.  \n\nI might be back, although I am not ready to make it my regular lunch spot just yet.", "author": "Yan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-04", "description": "3.5 stars\nPretty good Thai food in a funky atmosphere. We ate here when we were really tired late on a Friday night, it was pretty empty. The service was good, and the curry fried rice and Pad Kee Mao were pretty tasty. Large portions at a decent price, standard Thai fare but nothing out of the ordinary. Good Thai Coffee.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-16", "description": "Not pretentious, unlikely to draw in throngs of tourists, but quite approachable.\n\nI had the Banana House fried rice, and enjoyed the subtle yellow curry kick (I'm not much for hot spices and often curry is too overpowering for me to enjoy) and every bite seemed refreshingly different than the last.", "author": "Hans G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-22", "description": "I guess this would be one of those places people would call a \"hole-in-the-wall\"; very simple decor, KOIT 96.5 (local radio station) blaring as the background music, and bright colors abound. To sum it up, it's got that \"fast-food\" feel. The view from the main window is only of Kearny Street in all its dirty glory (Kearny Street seems a bit messy for the edge of Financial District/Nob Hill, don't you think?).\n\nWell, aside from the above, I rather enjoyed my quick yet satisfying dining experience at Banana House tonight. The service was great and prompt (food came to me 5 minutes after I placed my order); their menu had the usual curry and noodles, but also had some \"Banana House\" Specials. I decided to try their Mango Chicken since I love me some protein and some fiber (the fruit). Although I could see the grease swimming in the plate, I still thought the dish was tasty. Rice is ordered on the side, so that costs an extra $1 or $2.\n\nThere were also some specials written on their chalkboard behind the counter; apparently they also have Fruit Curry?! That sounded really good to me when I saw it on the board. Alas, I felt I had to get moving after I finished my meal; sadly, the place was empty at the hour (around 6pm), but I imagine (and hope, for the sake of the owners/workers) that the crowd picks up later in the evening.\n\nBanana House is not the best place to take someone for a dinner date, but it seems like a cool place for a casual quick bite for dinner or a lunch date if you work nearby. =)\n\nOh and p.s. Other pluses of Banana House are the relatively cheap prices (dinner cost under $10 without tip) and there is outdoor seating for those who enjoy sitting outside and watching all the eccentric people walking by.", "author": "Helene K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-02", "description": "2 things here that I LOVE - \n1) Spaghetti Kee Mao - spicy noodle with spaghetti instead of the wide flat noodle - soooo good; I order this dish at EVERY SINGLE thai restaurant I go to and I think this place does it best\n2) Mango chicken - love the sauce and the big chunks of mango\n\nEverything else I've had here is good but not great.... it hits the spot after a long workday - pick it up on my walk home and it's in my belly in less than 10 minutes!  Cant beat it.... wish they delivered to my house; that would be even better!", "author": "A B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-06", "description": "Went here for lunch today, and it was pretty good.  The friend I met for lunch admitted she had never had thai or indian food, to which I replied, \"Wait, WHY do you live here again?\"\n\nThe food was good, could have been hotter.  There was a LOT of (well cut, well cooked) bamboo shoots in my red curry, and not much bell pepper or basil.\n\nOverall the food earned 4 stars, but I have to dock them for a few reasons-\n\nService:  Waitresses are abundant, and yet it was nearly impossible to get their attention.  They also dropped the check on our table about 5 minutes after we received our entrees, and, in the absence of cash or a credit card appearing near the check, ignored us while we tried for 10 minutes to order some dessert, and then seemed annoyed that they had to amend our bill.\n\nFried Banana & ice cream- While it was delicious, it was far from the most appetizing display of this dish I have ever seen.  It just looked kind of strange.\n\nAnd, just my own personal pet peeve: SPELL YOUR MENU RIGHT.  pumpkin has two p's, and there's no e in broccoli.  It just looks tacky to me when numerous items on the menu are misspelled.  Is this petty?  Yes.  That's why they call it a pet peeve.", "author": "Adrian L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-14", "description": "I have been here a couple of times for lunch. The pad see ew was pretty good, but the green curry was not good at all. I scooped at least 3 spoonfuls of oil off the curry, yum! \n\nThe service was ok. When I went with a party of 7 they served half the table then about 10 minutes later the other half of the table go their food. I have also been there as a party of 2 and they are quick and attentive. \n\nThis isn't the worst Thai, but it also isn't even close to being the best.", "author": "Alisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-25", "description": "This place is very consistent.  The food is good, the service is good and quick.  My favorites are the Pad Thai noodles, the Garlic Pan with beef, and the Pumpkin Curry with shrimp.\n\nMy cousin turned me on to this place and I've since been back with a friend, with my husband, and for some take out.  I've sat upstairs and down, and have to say I prefer upstairs.  The food is really yummy, and I think their portions are perfect for lunch.", "author": "lea m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-13", "description": "I ordered take-out last Saturday and I was really disappointed.  I usually come here for lunch and the food always seemed pretty good so I thought I would try it for dinner.  I felt it was below average and pretty pricey.  I ordered:\n\nPad Thai with chicken\nLah Nah Mee Krob with beef\nPumpkin curry with chicken\nPraram with tofu\nPad Broccoli\n\nThe portions were too small for every dish.  The pad thai was ok, but the noodles were clumpy and stuck together.  There was barely any meat in there.  The lah na mee krob was the best dish of the bunch.  It was really flavorful and I really liked how the noodles soak up the sauce from the meat and veggies.  The pumpkin curry was a little too gingery for my taste.  Praram with tofu was just ok.  The tofu was a bit tough.  The beef with the pad broccoli was tough as well.  \nOverall, the bill came out to about $48 with two orders of rice.  I do give them points for packaging the food well.  The peanut sauce for the praram came in its own container as well as the topping for the mee krob.  I won't order take-out again, but I would go back for lunch during the week.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-12", "description": "I absolutely love this place! I discovered it a couple of years ago during my summer internship in the city, and have kept going back. Their curry is to die for (I recommend the Panang Curry) and their Pad See Ew and Pad Thai rival the best I've had.  \nI went to lunch here with a friend yesterday and once again, it did not disappoint. I got my favorite, Pad See Ew chicken, and ate every bite of it.  The portions are generous, and if you get there a little bit before noon, you can get a seat right away and beat the lunch rush.  On sunny days, sit outside and enjoy the delicious food and weather.", "author": "James C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-03", "description": "Tom yum soup was awful!!! My duck salad was ok", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-19", "description": "Decent Thai food, extensive menu, and reasonable prices. I went there for a late Saturday lunch when it was very pleasant to sit by the big open windows in the front. Good vegetarian selection, and dishes I hadn't seen before, such as the tasty noodle salad with spicy lime dressing that I had.\r\nThe fresh rolls (maybe $6.50) were decent but not great. They had what seemed like a flour wrapper, omelette on top, peanuts on the side, and two sauces.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-16", "description": "Oh, what would dot commers do without all these colorful sit-downs along Kearny Street?  This one is strangely connected with the other Thai restaurant two doors to the left.  Both serve roughly the same food, and Banana House's service is slightly better (or slightly less atrocious) than the other Thai joint.  \n\nNoodle dishes are very tasty, veggie dishes are aromatic and taste just as good, and the drinks are mediocre.  Try the root beer.  It tastes suspiciously like diet coke!   ;)\n\nRefills are not free, and yes I'm a cheapo, but at least they don't roll their eyes and complain about you using a credit card.  One thing that the staffers are missing are SMILES. This is a Thai restaurant, right?", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-27", "description": "I went there for lunch today (Friday) around 12:45, and I was pleasantly impressed. \n\nWe shared the pad thai and the #21 which is a spicy beef salad. Both were very good, but the salad a little spicier than I expected (I expected bland). \n\nI really like the interior, it's not kitch as most Thai places are. Our waitress was very nice and attentive without  making us feel rushed, which is how I feel at the other Thai restaurants during lunch hour.\n\nFor lunch Thai (which is different from Thai), Banana House is a solid choice.", "author": "J-Meoww W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-27", "description": "We came across this place because we couldn't figure out where to eat and decided that the 5th restaurant we see would be the place we eat.\n\nThe place was small with yellow painted walls, multi-colored wooden chairs, and glass-covered tables.  I ordered the green curry with tofu and made it a combo (salad, rice, egg rolls, and thai iced tea for $3.50 extra).  The food was well presented on the dish and the curry had just enough spicyness.\n\nThe service was a tad slow and the egg rolls tasted familiar.. on the way back from the bathroom I see a big box labeled, \"Ling Ling egg rolls\" hahah frozen eggs rolls that I could have gotten in the grocery store. booo them!", "author": "Tammie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-08", "description": "Good for a quick lunch while downtown. \n\nThe traditional fare is tasty, and I have had mixed performances with the mango sticky rice. Sometimes it's good, sometimes inedible.", "author": "Benjamin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Cheap and fast.  love this place for surefire curry craving.", "author": "Hilary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "I have only been here twice, but I enjoyed both meals a lot (mango chicken and pad see you). Really yummy. From the outside and even the inside, the restaurant doesn't seem like anything special, but I'd say it's one of those hidden gems that's worth a try.", "author": "Julia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-28", "description": "I've eaten here several times. I don't know why I kept going back, but that temporary insanity has subsided. With lot's of deli choices this seemed like a good option for a warm and filling lunch in the FiDi. However, a trip to this restaurant had to be meticulously planned. The service is very slow so even in the off hours. If I planed on eating in, I didn't bank on making an hour turn around for lunch. For take-out I have to call ahead, even if the restaurant is empty. When I've order a dish with a sauce base, they gave me the sauce and the veggies/ect. in two separate containers so I had to have a bowl or other dish to mix it together at my office. \n\nAll this planning just wasn't worth it as the food is way greasier than it needs to be, the noodles are always over done and stuck to each other, the veggies always seem a bit soggy and the tofu is mushy and either cooked in too much oil or not drained well enough. \n\nOn an upside, it's clean and reasonably priced and the chicken satay is good.", "author": "Arela R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-21", "description": "The first day of my current work, we had a group lunch meeting here. It was your standard fair of thai dishes. This is one of those thai restaurants that try to cater to the FiDi crowd, keep the presentation a little posh and a food not too spicy. Besides, who wants to go back to work with heartburn. =) Mind you, I like my Thai food with a little kick.\n\nSPACE: Its small and clean and bright. Service was good and prices were about average for FiDi.\nFOOD: Nothing particularly stood out, it was good and predictable.", "author": "Venatius P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-27", "description": "Pad Kee Mao. Order it. It'll burn you non-thai tongue off!\n\nI've come here many times when I used to work a few blocks away from here. Best thai food in the area, hands down. Cheap, quick, and tasty. You might need some thai iced tea to wash it all down, but definitely an experience. If you're in the need for you quick thai food fix, this is it. \n\nBe aware, there's always a crowd during lunch hour, so best to order take-out, instead of competing for the next open table.", "author": "Clinton L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-13", "description": "Price - expensive for what it is.\nPortions - tiny. Had to go get more food after\nTaste - not that good.\n\nConsidering the myriad of Thai restaurants in SF, I was disappointed in this restaurant's poor tasting food, small portions, and higher than normal prices. \n\nThe service was VERY slow, even though there were only 3 other people there, and when I asked for more rice (they only give you a small ice cream scoop size) they charged me $1.50 without telling me!\n\nOSHA thai, King of Thai Noodle, Thai Stick, Chaam Thai, are ALL BETTER values, and better taste than this place.", "author": "V T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "I used to come here all the time for lunch.\n\nThings I love in particular: reasonable prices, delicious Thai iced tea, and very good (and hot!) mango tofu red curry.\n\nIt can get a little loud, but I've never experienced a long wait for a table and have always had a good experience.  I've been here many times with coworkers and all the dishes I've shared have been really tasty.  Much higher quality than most of the other overpriced and overrated places in downtown.  \n\nI've also been here for dinner and it is much more mellow and quiet.\n\n\nAnd now I'm craving mango curry.", "author": "Christy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-18", "description": "Food used to be great. Just ordered 3 different plates and they are all left overs!!! I should have known the delivery was so quick it was suspicious....The soup is old and watery, the shrimps have been heated over and over and are all chewy, the pumpkin curry, is OK but the texture of the pumpkin screams OLD, and the worst is the pad thai the tofu is so old I don't even guess how old it is. \nBye guys you will never get an order from us again. There are so many thai restaurants in the city... Not worth taking the risk to get left overs.", "author": "Carpe D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-28", "description": "This place is for people who were born without tastebuds.  That's the only reason I can think a body would want to give this place repeat service.  I am not complaining or angry or pissed at them.  I am just out and out horrified.\n\nIt's not that I'm a snob.  Ok, maybe just a little.  But I came to this place expecting perfectly mediocre thai food.  Which I sometimes crave.  And knowing it's going to be perfectly ok, I expect nothing, and sometimes I am slightly surprised.  I thought, hmm... thai place I always pass by on the way to work, cute decor, looks like they have a lunch crowd, looks like they've got repeat customers, maybe I'll finally check it out.\n\nSo I did.  Got a mango curry special with an offering of miniscule extras:  pixie sized bowl of soup, iceberg slathered in peanut \"dressing\" and a single spring roll.  Spring roll, very mediocre, as per expectation.  Maybe a little crispier than I thought, but taste wise, a study in the mundane.  Iceberg in peanut sauce... pushing the border from mediocre to just plain bad, but whatev, I like peanut sauce, even the boring kind.  But the curry?  OH DEAR GOD!   What happened?\n\nFirstly, people, curry is not rocket science.  You grind a bunch of choice, very specific ingredients in a food processor or mortar and pestle if you wanna get hardcore, but either way, the hard part is all done once you got the curry paste.   After that, you got your shallots, palm oil, fish sauce, sugar, lime juice, maybe a kaffir lime leaf or two, and your motherf---kin coconut milk.  Coconut milk is like the mother of all excuse ingredients.   Flunk your final?  Pour some coconut milk on it.  Accidentally piss in the soup?  Pour some coconut milk on it.  Coconut milk is like god's creamy creamy jizz.  Seriously people, this sh-t is not EASY to f--k up.  IT'S HARD.\n\nGranted, I have a very good palate.  But it's very tolerant of other flavors that are not so interesting.   It appreciates the good that often comes masked in the very bad.  But this- salty, bland, oily, utterly devoid of any kind of flavor?  WHAT DID YOU DO?  I want to know so I can recreate this to splash in the face of my enemies.\n\nOf course I was hungry, so I tried to swallow my sorrow and eat around the curry.   You know how you're usually supposed to try to eat things WITH curry?  I picked out my veggies, shook them off, and made do.  I will say this.  Veggies and tofu, perfectly acceptable.  Mango chunks, actually of exceptional quality... well not exceptional... more like the harry and david's of mediocrity.  Yeah.. couldn't eat that curry.  Good thing there wasn't much of it.  And between that and the rice, I was actually able to eat my way to not hungry anymore.  If there had been delicious curry I might have even considered it a meal worth eating.  I also forgot to mention that I got a somewhat bland thai iced tea as part of the \"combo.\"  Unfortunately, the service... kinda poor as well.  Didn't get any water till i asked for some at the end of the meal.  I, personally, don't really care much about service, but maybe somebody will.\n\nWell.   That concludes this review.  I have covered just about everything.   I hope this will convince you not to go.  It's not that eating bad thai food is such a horrible experience.  It's that giving repeat service to an actual bad thai food place is incredibly unnecessary when there are so many perfectly mediocre thai places around.  Heck, maybe someday you may even want to upgrade from mediocre to good!\n\nOh and for those of you who love this place, I am especially sorry.  The world is so much more interesting when you can taste things.", "author": "Zoobs L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-25", "description": "Went here for dinner. It was deserted. Pra ram was ice cold - I actually asked the waitress to microwave it for me. The sauce was watery. Rice was fine. My date got a Thai iced tea and said it was good. Bill was only $20. I guess you get what you pay for.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-20", "description": "Decent, inexpensive food in a quiet place on the weekend. No rush, no crowds.", "author": "P K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-14", "description": "Wow!  Banana House is great!\r\n\r\nTheir Larb Ped (roast duck salad) is really delicious.  Sweet, tangy, spicy, loads of shallots, cilantro and cracked dry rice for crunchy texture.  How many so-called Thai places put toasted, crunchy dried rice in their foods as is done so commonly in Thailand?\r\n\r\nThe curries are also delicious... good Gang Talay with mussels and squid that's not overcooked.\r\n\r\ntheir street-food appetizers are fairly true to form!  Each one was delicious and their satay peanut sauce is quite good.\r\n\r\non their lunch plates, they could lose the iceberg salad and replace it with a bit of green papaya to make it really shine.\r\n\r\nI'll go back again!", "author": "Greg H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-05", "description": "Why is everyone hyping up the pumpkin curry? I ordered it for lunch today; it was overcooked and lacked a key element: flavor!!\n\nYou know a Thai restaurant sucks when they can't make a decent mango sticky rice. How hard can it possibly be?? Banana House's version, just like everything else on their menu, is plated well but is overpriced (pumpkin curry + mango sticky rice = $14!) and bland bland bland.\n\nThe Banana Hut is better and it is next door.\n\nA note to plastic mavens like myself: Banana House takes credit cards but you have to spend a minimum of $10, which is not hard to do.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-12", "description": "I sometimes order the tofu pad thai here to go. It's made fresh when you order and itt's pretty good! The Thai iced tea is pretty good too.\n\nHowever, I came here to eat with a co-worker a couple of weeks ago. We ordered the pumpkin curry and something else I can't recall. It was just ok. Not very flavorful. Not memorable. I'll be sticking to just getting my tofu pad thai to go.", "author": "Tammy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "One of the best thai places I've ever been too.  It's cheap, delicious and quickly made.  In and out with take-out within 10 minutes.", "author": "Mack D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-17", "description": "For being in the financial district this is an okay place for Thai, as its a lot better than its other neighbor Bangkok Best or whatever it is.\n\nI would have given it a 4 stars if it had better customer service.", "author": "Syonora A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-17", "description": "the place was packed on the first floor for lunch time so we ate in their downstairs area.  it smelled like cleaning solution, otherwise, it wasn't so bad.\n\ni had papaya salad, which was not bad.  it was neat that they gave me raw prawns as requested.  any other place would insist to cook them.\n\nnot bad i say.", "author": "S. T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-21", "description": "Tried this place several times in the month. Food is pretty good. Prices are mostly below $10. Portions are ok.... not huge. No taking extra packed lunch.\nAlways tried the Thai curries. The best is the Mango chicken curry then the yellow curry.", "author": "Shiru M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-25", "description": "Cool atmosphere!\n\nFood came slowly.\n\nYellow curry was good!  Chicken satay good!\n\nLittle overpriced for the amount of food.", "author": "Picky P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-12", "description": "I don't know what they put in the peanut sauce, but I need it like crack.\n\nEating here at least once a week has become my routine where for the 20 min it takes me to eat it I, am happy to forget the evils of crappy office culture and burned out computer eyes.\n\nThe staff is marginally helpful and usually busy as hell.\n\nThe atmosphere has a bit to be desired as well.  If your lucky, they will take you to the dungeon where there is not one window and a lingering feeling you might not make it out alive.\n\nBut that damn peanut sauce keeps me coming back every week.  The food is so good, reasonable - cheap and worth every penny!  Get the \"lunch special\" that comes with spring rools, a little side salad and a sweet Thai tea with your meal for $3.00 extra!", "author": "Brad W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-19", "description": "I had the pad thai, and it was fine. No complaints, but nothing to write home about either. Definitely better than \"Bangkok Best\" next door though.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-30", "description": "The first time I went there, I had the dish with the bamboo shoots, and my boyfriend had the spaghetti noodle stir fried with chili oil and pork. My dish stank up the joint when it came out-- it was made with stinky bamboo (not that I minded. Guess my boyfriend did :P). It wasn't bad. The spaghetti wasn't too bad either, according to the boyfriend.\nAfter a while we decided to give the place another try. I ordered a dish with chicken and basil (I forget the name, it's a traditional Thai dish) and my boyfriend got some kind of chicken with different herbs. These dishes come without rice, by the way.\nI thought my boyfriend's chicken tasted kind of bland, but maybe that was because my dish was crazy salty. Not only that, but the (overly-) ground chicken bits in it seemed like they cook it in the morning and leave it under a heat lamp for the duration of the day. He tried a small forkfull of mine and started piling his chicken on my plate because he felt bad. \nGuess that's what happens when you go when they're about to close.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-19", "description": "REDEEMING REVIEW.\nThis place does not get enough credit.  Fave Thai food I've found in the city so far.  Everything we've had has been excellent.  The prices can't be beat and the flavors are right on.  I'm a Rad Nah/Lad Nah freak, I try it at every Thai restaurant I go to (that has it), and B.H. rocks it!  Convenient location (for us) and friendly service. Casual. Easy. See you next week, House of Banana!", "author": "Mary Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "I got the Spicy Eggplant with Tofu for take-out. It was ready quickly and it was yummy. A bit oily but I think that's on a par with other Thai places that make this same dish. They got it right! Yum.", "author": "Jamie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-19", "description": "discovery or new taste for pad woon sen....thin silver stir-fry noodles pad woon sen....mission to find various forms of pad woon sen....different locations to pad woon sen.....banana house also pad woon sen...pad woon sen fairly well...mixture of chicken, prawn and vegetables pad woon sen ....telling self pad woon sen healthy....is pad woon sen healthy?...wishing to pad woon sen at home....pad woon sen for lunch...pad woon sen for dinner....banana house pad woon sen portioned \"just right\"....pad woon sen not as oily or sweet as other pad woon sen experienced....pad woon sen eating bit cramp by interiors....pad woon sen order taking longer than other pad woon sen....pad woon sen service bit slow.....pad woon sen not the specialty of banana house....but, probably more will pad woon sen after reading this pad woon sen subliminal messaging review.....will you pad woon sen with me?...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-08", "description": "prices for lunch are decent, but a little high for my taste. kind of expected it tho as it's close to the financial district. \n\nmy friend frequents this place a lot for the curry. i decided to nix the curry as i noticed they have udon tom yum. i mean seriously.... i love udon. and i love tom yum. to put them together? genius. pretty good too, i just don't recommend it on a hot day. like today. i was very glad it's casual friday and i got to wear summer clothing. \n\ni also ordered the thai iced tea. kind of weak. but that could just be me... if i could intravenously inject caffeine into myself i probably would.", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-19", "description": "3.5 stars. I like this place. They are fast, no frills, good Thai food, good price. I've eaten their number 66 before, Pad Kee Moa, pretty good. Spicy noodles, with tofu and veggies. Take out, under 10 bucks. I also went there recently and sat and ate in the restaurant. Ordered the red curry, which came with a scoop of rice, side salad and fried wontons. Tax and tip=10 bucks! And I was out of there in under an hour! I'll definitely be back again. Decent food, decent price, fast service.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-26", "description": "Grossly overpriced for what you get at Lunchtime.  Not even a nice room to sit in. Very disappointing.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-29", "description": "soup noodles dishes leave a bit to be desired. the stir fried dishes are better.", "author": "chet l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-23", "description": "Just ate here today, piece of advice: don't make the same mistake I made. Where to start, hmmm, place to small, service too slow, food too dry, assembly line kitchen more focused on take-outs than sit-ins, only one server for the main room, food to cold, food too soggy, food too bland, food too oily, and did I mention the service was slooooowwww. Don't get me wrong, nothing wrong with the people working here, it just felt like they were working in vain with the quality of food that was coming out of the kitchen. Should have gone to King of Thai, damn rubbery legs!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-21", "description": "the food was HORRIBLE and EXPENSIVE. i had some udon soup that tasted ok, my date got the mango chicken, which barely had any chicken, the portion was extremely small for the price, and with drinks the bill came out to $30, my date hated the place so much that she felt bad that i had to pay and offered to pay for her half of the meal........", "author": "Jaime D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-12", "description": "coworker and i were craving pad thai so badly that we got over our depression over banana hut's closure and ventured to the sister, banana house.  (yes i realize i have developed a recent obsession with pad thai).  \n\ncrowded - good sign.  restaurant looked slightly revamped to look more like the hut - another plus.  but the best news is that the pad thai is just as good as it was at hut!  oh the fond memories started to come back as we inhaled the sweet savory peanuty goodness.  i did notice that they also use the thinner rice noodles that osha thai does - is this a new trend?\n\nservice is brusque and harried, tables are crowded and the ambiance isn't much, despite the attempt to upgrade.  but the real reason we're here is for the pad thai, which rocks.  a solid 3 stars...", "author": "Jen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-03", "description": "Big portions and cheap, but the food is mediocre at best. I've had some of the noodle dishes.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-21", "description": "i'm just gonna stay DITTO to mike l.'s review... why? because i was the boss that ate the food with him here.\n\nI have eaten their maybe 3 other times before, all somewhat average.  But never any issues.  Until this one time.... story below...\n\nUnless you trying to shed a few pounds thru vomiting or uncontrollable diarrhea, this place is a total NEGATIVE!", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "Good selection and good salads and the prices are decent.  I really liked the spicy eggplant tofu with a side of white rice.  The atmosphere won't win any awards but if are looking for a quick bite of some flavorful Thai then this is a good choice.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-15", "description": "I have to say...I am impressed everytime I order. I work on the weekends in the financial district and they are the only restaurant open, practically....thank god they rock! I would starve if their food was not all that.... believe me, even if there were others open, I would still go to Banana House. Great service, food presentation and price. Just perfect!", "author": "Isabel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-18", "description": "this place wasnt terrible but it definitly wasnt good. i was with a group of 4 other people, we tried various dishes including the coconut milk soup, a few chicken dishes and fish. the fish was cold and rubbery, the soup was blah and the chicken well, it was okay once smothered in sauce.\n\nfor the price, its what youd expect. i however wasnt expecting to be up all night with tummy troubles. based on that i definitely dont think ill be back here ever again. or any other thai place for that matter. yuckie.", "author": "Britney K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-09", "description": "Had lunch here and the duck curry is delish! Great for a short lunch, but it can get pretty hot inside during the spring and summer seasons.  Some of the food can get pretty spicy, so be sure to let them know ahead of time what you can handle.", "author": "Jin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-23", "description": "I've gone here once and a while for a few years now, and find the quality to be pretty inconsistent.  I've tried the fried rice, the tom ka gai, and the curries, and they are sometimes kind of good, and sometimes just not good.  I finally settled on the yellow chicken curry as my main item, a small dish with rice for almost $9.  Yesterday it was so hot I could barely eat it.  There were way too many chili or red pepper flakes in it, and I had to take a gulp of water after every bite.  I think it's time to find a new Thai place.", "author": "hag a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-14", "description": "The only reason I give BH a 4 instead of a 5 is because the decor is simply shitty and ugly.  I work about a 1/2 of a block away from this joint and the Tom Yum Gai is SUPERB! I'm very picky about my Tom Yum and it's outstanding. It's always hot in temperature and HOTTER in spice (especially if you ask for it HOT).  The service is quick, especially during lunch (never been for dinner) and we all know that's important during a lunch hour.  It's decently priced as well. I can get out of there with a bowl of Tom Yum, a diet coke, and brown rice $10.  Great place to chow down with friends during your lunch hour.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-11", "description": "This may also be known as 'Banana Leaf' as I dont think the sign says banana house anymore.  The food is excellent, its vegan vegetarian friendly (ask for no fish sauce) and the service is usually very quick.  However the portions are not large.  Enough to fill you up but for $7+ I usually expect more.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-10", "description": "Great Thai restaurant.  Their Pad Thai is one of the best for downtown SF.  This place gets very packed during the lunch rush though, so either get there early, or be prepared to wait.", "author": "Minh V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-13", "description": "On 9/12 I ordered food for 3 people which consisted of 6 dishes with rice (approx $50 worth of food). Note, I have ordered from this restaurant 4 other times with no problems - in fact, the food is generally pretty good. However, on that night, the driver would not come up to my door - she insisted that I must go DOWN to the front of my building to pick up my food (which is lazy and stupid IMHO). So I did - when I got there, she then told me it took me TOO LONG to go down there and normally she would just be allowed to leave. How rude! No, she did not receive a tip. On top of this, 1/2 of our order was completely wrong. And the food that was right? It was disgusting. I will never order from here again.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-09", "description": "This is one of the few places that I would ding on the \"stars\" for the outright disappointing environment.  All around good food.  I would recommend the curry sampler (green, red and yellow), which will fill you up and never let you down.  Red, Green, then Yellow is my ranking on each of them with medium to hot flavor.  Just don't go there for lunch during the weekday lunch hour, because most likely (at least in my experience) you will get seated downstairs... and downstairs smells disgusting.  Like siting in a large concrete cell block with a bunch of hungry people, and you walk out satisfied but odorous.  The best is to hit this place on an off hour or a weekend and on a warm day and sit outside.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-19", "description": "If you're looking for typical a avant-garde, chic restaurant in downtown San Francisco, this isn't it. The upstairs is a bit nice, because of the light coming in from the windows, but downstairs is more of a cellar-turned-extra seating space. However, the food is quite satisfying, and the prices aren't exorbitant for San Francisco. I would avoid the joint at lunch, however, as hoards of young investment bankers and other young professionals tend to pour into this place between 12 and 1.", "author": "Rachel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-18", "description": "This place is also near my hubby's office.  We've eaten here a few times, once in the dungeon and a few times on the main floor where we squeezed together at a table for one.  Based on previous experiences, I would probably have given this place 3 stars, the food is okay, but when we ate there last week and noticed cockroaches crawling around the wall above the kitchen, we were thoroughly grossed out and vowed never to go back.", "author": "Angela O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-16", "description": "ordered takeout from the Banana Hut, b/c i love the Banana Hut... went to Banana Hut once and it was great, really loved it... so we order some dinner from the Banana Hut... go to pick up from the Banana Hut... but it wasn't the Banana Hut at all... but rather the goddamn motherfucking Banana House instead... right next door... Banana Hut next door to the Banana House right next door to the fucking Banana Pavillion or something. \r\n\r\nfuck\r\n\r\n.", "author": "michael w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-08", "description": "I found a six inch long hair in my eggplant with chicken today.  'Nuff said.  At least they gave me my money back.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-21", "description": "So it would have gotten more stars, as the food is outstanding, but they were blarring KOIT.  Give me a couple valium before I listen to that \"easy listening\" crap.  But the food was great, curry-rific!!", "author": "Mickey D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-29", "description": "I came here for lunch, and surprisinly seating wasn't a problem. The downstairs was more spacious than the upstairs level. I ordered the pad kee mao, and it was too spicy for my liking. I wish they scraped some seeds out from the jalapenos before cooking with the dish. And the pad thai was...blah. Nothing to rave about.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-19", "description": "I really wanted Thai for lunch one work day and this was the closest place. The food was underwhelming and the waitstaff was so slow! I had to practically jump out of my seat to flag one over to get the bill. It's one thing if the place was busy but I deliberately took a late lunch to miss the lunch rush. Also, one waitress was counting her tips right in front of me. Klassy.", "author": "Nathalie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-31", "description": "For a minute, I was worried that I was the only one who didn't like Banana House... but then, I realized that I don't care.  My experience with the service was not very favorable, and we got stuck in the basement during the lunch rush.  If you're ever down there, maybe you can tell me what that smell is?  Someone must has stuck a sign on my back as I was leaving the office saying \"ignore me, screw up my order, and whatever you do, don't refill my water.\"  Oops.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-02", "description": "There're few to no good Thai places in this area, so when I got a craving today, I thought I'd give this place a second chance. Boy, was that a mistake. I ordered Pad see ew. The service was curt and unfriendly. The portion was small and unsatisfying, and the worst part: the food was burnt! Unless they're experimenting with cajun-Thai fusion, there is no excuse for the low quality of my food. This is my last trip to Banana House.", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-11", "description": "I was feeling pretty generous with my reviews tonight, but this place I just can't find a way to go beyond 2 stars and only because they were nice. This place is dirty, unless you are into rice and food leftovers on the wall, and the food is not good, I'm not even sure it is edible. Sorry guys, you are so nice, but you gotta step it up. The hood is changing....", "author": "Buckeye W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-10", "description": "This a mediocre, lunch spot in the FiDi. I like that it is staight forward eating. You walk in and if there is no line you are quickly seated. You are handed a menu, with very little enthusiam, and promptly seated. I am a very plain person when it comes to Thai, I have not yet learned to branch out, so I always get the Pad Thai or the Pad See ( I think that is the Thai version of Chow Fun) It is not anything to really rave about but it is good!! The noodles are always cooked to perfection and usually don't have to wait long to eat. I have been with co-workers and we have all aggreed the following dishes are good\nPad Thai\nPad See ( Once again I think this correct)\nFried Rice\nFried Rice w/ Fried Chicken\nThe combo deal with the salad, and rice\nKung Pao Chicken\n****** The Thai Ice Tea is GREAT********\nAll in all this is a nice place to grab lunch, and enjoy  a good afternoon in the city! However if you can, avoid sitting downstairs where there are scented candles that could kill ANY MEAL!!!", "author": "Ashlei T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "We like this place for thai lunch. Close to our office, good prices and tasty. I usually like to order a rice noodle dish like pad see ew or pad kee mao or a soup. Never had a bad dish here.", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-15", "description": "I give them 2.5 stars for flavor, 1 star for price and value. I got a to-go lunch. $9 for maybe 5 bites of noodles. It was the smaller of the to-go containers and it was not even half full. The only thing that was plentiful was broccolli. The pad kee mao was standard, tasted fine, not bad not great. Too bad it wouldn't have been enough to feed a small cat. Ridiculous. $9 and I am still starving. Will never go again.", "author": "Raptor J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-22", "description": "This place is just so-so. The good thing is that it is open at night and is one of the few restaurants near Belden that obviously is not on Belden - i.e., somewhere good but cheap. So, I usually go here after happy hour. I went last night and ordered the prik khing - string beans, basil and your choice of meat. It was $7.95 but came in this teeny tiny little container. I guess I am used to \"normal\" places where they have normal sized containers. They charged $1.50 for rice, but came out to $10.25. I guess you can't expect too much eating downtown.  As for the food - it is average. Not spectacular but not horrible.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-10", "description": "Really good Thai food in the financial district. This place is one of the most authentic thai joints I've encountered and makes the best pad thai I've tasted in the city. The cute wait staff don't hurt either.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-07", "description": "The green curry was good, but I would say the portion size was a bit disappointing for $9 dish.", "author": "Kitty N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-16", "description": "Food is ok but quality is consistent.  I really like their Pad Woon Sen (silver noodles).  They deliver too, which is a total plus while working late nights and a better alternative to Waiters on Wheels.", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "Pretty damn good! My friend Angela K. actually introduced me to this little gem :o) Great spicy garlicy  basily chicken! Enjoy it while you can but I warn you to not wash it down with soda. Soday only makes you burp and will all the spiciness may cause discomfort to those who surround you.  Make sure you come to this place with a good friend or an enemy if you order any of their special spicy goodnesses (is that even a word?)", "author": "Aim E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "Perfect for lunch when I am craving Thai food.  The Pad Kee Mao is my favorite and is always spicy, just as the name says.  It gets crowded during the lunch rush, so be sure to arrive before noon if you want a table and you should be fine. Service is quick and efficient, they definitely get you in and out of there fast.", "author": "Carolyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "found this place by just walk pass with my hubby check out the menu seems like a lot of selection for a small little place,nobody inside (it;s Saturday evening)the owner came out and tell us that they're open,so we just sit down not too hungry get 2 entrees to share with steam rice add $3.50 extra to get a Thai peanut sauce salad ,Thai ice tea and jasmine rice.We order traffic jam curry and Phad Nor Mai(stir-fried bamboo shoots with basil and chicken)they use all white meat chicken .Good portion for the price ,fast  service,the waitress there very attentive .Didn't expect anything just want to check out left the place not disappointed ,great  location(close to my work) definitely will go back there again.", "author": "J N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "I eat here often.  the food is consistently good, not great, but doesn't disappoint.", "author": "Keith B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-17", "description": "Not bad Thai, especially with the limited selection of restaurants immediately in the financial district.  Always busy, but quick during lunch.  Pretty cheap for sit-down Thai food--but expect no frills dining.", "author": "Lucas M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-15", "description": "Yummy, cheap eats and good food.. MUST get the Papaya Salad...", "author": "Aimee C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-17", "description": "Decent Thai food with medicore service.   They can be awfully slow at times. But the food is decent. I love their fried fish! Can't remember what it is call. But I order it everytime I go there.  It take a bit longer than the regular dishes but it is REALLY good.   All in all, decent Thai food on the fly for the Financial Districts workers.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-30", "description": "This place is an office favorite, although after they lost some of their staff to the secession of \"Banana Hut\" next door the service has definitely suffered. I'm a Kra Prow person, but the eggplant lovers always seem very happy and the \"Traffic Jam\" curry combo is a favorite. It ain't fancy, it ain't the finest Thai food, but it's close and satisfying and the basement almost always has room for a group.", "author": "mahi m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-05", "description": "Very tasty, non-greasy food. Great place for lunch.", "author": "Joy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-10", "description": "I've been eating here for 6 years. During lunch this place is packed, they are fast and the food is good. I love spicy food but some times it is over the top hot. I just ask to tone it down a bit.", "author": "Vanessa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "My favorite Thai restaurant downtown.  It's great for lunch.", "author": "Heinz G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-08", "description": "Banana House's menu impressed me, but its execution disappointed me.  The well-organized menu contains quite a variety of dishes and combinations beyond the standard Thai options available in the Bay Area, plus they have specials, and the descriptions leave your mouth watering.\n\nThe taste of the food, however, left something to be desired.  I ordered cashew chicken, which is my barometer for judging a Thai restaurant, since this was a favorite dish to eat while in Thailand and Thai places around Asia.  \n\nIn Banana House's version of cashew chicken served to me, some of the onions were undercooked, while the others were nearly flavorless.  Several hours later I still tasted the onion in my mouth.  Also, BH used white onion instead of the red onion that normally comes with cashew chicken.  \n\nThe presence of chilis in the dish added no perceptible heat, which was disappointing.  Pineapple was also added to the dish, but it didn't add much taste because it was either overcooked or came from a can.\n\nAs for the sides that came with my lunch special, the salad dressing was far too sweet.  The fried wonton wrappers were my favorite part of the meal: thin & crispy, almost to the point of melting in your mouth; however, these were provided more as a garnish, not in a quantity sufficient to thoroughly enjoy.\n\nOn the plus side, Banana House does have fairly ample seating (we found a seat for two at 1230pm), and isn't too loud or chaotic, so you can meet here, sit, and have a conversation while you eat.  Good for friends and same-level colleagues.  Not too romantic, but space is cozy, so you can easily end up in close proximity to your companion, if that's what you're after. \n\nOverall, very average California Thai.  2.4 stars.", "author": "movinon .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-06", "description": "This is my favorite lunch place in the financial district.  It's a good value, the food is excellent, and there are two floors of seating.  It may even be one of my favorite Thai places ever.  Oh and if you tell them you want it spicy, they listen.  =)", "author": "angela k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-22", "description": "my server was a bit rude, the food was just okay. On a cold and windy day here in SF, don't go here for lunch. They leave the door open and if by chance you're seated at the table by the closed door, expect a draft. Don't think I'll go back here to dine but maybe I'll do take-out if I get desperate.", "author": "Lola D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-03", "description": "I loved this place, the food is so great, especially the Mango Curry, it is very great! Very fresh, with a very reasonable price. I saw they tried to use very fresh veges and meat, fruit, so it shows me they are very honest to offer the food. \nOne thing I really liked here is the clean kitchen. They have 98 scores on the SF health department post card. \nLove it!", "author": "Jacy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "it's not the greatest ever, but for a quickie lunch spot in the finincial district it's perfect.  they're quick, friendly and they make a good pad thai.  I've brought friends and never gotten a complaint.", "author": "Chad K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-02", "description": "Again... I like the people at my work... randomly strolled up Kearny to find Banana House (mmm Thai)... it was cramped and a little loud... but over all it was quick service, pretty well priced... and so close to work I can not complain (except that my pumpkin curry was made with butternut squash... they are not the same people).", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-15", "description": "Ehh.. I decided to try Banana House because they looked pretty slow & I only had 30 minutes to eat dinner. I ordered #40 which the menu says is $7.95. She asked me what type of meat. I chose tofu. She asked if white rice was okay. I said yes. My total was $10.55. Uhhh... okay.. apparently the white rice that I okay'd was $1.75. Basically I paid almost $11 for a half cup of really spicy green beans, a few cubes of tofu, & a tiny box of rice. Totally overpriced. I've had much better for much less.", "author": "sara j."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-14", "description": "Thought the food was good. Used to go about once a week. Service was friendly if scattered. Then...there was a dead cockroach in my curry. Literally. Server promised she wouldn't charge me for it. Which was very nice of her. Can't get over it. Can't go back. Yuck.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "I live nearby, I've eaten here for lunch and dinner. 2-3 times a month. The food is good & dependable, service is quite good, don't know why so many low marks. \n\nThey'll make you mild curry if you want (without looking at you cross eyed).\nTasty Thai Ice Tea!", "author": "nathan r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-03", "description": "I've been here for takeout and have generally been happy.  It's a little more expensive than my preferred Thai place, but it is a lot closer to work (less than a block).  They got me my curry fairly quickly, so points for that.  The food was pretty good, but not as flavorful as other places (i.e. about average).  Basically, nothing too eventful in terms of a Thai restaurant (but I would eat there again).", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "I love this place.  I eat here twice a week. The service is fast, friendly, and the food is always good.  The yellow curry is my favorite.", "author": "Robin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-20", "description": "I really wanted to like this place too. I ordered the Prik Sod and the vegetables were sooooo hot that I just couldnt eat it.  The chicken was good and so was the rice and salad but had a hard time eatting it because of the spicy/hot aftertaste that lingered on. I tried to order my lunch ahead of time at 11:30 and got a busy answer several times so had to go there and wait for what felt like eternity which isnt normally a big deal if I really enjoyed the food. My nose is still running from the hot-spiciness. I probably wont go back after learning someones elses green beans were super hot. Sorry!", "author": "Darlene R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-21", "description": "Having enjoyed the Banana House twice now, I feel confident Yelp-ing it up. It's never easy to know where you'll end up during that precious one hour lunch break. Could be a burrito, could be a burger, could be thai food. Today I chose thai and walked straight to Banana House. Don't need to worry about waiting, the restaurant is deceptively large with a downstairs dining area. Service is prompt and the food arrives quickly, they understand that we are confined to the constraints of time and supervisors. Entrees are all about $7 and the selection is enough to overwhelm. All dishes are available as vegetarian or carnivore. Many of the dishes include fish sauce, vege/vegans should ask for no fish sauce. Overall, it's standard thai fare with good flavors.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-13", "description": "If you are in the mood for Thai go directly to Banana House.  We had dinner on a Sat. night so it was not too busy as it is during the week.  The food is excellent.  The papaya salad is a bit spicy but not over the top-very good.  The chicken satay was tender and the sauces get a big YUM!.  The spring rolls were a surprise with the egg on top, but delicious all the same.  Our entrees were very generous portions, but not excessive.  The pumpkin curry with chicken was probably my favorite, nice combo of sweet and spicy.  The mango chicken was very good, a nice dish for those new to Thai food.  The yellow curry with chicken needed a little more potato for my plate, but flavors right on.  We were too full to eat dessert. But I bet that would have been delicious as well.  The server was pleasant, attentive and answered our questions with a smile.  A very good value for the quality of the food - particularly in SF.  Go to Banana House!!!", "author": "Terry M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-14", "description": "i have only ordered to go plates and items from here. good thai food in the FiDi. service is good and the dishes are tasty but they don't understand special instructions and handling those requests accordingly like for instance, asking to not spice it up so much but it ends up being more spicy than before.", "author": "Mika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-24", "description": "im not particularly a thai person, but i ate here twice in one day and plan to be back often. all the guys i ate with said it was really authentic. and one of them was chinese. the menu was quite extensive. the lunches all hover around $7. you order by number which is fun. i mean, who doesnt like ordering the the #47 and then hearing the waiter say '#47 is my favorite?' \r\n\r\nwell you know what buddy? #47 is now my favorite too. good times.", "author": "the sternkid .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-17", "description": "i had the thai red curry with shrimp and pumpkin.  the curry was really oily and super spicy... like overly spicy that i can't taste my food.  it also cost like 12$ just for the curry with a small thing of rice.  meh.  i can get better thai food almost anywhere.", "author": "H. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-05", "description": "after a fantastically boring morning of an extremely long and pointless seminar, my coworker and i decided to ditch the bland turkey sandwiches they were providing for lunch and snuck off to the banana house for some thai food. first impression of the place, it looked like a high school cafeteria lunch line and smelled like one too. i was a bit weary and edging towards the door, but my coworker was steadfast and dragged me to the nearest table to enjoy their newly opened full service seating. i'm so glad he's stronger than me. i had the garlic beef and rice dish. it was perfect! just the right amount of spices and flavor. i'm in love with their peanut butter salad dressing. i had to stop myself from licking the plate. all in all a really good experience for really not that much money. i hope i get to ditch seminar luncheons again.", "author": "Aly L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "the corn cake appetizer was delicious, setting my expectations higher than the the curry main course could reach. it feels unfair to rate this place without having tried the fruit curry, so perhaps i will return to see if the dish is as good as it sounds, and also if banana house deserves an extra star.", "author": "shannon e t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-06", "description": "magic for yo mouf!!! this place is awesome. happy salmon (i'm not sure if it's on the menu, but it's the salmon curry). and the fbi...to die for. yum yum yum. eat there, or be square. or just hungry.", "author": "MrBoomBastic .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-29", "description": "disappointing. soggy garlic prawns, the worst mango-sticky rice i've ever tasted, and non-impressive pad see-ew and basil chicken. the order of prawns was TINY too. not worth it!", "author": "I. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-21", "description": "Yay! I found it. Thai food with the subtlety of what Thai food should taste like (my sister-in-law is Thai and I have had some of the best Thai food ever). First, ordered at 8:00, food arrived for delivery at 8:30 (to SOMA/Financial District). Next, the variety was great and there were some dishes I'd never had. Lastly, some of it was just so yummy. If you like spicy (which I don't), they have spicy. If you like mild, mostly they have mild (not always). The Coconut chicken lime soup (I don't have menu in front of me and I'm bad at Thai but think it is Tom Ka Ghai), awesome, jasmine rice, so good, green chicken curry, so good, eggplant, awesome. I asked for mild on everything, however, some of the other dishes were a bit spicy for my taste. But, they were listed as spicy, and I asked for them mild, so I accept that I am a spice sissy. But, I will definitely be going back/calling again, yummy, yummy food.\nI read these other reviews, not sure if I just have a different idea of what good Thai food is. I have been looking and looking for a good Thai place, nothing has compared to the good Thai food I've had before I got here, til this.", "author": "Hayley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-25", "description": "i like the two little thai places along kearny. they are quick, cheap, and very tasty. it's pretty much my low cost thai spot for lunch. takeout is good too. the place is a bit small, but the servers are very nice.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-18", "description": "a good place downtown for a quick lunch. the spicy pork and string beans is my favorite, and i love that they serve lunch meals with a small salad. their pad thai is ok, if you are craving it, but not outstanding. overall, perfectly fine food, but nothing to write home about.", "author": "oona m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-06", "description": "My friend and I ordered the food and it never came. We waited for 45 min (how dumb we were!) and saw (white) people who came much later than we did got their food, and then their bills. We asked both waitresses but they did not even check the order. 45 min later, one waitress came and told us that we can leave if we want. (with the attitude like we're dirt) No explaination of what happened to our order!! This so-called restaurant deserves 5 negative stars for the staffs.", "author": "Bias W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-08", "description": "I order from this place at least once a week.  I always get Satay Tofu, Pad Kra Prao and/or Yellow Curry.  Fast delivery because they are only two blocks away from my office.  No complaints so far...", "author": "Jay L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-13", "description": "Okay food. Nothing spectacular. Sad to say, but I'd much rather eat at King of Thai anytime over this. This place has.. you can say the \"right\" portions (thats for the ladies).. but small for the gents. hahaha", "author": "Dianne I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-02", "description": "This place has gone down hill dramatically - both eating in and their delivery.  The brown rice issue is always a disaster.  I go in, I sit down, order, start drinking my coke, time passes after they take my order, and they finally come tell me they have no brown rice.  Why didn't they know when I walked in the door and asked if they had it before I even sat down?  I called for delivery the other night, asked if they had brown rice, they had to check, they said  they had enough for one order.  I asked if this meant it was the bottom of the pot and old (the previous time I ordered it was obviously the bottom of the pot - you know how it cakes together?).  After seeming to not understand, they finally understood and said yes, it was old.  I thanked them for their honesty and hung up.  If I wouldn't have asked, they once again would've sent bottom-of the pot yucky rice.  Overall the portions have gotten unacceptably small and the food is tasteless chunks of stuff swimming in oil.  Too bad.", "author": "G C."}
