{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Banh Mi House gets 5 stars. The Portola has historically been home of mediocre Vietnamese cuisine all across the board. With the injection of Banh Mi House into a neighborhood starving for decent Banh Mi; they have won a place in our hearts.\n\nI have tried all of the sandwiches on their menu and can appreciate the consistency that they bring. It's a different flair and style of banh mi that you would expect from the TL/San Jose, but overall it's a tasty sandwich.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "Hole in the wall serving basic Vietnamese subs. \n\nLocation: in a bit of an unpolished area, near some of the muni bus stops. I lived in this neighborhood for a summer and the area isn't somewhere I'd walk around alone at night, but it's fine and safe during the day with a ton of other local Asian businesses and housing nearby. \n\nOrder: \nEverything is cheap btw, about 5-7 bucks. \nWe had the grilled meatball and 5 spice chicken sandwiches. The grilled meatball sandwich is the traditional ground pork banh mi but they put a LOT of pepper in it -- hence, a little too spicy for my taste. The 5 spice chicken reminds me of Chinese marinated dark meat chicken (lu rou). I enjoyed this one a lot more. \nIced Vietnamese coffee \nIced Thai tea -- drinks are good and typical here but I did not prefer the large amount of crushed ice in them -- more slushy-esque than drink. \n\nPros: \nCheap for serving size\nNot that many banh mi places around so I welcome any opportunity there is to have one. \n\nCons: \nParking in this area can be a bit of a nuisance, it's often easier to park off nearby residential areas a block off the main stretch. \nNot much seating aside from counter seats.", "author": "Anita T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "+ THE FOOD\nWhenever I get a banh mi, I always have to try the combination pork.The sandwich was pretty delicious and had all my favorite meats in there, including cha lua and the headcheese. The baguette was toasted and crunchy, while the inside was soft and warm. I noticed they drizzled a bit of Maggi seasoning sauce into the sandwich, which I had never seen before but it definitely had a distinct taste. Although I usually don't stay full on one banh mi, I felt very satisfied and felt that the portion size was just perfect. My only issue is that it was a bit on the expensive side ($5.50). \n\n+ THE SERVICE\nWe called in our orders and our sandwiches were ready in about 10 minutes. They make everything to order and work quickly to ensure freshness of the banh mi's. \n\n+ THE ENVIRONMENT\nBanh Mi House is a small little shop located on the corner of bustling San Bruno Ave. There's only a few seats by the window which indicates it's a quick order and go kind of place. The shop itself is very clean and organized. There's a small refrigerated area near the back for drinks and Asian desserts.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Delicious!! \nI ordered the grilled pork Bahn mi, the 5 spice chicken Bahn mi and a Thai tea. All for only $13! Great deal!\n\nI would recommend the grilled pork sandwich! It was delicious and  full of flavor!", "author": "A H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "YAS OMG! Finally a quality banh mi store in this neighborhood! I've tried all four of their sandwiches and can recommend all of them! Their fillings are fresh and generous and the bread is crunchy. Come give this place a try, if you haven't already!", "author": "Mable J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Food-wise, it's more of a 3 star for me.  I really like the ones at Saigon Sandwich or even Lee's in the TL, but this wasn't bad. \n\nI came here one morning when I realized I had no lunch for work, and needed a quick and cheap meal. Banh Mi is a great choice. At $5.50, this was a good option in the area. Plus, it's been open in the hood for a few months, at least, and I had yet to try it. \n\nI got a combination pork to go, and they asked me if I wanted jalapeno's three times in the 10 min it took them to make the sandwich. It's like they didn't believe I wanted jalapeno's. They layer the different pork products in there, a thin layer each. One of the meats had sliced whole peppercorns, and that was a bit of a surprise when I bit in. The jalapeno was either not spicy, or my taste bud for spicy has become dead. They finish the sandwich with a sprinking of some mystery thing in a shaker (MSG? Salt and Pepper? MAGIC!?), and a few dashes of Maggi seasoning sauce. I smelled that Maggi the whole time I had the sandwich. \n\nOverall, not fully authentic, so the food is a 3. But the ladies who made the sandwich were super sweet, the service was good, and the place is HELLA clean. So. 4 stars.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "This place has used to be a hair salon, now it's a quick Viet sandwich shop, i like that idea \nToday was my first time there. \nThe place is painted white, very clean and organized, small and dainty \nIt has a few high chairs with high counter by the door on the right, few chairs to sit on the left for waiting as well \nWalking in, and I see 3 ladies behind the counter \nNo one greeted me which is a norm when it comes to small eateries, but I said hi when I walked in and older lady looked up at me like ... bland face \nI ordered a Combo with everything and second lady wearing red said okay one Combo (happily)\nEven though the first older lady heard me and I think she's suppose to tell me the total, but didn't so I had to ask, I gave my money and waited 3 mins. \nReally quick \nAnd it was a lot of meat, it's on the short side of bread, and the bread was harder than I expected, but still good", "author": "Fiona B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "I come by this area almost every week and have been here a couple of times. \n\nFOOD:\nThe food is alright. I think the sandwiches are a little dry and they need to put more sauce to add more flavor. The quality of the meat isn't bad but not amazing. I'd say it is absolutely worth it for the price tho!! It's $5.50 for the combo pork bahn mi and $5 for all the other options. There is also a variety of different snacks and desserts you could pick up! \n\nSERVICE:\nThe ladies were pretty nice and they work efficiently. We got this mochi dessert and they offered to cut the mochi up for us cause we were sharing them.\n\nFINAL THOUGHTS:\nThis place is good for a quick pick up. I've tried better Banh mi sandwiches but this is definitely a deal for the price!", "author": "Graciela T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "Great addition to the restaurants on San Bruno. All the sandwiches are fresh and i highly recommend adding extra pate to the sandwich to make it more tasty (additional charge of course). My only complaint is that the shop does not close at their posted time of 6pm. I went down to San Bruno today only to find that the gates was pulled closed and locked up at 5:20pm. Should have called the order instead\n\nUpdate (4/11/17):\nOriginally gave this place a 4 but i came again the next day at 4pm and it is closed again... when is this place open?!", "author": "Danny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "This bahn mi spot pretty good, and I'm excited that they have this place in the neighborhood. This will be my go-to bahn mi spot! The store is new and is kept really clean. Their work station (which you can see on the right when you pay) is really clean. This is something I appreciate :). I ordered the combo pork and grilled pork, and they were both really delicious and fresh. They do not skimp of meat or veggies. I called in my order even though I was 5 minutes away because I didn't want to wait. The sandwiches are about $5 and I don't think it's too expensive. I didn't get to eat the sandwiches until an hour later and they were still good! \n\nParking can be hard but just park up a couple streets and walk. This doesn't really bother me too much.", "author": "Joyce S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Great quality Vietnamese sandwiches for a very low cost! Extremely clean little hole in the wall place. I usually come here at least once a week for their chicken sandwich. Definitely recommend!", "author": "Krishnil G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "This is a pretty solid no frills straight to the point bánh mi shop. I got the grilled pork sandwich, and while it wasn't my favorite pork I've had and it teetered on being too salty, ultimately it did the job well and was supported by excellent accompaniments. The bread was fantastic - slightly toasted, crunchy on the outside and still a bit soft on the inside. The veggies were perfectly pickled, sweet, and fresh, and the jalapeño provided a serious kick. \n\nMost of all, the price and portions were absolutely on point. Great sized sandwich to fill ya up with a little side snackage for under $5 - I will definitely be back. I want to try their 5 spice chicken to see if it adds a bit more of a pop because everything else here is great.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "I've lived in the Portola district my whole life. With the opening up of that coffee shop and that brewery, I'm honestly scared that the place I know and love so much will become another San Francisco gentrification story. However, I know there's still a lot of life and culture left with small businesses like Banh Mi House.\n\n[Ambience]\nA quaint little place! There's not much standing room inside, so the line is always out of the door lol. The first thing you notice about this place is their super simple menu. I think there's only about 4-5 different kinds of sandwiches you can buy, but their drink options are extensive. They have a cold box filled with different sodas and Asian drinks (I got the grass jelly!).\nYou can see the workers making your sandwich - they keep their stations and front of the house clean which is a huuuuge plus! No flies in sight!\n\n[Service]\nService was prompt and efficient. Once they take your order, they write it on your sandwich bag - down to the drinks you buy. I waited about 10-15 minutes for everything to come out. They work sooooo fast.\n\n[Food]\nI ordered 3 combination pork sandwiches with extra pate, a meatball sandwich with extra pate, a thai tea and a canned grass jelly drink. I think Banh Mi House is my new favorite place for Vietnamese sandwiches!\nThis place doesn't skimp on meat or pickled veggies. I appreciate that they use spicy jalapenos/don't take out the jalapeno seeds!\nSince we ordered extra pate in all of our sandwiches, I was a bit worried that they weren't gonna give us a lot, but I was pleasantly surprised to see some pate falling out of my sandwich!\n\n[Worth it???]\n$5.50 for a sandwich?? YES PLS. My total for 4 sandwiches and 2 drinks was a cool $30. Compared to Dinosaurs (I order from dinosaurs a lot....), you're not breaking the bank at all. \nGo ahead and dish another $2 for extra meat, or another dollar for extra pate! Go ahead and buy that $3 thai tea, or that $1.50 grass jelly drink!\nSeriously tho, come here, support small businesses and eat good banh mi's.", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "I love this place! The prices are so good for the quality!\nThe bread and ingredients all taste so fresh, you can tell the company puts effort into their product. \nI always get the combination sandwich and I always leave full and happy. I'm very happy to find this little gem on the way to work, I will definitely be here more often and invite more of my family and friends. I hope to see this business thrive, I hope the quality doesn't change. Quality food for the best price!", "author": "Alberto S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Well who doesn't crave a Vietnamese sandwich time to time?! I know I do if not always but almost 2-3 times a week I need my Viet-sandwich satisfaction. \n\nThis place is up most probably one of the best small local diners to get your craving satisfied, by means if it's a Vietnamese sandwich or Vietnamese coffee craving this place will satisfy every craving running through those taste buds. \n\nThere's street parking but be warned it's hard to find especially on a busy Friday/Saturday/Sunday when everyone and their family is out shopping or munching away. Also there are small parking lots for banks and neighborhood parking around the area but be warned again it is SF so grab all your belongings or it might be missing with a shattered window. \n\nThis place is located the corner of the street and is pretty small made more of the grab and go, there's about 3-4 seats and a bar like table facing the window overlooking the traffic that passes. \n\nNow for my overall experience, I got lucky the last time I went because I found parking straight in front of the location with a broken meter (that's winning in SF knowing .25 gives you 5 minutes). When you walk in it's pretty clean I don't think there's a public restroom and the menu is displayed. My favorite sandwich to get there is the combination of course with the coffee, for me I requested light ice. \n\nThe employees here are very considerate they will ask if you want jalapeño or extra/less portions. \n\nExperience here definitely a plus and I will come back!!", "author": "Marilyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "It was my first time at a Banh me sandwich place. I had heard about them and had been wanting to try but no luck in our area and then would head to San Jose or the Bay Area and forget. \n\nWell this time I left San Francisco after a conference and mapped myself to a Banh mi shop. \n\nThis was not too far off the freeway and luckily was on my way home. \nGrabbed two sandwiches, and also got some sort of drink with black beans and jello type substance.  \n\nThe ladies preparing everything were very helpful and explained what came in the sandwiches and even which was most traditional as well as the various drinks that were made on site. \n\nThey were very nice, place was clean and overall the sandwiches were really good. Granted this was my first experience with them. I will definitely go back if I am in the area.", "author": "E P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Made to order and less than $5?! Why is this place not more popular?\n\nI got the combination sandwich and the Thai tea which were both delicious. Add a little sriracha and it becomes perfect.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "Date: Sunday, March 5, 2017\nTime: Approximately 1300 Hours\n\nWifey wanted to go the casino on this particular Sunday and I told her that I wasn't driving out to no far-away casino to spend my hard-earned cash. Besides, the crazy hail storms didn't call for a long drive at the moment. She said there's a bus pick-up at San Bruno Road, just a few blocks from where she used to live when I was dating her back in the 90's. No, this ain't no love story but it's a married life story that is often played on a daily basis. So I relented and dropped her off so she can have \"fun\" at the casino. \n\nWhile in the area, I decided to stop by Fancy Wheat Field Bakery to grab some Pork Sung Rolls for me and the kids. Sure enough, it started hailing again and I stayed inside to weather that crazy storm and I happen to notice this Banh Mi joint across the street. I took it as a sign and I decided to drop by and grab me self a sammich since WIfey wasn't there to tell me no. Their menu is pretty direct and simple so I ordered the Combo Sammich (Roast Pork, Fancy Pork and Headcheese) and took it to go. There was a couple of Asian ladies working at that time and they were pretty busy making a bunch of sammiches as there appears to be a lot of pick-up orders. The younger lady took my order and she was very nice and pleasant. \n\nWhen I got home, I unwrapped the sammich and started digging in. The baguette had a crisp exterior which gave it a nice crunch, but it wasn't too hard and it was easy to chew. The interior of the baguette had a nice consistency and the flavor of everything together was pretty good. Although it could use some more sauce that could have been more bolder, I was digging all the fresh and flavorful ingredients.  \n\nAbout a week later, I happen to be in the neighborhood again and decided to grab the same sammich. It's only 5 bucks and it definitely hit the spot when fiendin' for a quick bite or to satisfy your Banh Mi cravings. It's not the best Banh Mi I've ever had, but it's pretty good and inexpensive. Besides, the ladies working there are very nice and friendly.\n\nI'll give it a solid 3 1/2 stars.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "I would crave banh mi from this place. Their bread comes out warm with just the right amount of pate on the combo! There is bar counter seating but don't expect a full seating area. Cash only!", "author": "Marlene T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Good new viet sandwich place in this part of town. Similar in style and quality to TY sandwich on mission but this less offering. They only have a few sandwiches. But they let you pick and choose the cold cuts you prefer. So if you want just fancy pork and pate, they'll sell it to you but charge you for a combo. They do give you more of the fancy pork is you chose not to get the ham and head cheese. They have a good selection of chips and drinks, including young coconut. \nThe bread is somewhere in between the crusty kind and the doughy kind, it's not one or the other. They toast the bread to order. \n$5.50 is a little steep for a banh mi, but the ingredients are fresh and this is SF.", "author": "Antonio W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I love this place. \n\nThe pork and the 5 spice chicken are both delish.\nThe best time to pick it up is in the morning (the bread is fresher) but even in the afternoon it is great. \n\nThe women who work here are super friendly and know who their regulars are!", "author": "Renee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Very good Ban Mi.  The ingredients are fresh.  For the quantity and quality you receive, the price is excellent.\n\nAlso, I ordered the coffee.  The cup was 12oz, but I believe I received about 3-4 ounces of pre-mixed coffee.  The rest was crushed ice.  Though I didn't get as much coffee as I was expecting, again, the price was good.\n\nVery good value.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Since moving to SF, I've been on the search for a banh mi with nicely toasted bread, a good ratio of fixings, isn't completely loaded with MSG and priced the way a banh mi should be. I've tried the grilled pork and the combination pork banh mis (about $5 each) and the combination pork is definitely my favorite of the two. The deli meats in the combo taste more tender and somehow fresher than those from other places I've tried so far. My go-to spot in the area until something better comes along!\n\nCash only.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "finally a good banh mi place near my house! \n\nsince this is a specialty store, you have to go earlier in the day before they run out of the kinds of sandwiches. if you're like me and not picky, thirty minutes before they close is a fine time. \n\ni got the regular combination and was happy to know that the bread was toasted, (previous reviews said they didn't do that), a generous helping of meat, and sauced appropriately. it was a good balance and a delicious sandwich. i'll definitely come back again!", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-28", "description": "I'm speechless there Banh mi is not good as it used to be. Would be the last time coming here.", "author": "Aniko N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "I was underwhelmed with the combination pork banh mi considering the many 5 star reviews. I give the sandwich 3 stars. Bread wasn't toasted/warm enough for my taste. The meat filling was slightly skimpy. They also put this soy sauce tasting vinaigrette that unfortunately detracted from the sandwich for me. Overall average banh mi. \n\nThe ladies behind the counter were nice. The shop is clean and tidy. Small area to sit. They also have a decent snack and drink selection. I was lured in by the lychee basil seed drink, not much lychee flavor and really sugary.\n\nEven though I live a close drive away, I wouldn't come back here since there are other options in the area.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "We had a pork Vietnamese sandwich for under $5.00 which is a little high. Sandwich all in all taste was  good; was a little bit on the small side, it could be a lot better.... I just wish it had a bit more meat on it!", "author": "Susie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-29", "description": "3.5 STARS\n\nI was in line at Poke Bar in the Twitter building when this seemingly friendly lady started chatting with me:\n\nLady: \"Hi, where are you from?\"\nMe: \"San Francisco.\"\n\nLady: \"I just moved to San Francisco and live in Pacific Heights, what neighborhood did you grow up in?\"\nMe: \"Portola, where are you originally from?\"\n\nLady: \"Never heard of Portola, I'm from Atchison.\"\nMe: *confused look*\n\nLady: \"It's in Kansas.\"\nMe: \"Oh, sorry....my geography is bad as Trump's.\"\n\nLady *evil eye*: \"I'm a Trump supporter.\"\n\nA-W-K-W-A-R-D   S-I-L-E-N-C-E\n\nOk, getting to the point here...I don't expect a recent transplant to know where Portola is in San Francisco when Yelp doesn't, they list it as \"Excelsior\". =/\n\nPortola is a little known, working class neighborhood in San Francisco. It's one of the very few neighborhoods that hasn't been gentrified and I hope it stays that way. Most, if not all of the businesses there are mom and pop businesses so it's always exciting to see a new one open.\n\nOpening last week, Bahn Mi House took over the Anza Hair Salon in Portola. As their name indicates, they only sell Bahn Mi, Vietnamese sandwiches. They have 5 varieties and one veggie option (tofu), $4.50 - $5. They also sell made-to-order Vietnamese coffee and Thai iced tea. They have a cold case of bottled Asian drinks (e.g. basil seed), Che (Vietnamese dessert), Cha Lua (steamed pork roll), and Nem Chau (fermented pork). There's only 4 stools so it's more of a to-go place. CASH ONLY.\n\nI came by last Saturday and ordered a Dac Biet Bahn Mi, Combo Vietnamese Sandwich w/ roasted pork, fancy pork, headcheese, pâté ($5): http://bit.ly/2cEoj5X to go. \n\n(+) Ample protein filling (lots of ham though).\n(+) Fresh, crisp veggies.\n\n(-) They use a dense baguette that was untoasted. Just my preference, I like a warm, toasted baguette with a delicately crispy exterior and fluffy soft center.\n(-) The pickled daikon and carrots weren't pickled enough and the jalapeno wasn't spicy so I didn't get the various layers of flavors (salty, sweet, sour, and spicy). \n(-) The Bahn Mi was dry because of the very, very light smearing of mayo and pâté .\n(-) They use Best Foods mayo but I prefer a more traditional Bahn Mi mayo that's cut with butter like Ty Sandwiches (Excelsior): http://bit.ly/2cEBoat - it makes for a richer, more flavorful sandwich. \n\nDon't get me wrong, Bahn Mi House makes a decent Bahn Mi for the area but it's just not my cup of tea. Times like this, I wish Yelp had .5 star option because 3.5 stars is the appropriate rating for Bahn Mi House. Since, I gave Ty Sandwiches 4 stars for their solid Bahn Mi, I have to round down for Bahn Mi House. I wouldn't mind returning and will gladly do an upgrade if their Bahn Mi improves. \n\nBest of luck to the owners!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Nice, clean, simple place for banh mi run by a friendly Vietnamese family. Short menu: combo pork, five spice chicken, lemongrass beef, tofu, all $5 or under.\n\nCash only, parking can be bad. Would definitely come here more often if not for the parking.", "author": "Tim X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "Ordered a sandwich to go and waited. While I was waiting saw the man who ordered after me get his sandwich before I got mine. (Btw it was the same exact order), so I went to ask about it. Staff got rude and when I got home, there was a hair in my sandwich. \n\nI'll never come to this place again! Disgusting!", "author": "michele h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "Sandwich made fresh to order however I wish they had more appetizer selection and serve fresh spring rolls.\nSandwiches are great.", "author": "Meishi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Great spot for a Bánh Mì.\n\n It's more of a take out location, are a few seats around the perimeter counter to si look out the window.\n\nFantastic ingredients just the right amount of pickling on the vegetables.\nGreat pricing, around five dollars, for a good size Bánh Mì.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "A little mom and pop shop it seems. The five spice chicken is great here! The bread is crispy and there's a lot of portions inside, they're really nice. The meat is pre-made cause they just grab them out of a container, and the bread is placed in a toaster for like 30 seconds to a minute. They also polish this type of butter on the bread which makes it taste yummy. The area is small and it gets popular during lunch time, so I'd go when it's not busy. \n\nFor their drinks (thai tea & vietnamese coffee), oh my they're strong! The coffee doesn't have a lot of milk in it, so it tastes really bitter. The thai tea taste like every other place, not as special. But I do like the ice cubes they put in their drinks.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "Finally a good banh mi place to go around the excelsior district! Ordered 3 sandwiches and they're all pretty good!\n\nFancy Pork\nOff menu item and thought it was the best one with pork that tasted marinated but I don't know what.\n\n5 spice chicken\nThought it was just ok. The chicken was a bit dry on a few places but overall was tasty. The spice in it was a bit sneaky so be prepared for sudden hotness!\n\nCombination\nHad all the pork meats combined and thought it was good but not my favorite.\n\nAll the sandwiches had a good portion of pickled vegetables and parsley.  The sandwiches are all toasted so if you're particular about toasted bread then you can ask them not to toast the bread if you can.\n\nBad thing is payment is that it's CASH ONLY.  The space for the eating area is a bit small but I didn't come there to stay and eat, since I was just picking up sandwiches for my friend and I.\n\nDefinitely will be back as I've recommended this place to my crew of friends!", "author": "Eric T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Time to update original review.  It's been a month since my first visit on 4/14/18 here and about 25+ banh mi later.  There's been discussions as to why this banh mi is so good: good bread that they lightly toast for a great crunch with a tasty spread, evenly distributed meat so you get a satisfying bite each time, and crisp pickled vegetables.  No need to travel into the Little Saigon district for a good banh mi since discovering this place.  Their drinks are great as well.  Good to know that this a cash only establishment.", "author": "Esther W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Simple and delicious. That's all I have to say. Their menu is super small but it's really all you need. I got the Grilled Pork Vietnamese sandwich and it was delicious! Good amount of pork and super flavorful. Everything was on point and the sandwich was super cheap. Come for a quick Vietnamese sandwich and you definitely won't be disappointed!", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Great, fresh Bahn Mi and such a delicious and cheap meal.\n\nI had the Five-Spice Chicken which was moist, juicy, and flavorful.  It was well-seasoned and a perfect, healthy alternative to the typical pork fillings.  They also were generous with the vegetables (usually stuffed with cucumber, cilantro, carrots, mayonnaise (or spread of some sort), and jalapenos (for that extra kick!).  As many others have noted, their bread is noteworthy--hot, fresh, and crunchy.\n\nCash only and very limited seating so be prepared to take out!", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "This place is awesome and delicious! Friendly staff and great food. Get double meat on any sandwich- it's worth the $2.", "author": "Roxy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Great little banh mi place in our 'hood. The food is fresh, the sandwiches are big, and they make your food fast! This place is cash only so keep that in mind.\nI'm really happy it's open on San Bruno Ave. it's a great place to grab a bite to eat in The Portola.  Take your sammies up to the park and enjoy the view!\nMy husband always get the five spice chicken, and I like the grilled pork. They do make a tofu version for vegetarians though it tastes like they put fish sauce in the pickled veggies so I'm not sure a vegan could eat here.", "author": "Christiana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "I love their veggie tofu banh mi! It's Amazing:) Clean place, friendly.  Parking can be hard at times.  Easy access to freeway so easy to get to.l", "author": "Izzyjenn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "This place is great - delicious banh mi, friendly service, reasonable prices, and a clean, bright setting.\n\nMy husband and I shared 1 Chicken Banh mi and 1 Pork banh mi - both were tasty.  Fresh bread, flavorful meat, and a delicious mix of flavors.\n\nThe staff is polite and friendly, the prices are decent ($5 per sandwich), and the setting is clean and updated.  There's limited seating, so be prepared to take your order to go if there's a crowd.  We came on a Saturday at lunchtime and enjoyed sitting at the bar table facing the street.\n\nGreat spot - we'll be back!  (We only wish it was open past 6pm in the evenings so it could be a more viable dinner option!)", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-16", "description": "Ordered their combo sandw. Their bread are more on the hard crunchy side .  So be prepared to have tough teeth to eat this .  It's pretty good . Has Enough sauce  so the sandwich is not dry.  Will be coming back  if around .", "author": "Gret C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "This place is a straight hidden gem. I never go to the Portola District, but it was a nice day, I wanted something quick...queue Banh Mi House.\n\nThey crank them out pretty fast, but it's delicious. It tastes fresh, it's reasonably priced, and it's delicious. What else do you need to know? \n\nMaybe the slight downside is that the sandwiches are slightly on the small side, but they're about $5, so it's not bad. All in all, if I am ever in Portola district again, I'm hitting this place up.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "First, as several others have pointed out, this business is located in the PORTOLA neighborhood, *not*the Excelsior.  The Portola IS a distinct neighborhood, recently designated as the garden district of SF, because of the history of commercial greenhouses, and the wonderful gardens that grow here because of the sunny weather and good soil.\n\nAs for Banh Mi House, it's a very welcome addition to the neighborhood.   I finally went there for the first time today, and I'll definitely return.  I had the Combination sandwich, with 5 kinds of pork, and it was delicious.  I'd have preferred crustier bread, and more pronounced seasoning, but it was tasty and a good value for $5.  I also had the coffee, which was a bit sweet for my taste, but delicious nevertheless, with great coffee flavor.  \n\nService was prompt and very friendly, and I look forward to trying some of the other sandwiches in the future.", "author": "Barbara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "This restaurant is not in the Excelsior District. It is in the Portola District. The Portola District is located between the Excelsior, Silver Terrace, the Bayview and Visitacion Valley.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Their tofu banh mi is delicious. Great bread, the tofu was ridiculously yummy and their vegetables were great. Everything was in perfect proportion as well.\n\nI got in and out in ten minutes and only paid $10.00 for two tofu banh mi and a bag of chips. One was for my coworker who raved about how good the bread was, too. \n\nI will be back. Thanks lovely ladies! \n\nCootz OUT! \n\n({})", "author": "Cooter T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "It's ok but I wouldn't come back again. Price is expensive for banh mi ($5) and the size of it is smaller than other places. \n\nIt's super hard to find parking so it's not worth it for me to come back again.", "author": "Kat V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Made a quick stop at this place cause my husband found it on Yelp.  We got here around 930am so there were ample street parking.  There was no line and with a simple menu, it was a quick decision.  Hubby got the Combination Pork Banh Mi (Grilled Pork, Fancy Pork, Headcheese, and Paté) and I got the Grilled Pork Banh Mi.  I can only speak for what I ate and it was delicious.  Bread was crunchy and the grilled pork was very flavorful!  The crunchy pickled veggies definitely added to the sandwich... not too much vinegar and salt... just right.  The women there were friendly and the place was small but clean.  With that said, will definitely be back... especially for a flavorful,  hefty meal for less than $5.00", "author": "Erna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Hands down one of the best Banh Mi shops in the SF. Stop by if you're looking for authentic Vietnamese food; sandwiches, coffee, dessert, snacks, Buddha shrines and etc.", "author": "Dennis D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "Pork combo was so good!, Thai tea was nice and chilled as well. I can't wait to come back", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Always great. Pretty sandwiches, which is weird to say but hella true. Good pickle to their veg. Nice french bread. Good meat. Good flavor. Get the combination pork. Cash only.", "author": "Patty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Best banh mi I've had in a long time. \nSeriously so good and a great price! \nDef my new go-to!", "author": "Mandy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "There are a couple other Vietnamese places along San Bruno but this is the only one that specifically sells banh mi only. It's definitely meant to be a take-out place, though there are a few seats by the windows. Their menu is simple and straightforward. It's a dollar or two more expensive than some other banh mi places in the city, but I think that's acceptable for neighborhood convenience, and especially considering how new and clean the place looks. The banh mi may seem a bit small on the outside, but it packs a lot on the inside, so you definitely get your fill. They take a bit of time to make the sandwiches, but both the meats and the vegetables were fresh and tasty. To improve I like my bread a bit warmer and more toasted, and perhaps with a bit more flavor from some spread, but otherwise it is solid.", "author": "Tony D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-21", "description": "Finally tried this place out. It's much needed in this neighborhood. Came in at 5:20 pm and they close at 6 pm. Said they only have the small breads and not the regular breads. I said ok because I was hungry. \n\nThey could have discounted the price since I did not get the full size one. But nope, they charged full price. \n\nIt's legit because it's Vietnamese women behind the counter but they need to compromise to customers in situation like this.", "author": "U L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Great food and great prices. They are cash only so be sure to have that green. Their sandwiches are fresh and they have other pre made goodies like tea and desserts. Parking can be a challenge, but patience....it's worth it.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Welcome to the neighborhood Banh Mi House!\n\nOrdered my first Banh Mi from BMH today and it did not disappoint. I had the combination Banh Mi, the baguette was nicely toasted and packed with fresh ingredients. Their meat, veggies and pâté ratio were perfect. The Banh Mi are reasonably priced and staff were extremely friendly and efficient. \n\nThank you Banh Mi House for making my first visit a good one. I will be returning and I can't wait to try all the other Banh Mi selections you offer!", "author": "Mimi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Chicken Banh mi was good, but it wasn't like to die for, I certainly wouldn't necessarily drive here from somewhere else to get THIS particular sandwich. If I were to be walking by and was craving a Banh mi, then I would definitely get it.", "author": "Lydia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "This place serves solid banh mi and the prices are very fair. The menu is very short and simple with just a couple meat/filling options and the restaurant is cash-only. They prepare your food quickly and the workers there are very friendly. I found my bread a bit stale and hard, but I came late in the afternoon, so that may just have been a case of poor timing. The rest of the ingredients were very fresh and tasty and the meat portions were pretty generous! I will definitely be coming back while I am in the area!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Thai tea good\nCombo sandwich delicious and packed with meat\n\nDownside: 15 minute wait for 3 sandwiches", "author": "Long C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Cute little shop on the corner of San Bruno, easily accessible and close to many bus stop routes. I personally had their sandwiches on two separate occasions just to see their consistency, variety, and not base it off anything besides the taste of the food, but their customer service is great if you are wondering. \n\nRoast pork banhmi: their meat was sliced thin rather than the chunks of meat that im used to having at many other banhmi places. It was fairly salty for my taste buds. I had to add hot sauce to cancel out the salt and bring a new flavor in towards my last few bites\n\nCombination: average. The pate wasnt as good as what ive had at other places, and there wasnt much flavors to the meat. \n\nThai tea: generous amount of the tea itself (not watered down by ice/ filled with ice). A tad on the sweeter side\n\nPros: both occasions the bread was nicely toasted and fresh \n\nCons: strong maggi seasoning taste (?)\n\nOverall, more of a 3.5 star rating for food but rounded up due to friendly service", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Delicious Vietnamese Sandwiches. I really like the Banh Mi House and I am super happy it is a very short walk from my house. I like the \"special\", basically the best sandwich you can get, with pork, veggies and really great french bread used too.\nI hope the shop continues to gain business in this community as it is great to have a wide diversity of food options. I'm a fan and will be back again and again for a great Banh Mi.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-15", "description": "Taste was good but the bread was way too hard. Good amount of meat and veggies. One of the better Vietnamese sandwich in the city", "author": "Viet P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Best Vietnamese sandwiches in the area. Even better than the ones down in the TL. Cash only. Bring lots of it.", "author": "Alan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "This place is legit. Best banh mis I've had in San Francisco. I really want to find out where they get such great baguettes. The bread is really, really good. \n\nI recommend the 5 spice chicken and tofu. For $5 each, they're packed with flavor and fresh ingredients. There's a great selection of drinks and seaweed chips available in the back as well.", "author": "Dee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "The food taste great and the price is cheap for what you get! The people working are very friendly and polite!", "author": "Nick c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Their tofu bahn mi is fire! The tofu is full of flavor and the texture is perfect (not soggy/mushy).", "author": "Peeta B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "Very disappointed in this business. Happy that there is a banh mi place, but I came here at 7:45am because Yelp info states that they're open at 7am. I called prior and no answer thinking it was just busy. It is now 8:15 and the gate is still up. Yes, it's raining, but someone that runs a new place should certainly be there setting up prior to open, not undoing chains and setting up shop at 8am when the sign clearly reads 8am. I'll be inclined to change my review if things improve.\n\n[update] I call at 5:40pm, 20 minutes before they close, and they told me, \"we're out of bread.\" Lol! What a joke. \n\nI'm sure I'll come back, but tips and kudos won't be handed out by me here.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "I love this place. It's my immediate go to for lunch. Service is great, and the owner is a very nice guy.", "author": "Olita T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-27", "description": "Came in here at 4:17PM on a Friday and the lady said they ran out of sandwiches. They don't close till 6... guess business must be really good or something.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-08", "description": "I'll eat here again for the price. The bread is above average but my chicken was very plain. I'm sure white people would love it but I didn't taste one spice. So much for five spice chicken.", "author": "Adidas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Had the Five Spice Chicken and Cha Lua (not on menu, but I think it's the \"Fancy Pork\" used in their Combination Pork sandwich) sandwiches. Both were tasty. \n\nI've only had banh mi from the Little Saigon / Westminster area. The sandwiches here are smaller and more expensive but they give you more meat. And the bread is more crunchy and more artisanal tasting.", "author": "H N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Awesome place to satisfy banh mi cravings for $5. Good solid sandwich paired with good customer service. There is limited seating so don't expect to have a lunch hangout here with a group of friends but otherwise good place for grab n go!", "author": "Angelina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Ambiance:\nWhen I first saw this place, they were not yet opened, but I was already excited because it's around my neighborhood and I just love Vietnamese sandwiches! This place is small, but it's easy to order since it's a small menu. There are a few seats by the windows and sections for \n\nFood:\nMy one and only favorite is the combo. I love that they pack the sandwich with the regular varieties. The flavor is great, and the bread is just the right amount of crunch. I also noticed that they bag it in a brown paper bag, which reduces waste compared to plastic bags. Other Vietnamese sandwich places that I have been to can be tasty too but the price and sandwich contents are not as fulfilling for me as it is here at Banh Mi House.\n\nService:\nMy first time ordering was through the phone, and I ordered 5 sandwiches, which were made ready for pickup within 20 minutes after ordering. The person I talked to on the phone was quick, understood my requests, and confirmed my requests. The last couple times I went back was ordering in person. They were preparing their cilantro at the last time and made 1-2 sandwiches in less than about 10 minutes.\n\nSuggestions:\n- Prepare some cash for these yummy banh mi's because they don't take credit cards.\n- Call in ahead of time for pick up so you won't have to stand around and wait to devour these sandwiches.", "author": "Em S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "well it's cheap and it's really pretty good. my only real issue is that it's a little slow, which could be fixed by calling in an order in advance ( there's your pro tip.)\n\ni had the pork ( regular, not fancy) and it was less than $5. it had plenty of vegetables, the bread was good, and they use best foods mayo so no hipster yuck taste. it's the real deal.\n\nyelp info says it's good for groups, but i beg to differ. there is bar seating for a couple of people, but that's it. also, if anyone comes across a phone number, please publish it so i can call in my order! \n\n*gives official stamp of approval for good food with good value*", "author": "El B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Delicious and affordable banh-mi! I'm glad there's finally a nice banh mi place on San Bruno so I can skip my drive to the TL. The staff is very friendly and the food is made fairly quick. My favorite is definitely their meatball and combo! The only downside is the parking but overall a great place!", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "What a hidden gem! I tried the combination pork and I was blown away at the quality of my banh mi for such an affortable price!! A part of me wants to keep this place as a secret so that the lines will stay short, but my sandwich was so good that I cannot contain myself.", "author": "Stacey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "This place opens at 8am, which is super nice when I occasionally spend my morning at San Bruno. I'm vegan & order the tofu banh mi without mayo & jalapeño. Sometimes it tastes better than others, but for $4.50 it's a great deal. Everything is really fresh & made to order for you. I will keep coming back to this place for lunch since it is just so good!", "author": "Bri D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Definitely hit the spot!  There isn't enough banh mi shop outside the heart of San Francisco.  Ordered a combination pork and grilled pork both were good.  The grilled pork could have been a bit more grilled.   Can't forget your Vietnamese coffee and Che!  \nThey only have 2 workers so call in your order ahead so you don't have to wait.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Decent Vietnamese sandwiches. The bread was crusty not soggy and there was a generous portion of meat. I wish there were more picked vegetables in the sandwich or an offering of it as an aside. They put jalapeños in the sandwich so make sure you pick them out if you're not a fan of spicy. They sell drinks and other Asian desserts/mochis. I can see this place turning into a Little Paris shop if they had more offerings like noodles and noodle soup.", "author": "W A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-03", "description": "I was driving home from an early morning workout when I discovered this pleasant little family-owned spot. Since then, I've attended this shop twice.\n\nThe 5 Spice Chicken Bahn Mi has been my sandwich of choice! The small chunks of chicken are marinated and kept warm in a heating pan. You can definitely taste the sweet flavors while eating it in the Banh Mi, but it's not overly sauced to the point where it overpowers the pickled vegetables. Out of the two times that I have had it, I was only slightly disappointed because the chicken was on the drier side once.\n\nI have also tried their Combination Banh Mi. Pro tip from the owner is to order this specific sandwich if you are not planning to eat it for a few hours because the bread won't get as soggy from the meats as some of the other options!\n\nOne interesting thing that the folks here did with the bread is scooping out some of the bread in the inside so that the sandwich has a higher meat/veggies to bread ratio. \n\nThe bread is nicely toasted, but I'm not sure how it would hold if you don't eat your order within the hour.\n\nParking can be tough in this area, but definitely worth the visit!", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "They recently opened in the Portola area in with wonderful viet sandwiches. They have five different selections and they aren't too pricey; it ranges from 4.75 to 5.00. Also, they have a wide selections of Vietnamese meat and desserts. There's only one worker making the sandwiches so it can be a little of a wait. Other than that I will definitely go again!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "I had never had banh mi before, but am now a fan thanks to Banh Mi House. The flavors are so fresh and vibrant, with a nice mix of sweet and zesty. My favorite is the meatball sandwich. They are fast, kind, and the place is sparkling and spotless! There are a few counter seats, but I'd get it to go--also, since it's on San Bruno, parking can be kind of a pain, but there's usually a spot within a block.", "author": "Umilia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "I've literally been here 3 times in the last 4 days. It's great and I absolutely looove the combo sandwich! Parking sucks, but ...you do what you have to do to get awesome banh mis!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Very tasty sandwiches - it seems to be a classic banh mi place.  I'm not normally in this neighborhood but I plan to keep it in mind.", "author": "Kurt R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "I had a really great experience here. First of all the food was great. The sandwich are my favorite. Second, the place looks really nice and clean. And lastly the customer service was outstanding. The were very kind and friendly. I will definitely be back and will recommend this place to my friends. Great place!!", "author": "Marisol M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This probably my favorite Banh Mi place in San Bruno/ Silver area. I always order their banh mi pate and sometime combination banh mi. Their banh mi is as good the banh mi I tasted in Vietnam.", "author": "Ping P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "I come here all the time -- before work, after work, on the weekends. I love the combo and toasty baguette and all the toppings they include. Perfect little family owned shop and a great addition to the neighborhood. It's cash only, tax included.", "author": "Cynthia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Small little shop on the corner but their sandwiches are delicious!! They only have a few items on their menu but they excel at what they do! Prices are extremely reasonable so you definitely can't complain for what you're getting at such a low price~ will definitely be coming around here more often!", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "3 sandwiches to share between 3 people. Combo (deli-meat), grilled pork and grilled chicken. Right away we notice the bread isn't French baguette, it's a denser roll. More for your money perhaps? One person liked the large portion of meat and pickled vegetables. The grilled meat sandwiches weren't grilled to my liking. I've been to places where grill pork is charred a bit where it taste similar to BBQ, but here seemed like it was cooked with a lot of sauce before assembling for the sandwich. Not my preference. It is San Francisco, every chef has a twist to their own recipe. Of the 3 sandwiches we shared, combo was the best of the 3", "author": "Robin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Great!!  I've seen this place a few times in passing and always wondered if it was worth a try.  The restaurants around here don't \"look\" the cleanest-therefore, I try to eat someplace else.  This tiny place caught be by surprise! Super fresh ingredients and$5 for a sandwich!  We ordered the grilled pork and chicken-great choice!  They only accept cash-There is NO sign. -_- That was annoying..closest ATM is one block away at a grocery store.  The staff is super nice and happy to help!    Needless to say, I will be back! :)", "author": "Tia Marie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "Delicious baked pork sandwiches at $4.25 each with tax.. Other types are available, about 7 or 8 in total.They have Vietnamese coffee made with Nola French Market coffee, and assorted Asian drinks, aloe juice, and my favorite coconut water Don't know their hours or days of operation. Located on the corner of San Bruno and Bacon. Opened for business 3 months ago.", "author": "Albert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "I fully support this new business for 2 reasons.  1) my son goes to preschool with the owners kids. 2) Vietnamese Iced Coffee is legit. And 3 (ok I added one) The CHICKEN Vietnamese sandwich is DELICIOUS!", "author": "L P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-10", "description": "It was an OK sandwich, fresh, adequate amount of stuff, warm and toasted but it took more then 15 mins with just 1 person who've already ordered in front of me.  I ordered 2 sandwiches.  I make sandwich faster then that.  3.5 stars", "author": "Mar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Super fresh & perfectly balanced. Best Bahn Mi on San Bruno Avenue. Not many choices, but all you would want & the Fancy Pork that's not on the menu has butter and does feel fancier than the typical. Four sandwiches for $19- can't ask for a better deal. More of a take out, but there are seats if you like.", "author": "Honora L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Great sandwiches. Ran by a local Portola family. Prices are a bit higher than many other places (about 5$) but the quality seems better and plenty large. Great addition to the neighborhood.", "author": "Audrey N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Sandwiches are great. Hard to find a good banh mi nowadays. They only have one person making sandwiches so expect to wait if there's a few people in there.", "author": "Cedric F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "Great new business!\nTheir bahn mi is better than the other local restaurants and the staff is nice. \n\nGreat lunch spot, but order takeout! There aren't many seats :)\n\nYes, takes a little while because they cook the meat to order, but I wasn't waiting more than 5 minutes so I'm not sure what the other reviews mean haha", "author": "Ellie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Great neighborhood sandwich shop just opened:\n- Fresh ingredients, proteins and veggies\n- $5 a sandwich and you will be full \n- Clean and they make sandwich in front of you wearing plastic gloves\n- nice people there, seems like owner and daughter there while I stop by today\n\nLove love this place :)", "author": "Suki C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "BOMB! Growing up in a Vietnamese family I can tell you this place is legit! My favorite banh mi spot on san bruno!", "author": "Brandon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "I'm very excited to see this place open in the neighbourhoods! The menu looks delicious.", "author": "Petar L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "This is probably my favorite Vietnamese sandwich place so far. As a SF native, I've tried all the places in the city. This one is it. Go for the combo.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Fresh and delicious. By far the best bm I ever had. Great find in the neighborhood. Love it!!!!!!!!!!", "author": "Bubu B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "best i've had in a long time.  no need to go to civic center or sunnyvale anymore.  highly recommend", "author": "LAURENCE M."}
