{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Fantastic well made old fashions + made to order hand-carved ice cubes to go with your old fashion\n\nWhile not my go-to drink of choice, really cool to see they have fernet flights \n\nDecor/ambiance strikes the right balance of date night/causal evening with friends\n\nOverall Thoughts\n\nWill definitely be back!", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "My friends and I used to go here fairly regularly, at least until it changed.\n\nWe went there on Saturday night for some birthday drinks. The bartenders took our basic order (4 beers of the same type) and came back and said we just ran out out that, indicating some other beer we didn't order. I also asked for a glass of water and they gave me a glass that held about a cup of water.\n\nThe most annoying thing was that the music was obnoxiously loud. This place used to be reasonably quite and lounge-like. Apparently now they try to replicate front row at a concert. We could barely hear each other and left after one drink.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-19", "description": "We were at another bar, but left cuz it was too crowded. Decided to check out Bar 821 instead. We walked in on Friday, August 10th around 10:30 pm. Our party of four easily found a table along the wall.\n\n*Manhattan 821: kentucky bourbon, meletti amaro & bitters ($11)\n*Amaro Blood & Sand: islay sgl malt, ramazzotti amaro, tuve fernet amaro & orange juice ($11)\n*Mexican Alps: aromatic walnut tonic, ramazzotti amaro, chile tequila & lemon ($11)\n\nI got the manhattan. I actually don't remember the cocktail much, but it I believe it was nicely balanced. Easy to sip on. I'm more into spirit forward, so if it was on the stiffer side, I probably would have remembered. I liked the vibe of the bar. Chill and laid back. It also has a beautiful ceiling. At night, it's gorgeous with the colorfully lite wall of liquor.\n\nNow why am I giving this spot two stars? The restroom. There was only one toilet (for both men and women) and it was sooo nasty! It was as if the toilet had exploded. There was something unidentifiable around the toilet. The floor was flooded. And the smell?! A urinal from the depths of hell comes to mind. Thinking about it makes me sick. That stench was indescribable. Plus, the door lock was faulty, so the two times we went to the restroom, we walked in on someone.\n\nFun bar. Reasonably priced cocktails. But that bathroom. Only go if you don't plan on peeing. It's not worth it otherwise!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "Hey Bartender don't throw sugar cubes to get people's attention. Also your sarcasm was a bit over the top and your drinks mediocre.", "author": "Eddie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Amaro is a spirit category that Ive had very little experience with, but that has changed a little bit after my experience at Bar 821.  This place is more on the smaller side, but it is still easy to grab a seat at the bar or a table if you come reasonably early. We sat at the bar and had positive experiences with both of the bartenders. I told one of the bartenders that I was interested in doing an Amaro flight. He customized a four pour flight of Amaro's and they were all great selections. Next time, I would probably only do three pours. The four pours hit me a little hard, lol. I  took a sip of the Boulevardier cocktail that my fiancé ordered and really loved this cocktail. The cocktails and personalized service are all worth stopping in for.", "author": "Yvonne I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "Bar 821 is a pretty decent place to meet up for drinks with one or two other people. It is definitely not ideal for a large group of people. The place itself is dimly lit and creates a nice little ambiance. \n\nThey do have a great selection of fernet and amaro, if that is your thing. The cocktails were a much better option for me personally. Fernet and amaro aren't really my thing but the cocktails at Bar 821 are legit. \n\nThey do not have an extensive food list, just minimal options so I would not go here expecting a full meal just some snacks. Overall, great experience and I would go back again.", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "A part of me almost doesn't want to write this review as it's so close to my house and a total treasure that i selfishly want to horde to myself. SADLY, i'm moving neighborhoods soon though, so y'all are in luck as i let the cat out of the bag!\n\ni popped in on a Wednesday night to meet up with a date and found the atmosphere to be cozy and intimate, but not too frou-frou that i felt uncomfortable in a t-shirt and flats. the crowd is a relaxed mixture of locals which also helps keep the environment on the chill side.\n\nthe bar has a massive selection of Amaro drinks if that's what you're into, but they also do a fantastic job with classic cocktails of all kinds, and had a solid top-shelf selection of other spirits as well.\n\ni ordered the boulevardier to start ($5 during happy hour, WHAT IS THIS INSANITY?!) and moved onto a classic whisky sour as the night progressed. the bartenders are the perfect level of cordial / friendly and aren't shy but also never overtly intrusive. personally, i like having friendly banter with bartenders whether i'm flying solo or with company, since it makes the whole place feel more neighborhood-y.\n\nwe didn't have a chance to sample the snacks but they looked delicious. as a single female, it's also nice to know there's a solid go-to place that i'd be comfortable hanging out at by myself without fear of creepers or obnoxious tech bros.\n\ni'm sad to change neighborhoods but would easily make a trip just to come back here.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Quite literally stumbled on this gem of a place after dinner at barvale down the street. Did not know it was an Amaro bar (we were amateurs?) until we asked the bartender why Montenegro was hanging on the bar, as we sipped our beers. He teased us for our original order and poured us tasters on the house and we were sold. \n\nHighly recommend. Great vibes, knowledgeable staff and great drinks - as long as you don't order beers :)", "author": "Steph J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Came here after work and this place gets packed.  They serve great cocktails, but the place is pretty small and crowded. It took a few minutes to have our drinks ordered and made.  They were playing some old school music.  Cool spot, but wouldn't recommend for big groups.", "author": "KB B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Bar 821 is quickly becoming my go-to bar in SF. Get there early enough to grab one of the comfy seats by the window or take a seat at the bar and mingle with any of the knowledgeable bartenders - especially if fernet or amaro are your thing. Also, happy hours ends at 7:30, which I love! \n\nAlso, shoutout to Ade - he makes a mean gin gimlet and is an amazing bartender!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I loved this place. The drinks and the service are excellent. The bartenders Davide and Luis are knowledgeable and very helpful. They even gave us free olives and free shots. \nTry the flight of Amaros. So nice to discover all these different varieties.", "author": "Simon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Decided to check out this bar after dinner at Barvale with a group of friends. Glad we did! Bartender was very accommodating and knife skills were impressive! Enjoyed watching him sculpt the ice cube for my whisky. Definitely a plus that they had a good selection of liquor there and he also took a shot with us. \n\nGreat selection of music. What's not to like? Looking forward to my next visit :)", "author": "Jade D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Bar 821 is my neighborhood bar now. Initially, I didn't like it because it seemed uppity because of its large selection of fernet and amaro. But, it's turned out to be one of the least pretentious non-dive bars out there.\n\nHIGH LIGHTS\nIt's never overcrowded. There's plenty of seating and standing room, and several bartenders. It's never too loud and you can actually have a conversation with others here. \n\nThey will make you any drink, even if they haven't made it before. I asked for a cloverclub, but the bartender had never heard of it. However, he was able to make a pretty good one after just glancing at the recipe.\n\nThe bartenders are friendly. They actually make eye contact with you. Insane that that's not a given, right?\n\nlow LIGHTS\n\nNone. I always pick 821 to meet up.\n\nOVERALL\n\nThis is my ideal bar. Never change, Bar 821.", "author": "Jiann M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "5 years later, still unimpressed. The small-time hipster in me says this place has potential. The realist in me (after many visits) says this place is overcharging its patrons and could do with better-portioned drinks and service. $29 for two drinks, one being just a straight-up shot. Dude.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "The best place to have a private party.  The space is fantastic.  The staff is phenomenal.  We got to bring in our own food and play our own music.  This is my favorite neighborhood bar.", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "I liked this spot.. it's a charming bar with strong cocktails. We tried the Montehattan & the From Milano with Love, both good drinks. Even though we were there for Happy hour on a Sunday (5:30-7:30pm) it wasn't too packed which I enjoyed. Minimal options for food (I think I only saw a cheese plate on the menu) but certainly a good bar to checkout if you're looking for a relaxing spot to have a few drinks.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "A quaint little bar and cocktail lounge in the NoPa (North of Panhandle) district. I popped in for the first (and hopefully not last time) before attending a concert around the corner at The Independent. It's a cozy little spot for those who appreciate good spirits and craft cocktails. \n\nWhat impressed me the most was their extensive selection and focus on Amaro and Fernet. They have every liquor imaginable, but judging from the two large boards on the wall detailing their selection of these two items, I'd say this is their bread and butter. I am sort of a fernet novice but have been slowly tasting my way through all the brands. Fernet Branca seems to be an across-the-board favorite and I've really grown to love the drier Fernet Francisco. The long, dark wooden bar here is perfect for sipping and savoring both. \n\nThe number of fantastic watering holes in San Francisco never ceases to amaze me. You can add this one to my list of ideal places to enjoy a cocktail in an intimate atmosphere.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Place is great, bartenders are friendly, nice seating. You'll have a great time\n\nDon't be scared to try the canned food. It's of this world.\n\nAlso thank you to Kaled for being a great bartender. Showing us the best hospitality.", "author": "Nathaniel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Interesting little bar. It's specialities- digestifs. Amaro and Fernet, all kinds of, literally. Smells and feels like an herbal garden, friendly agreeable crowd, music is loud but tasteful. Bartenders are friendly, they do take their time, it's not the place to get hammered in succession, nor a sleazy pick up joint, feels more like a low-down hangout neighborhood joint. Like.", "author": "Juls C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "Decent bar with interesting decor and a fair amount of space. It has the typical bar stools and high tables with the corner having more comfortable seating. Their sweeter cocktails were good but their savory ones were actually a bit sweet, which was odd.", "author": "Mario B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Its another place that great to go to have a drink.something unique,interesting and fascinating to try the different kind of Amaro and Fernet on their Amaro and Fernet Flights.My Favorite is Amaro Sibilia (Macerata/Italy) and Jelinek Fernet (Luhacovice/Czech Republic).Learning something new every day ..and cant beat the happy hour.it's $5.50 for a Negroni and Scottish Boulevadier.David and another bartender just amazing!!! Thanks for the great experience. Highly Recomended", "author": "Emanuel V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-10", "description": "Here's a strange concept -- a bar that specializes in Amaro and Fernet. Yeah, so apparently they're Italian herbal liquors with digestive properties. Think bitters and vermouth. Suggested serving is on ice with sparkling water. It's not cheap so if you don't know if you like it, you can spend even more money to try a \"flight\" of them. My friend commented that it seemed like they were trying to make this absurdity a cool trend. \n\nWe just happened to be in the area and it looked nice inside. It was only 5:11 PM on a Saturday so they'd just opened. The place was freezing and the metal seats felt like a slab of ice under my ass. I shivered while looking at the menu and we finally decided on one drink of the day (a $5 happy hour special) and one other cocktail ($11). They looked nearly the same with a cinnamon stick and orange peel. Hers tasted like sour orange juice, mine tasted like strong liquor with bitters. \n\nThe bartender was wonderful. Helpful, sweet, fun to watch making the drinks, attentive. He asked us how the drinks were and the best we could say is \"interesting.\" Three more couples filtered in while were there so maybe this place is doing alright. Not sure I will be back but it's an attractive hipster joint and I wish them luck.", "author": "Angelique L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Was beyond surprised when I stumbled in here dinner on a Friday. Bartenders are so friendly and the drinks are top notch. The music is what sealed the deal -- this guys aren't messing around and one drink led to four because of their hospitality and delivered ambience. Will come again.", "author": "shannon s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-21", "description": "Decent bar for a drink, although the food options are quite limited with only charcuterie/cheese plates, octopus and one other offbeat dish I can't remember. We wanted more varieties for nibbles so left after our first drink, but the place is nice enough. Service was a little slow.", "author": "Steven V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-16", "description": "It's my first bad experience since moving to San Francisco two months ago.  In short, they lost my credit card, poured out half our drinks when we were upset about them losing our card.  They seemed liked they could care less when they lost my card.  They then blamed me when they found it because they mixed up my name.  \n\nDetails:  We ordered cocktails, and the bartender asked if we wanted to keep the bar tab open.  I said yes, and he took my credit card.  The drinks were just ok, so we decided to go elsewhere. When they brought the bill and credit card receipt, we realized they ran someone else's credit card.  I went to bar to tell them that it was the wrong card.  They then asked for my last name.  They came back and said they couldn't find my card even though it was only 10 minutes after I gave him my card. He kept looking for my card.  He asked me my name again. I told him my first and last name.  He said he couldn't find it.  He never said he was sorry.  He just kept saying that he didn't have it.  He then asked me to see if a charge showed up in my account. I had to go online to see.  Nothing was charged.  He said he didn't have the card but he clearly didn't seem to care.  We then asked why he never said he was sorry.  Then they took our glasses, which still had half of the drinks left, and emptied them into the sink.  \n\nWe kept saying it was a red Wells Fargo card, and he would rudely say he knows what the card looks like.  Three minutes later, he asked me my name again.  He then found it.  He then seemed to blame me because he didn't understand my name.  He then charged me full price for the drinks (even though they dumped half of them) and he charged my credit card.  He took no responsibility for his actions.  I hope he took the charge off of the other person's card!\n\nFrom the moment we arrived, they were not very welcoming.  The vibe is snobby hipster, and they seem disinterested when they thought they lost the card.  Be careful with these very careless bartenders.  I'd stay away.  There's plenty of places in the neighborhood with a better vibe.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "This my first negative review on Yelp- and Bar 821 more than deserves it. They gave us the wrong credit card when we closed our tab- they ran someone else's card with our bill and gave us that person's card. That was extremely careless, to say the least. When we noticed and told the bartender, he then told us he couldn't find our card after a brief look around his area. He didn't seem apologetic or concerned. We asked him to keep looking, since losing and replacing a debit card is a serious thing. He again briefly looked then leaned on the bar and said it wasn't there. After a bit of back and forth, we started the process of canceling the card he lost- during which time they cleared our half full drinks and threw them out.  We AGAIN described what the card looked like and said the name on it for the fourth time. He didn't seem interested in finding the card he admitted he lost and didn't even offer an apology. Luckily, the waiter happened to see the card sitting right by the bartender's cash register- at which point the bartender charged us for our drinks even though they threw them out while half full. \n\nIt was quite possibly the worst service I've ever gotten at a bar. I understand that things get misplaced, but his lack of concern and lack of even a cursory apology was shocking. \n\nNeedless to say, we won't be going there again. And folks who care about their cards and their financial security shouldn't go to such a careless and apathetic establishment.", "author": "Waymon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Love their sangria and champagne cocktails. \n\nYou can also bring in your own food!!\n\n4 stars because hours are a bit short and not much beer to choose from", "author": "John Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "This is a fun, intimate bar.\n\nNOT good for groups.\n\nSmaller tables.\n\nGood stop for a cocktail after dinner.", "author": "Maura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Went for a date on a Friday night around 7pm and it was small but plenty of seating. I even got one of the tables... probably cause we were there so early. Apparently they're obsessed with fernet there and I had a couple of different ones and they were so good! Guys behind the bar were really sweet and friendly. Love this place already and it makes me realize why this area is up and coming... great bars!", "author": "Ruby S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-10", "description": "Thought they had fernet on tap, but just in bottles. No food or light snacks which it could use. Chill and out of the way. Good for a drink or two, but not much else. Needs some kind of distraction like a TV or even some pinball. Even trivia cards would be fun.", "author": "Eric J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Great wee bar, I'm not quite sure what Amaro is and I'm not a fan of Fernet but they have other things too. Nice vibe comfortable couch seats next to the window. Bartenders are cool, attentive. \n\nThe Peat & Peat is damn good (Peaty Scotch, Allspice, brown sugar, angostura and orange) if I ordered it back in Scotland I'd probably get hit with the whisky bottle, but when in Rome and all that. \n\nOpens at 5pm by the way, not 4pm.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "I came here for election night, which involved sitting at the bar for hours in stunned silence while nursing many a vermouth cocktail (a first, and their HH special).  That said, the one positive about that night was the discovering Bar 821, their vermouth cocktails, and their impressive list of amaro and fernet choices.  I'll be back soon with a fernet-loving friend to check out their amaro and/or fernet flights.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "I guess Monday's are pizza and Fernet day.  This cute little bar with its caged up liquor was the first stop to our night.  He got the Fernet flight which I thought was supposed to be best served AFTER a meal but whatever, any excuse to drink.  I wanted a lychee cocktail but the bartender recommended a special drink not offered on the menu.  I'm not a fan of cocktails or mixed drinks but this drink was exceptional.  Not too sweet, not too strong, perfect for this lightweight.\n\nThe bartenders were very friendly and knowledgeable not to mention, they have a great sense of style.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "What? I can't hear you over the increasingly loud Euro trance! What?\n\nBartender wasn't familiar with their own happy hour specials, and the pricing wasn't much of a deal if any. The bar was empty, and I still couldn't hear someone seated next to me, shouting. The great reviews of this place remind me there are different crowds for every bar, and they're not all universal. \n\nGo to Big Bar instead.\n\nEdit. We were charged $10 and $12 all during happy hour, not $6.", "author": "Jay T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "I wouldn't really recommend getting food here. I really enjoy their drinks but there is definitely rooms for improvement on the food menu.", "author": "Penny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "Weehee I think I found the perfect spot for grabbing drinks on a weeknight. \n\nAs you walk in a warm cozy feeling sets in. You look to your right and see 2 big boards with their selection of Amaro and Fernets. Since both of these are digestifs I suggest going here after dinner.\n\nI tried the amaro flight. Don't remember the name exactly but it had the cardamaro. That's a great way to introduce yourself to the world of amaro. They also have flights of Fernets. \n\nBartenders are friendly, people are happy. All in all a great way to drop in for a drink on a weeknight.", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "Cozy neighborhood bar with incredible cocktails! You want a negroni? an Old fashioned? Or how about champagne cocktails?\n\nAll cocktails are $7. Cash only. \n\nGo.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Met a friend for a glass of wine. Turns out if I ordered the charcuterie plate($16) the wine($9?) was free. Charcuterie was simple but good. Than another glass and the cheese plate(no free wine, it's okay:). Cheese also good. Both had crackers, no bread. They have a very extensive drink menu. Spend several hours there. Nice setting.", "author": "S Blair P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Nice bar. We came here on a Sunday evening. The place was completely empty. Seven of us walked in and brought the party! Bartender was nice, drinks were yummy and the bar's really charming. Would definitely come here again!", "author": "Priti K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "Cute little place. Kinda reminds me of a dive bar based off the size and how dark it was in this place! They were in the process of revising the drink menu when we went, so many of the drinks I'd seen on-line weren't available because the current bartenders weren't familiar with them. \n\nDon't expect to go in here for basic vodka cranberry, week ummm because they don't (didn't the night my friends and I were there) have cranberry juice. \n\nGood music playing and the bartender was super patient as we tried to decide what we wanted to drink. We ended up just telling him the liquor we wanted and if it should be sweet, tart or sour and he did his thing and made 4 wonderful cocktails. We'd all go back next time we're in town!", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Jon is the best!!! People but on Fridays lil Jon makes a special appearance. He is the best make\nSure to stop by this place!! Good vibes", "author": "Sydney R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-12", "description": "I live about 2 blocks from Bar 821. Have been going since it opened about 9 year ago - at this point will ever go back and likely never to any of the Dajani Group restaurants. \n\nOn my most recent visit, as soon as I sat down I was asked if I'd like some sparkling water.  Many places are serving on the house sparking water with the ease of using the soda systems, so I said yes.  As I was looking at the menu, I looked up and realized a bottle of sparking water had been placed down with some poured in my glass (opened before I knew it).  I realized maybe he is going to charge me for this.  I'm not one to be confrontational and in my head, if he truly ended up charging me, I'd much rather alert management of the ridiculously of doing this at a local bar.  In the end he did - at $5.  It was happy hour - beers are $5 at most places. \n\nI loved the old Bar 821.  With the change to an Amaro Bar, I've still given it a college try and wanted to support.  Before writing bad reviews I did alert management via email and they have failed to even email me back - guess they don't care and want this sort of behavior to go on, which makes me not even want to support any of their restaurants.", "author": "Josh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Granted I don't make it over to Divis as much as I should, how had I never heard of this place?? It's fabulous! After dinner at nearby Nopalito, we were looking for a nightcap before heading home and Bar 821 nailed it. Fun ambiance, not too crowded, and a glowing cocktail selection. \n\nFirst off, don't get overwhelmed when you walk in. It's a smaller bar and they have huge menus up on the walls. Admittedly, I was at odds not knowing what any of the listed spirits / liquors were, but they also have a paper menu with signature cocktails. You can order wine or standard drinks, but their cockatil line-up was so fun! I was on a mezcal kick so opted for two different drinks that included this, egg white, and a plethora of other ingredients I'd never heard of. Super tasty. Staff is hard-working, attentive, and certainly entertaining. My only (very small) gripe is that they seemed understaffed. The place was not crazy crowded, but with one man behind the bar and an eager crowd, it took some time to order. \n\nAll in all, such a fun spot that I hope to venture back to sooner than later!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Now that's a place for fernet & amaro. Be adventurous, just ask a friendly waited what a today's special is and go for it -- you won't regret.", "author": "Kat S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "Very cute inside and $7 cocktails during happy hour - can't beat it. Had a thyme infused old fashioned and the bartender was really friendly. A great stop before dinner at NOPA.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Never busy, somehow, no matter the time, even at 8:30 on a Saturday.\n\nVery knowledgeable and friendly bartenders, a huge selection of amaro and fernet, and a well-stocked bar. Not much beer selection, but if you want some place to just sit and drink and chat, this is the place.", "author": "Gabe B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-10", "description": "Cool hip bar that doesn't get too crowded but word of advice: don't ask the bartender for recommendations because he will upsell you. We tried to order what we wanted, but instead he said \"oh you should really try this drink instead, it's like a better version of what you want\". We agreed to get the different drinks since he kept insisting on us trying it and when we got the check saw that he had upsold us on top shelf versions of what we wanted (bourbon and fernet). Know that it's our fault for ordering but would be nice if he told us \"oh and it's also 3 time as expensive as what you initially wanted\". if $$$$$$$$ ain't a thing for you, then order away, but if you're like most people, don't let the bartender upsell you", "author": "Derrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "A nice, small neighborhood bar with an impressive selection of liquors and cool atmosphere.  This was the first place that came up on the Yelp app when we realized we still had some time to kill before a show at the Independent.\n\nThe bartender was working hard yet still made eye contact with us as we sidled up, telling us it would be a moment. A professional at work.\n\nDrinks were strong and tasty.  They made a mean Old-Fashioned for my friend P.  And my Bombay and tonic was perfect.\n\nMy only complaint was the place was packed at 9 pm on a Friday and space was quite limited. I made an attempt to hit the single, unisex bathroom, but the long line made me do an about-face and decide to look elsewhere. It was time to go to the show anyway, just a block away.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-19", "description": "Bar 821 has a lot to offer but are horribly understaffed on busy weekend nights. It's part of the Dajani Group, who also owns Nihon Whiskey Lounge on Folsom which is awesome.\n \nSaturday night was the second time I've been out to Bar 821. As tradition goes, my friend sets off for San Diego mid June, so I try to squeeze every last hang time out of the month of May that I can. So we had a nice light dinner and wine at my place, then cabbed it over to NoPa for a change of scenery. \n\nThe place is very cute and upscaley feeling without upscaley prices. We both had specialty soju cocktails: she had the Lychee Mermaid and I had some kind of \"Gin\" Negroni. Her drink was sweet and subtle, mine tasted like earwax. Yes, I know what earwax tastes like, judge away. Surely it's difficult to mask soju in a gin flavor. And, real-talk, I didn't know it was soju until after I ordered. \n\nAround $8 a cocktail and a very ncie ambiance, I can't complain too much. OR CAN I? One bartender for the whole place? Really? It's NoPa. A ton of people head this direction for a similar purpose as my friend and I. Also, just want to say, it's misleading when a bar back looms around behind the bartender and sips water.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Definitely a very interesting bar. It was fun trying out the various fernet and amaro based drinks. The vibe was good as well. Look forward to coming back here for more experimentation.", "author": "Ankur V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Loved this quaint and cozy bar. The bottle ledges are sick, the whole room of the bar is dark and pretty small but somehow it was the perfect place with the right ambience to grab drinks with a friend. The bartender (Davide) was attentive, kind, and the best kind of bartender you'd want to be making your drinks. He took care of us; we didn't feel pressured to order more and he asked about our drinks at the right moments. He misheard one of our orders and thought we ordered a beer, and immediately told us not to worry and that the beer was on the house. Cocktails are well made and delicious (we asked for bartender's choice for my last drink), the bar's vibes are on point. Will definitely come back here if I'm in the area again.", "author": "Ashley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Oscar is one of the best mixologists I've ever met, and his hospitality is unparalleled.  It was my first time in this bar, and I felt like I've been going there for years.  I say mixologist and not bartender because this guy is far from tending bar.  He is more of an artist than a bartender.  His knowledge of flavors in composing cocktails is among the best of the best.  This is not an overstatement even though this is a somewhat understated bar.  Go here.  If you like hand crafted cocktails and you know something about them, this is your place.  If not, come here anyway and learn!", "author": "Brent Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "My aunt recommended this spot while I was in town visiting from Austin. I told her I was looking for a chill place with a full bar that would be quiet enough for conversation on a Friday night. 821 fit the bill on those criteria, but where it fell far short was in the condescension of the man-bun sporting bartender. As we approached the seemingly well-stocked bar, I searched the shelves for their vodka selection, only to find out that vodka is déclassé in this hipster paradise. \n\"Do you have Grey Goose?\" says I, with a winning smile. \n\"THIS is the only vodka we serve...\" says man-bun, pulling a sad bottle out of the well. \n\"...Oh... Um, is it any good? Why are you hiding it under the bar?\"\n\"I guess it's fine. This is all we have, LOSER.\" (I added the 'loser' part, but just barely)\n\"Oooookay, I guess I'll try it, for $12. Thanks ever so much.\"\nWe took our trailer-trash vodka drinks and slunk away from the bar, popping our Hubba Bubba, slapping our flip flops on the polished concrete, and hiking up our acid-wash dungarees tied with rope, hoping only to drown our shame in off-brand booze. \nIf you're going to have a bar, or any business, for that matter, try not to make your patrons feel like they don't deserve to grace your door. It's a sure-fire way to piss off the hillbilly masses.", "author": "Vanessa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "Unique is the word for this place.  I was not familiar with Amaro and this bar offers a wide variety for beginners and pros alike.  The bartender, John was fantastic and helped my wife and I choose something we both liked. He also made me an excellent tequila based \"old fashioned\".  We will be back!", "author": "Larry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Our cocktails were so thoughtfully created by Oscar. Superb! I'm a huge Moscow mule fan and their Italian mule was definitely a delicious spin. The drinks were great, the atmosphere sexy yet comfortable, and our mixologist was simply a cool dude that made you feel like a guest.", "author": "Nancy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "I love this place, but I'm frustrated. I'm a local who wants to make this my regular place, but 3 out of the last 4 times I've been there, they've attempted to over-charge me for drinks I didn't order. The first couple times, I thought it was an honest mistake by lovely bartenders from Italy who are just a little scattered. But the third time they charged us for drinks we didn't order... let's just say it has me wondering if it isn't on purpose. I'll update my review of things change: I'm not giving up on this place yet, but I'm close.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "Bar 821 has a good Monday night happy hour with half price bottles of wine (choice of one white and one red -- they come in ~$16/bottle). It's a comfy place to lounge and hang out with friends when you're looking for something low key. Definitely also a plus that they let you bring food in (and Little Star is across the street)!\n\nRecommended.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-03", "description": "Bleh. It looks like a super chill, relatively luxe hangout spot - but the terrible dance music is so. insanely. loud. you can't even think straight. On top of that, our tiny drinks were $12 each and mine (prosecco, chartreuse, bitters) was room temperature. It took so long to make, even though the place was only half full, that I didn't want to ask for a replacement - it was easier to just chug it and get out of there.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "I live a few blocks from this place, but hadn't been there in quite awhile. I stopped in last night (seriously, it's probably been well over a year since I've stepped foot in the place) and REALLY liked some of the tweaks they've made! The big change being they now serve liquor, and have a pretty extensive drink menu (written on a cool chalkboard) with tons of signature drinks. \n\nI don't know if the chalkboard & light-up liquor display are the only changes they've made, but honestly, those couple tweaks just gave this place a whole new vibe I really like. \n\nThe only reason I'm not bumping to 5 stars is because I was here early on a Wednesday night for a drink with some friends. I'd like to see what it's like on a busy Fri/Sat night to get the full effect.", "author": "George A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-02", "description": "They're charging $8-9 for draft beer. I recall paying $1.29 at the Bean Bag for a local beer. This was a few years ago and obviously things change, but that's the neighborhood I moved to. I'm not sure who Bar 821 is catering to, but the same beer next door at Mini Bar is $4. I mentioned to the bartender that these were AT&T Park prices and he just shrugged and handed over a  $9 beer... and it was flat.", "author": "Alan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "A big group of us wandered in just after they opened, and we got a warm welcome even though the bartender was still getting everything prepared. \n\nTheir cocktails are pretty inexpensive for the city ($8) and delicious. Comfy booths, a larger-than-expected wine list, and just being a fun place to hang out - these round out the list of reasons I'll be back. \n\nThat, and it's fun to judge your friends when they order the happy hour special: $5 for a shot of Irish whiskey and a PBR. \n\nKeep in mind, it is cash only. There's an ATM there, and a few up and down the street.", "author": "Colleen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-15", "description": "Raised voice.\n\nGrowing up Mom did it all the time. Apparently calling her out of class so she could pick up the latest version of Legend Of Zelda was not a good choice.\n\nHere at 821 despite two very good cocktails for aa very good $17 can't give more than three stars. We pretty much had to yell while conversing over rather loud music.\n\nDetracted from an otherwise relaxed and inviting vibe with a friendly bartender.\n\nTone is down and stars will be up.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-13", "description": "Good hipster drinks but can someone please fix the speakers, decent music but God it sounds bad.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "Another Cash-Only bar, 821 I would rate just a tad above Madrone because it's MORE chill when it's not busy.  Drinks are good and cheap and they bring dog-friendly to a new level by stocking Milk Bones for your companion.  \n\nBartenders are extremely friendly and even offered free drinks in trade for our group's dog which says a lot about the atmosphere.\n\nI definitely recommend 821 and hell it's pretty close to a lot of good eats.\n\nAgain though, CASH ONLY so bring your greenbacks.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-28", "description": "BEWARE!\n\nAs a visit time visitor and neighbor in the area I always wanted to try this bar. Unfortunately I had to pay a few extra dollars for drinks because of the bartenders greed. I didn't notice when ordering but I was charged $3 dollars more a drink then what was posted on there menu.\n\nIf you need to make rent this month you should of asked. I have a bad taste in my mouth and will never return to this bar. \n\nYour drinks sucked too.", "author": "Hammed K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "A chill little spot to meet and catch up with pals. Dim, but not dark, and a sexy kind of relaxed. You know, like a subtle pair of dark jeans that make you look kinda hot in all the right places. \n\nThe ladies and I chilled in a corner, sipping on fizzy lady drinks and beer, while an A's game played in the corner. Good times.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "The bars start to blend together as you run along divisdero and Bar 821 is just another one in the long line of options in this area. If you are looking for a story or a place that you have to recommend to your friends to go to this probably not going to be it. Nopa, La Urbana and Candybar will probably fit that bill better. But if you actually live in the area or want to avoid the tons of overflow from NOPA and the Independent this is a nice place to duck into. It doesn't get to busy there and you can talk to a couple people over a nice mix of drinks. \nThe place has some pretty decent cocktails but this is the kind of bar you go into knowing what you want. There is usually only one bartender and they are pretty knowledgeable about the drinks. It's a no frills bar that is set up like a frills bar. The décor is inviting and there is usually ample seating. It feels a little more upscale because of the deco so if you aren't looking for dive bar but don't want to be surrounded by a ton of people Bar 821 and its neighbor Mini Bar are great alternatives to the hip and overpriced neighbors done the street. \nIts still expensive though with about 10 dollars per cocktail but you are probably used to that by now. \nThis is one of those places you will end up frequenting more and more because you want to avoid the show and dance of going to the other more popular places down the street.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-21", "description": "It's a cute little bar with decent drinks, nice decors, and semi-friendly service but there was nothing too memorable about this place.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "Have I mentioned how much I love my neighborHOod? Bar 821 is one of the *gillian* reasons why I do...Apologies, my yelpies for not reviewing this gem sooner. \n\nQuaint, dark, and comfortable is the best way to describe Bar 821. Great diverse crowd of HOod and non-HOod dwellers. Love the vibe and ambiance, and be sure to check out the interesting flicks on their flat screen. I've been here on numerous occasions (meeting Popchip angel and Tsaritsa for the first time, pre-post dining with L, D, or M, and even a few dates, etc.,). \nBest place to sit are the tables by the window. Take heed, as it can get really noisy if super crowded (typically Friday & Saturday nights). \n\nGreat selection of wines, champagne cocktails, and a few beers on tap. \nMy fav specialty drinks are the are the Lychee and Pomegranate champagne cocktails. My most fav aspect of this bar is.... wait for it....tada.... The HO is on tap here. Oh Mylanta! My beloved HOegaarden is in my HOod bar! Gotta love it! \n\nBartenders are always nice, and usually just one tending. So if it's crowded, you might be waiting a bit for your bevy. Recommend going for Happy Hour during the week, and be sure to check out their daily specials and the signage by the front door. FYI, they close earlier than most bars, and closed on certain days. \n\nCheers and see you at Happy HOur!", "author": "Gill C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-16", "description": "A small, well decorated bar with lots of seating and moderately priced drinks ($7/cocktail). I liked the vibe. It's a cool place, no doubt.\n\nBut on a Thursday night, there was only one bartender and it must have been over 10 minutes before we got our drinks. I ordered two drinks and she said it'd be a minute. 10+ minutes later and comes back to me and looks to me as if I haven't ordered before. I said I already ordered and she continues to give me a blank stare, kind of like a \"what do you want\" look. I repeated myself and she finally made it.\n\nShe seemed to consistently take in at least a few orders at a time before she fulfilled them, which is probably why she forgot. I saw others wait a long time, too. \n\nThere really needs to be another bartender.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Just stepped into this spot for a quick drink, I got a Virgin mojito, my ladies got la diabla, and gin and tonic with Lolita gin and all three drinks got our attention,  they are delicious! !", "author": "Licy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "So their crazy cocktails tend to be too citrusey (citrus is good but so much you pucker is not) but really how often can you pay $5 for someone to work that hard on your drink. It's rare.\n\nStick with the champagne cocktails, they're a little ligther on the citrus", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "Yaaaaa! Liquor liquor liquor....liquor liquor liquor! Mini bar has a competitor. Let's watch these two spirit enthusiasts duke it out for cocktail supremacy.\n\nIt's a little more comfortable to lounge there a little more room. Good drinks, that Fog City was my demise.", "author": "Jackson D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-11", "description": "Not a bad place per se, but I had a very disappointing experience here.\n\nI came in with my boyfriend for a decompressing drink. We ordered two glasses of prosecco... and then, maybe 30 seconds later, asked for the whole bottle instead! We were sitting at the bar, RIGHT IN FRONT of the bartender, so there was NO DELAY of communication here. \n\nWell, the bartender had poured us the rest of an open bottle (maybe 1.5 glasses) and then opened a whole bottle that we ordered.... Great, right? Well, she made us pay for the TWO glasses that she poured. WHAT??!!! It's prosecco, it's CHEAP! Why do this?! It was WHOLLY UNPLEASANT on principle. \n\nI am NOT coming back. I'm going to Mini Bar, where the drinks are tasty and bartenders are AWESOME!", "author": "Liza P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-12", "description": "I am in love.  This bar is awesome.  We didn't have trouble securing the big table in the back.  The chairs are comfy.  We don't have to scream in each other's ears to have a pleasant conversation.\n\nMon-Fri, 5-7:\n$3 for champagne and specialty cocktails?  I'm sold.\n$3 draft beer.  Booyah.\n\nAll the other times the drinks are around $6, which still beats some SOMA happy hour deals.  :) all around.\n\nYes, the bar closes at 11 every day.  Yes, it's cash only, so come prepared (they have an ATM in the front).\n\nTry the wannabe bloody mary cocktail.  It's effing delicious!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "I've been here more than a few times now, it's a good small divvy bar with cheap booze and that intimate dive feeling about it.", "author": "Beni R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "One of my favorite bars in SF. I live close by and pop in every now and then with my friends and my boyfriend to get a drink after work. They just renovated and got that incredible amaro and cocktails based on it. Highly recommended!", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-15", "description": "$3 champagne and sake special coctails from 5 till 7 pm! I loved the bubbles and black currant drink. Small but flavorful and unique. Try it you will like it! \nBut try it during happy hour :)", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-14", "description": "Always a good spot for a drink or two.  Grab a seat and enjoy a few cocktails.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "I'll start by saying, I love the word, \"NOPA.\"  I don't know why, but I do.  The acronym doesn't make any sense, given that it represents North of Panhandle, but it's such a adorable yet charming word.  Like, \"do you like to get your hair pulled?\"  \"NOPA!  But an occasional tug doesn't hurt.\"  :)\n\nBar 821 is a dark venue.  Very minimal lighting...sorta sexy and mysterious.  Like a cloaked gentleman in the corner that you can barely make out his silhouette, but fantasize about what's underneath.   \n\nI don't remember if they served wine, but the beer was satisfying.  It's the perfect place to grab a drink and canoodle.  You might have to yell a bit since the noise level is pretty loud.  \n\nThe best part:  I overheard a guy talking to his buddy about how he wanted to have a threesome but only if it were with two girls.  Oh really, you don't want to share your lady with a dude?  Get out!  Gotta love the adult drink convos that occur late at night.   Did you have fun?  YUPA!", "author": "Soo Jin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-26", "description": "It's a love / hate relationship.\n\nYou love it b/c they serve boozes, just wish they could get the hard liquor license, I would definitely come again. Hoogarden and Chimay on TAP! \n\nDid you hear me or do you need hearing aids?!!!!\n\nYou hate it when it closes early. WHY?!\n\nthis is my sad face : (", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-07", "description": "Nice decor, fun sort of pricey mixed drinks, but probably too popular for its own good; lots of crowds & that means waiting, noise & jostling elbows to get by.", "author": "Mordicai C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-17", "description": "Danielle serves up epic cocktails for only $7! Chill neighborhood spot, great drinks and excellent customer service. Danielle also rocks it with fantastic happy hour deals. No question: this is the best bar in the Western Addition!", "author": "Deb B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "My little after work spot. Love the happy hour specials. The bartenders are cool and the place has an intimate quiet vibe which I like. I'm not trying to deal with crowds after work. And this is the perfect place.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-11", "description": "I've found a great place to hold my AA meetings...alcoholic amigos gatherings..that is...\n\nThey have awesome happy hours--$3 cocktails and beers...\nI had a couple of bubbly and lychee drinks tonight..then some bubbly with ginger...the some bubbly with bitters...it went on and on..til I got really hungry and had to make a run for my tummy.\n\nThe bartender is super chill and cool..the crowd was a bit iffy...shady at best..but who cares when you are there with your amigos?! I can see this as a perfect place to tie a few on while you wait for your Little Star pizza...or hell..run over to Popeyes after you've had a few....", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-16", "description": "I love drinking, but I hate hard alcohol. Yes, yes, I graduated from UCSB, so this was a big problem for most of my hard party nights, but I still managed to out-beer most of my peers. Heh. What I'm trying to say is that I love wine and beer bars. In fact, if prohibition struck twice, but they only outlawed vodka and it's brethren, I'd be fine with it. \n\nNow that we've gotten that out of they way, and only one person is left reading my review (Hi Mom!), we can get into the greatness that is Bar 821. \n\nI went to Bar 821 on my birthday before a concert at The Independent. I had been craving a good pitcher of sangria, and what do ya know? I found one here. The sangria was awesome, it had a hint of what could only be described as \"christmas spirit\" (cinnamon), and was the perfect color. Sangria should not look like hot cheetos, guys. \n\nSufficiently buzzed, I continued to order off Bar 821's awesomely afforable menu ($3.50 -$7.00). Champagne cocktails are my new best friend. Try them all, but definitely try the one with fresh lemon juice (the name escapes me, but I got her number). \n\nHere's what I do:\n-Sangria\n-Champagne cocktails\n-It's my birthday, I can have one more.", "author": "Chanti B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-25", "description": "Of all the bars I've visited on Divis, this is my favorite.  Delicious, very reasonably priced drinks, cute seating area, great vibes.  The only reason this gets 4 stars instead of 5 is because of the extremely unfriendly bartende.  She took one look at me and said, \"I need to see some ID\" before even saying \"Hi\" or \"What can I get you?\"  It wasn't crowded, and yes, I get that you need to see my ID and I admit I look young even though I'm 24, but I'm a paying customer and would have appreciated being asked politely instead of in an accusatory, borderline hostile way.  Without that blip, this place would have been perfect!", "author": "Jen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "I didn't know 821 is associated with Corkage and Tsunami right around the corner. So, they specialize in sake, beer and specialty cocktails...no other liquors.\nFor a Saturday night at 10pm, the bar was relatively empty, but a good crowd was starting to arrive. I thought it'd be more crowded than it ended up being, which is awesome. There was no problem finding a seat either at a table or at the bar. Music selection was great, and not too loud so I didn't have to yell for my friend to hear me...that's very important to me.\n\n$5 for a beer, $4 sangria (which I was told isn't the greatest)", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-11", "description": "NAY:\n- The sangria wasn't that great.  It had an overpowering cinnamon taste and smell.  \n- The bathroom was gross and there is only one (unisex).  10pm on a Friday night and the floor was all wet already.\n\nYAY:\n- Lychee champagne cocktails", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "I love that this bar is in my neighborhood and I can get a pretty well- crafted cocktail for $7... Can't really beat that for value! Five stars because a nice bartender gave me a free cava before closing. That love is real man", "author": "Jin T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "Came for drinks on a Saturday night. Be aware they don't serve hard liquor and the beer list is not extensive.\n\nStarted with a ginger soju drink (disappointingly not gingery enough). Tried their lychee champagne drink (delicious). And beer-wise they have some belgians which I like. Ended up getting a pitcher of sangria (really good, very strong cinnamon). Perfect to split between 2-3 people. All drinks were around $6-8.\n\nMy biggest complaint is that they had last call way early (like 11:30pm on a Saturday). And they cleared the alcohol off our table just after midnight (some sort of rule). This was very disappointing.\n\nEnvironment: Small, dark, not terribly inviting. Seating at the bar or small tables with chairs and a booth bench.\nService: Order at the bar, sit anywhere. I think there was only one girl working when we went.", "author": "Kailyn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "It's no lie that this place has got to be one of the most chill bars I have ever went to.  Their Happy Hour is indeed, a HAPPY hour ($3.00 cocktails..and not JUST beer or ONLY certain cocktails.. MOST cocktails).  The actual place isn't too big, so it's quite cozy, the lighting is good and their tables and chairs are low and comfy for the most part.  \n\nWhat I must say is that their drinks are delicious.  I like the fact that they incorporated soju as a key liquor as it has a naturally sweet and mild taste by itself (to me anyway ;] ) and they have a plethora of different champagne cocktails as well.   I had three Lychee Mermaids (they were THAT good) and it all ended up being 9 bucks not including tip.  The Korean Special was quite delicious as well.\n\nThe only thing that I have a problem with the fact that they only take cash and you can't keep a tab.  That's pretty annoying and although I understand this during a busy time, we were the only ones in that bar that day.  \n\nOther than that, it's quite a delightful place!", "author": "Meena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "This is the place otherwise known as \"Birthday Bar.\"  \n\nMy birthday is 8/21.  This is Bar 821.  What happens when a girl whose birthday is 8/21 goes to Bar 821 on 8/21???  LOTS OF FUN!!!  My last two 8/21 birthdays have included extended stops here and I love it!  I'm shameless in whipping out my ID to show the door guy as well as the bartenders (even though no one asks for it!).  I'm always treated extra-special since we share a common number!  Once the bar tender produced a piece of cake with a candle.  How great?!\n\nI live three blocks away and come here regularly, not just because it's \"Birthday Bar.\"  The bartenders are always great and really friendly.  The vibe is laid back, especially if you're grabbing a post-work beer with friends.  I just love Bar 821 and all my friends wish they had a \"Birthday Bar!\"", "author": "Austin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-28", "description": "Sorry Nicole, we people who are \"so marina\" have descended upon your adorable Divisadero Row.\n\nWe just love the lounges.  Stylish, fun, good conversations, great bartenders, people who look good without trying....\n\nThis place should stay open later, like 4 am.  The bench-like seats along the wall are built just right for extra-curriculars, just like a good couch, soft as hell but not too slippery, nice and sturdy with plenty to hold onto for appropriate leverage...just kidding.....sort of.\n\nThis place is how you want your living room to feel.  Plus I've always wanted my own bartender.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "Great local spot. Nothing fancy but if you are in the area and looking for a comfortable, not snobby place to grab a beer or even something fancier this is your place. They have a adequate liquor selection and had some interesting beers on tap.", "author": "Kenyatta D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "One of the most laid back bars in the city, I love coming to Bar 821 when I'm in the NOPA area. It is right across the street from Little Star Pizza so it's a great place to come when waiting for a table at Little Star. There are many reasons to love this place:\n\n * Chimay on tap (and a good selection of other premium beers)\n * Sangria\n * Very chill atmosphere\n * Friendly staff\n\nLast time I was here the bar tender asked us to choose the music we wanted to here, which was a nice touch.\n\nThe only bad thing about this place is that it's cash only. While they have an ATM there it does get annoying to constantly be pulling out your wallet when you know you're going to be there for a few drinks. I'd prefer to just open a tab and pay at the end.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-24", "description": "I seriously need to get a tattoo. If I had one, I too could hang out with the cool kids at places like Bar 821. \n\nWalking in with my Banana Republic self here on a weeknight I am reminded just how uncool I really am. The crowd here is definitely hipster and am willing to bet that everyone (but me) had at least two tattoos. \n\nThe bar offerings are good, however the wine by the glass list can probably use some work. I was impressed that they had Duval Belgian beer by the bottle. You rarely see it and I took full advantage and ordered one or two or maybe three.\n\nMy friends were all about the strawberry mojitos and some weird champagne drink that included some strange fruit thing that resembled an aliens head. Yes, I know what an aliens head looks like.\n\nThe music was eclectic and heard everything from Blink 182 to Echo and the Bunnyman and a twangy country tune that I actually liked. It may have been a little on the loud side and it made it difficult to have a converrsation, but we were there to drink so it was all good.\n\nThe tables are a bit cramped and had to keep shifting my legs around  so I wouldn't trip anyone.", "author": "V B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-21", "description": "This place is really awesome. The decoration, ambiance, music, the drinks. All was great. But it closes at 11pm.\n\nI am not American, so I find all the restrictions really strange. Minimum age is 21 to drink... Well, I'm old already so whatever. But then the bar only serves wine, champagne sake and beers. Something about the license?... I guess some people might be put down by that, but for me it's not a problem too. I had two different champagne drinks, and I liked them a lot. And the tap Chimay was great. The beer selection looked great to me, and good prices too. I can't tell of any food, didn't try it. Bathroom was fine.\n\nA game was on TV, but it didn't seem anyone was there to watch it. I saw _some_  people there, mostly friends and couples talking, it seems. Anyway, I was liking the place a lot. The music was really really good, lots of soul and funk... But then, they had to close at 11pm. That's just crazy. Is it something about the license too??\n\nSo everything about the place looks great. But it made me go home earlier, and I have to take a star for that. And it looked like it was much emptier than it could be _just_  because of that. So because this problem seems to be really hurting the place indeed, I must take a second star.\n\nBest place to go if you want to have some good time on a place where it will be really easy to sit and to get your orders. And then come home early. If you want that real memorable \"fun times\" parties, and totally \"spend the night\" somewhere, look for another place.\n\nMaybe it just pretends to be a good place to get the night started, whatever.", "author": "Nicolau W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "By the time I hit this bar, I had a couple beers and shots of whiskey in me to help fuel a small party. We got inside and there was no seating (it is a smallish bar, very long but no real width) so we stood behind the bar stools near the bar. We were able to get our drinks really quick and soon enough a couple seats opened at the bar.\n\nWe stayed for a few more drinks and overall we had a good time! I didn't mind standing at all. Everyone seemed to be coming and going anyways, so it wasn't long to get a seat.\n\nI like the low lit atmosphere and the back lounge area. It is swanky and a bit sassy, but I felt right at home. There were people dressy and others who looked as if they got back from snowmobiling.\n\nI like this bar.", "author": "Angie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-05", "description": "$5 cocktails?  Don't mind if I do!  \n\nI tried a drink that was raspberry syrup and hibiscus with champagne, and it was delicious--dangerously so, in a \"Wow, this doesn't taste alcoholic at all!\" kinda way.\n\nThe drink menu is really expansive with a lot of specialty cocktails between $5-6, which is reasonable, I'd say.  \n\nBartenders are nice, and they let you bring food into the bar, as long as you pack out what you pack in...kinda like back country camping.  More on this shortly, but this bar gets some stars for friendly service.\n\nI liked the atmosphere here, and one of the first things I noticed was how clean it is.  Not even \"bar clean\"...straight up clean.  There are some tables, so the 3 of us actually brought in our pizza from Little Star across the street and devoured it right then and there.  \n\nThis is where the cleanliness factor becomes even more important than normal.  Don't get me wrong--I love my dive bars.  However, when you're trying to eat, it's nice to have a clean surface and not feel bad picking up the piece of sausage you dropped on the table and then eating aforementioned table sausage because you're such a fat kid.\n\n**Heads up - cash only!  (They do have an ATM inside, and there's a Wells Fargo ATM on Oak right off Divis.)", "author": "Alice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-23", "description": "Small, nice neighborhood bar (it says so on the window next to the door before you enter). \n\n--DRINK--\nI had the Lychee Champagne Cocktail. It's a mix of champagne and lychee juice/syrup and topped with one lychee. The flavor was okay. TAO restaurant in Vegas makes a killer Lychee martini with bits of lychee. \n\n--OVERALL--\nIf you don't like hipster, Hollywood type place, this is the place for you. It's unfussy and down to earth.", "author": "Ann N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "What a cute place!\n\nMy man and I went on a Friday night at around 9:30, there was a good handful of people but it was not overly crowded, it was perfect. The drink menu was good, I think it could be better they also have a nice wine list that I hope to check out next time.\n\nA nice place to check out!", "author": "T C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-29", "description": "Tried their Sangria: a heaven. \n\nIt was pretty busy Friday night, but the awesome bartender was running the bar all by herself so effortlessly.  Reminded me of my life as a barista where I used to run the entire coffee shop all by myself.  It was dark days : /  So kudos to the bartender. \n\nThey have mojitos made with Soju! This Korean MUST go back and try it! \n\nDark and loud enough to do & speak raunchy stuff ;-)", "author": "A K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-05", "description": "Quiet watering hole to chat with friends. It is a nice enough location without standing out as special.\n\nNo cards and a broken cash machine put a halt to the afternoon at 821\n\nI would visit again if in the area but wouldn't go out of my way to return.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-02", "description": "Happy Hour ends at 6pm. :( It starts at 4pm but peeps are just making it back from work by 530ish. It was empty and probably for that reason.", "author": "M R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-02", "description": "A nice, small bar and it's usually quiet enough to hear the people you're with.  The staff is great too.  They do have a minimum bar selection.\n\nThe sound system sucks though!   My friends and I noticed how terrible it was and the next time I went up to order a drink I intentionally looked around to see what they were using.   Are those overpriced and underperforming Bose speakers I see hanging in the ceiling?   Please get rid of those things and get something decent.   (if you're thinking, \"but I thought Bose was really good\", then you're mistaken)    Those little square things were definitely not designed for a bar.  The sound is super tinny and it sounds like an amplified transistor radio.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-04", "description": "I guess I didn't pay enough attention when reading the reviews here - Bar 821 doesn't do spirits.  When people say \"cocktails\" they mean sake, shochu, and champagne.  They make some pretty tasty things with them (the Soy Lovely, e.g.), but it just isn't the same.  Also, the sangria was disappointingly bland.\n\nIt was crazy packed and noisy as hell last night, but we later realized that was because of Art Walk and so maybe isn't the normal scene.  Oh, and despite being totally packed, they closed up and kicked everyone out at 11pm.  :-/", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "One of the best handmade cocktails I've had in SF (a whiskey sour.) The wait staff knows what they're doing with the drinks, and the crowd was lively without being a pain. I can't wait to go back. Cash only.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "I suddenly realized that I was stuck on 821 because of its (old) bartenders. And, admittedly, the fact that it's close to home.\n\nIt's all different now. I've lost my love for it. Where are all my good bartenders? Where is the good neighborhood service? What happened to Joey?", "author": "D'arcy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-27", "description": "Came here last week and to my dismay i found out they no longer have the 22 oz huge beers at happy hour but rather a lowly pint.. I still love this bar though and they have the chillest bartenders in the city i'm sure of it...\n\nA part of me died that day though.", "author": "William S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-01", "description": "Pretty cool little bar. I like the whiskey/beer happy hour combo.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-12", "description": "Joe the croatian is the bartender?  wait, what??  but I AM the \"Korean Special\", why am I on the cocktails menu? \n\ngood times... good times...\n\nanother one of those dark and halfway sleek skinny bars, but a pretty decent one for the neighborhood.  Not sure if they're trying to be ironic or just cheap but the cash only thing when they're trying to be a wine bar too is really really annoying.", "author": "Nikki F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "Yeah, yeah I really like this place! \n\nWent there on a Friday around 6:30, not too crowded, assume I missed the happy hour rush that is very typical in the \"Vis\" (shhh that's what i call Divisadero)\n\nGreat decor on the walls, tattoo influenced, with a tattoo parlor next door. Coincidence? Great Happy Hour prices $3 for most beers and champagne cocktails! oooh la la. Donnie Brasco on the tube followed by The Darjeeling Limited! Oh, be still my heart.\n\nLittle snarky on the service but I'll chalk that up to a bad day maybe. Definitely will go back and spend more money there. Great for pre-show at the Independent down the street.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "A pretty cool place, i like their light beer --- gold garden?( i am not sure the name). The space is small and comfortable. It's good for relax. I love it.", "author": "Aichi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "OOh, I like this place.\nI like the cozy, laid back seating.\nI like the layout of the bar.\nI like the inventive champagne cocktails and wine selection.\nThis is a great date spot.  You can converse without yelling at \neach other and flirt shamelessly over candlelight.\nWe wandered in here on Valentines Day, taking an evening stroll\nafter a wonderful dinner. Of course I ordered the Valentine cocktail:\nchampagne, blueberries, chocolate in the bottom of the flute, \ngarnished with a strawberry. The bar also offers a great happy hour \nwith $3 cocktails and Belgium beers from 5-7. . .", "author": "Kia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-16", "description": "Heaven, to me, is a bar where I can booze it up with a large, luscious, and frothy Hoegaarden and not worry about whether I'm \"cool\" or \"attractive\" enough to be on the premises.\n \nSeemingly plucked from the streets of Amsterdam, dropped on Divisadero, and populated with a smattering of neighborhood denizens, heterosexuals and the people who love them, Bar 821, my friends, IS that bar.\n \nYou'll find a great line-up of beers and bubbly champagne cocktails here.\n\nThere's also a chill, discreet, almost DL vibe, and if you know me, you KNOW I'm all about the DL thing.  Until, that is, I get a call from his wife accusing me of being an ankle-grabbing homewrecker because she hacked into his email and found all our sordid correspondence, thus forcing me to call him and say \"LOOK BITCH, you betta choose between wifey and your 2.5 kids or my exotically starved body,\" OF COURSE he chooses ME, all is wonderful for a few months until he asks me to undergo a sex change operation, so I use some ruse like \"Let's visit the Sears Tower in Chicago, sweetie\" in order to drag the motherfucker on Jerry Springer where I call him out and he throws chairs and punches Steve the security guard in the face and tells the audience \"Y'all don't know me, suck my *BLEEP!*\"\n \nSomething like that.\n\nANYWAYZZZZZZ, I had a wonderful time here celebrating the birthday of the sexy Sassy S.  The fabulous dotRachel was there of course, along with Quinn S, Jenniflynn, Bucky K, Lauren S, and AKA G.  I also invited myself to lesbian night at Mecca since I STAND STRONG with my Sisters in the never-ending struggle to do what we want with our VERY LARGE SEX ORGANS.  Unfortunately, I didn't stay long enough for cake or porn consumption, but I heard both activities were very filling.\n \nBut WHO IS THIS CHEWIE G people keep mentioning? Was he there? Do I know him? Most importantly, DOES HE HAVE A YELP PROFILE?!? 'Cause you bitches KNOW I don't associate with anyone who isn't on yelp -- fucking PLEBES!!!!\n \nOkay, okay, I'm joking. Chewie is a really great guy: cool, sweet, and charming. He told me he used to have moobs, though now they're morphing into meaty, muscular pecs that I wanted to massage with Crisco.  Yeah, he's THAT sexy.  For a terrorist.", "author": "d s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "I forgot about my idea of having them make me a kier royale with lychee juice in it. OOPS but I did order another Lychee Champagne for $6. YUM. I like Bar 821, and you will too.\n\nBtw, CASH ONLY. \nAnd yes, there is an ATM inside.", "author": "Heidi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "You know you're in trouble when your cat tells you to leave the house. \n\nOur dialog went a little something like this:\n\nMr. Biscuits (the cat): \"Get off the couch mom, I'm sick of your moping. If I have to watch one more hour of \"Sex and the City,\" I'm gonna lose it.\" \n\nMe: \"Okay Mr. Biscuits, but where should I go?\"\n\nMr. Biscuits: \"I'm just a cat, how the hell should I know?\" \n\nOkay, Mr. Biscuits is OBVIOUSLY not a Yelper, so I call my girl. J-Len, I need to get out of the house, out of my sweats, and interface w/the real world. I'm looking for somewhere close, should I feel the need to run home, and with kind lighting. She says, meet me at Bar 821. It's only 4 blocks from your house, Ms Lazy Bones. And they have a limited bar menu, which should keep it nice and simple as not to confuse your addled little brain. It's been awhile. \n\nMe: \"Mr. Biscuits, help me find an outfit to wear.\"\n\n It's hard to tell from a cat's expression, but I chose black and white stripes, which he seems to only wear. (His wardrobe is rather limited.) Relieved to have the house and remote control to himself,  he blinks in my direction as I leave. \n\nMr. Biscuits: \"Pick me up some cheetos while you're out.\"\n\nRrright, I set off into the strange, yet exciting world. J-Len was right -- only 4 blocks away, and the lighting kind and cozy. It's a weeknight, so not too crowded, the tempo and atmosphere just right.  I had the cab, she the champagne.  \n\nA good night, definitely worth leaving the couch for. Thanks for the push, Mr. Biscuits!", "author": "Suzanne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "What a lovely little neighborhood bar!\n\nIf your friends are a bunch of outrageous party people who regularly get banned from establishments during massive saturday night blow out parties, I recommend this bar on a weeknight.  This place bans people.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-15", "description": "You know you're someone when members of the Yelp Illuminati like Peter Mmmmm., JT F., Heidi A., Bucky K., Darin I., Lauren S., Mick F., Jenniflynn R., Quinn S., and even the much mourned and beloved Chewie G. show up to your birthday party.\n\nSo Sassy S. you should feel like you've made it.  You're somebody.  Me, well, I'm nobody.  Since it was your birthday party, and not my birthday party, and no one showed up to my birthday party, and I sat alone in a corner with a party hat on and a sash that said \"Birthday Girl\" and ate 3/4's of a German Chocolate Cake with my hands.  But that's a whole other review.  Of cake.  5 stars.\n\nBar 821 is small and dark and loud.  They let you bring in your own pizza and porn (Sounds like a typical Friday night for you, huh?  Stay classy.), which anyway you spin it sounds like one hell of a party.\n\nHappy Hour until 7 gets the birthday girl drunk enough to start telling people what they are doing wrong in their life and talking about how she is a prude, and at the same time lets Rachel G. not feel TOO bad about sending her home with JT and Peter and a bag of porn and chocolate.\n\nI haven't heard from her yet.  \n\nShould I be concerned?", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "Things that make luis m forget that he can't order a jack n coke:\n\n- $3 Guinness Draught\n- super cheesy, topping heavy pizza\n- Anal Bandits\n- ridiculously large nipples\n- Trojan Vibrating Rings\n\nThey might not be able to satisfy your craving for the hard hootch here but it's nonetheless a very cool spot to chill with a few people, have some drinks (beer, wine, champagne, sake...), and waste away an evening.  Very clean and stylish on the inside, plenty of seating space, and a great bartender all make this place very inviting.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-28", "description": "If you like champagne and testicles, this is the place for you.\n\nAnd by champagne, I mean champagne, and by testicles, I mean lychees. \n\nI'm not a huge fan of lychees, or testicles for that matter, but the Stella here is free flowing and delicious...unlike the skunk-tasting brew I had at Casanova, that bush n' boob bar in the Mission.\n\nBar 821 is good people, and by good people, I mean people who juggle cocktails, buy copies of \"Anal Bandits\" from the liquor store down the street, and bring their giant dogs for me to maul. \n\nThe bartender talks real sexy-like, the seating is cushy, buttery and plentiful, and the space is chic and modern. My one gripe would have to be that the acoustics here sort of blow monkey balls. When you get a bunch of rowdy Internet dorks all riled up over a hooker in a tube top of sexy destruction it becomes a bit deafening in these tight quarters.\n\nAlso, big ups to any bar that allows you to bring in outside food. Thanks you beautiful babies for letting us eat pizza. And by us eating pizza, I mean me burning the crap out of my hand on Ed's fourth piece of meaty meatington surprise pizza.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-10", "description": "This place reminds me of the bathroom at the Mint.\n\nBut it's in the neighborhood and the happy hour is a deal and half: $3 mocktails and beer. Can't be too picky, I guess.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-10", "description": "I'm a fan of this bar, hey it's in my neighborhood, but I have to say I'm sad they do not serve hard liquor and also have some odd opening/closing hours. \n\nThat said, the space is cozy and intimate, and you definitely feel like you're in a local - yet hip - establishment.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-09", "description": "Seriously sexy little dark (but not TOO dark) intimate bar in NOPA with a great wine selection and a friendly appealing SF diverse crowd.  Filled with mission hipsters, hot tatted mission chicks, hot non-tatted marina chicks, fixie bike boys, first date couples, 20th date couples, fresh-faced college kids and middle-aged corporate tools (me).  Everyone fit in nicely and no one seemed out of place.  And, the bartender is an incredibly friendly welcoming guy. \n\nI love this bar.", "author": "Jay Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-01", "description": "Note: neighborhood secret bar is no longer a secret. get over it. i'm over it.  just like I'm over thinking that madrone could be my own private drawing/eye-candy/antique sofa lounge, or that Popeye's may one day get kicked out of the hood. \r\nAnyway, what surprised my friends and me during our recent visit, were the champagne drinks! I've been to 821 dozens of times, but never ventured beyond wine or beer. I'm not a huge lychee fan, but i found myself with a tall slender bubbly glass including a lychee at the bottom! Another darling champagne drink, called \"Valentine\"  included a strawberry & a chocolate chunk at the bottom...for roughly $4...I just about fell in love...\r\nBar 821: smooch.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-30", "description": "I just discovered the coolest little hole in the wall bar last week and sure, 221 of you fools scooped me, but I don't care, this place is rad and it can use another review!\n\nI was having drinks with my friend who rarely leaves the 4 block radius of his house, and since I am only drinking vino these days, he suggested this place. As I walked up the block, I was looking for some place called 821 and of course, it's the address. I don't know what it is about bars that take that direction, but they always seem to be pretty cool. Take 83 Proof for example. Maybe too many bars are over thinking fancy titles, when your addy is a good route to go. Just sayin...\n\nAnyhoo, when I walked in, I instantly loved the fact that it was nice and dark. It wasn't dark and divey like I generally tend to gravitate towards, but instead it was dark, modern and very cool and still approachable and comfy. Definitely not an easy decor cocktail to mix.\n\nThe bartender (Joey) working that night instantly made me feel at home and definitely scores my coveted 5 stars for blasting Richard Ashcroft for the entire time I was there. He must be psychic since RA is one of my all-time faves!! \n\nI will definitely be returning! The wine was deelightful and reasonably priced, the crowd was very neighborhoodie (not the sweatshirt line) and all in all, it was a damn fine time :)\n\nYay, 821. Simplicity at its finest :)", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-04", "description": "Maybe there's a legitimate reason for this, but last night the bartender at 821 was completely rude- telling me and the two males I was with as soon as we walked in the door at 10:30pm that \"they were done\", and that we \"had to leave\", when there were at least 15 other people inside the joint sitting at the bar and at tables with full drinks. Everyone turned and gave us prejudging death stares.  He could have been polite about it.  If he had been nice and explained to us why, I wouldn't be so bitter.  It was the way he talked down to us that left a bad taste in my mouth.\n\nI felt like he judged us when we walked in, deemed us to be not hipster enough and told us to leave without giving us any sort of reason.\n\nAlthough they probably assumed we weren't locals, I live four blocks away (in SF since day one), and I'll never be back.  First and last time.", "author": "Genevieve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-28", "description": "If Bar 821 were a drink, it would be the Black Velvet.\n\nThe pairing of Guinness with Champagne is the perfect contrast between the everyday and the extraordinary that makes this place so unique.  It's one part lounge, one part neighborhood watering hole, one part hipster dive.  And it works together beautifully.\n\nI've been here twice now and both times I have felt so relaxed and at home.  The noise level never gets too high, and people are respectful of each other.  The crowd is mixed, from people waiting to eat at Tsunami to the guys from Everlasting Tattoo a few doors down to the regulars.  The first time I was there, I watched a really cool skateboard video and just hung out while I sipped my Black Velvet and waited for my Little Star Pizza to be ready.  The next time, I brought my friend Michael and we had a grand time shooting the shit and enjoying the $3 Happy Hour cocktails.\n\nThat's right, 5-7pm Happy Hour = $3 for everything.  You be hard-pressed to find a better deal than that.  \n\nI prefer the Champagne cocktails to the soju drinks, although my friend liked the Apple Mojito a lot.  For the champagne cocktails, I would recommend the Ginger one or the Lychee.  There is also a Chocolate/strawberry one that I would love to try when strawberries are in season.  As for my beloved Black Velvet, it will have to remain but a memory, as this lovely concoction is now off of the menu. \n\nLighting is low (good for dates) and seating is relatively comfy  (bench seats and padded chairs, or bar stools) - and the bathroom has these amazing walls that you just have to see for yourself. \n\nIt's a simple bar with a good atmosphere and very friendly service - a place where you can relax with friends in a chill neighborhood environment.\n\nNote:  Cash only.  (At Happy Hour, you can get 6 drinks for $18! Yeah!)", "author": "Liz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-23", "description": "Last Friday a friend of ours convinced us to swing by Bar 821 for Happy Hour. The night before we had drank and ate and spent too much, therefore we had promised ourselves a nice quiet Friday night. We arrived at 5:15 and ended up stumbling home at 2:30 in the morning... Our ship crashed upon the rocky shores of intoxication after hearing the Syren song of good cheap drinks. Happy Hour is that good here. Technically it lasts two hours, but during those two hours everything is three dollars. Granted they don't have a full bar but they do have great beers, wine, champagne and soju cocktails. \n\nWe drink our way through happy hour and then went  around the corner for some sushi. We eat and drink our way through dinner and evidently we lost track of time because the waitress asked if we would like to finish our bottle of sake at Bar 821. Bar 821 is owned by the same people that own Nihon and Tsunami, where we were eating at the time. For the inconvenience they gave us each a free drink at the bar. Just when I thought I was out, they pulled me back in...\n\nWe walked back in to a much more crowded bar, but they had put us at a reserved table with our drinks waiting on us. The sun had dropped during dinner and the bar wasn't near as bright and looked much better. Do you know of any bar that looks better during the day? That's not to say the bar isn't pretty because it is. It is very tastefully decorated. Throughout out the night service was top notch and I am sure we will be coming back in the near future. Hopefully, next time my internal fortitude will be a bit stronger and I will be able to call it a day after Happy Hour ends...", "author": "Bucky K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "Fun local bar in Nopa, great place to get the night started or just chill and have drinks with friends.  Friendly bartender and laid back atmosphere. I live down the street so its always a good spot to stop by for a drink.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-22", "description": "This tiny little bar is around the corner from its sister restaurant, Tsunami. We wandered in while waiting for our table to open, per the recommendation of Tsunami's hostess (and after walking in and immediately out of Fly because it smelled like barf...YUCK). \n\nWe got scolded like schoolkids for playing with the candles on the tables. We like hot wax...what can we say?!! SORREE! But other than that, this place is alright. 812 is quaint -dimly lit (uh, candles...that we couldn't touch), cozy seating, yummy Soju cocktails, and right around the corner from kick-ass sushi.", "author": "Esme W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "Five stars for decor, atmosphere, service and patrons.  \n\nTragically, no bar can earn five stars without hard alcohol.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-25", "description": "I don't know how this bar can have so many reviews and still retain that easy \"neighborhood\" feel. Used to be a good, unknown first-date bar: laid-back, dark, anonymous...well, no longer. Last night there was a table or two occupied by non-NOPAians, but generally you'll run into your friends and neighbors here. \n\nThe drinks are DIRT cheap. $5 for all Soju and Champagne drinks. Yup, $5. I had the champagne ginger thing....$5. The soju-lychee thing....$5. Another $5 and my ass is sliding off the chair....all in good humor, of course.\n\nHappy hour is $3. Ok, that's enough reason for anyone to come.", "author": "Carrie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-16", "description": "Inevitably in any city, a person finds their regular place--  and I was going to 821 after work all the time. \n\nThe place is not fussy at all. \n.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "Bar 821 is a great place to hang out with your friends if you are looking for a mellow evening. Awesome champagne cocktails (I had the ginger one, which was yummy) and a good selection of beers and wines. I asked the bartender, who is very nice as Starla D. has already mentioned, for a beer recommendation based on beers I already like. He recommended the Hoegarten Vanilla which was right up my alley and had a subtle hint of vanilla. \nThe atmosphere is great with comfy seating, pleasant lighting, and funky music videos playing in the corner.", "author": "Cyrelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-10", "description": "2 blocks from my house.\n22 ounce beers.\nSteps from the 24.\n\nI have found my new favorite bus stop.  I will be in here regularly waitin to catch the bus to the 'stro.  Its small, dark, comfortable, really comfortable and cheap.  I love it.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-13", "description": "Suede/velvet seating, low lighting and cozy space make this champagne bar a refined yet relaxed hangout for neighbors and those in the know. It's intimate and well serviced, two qualities the establishment preserves by under-advertising itself. Some of their house rules include \"If you have found the place, don't tell anyone\" and \"Doors close to [further] visitors after 11pm\" as well as \"We only serve nice people\".\n\nIndeed, they only serve nice people. Everyone there was smiling and polite. None of that meat market mentality here. Also, there was an oasis of sexy accents there that night - British, particularly. Rowr. The bartender from Manchester is a sweetheart and will offer suggestions for adventurous tastes. Ask him about the ABC, which was created there, courtesy of said bartender and fellow Yelper/local Gabriel T.: http://www.yelp.com/user_details?userid=RDwgEc8o15O2wqu-YQu29Q\n\nTap is a selection of European beers. Cocktails are $4, Champagne cocktails $5, and they have a nice one-page list of wines as well. It's all there in the handy laminated menus they leave out on the tables. Don't worry, it's actually legible in the candlelight.\n\nI'd love to see a collaboration with their sister restaurant Tsunami, or Cafe Abir, to bring snacks/food pairings to their wines, champagnes and beers.\n\nEat before or after to absorb the alcohol by going across the street for good pizza - Star Pizza and Stella Doro. And no need to drive, when the 24 Muni stops just at the next corner down.", "author": "Clar L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "I love this place because (1) it's totally chill, and (2) I like their champagne cocktails.  It's a great place to hang out and catch up with friends.  It may be crowded, but it never gets too crazy.  One big exception:  Art Walk.  (Should be re-named ArtDrunk, but that's another review waiting to happen...)\n\nOne thing I'm not keen on is that you can't run a tab.  Oh well.  I'll deal.", "author": "CC L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-18", "description": "The last thing I expect anyone to tell me when I walk into a bar is 'You're too young to be here.' Now granted, two years ago, this would have been a legitimate complaint because I would have been 20 and thus technically too young to be at bars. Thankfully, when I was 20, I was at UVA. And when you're 20 and at bars at UVA, you're more akin to a senior citizen than a fresh fish. \n\nHowever, apparently being 22 and at Bar 821 on a Wednesday night, I'm too young. The time that elapsed between me walking in the door and the bartender's unprovoked issuing of this statement was roughly 26.5 seconds. He then proceeded, completely unwarranted I might mind you, to assault my 22 year old friend with the belligerent denunciation that his taste in women was limited to drunk, blonde sorority girls. This may or may not be true. \n\nNow, I really, really wanted to like this bar. Prior to my 26th second in this bar, I quickly fell in love with the low slung leather lounging couches studded with low rising circular tables, the easily manageable (un)crowd, the relaxing lighting and the $3.50 Coronas. But it's difficult to love a bar when the snarky bartender picks out your lil-bit buzzed and slow-on-the-draw friend as a target in his lame attempt to impress girls with his supposedly witty repartee. I wholly understand he was trying to impress the girls to our right. But c'mon, you're the bartender, if you're so desperate to impress them, give them a damn shot.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-08", "description": "Summary:  A fancy local hang-out\n\nDrink:  Very tasty\nBartender:  Friendly with an accent\nClientele:  Locals with a smattering of couples on dates\nMusic:  Old-school hip-hip...nice\nDecor:  Couldn't say, place was very poorly lit", "author": "Stacy F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-08", "description": "I really don't know what to say about this place.\n\nUsually, I am sitting there--with a friend, date, family, etc--quietly forming my yelp review in my mind, thinking of the good, the bad, the ugly...but, I just don't know what to say....\n\nBasically, there is nothing that super stuck out to me about this place...kinda un-memorable. The main thing that I did remember: THE BLARING/OVERLY LOUD REGGAE MUSIC.\n\nOther than that...I liked that that bartender (who wore awesome jeans) came out from behind the bar to take our order at the table, the sangria was quite inexpensive ($4), and the bathroom was modern. There were two tvs going...one with the football game, and one with some black and white movie. Not the best lighting if you are one a first date with some dude from the Internet, because it's hard to see. But it's not intimate and quiet enough for a romantical date either.", "author": "Misha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "I love coming here. I moved to the area JUST so this could be my local bar.. OK not true, but it's definitely my favorite.\n\nIf you're looking for something that's slightly more subdued and a place where you can hang out and bullshit with some friends, this is it. They don't play the music too loud, the drinks are great and seating is always reasonable. Great place.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-27", "description": "So I have this thing where I seem to take my first dates here for many reasons.\n\n1. It's close to home (that way if it was a shitty date, at least I got a few free drinks and I'm three blocks from home)\n\n2. It's fairly quiet. It's nice to actually talk to the person that I'm with, as I prefer to not be drowned out by music. \n\n3. Happy Hour - I usually only go here when it's happy, as the $3 pints and apple mojitos aim to please.", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "Dark candle lit bar with some intimate seating that makes for a great happy hour spot with a few friends or taking that special someone. \n\nThe happy hour deals here are fantastic. Where else can you get a pint of Chimay for like 3 bucks? Crazy! All the belgian beers here are solid and you can't go wrong. Wine list is alright also and they have some Sake or Soju mixed cocktails as well. minus one star for no spirits - they don't have the license. \n\nBig bonus though as they let me bring in two Little Star pizzas from across the street to feed my ravenous friends after a long happy hour.  They even gave me some paper plates they found in the back! \n\nI'll definitely be back.", "author": "Morgan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "On the plus side, $3 champagne cocktail happy hour (including a lychee variety, always a positive).  On the minus side, I saw major hipster crack hanging out of skinny jeans at the bar.\n\nI like the small and intimate setting, but the few scattered people there were a bit random, and I don't know that it gave off the whole \"where everybody knows your name.\"  Oh, and the bartender kind of gave one in our party shit for double-fisting during happy hour, but really, what difference does it make if she chugs one separately after another or sips two slowly at our table?\n\nFor now this is more of a three star place for me, but $3 champagne cocktails and fear of the wrath of Mimi bump it up to 4.", "author": "Tanya N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-13", "description": "I'm slightly ashamed to admit that last night was my first night in Bar 821...the closest bar to my flat, and I'd not been there until last night.\n\nShameful.\n\nBut, I did finally go and really enjoyed it!  Granted, it was for a neighborhood networking event, so hard to get a pulse on what the crowd would be like, but it's cool and they make some interesting drinks!\n\nWhat I like most about this place is that it seems unpretentious....and not overly hipster like some other bars in the hood.  Just a local neighborhood bar with a cozy atmosphere and friendly people.  If I were a regular drinker, I'd definitely want this to be my 'local'.  Since I'm not, I probably wont come here on a regular basis, but will definitely be back!   Awesome happy hour specials ($3 drinks until 7pm!)", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-08", "description": "I love this bar.  It's a block and a half from my house, which makes it super convenient, but really it would be fabulous even if it weren't so close.\n\nThe atmosphere is great.  Not too \"cool\" (i feel comfortable no matter how I'm dressed - grubby and dressy alike), but it's got great lighting and decor.  I'm not afraid I'll stick to anything when I sit down like a lot of locals.  The music, while I've noticed it loop more than once, is a great mix of old and new, all of it fun.  The customers are there to have fun and relax.\n\nI've only ever been served by one bartender.  He seems to be a really chill guy who keeps up with any pace.  I feel good leaving him a good tip.\n\nI never drink the sake drinks, but their beer and wine selection is good.  \n\nPerfect for a small group or a date.", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-14", "description": "circlin' the western addition...as if trainin' for the nascar oval track...circlin', circlin', circlin' and circlin'...lap 4....pit stop...\"drats~!..a driveway~!\"...circlin'...lap 5....openning~!....u-turn...blinker....takes the checkered flag....parking~!\n\nbar 821...small quaint lounge style bar...eclectic..tricky to put a finger on a clear vibe...odd combo crowd.....odd combo drink offerings...beer...wine...and soju.....(only holding beer and wine license..likely..).....servin' up 22 oz. \"man beer\" for $5 (best bang for the buck).....bottled beer for $4......soju shots for $3.....in the other extreme....servin' up \"fem drinks\" like the bubblin' lychee mermaid...and various soju cocktails....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-09", "description": "If it wasn't for the mediocre crowd, the impossible to find street parking, and the fact that this place closes at 12 midnight, I'd hang out here more often. (Because the tasty champagne-themed cocktails are damn cheap--$5!! Just make sure to pay in cash because they don't accept plastic.)\n \nEh, Nopa, you can have your neighborhood bar, this Lower Haighter's not going back.", "author": "Viv C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-29", "description": "Aight listen:\nStrike 1: No hard liquor\nStrike 2: Cash Only\nStrike 3: Close at 11 (WTH?!?)\n\nIt was cute and trendy, I'll give it that. But fundamentally there are some things that make or break a bar; regardless of whether it's a bar inside of a nightclub, inside a Marriott off of 101, a dive bar, a lounge, anything. There are certain mandatory qualities to get me to frequent a bar (or at least want to come there more than once). Closing late is good, but letting my pay for my gin and tonic with plastic is also important.", "author": "Ross G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-27", "description": "I want to be accepted by this bar.  This bar is like, a cool sweet cute guy, who is friendly enough to me, but I just really want him to think that I'm cool too.  So I put on a special outfit.  Not like, a sexy one, but a cute one that will let him know that I'm a neat girl.  And I try to play it majorly cool, not getting all wasted, but just chillin on my champagne cocktail.  And I don't wanna stay too long, lest I get sloppy, but I will just keep coming back til he recognizes me.  My heart will totally flutter.  And I will feel that I have accomplished something.\n\n\n\n\n\n\nCan you tell that I recently turned into a fucking retarded 15 year old girl?  Christ.  Just go to the fucking bar already.  Unless you suck.  Then I will stab you.  Trust.  I just got a new knife.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-26", "description": "I don't get why people wet themselves for this bar.  It's okay enough and I could see why those in the neighborhod would really like it, but it's just one non-decorated room with corrogated metal walls and little else.  I'm not trying to crap all over 821's parade, but I just think this place is garnering too much hype for what it is.  \n\nHaving said all those mean things, I will say that they do have good cocktails (I recall trying something delightful with ginger) and I've never had to stand or sit at the bar for lack of a table.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-11", "description": "Most akward feeling ever here at this bar and might even say the bartender, door man, and even the Caucasians sitting next to me were pretty racist acting. I am Latino and have grown up in this neighborhood and its pretty sad to see these \"transplants\" come to the area i grew up in and treat me and my friends like were unwanted.  First of all the bartender lady didnt aknowledge the fact that we were standing infront of her for a Good ten Minutes while she was making some drink.  There was no one else waiting to order then this white guy comes in she looks at him says hey what would u like? My gf looks at me and says did she just ignore us for the past now 15 Minutes? My gf had to lean over the bar to ask her what we wanted and just says ok. It gets worst. We go to sit down and next to me this white lady has all her friends purses about 8 inches to my right she looks at me and slowly starts pulling all her purses away from me like i was going to steal her ugly ass crap and then moves even further away from me.  To our left there is a window and.the.door man just keeps constantly looking at us three like were about to rob something...wtf is wrong with these people? Might as well put a sign up no colored people allowed...thats how obious it felt.. Bar 821 u SUCK....and next time im bringing a group of Latinos here just to see if i was just being paranoid...dumb asses ;)", "author": "Alex R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-23", "description": "Being a rivethead, I am automatically attracted towards anything with a number in the name: Front 242, the 400 Club, Richard 23, 16 Volt, etc. So Bar 821 should be a shoo-in, right?\n\nWell, almost.\n\nFrankly, I don't mind that they don't have a hard alcohol license. Their beer selection, albeit limited, makes up for it in quality. But I did feel underdressed there-- fancy pants and pinstriped shirts looked to be the name of the game. I still got good service and no disrespect, but at a slightly upscale price tag. The smallish space and dimmish lighting makes for a intimatish experience, which is nice, but it's not the kind of place I'd return to by myself.\n\nMaybe that's just the rivethead in me.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-01", "description": "It's amazing to me how this place maintains an air of modesty about it, considering that my assumptions run wild every time I walk past & see a bunch of drunk folks in well-planned & expensive-looking outfits standing around outside having a smoke (inevitably one of the guys will have a tattoo sleeve & look like a pro-skater out burning his paycheck). \n\nBut when you walk in, it feels like you opened the closet underneath the stairs of your parents house as a kid & discovered there was an honest-to-God cocktail party in there. The bartenders are fast & very friendly, the space is cozy but not cramped, & the dark lighting lets you feel like conversational intimacy is a reasonable concept.\n\nA perfect place to stop in after a nice meal at NOPA or Little Star. And despite my occasional commentary on said two establishments' efforts to fancypants-up the neighborhood (I've got mixed feelings about it), that isn't any kind of statement against Bar 821.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-14", "description": "Number 16 of my top 100 goals-in-life is to double-fist some strong drink in some southeast asian dive bar.\n\nBut thanks to Bar 821's happy hour, I may consider checking this one off.\n\nI mean, how can anyone complain about $3 drinks? \n\nThanks Bucky K!\n\n07/25/07 Was back here to celebrate Bucky K's Birthday. Staff was awesome as usual.", "author": "Kenneth J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-13", "description": "So, to tell the truth, this bar isn't the sort of bar i would normally go to. I was told to meet some girlfriends there before heading over to waziema on a weekday night for happy hour. i knew nothing about it. at first i thought it was going to be an absolute nightmare. what is a non-beer drinker supposed to order at a bar that really only serves beer?? it wasn't until my friend introduced me to a champagne/Guinness specialty drink. and it was...delicious!!!! it was the most amazing combo i have ever experienced. i also had a sip of a friend's drink...another combo--delicious as well. \nI now love this bar.", "author": "Joanna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-10", "description": "I LOVE LYCHEE MERMAIDS!!!!!\n\nI love 821. the bartenders are super friendly and it's only 1 block from my house, so i can happily stumble home!", "author": "butters m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-13", "description": "I met a few people at this place in order to relax after work, and enjoy the inebriated happy hour goodness with good company.\n\nGood Points about this place: \n1) Happy Hour Deal (5pm to 7pm):\n     - Mojitos are $3\n     - IPA (22 oz) drinks are $3\n     - Champagne Cocktails are $3\n     - Bonus: they have Sake\n2) Good music\n3) Very clean\n4) Nice atmosphere\n\nBad Points:\n1) Parking sucks\n2) Bartenders don't pay attention if you have the need for a refill\n3) This place does not have food or hard liquor\n\nRegardless of the above bad points, we had a good time. The IPA is the strongest I've had (ever), and the champagne cocktails are interesting.", "author": "Darrel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-29", "description": "One drink two words.\n\nLychee Mermaid.\n\nSold and I'll take another for the road.", "author": "Nancy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-03", "description": "3 words: Chimay on tap. Yeah it's not a bar bar; it's not a hotel bar; it's not a pick-up bar; not a \"every kind of beer imaginable\" bar; not a faux punker (funker) bar; not an Oxygen bar; not a lounge bar; not the American Bar Association. It's a little, dank, neighborhood bar that's forced to close at 11pm. Good place to meet a friend. They can't screw up the address..that's for sure. Be warned, you might need to bring your xray vision or a flashlight, I couldn't see squat in this bat cave.\r\n\r\n3 duckets for being a neighborhood bar, 1 ducket for \"Mr. Manchester\" who tends to the clientele with chipper spirits and salutations.  \"Cheers Mate!\"", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "I used to live in this neighborhood and never made it in here.Fast forward a few years later a friend and I hit it up after our dinner at NOPA. \n\nFunny story if you refer to my Hobsons CHoice review,I mention a hot bartender I hope doesn't die when I blow up Hobsons Choice .WELL luckily he won't because now he works at Bar 821! Hi Hot Bartender(joey?).\n\nEnough internet flirting.This place is cool.Its dark and candlelit and nice to sit and talk at. I'd give it five stars if it wasn't just wine and beer and sake because none of those things are really my main jam.BOO", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-11", "description": "A friendly bar with some nice champagne cocktails. They don't appear to have a full liquor license, so the hardest thing they have is shoju, but they make good use of it.\n\nThey are owned by the same group that owns Tsunami and Nihon Whiskey Lounge, but they have really weird hours. When I was there the hey closed at 11. Maybe it is to push you to Tsunami around the corner. :)", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "After looking for a happy hour bar around work and seeing rave reviews for Bar 821, I had it on my radar for sometime. \n\nI made plans to meet up with a mate to see a show at the Independent at 9pm. I had separate dinner plans so I arrived at 9:10 a little tipsy after copious amounts of sake at Warakabune only to find out my lazy ass mate is still at home waiting on his harem of mingers to gather and feed him grapes. \n\nSo I wait. and wait..... 45 mins go by and the novelty of the $5 Polaroid dude wears off and no other eccentrics are around to keep me occupied. So I decide on a course of action: drinks.\n\nSo the choices at hand were Madrone, Fly bar, coffeeshop, or Bar821.\nAnd i chose wisely. The little dark chic wine bar with only a fledgling little skimp of a sign to signify its existence was A find. \n\nThe staff there were the friendliest in the city. None of that grunting that bar staff all round the city seem to communicate with but sincere, friendly service. \nGoing to a bar alone can be intimidating however, Bar 821 was very accommodating and made the experience very amicable.\n\nI sipped my cab and left  to meet up with my friend. Upon leaving the bar I realized that I wasn't pissed at my friend for being an hour late but i was glad that a bar could still be cool and sexy and not fore sake the very virtue that keeps people coming back, a space to socialize without judgment.\n\nKudos to you, Bar 821 for keeping it real and....for having a tattoo parlor right  next door. hm\n\nI'll leave you with Blink 182, Bar 821.\n\nAll the, small things \nTrue care, truth brings \nI'll take, one lift \nYour ride, best trip\n\nCheers", "author": "Tak H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-01", "description": "Super dark & romantic. Specialized glassware & the appropriate beers. Champagne cocktails! It's like a secret spot for smooching a sweety! (I can't stop alliterating today). \nI like drinking", "author": "B.dot P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-24", "description": "Yeah yeah, I know. Not exactly a *hidden* gem.\n\nWhat can I say? Good drinks (but no liquor), cheap happy hour, nice vibe, and in my 'hood.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-03", "description": "Bar 821 is a small neighborhood bar that is good for small groups of maybe 4 to 6 people max. I don't believe that they have a full liquor license, so if you're coming here, you'll either be drinking wine, beer, sake, or soju.\n\nSome of the mixed sake/soju drinks are actually quite good.\n\nI wouldn't go out of my way to come back....but I would if I was in the neighborhood and probably only during happy hour. Happy hour is from 5 to 7 pm....all cocktails and all beers are $3.", "author": "Lester W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "I recently read a great article about happy hour pub crawling through Divisadero, so on a recent trip through the city, a friend and I decided to hit a few and 821 was one of them.\n\nBar 821 is a small, dark, but chill bar. GREAT happy hour beers on tap and friendly staff. Did I mention they have Chimay on tap!?! That's good enough for 3 stars right there! They also have Sangria and Sake, but that seems to be par for the course in NOPA these days.\n\nThere was a very interesting mix of hipster regulars, 40 somethings, and a few \"just got off work and need a drink\" 30 somethings. Music wasn't too loud and they were running old Popeye episodes on the tele.\n\nOverall a good experience and would definitely hit it up for happy hour again. Depending on your scene, I imagine it gets pretty crowded as the night progresses. We were in around 6:00pm and it wasn't very crowded at all.", "author": "Darren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-01", "description": "This place is really small, but nice. I think it's a great place to start off a night. Plus it's near my 'hood, so bonus points for that.\r\n\r\nDrinks are really cheap.  Staff was great.\r\n\r\nI would easily recommend this place to friends.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "I never even knew this place existed.  I think I have walked by 100 times and never seen it, but I am glad my roommate decided to bring it up late Sunday evening.\n\nSo the drink I got came from Sarah S' suggestion, although it did make the bartender whiny because apparently it is hard to make (which is why you won't see it on the menu).  The drink was Guinness+Champagne.  Sounds dreadful on paper, but it was delicious.  In fact, I think it is my new favorite drink... Sorry Bar-man...\n\nThere were only 2 negatives.  The fact that the bartender told me he hated me when I asked him to make the Guinness+Champagne, and the fact that last call was at 10:30.\n\nI really think this place would boom if they doubled the prices, dropped it straight in the heart of the Marina, played old kung fu movies on a projector at the back of the lounge, and played woxy.com radio.  But I am happy to have them in my neck of the woods instead.", "author": "Adam O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-14", "description": "This is a very cute and cozy bar. I could see myself as a regular patron. Well, what bar that I can't see myself as a regular patron anyway? The only disappointment I have, this bar reminds me of my friend's 60 year old grandpa that needs to get tucked in bed by 11pm. Such a clit tease. I meant, the bar. \n\nAnyway, I came so close to last call, I only ended up getting a beer. Next time, I will arrange my time better and be one of those early birds. I would totally look like an alcoholic. Wait, oh nevermind.", "author": "Perry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-18", "description": "I love this place!  I've only come in here on weekdays, but I've always been able to get a comfy spot in the window seats.  The happy hour is awesome and I love their champagne drinks!  The sangria pitcher is larger than it seems & oh-so-delicious.  \nI also have to give a big gold star for the Monday night bartender since he has a huge smile, plays what is clearly his favorite music, and is just a great guy to be around.", "author": "Karyn J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-27", "description": "Everyone's now discovered Bar 821, a small bar/lounge that the locals love even though (or is it because?) (1) they don't serve hard alcohol - their cocktails are made with either champagne or soju, (2) they close early - 10:00 p.m. or 11:00 p.m., (3) it's perfect for starting a night out.\n\nOthers have remarked that their wine pricing encourages you to buy a bottle instead of a couple of glasses, and that fits in with their strengths - Bar 821 is a place where you split a bottle of wine (or two) with friends. It's almost half bar, half living room.", "author": "Timothy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-05", "description": "Nice place to hang out with a friend or a small group.  They don't serve hard alcohol, but the sake and soju drinks are tasty.  Personally, my preferences lean toward the beer on tap. People watching is pretty great here.  The crowd in general is young and good looking.    \n\nThis place has one of my favorite bar bathrooms of all time.  Roomy, clean, has good posters on the walls.  \n\nThe only drawback here is that the place closes early.  Maybe 11:30.", "author": "Nelson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-03", "description": "Such a Fan!\n\nI chose Bar 821 for my Birthday Party this year. I contacted the staff ahead of time to reserve tables and they were so nice. We arrived early and didn't even need to have the tables reserved because the bar was fairly empty. \n\nThe bartender (I am sad to admit I forget his name) was incredible. He mixed some amazing champagne cocktails... YES.. this was my favorite part. The Champagne cocktails.. and wonderful bottles of wine.. all moderately priced.\n\nThe seating is great, I had about 20 friends and we dominated the place, it was so much fun. Everyone else there seemed to enjoy our energy and we felt welcome. I am so incredibly happy I chose Bar 821 for my birthday location, it was a great celebration!\n\nIt is a wonderful location, great neighborhood bar, I hope all the wonderful reviews do not cause it to lose its luster! SHINE ON", "author": "Hailey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-19", "description": "Happy hour is from 5 - 7pm. $3 Hoegaarden, Lefe, Guiness, Stellas. Anyone who's anybody wears FTC or Huf gear here. If Parkey Posey were alive, this is where she would be reading a magazine while waiting for her Little Star Pizza to get delivered. Sometimes they have \"The Wiz\" playing on the widescreen perfectly positioned to pay the bills of your chiropractor for the next five years. \n\nIt's quaint. It's quiet. It's intimate. If you plan on goosing, take her here. You won't even need any rohypnol. Use some nice coversation and LISTEN. Don't just talk the whole time. LISTEN. \n\nIt's small and the seating is very low, so don't plan on bringing Chewbacca.", "author": "San F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-23", "description": "How is it I had not seen this spot before?  Strictly a beer and wine liquor license, they have some fun Champagne Cocktails and Sake cocktails which are fun and good, but won't always be a good substitute for a good old martini.  A decent selection of wines and beer. Cute spot; small, modern, cozy. \n\nService was not great. Friendly, but gave us used napkins, so that was not a great start.  (Don't get me wrong - I am all for sustainability and recycling, but if re-using other peoples napkins is the next step, I will happily follow the BYON (bring your own napkin) standard... just let folks know this is the way it's done...\n\nI will be back - with my own napkin. We missed the happy hour specials, but they seem to be something not to miss.", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-22", "description": "A couple shelves on a wall  ain't a bar, folks.  A bar needs an  edifice of some sorts, especially one that touts itself as a neighborhood bar. No, this place speaks of knowing it will be trendy for it's fifteen minutes and why put money buiding out the place when it's going to be gone in thirty.\r\nIt's a square room that serves alcohol.\r\nLow ceilings of metal, concrete floors and speakers that sound like they came out of a 65 Chevy create a Faux Energy,  a loudness that makes it impossible to conversate without screaming.  It's designed like this, to create a sound hysteria, because that's all this place has.  Noise.\r\nLike my father would say \"So, what's the attraction here?\"\r\n\"Dad, I can't see one.  Let's go somewhere else.\"", "author": "paul k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-29", "description": "I walked in with my GF (she lives around the corner) and they wouldn't serve us... It was confusing since they seemed to be in the business of selling drinks and ambiance, yet had none.\nI'm gonna try some other day when they're not busy ignoring customers.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-04", "description": "I've been here a number of times during their amazing happy hour (5:30-7 every day!) where I can have myself a 20 oz. Big Daddy IPA for $3.  The bar is relatively calm and relaxing during happy hour and the bartender is nice.  I go to 821 for the atmosphere but would avoid going here during its night hours when drinks are expensive and inside is crowded.\n\nWhat else can I sat? It's an Intimate, cozy little bar in location you can't beat.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-12", "description": "I've been thinking about how many stars to give this place since last night after my latest visit to Bar 821.  Finally I settled on 3 stars, but I have fluxuated between wanting to give them 2, all the way up to 4 stars.  \n\nFor some reason, this is a place I end up going on Sundays.  The bartender who works Sundays is great.  very nice and friendly.  \n\nThe bar is right across from Little Star Pizza on Divis, and it's not uncommon for patrons to order from little star and bring it over to eat, since Bar 821 doesn't serve food.  \n\nI like the decor and it's not crowded. You can actually have a drink and a conversation.  \n\nI have a couple disappointments with this place:  1) they don't serve hard liquor, and 2) both times I've ordered wine here the wine tasted awful.  I recovered from this nicely with a replacement, though.", "author": "Angie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-25", "description": "This is one of the coziest bars that I've ever been to. It's small, but the ambiance is warm, inviting and really mellow. The bartenders are very friendly, lovely people. Usually very dark in here so I wouldn't suggest coming here to read or do work. \n\nThe crowd here is mixed, but usually you'll see kind of an arty crowd. Sometimes hipsters, mainly skateboarding graffiti artists.  A lot of couples come here too. They have a super sweet happy hour deal until 7 which is $3.00 champagne cocktails and beer. I personally love the sparkling ginger. The sad thing is, I order it so much that I don't even need to tell the bartender anymore. He basically just starts pouring it when I sit down. I hate that I'm so predictable.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-24", "description": "Bar 821 is the decent spot to have cocktails in a low key, chill atmosphere with a friendly staff.  The place has a small bar, with a few tables an chairs and a bigger couch in the back.  Bar 821 does not have a full bar; they serve beer, wine, and creative champagne and sake drinks.  Although they have specialty drinks, I prefer the tall PBR cans.", "author": "Sandy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-02", "description": "Being stuck between two neighborhoods can sometimes be confusing and difficult.\n\nBut now I can either roll four blocks down the hill to be hipster-slumming at Place Pigalle or crawl four blocks up the hill to be hipster-hobnobbing at Bar 821. \n\nAnd in both cases I won't have to worry about making too much of a fool of myself, cause neither serve liquor.\n\nLife is good.", "author": "Tatjana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-05", "description": "You could think of reasons not to like Bar 821: It's small and dark, there's no hard alcohol, and the beers on tap (Hoegaarden, Leffe, etc.) are kind of pricey and there are no budget drinks available. They close early, and there are no pool tables or porn video games.\n\nThink of the intent though; it's not a get smashed and jump on the couches place. It's a meet your neighbors for a drink place, and a get to know each other on a first date place and a relax after work place. You don't drive nails with screwdrivers. \n\nIf you're here for the right reasons you'll appreciate the slick dark decor and the friendly bartenders and the clean restrooms and the TV that's always playing stuff like Dune or Clash of the Titans, You'll sit with your friends or the girl or the guy that you finally asked out and relax the way you're supposed to.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-14", "description": "$3 for happy hour cocktails is pretty awesome. Unfortunately, they don't have hard booze but then again, it's probably better for my own safety...\n\nI really liked the champagne cocktail with ginger - it wasn't very sweet but had a tiny spicy bite at the end. \n\nThe bartender was super friendly - I was a big fan. \n\nGood spot to meet some friends for a not-too-loud chat and some cocktails.", "author": "Alli J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-26", "description": "Sunday night.  Bottle of Pinot Noir.  Thumper of \"Bambi\" fame on plasma.  Closing down at 11pm in order to get me home for a decent night's sleep before the work week begins (thank you).  Perfect way to end a weekend.\r\n\r\nJuly 10 Update:  I asked the bartender why they closed at 11pm, and they said that it was out of courtesy of their neighbors.  He also mentioned that it gives him the chance to get out to the bars and get laid.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-09", "description": "Did you know that if you put a raisin into a glass of champagne, it will continually float to the top then sink to the bottom?\n\nYou have my permission to impress your friends with that useless fact as you sip champagne at Bar 821. \n\nI went there for the first time last night, opting for the Silk In Pink (bubbly, cranberry juice and Triple Sec), but enviously eyed the Lychee Mermaid my friend had ordered (the bartender plops a nice lil lychee fruit into your glass! ...from a can. but thoughtful all the same)\n\nThese champagne drinks are only 3 bucks if you hit this spot at Happy Hour!", "author": "Jen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-31", "description": "Awesome local neighborhood type bar, hot bartendress.  Cash only though, so leave the credit card at home...make sure you tip well!", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-03", "description": "I met a very cute and cool girl here the other night named Carrie/Keri/Cary.  \n\nIn the meantime, I'll have another frosty Stella served in the appropriate glassware.", "author": "J P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-24", "description": "I DESPERATELY want to give you 5 stars, but the acoustics SUCK.  One would think after 3+ years and presumably scores of complaints, something simple (fabric on the ceiling, sound absorbing panels) could be done to address the noise.\nAside from that, the decor rocks, the bartenders are all quite cool [except that Joey described me as a 40-something chick to a mutual friend when I was still only 39 :( ] and the Mojitos are my FAVORITE!!\nI'll keep going even though I'm obviously one of their *older* customers.\n;)", "author": "D C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-25", "description": "821 is a chill spot in a chill neighborhood.  Definitely a locals spot, but don't let that scare you away, the locals are all welcoming and friendly.  I can pop in after work when flying solo and wind up chatting with someone.\n\nGreat happy hour deals (I don't think people really get that the $3 beer is 22oz, so it's like 2 $1.50 beers in one glass!)  Or Chimay, Stella, Guinness... or soju coctails.  Which are very well made (ginger and lychee just to mention some of the flavors... I mean, when't the last time you had a whole lychee fruit as a garnish?)\n\nDimly lit, and there is usually an obscure film playing with no sound so thet the bartender's iPod can add a soundtrack to your evening.  I've discovered both new music and new movies from hanging out there.\n\nIf you NEED hard booze, you won't find it here, but if soju, wine, bubbles or beer will suffice, and you'd like to meet your neighbors here in the Western Addition... pop on by.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-15", "description": "I loved the 5-7 happy hour at this self-purported \"locals\" place -- though it is a far cry from Cheers. Great vibe, awesome fermented liquor martinis. Good music, diverse clientele, all at $3 a drink. Get sloppy drunk at 6 pm here!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "Cool happy hour spot out on Divisadero that most people probably don't know about. I love the dark, candle lit ambiance and small setting. Very friendly bartender who takes care of guests like the neighborhood bartender. Happy hour specials are well-priced with a great selection of beer. Solid place to start the night.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "It's around the corner from home, it has good mellow early evening drinking atmosphere, it has a great happy hour, always interesting flicks on the big screen, Joey will play \"Goodbye Horses\" by Q Lazarus at any time and its a really friendly neighborhoody vibe. \n\nIf you get hungry, order Little Star to go and bring over to eat.\n\nOr if you get drunk enough, get a tattoo next door.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-06", "description": "I love this little NoPa gem...\n\nBar 821 is a cozy and friendly bar in the North of the Panhandle neighborhood. While I can't get my Vodka & Tonic here, they do have a nice selection of beer, wine, champagne cocktails (very yummy) and sake drinks.\n\nThis is a great neighborhood bar where you can come in, be greeted by super friendly bartenders (Juan and Oba rock) and nice folk from the neighborhood.", "author": "Al B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-31", "description": "Posting rules on your window is just begging for people like me to break them, so I'm sharing the secret that's already well-known -- 821. Seriously, when I saw that on the window as I walked in, I was like, \"And, you just earned yourself a Yelp review.\"\r\n\r\n821 has a really good selection of beer and wine, but no hard alcy. I was there on a Wednesday night and it was pretty crowded and loud... but a good scene overall. My one annoyance with this place is that it's cash-only. If I can't open a tab, I'm over it.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-19", "description": "This place would be a five star establishment if it weren't for their intolerable sound system.  What happened to the bass, or even mid range for that matter? All I hear is screeching highs being blasted through this Play-Skool My-First-Radio.\n\nI've been here twice, the bartender is always cool and the wine delicious.  The seating is modern and comfortable. Please invest in some new speakers!", "author": "Peter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-01", "description": "I don't belong here. I don't fit in. I used to fit in here, but I don't anymore. When I come to Bar 821, I always bring my friend who lives in NOPA so that I can fit in. Yes, I'm surprised they still allow me in.\n\nYou see, I used to live in this neighborhood, but I've since moved southward. So, according to Bar 821's rules, I don't really belong here. Well, I do, it's just that I have to acquiesce if someone from the 'hood wants to come in and have a seat and my Potrero ass is stealing prime seating space. Or so the rules stated on the wall say.\n\nBut I feel so at home here! I love the lighting, the seating, the drinks, the service! Please let me keep coming back.\n\nJoe's so nice and honest about the fact that some of the more expensive wines aren't exactly better than the cheapos. And his Manc accent is like smooth butter to my ears.\n\nI consider myself an honorary Divisaderian just so I can keep coming back to this lovely little bar.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-21", "description": "I  came here with a couple friends on a rainy Saturday night. It was far from crowded. Just a few people at the bar and the couches were completely empty. We ordered a pitcher of sangria and took a seat on the couches. It seemed like a typical evening until a middle aged Asian man sitting at the bar fell of his bar stool. He then stood up, attempted to sit on the chair again, and fell again, this time slamming his face into the bar. When he stood up his face was covered in blood. Shortly after the paramedics arrived. They attended to the man. In the mean time he tried to drink a candle. Finally the took him away on a stretcher in an ambulance. After that the place cleared out. We finished the pitcher of sangria and were on our way. Interesting experience. Oh the sangria was tasty, but not very strong and there was no fruit floating around.", "author": "Polina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-09", "description": "This is very much a door on the side walk that you \"happen\" to find.  It's dark, warm, cozy and the bar is sake, wine, beer and other non-hard alchohol booze.\n\nA great bar to relax and unwind with a pint or a glass of wine.   It does close early sometimes so it's definitely a \"starter\" location.\n\nI used to come in here when I lived a few blocks away....\n\nI miss it....*tear*", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "when it comes to bars, i too tend to be overly critical. Maybe it's because i used to work in one.\n\nThis place felt right at home to me -- not too many posers or fakes. And just about the right amount of dirty boys in the joint (and me like dirty boys) to check it out once more.", "author": "Vanessa J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-01", "description": "I'm not much of a fan.  \n\nI like that they are very neighborly, that happy hour drinks are super cheap, and that they have a great selection of wine and beer.\n\nBut let's face it, the lack of hard liquor is a huge blow to any bar.  And frankly, I really wasn't feeling the decor, it felt pretty run down in there.  But the real deal breaker for me was the noise level - couldn't really have a conversation with my peoples, which is why I was there in the first place.  Parking also *sucks* in this part of town...", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-21", "description": "I used to (unfairly) refer to 821 as \"the curfew bar\" thanks to its 11pm closing time.  \n\nI walk by the place every day on my way home from work, and have, from time to time, stopped in.  It's got a nice selection of brews and a reasonable happy hour.  \n\nConsidering that my other local neighborhood bar is Fly, which attracts me like flies to vinegar, Bar 821 fills the bill when I want a beer in a setting more sociable than my couch.", "author": "Sterling M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-05", "description": "I don't really \"get\" this place.  Nice atmosphere, friendly bartenders, but what's up with shutting down at 11:30 on a Friday night?  And what's up with leaving the door propped open so it's freezing inside?  And what's up with all the hipsters who look like they just invaded from The Mission.  And why limited to beer, wine, and champagne?  I gotta crawl over people at Minibar for a J&C?  Yes, Bar 821 leaves me with some questions I may never discover the answer to - perhaps I'll check it out more than twice and discover the answers, all in good time.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-08", "description": "Update AGAIN! 1/28/08:  I have gone back to this bar a few times now and realized it is much more of a date one-on-one kind of place.  Their Happy Hour Rocks.  $3 for beer and specialty drinks is pretty great.  Nice atmosphere and a friendly bartender.  Earned yet another star!\n\nUPDATE 6/16/07:\nWent here for a drink while my date and I waited for a table at Tsunami...the champagne drinks are yummy and the bartender was super cool so they earned an extra star.\n\nPrevious Review/Experience:\nA group of friends and I headed over here after lots of beer and pizza at Little Star...we had never been over there so we thought we would check it out.  It was tiny, dark and moody...kinda made me giggle to see the sign that said \"We only serve nice people.\"  We got all kinds of looks from the people in the bar.  This was NOT a place to go BS with your drunk buddies.  We decided to leave to go to the Page..\n\nOne of my friends drunkenly (yes that is a word) said \"Let's get out of this fuckin' hipster bar\" and a guy smoking outside said, \"Fuck you!  Go to the mission!\"\n\nWe laughed the whole way to The Page.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "Bar 821 is a great little neighborhood place--I haven't been in awhile b/c my friend who lived in NOPA moved and so now this cool area is no longer my second 'hood.  But when I was hanging out there all the time 821 was a great place to go for a casual drink, either after or before dinner.  Everyone is very friendly and the atmosphere is stylish yet relaxed and unpretentious.\n\nYes, they close at 11, but somehow that makes the place seem even cooler...", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-10", "description": "you treated me okay. I will admit, it wasn't so much fun being sneered at by the bartender who under his breathe said 'f***** hipsters' when we approached the bar.\n\nmaybe he was a Republican? maybe he didn't like minorities? I dunno. but its a cheap drink and a cheap thrill at this place but next time but they don't have hard liquer which is a bit of a bummer. so it wasn't quite easy for my date to get me drunk and I know she wanted to take advantage of me but you cut her off from letting her buy me another drink. shame on you. I missed out on sex.", "author": "Derek Alistair J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-27", "description": "We used to call this the \"secret bar\" b/c we could never figure out what the name.\nGreat wine list. Dark, small. Alll the things that I like. Yet... there is something that gets me. I think it is the clientel.\nSometimes, I go in - people are cool, calm, having little conversation. Good Vibe.\nBut then I go in-it's like hipster invasion. And I'm going, \" aww crap.. all these people are going to talk really loudly about obscure bands, and cultural shite I have no need to overhear- but it makes them feel smart  and cultured.\nI feel edgy around this vibe- like high school lunch room all over.\nOkay so maybe the bar has no problem . Maybe it's me...\nMaybe I am usuing Yelp as a way to deal with my psychological problems.\nThen again-- maybe the bar has a sometimes Douchey crowd.", "author": "shannon t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "Went to this bar for the first time with a friend for a birthday. She raved about the fact that it was a champagne cocktail place and I would love it. I have to agree with her. \n\nThe only reason I go there now is for the champagne cocktails, and that's it. I love the variety and the price. Their beer and wine selection is a bit lacking for me but again prices are reasonable. It doesn't stay open as late as other bars, so get there at a reasonable hour (It closes at 11). It is definitely more crowded on the weekends. \n\nOverall it is a chill place where you can hang out, have a drink, and hear the person talking across from you.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-13", "description": "Great neighborhood spot and yummy champagne cocktails. New favorite:  The Valentine:  champagne with a strawberry and a piece of dark chocolate.  Heaven.  \r\nDon't go with a big group -- best for 2-4 people.  You can order sushi from Tsunami and they'll bring it over which makes it great, but you might as well go early for a drink at 821 and then cruise over to Tsunami to eat.  Or reverse it, eat at Tsunami first and then finish the night at Bar 821.", "author": "Lija H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-02", "description": "After a previous failed attempt at getting a drink here (it was packed and there were about 6 of us), my boy and I went back last night.  Two champagne cocktails (me) and a Guinness (him) later, we were making out on their surprisingly comfortable bench seats.  \n\nEveryone else has already mentioned this, but the valentine and the lychee mermaid are fabulous.  We didn't drink any wine, but the wine list looked good with some very reasonably priced bottles.  I'll definitely be back.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-07", "description": "Bar 821 walks the delicate line between bar you could take a date to and bar you could send your snowboarding buddies to -- the former will like the candlelight and the old black and white movies on the flatscreen TV, the latter will like the Avalanches on the ipod stereo, the 22 oz of Anchor Beer, and the lack of pretension despite its attractive decor. Or switch that around, depending on who you bed/board with.\n\nThe bartenders are friendly, funny, and ultimately solid; the beers are well-picked; the crowd is a nice mix of locals and folks going to shows at the Independent. If I could change just one thing it would be their doors-at-11 policy, but on nights when I'm not leaving a show down the street, I'm glad to be in the bar and not get the post-concert rush.", "author": "Trisha W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-03", "description": "I liked it better when it was a secret.  Every time I try to go now it's way too crowded.\n\nI gotta figure out how to get out of work earlier to take advantage of the happy hour Mojitos.  Last time I did this I ran into a friend from back home (WISCONSIN!) and got fairly soused without spending hardly any money.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "There's something a little off about a place that's showing sports on a giant plasma TV, all the while cranking Love & Rockets' back catalog, and that's what I love about it.\n\n\n Although the decor leans toward the glitzy, chic-Amsterdam-lounge concept, the prices and (lack of) attitude remind you that it's a good local, with plenty of regulars and a nice selection of affordable drinks.\n\n\n Sure, it's not incognito anymore, but I still tell my friends to meet me at the secret bar. It's still got the cachet. Longer hours would be great, but then it'd lose the charm of a lock-in, as my London friends would call it. They loved it too, by the way.", "author": "Omid T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-16", "description": "First off, the place was awesome and there was really only one reason why I gave them 4 stars. The only reason being that they do not accept credit/debit cards. While I don't mind having cash to pay for drinks, I do mind having to pay after each individual drink. I wasn't able to open up a tab ,which would make things a whole lot easier (especially if you're with a group of friends). \n\nThat was my only complaint. The atmosphere was perfect, not too dark and not too bright. Music complimented the place and was not overwhelming. The drink selection was on point and Happy Hour prices are hard to beat. Great place to get away from the large crowds in downtown and easy to get to.", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "Op! My review of this place disappeared, I know I was one of the firsts because I lived across the street when 821 debuted. Nice little neighborhood bar that just happens to be adjoined to Tsunami and the kind folks that run that joint.\nThe bartenders have always been fun, easy on the eyes and generous, which is all I can ask for when I'm hanging out being a wino. I'm not much of a fru fru cocktail drinker unless it's something with a real kick, so I've only tried the soju stuff a few times. It's ok though, you can hold onto your tough guy demeanor and kick it with a brew just as easily as you can lounge around with a 'pinky out' cocktail. Go ahead, give it a go!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-18", "description": "A group of us checked this out for a pre-dinner cocktail on a Wed. night and it was crowded by 7pm. There are a lot of long tables so smaller parties will have to cozy up with their neighbors. \n\nThe $3 happy hour cannot be beat as concerns bubbly drinks and beer, but prices are quite reasonably anyway.\n\nLychee and Ginger Champagne drinks we're delish.\n\nFor cocktail drinkers, beware Soju only. \n\nNone of us tried the wine..but there looked to be a decent selection.\n\nLow-key atmosphere, great for meeting friends for drinks when you actually want to talk to them instead of posing and people watching.", "author": "Nikke G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "Small, hip, cozy, intimate.\n\nSuper-nice bartender with a subtle Manchester accent. \n\nGreat place for small groups. Can see how it might get WAY crowded at happy hour. Rough 'hood with NO parking, but if you can hoof it over here, it's worth the effort.", "author": "SfMom O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-20", "description": "Cute little place, excellent champagne cocktail list, awesome bartender.", "author": "Dee I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-14", "description": "It's interesting what happens when a place doesn't have a hard alcohol license -- it makes them get creative with soju and sake and come up with things like soju mojitos and a drink I didn't get the name for, which was a shot of soju dropped into a half-pint of champagne.   The staff in general seem like they enjoy what they're doing, which always makes it a better experience overall.\n\nI didn't venture into any of the funky soju cocktails, sake, or the wine list.  My attention was caught by the belgian white ales -- Leffe, Hoegaarden, and Chimay White.  The selection of beer isn't very wide beyond those Stella, and Big Daddy IPA, but there are plenty of other drink choices.\n\nThe space is kinda small for the Friday night crowd, so don't roll in with a big group and expect to sit down anytime soon, but the population is friendly.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-29", "description": "Love it! If I had the resources to open and operate my own neighborhood bar here in SF, this is the place that I'd want! The space is not too small and not too  big; quoting Goldie Locks \"it's just right\" \nCreative cocktail menu, wine & beer...", "author": "Mariel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-13", "description": "One star for the cool bar.\n\nOne star for the cool table set up and general ambiance.\n\nOne star for the decent music.\n\nOne star for the various fancy champagne concoctions.\n\nMinus on star for the serious lack of vodka.  Or any other REAL alcohol.  There's only so much champage a girl can drink and beer is absolutely out of the question.", "author": "LeSLiE W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-20", "description": "Interesting little place.  I was meeting my date there and I arrived promptly at 6p, but no one else was there.  Including myself, my date, and the bartender, there were 5 people there at 6p.  Shortly thereafter, the rest of the crowd entered.  Then the lights went down to create a \"mood\".  I wasn't too fond of that (I guess I like to see the person sitting across from me.)  The wine selection is a touch sparse, but their beers are good.  They have a pretty lengthy soju cocktail menu, but I don't drink those.  I have a thing against mixing soju with anything.  Just drink it straight up.  Sadly, none of their wines are discounted for happy hour.  \n\nAnyhoo, the best date in a very long time began here and continued on to Nopa down the street.", "author": "Alison N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "This is our go-to neighborhood bar. Happy hour is where it's at, massive pints of Anchor Steam for $3...can't go wrong with that. They have some interesting champagne cocktails too.\n\nSexy atmosphere, attractive patrons, a sprinkling of hipsters, and good times all around.", "author": "Kara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-10", "description": "This bar is owned by the same peeps who run Nihon Whiskey Lounge, so I had to try it. They don't serve hard liquor, but have a fun little happy hour for beer/wine and some yummy sake and champagne cocktails. They aren't quite as complex as those of Cantina (near union square), but they're good. Nearby, you'll find minibar (looks cute - want to try it) and Little Star (gotta love it). Not too shabby!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "I'm glad I live about six blocks away from this place because its slowly becoming my neighborhood watering hole. I really like the smallness of this place combined with the fact that the drinks are really reasonably priced. The bubbly cocktails are excellent (I really like the one with chocolate and a strawberry) and the beers run on the large size ($4 will get you a 22oz Anchor). The lighting and the space is really cool, its easy to forget that other people are here and focus on your conversation with the people around you; its that kind of place. Its true they close early but look on the bright side, it might help you drink less! Great little neighborhood place.\n\nOn another note, regarding the whole exclusivity of this place I think its something you just kind of have to laugh off at this point since they are so popular. For this reason, however, my friends and I all refer to this place as \"the fight club bar.\" First rule of 821, you do not talk about 821.\n\nMinus one star because last call is at 11.30 since they close at 12.", "author": "Nicholas B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-20", "description": "I don't come to this bar very often, but feel like it would be a great place for a first date.  They don't serve liquor, so you don't have to worry about your date polishing of a bottle of Jameson's and throwing up on your new shirt...  The lighting is dim, the chairs are comfy, and setting feels pretty intimate.  \n\nDecent selection of wine, beer, and champagne cocktails.  \n\nBecause it closes at 11, you can invite said date over to your place for \"one last cocktail\" and it still be early enough for her not to say \"well, it's already kinda late....\"", "author": "matt c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "Great little neighborhood spot with a unique feel.\n  - Quiet enough to talk without being a crypt.\n  - Hip enough to be fun without being self absorbed.\n  - But for the liquor...", "author": "Stefan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-05", "description": "This place had no sign when I moved to the neighborhood seven years ago.  A secret little hole in the wall pub that closed up, neighborhood peeps only, at 11pm.  I liked that, kind of makes you feel cool and special.  \n\nIt does get really loud in there when it fills up, and there's a big ass TV right behind the bar, glaring you in the face, but the bartenders have always been personable, and know how to pour a Guinness.\n\nWhy the hell am I reviewing this place?  It's supposed to discreet.", "author": "Lee P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-05", "description": "For someone like me who finds joy in comparing beer fluid ounces per dollar spent, this is a great find with a good atmosphere.\n\nThey have a 5-7pm happy hour every day with a selection of 20 oz. beers (not like the average bar which gives you a \"pint\" of 12 oz.) and mixed soju drinks for only $3! And the selection ranges beyond normal imports and domestics. The atmosphere was lounge-y and a great place to go on Sunday because it was not crowded, but still vibrant. Overall, had a fun and relaxing experience. \n\nNext time: will try a weeknight happy hour and the luxury mojito.", "author": "Jacob and Brianne H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-15", "description": "This bar makes me sad. It had such a wonderful past life that it's hard to see it neglected the way it has been. I am not saying it needs to be revamped with \"reclaimed\" wood or whatever current design cue is in, but it needs owners that actually give a shit. It could be such a cozy, warm, neighborhood bar if the right people were involved. Oh, wait once upon a time it was ;) The only thing standing in it's way (much like Wazima) is the owners. Sell the place and move on to another Whiskey/cigar bar, fellas! There are those of us who still love this place.", "author": "Honest T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-16", "description": "Great happy hour spot. Relaxed ambiance, easy access to good restaurants. Seems to be a hang-out for neighborhood locals.", "author": "Shweta V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "whats up with those fucking chairs yo? if you lean the wrong way a bit too much, they will tilt over. i wasnt even drunk and i almost fell over. jesus osha fuck me dangerous. \n\n\n\nok, i was kinda buzzed.\n\n\n\n\n\nok, fine i had no shirt on, was butt drunk and i fell out the fucking chair. \n\nso fucking sue me. \n\n\ncool, cheap happy hour joint. good drinks. cant complain. \n\nexcept those fucking chairs!!!", "author": "Euge L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "What a cool little neighborhood bar.  They have $3 Hoegaarden beer till 7pm.", "author": "HY L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-26", "description": "The drinkers of Divisadero and Lower Haight need to get together and protest or something. I mean, this city has protests about everything every other week. We don't like cars so we fuck up the last Friday of the month for every single person who works downtown and just wants to go home and clean up and go out with their friends by not allowing them to get home, even when they are taking public transportation. We don't like plastic bags so we have now outlawed those. We don't like the war and at least once a week we make that known with some protest. That is cool, I am all for getting out on a Friday at 10pm, carrying my 40 in a brown paper bag (as it should be) and lets face it, a war would really put a damper on my Friday plans. So, if we can take the time to speak up about these things why cant we let the people of these neighborhoods know that we want a few more bars that serve hard alcohol!! I mean, I am unsure that serving beer and wine is going to save us from anyone who wants to be drunk and unruly. Newsflash, they can still get drunk and unruly on beer, I swear, and if the liquor store on the corner carries Jack you are not keeping it from them prohibition style or anything. You can serve alcohol in a lower proof form in a bar, out of anything you want, to people on bikes who hate war, but if they drink and want to get drunk they will!!! Can we please have some bars that afford us the luxury of doing this on our own terms!!??\n\nBar 821, its not your fault. You work with that permit well. You have a good selection of wines by the glass and bottle, and tasty beers and sparkly and soju all at very fair prices for a wine bar. You do your best to provide a nice selection of alcohol \"lite\" in a dark, loungy, inviting way, but damnit, sometimes I just want a sapphire and tonic. However, when I do have a hankering for some wine while in your neck of the woods you are my first choice.\n\nAnyone up for a protest, or at least a glass of wine?", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-26", "description": "Yummy cocktails, Yummy bartender and regulars, and Yummy Yelpers??? Get out the crayons and color me Tickled Pink!  Those soju bombs were out of this world and somehow matt r and I didn't find ourselves roaming the streets of SF at 5 a.m. after this soju experience!  Nice job, Bar 821!\n Call me Bubbles, I LOVE sparkling wine! The champagne cocktails at Bar 821 can't be beat and they're cheap cheap cheap too! The Ginger Sparkler is now my very favorite champagne cocktail ever. With so much AWESOME going on within these walls, you can bet I'll be showing my face around these here parts a hell of a lot more often now. JAMES (Thanks, G!)  the bartender is adorable and super friendly and like I said, there are some pretty hot hotty regulars, too. \n Little Star is right across the street and I hear they'll let you bring in food from outside so you can get your drink AND your eat on. The inside is cute and neighborhood-bar-ish. Nice bathroom with cool mirrors. If you live in the neighborhood, I highly recommend!", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-07", "description": "i had a gathering here for my birthday and had an amazing time.  the bartender, juan manuel, was really nice and attentive and i ended up having a party of about 15 people, give or take, at the bar throughout the night.  it's not a really huge place either.  he was really great to accommodate us the way he did -- he brought us fresh wine glasses when new guests arrived and he was very cordial with everyone.  his service was excellent and he even gave us some free passes to a place up the street as we prepared to relocate (after most of the night, really... merely for change of scenery and so my boyfriend and i could save a little money - we bought quite a few bottles).  it was a great night overall, and this place made the perfect setting.", "author": "Beccie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-25", "description": "A cool little bar to be happy at between the hours of 5 and 7pm every day! $3 soju and sake mojitos, martini and champagne cocktails (the Lychee Mermaid is yummy!) and beers guarantee you will be happily buzzed before getting dinner at NOPA down the street.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-08", "description": "people, place and product.  fives all around my friend.\n\n821 has become one of my new fav happy hour spots courtesy of joey and james laid-back and entertaining tendering.  mostly a hoodie spot- thanks for the intel AKA G!  \n\nhunttterrrrexxxxx!  we thug hhwwatt!! \nhttp://static.px.yelp.com/photo/8hrcHKRSwcFHXZ_JF3lvKw/l\n\ni have enjoyed classics on their flatscreen like transformers and thrashin along with a good ole butt-whippin' of the warriors ;-)  little star is right across the street and its all good to bring em over...just be courteous and ask first.\n\n3bucks will get you whatevas from 5-7...and yes i am talking about more than drinks..quick and dirty- hey can't hate on being efficient.\ni usually rock a guinness or hoegarrden & on occasion that ginger soju/champagne...order a diamond and risk getting jumped.\n\nfor real street cred just keep slurpin up the ABC!", "author": "omar b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "Charged with not being very prolific lately - I admit my guilt.  Realizing that I have never reviewed Bar 821, even though I love it so?  Surely that deserves a 20 year sentence.  Or maybe just a 20 drink sentence.\nBar 821 started off as my go to spot to wait for my table at Tsunami to open up.  My first trip to both places was on a lovely date - he chose well, and while the dates fizzled shortly thereafter, my love affair with 821 was just beginning.  How can you not love that Tsunami will call you at Bar 821?  Or that you can ask the bartender to call Tsunami to see if your table is ready?  Either way, it works out great.  The champagne cocktails are yummy, the selection of beer is fab, the happy hour is wicked cool, it's small, I usually like the crowd, there are cute bear sized puppies roaming around, and the bartender has an English accent.  WHAT IS NOT TO LOVE?!  I just don't get a hankering for hard alcohol before I come here, and I'm beyond satisfied.  That 20 drink sentence is more a reward than anything else.  Minus a star for not being open at all hours and making me get off my comfy booth earlier than I'd like sometimes.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "LOVE the champagne drinks :) tasty and not too expensive. Great layout, decent location, and good crowd. Perfect for groups of people - especially for a night out w/ the girls :)", "author": "linda t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-16", "description": "Sorry for contributing to your unwanted exposure to the internet masses, Bar 821, but I just *had* to Yelp about this place.  Once in a great while, I happen upon a night spot or restaurant that just hits me exactly the right way and this place is it.  Its small, humble, unobtrusive, populated by locals and has a very warm and intimate feel to it.  The bartender is the owner, and his menu is filled with awesome and inexpensive saki and soju drinks (beer and wine license only).  The little decor touches are great, including the colored tile crossbeams on the ceiling.  I think this might be my new neighborhood bar....", "author": "Rick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-13", "description": "Making your way in the world today takes everything you've got.\nTaking a break from all your worries, sure would help a lot.\nWouldn't you like to get away?\nSometimes you want to go where everybody knows your name,\nAnd they're always glad you came. \nYou wanna be where you can see, our troubles are all the same.\nYou wanna be where everybody knows your name. \nYou wanna go where people know, people are all the same,\nYou wanna go where everybody knows your name.\n\nOK....so maybe not my name.  Met up with a fellow yelper and they might have well been singing this song.  He knew everyone!   I don't know if the personalities in this bar would have been able to rock it out like Sam and Woody, but this place for sure has character, personality, comfort and a cool quality where you hope they eventually do learn your name. Great happy hour prices, and it closes at 11 on weeknights.  That's a great way to prevent the 2am evening when you have to wake up for work the following day.  Last call...10:50, perfect.   I don't see this being a weekend destination for me, Ill probably hang onto it for beer filled afternoons.  I have lived up the street from this bar for 2 years now, and stepped foot into it for the first time yesterday! I couldn't believe it!  They welcomed me and my pooch and i can see this definitely becoming a regular thing.  Take dog for walk.  Stop in bar with dog.  Have a few beers.  Make rest of walk that much more entertaining.  Thanks for being there 821!  Sorry I haven't gotten to know ya sooner!", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-08", "description": "Great date place! Inexpensive and delicious champagne cocktails! (My favorite is the Lychee Mermaid; and if you want a manly champagne cocktail, there's always the one with Guinness in it.) Very sleek and cozy (although the flat screen TV is an odd touch). It can feel pretty couplely sometimes, and it's definitely not the place to go if you're looking to pick someone up. But that's part of the charm.", "author": "Leigh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-08", "description": "i'd give it 5 stars if i was ever able to snag a seat while there.\r\n\r\notherwise, the champagne cocktails are fab and the bartenders are always uber-pleasant.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-10", "description": "Something wonderful happened to me this weekend.\n\n...The bar was dimly lit, champagne drinks were very tasty and not cloyingly sweet, drunk dude with butt-crack peeking out was thankfully not hairy, the crowd was very friendly.  All in all, a very nice, laid-back atmosphere to catch up with friends and drink the workweek away.\nSitting at this intimately-lit bar, talking animatedly about my chaotic week of deciphering financial data at work, my girlfriends were intently listening when I suddenly started to cough.  Out of nowhere, a glass of water magically appears at my elbow.  But alas, it wasn't magic!  It was the bartender, thoughtfully placing the cough-saving glass of water by my side without me asking for it!  Without my girlfriends asking for it!  Without me gasping for air, sliding off the bar stool, hysterically pointing at my red face with the international sign of \"Help me, I'm choking\" kind.  \nHe gave me the glass of water simply because he cared.  What a concept!\nIn my years of happy hour'ing and my years of coughing, I have never once encountered a bartender who gives a glass of water out of the goodness of his heart.  In fact when I ask for a glass of water, I've encountered exasperated bartenders, rolling eyes bartenders, dude I'm busy bartenders, but never once a thoughtful water-giver.  \nThanks Joey.  You've given this lady renewed hope.  Thoughtfulness is still alive and kicking.", "author": "Janice N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "i went here one night and don't remember a thing.\n\nphotographs from the night reveal: one of my friends flashing lots of money. over and over. and over. and over. me posing with everyone, include people i am pretty sure don't even exist. lots of thumbs and blurs. mike unzipping his pants. five people fallen over on the sidewalk outside. me being one of them.\n\ngood lord.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-30", "description": "sorry to be a total B but this bar does not need to exist.  the bartender was EXTREMELY rude and standoffish....and he was wearing shorts.  bartenders, or servers of any kind, SHOULD NOT WEAR SHORTS.\n\noh yea - this monstrosity of a bar charges 10$ for SHOJU cocktails.  shoju.  yea.", "author": "Brooke M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-31", "description": "I like the concept of this neighborhood spot but it just doesn't get pulled off very well.  The beers they offer are good but typical of any semi-hip beer/wine bar these days.  While the seating area is nice it just feels like it is trying too hard.  Also, the place in small... feels like you are intruding even if there are just a few people hanging out there.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-26", "description": "This place is the epitomy of a local neighborhood-bar. The clientele are low-key, the location is superb, and best of all the selection of on-tap beers!! Hoegaarden and Stella, my two favorite beers. This is definitely a place where I can rely on to be as warm and comforting as a bar should be. Great place for a first date, or just to hang out with the guys/girls. Great selection of cocktails and happy hour is great. I definitely suggest 821 if you are in the neigborhood. They don't serve hard liquor, so if that is your thing, go somewhere else. But who needs to get drunk every time they visit a bar? Especially one right around the corner? Just go there after work, or whatever you do during the day, and unwind with that special one, or whomever. This place won't let you down.", "author": "Ruchita P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-19", "description": "I'm impressed by any place that manages to look like a club and act like a bar. Bar 821, is one of those rare spots in the city that doesn't treat their mixed drinks as means to make up their substantially expensive rent payment. Meaning, they make a mean drink for little, well not a lot. It has the SOMA atmosphere, without the crowd and attention to loud music. The place had a distinctive air of cool matched only by their mixologists. Keep an eye out for their specials, last time we went all champagne cocktails were only $6 for the whole night. You won't see veuve (this isn't SOMA), but do expect fresh squeezed juices splashed inside your bubbles.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "I've been called out on more than one occasion as to my gravitation towards good deals. This night was no exception. Upon entering the bar, i glanced at the taps and just ordered a Hoegarden. However, a few minutes later I took a look at the menu and noticed a few beers that were $1 cheaper and contained almost double the liquid. Thus, I ordered a 22 oz draft Anchor Steam and all was right in the world...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "I have been stopping by here for happy hour for awhile. Since I have so many friends in alamo square, this is generally where we meet. Soju cockails are delicious and they have Guiness. However, not excited about their wine list but hey I am just a wine snob.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-28", "description": "Tiny, very dark, limited drink menu, charming, intimate, friendly bartenders, 1st-23rd date location-able, cool crowd, cozy, lazy review writer", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-28", "description": "While sometimes it's too crowded in here to get a seat with friends, I do like the fact that it's just a simple local bar. I may miss my whiskey, but Joey knows what's up and always makes sure to take care of me. Yeah, it sucks that it closes at 11, but there's 3 other bars within walking distance that will be open for your drinking pleasure. Hit up 821 first for a bit of relaxin' and then go get your party on.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "The champagne cocktails alone could keep me locked in my seat for hours; there are several different options and all sound delicious. I tried at least four of them, and I'm still left with  some options to select from on next visit. Honestly,  the only drink I really remember was the lychee cocktail, which was great. \nThey have a nice selection of wine to choose from as well and on my first visit the bartender was helpful and friendly in helping my friends and I select a Cabernet. On my second visit, the one in which I tried the champagne cocktails, I wasn't crazy about the bartender. I'm going to cut him some slack though, since it was St. Patrick's Day and he was the only one behind the bar. \nOverall, I enjoy this bar, and it's a place I will go again. \nIt should be noted, that this bar doesn't serve hard liquor, but the  selection of soju cocktails, wine, and champagne is enough to keep me content.", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-03", "description": "freakin awesome!\n\nthe bartender, grateful that i stayed even though i had to use the ATM, gave me a free hot sake with ginger. delicious. i liked the ambiance, dark and romantic. the music was pleasant too: mellow but with lots of variety, not too noisy or intrusive. i am going to find excuses keep taking my friends to this place. also great happy hour: $3 drafts", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-06", "description": "821 is still a neighborhood bar.  The best thing that could have happened was the removal of the rules.  If you see them taking it to the face, with eye balls and teeth, you probably witnessed your first ABC!  They close at 11pm, most days, which doesn't seem to be a problem with folks from the neighborhood.  I can see it being a problem with people looking for a place to chill till 2am on a Saturday.  If you still want to hangout after 11pm, head over to the FLY Bar!  Just as great.  Yet louder.", "author": "Jamal G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "You know what, this is a great bar.  It's just a funky little place that pours some great beer and wine.  There is no booze.  Deal with it.  It closes early.  Deal with it.  It's a great place to just kick back with friends or get a pre-Little Star drink.  I wish I lived just a little closer.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-07-15", "description": "This bar bills itself as a \" neighborhood bar \" but when I cruise by on my way to the video store, I don't see anyone I recognize. According to their posted \"rules\" neighbors will be seated and served first - how do they know who's who? Do they have would-be patrons bring their utility bills with them? I think not. I say marketing, what do you say? Anyway, I think it is just another attempt to gentrify the panhandle. Kinda makes me sick to my stomach.", "author": "sockanooni s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-24", "description": "I would like this place if I didn't get a 15 minute lecture from the bartender on how it is rude to try and buy another happy hour drink before you completely finish the one you are drinking.  Especially since that's less time than it takes for him to actually make your drink.  Not because he's particularly slow at making drinks...more like he just wants you to know that he's got much better things to do while he's bartending.   Otherwise, the drinks are good and the atmosphere is pretty nice.", "author": "Jackie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "A great place for a quiet chat.  Closes early.  Really nice bartenders.  Good sangria if  you're into sangria (I usually don't order sangria at bars because it tends to be terrible-- old wine with some fruit thrown in to mask the vinegar taste, or even if it's made fresh, it's left exposed to air.)  This bar tends to be mostly locals since it's kind of hidden.", "author": "Neil G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-19", "description": "Love this place and their champagne cocktails.  Was even cooler when only the locals knew about it, but if you eat at Tsunami you know about Bar 821.  They have cool happy hour specials and an overall cool vibe but I wish they stayed open later.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-12", "description": "Secret bar...that's what I call it.  Hardly noticeable on divis.  This is truly a great neighborhood bar and my favorite neighborhood bar.  Beer, wine, sake and soju only, but a great selection.  Joey, the bartender is super nice and friendly.  Who needs hard liqueur when I can barely stumble home from too much Chimay...", "author": "Susan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-07", "description": "I love the bartenders.  The Mojitos knock me out every time. Its such a relief from the chaos of Fly Bar. Pretty relaxing and a great place to meet with some friends without having to shout.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-23", "description": "The bartender (Tonya, I think) was so sweet, it was as if I were an actual paying customer.  What makes this place great is that you would never know it's there until you have been there.  It's in a great location right at Fulton and Divis, and yet it sits behind a non-obtrusive door.  It's clean, low key and has a \"locals only\" feel.", "author": "regina k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-22", "description": "I was really really wanting (needing!) a whiskey. All they had was beer and sake. Normally I love beer, but I had way too much beer that week. The sangria just didn't do it for me. The jalapeno sake was very interesting, but when a girl needs a stiffy, a girl needs a stiffy. I was dissatisfied. But the place is cute as hell, the music was cool, and it was pretty much empty on a Tuesday night, so I'm keeping this place in pocket for a local joint to have a non-whiskey drink on a weeknight.", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-16", "description": "yea. im drunk. and its because of this place. but you know what? im not mad. this place is great. they got me real drunk for real cheap and its not even 9 yet. yea you should go here. and i dont know what else to say, but i'll write more when im sober. omg i walked so much. ok im drunk im going to sleep.\n\nok im editing. because i'm still drunk. and its not 9 and i'm not asleep. i walked into this place and thought pshhhhhh soju!? i'm korean biyatch. i can drink that shit. but i should have listened to the bartender. he was right. there is no such thing as JUST a mojito. omg i'm totally going to delete this in the morning. \n\n:: edit ::\n\nok so it's 3:37 am and i swear i'm sober now. reading what i wrote before makes me think i'm not that bad of a drunk, but then i realized why am i writing a review drunk before i pass out at 9pm? \n\nanyways, so their happy hour rocks. but those drinks are sneaky. you think that they're \"weak sauce\" bc theres no hard liquor except soju but they mix them so well that you unknowingly inhale the drink. I think things started going downhill for me when i ordered the \"Valentine\" simply because I wanted chocolate and it has a piece of chocolate in it. so there i was trying to get the piece of chocolate that was going UP AND DOWN AND UP AND DOWN AND UP AND DOWN in the champagne. I finally got it but that was after chugging the champagne and swallowing the raspberry whole. but the moral of the story is, i got the chocolate.\n\ni dont know what to say about the clientele, i was too wrapped up in my best friends who were visiting, but they were all friendly. i think.\n\nthe place is very clean and nice and the bathroom is fine as well. i remember wishing htey had more than just one unisex bathroom though.\n\nso it's 7 o'clock and i realize that i'm drunk and that i can only maintain my facade of tipsiness for so long before I start acting a fool so i whisper to my friend \"jo, i need to get out of here i think everyone is noticing the little drunk asian girl in the corner\" and she laughs at me and orders another drink. and i said cool. so finally we decide to leave and as we stumble outside we are blinded by the sunlight and all the way home we just kept wondering how we got so drunk so early and I was about to explain to them the process by which alcohol enters our digestive system and then to the blood stream and in the process reveal the cure for cancer, but i thought that it'd be better to just suggest gettin a burrito on the way.  \n\nall in all we had an awesome time, nextime maybe i will pace myself better so i can make it past happy hour.", "author": "Lillian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-03", "description": "I love this place! The drinks are great and unique. I had the Tropical Mist, has Sake mixed in, which was sooo tasty and a little bit of a creeper. Nice spot to lounge and wasn't too crowded for a Saturday night. I will be back. =)", "author": "H. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-19", "description": "i read all of the other reviews of this place before trying it out, so i had heard about their strange attempt to be a \"neighborhood bar.\"  yes, there is a sign indicating something about seating privileges for \"locals\" and i guess the hours are... different, for an establishment slinging drinks.  i was a bit wary.  \n\nhowever, i ventured in last week and was pleasantly surprised.  it was a weeknight, so not crowded at all, and the ambiance was lovely.  dimly lit but not completely dark, and warm tones used in all of the decor.  The bartender was extremely nice, and the other patrons were of the low-key, non-scenester variety.  i loved it.  \n\nthe wine list was small but definitely sufficient, and the MOCKtails were actually really nice, if a little froofroo for my taste.  i am extremely suspicious of soju concoctions, but i was impressed with the sour apple mojito.  it was too sweet for me to want more than a sip or two, but that isn't my style anyway, so i give it a thumbs up.  \n\ntwo really random observations:\n- there only seems to be one bathroom and the glass door is not completely opaque.  no one was waiting outside while i was using it, but i had to wonder if the user would be giving the line-waiters a shadow show on busier nights?\n- the cocktail tables are bolted to the floor.  i was appreciative, as it meant that i was unable to knock over our table or spill drinks with some excessive leg crossing.  however, if i had a larger group, it would have been a bit challenging to figure out how to sit at these tables and have a conversation together.  i recommend coming with a friend, on a date, or with just one or two other people.", "author": "Kirsten F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "Great little spot to grab a couple of drinks, a cozy little corner table, and sit and talk for awhile.  The music selection is interesting, eclectic and unobtrusive.  Fun people-watching spot.  This is one of the few bars I have been to where you can have a conversation with the person sitting next to you and actually hear 100% of what's being said. Rare for a bar, and definitely lands this place on my short list of bars I would love to go back to.", "author": "Becca V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-23", "description": "HELLO happy hour! Seven days a week and awesome music and a fun bartender with just enough attitude to keep it interesting. They also don't care if you cruise in with a Little Star Pizza and pig out with your champagne cocktails. I am quite happy it's close by my house.", "author": "Whit P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-27", "description": "Small, dark and AWESOME!  It's the perfect neighborhood bar atmosphere.  They don't serve the hard stuff, but I still like it anyway.  The bartenders are really nice and the ambiance is great for a date.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-20", "description": "Shhh, it's supposed to be a secret! Granted, it still pretty much IS a secret- generally populated by neighbors (myself included) - a solid wine list, a decent beer selection, and some seriously slinky comfy seats to get cozy in while listening to Joey or James' awesome tunes.", "author": "teriaki b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "How I feel about 821....\n\n- I'm new to the hood and Bar 821 has quickly become our go-to for an unpretentious drink. \n- I feel like I could show up in a hoodie or a dress and fit right in. \n- They only have beer and Soju, but the upside to that is that the prices are very affordable and they put effort into crafting some cool cocktails. \n- They have a killer $3 happy hour from 3 - 6 (every day I think). \n-  friendly bartenders\n- cool modern but casual decor\n-  I've heard you can bring in take out (Little Start is down the street)\n\nTry the \"signature spicy\" cocktail that's no longer on the menu. It's made with infused Habanero Soju.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-30", "description": "Close to my apt,  Great happy hour prices, Entertaining bartender (joey), and they make a Litchee mermaid cocktail. Litchee and champagne. mmmhmmm.", "author": "Karlee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-27", "description": "A really great little spot: Perfect for after work, before dinner or going out for the night. The champagne cocktails are great, and the prices for a bottle of wine are very good. I love this place for a girls' night out, but I think it'd also be a great spot for a drink with a date. The atmosphere is really nice, and the staff is very friendly too.", "author": "Barbs J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-17", "description": "I finally found a bar in SF that is perfect.  No I don't miss the hard liquor, no I don't care it closes at 11PM.  Hard liquor gives me a hangover and most nights I would just rather go to bed by midnight.  But this place is perfection.  The lighting is dim, the furniture is comfortable, its not super crowded but the crowd is cool, the bartender was nice, and the drinks are my cup of tea.  I love the Champagne drinks for $5!  My favorite so far is the one with cranberry and triple sec.  For some reason it tastes like Zima which I have to say I was the queen of drinking in high school and brings back great memories.", "author": "Lindsay P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-21", "description": "I read a bunch of reviews about Bar 821 on yelp, and one of the things that i thought was really weird about it was their door policy. they dont let anyone in after 11pm. hmmm, sounds like kind of an interesting gimmick to stop letting people in after a certain point and have a private party inside for the rest of the night. sure, a bit odd, but i thought it could be interesting. we headed down there and showed up at the place at 10:45pm. as we walked through the door, the bartender glanced up and shook his head at us. nope, we wouldnt be getting any drinks tonight.\n\nit turns out that we misunderstood... they dont just stop letting peole in after 11... they shut the bar down. so, it's only 11pm and we're outta luck with no other new bars anywhere near by. what kind of bar shuts down at 11?? is it past people's bedtimes or something? also, it's lame enough that they close at 11, but why not at least serve drinks right up until closing?? the reason bars usually stop serving early is because they dont want to break the law and have people still drinking at 2am... but if your bar closes at 11pm, there's no legal reason to have a\"last call\". also, they have a rule where they give \"locals\" preference. what does that really mean? do they check your address on your drivers license and then make non-locals give up their seats?? basically, i think these guys just wanted to have something quirky and interesting about their bar, but instead their rules are just kind of lame.\n\n(my resolution this year is to visit 50 new bars in SF.  read about it at: http://fiftybars.thisisvlad.com )", "author": "vlad k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "Ok, so now my new favorite place, even though I was only here for 30 minutes. Great neighborhoody bar -  no Bridge and Tunnelers, no rowdy drunks. It's a nice, mellow, dark lounge - great to kick back  with a glass of vino. I'll be back again and again and again.", "author": "Jen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-10", "description": "F the naysayers. This place is what it is... a great place to meet a friend and grab a $3 sake-jito before grabbing dinner around the neighborhood. It's a place where you can talk (and hear each other), where the bartender is friendly, where the lights are dim and where people who don't like it -- shouldn't go.", "author": "C'est La V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-14", "description": "It's in an awesome location, and the champagne concoctions are fun, but that's about it. I went on a Tuesday night and they kicked us out before 10:00! Wtf? What kind of bar closes that early? Also, no liquor license = no booze. Walk the extra block and hit up Fly Bar or Madrone.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-13", "description": "Happy hour-$3 for all of their drinks except the ones marked by an asterisk.  I got the mojito (made with soju, not rum) normally $8 for $3.  Honestly that's about all it was worth.  It wasn't very good, tasted nothing like a mojito, but it was strong.  I tried another drink that was much better, something with grapefruit juice.  Really liked the atmosphere and mix of people.  Perfect happy hour spot.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "This place is the perfect neighborhood bar... a few of us went for happy hour and loved it.  Nice decor, cozy vibe, unpretentious... what's not to love?  The whole concept of nigori sake in a cocktail with mint is a bit vile, though.  I may stick with the champagne-only or soju-only cocktails, or the beers from now on.", "author": "Godot -."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-17", "description": "This place is amazing.  Happy hour rules and it's 7 days a week.  Bartenders are really awesome.  Try the Luxury Mojito (a soju-sake cocktail); it's delicious, and during happy hour it's just $3!", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "Just the spot after work.  Closes at 11 on weekdays so expect to move on.  Service is great, just wait your turn.  For anyone who says that they are \"neighbors\" but don't recognize anyone, I just want to ask you where you hang out.  This place is like my living room, and I can see many of my neighbors whenever I go in.  Sometimes a bit too loud, but it is a bar.  Also, for those who complain about the hours, remember that it is a residential area, and the roof of 821 is the floor of an apartment. Respect given to the business owners for recognizing this and respecting the tenants by having shorter hours.", "author": "Jayson J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-21", "description": "I love champagne cocktails! They make me feel like a classy hooker. If only for a moment. Sigh.", "author": "D e v a n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-03", "description": "5 stars based on only one visit, mostly because I am so damn grateful to have found this sweet space in my otherwise quiet neighborhood. The space, lighting, wine selection, Guiness, patrons, bartender--all great. I can't wait to roll on down there again soon. (And I happened to notice that Everlast tattoo, right next door to 821, was open last night, so maybe next time you see me at a Yelp event I'll have Bar 821 tattooed on my forehead!)", "author": "Gretchen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "Stopped by here for a nightcap after dinner at Nopa tonight and this place is WAY better than it once was.  The new bartender, Juan, is really friendly and on top of his game when it comes to pouring drinks.  On top if this, his music selection was WAY better than the typical whiny indie crap that I remember playing here.  It wasn't crowded at all, and if this place wasn't required to close at 11 I'd probably give them 5 stars.  MUCH needed improvement here.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-25", "description": "Let me start off by admitting that I'm biased towards Bar 821 because it's three blocks from my place. But that aside, this place is really chill for some tasty, cheap pints. Many a pint of Speakeasy has been downed by yours truly here, and the ambience inside lends itself to the laid-back, relaxing vibe. Only catch: the damn place closes at 11, but don't let that get you down, because Fly Bar is a cigarette drag away!", "author": "Drew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "Small and quaint place for a mellow night out w/ friends.  This place is not crowded at all and seats are easy to get.  Had great time here conversing w/ friends on a friday night. Although they only offer beers and champange, its still for a good price of $5!!.  Great champange drinks combo too! Try their lychee martini.  Some drawback? the place closes at midnight, which can be a drag if you want to extend your night and its cash only.", "author": "Amelia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-13", "description": "I'm Korean and let me tell you, I know a thing or two (or three) about soju.  The soju-tini's here are good enuff to get me out of my kimchi squat and into the bar yelling, \"jom duh joo say yo!\"", "author": "Julie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-24", "description": "I really like this bar, particularly since it's in my boyfriend's neighborhood and almost always has a seat for us or us and our friends.  I am not a hard alcohol gal, so the wine/beer/sake menu is fine for me.  The bartenders are usually friendly and low-key.", "author": "Molly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-13", "description": "I'll give the place props for keeping it simple.  Small drink selection but excellent quality and price.  The Lychee Mermaid was as good as everyone says, however...the lychee at the bottom sort of made me want to vom.  I ate it because it was taking up space where more booze should have been. So, it got what it deserved.\n\nThe sake based drinks are pretty delish and the atmosphere felt intimate and familiar.  Being from out of town, I did feel like I was crashing a private party, but the service was so friendly and nice that it made up for feeling a little out of place.", "author": "H. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "I am hesitant to review this place, as I just don't want everyone to know about it. Bar 821 is just a great neighborhood bar. Its usually not too crowded and the bar tenders there always make a point of trying to help you find a seat, and work with the customers to make sure people are comfortable. Clearly this may not be the case every night but the dozen or so times I have been has resulted in a good time. Also the place closes at midnight so this helps keep the place from filling up too badly. They have chimay on tap and their cocktails from what I remember are tasty and well done.", "author": "Alexis G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-11", "description": "A nice little hidden oasis of cheap happy hour drinks.  It's only open till 11, but for some reason this fact seems only to enhance the integrity of this alamo square bar.  The sign says to keep it a secret, but I think the secret's out.  By the way, the Guiness Bubbly is pretty good.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-27", "description": "Small, dimly lit, cheaper to get a bottle of wine than drink by the glass.  All good things.", "author": "darla s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-13", "description": "This is a great neighborhood bar with super cheap happy hour specials and a really friendly bartender.  I only wish I lived closer!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-28", "description": "Really nice atmosphere. Came here early Friday night, not crowded at all, so it's chill and comfortable.", "author": "Yuchi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-27", "description": "This is my favorite bar in my 'hood. I've made ass here so many times and they still allow me back in. You gotta love joey. The only bad thing I can say about it is that they close too early. My favorite drink is the \"ginger\" ~ It's medicinal.", "author": "Babs P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-09", "description": "Neat, chill bar. Nice place to go with a few friends - but not too many (it's really small). They have pretty good drink specials on Fridays.", "author": "Dana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-02", "description": "Psst.....Very pleasant neighborhood bar on Divis.  The decor is dark yet warm with orange hues and fabulous artwork that complements the ambiance.  The simple bar offerings of beer, wine & champagne made it easy for me to cozy up to my cute date and my generous pour of shiraz.  Great place for convos or cuddling in the candlelight.  The staff was attentive and helpful, but I do have to agree that the early weeknight closing time kinda sucks.  Just as I was getting comfy in my booth, which had a great view of bustling Divis and the pouring rain, the bartender came over to warn us it was last call at 10:30!  But it was way worth the trip and there are plenty of late-night alternatives nearby.  Bar 821 is a pleasurable little secret... but it didn't come from me : )", "author": "Tara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-01", "description": "Very cool bar, and the perfect place to hang out while you wait for your table at Little Star to open up.", "author": "shoba d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "Why did it take me 2.5 years to finally mosey into Bar 821? Always on the list of \"oh, we need to drop in there this weekend\" but never happened. Finally on a Friday night  we dropped in and had a great time! Our bartender was super-fun and quite the character (even though that comment about Alan Parsons Project made me feel OLD I won't hold it against him). If I could give bonus stars for atmosphere I would. The drinks were yummy and the prices were average for the city. Oddly enough, despite the modern decor, Bar 821 had the feel of a true Irish pub. Good drinks, food brought in from elsewhere, fun bartender, small neighborhood feel and the obligatory TV showing a sports game.  Love it!", "author": "Sarcastic T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-29", "description": "Okay - nice vibe. Feels like a polished version of a type of bar you might find in New York, or, oddly, Puerto Rico. Drinks were good. The time I was there i also ordered a pretty tasty upscale Mac & Cheese.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-16", "description": "Top 5 favorite bar in town. If the fact that my Pac Heights dwelling ass will recommend this place to any friend in need of a great date spot, then I guess the \"secret is out.\"  I personally could give care less if the neighborhood hipsters are offended by my presence. Between the yummy drinks, the dark & sexy lighting, and the speakeasy vibe, this place is tops in my book. Probably doesn't hurt that I have a great memory from one specific evening spent here, but that's a different story.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-21", "description": "I had never heard about this place until this evening.  It's down the street from a friends house.  I loved this little space....comfy benches and tasty champagne cocktails.  I even felt comfortable here after my girlfriend was so kind as to tell me that I looked like a mountain girl...oh no.....time to spend more than 5 minutes to dress comfy before leaving the house.", "author": "Brye L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "Nice place to hang out. I would say that works for a group of friends of both genders, or a date. Not to go with your buddies. For that you don't need the nice atmosphere of Bar 821 !", "author": "Javi V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-15", "description": "I very much enjoy their champagne cocktails - particularly during their amazingly priced happy hour ($3!!). I don't know if this is simply my own misguided impression, but the atmosphere here always strikes me as perfect for intimate chatting and getting to know someone new.", "author": "Abigail R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-29", "description": "I've only been here once but I've been hankering to go back ever since.   I too indulged in the Valentine that fateful night and it has become the cupcake darling of my alcoholic repertoire.", "author": "Ky W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-03", "description": "You know those complicated drinks that involve dropping shots of whatever into half filled pints of beer? Well I could SWEAR that the bartender was making these complicated drinks with half filled pints of champagne. The fact that the tattoo guy from the tattoo place next door was the one drinking them just added to the ambience because seriously...any place where badasses shoot champagne is MY KIND OF PLACE. Badasses shooting champagne for only $3 is just icing on the cake.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-16", "description": "I'm not sure how I feel about Bar 821. It has some good things going for it: cozy, good bartender, decent selection of beers and wines. On the other hand, it's noisy and crowded even on weeknights, it closes early, and it lacks a hard liquor license. It's a nice enough place to stop in on your way to somewhere else, or if you're waiting for a table at Little Star Pizza across the street. And it's a cool enough spot if you live in NOPA or have a date there. However, I definitely wouldn't travel out of my way to get here.", "author": "Bradd S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-15", "description": "It's got a european feel with all the candles/low seating in there, which makes for a nice spot to sit, talk and chill. Joey's got the whole bar to himself in there, and he runs the place real well. They've got all kindsa tasty drinks in there, not to mention Hoegaarden on tap which is niiiiiiiice.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-11", "description": "They have a wonderful happy hour.  Go here for the champagne with strawberries and chocolate in each glass.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-01", "description": "I love this place. I live in the neighborhood and have been coming here since it was a \"secret bar\". Well it's no longer secret but it is still a great bar. All the bartenders are friendly, the sake/soju drinks are great, the wine selection decent and the beer selection is well chosen. It's also a great place for a date! Come here...you'll have a good time.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-27", "description": "Even though they don't serve hard liquor - the prices on their wines, beers and sake drinks are really good.  $5 for a champagne cocktail, I will drink to that any day of the week (literally)!", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "Nice small mellow bar, with comfy seats and kinda like a mix between a divey bar made over to a loungey dark cavey den.  I don't think i'd have much reason to go back, unless I was eating at Tsunami again (since they are two almost-next-door siblings of a semi-big family i guess), but it was comfy and the drinks were good and not too pricey.  Hard to choose between 3 or 4 stars.  Parking in the area sucks.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "The drinks are frikin good.  I loved the pink panther and the Lychee champange cocktails.  The happy hour has to be the best deal in town", "author": "Chris W J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "Always love anywhere that serves Leffe in the true Leffe glass. Tried the apple mojito, not much alcohol but tasty. Good dark atmosphere and tunes.", "author": "Amanda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-01", "description": "The bar tender is so funny and nice, we had a cool duet singing to the music on the tv screen. The bench is so comfy the seats suck and hurt your back. Change the seats and it's ll good!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-30", "description": "By far my favorite bar on Divisadero.  Joey the bartender is awesome, happy hour is from 5-7 pm and drinks are $3!  $3!  No liquor though.  There is a TV to catch up on Sports, go Suns!  The ambiance is loungy and on some nights, there are some cute girls.", "author": "Christian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "When I walked into this bar, it was love at first sight. Zoolander was playing on the television and the musical selection for the evening was The Streets. Despite the fact that it was a Saturday night, it was not overcrowded and it was easy to get a drink. My drink cost a little more than I expected, but  it was also much larger than I expected. What a pleasant suprise. The ambiance was lovely, the seating was plentiful, and my date was audible. It was an evening well spent. The only downfall was that it closed early, but apparently people live upstairs so that makes sense.", "author": "reina t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-08", "description": "WTF? 4 stars? Bullshit. This place sucks. Where to start? Since it's a bar, maybe I'll start at the drinks. Drink options totally suck. Beer or wine. That's about it. Very limited, and all the choices suck. I got a pathetic beer that was so bad I could not even finish it. The server was a total bitch. Completely cold and careless and hostile and rude. Ignored me for a long time then rudely took my order and threw the beer on the bar. The foam went over the top for a while, leaving me with a sticky filthy glass covered with beer in a puddle of beer. Very nice. Music sucked and was way too loud. Stupid flat screen TV on the wall. Why the fuck would someone want to go to a bar to watch a screen that they can't hear? It's stupid. Get rid of it. There's enough bloody TV all over the place these days. And, on a freezing cold pre-winter night, they left the front and back doors open, so one had to totally freeze and could not try to enjoy being there. Incredibly loud. Could not hear my companion and she could not hear me. Oh, I could go on. But you get the idea. Went over to \"mini bar\" afterwards and what a relief it was to be there after this hell hole.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "This is a great place to sit and have casual drinks and catch up with friends.  The bartender is so friendly, he truly is what makes this place!\n\nI would definitely go back!", "author": "bree s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-05", "description": "there is something to be said about walking into your local bar and already having your drink on the counter before you even sit down...\r\njoey makes me a happy girl on any given night with his quips, don't give a damn attitude, and his delightful music selections. all in all happy to be home in 821, even if it \"was\" a secret", "author": "o. c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-08", "description": "I love this bar. We'll come all the way from Bernal Heights just for a couple of drinks here, because it's relaxed, easy to find somewhere to sit, serves BIG beers and shows Spinal Tap on the flat-screen. The fact they close early seems to deter a lot of hipsters and yuppies which makes it all the more appealing. If I want to drink after 821 closes there are plenty of other options. Up until they close however, I'm staying right there.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "Bar 821 covets itself as a neighborhood bar, but they keep the place lit so darkly that if you head in during happy hour it feels like a cave.  If however, you'd like to get out of the sun for a few hours or love $3 beers/saktails than this is an ideal place.  Franz Kaner on tap and other Belgian treats fits with the nice selection of beer.  The biggest downfall, aside from being so damn dark is that like some bars on Divisadero they don't have a full liquor license, so while it may say cocktails on the sign outside those are made with soju or sake.  All in all, this place has a great decor and a great happy hour, so if you're in the area and your thirsty before the clock strikes 7 its worth dropping in.", "author": "Ed B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-17", "description": "Nice conversational, comfortable alternative to the wall-to-wall youngster scene that you're likely to find at other neighborhood haunts.  Killer happy hour features $3 Belgians.", "author": "Brant O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-29", "description": "Not a lot there, but it's mostly good.  The happy hour deal is great, they mostly have belgian beers, but only like 8 beers total.  They have a lot of champagne.  It's one of the happy hour specials. Some of their cocktails are good but some are absolutely foul.  Dark and quiet,  so it could be a good alternative if you're not in the mood for the energy of Fly, across the street.  Right by Little Star Pizza which, I know from experience, can be a good combination.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "Impulsive choice, was on my way to the bamboo hut, but curiosity always gets the better half of me. For once I was actually sober before I hit the bar, but that would all change in minutes to come. Definitely a very intimate kinda place but although small did not seem to get overly crowded. The bartenders had good suggestions and I was all for trying out new and exotic drinks. That said we tried everything from wine to shots to those fruit infused cocktails. The portions were small but very potent. Out of the numerous bars in san francisco this place is almost a hidden gem....that is until it was first reviewed on yelp.", "author": "Raj K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-14", "description": "Bar 821 is very simple. Beer and Wine, nuff said. 821 is very dim which sets the mood. I gave this place only 4 stars because they close so damn early. Fucking ELEVEN! Overall, it is a great place to hang out and talk nonsense with your buddies. See you there!", "author": "Danny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "Also a favorite local hang out. Cozy, intimate bar with dim lighting...great ambiance. They only serve beer and wine which is perfect since I'm a self-proclaimed wineo. The selection, to be honest, isn't extensive, but it's pretty reasonably priced and if you can nab a table it's a great spot to chill and spend your evening.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "Great, small neighborhood bar.  And even though I'm not a regular, each time I've been in there, everyone was very friendly which is rare at some of these places.  Over sized drafts that get even cheaper at happy hour, plus a great wine selection.\n\nMusic played by the bartenders is always fantastic as well, which is a nice surprise.", "author": "Kris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "This is me and my girlfriends favorite sunday spot. No hard alcohol but the bartender \"James\" always takes great care of us. Keep the champagne cocktails coming.", "author": "brad b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "I'd give it 3.5 stars if I could. \n\nWhy 3.5? \n1. only one Zinfandel on the wine list (not an issue for all)\n2. really noisy, which made it difficult to carry on a conversation\n\nBut... it's close to my house, has a good happy hour and seemed pretty chill. I'll try it again to see if I just caught it on a really loud night (Wednesday).", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "I love their Luxury Mojitos.  A nice place to have drinks with friends and you can talk without having to compete with the sound of loud music.  We will be back....very soon!", "author": "Leah V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "I really like this bar. It's very laidback and pretty small. It seems more of a place to sit down & talk with your friends -- it's not the kind of place where everyone is standing & you have to squeeze through a huge crowd. I don't mind that they don't have hard liquor -- I find their champagne cocktails pretty delicious. So far, the Lemon Spark is my favorite, but I've also had the Lychee Mermaid (yummy) and the Raspberry one with the dried hibiscus in it....I intend to try all of them. The happy hour does indeed make me happy because champagne cocktails are only $3, and I can bring in Popeye's from down the street too. Mmm. Not exactly sure why all the reviews rave about the bartenders; they seem fine but a little inattentive (wrapped up in convo with regulars and/or friends, it seems to me).", "author": "Amy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-20", "description": "we really, really wanted to like this bar as the bouncer was cool and they were showing \"Airplane!\"  whats not to love?  apparently the staff's bedtime is 11 PM.  The prices are awesome and they had tiger beer but the bartender acted legitimately pissed off that we had showed up and were (very politely) going to order a couple beers.   sorry we had the audacity to order DRINKS in your BAR, bitch.  they acted as though the concept that someone would show up at ten thirty on a saturday night was completely out of line.  does anyone else understand how this is a successful business model for a bar?  neither do we.  so after killing our three dollar anchor steams  - granted, they do have great prices - we headed off to our favorite neighborhood lower haight bars that stay open til 2 like normal drinking establishments, where the bartenders are at least nonplussed by your ordering a beer as opposed to downright irritated that you would presume to do so.\n\nprices are great, but have a good buzz going or be a sociopath in preparation for awkwardness.", "author": "noah s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-27", "description": "shhh. don't tell anyone about this place!  good wine/champagne/mixed drinks, not too overcrowded, and a friendly bar staff. some nibbles would enhance the experience and make me stay longer, but really, how many glasses of bubbly can one girl drink?", "author": "Bee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-21", "description": "Nice place, cool booth seats, dark but clean, good music, sports on the TV, my all-around favorite neighborhood bar! Actually it's nearly the only bar I even go to in this god-forsaken city anymore. They have a bunch of foo-foo girly champagne drinks and a wide selection of beers for the guy. Great Mojitos, and soju drinks. My favorite is the Valentine, champagne with a stawbery and chocolate piece. The chocolate and strawberry add a delicious touchto the flavor of the pagne. A fun place to relax after work, start out a night on the town, or even just come for some quiet evening romantic conversation. No one here gets rowdy (prolly cause it's beer and wine only), nobody is rude, no one is flagrantly doing coke in the restroom, the bartenders are nice, the people are cool, and it's got the greatest happy hour menu ever. What is there not to like about this place? NOTHING. It's f!@#ing perfect. Thanks guys!", "author": "Robin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "i love this bar.  however, we just threw a private event there and unless your friends are alcoholics, there is no way to meet the minimum they require--because they only serve beer and wine.  it was a great space for our party, but we ended up fronting $500, which sucked.  we had close to 100 people there, and we were still that far from the minimum.  just something to consider if you rent the space out for a private event.  other than that, i love 821.  it's the perfect blend of wine bar and dive.", "author": "K H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-01", "description": "821 tells its patrons not to tell anyone about them yet it advertises heavily on guardian. what's up with that? 821 is an excellent bar/lounge and certainly doesn't need such gimmickry. the place is laid out nicely to maximize its diminutive space. the crowd is attractive and mellow. the beer selection is outstanding with plenty of german and belgian beers. the friendly bartenders know what they're doing. more importantly, no attitude... 821 is at the cusp of 5 stars but deserves 4 stars due to its early closing hours (zoning issue). i guess that makes 821 a good neighbor even if it's by default. that's always a good thing.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "nice 1st impression...........chill, dim, hip, cozy, intimate, loungey bar, i especially like the comfy long bench/couch seating slightly reclined meant to really lounge against the walls.........      though its not my scene, it was pretty damn chill -- people were mellow, laid back,  into their own conversations, wasn't crowded that night so didn't have to yell in conversation.   great to have wine, but that night i had a $5 lychee soju cocktail that actually gave me a nice buzz.", "author": "Cindi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "Try the Lychee Mermaid! It's surprisingly fun and delicious.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "i like this place. my friends and i were looking for a place to grab a drink while we waited for a table at little star. we walked around the neighborhood, walking in and out of a couple other bars. bar 821 was just what we were looking for. dark, intimate, ample seating. they don't serve hard liquor, so i ordered a sparkling ginger which turned out to be quite yummy. the bartender was friendly and the atmosphere was casual and unpretentious. this is the kind of bar i would go to more often if i lived in the area. it would be great for a group of friends or a date.", "author": "Elena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-18", "description": "perfect little loungey place. we need more like it in SF. and the lack of liquor keeps the crazies from coming out. wine, sake, beer and champagne. good enough for me.", "author": "Cameo E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-01", "description": "the peeps who own tsunami and cafe abir own this place. and like the others, it's too kool for skool and really nuthin' special.", "author": "rerun w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-07", "description": "waiting for a table at tsunami or at little star?  head over to bar 821.  you won't be disappointed by their champagne drinks.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-04", "description": "love this place for happy hour\n5-7 pm daily, $3 champagne cocktails, including a lecee one, soju drinks and beer\n\ntv..music was a pleasant talking volume....good window space and cute tables all around!\n\ndon't go in at the end of the happy hour...it does not make the bartender very happy", "author": "Kate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-20", "description": "sojo & champagne cocktails w/ lychee.  good decor, though not open late.", "author": "Liz V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-20", "description": "champagne..the key to any girls heart...or rather this girl's heart....automatic 4 stars...\n\ntheir ginger champagne cocktail and the valentine (?) were excellent...", "author": "Joy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-15", "description": "just the right size, just the right atmosphere and they have creative bubbly, for the love.  bar 821 has hit the spot every time.", "author": "julia p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-12", "description": "been here for the grand opening night, haven't been back since.  one star better than the fly bar.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2004-10-12", "description": "Great suds and saki drinks at great prices.  Get the evening started here because the door closes at 10:00", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "This was the first bar I ever went to in San Francisco (Feb 2005) and I've been coming back ever since. It's right around the corner/across the street from Tsunami/Little Star which is nice when you're waiting for your table to become available. But the real draw is the champagne cocktails, my fave being the sparkling ginger. For $5 ($3 if you get there before 7), you get a tasty, bubbly gingery concoction. And once you've had a few too many of those, you have the option to switch to a nice pint or a glass of wine. The ambiance is totally chill- candlelit with some comfy benches (although the accompanying chairs totally blow- good excuse to sit next to your honey for better hand-on-thigh action). In addition, there's always a classic cult movie playing on the TV (muted) with the bartender's ipod at work (he plays good stuff). The bar closes early, so get there early, get down to business and be in bed by 11:30 with a good buzz on.", "author": "Billy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-28", "description": "821 is the shit. locals. cool spot. good beers and wines. i heart the bartenders and they treat me like a neighborhood regualr even though i dont live here. unpretentious. fun. nice people. good stuff.", "author": "kelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-14", "description": "i dream about the lychee mermaid - a champagne cocktail with a lychee. it's worth the trip.", "author": "J K."}
