{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "Came here for Wine Wednesday ($6 wine glasses) yesterday with some peeps. We did 2 rounds of the $3 mystery shots! Too bad they're all the sweet versions of the college liquors we've come to know and cherish. Classics like Smirnoff Peach, or Southern Comfort Caramel (just gagged typing this).\n\nBartender was chill and kind of an instigator! Had 3 drinks here within an hour before heading to more drinking shenanigans :)", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Great bar, excellent service \nCool vibe, really chill. Would be regulars if we lived here \n\nPS: Great taste in music", "author": "Aleister C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "BIG SHOUT OUT TO THE OWNER OF THIS BAR!!! Mike is the SHYT!\n\nBar Basic is the place to be Friday and Saturday nights. Located right in SF where all the action is taking place, Bar Basic truly stands out with their delicious drinks and great Happy Hour deals! Great vibes here and everyone always seem to have a great time. \n\nMy girlfriend introduced me to this bar in 2017 and ever since that I've been a true fan. We came here to celebrate the owner, Mikes, birthday and I must say, he knows how to throw a DAMN good partay! There were drinks flowing ALL.NIGHT.LONG! Drinks offered, but not limited to: Kettle One, Fernet, Whisky and Jameson. \n\nThis place is perfect for after work get together to chill and relax with a drink in your hand. The bar has a lovely cozy vibe with comfortable lounge seating and small tables. \n\nThe bar doesn't serve food, but the owner does allow you to BYOF (Bring Your Own Food). The staffs here are always so friendly and attentive. \n\nOh, wait! Don't forget about the cute little bar dog, Butter! He is the CUTEST! The owner, Mike, will bring him to the bar every now and then and he just the BEST. Make sure you say hi if/when you see him. \nThis is one of my FAVORITE places to come after work. I just LOVE how lively it gets after hours. \n\nDefinitely a place to come visit Friday-Monday!", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "I met up with a couple fellow Yelp elite friends for happy hour on a Wednesday evening. We started off here for their cheap drinks. After a glass of wine, we opted for the $3 mystery shot. You pick a random number with the bartender and he'll pour you up a mystery shot. For $3, you're obviously getting cheap alcohol reminiscent of college days, but you won't find a better way to get drunk. If you're looking for a fun time, this is a good start.", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "I hosted my husbands 40th bday at bar basic and it was fantastic. Mike was easy to work with and accommodated all my requests. I was able to bring in my own catering, DJ and ice luge. Everyone had a great time!", "author": "Jowie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Bar Basic is as the name implies - a simple bar that delivers on its promise...of being a bar.\n\nIt's tucked away just off 4th and is perfect for grabbing evening drinks during the week.\n\nThe interior has cozy seating and cute decor. Bonus points for good wine. I'd come back!", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "A girlfriend lives close by, so we decided to have one more drink before dropping her off last Friday, May 5th. We got here around 11pm, so it was rather chill. Got a table (or two) along the wall for our party of four.\n\n*The G-Spot: silver tequila, fresh lime, st germaine, grapefruit juice ($10)\n*Blood & Sand: great king street scotch, orange, carpano antica, cherry heering ($12)\n\nI didn't try any of the cocktails as I had quite a bit to drink on our stops before. Just stuck to a straight pour of Oban 14. (Or some sort of scotch / whiskey similar to that.). One of my friends also got a flavored vodka. I think it was boysenberry? Honestly not too sure, but I don't think he liked it. And he drinks a lot of flavored vodka. My other two friends have been here several times, so they seemed to enjoy their cocktails.\n\nFun bar. I'm glad it was a chill Friday night as I tend to like more laid back bars. Good for a few drinks while watching TV or just catching up with some old friends.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "The cocktails and beers are decently priced for this spot of SOMA with rotating specials. Try the mystery shot from a crate of about a dozen liquor bottles. It costs $3 and could be fun. It depends. You pick a number from a set and that number correspond to the liquor shot. However, it is no joke if you're mixing or planning to have different alcohols on your outing. Believe that the next day!\n\nIt is crowded at times but not always. At HH opening it was relatively sparse, as well as on a Saturday night I went. The low lighting at night made it looked like a dive bar but once your eyes adjust it's not, and the seating is cushy/loungy so it's a nice mix for everyone. The drinks were good but that might be due to us having drinks elsewhere first. Good place to drink before, or after, going out at night.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Happy hour is crazy cheap ($6 well martinis, $7 wine).\nI came here on a Friday at 6PM and there were only a few people, but by 630PM it was packed. \n\nHas kind of a divey/bro feel. It got pretty loud which is fine, but def not somewhere to go for a quiet or intimate drink. \n\nI don't know if this information matters but when I left at 715ish, there were 41 people, only 4 of which were women (including myself).", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Solid bar with good cocktails, beers on tap and snack selection (Shin Ramen ). There's trivia on Tuesday nights and did I mention happy hour goes til 9pm?!", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "Went early on a Friday night before dinner for a drink. Was disappointed that it appeared the bathroom was not attended to for a day or two. Toilet paper on the ground everywhere, the sink was totally plugged with disgusting standing water. I let the manager/bar tender know. Not apologetic at all, casually asked another staff member take a look. I am not a dog person so I didn't appreciate that there were dogs running around the bar. The drinks were just OK. Not sure that I would return.", "author": "P S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Damn this place is pretty lit!\n\nCame here around 6:40PM on a Tuesday and this place was packed! Great prices too especially for a downtown SF location so close to the park. I got a lychee martini for $6 and 2 mystery shots $3 each. (There's a reason why it's $3 bucks but still awesome.)  My friend got a moscow mule for about $9 and it was damn tasty.\n\nTuesdays are also their trivia nights, and holy crap I didn't know answering random ass questions could be so fun. They have different variety of trivia, from \"Name that Artist!\" to \"Guess that celebrity!\" and my favorite \"Where the f are these national parks?\" They even gave us free popcorn and jalapeno poppers! Highlight of the freaking night man. Free stuff is the way to my heart. \n \n10 out of 10 would go again.", "author": "Natalie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "A good place to have a good cocktail with the bartending staff is extremely knowledgeable and extremely friendly", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-03", "description": "Just like its name, Bar Basic is pretty basic. I played with my luck and got a mystery shot. My friends got a cocktail and a beer. All of ours were strong in alcoholic flavors.", "author": "Sherry Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "$3 mystery shots.\n\nThat's all you really need to know. If you're the adventurous type, a stop by Bar Basic is definitely worth your time. I've had delicious, sweet liqueurs, and I've had terrible flavored tequilas. The fear of getting something terrible really adds to the excitement, so I'm not complaining!\n\nAnd if shots aren't your thing, they've got a diverse selection of cocktails and beers. The cocktails always seemed a little boozy for my tastes, but your mileage may vary. It's one of the surprisingly few places you can find Allagash White in SoMa, so that alone should be enough to tempt you if you're on the fence.\n\nThey've also got trivia night, a Rockbot music system you can queue songs to from your phone, and some old video games in the back. Plus, with Yelp Cash Back you can take 10% off your tab (so, half your tip), which is a cool bonus.\n\nAll in all, it's a fun place to go with your friends, take a couple shots, and sip a cocktail. It doesn't have any unique hooks that other bars have like Soda Popinski's wheel, Coin Op's video games, or Black Hammer's microbrew selection, but for a \"basic\" bar, it's great.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "I came here for a date on a Friday evening (7-9pm) before bars usually get too crowded and I really enjoyed this bar!\n\nMy drinks for the night include: a Moscow Mule, a Mystery Moscow Mule, and another Mystery Moscow Mule. So as you can see, I really like their Moscow Mules...in particular the Mystery one lol. I think they change the liquor each day which makes it mysterious. It was $9 which is a good deal to me.\n\nYou also can't go wrong with a $3 mystery shot. Damn this place is mysterious. You choose aa number between 1-7 and you get what they pour. I got some vanilla vodka thing which was meh, but my date got a cucumber lime vodka shot which actually smelled quite nice...almost.\n\nThe bar had a divey atmosphere. You could tell everyone there worked in tech and was hanging out with their coworkers. Pretty chill.\n\nOh and the best thing was that they had free popcorn. I didn't eat any dinner so basically the bowls of free popcorn was my dinner lol. I also saw some snacks in the back of the bar like Shin Ramyun cups from Costco which have a special place in my heart because that is literally what I ate every Saturday growing up.", "author": "Scott K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "A couple of my friends wanted to meet up for drinks before headed home on the Cal Train so I suggested Bar Basic for a little mid week happy hour.  I thought this place was more of a 'dive bar' from the outside, but once you walk in it's actually quite nice.  There is a lot of open space , a decent sized bar and a wall lined with couches for lounging.  I arrived around 5:30 on a Wednesday only to find a few patrons (and a dog!) enjoying some drinks. \n\nBar basic has a great daily happy hour.  Monday - Friday from 5-9 you get dollar off drafts, $7 glasses of wine and a specialty martini or well drinks for about $6 I believe.  I went for a gin gimlet, it was refreshing and service was quick.  The bartender was friendly and really spent a lot of time cleaning in between making drinks/down time so I always appreciate that.  \n\nI do wish there were some better seating options, maybe some high top tables, it is a little awkward if there are more than a group of 3 with seating as the booth is just lined against one wall.  Otherwise, a perfect HH spot especially for those looking to be close to public transit.\ncheers!", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "Stopped in here last night when we had some time to kill before our reservation at Cockscomb. It's a simple place with a good happy hour drink menu. It was a great way to kill 30 minutes and get our buzz on.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "Back to the basics of a bar, indeed! \n\nSimple menu and lounging on the side as well as at the bar!\n\nWhen happy hour is on, cocktails are 5 bucks, a steal deal!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "I'm a huge fan of bars that are not crowded and poppin' during happy hour time, especially when I'm trying to have an audible catch-up conversation with a friend. I came here at 6:30pm on a Thursday evening and it was totally empty! It's the strangest things that thrill me. Plus there's so many great drink deals here -- this may have just become one of my favorite bars in San Francisco.\n\nMy friend and I sat at the bar and ordered lychee and peach martinis, which were strong and only $5 each. The bartender was not particularly engaging, but she was attentive. Between conversation topics, my friend and I got distracted by the TVs with multiple different channels chilling above the bar. Yes this bar is totally basic, but why does a bar need to be super fancy to be awesome? Will definitely be coming back with my friend and hopefully introduce Bar Basic to others too!\n\nEDIT: This bar is dog friendly, too! The bartender poured water into a dish for our dog. Very warm and welcoming from the staff and its patrons. Will definitely take our dog here again.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "When Yelpers described Bar Basic as a dive bar, I was expecting it to look the part. I was pretty surprised it didn't! The bar is spacious long-wise (and the bathroom is in the back). There's a long sofa along the left side with small tables. Since the sofa is connected, you might have to make friends with your neighbors! (That's never a bad thing, right?)\n\nTheir happy hour deal is $1 off draft beers. But go for the $3 box shots! Pick a number between 1-12 and drink up!\n\n3 beers and 4 shots later, the bill came out to be $30 with tip. Not too shabby, especially for San Francisco! Cheers!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "Bartender was super cool for a Monday afternoon.  Of course I tried the G-Spot. And it was amazing!! What's not to like about tequila and grapefruit.  Sure the place is divey, but I wouldn't be able to say drinks are much better elsewhere.", "author": "Patricia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "Came here with a bunch of people for my friends birthday. Ordered a basic round of well drinks and beers. It was fairly early so we got a nice little spot to sit and catch up. The drinks were strong and the ambience was very easy going and fun. \n\nIt's definitely one of those places that must have many regulars. Loved it", "author": "Ashmita V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "WOW!\n\nI am not a going out person at all. I only get buzzed at home and usually dislike the pretentiousness that most bars crave.\n\nDon't get me wrong, I have some bars I frequent and adore but none that I truly have some FUN at. \n\nI was drunk but I think I played either Tekken or Mortal Kombat\n\nand then \n\nGrand Turismo or Need for speed.\n\nI had so much fun I can't remember which of each genre i played. My coworker and I had a great time and spent such a comfortable amount of money and there was CANDY IN MY DRINK!\n\nThis is a dangerous place for me. A big, big thank you to the team that opened and runs this amazing basic joint. They know what they are doing and it feels like they are interested in giving you a great time and not ripping you off.\n\nCome by here!", "author": "Niana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Bar basic w the Bae before a Giants game was super chill. The seats are super comfy and this place is just.... basic. It's clean and they serve all sorts of drinks. Even flavored martinis!\nThe bartender was chill. I thought she was writing poetry in her little notebook which is super coool.", "author": "Krystle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "We stumbled upon this gem after leaving a day party on Saturday at The Grand. We were the first patrons there for the night so we had Tou, the bartender, to ourselves and got to chop it up with him for a while. He was amazing! Knowledgable about all the liquids especially the Japanese whiskeys, which the beau had particular interest in. The $3 shot section was my favorite. You pick a #, 1-12, and they pour u a shot of whatever is in the associated bottle. We got a gummy bear shot at first (no idea what's in it! Lol. It's one of the only mixed drinks in the box of shots) then a shot of 360 vodka (organic! Our first time having it..super smooth). \n\nWe'll definitely be back here!", "author": "EarthaStarr P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Amazing cocktails, great and friendly staff! Super fun bartending class!! Definitely check it out!!", "author": "Ariana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Great spot for a low key drink after work. Service so always solid and the prices are very reasonable.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Classic dive bar and just around the corner from the stadium. \n\nAmazing happy hour deals and good beer selection.\n\nSeating is limited so it isn't ideal for large groups", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Came here for happy hour with coworkers.\nCheap prices for drinks! Got $3 shots -- pick a number deal. \nThink I got a lychee martini but it wasn't that great.... from what I remember it tasted pretty strong\n\nFree popcorn though!\nWould definitely recommend coming here", "author": "Amy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "Bar basic is.... Basically a regular bar. Great place to hang out, but nothing really special other than the PS2 by the bathroom. Play a game while you wait to go bathroom or challenge a friend just cause. This place can get packed but service is pretty quick. Prices are decent. If you get a bit hungry, you could get a cup of noodles or other snacks. Don't know how much it is though.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "After spending a couple hundred bucks on some okay dinner next door we decided to come into Bar Basic. My friends and I enjoyed ourselves. You can request songs to be played by downloading the Rockbot app. Near the entrance they had a table with free little knick knacks for patrons. Very chill casual atmosphere. Drinks were good too and very affordable by San Francisco standards. I'll definitely come back.", "author": "Cristal F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "The name of the bar pretty much says it all - a basic divey bar. I particularly like this bar because the bartenders are really friendly and so were the crowds when I've been here. In fact, one time my friend left his phone and jacket at the bar for over 30 minutes, out in the open, and it was safely still in the same spot. Phew. When we went to retrieve it, a guy said he was keeping an eye on it. So nice of him!\n\nAnywho, solid drinks and laid back environment. We typically do the random pick a number shot. Haha.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "What a fun time at the Bar Basic Tuesday night September 26 for the trivia evening. That week was the transit week and that was the only reason I went for the trivia night. I came all the way from Concord just fo the quiz. I was able to answer about 4 questions out of 10 I miss 6 questions.  The questioner (Chris) is an awesome dude. He dose a great job providing the game and answering my question he is very helpful! the bartenders are excellent too. one guy offer me a water after my glass of wine. The decor is great, people are friendly, location is convenience just few blocks from the king and 4th Metro N line Every Tuesday is the trivia night. There were many people participating the game.  price on the wine is reasonable. Menu is very selective for beer, cocktail, whisky and more.  I recommend this place to hang out.  I will repeat!  next time I come I will bring my UFO just kidding.", "author": "Mat Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Very down to earth bar establishment \nThey show Walking Dead on Sunday and will start airing GOT in April \nThere are a few board games and card games to play such as Exploding Kitten \nSeating is good and the space is roomy \nDrink prices are fair and variety is solid \n\nOverall Thoughts\n\nI would gladly return to Bar Basic", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "I'm new to the area but the fact that this place is pretty cheap and has some old school video games that you can play is awesome! Not to mention the vibe here is pretty chill. \n\nHappy hour is pretty empty early on but offer about 6 you'll see people start to roll in. \n\nAnd they've got a pretty good wine selection too!", "author": "Eddy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Good place for an early happy hour with a big group. If you can get here around 5 then you can get a spot for a bunch of friends. The rotating specials are creative, so are the mystery shots. I like the martinis and the tequila drinks. The vibe is chill here. Good location for the ball park too.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Very cool bar in the heart of Soma, a stone's throw from the Caltrain terminus and AT&T park, not to mention the tech companies. \nI came here with six friends, including my small little dog. I also saw another dog here, so all canines welcome! We all arrived around 7 PM on a Friday night, and this place was happening, but it wasn't too crowded as we were all able to find seats together. I should mention now that this place is more of an after work place, because it really emptied out around 8 PM. \nSome of the previous information is not up to date. They didn't have $5 martinis during happy hour, and they only had four mystery shots and not 12. They had specials on beers, which is fine, because they had Sierra Nevada and other brews on tap. \nI recommend this place if you are in the area and want a fun place to kick back and shoot the sh*t with friends!", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "I'm a huge fan of Bar Basic - though located a bit off the larger bar scene, they offer a wonderful, more mellow, atmosphere and plenty of house mixed drinks. Tou, one of their weekend tenders, is awesome. He is super nice, always over-serves, and is delightfully personable. I'm also a huge fan of their shot \"mystery box\" - you pick a number, roll a die, or something similar, and get a random shot from an assortment of 12 drinks/mixes. \n\nAll in all a very chill place. Not super loud and crowded, and a great place to come and chat with some friends and meet new ones. Two thumbs up!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "$5 MARGARITAS YAASSS QUEEN.\n\nThis place doesn't have food. But they make up for it in their cheap margaritas. Plus you can bring food in, and there are quite a few restaurants around the corner. So basically they give you the decision to get drunk quickly on an empty stomach, or bring in whatever food your drunk brain desires.", "author": "Rosy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "I pass this place everyday when I head back home to the southbay via caltrain.\n\nI've only been twice, but both times have been good to me.\nI have never made it to happy hour so I can't comment on it, but here's what I've tried:\n\n- Moscow Mule - $7 - It's decent. It comes in a copper cup. Solid drink.\n- Box of Shots - $3 - I like this box. I've been fairly luck with this. The first time I picked #7 and I got a peach whiskey. The second time I went, I picked #2 and got Apple Pie Liqueur. Both shots were tasty.\n\nIt's never been packed, but there's always people there.\nThere are 3 TVs over the bar, and some tables for groups.\n\nOverall, a solid dive bar. \nRecommended and I'll be back. \nHopefully one day I'll get off work early enough to try their happy hour!", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "Bar Basic[1] is dog-friendly. This place is people-friendly, too[2].\n\nFriends and I met here for happy hour libations. If you're into \"check-in\" type dealy-o's, you might get a deal like we did. Deal or not, their drinks are reasonably priced and conveniently listed on their site. Sitting by the front window is recommended for maximum people-watching and weather-basking.\n\nIf only Basic was open Sundays.\n\n[1] Unrelated to the San Diego Bar Basic. That's not a knock against this place, either.\n[2] If you're dog-unfriendly, or people-unfriendly, stare at their TV.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "Very cool bar hidden away in SOMA. Great cocktails and friendly service! Great place for an after work cocktail! Can't go wrong with a place that has Jack and Coke on special! Definitely coming back soon!", "author": "Rodney D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "The hand written menus add a great touch two making special drink stand out! The environment build very comfortable and I would gladly come back.", "author": "Clay T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "We were a little early for our reservation next door at Marlowe, so we decided we'd grab a drink here while waiting. \nAlso figuring the drinks would be cheaper than Marlowe.\n\nThe drinks were DEFINITELY cheaper! There was a % off all whiskeys. bourbons, etc. Straight up or in a cocktail.\nYes please, those are my favorite kinds of booze\n\nI had a Manhattan and  Monte Carlo. Both were very well made.\nI wasn't a fan of my hubby's old fashioned. I think their version has soda in it, which I don't like, (but I am aware some versions of the drink call for it.)\n\nThe bartender was pleasant, and  the bar was IMMACULATE.\nI didn't visit the bathroom, so no clue if the cleanliness carried over.\n\nIt was mellow, and totally chill, (which I'm guessing is not the case during the week.)\nNot a destination bar, but a good choice of you're nearby.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This place is a really chill spot, the bartender Stephanie is awesome. The drinks are very affordable. I love it.", "author": "Clifford H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "I stopped by in here after missing my train.  The drinks here are super cheap although they do have a minimum on credit card tabs.  My beer was only $4 when I got here and from what a fellow bar patron told me, they have crazy specials here all the time.  During the baseball season during Giants games, they have cheap Jameson whiskey shots which can cause quite a frenzy.  \n\nI didn't get a chance to see the Nintendo in the back or maybe it was put away when I was there.  Otherwise, it's a nice comfortable place to wait for my train home.  Unlike Victory Hall, Bar Basic has couch seating so definitely a plus for me.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Drinks were fairly priced and the crowd was great and not \"basic.\" The title of the establishment also cleverly sets your expectations so that you won't be disappointed. This bar is not ideal to attend after a Giants game as other yelpers have pointed out so make sure you go on a \"basic\" night. \n\nThe atmosphere is fun and non-threatening and the staff is very generous with their pours. Also...TRIVIA NIGHT!!!!\n\nThis definitely isn't a place to go and just grab a beer, it's a lively, fun, and hipster-y place--and I love it.\n\n4 stars.", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Happy hour from 4-9 is awesome ! We went on \"student Monday's\" and our bartender was awesome. We came here to pre game before the Giants game and had a great time", "author": "Irma B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Bar basic is pretty much our favorite bar to go to for a number of reasons and we make our way here at least once a week if not more.\n\n1) The location is great. \n\n2) It's dog friendly.\n\n3) It manages to walk the line between a dive and a classy bar. This part is hard to describe, but the furnishings are nice, the lighting is well done and overall it feels like a well put together interior. All this while still feeling divey enough to feel at home.\n\n4) Trivia night! Every tuesday there is a fun trivia night with free food, fun times and prizes to be won. (Guess who won this week? That's right, we did.)\n\n5) Whiskey saturdays. Discounted whiskey all saturday, every saturday. Can't go wrong with that.\n\n6) Best of all... BOX SHOTS! This fantastic option is what got us hooked and keeps us coming back. They have a box of 12 mystery bottles and everyone chooses a number and then you get $3 shots of whatever you chose. It's fun, it's interactive and it adds a great element of surprise.\n\nOverall, Bar Basic is a great bar that I can't recommend enough.", "author": "Mark O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-16", "description": "Chill bar one block away from the Caltrain SF station, good spot to kill some time while waiting for a train. Happy hour deals last till 9pm weekdays which is unheard of. On a Friday after work, the bar never got too busy or loud.\n\nNot sure what to make of the ambiance, the seats were modern, whereas the bar had a lot of busy signage along with a tacky curtain. Almost gave off a dive bar appearance but I'd say the place was a former dive turned around.\n\nThe drink menu has a focus on cocktails but I just enjoyed the tap beer selection. New Belgium's Ranger IPA for $4 during HH!", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "I'm a big fan of this place.\n\nI came into Bar Basic with a couple of friends during this year's Giant's post-season run into the World Series. We actually ended up here because the line at Pete's / Pedro's across from the ballpark was ridiculous..and they were charging a $10 cover. No thanks!\n\nA couple blocks up from King St., Bar Basic is a nice getaway from the crowds. No cover. Chill ambience. And oh..RALLY SHOTS!! $3 shots of selected liquors when a runner is in scoring position. Lucky for us, our SF Giants were delivering, which meant discounted shots of Jamey all night!\n\nWhat else was great? \n-Popcorn provided during the games\n-You can order an outside pizza for your group\n-HapaSF truck right outside the door (get the sisig tacos)\n-Box of $3 mystery shots all night \n-4 TVs and the game projected onto the wall\n-Comfy seating\n-And want to cuddle with your pup while watching the game? Bring her / him in too - no problem\n\nWould I come here now that the Giants season is over? Hell yes! It's a great spot for a night out with a few friends, for a date, or even a drink after work. I would definitely consider having an intimate birthday party here too.\n\nBar Basic, I love you.", "author": "Camille B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Bar Basic never does me wrong! Decent drinks and prices (especially during happy hour), free popcorn, chill ambience, great music, still need to do the mystery shot game, but all in all, I love this place. Plus, my second date with my boyfriend was at Bar Basic...almost two years ago...memories! ;)", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "A good spot that I guess is only \"basic\" in terms of hipster craft beer bars. Nice staff, nice space, not too crowded for a weekend night. I  came here after the Billy Joel show at nearby AT&T Park let out. The neighborhood is still pretty sparse at night when there aren't concerts or Giants games at the park, but places like this are helping it grow. \n\nI didn't see the SNES at the bar. If only I'd known.", "author": "Seth G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "Just came here to grab a beer with a friend to catch up. Did not know it was trivia night on Tuesdays here. Kind of wish they had a space for those to sit that didn't play trivia because it got kind of loud when they played music trivia. Service is decent here. They do have cocktails, but I just stuck to the beers and got a kolsch. Also, I guess they allow dogs in here because there were a few dogs looking kind of sad and bored during trivia night.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Fun place for trivia. Trivia was pretty easy. Wine and beer is reasonably priced. Good. Beers on tap. House red was solid.", "author": "Adidas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Great bar with a fun atmosphere. Cheap happy hour beers and cocktails make it a great watering hole for me. I took a bartending class run out of the bar during the day and on Monday nights as part of the program I can work behind the bar to get experience!\n\nFantastic place, highly recommend!", "author": "Alex H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-19", "description": "2.5\nSOMA bar for locals---around the corner from the newest club, and rowdy loud!!\n\nBesides randomly running into someone I knew of and making his acquaintance, this place is just too loud and raucous for me. Loud, as in getting crazy volumed. Glasses were broken on the floor from the inebriation, and I was chomping to make a B-line for the door.\n\nOne can play video games here on the side (alternative to darts), few large screens up and playing, a video jukebox up on the wall....\n\nDrinks were fine, though. Thank god the barkeep didn't ignore.", "author": "Jana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "We love Bar Basic. We love DJ Tommy and him allowing us to choose some songs, we love the random taco events where you get free tacos for buying a drink, and we love the prices.\n\nMost importantly, the venue does not ever get too packed. It's a super chill spot where you have space to breathe, talk to your friends, and order very value-priced drinks. Each drink is only like $4-7, and it's made well.\n\nDJ Tommy (b/c of Beatport) makes some pretty good old fashioneds. If you get bored, you can also play on the SNES. Convenient location, really well priced drinks, and overall 1 of my the top spots for me in SF.", "author": "Albert K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "Bar Basic is exactly what it's named - your local bar with a few touched up cocktails and fancy cups, but nothing out of the ordinary. Lots of cushy booths and chairs to hang out on, never too crowded, and bartenders that are friendly and helpful - what more could you ask for? Prices are a little high, but it is right next to the ballpark and Marlowe and Cockscomb, so I wasn't entirely expecting anything less. It's not a dive bar for sure because they've got lots of fancy cocktails and a couple of flat screens to boot, but nothing to write home about here. Draft selection is minimal, so just pull up a bar stool and kick back while watching the game. Good place to wait out a wait at Marlowe or Cockscomb. Oh yeah, they have twelve bottle of well liquor in a wooden box on the counter behind the bar. You pick a number between 1-12, each one corresponding to a certain bottle, and you'll get a shot out of that bottle for $3. Solid deal. You'll thank me later.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-26", "description": "DOGGIE NIGHTS ON TUESDAY NIGHTS! YES!!!\n\nthis is a cool place that I've walked by on plenty of drunken nights a couple years ago when the Grand was the place to go.\n\nHowever, my coworker brought me here on a Tuesday after a work event and it was so fun! The doggies were adorable and you play bingo or something? Unfortunately I got there after all the games, but if you love a chill night hanging with friends and doggies, this is the place to go. \n\nWhen I move to SF, I'll def bring my pup here.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Bar Basic is a unique bar. The local bar has a ton to offer. From the happy hour that lasts from 4pm to 9pm to the trivia nights on Tuesdays. \nThe owner Mike knows his customers and accommodates all their needs. He will host your private event including renting food trucks to fill those beer filled bellies, to selling full bottles to individuals. Wait what happens if you can't finish your bottle? He and his staff will lock it away in the Vault for safe keeping until you return to finish it. \nBut one of the best parts by far is the Bartending school that calls Bar Basic home. SOMA Bartending has classes there every weekday and weekend. The students that complete the course even get to sharpen their skills on Monday nights for student night behind the bar. \n\nWow! Bar Basic has something to offer everyone. \nSee you there!!", "author": "Jeremy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "This place is the perfect balance of chill and turn up. The turn up is on your own accord as you can download Rockbot and control the music that is played. Make sure you get your friends to download the app as well because priority goes to the song with the most up-votes. \n\nThere's also a \"box of shots\" that offers $3 shots for a mystery shot. You just have to choose a number between 1-12, and the pairings switch every hour so it keeps it fun. \n\nIt's a small spot and not too crowded, hence the chill. The turn up is up to you, so bring the party.", "author": "Kristen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "This is a really nice bar with great happy hour prices...\n\nIt's good to know this place exists. My workplace is just down the street so that rare time my husband and I can get out without the baby it's great to know this bar is an option. \n\nWe stumbled upon this place on Yelp, of course. And all I know is for $16 we got two beers and two shots. I think that is a great price! They do this fun thing where you pick a random number from 1-10 and they give you a shot of whatever alcohol correspondes to the number. \n\nThey also have plenty of televisions that play sports, however this is a really loud bar for being such a small place, so keep that in mind. \n\nThe only reason this place is getting minus one star is the bartender's \"bitchy resting face\". She just didn't seem to want to be there which I can understand but she just had this look on her face the whole time that started to make me believe she had something stinky on her upper lip.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Great place to stop by before a Giants game. About a ten minute walk to the ballpark, and parking seems to be slightly easier (6pm expiring meters). Their happy hour is not bad, either. I went with the $4 (pre-tip) Anchor Steam in a 16 oz pour. Tasted a little bitter, but I don't drink the stuff regularly, so maybe that's intentional. Not sure why some people refer to this as a \"dive\" bar, I've been to plenty of those and this certainly doesn't fit the bill. The only quality it shares with some of those dubious establishments is climate; as inside it's quite cold sitting at the bar. They have a decent amount of room, although it's narrow. There's bar seating on the right and then some lounge-like tables/seats on the left. This place must draw a decent work crowd, because after 5pm, it got pretty packed. But the one bartender was very good; no one seemed to have to wait too long for service. There's also a Doblet phone charging station at the bar, not sure if it costs money or not. Seems you can charge your devices at least 4 in a clip if your running low on battery. Thought that was pretty cool, as I've never seen that at a bar before. I only went with one libation, but would be back (probably just to get beers, their cocktails didn't look super appealing, but they do offer more than just Rum and Cokes) if in the area or heading over to Los Gigantes after. Also have TV's for sports inside and one of those digital jukeboxs (somewhere, couldn't see it when I went) for music. And having a urinal in the men's bathroom as well as the actual toilet itself? Solid.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Had an amazing time at Bar Basic! The drinks were absolutely wonderful and Jeremy is so cool! He will make sure you have a great time. It has a great atmosphere. I would definitely recommend to anyone who wants to grab some good drinks and have a great time!", "author": "Quynh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "Enjoyed my HH martini, but I loved my 35oz beer for ~$10. I think just one of those IPA's would keep me satisfied for a night. \nIssues - seating along the wall is all connected. I think I'd prefer more small tables surrounded by chairs in order to accommodate more patrons. But, the place was still nice, fairly quiet and really amenable to bringing outside food in.", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "This spot is an ideal place to call in on the way home from work. Two blocks from 4th and King CalTrain station and a happy hour that runs until 9 make this place really appealing. I have seen it super busy and also completely empty around these times, which I have noticed depends on local sporting events. The only thing this place is missing is some kind of bar snacky type food, it'd round off the experince.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "AND WE ARE ON A GOOD ONE\n(4 stars)\n\nIt's a bar and it's more than basic.\n\n- great atmosphere \n- clean and not packed\n- lots of TVs and couches \n- nice stocked bar\n\nI enjoy intimate cute bars that don't classify as dive and don't classify as a club. It's a lounge/bar and I love going to this place. \n\nWhat a day out!!!\nHaving those silent connections of curiosity, multiple glances across the tables from opposite ends, and random high fives throughout the game... We didn't want the evening to end so early. So we mobbed from bar to bar. It's been 10 years since we dated. Much time has past, lives are different, we curious. Last time we had crossed paths was when my x started treating me like crap, i went out with friends and got drunk. He was at Jones when we crossed paths and asked \"where's your bf\" then kept me company all night, walked me to my car, said sweet nothings to me, made sure I got home safe, and told me I deserve someone better. I been so faithful and loyal to one person when I should have been looking up to see better. Better looking, better in bed, better financially, better personality and qualities, better job, better EVERYTHING. Until we meet again.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-01", "description": "Bar Basic is a little divey, a little hip, and can get pretty crowded. This bar is definitely a go-to for those that work in the area, and want to blow off some steam. The drinks aren't strong enough (I asked them to add more alcohol)  and the bartenders were warm, but not as friendly as at other bars.  I would go back again, but if the drinks were as light as this time, I wouldn't stay.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "This place is great! Free Trivia and food every Tuesday! Great bartenders and great owners. Very close to Caltrain and the Ballpark. They have a back patio that you can use to have a quick escape of the bar gets crowded. They have nice seating and tables. \n\nPET FRIENDLY! Bring your dog!", "author": "Casey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This place is amazing, the bartender Stephanie is a really great person. The drinks are very affordable, you need to visit when you are in SOMA!!1", "author": "Jamal B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "Basic bar is how this should read.  The coolest part about this place is the tube television at the end of the bar with a Super Nintendo hooked up and Street Fighter on a constant loop.  I could play that game forever.  Instead I paid $7 for a happy hour cocktail (could've been the personal liquor request) and sat by my lonesome at this empty bar while the bartender mulled around cleaning and organizing.\n\nI'm sure I'll be back but it'll probably be a while.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "THE NICER ASIAN GUY WITH THE SPIKEY HAIR IS THE BEST BARTENDER!!!! This place is super chill & a good place to relax with friends. Also good to come after a Giants game! Definitely recommend. Wide variety of drinks & great service.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "I love this place. I came here with my bf on wed night as it 's nearmy hotel. not so many people, but such a nice space ,i love the music there too, beer is not too expensive, and we can talk as music is not too loud!!! i will be back", "author": "Mindy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-15", "description": "Continuation of the bday girls celebration was by making a stop at Bar Basic. After we left 330 Ritch which was around 1245a we walked two blocks up into this cute bar. This was my first time here and never knew this place existed until one of the girls said lets go here. \n\nBar Basic is a small venue but a cool spot to hang out at. Live DJ, playing hip hop all night but there was not a lot of room for dancing. NOTE: no dance floor. Thank goodness the place was not packed. Bartenders were really attentive and nice. We chilled there for 30mins and went home! What a night.. Exhausted!!", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "Now that I'm a Caltrain gal, going out in SF after work is getting to be a bit of a pain. If I wander too far from 4th and King or any of the BART lines, finding my way home to Burlingame is tricky. By the time I hail a cab to take me back to the station and wait 40 min-1 hour, I almost think it's better to just spend the extra $20 and take a cab all the way home. Bleh!\n\nFound Bar Basic on Yelp while looking for spots close to the Caltrain station, offering happy hour prices after 5 pm. Bingo! They have happy hour until 9 pm, Monday-Friday. When we stopped by last week, it was $1 draft beers, $5 martinis and $8 specialty cocktails. Not too bad. Bartender is also friendly and patient, pointing to the happy hour sign details every time someone new from our group walked in and asked, \"What are your specials tonight?\" Even if you're not buying discounted drinks, prices here aren't unreasonable. Had a glass of Pinot Noir for $7 or so, which I found to be pretty tasty. \n\nThere's nothing incredibly fancy about Bar Basic, hence the name, but it's not a shabby start from my adventures of bars/restaurants around this area. Am going to start a 4th and King list immediately!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "Great bar with friendly staff\n\nDon't forget to check-in to get a discount!", "author": "Kenji Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Always a good time at this joint. Some of the guests can get pretty rowdy. But comes with the territory of having beer on tap I guess. Overall atmosphere is safe and clean. My bartender Stephanie was very quick and thorough. Really lovely girl. Overall pleasant experience. I would definitely come back. They even have trivia night where you can win free drinks and other awesome freebies. Perfect for a night out with friends or a place to chill after work.", "author": "Ronald M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "I want to become a regular here. \n\nPros:\n(+) Amazing happy hour from 5-9pm with really cheap drinks\n(+) Divey ambiance but still really nice and not dirty or smelly\n(+) All the bartenders I have met so far have been really nice\n(+) Dog friendly!\n(+) Trivia nights on Tuesdays! \n(+) Their specialty drinks are really good \n(+) The Box of Shots - $3 for a mystery shot from a box with 12 bottles, and you choose a number and get that shot. \n(+) Multiple TV's so you can watch sports (or American Gladiator, whichever floats your boat)\n\nCons:\nN/A\n\nWe moved to the city about three weeks ago and have gone at least five times already. Love this bar.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-20", "description": "There's a $10 minimum on credit card tabs, which makes it a little too pricey for someone who wants to drink in moderation in their neighborhood bar.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Came here for happy hour. $5 martinis! Definitely worth it and will be coming back again for HH.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-17", "description": "I went to this bar on a Saturday night and it was pretty empty which was super nice since my friend had just gotten off a long flight and we just wanted to go grab a drink somewhere low key and didn't want to have to scream at each other over the loud beats of Justin Bieber or some other such artist. Apparently it gets pretty packed Mon-Thursday though, per the hot bartender man with a sexy & über-fierce ginger beard.\n\nMusic selection was decent, drinks were stiff and scrumptious (thank you, hot bartender man:)). All in all, lovely place. Will most definitely come back next time I'm in San Fran", "author": "Saina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-25", "description": "BEING A LUSH AIN'T CHEAP\n\nYes, admittedly I'm a lush. Please don't get that confused with an alcoholic. Alcoholics romance the bottle before they sleep and when they wake up. I, on the other hand, believe in working hard and playing harder. If you're a lush like me, I'm sure you can relate to this. It's Monday morning and you check your account activity from over the weekend only to find something like the following:\n\n11.11.11 Bubble Lounge $52.19 \n11.11.11 Bubble Lounge $38.52\n11.11.11 Bubble Lounge $72.68\n11.12.11 The Grand $30.00\n11.12.11 The Grand $50.00\n11.12.11 The Grand $40.00\n.....\n\nAfter said and done, you've spent nearly $300 at the bar/club. Unfortunately this happens all too often for me because in the midst of all the fun my friends and I are having, we lose track on whose round it is. Who cares when you're having so much fun right? Not until Monday comes at least.\n\nNeedless to say, when it comes to happy hour, I'm always on a lookout for deals to make up for the playhardonweekendsfmlmondays. \n\nEnter Bar Basic. Like its namesake, it's a simple, no frills bar in SoMa. Plenty of seating with 2 flat screen TVs to enjoy the game. There's an old school Nintendo system with Super Mario Bros., my all-time favorite video game. Talk about nostalgia. I like that Bar Basic is not overly crowded on weeknights though it's a different story on weekends when I've passed by. After a hard day in the office, there's nothing worse than having to dodge people and wait 15 minutes for a drink.\n\nWith Bar Basic's $5 Martini's during Happy Hour, Monday-Friday 4pm-9pm, it makes the lush in me rejoice! Pick your poison: Dirty & Neat, Cosmo, Appletini, Pomegranate, Peach, Mango or Chocolate Espresso. The Peach Martini was my poison of choice. My recession-friendly cocktail packed a big punch (no skimping on alcohol here) with just the right balance of sweetness and subtle tartness. With just three martinis, I was happily buzzed as opposed to the six I normally need. I've sadly trained my liver well.\n\nOn Tuesday, I noticed a cutie pie sitting all by his lone self at the bar. Too bad the cutie was a four-legged terrier mix. Shucks.\n\nOTHER NOTES:\n*$1 off drinks when you check-in via Yelp\n*Close walking distance to Coco500, Zuppa, Fringale, Alexander's, and Brickhouse\n*A food truck can be found parked outside on weekends\n*Super clean restroom\n*CC's accepted with no minimum", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "Stopped in before the SFG game,  cool vibe,  drinks at a Good price and super Nintendo!! Specifically NBA jam. One word, BOOMSHACKALAKA!", "author": "Ryan I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-03", "description": "Came to Bar Basic for happy hour on a Friday afternoon.  It's located only a couple blocks away from the 4th and King St. Caltrain stop.  They have a happy hour from 4 PM to 7 PM with $1 off drinks.  It was very crowded and quite loud in the bar.  There was hardly any seating and I seemed to be yelling in every conversation I had with my friends.  \n\nHowever, for the amount of people during the happy hour, the staff was very friendly and tried to service us to the best of their abilities.  Most of all, we called ahead of time to reserve a space for our get together and they even allowed us to bring in outside food for our party.  Not a bad place to end your work week if you're in SOMA.\n\nPro Tip:  There's a mystery box of $3 shots.  Just choose a number between 1-12 and you'll definitely get your night started!", "author": "Robert T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-31", "description": "It's a bar.  It's basic.  Happy hour wine is passable.  Bartender is on her phone any time she's not serving. That sums it up.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Great place! The bartender (Tou) was really cool. I ordered some margaritas and it was just amazing I really liked it! That's a nice place, pretty fancy and interesting cocktails! $3 shots happy hour... SWEET!", "author": "Lino M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "We come here much more often than I would like, purely because it's convenient.\n\nDon't ask for a cocktail that doesn't list every ingredient in the title.  Some of the bar tenders are good but the ones who are on right after work tend to be total newbies.  I had one girl who had never heard of a Old Fashioned.  Another girl took a $10 bill for a $6 drink and didn't bring any change back.  Dafuq?  Edit : Apparently these might be students, which explains a lot.\n\nThere are a few things that together help this place avoid a 1-star rating : it's very clean, it's cheap as fuck, it's never overcrowded, and there's an SNES for when you feel like really wasting time.  Edit : They get bumped up to 3* because they want to improve.", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-20", "description": "The BF and I were lured in a few Thursdays ago, being great appreciators of happy hours...\nI ordered a Moscow Mule and the bartender forgot the lime. It's a drink with 3 ingredients that (though it shames me to ride the wave of popular culture) is uber trendy right now - how can anyone not know how to make this?\nThat said, whatever, I'm not even much of a cocktail person so it's not a big deal whether my drink was made appropriately. But, I ordered the cocktail because their beer selection was SAD. \nDrink offering aside, I just don't really get this place. It's very lounge-y. But, also very well lit. If I wanted to hang out in a place with couches, lighting I could read a book by, and badly made cocktails, I could just stay home. Am I just not the target clientele?", "author": "Brooke T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "They have a Super Nintendo in here...  COOL!\n\nI came with my girlfriend, and we had an Old Fashioned.  They actually have a very competitively priced happy hour here.  Plus, dogs are allowed!  A dog walked over from the other side of the bar to say \"hello\" and sat on my lap.\n\nDon't forget to use your MOGL account here.  You will get 10% off of all drinks.  Also, if you check-in to Yelp, you will receive $1 off your drink.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-11", "description": "I go pretty often since it's just across the street from my office. Drinks are ok (half of the list is bad, half is good, they should do some quality controls on the recipes) but the place is so freaking loud that it's impossible to have any real conversations, which makes it a bad place to hang out.\n\nEven if I wanted to hit on a girl, the situation would be pretty comical (a complete stranger screaming at your face is not attractive).", "author": "Luca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "It is exactly what is say's it'll be - Bar Basic. It's not over the top, it's not pricey with fancy drinks, it's basic and it gets the job done. They have happy hour and an app - Rockbot - that lets you pick music like a jukebox. Stephanie at the bar is awesome!", "author": "Leina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-21", "description": "If you're looking for an intimate lounge bar for a casual birthday affair - Bar Basic works. \n\nBar Basic works because they're so under the radar in their location, that there seems to be a steady crowd of about 2 or 3 people on any given night. You could easily throw a laid-back party here with a gathering of close friends, and not have to stress about rental costs and bar minimums.\n\nThere's nothing particularly compelling about Bar Basic. They can easily accommodate about 50-75 people comfortably. They have casual chic seating, and a pleasant long booth area, which stretches down one whole side of the place. They have a solid bar. They feature three big screens (each usually playing something different), as well as a Nintendo system (Mario Bros, and Duck Hunt). And on most nights play host to a DJ.\n\nBut that's about it for Bar Basic. They got the basics, and...yeah. Despite having the place pretty much to ourselves this Friday, we ended up leaving after an hour. We left in search of a more lively bar with more interesting people watching, with a little bit more soul, and with a little bit more get-go in it.\n\nBar Basic is fine for quiet nights, especially if you bring the crowd, but if you want more action and personality in your evening, I'd suggest a slew of other spots first.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "I like that bar basic isn't trying to be the next hip thing in the SOMA.  As the name implies, this is a simple bar replete with uncomplicated drinks.  The clean decor creates a loungey atmosphere --perfect for having an easy conversation without the eardrum-popping music in the background. Their short cocktail menu includes old school cocktails: old fashioned, manhattan or a gimlet for under $9. I'm happy with just a plain Tanqueray & Tonic and the lady bartender made my drink with a smile. \n\nIf you're in the hood for after work drinks, bar basic has $5 happy hour martinis (calling all apple martini and cosmo lovers!) on weekdays from 5pm-9pm. The best part? the taco truck parked right outside the bar!  Takorea is here til 2am on Saturdays.  Why stumble around looking for gross pizza when you can have gourmet tacos? \n\nExactly.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "So-so sports bar with an average beer and food selection.  The bar's design is very open which kept it from being stuffy on the inside.  I was there to watch some sports and most of the tables were within good viewing distance of the large TVs spread out all over the place.\n\nWe left after the game ended.  Given the competing bars in the area, I'm unsure if I would come back as my experience was average.", "author": "Roho M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-09", "description": "Divey, sports bar-ish feel. Drinks are reasonably priced. Would've given a higher rating, if not for the fact that I found a bug in my drink AND when I went to the bartender to get a replacement, she made a face at me and didn't look happy about it. Like it's my fault that the bug decided to fly into my drink...", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Fantastic little bar close to the CalTrain. Perfect for after work or a quick drink before catching the last train. Also, they have a great happy hour from 4p-9p everyday!! Talk about awesome.\n\nThe Shot box is a fun game with friends. Its 3 bucks and you just pick a number and make your friend drink the random shot. Definitely my type of game. Their Larceny cocktail is fantastic as well.", "author": "Logan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-21", "description": "Solid spot for a drink. Nothing mind blowing that sticks out, but they do have some interesting happy hour specials sometimes.\n\nIn the middle of SOMA, it is always nice to find a bar because things can be very hit or miss in that area. Bar Basic does happen to have some great seating options for larger groups, which is a nice attribute for sure.\n\nThe atmosphere is pleasant and the bartenders are nice/helpful. However, music was a bit blah on my last visit.\n\nOverall Bar Basic is a good place to grab a drink after work.", "author": "Justin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "Excepting the uninterested bartenders, Bar Basic is a great space to meet new friends, catch up with old friends, and get drunk CHEAP.\n\nMy friend and I arrived for a farewell party for one of our friends (who we had met last week at SantaCon, how awesome is that) around 8:30ish. We walked in to a 75% filled capacity room, bar on the right and couches and tables on the left. Bathroom is in the back, holla!\n\nChristine B. sums up the perks of this place quite nicely, so before I got there I knew what I wanted to get: $3 MYSTERY SHOTS. They have a crate full of random bottles of alcohol \"numbered\" 1 - 12 (my friend suspects they only have 8), and when you order, you choose a number and the bartender pours you a huge shotglass of whatever the heck they pick up. One friend ordered our group's VIP mystery shot #1 while I ordered him #2 and #3, and the VIP said that two of them tasted exactly the same...good thing it wasn't a nasty repeat! Also, from my friends who went through a good number of the mystery box, they recommend going for any of the shots that are brown-colored. From my experience, that could be number 1, 2, 3, 6, 7, and/or 8. There is also a light pink/lavender one that tastes fruity, which is #6, 7, or 8. Sorry, we bulk-purchased that night :| But our goal was to have our VIP go through ALL 12. Unfortunately, he only went through 8. But if our conspiracy theory is correct, there ARE only 8...\n\nYelp check-in gets you $1 off any beer or cocktail. Drafts beers including Stella, Anchor Steam, Sierra Nevada, Widmer Hefeweizen, Coors Light, and Pyramid Thunderhead IPA. I bought my friend a Widmer Hefeweizen, which was originally $5 but came out to $4 after the Yelp offer yay! Although, I bought her the beer during happy hour, and $5 might have been a promo price? Unsure.\n\nHappy hour is Monday - Friday from 4 - 9 PM, where martinis are $5! They have a variety of flavors: Cosmopolitan, appletini, pomegranate, lychee, and more! My friend got me a Cosmo, which was too sweetly sour for my tastes. And strangely enough, they offer boba in your drink for $3 more, if I remember correctly. BOBA AND ALCOHOL!? My friend and I were too chicken to try it :(\n\nbtw, a \"Dark & Stormy\" is rum & beer. It made me feel dark & stormy--gross :( And a shot of Jameson whiskey is $8. Wine runs you $8 or 9 a glass.\n\nThe music is actually chosen by you! The bar uses Roqbot, a mobile app driven song selection service that uses votes to determine what songs to play. If you really want to have the power of the night's music in your hands, I'd recommend downloading it beforehand ;) Here's some more information on that: http://allthingsd.com/20120612/google-ventures-backed-roqbot-lets-you-rock-the-jukebox-from-your-phone/\n\nRandom: I hit one of the bar stools and pricked my pointer finger! It started bleeding pretty fiercely, so I slapped on a bandaid (I'm always prepared) and then turned the debacle into an avenue for amusement when one of my friend's friends tried to Hello-Kitty-ize my bandaid lol. From my friend's POV, it ended up looking like a hairy butt HAHA.\n\n$10 minimum charge on credit cards. Get around this by buying mystery shots for you and 2 friends...or all 3 for one friend hehehe. Also, there are coat hooks UNDER the bar. Crazy! Just remember to grab your coat before you leave!\n\nFYI: Street parking is free at night! I'd recommend scouting near the Caltrain station for spaces ;)", "author": "Adele F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "This is a great place for happy hour. It's quiet and will allow you to relax, and the $5 martinis will knock you out. And if you want something else, the bartender is very knowledgable. \n\nI like that it's not too busy. You can actually get a comfy chair, chill out and have a conversation. And food trucks come by!!!", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "The name speaks for itself. It's a very basic, no frills bar with some of the tackiest decor imaginable. An awkward mix between a sports bar and an upscale lounge.\n\nI came with a group of friends on a Friday evening because this was the only bar in the area aside from Alchemist. To our surprise, there was only one other group there. The entire place was deserted. Kind of strange, but understandable due to their location. \n\nService was quick but nothing special. The bartender looked like she didn't really want to be there. Once we presented Yelp check-in offers, she became a little bit more disgruntled.\n\nDrinks are mediocre. All of their \"specials\" that are on the board are pretty standard drinks. They have a great selection of liqueurs on the wall if you're going for something on the rocks. \n\nIf you're in the area, you might as well check it out for a drink or two, but I don't think it's worth going out of your way to explore.", "author": "Dmitriy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-13", "description": "What a complete waste of time. Supposed to be open until midnight, showed up at 11:20pm and kindly tried to order a drink and was told they were closed despite full pints at the bar. Was told could only order if could chug my beer in 5 minutes. So rude, so terrible. Sad because had high hopes.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-04", "description": "My goodness. I definitely give credit to Bar Basic for some awesome times, but i also blame it for the subsequent death of my liver. the location is pretty good, it's far enough from the ballpark that it's not crowded as hell, but still close enough to be walking distance. the venue is not too large either, but perfect for about 100 people.\n\ncheck in on yelp for $1 off drinks!\n\ni watched a majority of the SF Giants playoffs/World Series here with a couple of my girlfriends.  it didn't help that Mike handed out free shots of Jameson to the entire bar when the Giants beat the Reds to go on to the World Series. it also didn't help that he popped at least 6 bottles of champagne for the sole purposes of showering people with it when the Giants took the World Series, but hey the Giants are the champs and you gotta do what you gotta do :).\n\nother things I like:\n- DJ BOOTH at the top of the stairs!  Swear I heard gangnam style at least 3 times.\n- Free popcorn!\n- Super Nintendo at the end of the bar!\n- Large projector on the wall when the bar gets crowded so there's always a  view of the game!\n- MYSTERY SHOTS - you pick a number from 1-12, and you pay $3 for a shot of the corresponding alcohol (you aren't allowed to see what number is which alcohol).\n\nGood vibes, good service, good deals, good drinks, some not-so-good hangovers.", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-06", "description": "Bar Basic is the best bar in the Mission Bay area! Its a chill spot, recently remodeled with comfy seating, and three large flat screens to watch your favourite sporting events! Its walking distance to AT&T park so its nice to go before and/or after the game. \n\nTheres a great beer selection... on tap, bottled, and even canned (giant PBRs!!). Lots of tasty cocktail selections... my fave is the Pom-Tini.. cuz they use a special pomogranate flavoured liquer/syrup that is naturally delicious. Food trucks stop by often, which is awesome because I'm always hungry!!!!  And sometimes I not-so-secretly sneak in 100 chicken nuggets at a time. :)\n\nThey have cool events all the time... Sam Adams, Stella, Rokk Vodka, Harlem to name a few. And its a great place to host an event, be it bday party or work celebration. \n\nThe bartenders are all amazing and music is COOL... They even play Justin Bieber!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  :)))) Baby!!OOOOHHHHH!!", "author": "Bobbie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "I really enjoyed my short time here at Bar Basic. I got here when not a lot of folks were around, so I got a little more attention from the bartender. Not to mention the bartender was super nice! He actually smiled and seemed to care. It's amazing how much a little smile can brighten up anyone's day.\n\nI had two drinks here: the moscow mule and the lychee martini. The lychee martini tasted like it had virtually no alcohol in it. That would have been nice, but it also tasted a little diluted. I wasn't the biggest fan of this. The moscow mule was pretty good, but I always wish they would put it in a copper cup like it's supposed to be. I still appreciated the drink, though!! Good stuff.\n\nThere is a lot of seating and the ambiance is nice. It's a really nice place to chill after work if you actually want to talk and not just yell at each other. I would recommend!", "author": "Jade R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "It lives up to the name: no unnecessary frills. If you want to hang out with your friends and have a drink (or a few) I'd say this is a great place to spend your night or begin a night. The few times I've been here on Friday/Saturday nights - the place oddly clears out at 10pm when people start heading out to the clubs. \n\nThe highlights:\n\n$3 mystery shot box - you can count of this for a night of trouble. A group of friends and I went through the entire box mystery shots one night. At $3 a shot - how could you resist? The shots rotate out and generally aren't the same each time because the bartenders put things in there at random, but you get a pretty wide mix of liquors (mostly well level):  chocovine chocolate wine, three olives vodka, smirnoff, seagrams, but be prepared to get some funky flavors!\n\n$1 off drinks with yelp checkins\n\nFriendly bartenders \n\nHappy Hr: $5 martini's 4pm-9pm M-F\n\nSeating along the bar or sofas/chairs around the bar. It can get packed in here sometimes and a little snug and loud though - so if you're looking for intimate and romantic this isn't it! \n\nno credit card minimum. \n\nAlso -- all the shot glasses here are the huge ones -- so if you're planning to play a cruel joke on someone and buy em a blow job shot glass - you're in for a hilarious moment.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-29", "description": "I can't believe I've never review this place! We normally come to Bar Basic at least once a week as it is normally a low-key nice place to catch up with friends and hang out without SoMa-ness all over. We've ordered pizza a couple of times when the taco trucks aren't outside which was cool with the staff. We have kind of made bar basic our \"Cheers\" amongst our 6 closest friends.. it is our go to place.\n\nMike the owner/bartender is the nicest guy and always has a smile on his face. He recognizes us all the time and even comps a first round of beers every now and then.\n\n*Definitely check out TaKorea and Hapa when they are parked outside.. great variations on tacos and decently priced*", "author": "Seema M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "Great bar with very affordable drinks. Happy hour I think was from 5-9pm. We got there early on a Saturday night and there was plenty of room for our large group to sit together and mingle. \n\nBar was too warm when we first walked in, but it was a warm night. Nice bartender with generous pours.", "author": "Nicha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "This is a kick ass bar. \n\nWe walking into the bar while waiting for our reservation at Marlowes restaurant.\n\nIts a pseudo dive bar that semi swanky. Very low key, dim, and good music.\n\nThe martinis were great and prices were reasonable. It wasnt packed, so I was able to order drinks without having to muscle my ass in between people to get the tender's attention. \n\nI love these types of bars.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-28", "description": "Good neighborhood bar with usual drinks and friendly service.  Came here after Lusk closed to have one more round.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "I am a really big fan of anything close to Caltrain. Bar Basic doesn't disappoint. It has a happy hour from 4-9pm. That is amazing! I got the peach martini for $5, steal! Besides having a happy hour the best things about this bar are how clean it is and the selection. In the age of dive bars, I love to find a bar where I'm not afraid to sit down! Regarding the selection, as I was enjoying my happy hour drink u noticed a surprise on their wall of booze. They had Chairman's Reserve! It is a rum from St. Lucia! St. Lucia typically only ships to the UK so it is really hard to find it in the US....when I say hard, I mean that this is the first bar in a year that I've found to have it. So excited!", "author": "Kari G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-26", "description": "Why did they bother remodeling this place? It looks disgusting now. I used to love the artsy lightbulbs above the bar but now they've been replaced with generic lights. The tables slide all over the place and the chairs aren't comfy. What a terrible lounge.\n\nThe drinks are pricey and watered down. They have a small menu of basic drinks and I overheard a customer ask one of the bartenders what was in one of the drinks. He had no idea and offered to look it up but the guy just told him to forget it. How would you not know the drinks your bar is serving? \n\nDon't even get me started on the DJ. He was situated in a corner, facing a wall. He was just standing there pretending to be doing something while blasting some God awful music. \n\nThe bartenders were all over the place and it was hard to get a drink. The crowd is always horrible here but don't worry, most of the time it will only be you there. \n\nThe only plus is the taco truck outside.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-24", "description": "Me (after making the reservation over a month in advance): \"I just wanted to make sure we are set for tomorrow.  According to RSVPs I've got a little under 30. Did you need me to call you with my credit card number?\"\n\nBasic: \"We are all set for your party, but I noticed a scheduling mistake.  We had put it down for a 9pm start to close, but now I realize that it was for 6pm-9pm.  Could we push back your party to a 730/8 start time?  My partner scheduled a private party from 4p-730 on the same date.  Please let me know.  I can throw in a couple bottles of Nuvo for you and your guests.\"\n\nBar Basic that's a huge scheduling mistake and not cool, especially since this mistake was only discovered the afternoon before the event.  I was looking forward to celebrating but seems you dropped the ball.\n\nNote to future planners: Check in with them a week in advance.  Luckily I have pretty low key demnds and could move elsewhere.", "author": "Sharlene C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "Worst Aviation cocktail ever. The bartender made it neon purple and tasted absolutely horrible. Seemed like a very inexperienced bartender. When I went and brought it back to complain she charged me fully for an exchange cocktail. I would absolutely never recommend this bar, there are way better bars to go to in this city with much better bartenders.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Tuesday nights is Trivia night!  And this past Tues when I went, it was free Jack Daniels day!  Meaning any drinks with Jack was free - so jack and coke all night long!  (Don't forget to tip your bartenders!)  And they usually have goodies such as dino nuggets.  And they allow outside food in.  I was the fat ass and brought McDonalds fries in.  It's a really chill place.  Everyone is really nice.  Kind of a small space but a really great spot for groups because they have tables and chairs that move.  I highly recommend!", "author": "Tammy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "I have been to this place a few times after work. Usually late and only had time for one beer. Today was no different, place was less than 1/4 full, and it took more than 4 minutes to even get acknowledged from what seemed to be a very disconnected manager and staff. Glad I only have time for one, getting a second might be too painful. For them or me...", "author": "Glenn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "Strong ass drinks. I love it!\n\nBar Basic has turned into my stop whenever i'm taking Cal Train back to South Bay from the city.  This place has a great vibe, good happy hour deals and friendly bar staff.  Check out Coco500 next door for a pre or post drink meal.", "author": "Sunny C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-10", "description": "Went there for their grand opening event...this place is basic at best...\nPerhaps there's still work in progress...may check it out again in a month or two...", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "My BF and I just hosted a NYE party here and we couldn't have asked for a friendlier venue. \n\nJust 2.5 weeks before new years we decided we wanted to host a party. Fortunately Bar Basic was available and with only a $1500 bar tab minimum for a 120 person capacity space it seemed like a perfect fit. One of the owners, Mike, was extremely helpful. He was organized, responsive, and obviously experienced in party planning he seemed to know exactly what we wanted. Renting the bar for NYE included champagne toasts for all our guests, favors like party hats and noise makers, a DJ, and couple of awesome bartenders - what more could we ask for?  \n\nThe night of our event we were able to arrive early to set up decorations and the Bar Basic staff were super accommodating letting us even choose the lighting dimness and music volume. Our party happened without a hitch and guests left thinking highly of the bar. Drinks were strong, music was good, people were happy.\n\nI would definitely recommend Bar Basic to anyone who wanted to host their own event.\n\nAnother great thing about Bar Basic is its location, it's easily walking distance from CalTrain and BART which is perfect in situations when happy hours may get a little too crazy.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "I love this bar!  If you told me that I could sip on martinis in a lounge bar and play super Nintendo, I would laugh in your face.  But it is true!  this place is a gem!\n\nThe bar also has a cool \"dj\"/jukebox feature where you can download an app called roqbot and influence/add songs to play!  Total control = awesome!", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-03", "description": "Music is way too loud. If they lower the volume I'll giv them 4 stars cus it's close to my house.\nWe asked the bartender if it was usually this loud but they said it was cus of the DJ. Stupid. Songs suck too.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "-Great extended Happy Hour specials (4pm-9pm)! \n-Good sized venue, nice and simple in décor and ambiance. \n-Not pretentious or divey (not that I have anything against dive bars). \n-Friendly bartenders, video games and an interesting online jukebox. \n-Again, they offer great Happy Hour specials that seem to alternate; one of which is often a Brugal special which I'm a big fan of! \n-Oh, and popcorn! \n\nI dig it, glad to have Bar Basic as one of my after-work neighboring bars.", "author": "alexa c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "I'm upset that I didn't find this place sooner.\n\nThis comes pretty close to being a perfect bar in my opinion. \n-The happy hour prices are great. \n-It has the friendliness and vibe of my favorite dive bar without being dirty. The decor is modern and clean. \n-Fresh bathrooms.\n-The giants game is on.\n-Hip music\n-FREE super nintendo. I relived my elementary school days with mario kart, super mario, and street fighter 2.\n\nThe only thing that could make this place better is a buck hunter machine. Oh well...like the Giants, you can't win them all.", "author": "Siao W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "Honestly, the only time I recommend this place is if there's a baseball game and you are around the area.  \n\n- Drinks are cheap.  One of the very few bars around the area that still has a happy hour even during baseball games.  $5 Martinis!!  \n\n- Not super crowded and filled with obnoxious baseball fans and out of towners.  \n\n- Walking distance to a bunch of food places.  Atleast you have a places to eat to while you're sobering up.\n\n-  You can play old school Super Mario Bros while waiting in line for the restroom.\n\n-  It's super chill and laid back.  Plus there's a back patio for all you social smokers.\n\n\n--Can't complain--", "author": "Jacquelynne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "This place is a solid 3.5 stars. But every now and again they'll surprise you and be 4-5 stars.\n\nGREAT atmosphere. It's pretty chill here, and they have great happy hour specials even during game days. It's close enough to the park that you can stay until happy hour ends and still make first pitch. \n\nThe place tends to fill up fast if there is a game, so if you're meeting a group, snag a table and chairs as soon as possible. \n\nThe bartenders are pretty good. They make good drinks. However, if you're ordering a martini for happy hour, ask how much it is. I was under the impression that all martinis were $5 during happy hour--- and apparently that wasn't the case after I received my bill.\n\nThey also have food to go, which we were able to take into the stadium with us. On weekend nights they have food trucks parked outside, so you're good on the food. :)\n\nDefinitely a solid place to get your drink on.", "author": "Mar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "The larceny with bulliet bourbon is amazing. I like a place where bartenders have  personality. Not too busy when i'm there which is good cus i had crowded bars where i feel like a sardine in a can. You can get a good drink for under 10, long as they keep making it well ill be back", "author": "Linix H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "I get to do what? I'm in!\n\nIt was a friend's birthday and got invited to hang out with 5 hot women. I'm one lucky sob. Drinks were made according to each of the ladies taste, and even a few surprising ones. The ladies enjoyed the drinks while I chat it up with the bartender. Wait what? 5 women and I'm talking to the bartender? He challenged me to a match on the original Mario kart and street fighter. Damn right I'm about to smoke this dude. I use red shells and hadokens like a toddler uses crayon on a white wall. Player 2 wins! Who's got next? Oi in all the excitement I forgot about the cute Latina next to me. Two more shots of jameson with her and time to get my real game on.  So great drinks , good entertainment, and got a date next week? I love the value!", "author": "Q L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "I love Bar Basic because of Roqbot. As far as I know they're one of (only one?) bars in San Francisco to feature the jukebox startup. \n\nThey serve no food but if you stay late enough, a food truck pulls up front! I didn't eat anything from it but it smelled yummy. The drinks here are average, good place to come for happy hour after work or school.", "author": "Tatyana K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-08", "description": "So, I've managed bars before and know how things work, and totally respect bartenders and their desire to go home, but I also respect the customer too and this place doesn't do that at all. LAME LAME PLACE. \n\nWe can here on a weeknight for the first time a while back. We ignored the lame \"top 40\" music playing in the background and ordered martinis. Whatever. A drink is a drink. Then at 11:40 she calls last call and we ask, okay, what time do you guys close and we're told midnight. We asked do we have time for another drink. WE WERE TOLD YES.  Ok, that's enough for a last drink. Except it wasn't because we WERE ASKED TO LEAVE AT 11:50. Not only asked but angrily barked at by some guy I'm guessing the manager or someone who was annoyed that we were still there and actually asked us to leave before midnight. Hello, you just sold us a drink! If you didn't want us to drink it you didn't have to sell it to us!! \n\nI'm sorry but selling someone a martini and expecting them to chug it is ridiculous. We had no problem leaving at 11:40 which was why we asked if we had time for another drink. Either keep to your word and allow the patrons (us) to drink in peace until midnight (like you said) or just tell us, actually, sorry, we want to go home. No problem with that. But what they did was tacky. Go someplace that actually respects you as a customer. Don't go here.", "author": "Dee K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-18", "description": "This place is walking distance from the Caltrain station... And the ballpark really. I wasn't particularly impressed, but it is definitely cleaner than some of the bars I've been to.\n\nTheir drinks are a tad bit on the weak side and are somewhat expensive, but we also didn't have any of the specials. Usually there's supposed to be some video games you can play though, but it wasn't working/on when we got there.\n\nThey do have really nice couches and clean bathrooms though! That's one thing I've got to give them. Another gripe is that service tends to be a bit slow... Even when it didn't seem too crowded.\n\nGood place to stop for a quick drink though, and it's clean and civil looking enough that I wouldn't mind going back... But it's just not *that* memorable...", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Went to Bar Basic to celebrate a friend's bday and in tandem, celebrated the Giants win against Cleveland!  It was literally a win-win situation.  :)\n\nHad a freakin' blast!  The bar is basic (ha!) and the crowd was mostly Asian (surprise, surprise).  But as the night wore off, it was just the Giants' crew, and it was fabulous.  \n\nThe drinks were tasty and if I remember correctly, at about 12:30pm, we all started dancing like maniacs.  A battle here, crazy moves there.  Mind you, it's a bar with I think a DJ???  So we literally danced in the middle of a bar.  Whatever!   The music was awesome. I haven't laughed, engaged in interesting conversation and had that much fun in weeks!  Forgot how great it was to hang with positive, fun people.", "author": "Soo Jin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "My boyfriend and I had our first drink here two and a half years ago.  We've been inseparable ever since!  I don't remember too much about the service or ambiance, just that it facilitated great conversation, laughs and nervous arm rubs.  Lol.  Definitely a great memory.  Thanks Bar Basic!", "author": "Ronita J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "Great HH Specials\nFriendly bartenders\nNice relax lounge environment\nDog friendly\nComfy seating area\nWhat's there not to love about this place?", "author": "Eva Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-27", "description": "On Tuesdays they serve the Hapa Food truck in the bar. \n\nWith $5 martini happy hour and a small yet chill vibe. This isn't a bad place to kill an hour or three!\n\nThey have a Nintendo system with the Mario Bros and other old school games. I haven't played...but if I see Duck Hunt next time, IT'S ON!!!", "author": "Jay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-24", "description": "01.22.11\n\nWas here for a charity event this past weekend.  Place was crowded with do-gooders (I do feel better that my booze $ is going towards something good).  Impossible to get any bartender's attention.  Impossible to squeeze yourself to the restroom.\n\nDrink specials all night, if you get a chance to order.\n\nTakorea parked out front.  Big plus.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-12", "description": "Drinks are cheap, easy-going vibe, easy parking....unfortunately, no bar food but I went on a Friday night around 8pm and there was a mexican food truck outside!", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-15", "description": "Very basic...but friendly service, and $$ drinks - well worth the money.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "This past Friday, I found out I passed the CA bar exam. \n\nBar Basic is where I looked up my results.\n\nMost people told me to go home to check, but I choose beer over boxes of kleenex. It worked out!\n\n With it's laid back vibe, free popcorn, decent drink  selection, and awesome advent of ROQBOT playing excellent music, Bar Basic was the perfect place to basically \"bar\" into the state of CA (get it?? get it?? I know, too lame and too soon). \n\nGo to Bar Basic. \n\nDrink up. \n\nAnd for all you CA Bar takers out there-- use Bar Basic as a good luck charm when the big day arrives. You won't be sorry!", "author": "Yaamini R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "I've been going to quite a few bars recently.  This place is really interesting...it is always nearly empty and has a weird vibe.  It looks like half of a dark, classy bar that merged with a sports bar with tvs everywhere, and then a huge glowing screen for tetris, and you can watch couples who don't want to talk to eachother anymore playing video games, their faces illuminated in the otherwise pitch-black darkness.  But if you're on a date, if you want to catch up with your friend, and you basically want to be able to hear the person you're with and not looking to meet random people or be with a huge rowdy group, then this is the place for you!  Completely chill, cheap drinks, and very friendly and kind, yes I said kind, bartenders.", "author": "Terry K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "I go to this bar all the time. It's so relaxed and full of cool people. They do trivia sometimes which is a blast, have an nes if that's your thing but it's such a nice escape from the more crowded clubs in SOMA. It is a bit of a dive in case that's a deal breaker!", "author": "Jon K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "Bar Basic is a basic bar, imagine that, right? I sat here for more than an hour waiting for my husband to get off the CalTrain during happy hour. The $5 martinis and dog friendly interior made it very comfortable for me. There was a video juke box that allowed customers to use an app on their phones to choose the music. This kept me entertained while I sat alone. It seemed like a locals place, as many of the patrons knew one another. A few talked to me and the staff was very friendly. I would go back if I make it to San Francisco again.", "author": "Stacie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "Came here for the $5 Martini Happy Hour.  I got the pomegranate martini and that was really good.  \n\nThe place is really chill.  Its a nice place to go when you want a few drinks, but not the crowd that comes with it.", "author": "Jacqueline P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "five pm caltrain arrival...a block walking and happy hour draft beer $four...weak cocktails $five...$one yelp check-in offer for regular priced drinks only...snes street fighter ii hooked up to old tube tv...challenge?...taking a modelo draft $four and another...friendly arriving for beers and cocktails...sticking to the modelo...modelo promotions lady arriving and passing out modelo samples...already drinking pint after pint of light and refreshing modelo...given another full pint for drinking modelo...non-crowded and fairly sparse in customers on a thursday after-work hours...good for drinks and original street fighter ii challenge...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-05", "description": "The couches are nice to sit on and the bar is pretty well stocked. The beer selection is somewhat lacking.\n\nI ordered a beer and my friend got the Mango Martini. The beer was fine, after all it's just beer.\n\nThe Mango Martini though was quite terrible. It didn't taste like Mango and they used some really cheap tasting vodka.\n\nOverall, it was an OK experience.", "author": "Colin Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-12", "description": "Good size, used to be my local, good happy hour, good music. I think when the first time I stopped in here, I didn't love it because of the layout - but if you're just looking for a good chill place - this is solid.", "author": "Mayur A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "Update: Nintendo is in service.\n\nAlso, Filipino food truck, when stationed outside; delicious.", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "I have zero complaints about Bar Basic. I went with a friend on a weeknight & it was the only place we could sit and talk in the neighborhood without crazy March Madness crowds destroying the ambiance. The beer was good, the price was right & I can't believe it took me so long to find this little gem.", "author": "Amber G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-03", "description": "Mike the owner totally rocks my socks off. He serves some mean drinks, and has some pretty sexy bartenders. \n\nGreat atmosphere, iPhone jukebox app (forget the name?), and they have NES. What more could you ask for? Food maybe? They got that... Taco trucks frequently visit this place. But if no taco truck, ask for popcorn.\n\nBar Basic, I love you long time.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "The crowd is laid back and eclectic, the drinks are strong and tasty.  I'm quite a fan of the Gin Gimlet.\n\nMy only complaint: TVs!  I hate them!  So distracting!", "author": "Tessa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-18", "description": "Some of my friends are regulars and after hanging out for most of the night last Friday, I can see why! Friendly staff, $5 cocktails during their happy hours, and pretty good music. It can get pretty loud in there during peak hours, but nothing too crazy.", "author": "Lily J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "I'll admit they got me with the alliterated name. It really says it all. Good service and all the basics.\n\nI work at a bar near by and this is the place I go to blow off steam. Ever since the first visit the bartenders have been welcoming and down to earth. Mike, J, and Brad make it a great place even when it's not busy.\n\nDemographic seems to run on the Asian side and lots of Giants fans. The place gets happening starting Thursday. Bonus points for when the Korean taco truck is parked outside. Only wish they had Guinness on tap!", "author": "iheartpie s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "Fantastic neighborhood bar.  I love stopping here for a quick drink on the way home from work.  If you take CalTrain into SF in the vening and then head home from there, stopping here is a must.\n\nAlso a great place to grab a drink before heading over to Coco 500 (right next door) or Zuppa (around the corner) for dinner.\n\nMy only complaint is that they get packed on key nights (Th through Sun) and I have a hard time finding a seat!  Otherwise they have it all--good drinks, the occasional food truck and friendly staff.  Oh. and they have roqbot.  Kind of cutting edge, imo.", "author": "Lynn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "Went here as a preparty for a friend's birthday celebration.\n\nPhilipino/Mexican Food stand outside has delicious spring rolls. You can bring the food inside where they have a long couch-type seating area and ottomans that you can move around and sit on as well as your standard seats at the bar.\n\nHappy hour lasts until 9pm. They have $5 martinis and $3 draft. I got the pomegranate martini and it was tasty and strong. You must try the Shot Box! Chose a number and they give you a mystery shot based on your number! for $3!\n\nCool unique features: download the roqbot app and you can add songs to the bar's playlist! It's pretty entertaining to chose the songs and gets everybody engaged. They have a Nintendo set somewhere. i didn't play because I was engaged in lots of convo and silliness but it exists...\n\nThe crowd was lively. The bar tenders were friendly and efficient.\n\nI had a great time and I felt like this bar really facilitated me and my friends hanging out, eating and drinking freely and to our heart's content.", "author": "Ama T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "$5 happy hour martinis in six flavors? YES PLEASE!\n\nBar Basic is just about the perfect spot for that 5:30 PM drink with your co-workers. It's got good happy hour pricing, enough seating for its location, and a nice selection of music that is loud enough to enjoy but not so loud you can't hear your buddies bitching about their day.\n\nSeoul on Wheels parks outside until 9 or so on Wednesdays, so if you like some food with your booze, try to aim for that. If you wind up here on a different day, the bartenders are down with you ordering a pizza to the bar or bringing whatever else inside, and they'll make popcorn if you just want a snack.\n\nOverall a solid spot to do your everyday drinking.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "Been here twice this week.  Super chill atmosphere, not crowded on weekdays, well-made drinks with the right amount of... drink.  Comfy chairs, somewhat dimly-lit (but not too dimly!).\n\nIt's hard to really say much more.  I'm getting tired of crowded, noisy bars, where you have to spend 15 minutes just to get a bartender's attention.  This place makes me happy to avoid all that.\n\nJust sad that the Nintendo is broken :(", "author": "Brian T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "There hasn't been a place so aptly named since maybe the dollar store. This place in all ways is simply basic. Their happy hour specials are pretty good but there's nothing to eat and the decor is average. I came here on a Friday evening and it wasn't very crowded which was unusual but fortunate because I could actually hear what my friend was saying. Overall a pretty relaxing atmosphere.", "author": "Dhivya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "Greatest neighborhood dive bar.  Cheap drinks, dogs allowed, no frills but great as to what it is.", "author": "Sheetal P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-07", "description": "This place is pretty basic (hehe).  I think you would miss it if you didn't know where to find it.  I only saw it because I happened to be using the ATM across the street and the distance was a major selling point.  But even at first we were like uh what is that place? hmm, where?  right there...is that a bar? is it even open?  luckily for us it was.\n\ni love bars that defy the implied time frame of a \"happy hour\" and this does...as happy hour goes m-f from 5-9.  Awesome.  Martini's are five dollars and beer one dollar off.  They have super mario brothers and duck hunt.  Which at first you are like awesome...but then you are like uh...nah.  I mean if im gonna play video games with a friend ill buy a six pack and drink at home...\n\nIts very loungey and swanky.  Dark brown...modern seating.  Though its a big place the seating just goes around the wall so I don't know how easy it would be to get seating on a weekend night...\n\nIts hard because its a good bar, but there are just so many great bars in SOMA.  Not saying I won't be back, but I may try a few others before.  \n\nOh but there was a dog in the bar.  which was totally awesome...", "author": "Kierstan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "This bar is a cross between dive and trendy...the bartenders are awesome...we (mu buddy and I) nicknamed one of the girls Apple for the heck of it and she kept it going lol...I believe her real name was stephanie, and it's def. because of her that we'd go back. \n\nMy friend threw her bday celebration there, and the bottle service was awesome, the atmosphere was fun, friendly and most importantly WITHOUT DRAMA! \n\nThey have a super nintendo that people can play, the dj keeps the tracks goin with a great variety of music to move to.", "author": "Jim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "Good drinks, good seating, and three TVs.  Ideal for any sports event, plus they let you bring in any outside food.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "Drinking spiked Arnold Palmers in plastic cups while dancing obnoxiously to 90s Top 40 music?  Yes, please.\n\nKicking it with old and new friends in a chill place? Yes, please.\n\nSupporting my aZn brother? Yes, please.  (The owner isn't actually my brother from the same mother, but he is Asian and he is a friend of a friend)\n\nStumbling out to purchase Chicken Adobo and fried pork deliciousness from the Hapa truck right outside?  Yes, please.", "author": "Vi H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-17", "description": "Despite Jeff S's insistence, this bar is NOT in the financial district.  It's smack dab in SoMa and used to be the Gallery Lounge (what are they drinking in Cupertino?).\n\nBar Basic lives up to its name: Nothing on the walls, a long black banquette along the wall opposite the bar with seating cubes and some short tables.  All of this is fine.  It's the theme and the look they're going for.  I get it.  I found the seating comfortable and useful.  Not all bars can offer this.\n\nI had a Widmer Hefeweizen to drink and it was a little lukewarm if I'm being honest.  Call me an American, but certain beers should be cold, and I count hefeweizen among them. But, who cares, right? I can forgive beer that not cold enough.\n\nWhat I can't forgive is the lack of attention to customer service.  After enduring the incredibly loud music playing overhead (why does this place even need a DJ?), I asked if the bartender could turn it down just a little.  I was literally yelling my conversation with my friends--as were other patrons.  The only people who seemed to be fine with the sonic chaos was the birthday group in the back to which the \"DJ\" seemed to belong.  To her credit, she asked Mr. DJ to turn it down and he did--for about 5 minutes.  Then, the music (which was also inappropriate for the space and them--basic it was not: techno/industrial does not make me think \"basic.\") volume crept back up.  \n\nEventually, it was so loud, we decided against a second drink (we went to Marlowe instead).  I left the bar, decided I had to say something to the bartender, and went back in.  She seemed surprised that I thought it was loud and said she had asked the DJ to turn it down a little.  I responded that he had subsequently turned it back up, so she offered to ask again.  Of course, I was leaving at that point, so it didn't matter.\n\nI guess I have to ask: Who's running Bar Basic? The DJ and his friends or a savvy business person who wants to cultivate a neighborhood clientele?  Turn down the volume, BB, and maybe I'll be back.", "author": "Todd X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-15", "description": "\"Dive\" sports bar in the SOMA.  This place is pretty nice.  If you want a Dive Bar check out Coaches in Fremont.  Thats a DIVE bar.  This place is cool cuz it was easy to find a seat at the bar while watching the Warriors lose to the Spurs.  Lame asses.  After the game the owner turned Twilight on.  I guess the patrons of the bar are a bunch of tweens.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-30", "description": "Friends and I usually end up at Bar Basic when we're looking for a low-key evening b/c it's a shorter walk than to Lava and not as divey as Utah up the street. Most of the time the vibe is pretty laid back and I enjoy frequenting a bar where no one is going to do a double take regardless of whether I walk in donning stilettos or wearing a potato sack. It's an honest, clean, unpretentious bar where you can cuddle with your honey on the lounge sofa bordering the wall (not me) or kvetch to your friends at the stools while watching hockey (totes me).\n\nI think the drinks here are decent although on one occassion, one of the bartenders totally messed up my cocktail of choice: Manhattan. It tasted absolutely horrendous but I choked it down anyway; after that incident, I wisened up and started asking for the drink to be made a certain (the right) way (stirred, not shaken, pls!). Surprisingly, one of the 'guest' bartenders one night did a great job of mixing me my drink despite her admittance to not having much experience with that cocktail. \n\nMy geek friends enjoy using the RoqBot and I'm always excited when I see their usernames on the screen... b/c I'm a simpleton like that.\n\nBelonging to one of the staff members is a cute dog (milo?) that runs around the establishment sometimes. The fact that they dress him up occasionally bumps this place from a 3.0 to a 3.5 for me.", "author": "Ida C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-06", "description": "cool bar to hang out with friends. I little pricey but I am sure because of the location. It is kinda of cool that they let you play Super Nintendo!", "author": "Fabio C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "My boyfriend and I came here to have a drink before going to Fringale at 8pm on a Saturday night. The place was completely empty, but we were fine just enjoying a beverage and playing with the SNES. It's not surprising that my buttons on the controller was not working so well since hundreds of people have probably used them (wash your hands after you play!). It is a good concept to have a bar and I can imagine it being a blast with more people at the bar. The drinks were done fine - I had a peach martini and the boy had a jack and diet. Prices were probably around $10/drink - that's SF for ya right? Overall, this was a good place to hang out for a bit, but I wouldn't think to want to spend the whole night there even if it was full of people. Other than the SNES and the iPhone app controlled music radio, there's not much else going for it.", "author": "Diana U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "This bar is great... Bar Staff is the best.. they wouldn't make you drink and drive... they'd call a cab for you or even drive you back.. \n\nAtmosphere is awesome, prices are cool, Kimchee taco trucks stop by.. awesome place.. Music is legit..", "author": "Enrique M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "I love this place. Its small and I like the vibe. I've only been during the week for afterwork drinks and I absolutely love that they have Roqbot. I wish more bars had Roqbot. \n\nAlso they have old school nintendo hooked up with all sorts of games.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-03", "description": "Bar Basic isn't really what I call a dive bar. The furniture is nice, it has cool loungey areas and interesting paintings on the wall. The friendly staff is great and the best part is that you can bring in your pooch to hang out with you while you play super Nintendo. Everytime we go in, the owner automatically puts in tetris for us. TETRIS WARS!", "author": "Mina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-11", "description": "I meandered over to Bar Basic for their 1920s themed special event. They handed everyone some fake money to gamble on the black jack tables they set up. The event seemed like a hit; the person who won the most money won a grand prize. \n\nAs for the bar itself, there was plenty of seating and cheap drinks. I ordered a gin gimlet and it was only $5! I liked that there were lots of tables and seats that were up for grabs (no need for a reservation). I'm not sure I would send the entire night here since I didn't see a dance floor. However, I'd definitely be back for a laid back night with some friends for some drinks!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-23", "description": "My college alumn network of crazy folks are all over the world and all over the map.  Mike I wish you nothing but the best in your new venture!  Used to be the Gallery Lounge.....now Bar Basic.. I like lots", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "This is right around the corner from our office and is quickly becoming one of my favorite watering holes. Happy Hour prices are fair and the it's sort of off the beaten path so you're not fighting for a place to sit. It's a perfect for a place to grab a drink and have good conversation because you can actually hear the person next to you. \n\nI'm a big fan, will definitely be going back soon", "author": "Tien H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "Good location in SOMA if you are driving and parking and far enough from the Market street bar hopping crazies.  Bar Basic is a decent hole in the wall bar. It's actually fairly spacious and is pretty clean. I have been to a few parties here. I really liked the specialty drink menu. I'd probably come here again for happy hour and what not.", "author": "Sonya T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "I like Bar Basic.  It lives up to it's name.  Long narrow bar, not too fancy, not too divey, just right.  Happy Hour from 5-9pm every day, good selection of tequilas, whiskeys, vodkas, beers, etc.  Some of the aspects of the bar are still under construction, but if you are in the area, waiting for a table next door, or around the corner, you should swing by for a drink.\n\nSeating is decent, loungish in style, with a long white quartz bar.  Their bartenders all seem pretty well rounded in mixology, and the owner is a nice guy.  It has the feel of a neighborhood bar, with an upscale vibe.\n\n3 Big HD tvs with individual tuners and the bartenders are open to putting pretty much whatever you want to watch up on any one of them whenever you want. But there are typically sports on at least 2 of the 3 screens.   Overall, I would say this place is a great spot to grab a drink either before a Giant's game, or while waiting for the next CalTrain to arrive/depart.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "Just another 'basic bar'. If you simply want to grab a drink and have a chat with one or two of your friends, this is a good place to go. One thing i like about this place is that it has rockbot - a jukebox app that can be downloaded on your iphone. You can simply vote for the next song you want to play. I also saw a 90's nintendo console there, but havent seen anyone play it though. Watch out for an asian bartender guy though. He isn't mostly there, but he once charged me a dollar extra for a drink. Not a big deal, but still.", "author": "Lijo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "Bar basic (formerly known as galleria)  is a hidden gem in the financial district near embarcadero; the perfect place to relax after a long day of work. It has nice new decor with interesting drinks, and you definitely can get some good drinks without spending a grip during happy hour.  Music is a mix of top 40 and alternative but the friendly owner is open to any music suggestion!\n\nHaving convenient street parking nearby is definitely a plus too!!  Can't wait to check out the place when it's remodeled.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-23", "description": "Drink. A very friendly bar to come to. I enjoy how it is near the train station so if I have a tough day, and can co e unwind here. Also the fact they have old school street fighter ll up In There makes it better. They have a fine selection, however I always stick to my Guinness.", "author": "Nye T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-10", "description": "This chill little bar is around the corner for those who want to escape the clusterfuck that is The Grand.\n\nThere's lots of seating here, and it's dog friendly.  I remember it being super loud inside though so please spare your dog's hearing and leave him at home.\n\nIt's not really somewhere I can see myself hanging out at for more than 1 or 2 drinks, but it's a good place to start the night off at.\n\nWe got a round of Dark and Foggys and they were awful.  I can handle some pretty bad rum drinks but I have no idea what was in this-- there was no syrup or citrus, that's for sure.  Disappointing, but I'll be back for the venue itself.", "author": "S L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "I'm a fan.  Good ambiance, not too crowded, great bartenders who know how to make a perfect dirty martini.  Great for a chill drink with friends or as a prelude to going big somewhere else in the city.  And how can you not love the mystery box-o-shots?!", "author": "Max B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-08", "description": "The perfect local bar!  Amazing selections of beers, wines and liquors, great & fun cocktails, and a cool but not \"too cool\" bar staff.  If you live in the area or you're headed to a Giants game, you should make plans on meeting at Bar Basic!", "author": "Plaid B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-25", "description": "A chill neighborhood bar with a nice vibe.  The bar has decent prices and since the new renovations the inside of the bar is pretty nice as well.  \n\nIts a nice place to hang out before the Giant's games for some pre-game beers or grab an extra post game beer (or two).", "author": "Alex P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-08", "description": "This bar is pretty basic. Shocker, I know. Decent amount of seating, tvs playing games, and the music is controlled via guests' iphones. The wine list is rather small, but in line with what I would expect from a place like this. Might go back if I'm in the area...it's right by the cal train stop which is nice.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-13", "description": "Missed the Caltrain south so we stopped in here to kill some time. Had the Giants game on, plenty of seating, good selection of spirits and brews. Kinda mix between swank and dive, I guess that's the SF special though. Would def head there again if I were to miss another train.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "$5 martinis for happy hour, and an NES with a bunch of great games for everyone to try and fail to drunkenly play.  The sports crowd can be a bit unruly at times but who cares.  It's a cheap, basic bar that gets those basics down pat.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "As their name applies, this is a great \"basic\" bar, but with great happy hour deals and lots of TVs to watch the games.  You can either comfortably lounge on benches or sit at the bar. If you're in the area and are looking for a no frills drink to catch up with some friends this is a great stop.", "author": "Nick E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "Plain and simple, this is a good place to get drunk. There. I said it. The drinks are strong and cheap (especially with the ridiculously long happy hour- I mean, it goes until 9pm. Where else do you know has a happy hour until 9pm?!), it's not usually crowded, and the bartenders are friendly. Actually, the crowd kind of ebbs & flows here- sometimes it's dead, sometimes it's packed- but we always have a good time here. Some nights they have djs; the rest of the time they have something called Roqbot, which is awesome bc you can pick songs you want to hear with it. Plus, you can order in food if you want. No bones about it, it's not a fancy trendy bar, but it's a good solid let's have an f'in no frills DRINK bar.", "author": "Kristen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "3 words. NBA Jam: TE. They have the classic video game on SNES", "author": "Chadwick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Bar basic is a good neighborhood bar with happy hour from 4-9pm and game day specials. It's a good spot to catch a quick drink after work or sit down and watch football.", "author": "Jermaine R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "I like this place! They have a great hh that lasts till late and their sweet tea lemonade vodka drink is great. The staff is nice and there is free popcorn and an old school Nintendo available.\n\nThe bar looks unassuming from outside, but the inside is nice and clean and very comfortable.\n\nGreat spot to drink at before a game.", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "I held a party at Bar Basic, and I must say it was very delightful. The place was clean and very neat. I would recommend to anyone to hold an event at this place. Five Stars.", "author": "Dean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "Low key, good drinks, loved the Roqbot.  But the best part was the dog sitting at the bar.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "A great neighborhood bar -- Relaxed, non-pretentious, friendly, and a great place to watch games. Happy hour 4:00 to 9:00. RoqBot is fun. Weekends seem to have a lot of overflow from The Grand, so watch out for that!", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-20", "description": "The one star is for the bartender. The rest is for the \"owner\" \"Mike\". Way to not care about your customers. I tried to ask Mr. Know-It-All about the drink menu and he responded the same way anyone who knows nothing about cocktails would: \"it is a really well known drink.\" No creativity, no customer service, and no class.", "author": "Rikus L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-20", "description": "Two stars because it's right by the house in soma and the remodel is cool. Not sure if it's just me but the service is aweful every time I come. The bar tenders have a bad tendency to be unfriendly and ignore you even when it's slow. My beers have been warm in the past and they seem to be lacking one mixer or the other. In my opinion gallery was waayyy cooler and the bar tender was friendly and attentive. I'll come back because it's close to home but I'll bitch and moan about it.", "author": "Omar M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-09", "description": "It wasnt like a bad ass bar that was jumpin with people but.it was entertaining and they have mike tyson punchout!", "author": "Joshua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "This is definitely a good find. It has a laid-back feel, good music and cheap drinks for happy hour! The owner Mike is super friendly. This is definitely a good spot to go for drinks with friends and colleagues on a weekday afternoon without breaking the bank.", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "It's really 3 stars but 1 star for the Korean taco truck that comes by on weekend nights and parks out front until 2 am...and 1 extra star for being only 2 blocks away from home. It's a laid back place, the bartender was pretty cool - the only thing was it was pretty empty the one time I went. Maybe it's more of a Happy Hour place. I'll definitely go back though. Heck, maybe I'll go tonight.", "author": "Bern H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-19", "description": "Great drinks, big space, perfect for happy hour. Too bad they don't have free snacks like Gallery Lounge had :) But can't wait to go back for the food trucks!", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-26", "description": "They have happy hour all week!  Its a great find for me, since I work near there.  It has a nice lounge feel without the usual clientele.  Great place to take your co-workers...I just wish they served food.", "author": "LIVE to E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-15", "description": "The name doesn't lie.  This bar exudes a minimalist style, but isn't boring to look at.  Less is more!  I enjoyed my Ketel dirty martinis and the tunes in the background.  The service was friendly and prices were reasonable.  A cool, casual spot...just wish there was more parking around there!", "author": "Linda P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-07", "description": "Went here for a friend's birthday last night. The atmosphere & crowd were nice, but the drinks, while reasonably priced, were so incredibly weak that none of us felt there was any alcohol in them. 6 bucks for a glass of soda water, that's what it felt like. If you come here, stick to beer & wine. Other than this, the place has potential.", "author": "SL N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "love this place! i've been going here for a few months and it's a great happy hour. bar tenders are friendly and the vibe is casual/laid back. if you work in the soma area and need a new place to relax in the evenings, this should be one of your spots", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-24", "description": "Not a bad place to chill out at on a Friday night. Doesn't get too packed and the music is good and the bartenders are friendly. There is a Korean taco truck that chills outside on certain days so you can hit that place up for some spicy tacos. ;)", "author": "Irene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Nice, low-key space to grab a few drinks. My peach martini was crazy strong. Apparently the food truck is there Thursdays-Saturdays, so I'm definitely coming back to check it out.", "author": "T. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "great bar. no cover, friendly service, strong and tasty drinks.  one of fave spots to go after work.  only wish the had bar food as an option.", "author": "Fres R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "I love the dark, \"loungey\" feel of this bar.  Great place to sit around, have a drink, listen to music, and be anonymous.  I like hanging out with the locals or sitting around talking to the bartender/owner.  He's just so freaking adorable.  Need a place to disappear for a while?  This is the place to do it.", "author": "H B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "My first experience at Bar Basic was for a friend's bday. I will have to say, the crowd in there earlier in the night was a little odd...but they were having a good time. I like that it is a smaller bar, reasonable drink prices, and friendly service. My last experience there, they got me throughly wasted...I appreciated that. This is a good, comfortable, non-pretentious place to have good drinks and hang out with your friends.", "author": "Matt K."}
