{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I really try to limit my sugar intake on a regular basis...but I couldn't help myself and had to try Batter Bakery. The kiosk on California St. really only allows one customer to browse and buy at a time, but there wasn't a line when I went (before the lunch rush), so all was fine. The staff member was really nice, friendly, and helpful. I mentioned that it was my first time  there and she recommended the scones and the sand angel cookies, so I got one of each, along with a piece of banana bread. \n\nI got back to the office and taste tested each of them. They were SO good. I'm used to eating cookies that are overloaded with sugar to the point that I'll put them down and never pick them up again, but that wasn't the case here. The sand angel was sweet but had a depth of flavor--a combination of gingerbread and snickerdoodle and jus some yummy goodness. It was packed with flavor, so I didn't eat it in one sitting, but I went back to it throughout the afternoon. \n\nThe brown butter banana bread was the same way. It was perfectly sweet, moist, and flavorful. I could taste actual fresh ingredients, which made all the difference. \n\nThe pear scone was tasty, moist, and fluffier than store-bought ones, which I appreciated.  I can't wait to try more. \n\nAlso, don't forget to ask for a punch card. Once you purchase 12 items, you get one free!", "author": "Lori C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Sand Angel.\n\nWe've all heard that saying, \"Never judge a book by its cover\" because, well, even the prettiest of covers and interesting titles may have the lamest stories.  However, in this situation, I am guilty.  A name as beautiful as \"Sand Angel\" which I originally thought was \"Angel dust\" I predicted was going to be a magical and enchanted, life-changing cookie.  Oh, but what's in a name?\n\nI have passed this glass time-capsule looking kiosk for weeks but never knew what contains inside.  I've avoided walking by too close, for fear of solicitation of a product that is useless to me but would be easily convinced to buy.  I am an ultimate consumer after all, in the process of converting to more minimalist ways.  Over time, curiosity got the best of me, and I've walked closer and closer to the time capsule each day.  What's inside? Ooh, it's a snack booth? Ha. of course I would first think about food.  Knick-knacks? Something expensive?  A teeth whitening kiosk? Timeshare?  NO, it's baked goods! I already knew that because YELP pointed me towards the direction of a bakery closest to the Starbucks.  \n\nSo, the Sand Angel- I expected to find a sugar cookie as fine and smooth as white sand that crumbles as it is delicate in its cookie molded form.  But no, it was a chunky brown cookie lightly dusted with powdered sugar that taste of oatmeal and spice.  However, there were no oats found; Perhaps they use finely grounded rolled oats?  Not sure, but it sure is good!  Probably my favorite non-chocolate cookie ever.  Call me an old lady,  but I do love me a good oatmeal cookie tho.  Still unsure what is in a Sand Angel but I find them addicting as I've come here twice for them already.\n\nI've tasted the chocolate chip cookie, and I can do without them next time.  There are a lot of other things to try from Batter Bakery and may try them some time. For now, I come here for one thing and one thing only.", "author": "Leslie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Having returned many, many times since (especially now that I work right across from the kiosk, FML), here are some additional tips acquired over the years!\n\nPastries that are particularly noteworthy: their almond butter espresso blondies, carmelites, caramel nib brownies, savory scones, and banana bread.\n\nThey have happy hours where their cookies and breakfast pastries are discounted from 3pm 'til closing.\n\nThey also have a buy 12 get 1 free stamp card, so be sure to ask for that! Took me over a year to find out about that one.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-20", "description": "Small booth at the corner of Califnoria and Kearny. Stopped here for a mid afternoon pick me up. Was told the sand angle cookie was their most popular and I got the last one...sadly I did not enjoy it that much.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-04", "description": "This beautiful kiosk catches my eye every time I walk by, today I decided to give it a try.\n\nWalking in, the selection was great, catering to every type of craving. However, I was not greeted and the worker looked like he was in a bad mood. Before I walked in, he was picking his nose, maybe that was my sign not to go in. But considering it was their happy hour I wanted a bargain.\n\nThis location is great because it has lots of foot traffic. This is borderline Chinatown and attracts lots of tourists!\n\nThe Cookies were delicious and made big enough to share.", "author": "Kam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Best cookies in the Financial District! Visit this cute little kiosk if you're ever in need of a sweet fix. The sand angel cookies, devils food brownie, and chocolate fog cookies are my favorites.", "author": "Emma B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-12", "description": "My boss gave me some of these cupcakes. Both vanilla and chocolate, I only tried the vanilla though.\n\nThey come in cute individual cardboard boxes and fit perfectly inside. The vanilla cupcakes are actually confetti color inside (rainbow specs) which I thought was cute. The texture of the cupcakes was good, just a little bit dry... the frosting was good, pretty light and not overly sweet. \n\nI guess after 3pm the cupcakes are cheaper, so that's good to know! I probably won't be back just because I like other cupcake places in the area better.", "author": "Hayley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Great baked goods in a very peculiar storefront! There is literally room for one employee and one customer. It's a cute concept and their desserts completely deliver. They accept credit cards and it's a step away from Chinatown. It's not a cheap stop, once you decide to buy every variety of cookie and bar you see, but it's certainly acceptable considering the location.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "I was looking for some durable (read: able to withstand trans-Pacific flight) goodies for my family in Hong Kong to try out and thought I'd check this little kiosk out. I read that the sand angel cookies (their most popular one) sometimes run out, so I called and asked the girl working the kiosk if there were any. She said yes and said she'd hold some for me! I literally work upstairs from the kiosk, so I zoomed my way down there.\n\nGoodies I got:\n\nSand angel: I know everyone raved about this but I just didn't quite understand. To be fair, I was a bit under the weather the first time I tried it, but after I got better, I tried it again. I loved the chewy texture, but the flavor just reminded me of the Mother's brand oatmeal cookies, which I really like, but aren't OMG. I will say it's hard to stop eating though.\n\nLavender shortbread: LOL I'm always reminded of my aunt's many lavender-scented pillows when I smell lavender, so my sister said eating this made her feel like she was inhaling a pillow. But, fair comment, as the lavender aroma on this is SUPER strong.\n\nThe other things I got: chocolate chip cookie, chocolate mint cookie, gingerbread men (supah cute!).\n\nPeanut butter cookies: Also perfect, doughy cookie texture, but the reese's cup in the middle wasn't lodged in super tight on some of these.\n\nCarrot cake: moist, tiny coconut pieces, frosting is soft and medium light. \n\nChocolate chip: Pretty standard, but I like the crunchiness of it combined with the chewiness. Could be a tad more chewy though.\n\nTo be 100% fair, probably a 3.5 based on food and lack of bags, but the kind service I got at the kiosk (the girl working was super nice and easy to talk to!) and convenience really make it a 4.\n\nActually, if anyone has any food only found in SF that they think would make great gifts for friends and family in other cities and countries, hit me up! I'd love to get your thoughts. I had an extensive list for NYC goodies (Doughnut Plant, Dominique Ansel's cronut, Junior's cheesecake, Levain's chocolate chip cookies, Magnolia's cupcakes and banana pudding) but I just can't think of any here. The only thing I got so far was Golden Gate Bakery's egg tarts.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Anytime you walk on Kearny street past California, pop in their little booth and pick up some delicious handcrafted baked goods for yourself or a loved one to make your or their day a little sweeter! \n\nEverytime I'm in the financial district, I come pick up a box of my favorite Lavender Sea Salt shortbread cookies! Those are my favorite. It's made from organic unbleached wheat flour, unsalted butter, sugar, real bits of lavender, vanilla extract and sea salt flakes in top. So fragrant, mildly sweet and salty, just entirely addicting. $7.75 a box of 6oz, I can eat the whole thing in one sitting. \n\nTheir bakery and store is located at 1517 Pine Street where they have a bigger selection of baked goods. Do pay them a visit! They also do private events and catering.", "author": "Janny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "I love this little outlet of Batter Bakery - it's conveniently located on my way to work and I oftentimes stop by to buy a little something for a co-workers who helped me on a project: you can't imagine what a peanutbutter-cup cookie will do for your relationship with your office mates!\n\nTheir brownies are excellent and so are the cupcakes; especially the carrot cake cupcakes.", "author": "Uli B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "I pass by this cute corner kiosk everyday. Wonderful baked goods!\n\nI've tried the Devil's Food Brownies, shortbread cookies (Lavender Sea Salt and Meyer Lemon Pink Salt), the regular chocolate chip cookie, and the Chocolate Espresso Buttercream cupcake. \n\nI'm a sucker for sweets and really liked every single one of these yummy thangs. All the baked goods were really buttery-even the brownie. Usually I wouldn't taste the butter so much in a brownie. But definitely yum! I noticed that the cookies, both shortbread and regular, have more of a salty taste than I'm used to, but somehow it works really well. I definitely tasted the lavender in the cookie which was surprisingly good. The cupcake was the most moist (tongue twister) cupcake I've tried in the area and the buttercream was so good (it was really sweet, though, so I don't recommend you get it if you're more into mellow desserts).\n\nCute little spot to pick some sweets up for your friends/coworkers....or someone sweet :D", "author": "Meghan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Yum! I love cookies so had to stop in while in San Fran for a few days... they were so good I went back on my last day as well! They have happy hour specials which was nice. The sand angel cookie is excellent --- if you like anything spice cake like you must try this. The cookies look hard but are nice and soft. Only disappointment was the choc chip ones they had looked a tad burnt and not soft. Overall great place for cookies! They even had some yummy looking gf options.", "author": "Megan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Behold the cutest Turkey Day cookie ever. \n\nhttp://goo.gl/dUSSwS\n\nTasted damn good too but what's not to like about frosting and shortbread?\n\nIt appears that the season of gluttony has begun. \n\n(Or as I like to call it, WEDNESDAY.)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "These are the most disgusting baked goods. They have no flavor. They are dry. I tried the carmelita, blondies and triple chocolate espresso cookie. The set up is cute and the packing is cute but the quality of the contents were awful.", "author": "A g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "I guess this trip is a carb fueled experience and I am not going to feel guilty about it.  I had been watching the pictures of the cookies and deciding what I wanted to try.  Once I found the kiosk near my hotel, I got a Sand Angel, the Lavender Sea Salt, a pack of orange cranberry shortbread cookies and a triple chocolate espresso cookie for my husband.  I don't have the sand angel in the picture because I ate it.  Darn lack of control, I felt like cookie monster, COOKIES, NOM, NOM, NOM.  I actually loved the Lavender Sea Salt even better, the floral scent and taste was so different and amazing at the same time.  I am going to go tomorrow and get a couple more.  Here comes Cookie monster again!!!!", "author": "Marisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "Batter Bakery is great because it's conveniently located in the financial district and they sell these delicious cupcakes in a little individual cardboard box. When you're not particularly thoughtful, but still want to appear as such, this is the ideal gift to show that you appreciate a coworker. \n\nAnd if thoughtfulness really ain't your strong suit, I have drafted a template message for you to write on the sides of the cupcake box. Cheers!\n\n--\nDear (insert coworker's name),\n\nRoses are red\nVelvets are too\nCream cheese frosting\nThat's a cupcake for you\n\nWorking with you is a Cookie. If you're a flavor you wouldn't be sweet, because your personality is so much more complex than simple carbs. You would be refreshing like Chocolate Mint, exotic like Cherry Ginger, and well-liked like Peanut Butter.\n\nWhen I'm on the Monday morning struggle bus, you remind me that life is a cable car. It's an uphill battle when we're on California street, but there's a kiosk across full of scones, muffins, and treats. Sharing a Coffee Cake with you is the best way to bond, halfing the calories of the scrumptious Butter Pecan. \n\nHappy hours are the best, even without the drinks. All treats are a dollar off, sugar rush with the pastry softs. If there's one person to pig out with, you'll be my number one pick. We'll hang out in the kitchen, with three Confetti cakes. Thanks for being my co-worker, because we work so well together. Let's work on this cake right now, and later we will work another \n\nSincerely,\n(insert your own name)\n\n--", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-17", "description": "It's s cute and truly just right outside of my office. So I suppose I should be adding convenient but that's only for us that work right here. \n\nThe people that work there are always friendly and greet me with a smile. They have \"happy hour\" from 4-4:30 so you can receive a discount on your purchase which is a little incentive if you go later in the day. \n\nThere's a decent selection of muffins, loaves, cookies, and bars. Personally, I'm all about the peanut butter-chocolate chip cookies. They're my fave. I've had the brownie, PB Blossom, and some shortbread. Batter Bakery - lay off of the sugar on the PB Blossoms. They're WAY over sugared now. By far.\n\nI like supporting them because they are small but there's a lot of other places to satisfy your sweet tooth during the work day.", "author": "Sierra R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "I love this place. Highly underrated cookie outpost in a high foot traffic location. I actually never tried this place until the SO brought home a bag of snickerdoodle cookies. They were amazing. Super soft, not too sweet, very chewy, just great cookie overall. Pretty sure these are the consistently best cookies I've had... can't really think of a better cookie store in the area, especially considering these are already packaged when you buy them.\n\nI have yet to try the famed Sand Angel, so I'll be back soon. Prices are pretty reasonable, and the cookies stay fresh for a couple of days which I was pretty impressed by. \n\ntldr; great tiny cookie outpost in FiDi, truly spectacular cookies", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "LOVE Batter Bakery. We get them catered into our office and I go personally on my own. Their treats are always delicious and they have fun holiday themed ones. Their shortbread cookies are my favorite.", "author": "Makenzi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "Wow - they make the world's most perfect M&M cookie here.....also known as the polka dot cookie.\n\nWith M&M cookies, I normally just eat the M&M's with a little bit of cookie stuck to them and then throw the majority of the cookie away.  I actually like eating M&Ms more from cookies than from a bag - weird, I know.  But with THESE cookies - I want to eat the WHOLE thing.  These cookies are perfection.  Thick, chewy, almost lightly underbaked.  I ate way more than I should have.  \n\nThey have lots of other fun and tasty treats.  I just stocked up for Valentine's day.  Their shortbread flavors are really neat - they even have a Red Hot variety for the holiday that is delicious.\n\nI'll definitely return here for any cookie needs.  I just wish I was closer to their actual shop and not this tiny little kiosk.  But hey - good use of space in such an expensive city!", "author": "Tay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "Definitely worth popping your head in (because nothing else will fit) to this tiny sugar heaven. The creative scones, breads, and cookies were great. My favorites are the banana chocolate chip bread and mixed berry scone!", "author": "Jamie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "I was in San Francisco for a work trip and every morning, I walked past the Batter Bakery kiosk on my way down to the Embarcadero. One day, I decided to go in and check it out. The space is tiny but it's full of pre-packaged baked good. The staff was restocking some items when I went in but she was helpful and gave me great suggestions on which cookies to try. I got the sand angel and the lavender sea salt shortbread. The sand angel was a chewy cookie but I'm not a big fan of molasses. It was still a good cookie though. The lavender sea salt shortbread was a crunchy cookie and it tasted weird at first because of the salt but after a few more bites, I started to like. I wish I had more time in the city because I wanted to try their cupcakes too.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "There's really only one thing you need to know about Batter: Sand Angel cookie.  Easily one of the best cookies I've had in San Francisco, and probably one of the best things I've eaten when it's been handed to me warm on a Saturday morning at the SF Ferry Building Farmer's Market.  I've passed by Batter previously in my walkthrough of the Embarcadero Centers, but rest assured, I won't be making that mistake again.  Get yourself over to Batter for their cookies!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "Yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy...(breath)...yummy, yummy, yummy, yummy, YUMMY.\n\nOk. I like this place. Can ya tell?? It's not a five star bakery like Tartine or Le Marcel. Their pastries aren't as flakey-pillowy nor muffins as robust, but those fine examples aside, this place is YUM! I've had a number of their muffins and the  raspberry-blackberry rhubarb ones are delicious. Huge fruit baked into the bread, which to their credit they do not sweeten. I've gotten plenty a sour tasty jewel that just served to accentuate the sweetness in which it was baked.\n\nThe glass kiosk they occupy on the Bank of America plaza gets points too for style, service, and convenience. I'll be coming here a lot!", "author": "Christopher M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "It's a small circular booth at the corner of California and Montgomery.\n\nHappy hour starts at 4pm every weekday, which means $2 cookies and cupcakes, yum!\n\nNotable treats are-\nLavender sea salt shortbread cookies\nOrange pistachio shortbread cookies\n\nNo breakfast goodies here. You'll have to go to the Embarcadero Center #2 for that. But, still good. Cookies and cupcakes are delicious!", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "How do u charge $3.50 for ONE smallish brownie?!? I'll tell u how- u bake the most incredible square of food ever to touch the human palate, that's how. I'm gonna make a pretty sweeping statement here folks. This brownie was the best brownie I have ever had. Like by FAR.  It was this unassuming little brown paper wrapped square. I threw it in my purse and forgot about it, like it didn't even matter. \nI can't tell u how this brownie was, thinking of how to tell you just pisses me off. Damn these inadequate words that cannot do such a thing justice. Damn them!  All I'll say is this: brownies MATTER to me. Ok?! This brownie made me want to punch a nun in her mouth. \nGo eat one or just kill yourself already. I'm sorry if that's harsh. I don't like talking to you this way...but sometimes I think you haven't learned enythin....ENYTHIN!", "author": "Emma H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "These are the best pastries in the city! The kiosk doesn't always open on time and runs out of scones later in the day, but their savory scones and they cookies are decadent and delicious.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-22", "description": "I decided to pick up a few cupcakes to surprise my boyfriend and needed a place close to work.  I trekked over to their popup and was tempted by all of the cookies and blondies they have.  \n\nI ended up getting the carrot, chocolate stout, and vanilla confetti.  The cupcakes are quite small (as some others mentioned) and $3 each.  We enjoyed the flavor, the chocolate stout frosting was fantastic.\n\nBatter has pretty solid baked goods, but they are pricey.  If I'm in the area, I may have to come by for happy hour and try some of their other options.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "YUMMMMMMM!  Cookie cart?  Say what?  Loves it.\n\nI attended a party where the host had arranged for Batter Bakery to show up with a cart full of delicious, warm chocolate chip cookies.  Yes, the cart keeps them warm.  I mean, come on.  Everyone loves a cookie, but when it's fresh out of the oven?? It doesn't get any better than that.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-04", "description": "I wanted to have something sweet and came across this place on yelp so I got cookies on the way back from my walk in downtown.  \n\nTheir $2.75  chocolate chip cookie is big and moist but nothing special.  The lavender sea salt cookies are very unique but strangely gets addictive after first one.  They are $5.75.  \n\nI agree this place is over priced and they do not carry many selections.", "author": "Nat W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-04", "description": "The smallest $3 cupcake I've ever bought. \n\nYes, it's cool to buy something sweet to take back to the office in this little kiosk, but the cupcake was really expensive how small it was, and the batter was way too sweet, and I have a crazy sweet tooth, so that's saying a lot.\n\nI probably won't be coming back, even though this location is super cute.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-12", "description": "Not a large variety in cup cakes in this location. They mainly have cookies but all in all still yummy", "author": "Luna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-05", "description": "Happy new year!  I know I'm a tad bit late there, but I finally have the time to write my first review of 2013!  \n\nAs Valentine's Day rolls around, I felt the need to indulge myself and my boyfriend with some fatty sweet treats.  Batter Bakery definitely hits the spot.  It's literally a booth packed with cookies, shortbread, and cupcakes right in the middle of the financial district.  Conveniently located for the stressed out 9-5 worker too.  \n\nI picked out a nice assortment of shortbreads and cookies.  I love the lavender sea salt.  Lavender's a unique flavor that's becoming more and more popular.  Couple that with the salt and it will really get your taste buds going.  The cherry ginger is also delightfully delicious.  However, my favorite is still the sand angel.  The first time I inquired, it was described to me as a cross between a molasses and a snickerdoodle cookie.  It's their signature cookie and the recipe is a big hush hush.  Whatever it is, it's pretty darn yummy.  \n\nSo if you're ever in need of a sugar rush or simply a break from staring at your computer all day long, Batter Bakery is the place to go :)", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "If you are one of those people who crave salty things in the morning, this place has the best scones ever\nJust had a spinach-feta cheese-bacon scone: perfect texture, great flavor. Bacon just a hint, which made it perfect to me.\nProblem: it was the last one. Their assortment of sweet foods is much bigger.", "author": "Thais O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-31", "description": "This rating is for the chocolate mint cookie.  What a disappointment!  \n\nIt was not soft, rich nor chewy as described in 2011  7 x 7's Baker's Dozen: 12  Best Cookies in SF article.  It was hard and dry, suggesting it was not fresh.  Money wasted.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Solid chocolate chip cookie - love the sea salt and the less-sweet chocolate. Unlike a lot of SF cookies, it actually tastes like a $3-4 cookie (high quality ingredients). And people who work here are always so friendly!", "author": "Kari F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-07", "description": "Yea, so the girl who told me it was one stamp per visit...she was really wrong. Because this time, the girl at the stand gave me one per item. Much better.\n\nThe shortbread is good as always, and this time we tried one of the cookies...i didn't know a cookie could taste so delicious. ridiculicious. yup. that's right. ridiculously delicious.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "Adorable little kiosk near 555 California Street. A little hard to find using Google maps, but if you keep your eyes peeled, you'll spot it. :)\n\nAfter reading all the yelp reviews, I decided to venture out in search of their cupcakes. Unfortunately, by 2:30, they had already sold out. So...we got cookies instead. Lavender sea salt and meyer lemon. Both were flavorful and unique although the lavender one was just a little bit better. Price wise, it is a little steep for cookies. A small bag costs about $6, but the packaging is cute and they would make great gifts.", "author": "Yanni L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "Great scones and cookies! \nThe location is a little hard to find since it's not an actual store but a kiosk in one corner! \nSo, it's a buy and go place! \nA little disappointed, because I wanted to enjoy my scone with a cup of tea.", "author": "Jorge A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "Okay,\n\nI move out of SF I'm a native born in the city so I have to come home to get food. Its just the way it is. I have my spots and of course my market but on this Sunday while at Stones-Town farmers market I pass these two ladies sell bakery goods now mind you there have been other at Stones -Town over the years but these ladies have the warn hello and excellent set-up I check it out and went on to see my other people I like at market but in the back of my mind was that Carrot Cake it kept calling to come back baby and that me home to your house. So on my last go around I did just that.  But back in the new Casa after  some veggie I make a cup of tea and open the little brown box and cut a small piece of the cake Oh My , my mouth and taste buds were in Carrot Cake heaven. The twist of this was lovely very small pieces of apple or is it white carrot what every it is, it just great. So a hot cup of Japanese tea and this  Out of the World Carrot Cake makes the long drive worth it more . I'm totally glad I moved off of Polk Street years ago because if I was still there my waist would be all Carrot Cake . Thank you lovely ladies from Batter this just top off the long drive back to land of no great food. Do stop by and check them out excellent product for sure.", "author": "viva H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-11", "description": "Sand Angel Cookie ($2.50)\n\nDid the prices go up recently or something? o.O My sand angel cookie tasted quite different (not as great) than when I had it last time. I was a bit disappointed. hmm...\n\nI came on Friday at 7:30am. They opened at 7:30am and they were just setting up. Nothing was quite ready and the lady working at the kiosk looked a bit frazzled. She still had a lot of baked goods to unload and organize. I felt a bit bad for her cause there was already a line forming! O_O All these crazy women wanting their sweets at 7:30 in the morning! My golly! \n\nThe worst possible question you could ask a frazzled lady in a kiosk is, \"What do you recommend?\" And that's what I'd asked. hahaha I wanted to see more of what they had and wanted to try something new, but of course not all the items were put out yet. =\\\n\nIf it's your first visit, I'd recommend NOT coming right when they open.  Give them time to set up and help the people who know what they want first. I'd maybe recommend sometime after 9am/10am?", "author": "CeCe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "Went here to pick up a cupcake for a friends bday and walked away with a sand angel (?? Forgot the name that could be wrong) cookie. Cupcake seems a bit small for the price, but the cookie was phenomenal! My coworker and I devoured it. It's a cross between a snickerdoodle and molasses cookie and I am INTO IT. Good sized cookie for 2.75$. \n\nKid working the stand was nice. The kiosk is pretty easy to overlook in my opinion. I do feel a bit duped--they advertise a paypal coupon that I specifically asked the cashier about, but when I paid it wasn't redeemed. Oh well, I'll still be back--that cookie is too good to give up.", "author": "Ashlee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-19", "description": "Come and pick your poison!\n\nStrangely enough, I would have sworn that a review had been written for each of my sinful pleasures.. I suppose I've been living inside my head for too long.\n\nI used to walk by this little kiosk every week post-meetings, thinking it was a flower shop. At a quick glance, it seems like a replica of the flower shop next to the Specialty's I used to frequent on Pine. When Yelp had Sugar High Week, Batter Bakery was featured (and conveniently located in Financial District). I scratched my head for a few minutes and thought, \"Hmm, why is this the first time I've seen or heard about them?\" Much to my astonishment, the strange flower shop kiosk sold sweet concoctions! I knew that this would be the death of me.\n\nA bit pricey (a lot pricey if you consider the long-term conditions on your health), but the yummiest you've ever had. The little lady who works there never seems too happy (though, I would, too, feel saddened if I were baking in a booth all day with baked yummies I couldn't eat).\n\nBummers aside, the brownie is the definite way to go! Moist, dense, rich, and sweet. It's a chocolately rave (notice I said rave and not \"party\") from the tip of your tongue to the ends of your toes-- one bite will leave you tingling all over. (;\n\nLuckily for me, my bizness priorities have changed. No longer am I up on California Street each week, passing by the taunting flower shop. But every now and then, I'll go out of my way for a savory taste of life-deprecating chocolatiness.\n\nOh, my dear snake, thank you for the sweet apple.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-06", "description": "Place of happiness....   =D\n\nThey have THE BEST butter cookies.... different flavors too. \nI wish they open one in the south bay. Cute little stand with all clear windows to display all the yummy goodies.\n\nI will def go get some more if I get a chance =) and you should too!!", "author": "Alice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "Having a kiosk is a smart idea for a small private bakery. Thank you for being located right across the street from my building...actually, this depends...sometimes I have to restrain myself...\n\n+Red velvet cupcake - moist and a good size so that I'm not on a sugar rush at work\n+Lavender Sea Salt Shortbread cookies - yum! I didn't think lavender would taste good...lavender makes me think of soap, but these were good with the aromatic flavor\n+Chocolate Hazelnut Shortbread cookies", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-16", "description": "Fall is my fav time of year when it comes to enjoying pumpkinny delicacies \n\nAs I am walking past Batter, I see a Pumpkin Chocolate Chip Bread on their board so immediately whip out the wallet \n\nUnfortunately it wasn't all that & in this rating system, have to say I've experienced better. \n\nMild pumpkin flavor w/ even milder chocolate \n\nThe chocolate chips had a somewhat waxy aftertaste & a more intense chocolate is definitely needed here\n\nMaybe the cupcake would be different??", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "I walked by the One Embarcadero pop-up many times  without even a whisper of temptation. Something about the decor/colors and even the look of the cookies just didn't appeal to me. And they seem to be expensive.\n\nThen driven by necessity to get some Halloween cookies as gifts, I went there because their cookies were beautifully decorated--even though they did not look particularly tasty. The recipient of my cookies (who has discerning taste) confessed that they were SO good, she'd eaten most of them.\n\nWell, this completely took me by surprise. At the next cookie craving opportunity, I stopped by, randomly choosing a Sand Angel. Instant convert! My fave is the ginger cherry but there are several close 2nds. They do seem  a little pricey at nearly $3 a pop, but if you can wait till happy hour (after 5pm, I think) the price drops to $2. Though I haven't tried everything, almost everything I have tried I very much liked.\n\nAnd for an office event, we had a variety of ice cream sandwiches delivered in charming fire engine red metal coolers--total success!\n\nDefinitely two thumbs-up for friendly, low-key service and the perfect cookies for cookie cravings--at least for me. Yep, I'm addicted.", "author": "Jamay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Perfect place to walk to for a mid-afternoon treat.", "author": "E A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-25", "description": "Husband and I were in the area after an appt at the Brazilian Consulate, and I got a serious cupcake craving. This place was a block away, so we stopped in to the little kiosk-type stand for some sweets! We got one red velvet cupcake, one carrot cake cupcake, and two of their little cookies with the PB cups on top. All were very good, I particularly enjoyed the creaminess of the frosting. The red velvet was good but not incredible, and I agree with other reviews that the cupcakes are a little small for the price. They are about the size of cupcakes you can make at home. I will say that the cookies were really  tasty, but again, pretty small. If the prices were cut by 25-30% it would be worth it! As it is, it definitely satisfied my sweet tooth and I didn't regret it, but next time I'll look for a larger payoff.", "author": "Justine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "This lives up to the hype. I LOVE their muffins. I have not actually been to their physical location so I can't speak about the ambiance, but had the muffins delivered to me via Caviar (my new obsession). The 12 mini muffins were delicious. Chocolate chip is probably my favorite!", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "(+)\n- chocolate hazelnut shortbread (5.75 for a bag of around 8)\n\nCalled in to order a bunch of peanut butter blossoms as customer gifts, they were packaged very cute and festive. Was able to arrange a time and date to pick them up at this kiosk.\n\nCouldnt resist getting a little something for myself while picking up our order. Sadly there were no peanut butter blossoms (prob cause we ordered them all) so I tried the chocolate hazelnut shortbread. SO GOOD. This one had some sea salt on there too, such a great combo with the sweetness of the shortbread. Another one to add to my expanding favorites list.", "author": "Julia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Love love love the happy hour at 4pm everyday!! I have tried a few things since I work across the street and I have to say I love the m&m cookei - simple and slightly chewy and not too sweet!!! The chocolate chip ones are good too and I love how they aren't afraid to put different nuts as a combo! Like pistachio chocolate chip? Bomb!!!", "author": "Annie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "Clark Kent would step into a phonebooth & emerge as Superman (blue tights & all.) I perform a similar feat in an equally claustrophobic space; I step into Batter Bakery & emerge & happier, fattier version of myself (black leggings & all.) \n\nI come here for the shortbread ($5.50 for a bag of 10 minis or $2.25 for one large square.) BB does not sell drinks, but my kitchen is fully equipped with Earl Grey tea & I love a cup with their Lavender Sea Salt shortbread (preferably in bed.) The texture & scent of real lavender makes this my favorite flavor. Honey Vanilla & Sesame Ginger rank second & third. \n\nRecently, I tried a Sand Angel cookie ($2.50, part molasses, part sugar cookie) because of it's rave reviews, but I'm not exactly singing its praises; chewy & dusted with powder sugar, I don't really see it's mass appeal. It's good, but isn't everything at BB?! I want incredible & their shortbread cookies are, so I'll stick to those.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-08", "description": "I came looking for the lavendar shortbread cookie! But they didn't have any today, so I had to make the tough choice of peanut butter cookie vs sand angel. But instead I somehow ended up buying a Mud Devil instead.\n\nAnd after biting into it, I realized that it's the chocolate version of the Sand Angel! It's the chocolate twist of a gingersnap + snickerdoodle combination. Unfortunately, I thought it was a bit dry. :(", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "Recommended by my name twin, this sweet little kiosk is strangely located on the corner of Kearny (correction!) and Montgomery and hard to miss.  They have the cutest and scrumptious looking desserts!!\n\nI got a lemon cupcake, which was kinda small for $3 but sooo satisfying.  The cake was moist and light and the cream cheese lemon frosting tasted alot lighter than Sprinkles but still packed on big flavors.\n\nMy cousin got a sour something lemon something muffin.  It was good :P\n\nChocolate chip cookie samples!  Melty chocolate and semi-crunchy cookie... mmmMmmMMMmm\n\nIt's a delicacy so kind of pricey.  What a treat.", "author": "Kat C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "Sad news.... I wasn't truly a fan of the cupcakes at Batter Bakery and I had high hopes after a friend told me to avoid some of the other bakeries in Frisco...\nSo early Friday morning I hit the kiosk and got a vanilla with vanilla buttercream icing and a red velvet with cream cheese icing. I ate the vanilla one on Friday afternoon (left it in my hotel room) and sadly it tasted stale and the icing appeared to be evaporated off. It was sad really. I had the red velvet on Saturday (a boy has to spread the love) and it tasted much fresher but the cupcake proper was overpowered by the icing. Maybe its because I got mine from their kisok and not from the actual store so I need to try them again, from the store location,  but overall I was disappointed.", "author": "Shaun O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-07", "description": "What makes a good chocolate chip cookie is very subjective, but I think they should be crispy on the outside, gooey in the middle, and have a bit of a spice to them (vanilla, cinnamon, nutmeg, at least something in there).\n\nTheir cookies were dry, boring, and overpriced, so I cannot recommend.", "author": "William H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Wonderful and fresh selections. Inspired recipes. Not the run-of-the-mill flavors. And....half off at 4pm.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "I love the sand angel cookie here - one of my favorite cookies in the city. But i really rate all cookie places on their chocolate chip cookie and theirs is extremely subpar. The chocolate and salt both overpower the cookie taste. there are definitely WAY better chocolate chip cookies elsewhere, get the sand angel if you go here.", "author": "Amelia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-18", "description": "Best peanut butter cookies I've ever had. The end.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-21", "description": "So last min baby shower and i needed cupcakes ASAP! Came here and got yummy cupcakes. Went a 2nd time and \"be back in 5 min\" sign was up, 25 mins later and nobody showed up... BOOO! Went to cupcake cove down the street!", "author": "Jackz C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-03", "description": "Batter Bakery has such a cool location. They operate in a clear booth on the corner of California and Kearny. It's more of a bakery stand than a store.\n\nAll their goodies are on display and clearly labeled (and nicely packaged, might I add). When I visit a business for the first time I like to sample a bit of everything to get an idea of what's good. I am also saying this so you don't think I'm a complete fatty - I was doing research, okay?!\n \nSo I tried:\n- Chocolate pear bread: Really moist, almost sticky. Fresh pieces of pear baked in. The chocolate flavor was subdued.\n- Ginger cranberry scone: It was slightly dry, but I'm guessing it's because I came at 1pm. I'm sure the morning batch is better.\n- Spice cupcake w/ maple cream cheese frosting - This was the STAR. The cake was moist and fluffy, the frosting was creamy and not too sweet. It's an ingenious flavor.\n\nThey also carry an assortment of giant cookies, shortbread, and muffins. Sah-weet!", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-07", "description": "I finally stopped at Batter Bakery in the Financial District of SF.  It's just a small kiosk with a bunch of cookies in glass jars individually wrapped or in bags.\n\nI got a Sand Angel Cookie $2.50.  It's a big cookie, soft w/ cinnamon taste.  It wasn't my favorite.\n\nI should have gotten the chocolate chip cookie (not sure the price, guessing $2.5) or peanut butter blossoms ($5.50 for a bag).  Girl also mentioned the shortbread cookies are popular - didn't get.\n\nThey take credit cards, but I paid Cash.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "5 words: 'Melt in your mouth brownies!' So delicious for a corner stand on the street but I definitely recommend going for a quick dessert stop after lunch in fidi. Don't miss it, it's just a small stand on the corner of California and Kearny. My friend ordered the sugar cookies with the peanut butter cups on top and those were delicious too, even for a person like me who doesn't enjoy peanut butter as much! All I can say is GO GO GO!", "author": "Malika R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "Reviewing this cute little bakery stand as my first official Yelp review! I was surprised at first because it really is just a little unassuming stand on the corner of the street, not even a room that you step inside. It's at a convenient location, though, right in the middle of FiDi and a short walk from my office. There was one friendly girl working at the stand who helped me decide what to get; I went with Yelp favorites - the sand angel cookie and the lavender sea salt shortbread. \n\nThe sand angel cookie: so, so good, I couldn't stop eating it. It's thick in the middle, and really soft and chewy, just the way I like my cookies. It has great flavor, with cinnamon, ginger, molasses and other kinds of spices. It's also not too sweet and even has some salty notes - sometimes I find baked goods sickeningly sweet, but this cookie is just right. I highly recommend it!\n\nI've never been a huge fan of shortbread - as I said, I like my cookies chewy and soft, but others have raved about the shortbread here, so I thought I would give it a try. The lavender sea salt shortbread was pretty good and the bits of salt added a really unique flavor. I didn't taste the lavender as much, it was subtle. \n\nAt $2.75/cookie, it is a bit pricey and probably not something I would get regularly. But for the once-in-a-while treat or the occasional craving for something sweet, this place is awesome and has some really unique offerings!", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-29", "description": "After this place was noted as having one of the best cookies in the US (chocolate mint), I had to try it.  I am a huge fan of mint and chocolate, and generally love everything with mint and chocolate together.  However, this cookies was a let down. It was not that minty, and it tasted a bit stale, which I thought was odd, since the cookies are baked fresh daily (or at least that's what they claim).  I also tried the triple chocolate espresso. It was honestly better than the chocolate mint, but still not amazing. My friend really liked his peanut butter cookie. At $3.25 a cookie, I expected something much better. Definitely disappointing.", "author": "Deborah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "Sweet mother of pastries, I've died and gone to cookie heaven! Thanks to Yelp's Sugar High Week and Sylvia D., I'm buried in monstrous sand angels! No, don't bother trying to dig me out... I don't need your help. Just give me a few minutes to eat my way out -- I insist!! \n\n*nom nom nom* \nDid I mention last time how deliciously chewy these are? \n\n*nom nom* \nAnd their fantastically melt-in-your-mouth texture? \n\n*nom nom nom nom*\nOh boy, how do they do it??\n\nDon't forget to pick up a pack of shortbread cookies, too! I thought the hazelnut-chocolate-sea salt would be my favorite, but there's a little too much going on with it. However, the lavender-sea salt is absolutely lovely and so delicately flavored, yet well-balanced (doesn't taste like soap, either!).... And the orange-pistachio is just perfection.", "author": "Pauline D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "I consider myself lucky.  I work near Chinatown (translation: cheap food), and I get to walk through the Financial District every day (translation: hot guys in suits).  Another thing that makes my day is the fact that there's a bakery right on the corner of California and Kearny.\n\nI finally took a few minutes out of my day to stop by Batter after passing by for the past few months.  There were people in line, and they all seemed to know what they wanted, so it went quickly.\n\nI asked the girl what was good, and she pretty much gave a brief description of each thing (brownies, scones, shortbreads, cookies).  Information overload plus a guy waiting behind me led me to make the quick decision to get a Pluot Pecan Scone and a Chocolate Hazelnut Shortbread.  The total was $4.75.\n\n5 stars for the scone; it was moist and fluffy, and the pluots gave it a nice tang.  It's a very large scone, so sharing is ideal unless you're a greedy hungry girl like myself.\n\n3 stars for the shortbread, although my coworker really liked it.  It wasn't light and buttery enough for me, and it almost tasted like it had too much brown sugar or something.\n\nI really wish I had more time to browse and look at the other items (didn't see cupcakes), but I didn't want to hold up the line since it's such a tiny kiosk, and everyone already seemed to know what they wanted (brownies).  But I will definitely stop by whenever there's no line, so I can more carefully peruse the cute little baked goods.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-23", "description": "The booth is very cute, but from the few items I've bought over time, I'd say that overall it's only okay. Quality is not consistent, I can get better elsewhere, and prices aren't that cheap. Personally I'd rather buy a sandwich instead of a bag of cookies.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "As I typed in \"brownie\" with my Yelp app, this address came up. I was a little surprised to find that this is a glass kiosk on the corner of California and Kearny.  I needed some sweet things for an office, and the girl inside the kiosk helped me select some great things. She was helpful, although I think the products sell themselves. This is a second location from the parent bakery located in Russian Hill (Polk/Broadway). The desserts are packaged very nicely... single wrapped or wrapped in two to four in mylar bags.  My two favorites were the decadent chocolate brownies and the double chocolate sandwich cookie.  You can also get a baker's dozen punch card (buy 12 treats and then get one free).  What took me so long, hehe?  4-stars!", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "The chewy chocolate chip cookies are pretty tasty. A lil pricy, but definitely hits the sweet spot.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-27", "description": "I'm definitely in love with this adorable kiosk.  It looks like it should be a flower shop or newspaper stand, but instead it's filled with fresh baked goods attractively displayed in glass jars and paper bags stamped with Batter Bakery's logo.  The big thick cookies, brownies, and bars all look tempting.  They were out of cupcakes that afternoon.  I saw that they sell Siggi's yogurt - my favorite yogurt - and homemade granola.  You can tell by looking at everything that they bake with love (the baking occurs in SF).\n\nThe shortbreads come in interesting flavors like sesame ginger, honey vanilla, lavender sea salt, orange pistachio, etc.  I bought a pack of 10 all honey vanilla shortbread cookies ($5.50) and they came tied with a brown satin ribbon.  Oh, the flower shapes were adorable.  The cookies were thick and soft.  Most shortbread that I've had tends to be dry but theirs wasn't.  It was amazingly good.  They smelled faintly of honey and were sprinkled with crunchy raw sugar.  \n\nIt's a shame they don't have room to sell drinks.  I would love some hot tea to go with my shortbread cookies.  Apparently if you arrive early, you'll see scones, muffins, granola, coffeecake and quick breads (breakfast items).", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "This kiosk is so cute! They honestly should be selling flowers instead of baked goods but I won't complain because...\n\nBaked goods trumps flowers any day.\n\nEveryone raves about the Sand Angel cookie ($2.50). Okay folks, it's good but it isn't screamin' good! I don't get what the hype is about? Maybe because it tastes homemade and it's not too sweet? I don't know, whatever it is, I think I'll get another one next time, haha. But this time, I'll have it with a glass of milk to see if it kicks it up a notch. \n\nThey sell a lot of baked goods here from cupcakes ($3) to brownies ($2.75 I think) to scones etc. I'll be back to try out more :9 \n\nYum!", "author": "Heidi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "I hiked all the way up the hill in the pouring rain to get a cookie.  Imagine my disappointment when I saw an empty kiosk!  Disappointment turned to happy when I saw the sign that they were in the BofA building during the rainy week.\n\nI ran into BofA and found their little set up at the concourse area.  All the goodies were neatly wrapped and displayed.  When I was browsing, two gentlemen were there and they asked how much such and such was. Each response got a \"holy cow\" from them.  They left without buying.\n\nI plopped $2.50 down for a oatmeal chocolate chip cookie.  Those cookies were ginormous!  The cookie is chewy and not too sweet.  You can definitely taste the oatmeal, chocolate chip and maybe cinnamon.\n\nThis place is great for a treat at the end of the week?  Hey this rhymes!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-04", "description": "Not exactly what I was expecting as a cute bakery! I went to one of their storefronts and faced very poor customer service. I also noticed that the premade food in the case had bugs flying around and the dishes were quite cold and unappetizing. On the other hand, the baked goods and treats were very delicious and the look/vibe of the bakery was pretty homey.", "author": "Leia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-30", "description": "I've walked past this place, often and I've passed up opportunities to try this place...Nonetheless when vendors bring swag by, you don't say no.\n\nA copy service brought some by the office.....\n\nHoney vanilla shortbread cookies. Soft. Honey was a very different taste for shortbread.  So while I thought they were very pretty and nice quality, I was unable to consume more than 1 out of the whole package!\n\nRed velvet cupcake with cream cheese frosting, and chocolate cupcakes with caramel buttercream...zomg. :)  Okay...I already had one of each, and now I have 4 more staring at me...to eat or to wait.\n\nRed velvet, FTW!!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "It's the cutest little kiosk in downtown SF sandwiched between huge financial buildings. It reminds me of a phone booth every time I enter by taking a step up onto the raised surface this kiosk sits on. \n\nSand Angel: I still don't get the hype and perhaps I'm not so much a fan of snicker-doodle or gingerbread cookie flavor. \n\nBrownie: It's rich, great portion size, and very chocolaty if that is your thing. \n\nBagged shortbread cookies: I tried both the orange and sea salt lavender flavor. If you like lavender, this one is for you. Subtle fragrance and definitely not overly sweet at all (this applies to both flavors). perfect for tea time or to accompany coffee. The scent of lavender reminds me of soap, which I prefer not to eat so I would go for orange as my preference. \n\nCupcakes: I tried their red velvet and lemon pomegranate. They come in a lovely mini cardboard box! Okay, their cupcakes aren't as big as what you would get at other places, but packaging and flavor make up for it. Lemon pomegranate wins in my book!\n\nQuick service if you know what you want and have been there before. Otherwise, it gets pretty overwhelming being in the little kiosk with so many goodies to choose from. \n\nP.S. They take credit cards and go early or else they run out of items pretty quickly later in the day.", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "Cookies were thick, soft and chewy and full of delicious flavor!! Will definitely use them again!", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-23", "description": "So, full caveat--my review is not about the food itself, but about the service.\n\nFor the food, Batter Bakery is delicious. Absolutely amazing cupcakes that come in little individual boxes, great for gifts for coworkers. Interesting flavors of pastries and cookies, always delicious.\n\nHowever, half of the times I've been here, the kiosk has been closed during the hours it should be open. I have full understanding that it's difficult for a single person to man a space for hours on end, and you need to take breaks occasionally. However, at least put a sign up to let customers know when you plan to return. Just bad business practice to leave your space unattended during operating hours, with no indication of when you plan on making it back.\n\nAfter the third time of this happening, I won't be going back. Cupcakes and pastries are great, but there are other places that are more reliable.", "author": "M H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-01", "description": "This review is for the catering services of Batter Bakery.  \nI have ordered both a breakfast assortment of baked goods including scones, muffins, breads, and quiche, as well as the yogurt, granola, and fruit salad.  \nI have also ordered a dessert assortment with a little of everything. \nBoth deliveries arrived on time.  The food was amazingly good and was loved by everyone in our meetings! This is very important when placing catering orders for meetings. \nI highly recommend the food and service of this company!", "author": "Amy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-02", "description": "I had the last lemon cupcake a few days ago and it was just a standard lemon cupcake, but it was too small for my liking. The chocolate chip cookie was good, but again, just standard. The sand angel cookie was pretty good and crisp. Of course, this place is just adorable, which is why I was attracted to it in the first place, but their sweets are nothing spectacular.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Cinnamon pear bread is out of this world.The cherry bran muffin is also amazing. Sometimes I question the price and reputation of SF food, but BB makes it legitimate. The bread has huge chunks of pear paired with soft crumbles of bread *drool.", "author": "Ingrid K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "Pick up some scones here on your way to work and I guarantee you'll be the hit of your next meeting! They always have interesting flavors, and carry a good mix of sweet & savory (figs, goat cheese, butternut squash, beets, etc). In fact, their flavors are so enticing that I often walk on the other side of the street, just so I'm not tempted by their newest flavor! I've also tried their muffins, breads, and cookies, and all are delicious. And the cute bags of cookies make for a great gift for a coworker. If you're ordering for a group or want specific flavors, be sure to place your order a day in advance, since supply is limited at this little kiosk.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-02", "description": "Batter sells dainty delectables from a charming little kiosk. There's a premium on cute, so it's to be expected that the prices are on the higher end for these prettily packaged baked goods...\n\nBut looks aren't everything, of course--taste still prevails!  I had such a hard time deciding between brownie vs. cookie vs. cupcake. But in the end, the cupcakes ($3 each) won out. They were scrumptious and expertly frosted with a delicious buttercream in the perfect ratio of frosting to cake. I enjoyed the devil's food chocolate  and my friend raved about the red velvet.  \n\nBatter is brilliant for a little afternoon pick-me-up treat!", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "best lavender shortbread I have ever had - wish they had more flavors - I had some lovely rose ones in France... do it!!!", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "Brownies!  Wow, these are the best brownies I've ever had - they are dense, thick and moist...it's like biting into pure chocolate.  Typically brownies usually range from cake-like to fudge-like and batter's version is perfect.  I don't think I'll be able to enjoy other brownies knowing that this is the place to go for the best...nice!", "author": "Ken G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-08", "description": "OMG I'm so ecstatic to have found an incredible spot for baked goods by my work! Knowing me and my sweet tooth, I had to check out Batter Bakery as soon as I discovered it. You really can't miss it on the corner of Kearny and California (the address isn't accurate) since it's an awesome little round, glass kiosk. (http://www.yelp.com/biz_photos/fLL5hu-3oRKZdZjEv3J5Gg?select=aWo8fg7sR7gJNKSDbW5lrg)\n\nThe free samples of the lavender sea salt short bread cookie enticed my sister and I to check out the rest of their offerings...it was so delicious with a slightly salty and fragrant lavender flavor. The girl who worked there was helpful and friendly too! We ended up getting the cinnamon pear bread ($2.50) and the sand angel cookie ($2.25). The bread was SO moist and filled with bits of pear...I loved the bold cinnamon flavor. It came in a pretty thick slice wasn't too sweet either. (http://www.yelp.com/biz_photos/fLL5hu-3oRKZdZjEv3J5Gg?select=5DjBdYJK3qCL9P4HHG9G2w)\n\nThe sand angel cookie was a mix between a snickerdoodle and a ginger cookie according to the worker but I could see why it's a best seller! It was a HUGE cookie and wasn't to soft or crunchy. It tasted like caramel with a hint of spice to me which I absolutely loved! (http://www.yelp.com/biz_photos/fLL5hu-3oRKZdZjEv3J5Gg?select=bGqSuZvosBCZp_X7IcMRoQ) I've also had their oatmeal chocolate chip cookie ($2.25) and that was divine as well. I could tell their baked goods were fresh and made with a lot of heart. \n\nThe portions were definitely not small so the prices were reasonable. It would probably be safe to share the sweets with someone so you don't go overboard! Keep checking their website for new recipes or items they come up with. Totally in love and will be my go-to location for after-lunch sugar cravings!", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "I've been here on a last minute cupcake run and I've been here after a couple days in advance catering order and every time has been pleasant...not to mention DELICIOUS!\nTheir cupcakes are fresh if not a little small.\nTheir pumpkin bread is so moist and buttery, it just melts in your mouth.\nAnd as my colleague said...finally someone knows how to make a decent scone!\nBe sure to check their website for various seasonal goodies, that may not be available at the kiosk unless upon request.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "so i took everyone's advice and tried the sand angel cookie today and it was HEAVENLY. I'm a sucker for snickerdoodles and gingerbread cookies (but not ginger snaps...!) and so once I bit into the cinnamon-sugary cookie and tasted the hints of spices that taste like the holidays, I was hooked. The sand angel ties with anthony's cookies' cookies and cream cookie as my favorite cookies in SF! \n\ni also got the chocolate hazelnut shortbread and though it was good - the hazelnuts are plentiful and the chocolate not too sweet - it wasn't unforgettable. i wish i had just gotten one instead of a whole pack. maybe the other flavors are better?\n\nthe little kiosk was visible from afar, and the different baked goods lining the windows just beckoned me. the girl manning the cash register was really sweet, even going out of her way to contact the bakers to ask if the shortbread cookies had eggs when i asked (btw, they don't! :D)\n\ni plan to go back for another sand angel, and hopefully go early enough to try one of their lemon oatmeal walnut muffins!", "author": "Julia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "The lady loves this place.  When she is mad.. this is the only place that will make asking for forgiveness eas.....  ier.  Best cupcake in the bay areaaaa\n\nThey loss one star because of their lack of creative flavor.. always the same old but good shit..  \n\nTheir cookies and scones are like crack too..", "author": "L C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "A little stand in the Financial District of San Francisco WOULD have 100+ reviews... I walked into this futuristic time travel sort of pod in order to get some goodies for breakfast. On the rainy day, it ended up being Buy 2, Get 1! And when in a new foodie city, discounted baked goods are a real treat.\n\nThe items are crafted by hand, and the rustic take on most of the goods is really intrinsic to their brilliance. They are simple, yet tasty--flavorful, but not overwhelmingly complex.\n\nThe chocolate hazelnut shortbread was super crisp, not boasting too much butteriness or sweetness; just right. The carrot ginger cake provided a little sweetness and moistness from the fruit and candied ginger, and the ginger gave you a slight punch in the face; also, ridiculously moist. The cherry scone was crisp and tender, tart and crunchy; really a quality scone.\n\nThis outpost of Batter would really serve you well for a quick bite or snack. Give it a shot, and I can assure you that you will fall in love with their sweets... as they are not TOO sweet.", "author": "Solomon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "This quaint little cylinder of baked goodness is a rich respite amid the bustle of FiDi. Honey Fig Goat Cheese Scone this morning was perfect - crisp outside, rich buttery inside, subtle sweetness. One of the best scones I've ever had the pleasure of consuming!", "author": "Jacob J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-12", "description": "This is the tiniest bakery I have ever been to. The size of a phone booth!\n\nBut, it's big enough to carry all the wonderful little treats you may want to boost your afternoon a bit. I thought their chocolate chip cookie was just okay, I didn't like that the chocolate was added to the cookie like a sandwich (cookie-chocolate layer-cookie) and parts of it were chunks of chocolate. The second thing I didn't enjoy was that it had a strong taste of cinnamon.\n\nI'd love to come back and try their breads and cupcakes.", "author": "Stella C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-29", "description": "We recently used the chocolate chip cookies from Batter Bakery for our wedding favors .... and let me tell you, they were a HUGE HIT!  We really wanted something that would be fun, festive and memorable ... and the ENORMOUS cookies from Batter Bakery were perfect for the job.  Weeks have gone by and our guests are still asking about them.  \n\nI contacted the owner, Jen, a few weeks before the big day via email and her and her staff were simply wonderful to work with.  With only weeks to go, I really was looking for a baker who would manage this fully so I could worry about other things (hello? can you say placecards?)  \n\nAfter contacting several bakers in the city (Specialty's, Anthony's) I found that Batter Bakery was the ONLY company that would completely do the favors ... from baking, to individually wrapping, to tying on the matching color coordinated bow and having them delivered to Sausalito on the big day.   By taking this over, I had one less thing to worry about on the day of our wedding ... which meant I got to enjoy myself even more! \n\nI would say the ONLY difficult part about working with Batter Bakery was deciding what flavor of cookie to use because they are all soooooo good!  (TRY THE SAND ANGELS!!!)\n\nIf you are looking for a unique, fun and edible wedding favor ... or if you have a 2PM sweet tooth in the FiDi, you absolutely need to check out Batter Bakery!  If you love baked goods like I do, you'll be glad to have a new spot by your office to help with your sugary cravings or a baker to go to when you want something unique and special on your big day.", "author": "Sho O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-03", "description": "Little did I know that a little glass kiosk sells treats this good! The Mud Devil cookie is THE best chocolate cookie I have ever had. I would like to add that I am not a cookie person, but one day they ran out of cupcakes and I tried the Mud Devil. It's earthy, deep, and chocolaty but not too sweet. Just has an incredible flavor - the closest thing I can think of is Mexican chocolate. \n\nThe cupcakes are great too! Very moist and yummy!", "author": "Aleksandra B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-27", "description": "Definitely a good concept with having a small kiosk/booth to sell fresh cookies. \n\nGot some cookie packets and while they were cute they were somewhat dry to me. \n\nThey mentioned that they are opening a store location in Russian Hill. \n\nAt least there is a local dessert spot in FiDi.  You need something other than fro-yo after a salty lunch!", "author": "Anya R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Red velvet, devils food, and vanilla cupcakes were all good. All felt dense and I expected them to be dry but they were surprisingly fairly moist. My fave of the trio was the devils good and I would certainly buy it again.", "author": "D B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "I contacted Batter Bakery to help with a work catering event. I wanted to allow the employees to decorate their own cookies for Halloween. My commuincation with Jen, the owner, was a bit sporadic but she does the baking so I can understand being busy in a kitchen & not able to always answer the phone or return emails quickly. What they provided was what I was looking for, so in the end it worked out well. \n\nA few dozen cookies cut into various Halloween shapes - cobwebs (that one was hard to figure out shape), ghost, cat, tomb, and bat. The cookie tasted like a shortbread cookie. All royal icing with food coloring added to make different colors. Lots of sprinkles in various colors provided. \n\nThe employees enjoyed it very much, so I would recommend Batter Bakery for a custom cookie event.", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "Cute clean place...nice decor and packaging but it's too expensive for what you get. \n $2.75 for a cookie?  Come on!  Also, no gluten free options for dessert?  Not even one?? I guess it's good for a treat here and there...", "author": "Sasha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "Update- Manager can you please serve cookies and treats WITHOUT salt? Not all of us desire a salty sweet snack.  \n\n\nI like this place a lot. their scones are some of the best ive had and from time to time i will purchase an afternoon treat.  Bakers please stop putting salt on your sweets!!  I think its acquired taste and not all of us like it or want it. I type this as I am picking the salt off my blondie. Had I known there was salt on it, I would not have purchased it.", "author": "Tina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "Glad to see something to fill our sweet cravings on 3pm workdays has moved into the hood...first a flower shop, then chocolate, and now a cookie kiosk! Hope this one sticks!\n\nFriendly folks, cute little boxes, cookies, cupcakes, and shortbreads!\n\nI had a \"sand angel\" which is their signature cookie (a cross between a sugar cookie and a molasses cookie) and enjoy it's warmth from being in the sun! Excited to head back here on our next snack break.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-24", "description": "Thanks to the Yelp Sugar High Week, I have found my new 3pm sugar fix.\n\nI work just a block away from this kiosk, and walk by it at least 3 times a week, but have never ventured in before today- and I'm very glad I did.\n\nYes, it was rainy... yes, it was windy.... but I found it inside of me to leave my work and walk 1 block down in the rain to get these cookies before the sugar high event ended!\n\nThe lady running the kiosk was very sweet- she suggested the sand dabs and the lavendar salt shortbread cookies.\n\nThe sand dabs were absolutely out of this world.  I usually don't like gingerbread cookies (too strong) and snickerdoodle cookies (too sweet), but these cookies were AMAZING!  the spice was not strong, the cookie was not to sweet, and it was HUGE!  Both chewy and crunchy at the same time, I can safely say this is one of the best cookies I have ever had.  I was sure to share the wealth and passed some around the office- having got a box of 6 for $7.50 (which, originally, not during yelp sugar high is $15) I knew there was no chance of taking this home without devouring them all to myself tonight.\n\nThe sand dab was so huge, I couldn't even finish half.  I still have the lavender cookies to try and report back about.  But until then, I recommend this kiosk for the perfect pick me up- any day of the week!  There were lots of yummy looking treats, I look forward to trying them all!", "author": "Clarissa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-28", "description": "Still loooove their stuff!\n\nNew fave: lavender sea salt short bread\n\nThings I've eaten from here so far:\n(* = super)\n\n* - sand angel cookie -- dense\n* - chocolate chip cookie -- fat chips\n* - mint chocolate cookie -- super chocolaty and rich\n* - apple sour cream coffee cake -- super moist\n- red velvet cupcake -- a little dry\n* - 5-layer bar -- rich\n- chocolate chip pear bread\n- pumpkin chocolate chip muffin\n* - pumpkin choc chip bread -- moist and super chocolaty\n** - brownie--so rich you can only eat 1/2 at a time", "author": "Kat H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-18", "description": "Wow.  Batter Bakery put together the most amazing basket I have ever seen.  I had three people ask me about the basket at Starbucks getting coffee.  Inside this adorable two handled picnic basket was a delicious quiche, several kinds of muffins, two yummy scones, some sort of granola/oat fruit bars, a bag of granola, a bag of cookies, two chocolate sandwich cookies and four little tangerines.  Everything was super delicious as well as beautiful.\n\nI", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "Thursday, 10:00am\n\nME: Hi!  Do you have any Sand Angels today?\nBATTER BAKERY GIRL:  I'm sorry, no.  Usually we do, but not this morning.  We will get some later today.  Check back after 12:30, okay?\nME:  Cool!  \n\nThursday, 3:05pm\n\nME:  Hello!  Any Sand Angels left?\nBATTER BAKERY GIRL:  No - we sold out.  I'm sorry.\nME:  Aww!  Oh well, maybe tomorrow.\n\nFriday, 11:57am\n\nME:  G'morning.  Got any Sand Angels?\nBATTER BAKERY GIRL:  Yep.  We have ... two left.\nME:  I'll take both of them!  \n\nSo good they sell out daily?  You better believe it!  The Sand Angel is one helluva cookie and it's moist, dense, chewy, crunchy, sweet, sugary and oh-so-filling.  Completely worth more than the $2.50 you'll pay for it.\n\nTheir Strawberry Walnut Bread is great too.  More of a bread than a sweet, it tastes great with your own cuppa joe.  Dense, with a moist interior and firm yet soft outer crust.  The walnuts aren't toasted but they still add a nice texture to the bite.  The strawberries have blended into the bread during baking and add a nice sweet pop to the taste when you eat it.\n\nI've had their chocolate chip cookie too, as a birthday treat from my friend who introduced me to this little kiosk - all cute and ninjalike on the grounds where I currently work.  I never knew it was there until she told me!\n\nMaybe that saved me a couple pounds last month.  Can't say I'll keep that off this month now that I know when to ask for Sand Angels :)", "author": "Eileen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-21", "description": "The FiDi has really missed out on the small shop fancy bakery craze.  The concept of Batter, an extremely small pastry stand with the main bakery across town, is a welcome import.  It offers a lot of different types of baked goods (cookies, cupcakes, brownies, muffins, scones, biscotti, bars, etc.) that you might begin to wonder if they can be superior in them all or any of them.  Having only tried the cookies and cupcakes, I wasn't blown away.  However, they were tasty and I'm motivated to try other dessert items in search of that \"win\" category.\n\nSand Angels: Touted as \"Batter's Signature\", I had to try it.  Allegedly the ingredients are top secret.  I got the taste sensation of cinnamon apples.  Moist and chewy despite not being fresh out of the oven.  I usually don't like praising chains, but I give credit when credit is due.  Specialty's may not use organic ingredients and unique recipes, but they are a better afternoon cookie option because of the fresh gooeyness of cookies that have just been just baked.  If only Batter wasn't confined to such a small stand...\n\nRed Velvet - Cream Cheese Cupcake: Small red velvet cupcake topped with a wobbly dollop of cream cheese frosting.  Maybe I'm biased because of Red Velvet cupcakes from Magnolia's and Billy's in Manhattan, but the frosting just did not wow me.  Firmer and creamier would be much preferred to the runny glob.  There is also a red candy coated chocolate on top.  Looks nice, but the chocolate taste is inconsistent with the overall red velvet experience and probably better without.\n\nGerman Chocolate - Coconut Pecan Cupcake: The frosting is a big win for me!  Loved the coconut and pecans connected by an almost caramel paste.  The chocolate cup cake base was nice, though could stand to be moister.  Again, the chocolate candy topping was a little unnecessary.  It was a chocolate disk without a coating and added a texture that didn't mesh well the otherwise pleasant sticky topping.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-29", "description": "I have walked by this place numerous times ever since it's open. Today I received a small gift of a cute mint chocolate muffin. It was fresh good taste.\n\nI always think this place would have a lot more people wanting to try if they also serve coffee or hot chocolate because it just seems goes well together and even makes a romantic photo op, especially this cute spot is sitting at a landmark corner along the hilly Cable line.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-21", "description": "I love walking by their little corner kiosk on California for the lavender shortbread, but the pop up shop in Embarcadero 2 is killing me because it's too close for my own good.  I bought some desserts yesterday to share with coworkers, and they were so yummy - the sand angel cookie especially.  The chewy chocolate chip cookies, peanut butter cookie and cupcakes were tasty too.", "author": "B. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "Kiosk food is tricky stuff, maybe best left to See's in airports and Boudin's in malls where freshness isn't as critical.  I'm also not convinced that the word organic means a lot when it comes to baked goods, other than a way to raise the price and assuage the angst of overpaid yuppies who can't resist buying gas guzzling Range Rovers to feel 'taller' than other people.  At any rate, Batter Bakery is another hip, smart food service concept aimed at entering a highly profitable market with lower start up costs than a full service restaurant as well as the ability to sell to restaurants,  markets and individual customers thereby tripling the profit potential.  It's a smart business with enormous margins if managed properly.  From the experience I've had with Batter Bakery, they measure up beautifully to the creative business plan they started with.\n\nBatter Bakery scones are among the best I've ever found in San Francisco and deserve a place in the scone hall of fame should it ever arrive.   The company behind Batter Bakery is smart and efficient with a highly profitable business model I hope succeeds.  The kiosks were provided to San Francisco by the French outdoor advertising company who agreed while Paris loving former Mayor Willie Brown who occupied the throne at City Hall before Gavin Newsom.  Many ideas were proposed for the 75 or more kiosks given to the city by JD Decaux outdoor advertising for use as news stands, an idea that failed.  Batter Bakery is proving that nothing need be wasted when opened up for the possibilities, and our beauracratic bastion of bumbling blunders finally may decide to bring revenue and job producing activity to another SF snafu.\n\nI think this company produces pretty darn good cookies, muffins, scones, bars, other baked goods and an amazing yogurt breakfast bar where patrons can make their own parfait and walk away deeply satisfied on many levels.  I think this company will bring us many more fine quick food ideas that are organic, nutritious and fun, good job Batter Bakery.", "author": "Stu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "My dental hygienist recommended Batter for scones. She specifically raved about their strawberry scone. I love baked goods, so I had to check it out. Unfortunately their strawberry scone wasn't available today, but I got the apple cinnamon scone and it is TO DIE FOR. I'm in heaven! I just called the dentist's office to let Cheryl know how in love I am with Batter. Go there now!", "author": "Kate V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-21", "description": "Cupcakes were pretty good. Not the best cupcake I've ever had, but good for San Francisco!! I can't find a great cupcake anywhere in this city.", "author": "Maggie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-06", "description": "I really wish I could love Batter Bakery. It's so quaint in the little glass kiosk  right near the Bank of America building. It would be absolutely perfect to go to the bank during my lunch break or on my way to work and go back up to the office via California for a cupcake, cookie or scone.\n\nThe scones at Batter are not too sweet and the perfect texture. The cranberry ginger scone had just the right amount of every flavor and were very reasonably priced. However, the cupcake I had was a little dry and the lavender sea salt shortbread cookie was one of the worst things I've ever put in my mouth. It tastes like potpourri and the salt flakes are too big so that overpowers everything.\n\nGo for the scones in the morning from the cute little kiosk, but it's not someplace I'll go out of the way to visit (even if it's only 1 block from my office...)", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-10", "description": "Ok, so I've been hearing about  the Sand Angel cookies at Batter, the adorable little bakery kiosk on the corner of California and Kearney.  This week I think I hit my total crave limit for something I never even TRIED.  But I knew...I had to!  I started talking about them to my friends at work and how the Yelp'ers rave about them.  So, life goes on and today I'm talking to a friend at work and we're discussing the darned cookies again.  I then go into a meeting and when I return to my desk:  THERE WAS A SAND ANGEL!  It was a sight to behold.  I found the perp who left it at my desk and gave her a huge hug...and I didn't even try it yet!  It was close to lunchtime and we made a pact: We don't try it until after lunch as we were going in different directions for our actual lunch.  Within minutes, she calls to tell me that she \"broke the seal\", meaning the wonderful packaging with the \"Batter\" sticker on it.  She's chewing as she's talking. She rates it 100!!  I can't take it anymore. I break the seal on mine and OMG it was the most incredible bite of a cookie I've had in years.  The Sand Angel is NOT hype.  It's pure heaven!  Part cinammony, party gingerbready, powder on top...mmmmm.  But I only take that one bite.  I put it out of sight.  By this time, my friend's cookie is GONE.  She's wanting to know where mine is and I won't tell her..it's lunchtime and I don't want her rifling through my desk : )  \nI get back from lunch and eat another 2 bites.  I'm kind, so I save the rest for my boyfriend for the ride home so he can enjoy the experience.  I never thought he would like it but he said, and I quote \"F!  This is great!\".  Classy!  But it was gone in seconds.  Needless to say, little bakery kiosk, we'll be baaaaaaack!!", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "Finally, cupcakes in the FiDi!  5 stars for \"Sand Angel\" cookie - 2 stars for dry cupcakes+1 star for excellent frosting = 4 stars. At work, sometimes I get an intense craving for baked goods/cupcakes.  Found this little kiosk on a yelp thread and decided to make a late lunch of it.  (Note: I was starving at 3pm, so perhaps that may have influenced my taste buds...)\n\nWhat I got:\n1. red velvet cupcake ($3) - perfect size (not HUGE). Cake was dense, could taste the hint of cocoa in the cake, but cake was kind of dry (maybe b/c the cupcakes were sitting in a box since the morning?). The frosting, though, was purely DELISH.  Creamy, fluffy, smooth texture, melty, tastes like frosting you can make at home, with cream cheese, powdered sugar.  I pretty much ate the cupcake from the top down in 30 seconds. Oh, there is a cute red chocolate-like m&m candy on top of the frosting. I found that the sudden chocolate candy flavor didn't quite go with the cupcake, threw it off. cute, but didn't work, taste-wise.\n\n2. Sand Angel cookie ($2.50-ish?).  Big, somewhat soft cookie. A cross btwn a sugar cookie, snickerdoodle, with some molasses to give it the chewy texture. Lovely!\n\n3. Lavendar Sea Salt Short Bread ($2+?).  I wouldn't normally go for shortbread, but the flavor pairing grabbed me and I love it.  Strong lavendar aroma, so either you'll hate it or love it.\n\nI wish they had a vanilla-vanilla cupcake, my benchmark for comparisons.  Next time!  The lady working there was nice, said they post daily offerings/flavors on their facebook page.\n***\nDay 2, I tried:\n4. Vanilla cupcake with Chocolate Frosting.  Cupcake was too dry (again!), sadly. And lacked vanilla flavor, or discernable flavor. Frosting was good though.  Stick to the frosting at this kiosk...\n\nDay 3:\nRaspberry chocolate chip scone (b/c they sold out of cupcakes!).\nSurprisingly scrumpdilydelicious.  Buttery, not a hockey puck.  The tangy raspberry went so well with the choc. chip.  These scones are pretty big. Full of butter, I'm sure. I felt like a lard-o after eating it, but I enjoyed it!\n\nDay 4:\nStrawberry cupcake w/cream cheese frosting.  Frosting=A. Cake=D.  Had no flavor, tasted a bit like raw dough. Sad, b/c their other cupcakes are pretty good.  Jennifer, please work on recipe!\n\nDay 5:\nOatmeal Cherry Cookie.  Oatmeal cookie w/dried cherries.  This was ok. I ate 3/4 of the cookie before i hit the first dried cherry.  And the entire cookie only had *2* dried cherries!!!  (what?!!?) The cherries add a nice tartness.  So I just wish the cookie had more thatn two dried cherries!  Also, the flavor of the cookie reminded me of the sand angel, except with texture (oatmeal, duh).", "author": "Caroline I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-16", "description": "I am happy to say my office is right around the corner from the batter bakery kiosk.  Whenever I don't have time to eat breakfast at home and want good baked goods, I stop there.  For breakfast, I like their moist bread or scones.  Their caramella and shortbread cookie is to die for.  I tried a few different lavender shortbread at different bakeries but have to say batter bakery's lavender shortbread is my favorite!!!", "author": "Junko S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "This little kiosk has turned many of my frowns upside down :-)))\n\nI had the most perfect german chocolate cupcake from them during Valentines season and I have yet to see it again :-( Good thing they have oodles of other goodies for me to try :-)))\n\nMud Devil cookie\nDevils Food cupcake\nLavender shortbread\nBanana cupcake w/ nutella frosting\n\nI refuse to eat anything but dark chocolate when it comes to sweets or baked goods except when I'm dealing with batter.", "author": "Coco M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "Sometimes there are cupcake emergencies...there just are....sometimes its 2 pm and your computer crashes and candidates are crying and clients are yelling and I say to myself...\"this is a cupcake emergency\". \n\nBatter Bakery has strategically placed their kiosk on California street for such times...however there should be a little sign outside that says: \n\n\"in case of emergency, DO NOT Break the glass\" \n\nSometimes they are out of your favorite flavors ( I mean there is not a lot of room in there!) but you always manage to find something great- Red Velvet, Carrot Cake, Sand Angels all amazing and home made-like...I also like that your one little cupcake comes in a cute batter box. \n\nSo...the next time you have a cupcake emergency I suggest you run like heck to Batter and eat your emotions. \n\nBring your cash- $5 should do you.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "High quality. Delicious. Friendly Staff. Easily accessible by BART. \n\nAte the Peanut-Butter Cup Cookies, Devil's Food Brownie, and Carrot Cupcake. The PB cookies were super savory. The brownie was soft and rich. The cupcake was fruitier than most cupcakes and pleasingly moist; a nice change from many other cupcakes in the city.\n\nPlus, it's situated at the bottom of the hill leading up to the Fairmont Hotel that you can jog, walk up afterwards to work off a handful of those satisfying calories.", "author": "Sharand N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-01", "description": "An amazing little gem of sweet yummy goodness!\n\nTheir chocolate peanut butter cupcakes are the best I've had. A deep dark chocolate cupcake frosted with creamy peanut butter whipped topping, which is velvety smooth and doesn't have a hint of any granulated sugar crunchiness. Top that off with a mini peanut butter cup and you have the most divine snack ever. It's a good thing they don't have them every day because I'd be broke buying my stash. I am practically salivating just thinking about them now.", "author": "Lori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Me and the hubby were out in San Fran for an appt and what do you know. There's a kiosk selling cookies. I had to stop to see if I spotted anything interesting because I am always on the lookout for a perfect cookie, a soft yet chewy center with just the right amount of crispness on the outside. And I found just that. I went with a peanut butter and he got the sand angel and let me tell you, they were both delicious. I will definitely be buying again as soon as I am in the area. That is if I don't give in to ordering online before that.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "Batter Bakery now offers breakfast, and not just baked goods, but also parfaits. A more accurate description would be a parfait bar, as you can mix and match between house granola, house dried fruit and skyr. What's that, you ask? It's a thick yogurt from Iceland (http://www.skyr.com/), And it's amazing. Nonfat, all natural, no artificial anything. Agave syrup as a sweetner. High in protein. Delicious.\n\nI went all in and got everything. You should do the same.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "This little kiosk at the corner of California and Kearny is adorable!  It's hard to miss and is literally at the corner in front of the huge B of A building.    \n\nI've tried their cupcakes, which are okay.  I've had better.  Their cookies, however, are to die.  My favorite cookie used to be from Specialty's (I'm sure you know which one).  But, now it has been replaced by the most amazing Peanut Butter Blossoms.  OMG.  I can literally eat an entire bag in one sitting.  It's something that I crave every week.  I've also tried their shortbread cookies, which are really good.  One in particular, the Lavender Sea Salt Shortbread Cookies, is a great mix of salty sweet.  I like the balance of the two flavors.  Some may not agree, especially if the taste/smell of Lavender is not so appealing to you.  But, I don't think it's too overpowering, so I enjoy it.  With the subtle sprinkling of sea salt on top.  It's another win for Battery Bakery.  I can't wait to try the rest of their baked goods.  \n\nThey accept CC.  Being a little kiosk there is only one person manning the place.  So, you may find it is temporarily closed for a short while during the day.  But, don't fret.  Just check the note they leave as to what time they'll be back.  Check their website out for more on their goods of the day and follow them on Twitter @batterbakery.  Always a pleasant experience when I'm there.", "author": "Heizel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-15", "description": "It's more like a 3.5 rating! I am only reviewing the cupcakes! I purchased a dozen of cupcakes for a company birthday function for $33. You get $0.25 off each cupcake when you order a dozen so instead of $3 each it was $2.75 each. \n\nThe flavors we ordered and requested:\nDevil's Food Cupcakes with Vanilla Frosting-average, nothing special\nVanilla Cupcakes with Chocolate Frosting-the vanilla cupcake base was a little dry\nRed Velvet Cupcakes-the cupcake ingredients were not mixed well and when I bit into it, I could feel little chucks! \n\nThe cupcakes here are very similar to Miette's cupcake using light soft buttercream frosting instead of a sugary hard frosting so on a hot day it'll probably melt before you get back to work! I tend to like the harder frosting! \nFor $3 a pop, they can make it a little bigger, it is definitely way way too expensive for a cupcake this size but what do you expect? It's in FIDI!!", "author": "Leeseuh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-06", "description": "I had the pleasure of meeting Jen recently at a booth she had going at the Boss of Sauce event where she was sampling some of her interesting flavored cookies. We ended up buying three kinds because they were all so delicious! \n\nWe bought the Sea Salt Lavender shortbread cookies which were buttery shortbread squares with bits of lavender baked in and flecks of sea salt sprinkled on the top, the Amaretto drops which were chewy and perfectly sweet and Rosemary Biscotti. I can't say much about the Rosemary Biscotti because my piggy boyfriend ate them all before I could have any, but the sample I did try at the event was  great.  They were sweet and savory with that yummy woody and herbaceous smell and taste Rosemary has.", "author": "Dee I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "This is my favorite place for cupcake!!!!!!\n\nI have tried their red velvet, vanilla and peanut butter cupcakes and all of them are very yummy.  Their cupcakes are small and individually placed inside a cardboard box.  It its not too filling and sweet and it is just perfect. Cupcake lovers really need to try this place!\n\nFor cookies I like their chocolate chip, mud devils and sand angels which is kind of like snicker doodle.  Peanut Butter Blossoms are also must try if you are a peanut butter fan!", "author": "Kuankii N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "Wow.  After reading reviews by my fellow \"yelpers\", I decided to give this place a try.  My intention was to go there and get a cupcake, but after talking to the girl who was working there, I left with a cookie.  I am a very happy customer!  The cookie, which was a generous size, was called a Sand Angel.  A little like a snickerdoodle with cinnamon and a chewy texture.  Very good!  I will be going back from time to time to sample more goodies!\n\nFor Valentines day, they have a kiosk open inside 555 California, but just for the holiday.\n\nI say it's worth the trip!  Even better if you work close by like me!\n\nEnjoy!", "author": "Shannon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "Absolutely delicious cookies. I got the sand angel cookie and it completely rocked my world. It was sweet, soft, and extremely tasty. The cookie was also pretty big (roughly the size of 3/4 of my hand) and came in some nice packaging. Definitely showed that the lady running the place cared about her customers. If my office was a bit closer I would go at least twice, maybe even three times a week.", "author": "Dennis R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-21", "description": "I work across the street and I always would see this tiny kiosk with a line in the morning and afternoon.  Whenever I see a line I think what could I possibly be missing??  Finally on my way back from lunch one sunny afternoon last week I tried Batter.  The kiosk is filled with everything yummy and especially good after you have had some rockin curry.\n\nCookies, cupcakes and brownies oh my!!  What to pick, what to pick.  The line was fortunately only two deep when I arrived so after patiently waiting it was my turn.  I choose the Fudge Brownie and then bought a bag (5) of small sugar cookies with a peanut butter cup in the middle (sooo yummy)!!!  The prices were a bit steep which is why I have to give this cute little spot in FiDi 4 stars. But try this place if you are in the area and craving something sweet in the morning or afternoon!  \n\nNext on my list is to try their breads which I have heard are heavenly in the morning.  See you soon Batter!!", "author": "Heidi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "The Lavender Sea Salt shortbread cookies are pretty freakin' sweet. Actually they're also savory, but you know what I mean. Crisp, buttery, with the sea salt giving it a savory flavorful twist. Smart choice from the Saison team to serve them as mignardises post meal. Now I'm only guessing here but, Batter's Friandise kiosk is gonna go gangbusters when they open", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "My roomie works right by this little kiosk, and we now have a new weekly tradition: cupcakes from Batter post-lunch.\n\nFor a tiny booth, Batter sure has a lot of options. So far I've tried:\n\n- red velvet cupcake - SO good. SO moist.\n- lavender sea salt shortbread - good if you like floral in your food. My coworkers were big fans but my roommate made a face and said it tasted like aromatherapy in her mouth. There are straight up lavender kernels in the cookies, so the flavor is quite strong.\n- chocolate cupcake with espresso frosting - the cake part was good, but the frosting had the consistency of congealed oil...avoiding this one from now on.\n\nThe baked goods are a little pricey ($3 for a cupcake), but I'm willing to spend that on a sweet, weekly indulgence.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "PEANUT BUTTER CUPCAKEE!! I love peanut butter .. whether its in a cookie, a sandwich, yogurt, ice cream or cupcakes. So its fair to say I have some expertise when it comes to peanut butter. If you are a fan of peanut butter .. you will not be disappointed.  I should note that I left my cupcakes in the fridge overnight .. so you would think its not as tasty but it was DELICIOUS!!!!!! The perfect amount of frosting, moist, and just right!  The chocolate cupcake was pretty good not as moist, but the frosting was tasty. I didn't care too much for the confetti cupcake. It was my least favorite of the four cupcakes. The red velvet was amazingggg!! The perfect combination of cupcake and frosting ratio. I could go for another one right now. \n\nMy biggest disappointment here is the packaging. I do think the little individual boxes are super cute but not very eco friendly. I hope the store considers bigger boxes for larger orders.", "author": "Jen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-11", "description": "I was craving cupcakes and found this place through yelp. It's TINY! but they a wide selection of sweets to choose from. The sales girl was very helpful. We got the red velvet cupcake, vanilla cupcake, and lavender sea salt shortbread. The cupcakes were a bit dry and the frosting more watery than I like. The shortbread was really good.", "author": "Linda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "I was able to try a few samples in the mezzanine area of our building the other day. Whatever I ate, it was good! \n\nThey then opened in the small kiosk outside my building where the old flower stand used to be. I couldn't resist picking something up yesterday, even though I had already eaten my second breakfast. (No, I'm not a hobbit. I'm pregnant and I eat 2 breakfasts, ok? Don't judge!) \nI picked up the lemon almond scone. So lemony, with almond flakes. Not dry at all! \n\nMy husband saw my twitter feed regarding the consumption of my 3rd breakfast, this lemon almond scone. He begged me to go pick him up something. So, I picked up the sour cream coffee cake for him. He loved it! \n\nThis place is going to be dangerous for me. I'm really trying to tone down my weight gain during this pregnancy (I've gained 43 pounds already). But it's going to be hard walking by Batter's kiosk every morning!", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-05", "description": "A cute little kiosk that sells cupcakes, cookies, and other baked goods. The shortbread is just okay, but I appreciate that they have interesting flavor combinations like lavendar sea salt, rosemary brown butter, and sesame ginger. I prefer the other cookies which I think taste better, have a great consistency, and are a good portion size.", "author": "Alice J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "Very cute little kiosk with an obviously limited but very good selection of baked good.  Staff was super nice to boot.  \n\nI had the Mango bread which was a pleasure but a touch too buttery.  They also gave me half a peanut butter chocolate chip cookie as gift - hmm, hmm, hmm.  Guess I just had my lunch.\n\nWish they served coffee and this would be a terrific breakfast spot on my way to work.", "author": "David A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-08", "description": "I am not sure why there are bad reviews about the baked goods, but I LOVE this place.  I ordered a couple of items to make sure that I got a good smattering of baked goods to try. \n\nI first had a taste of the free Sand Angel Cookie (it apparently was free with purchase that day).  I did not get to eat the entire thing because I gave it to my husband to eat - he thought it was ok, but I thought it was great!  I am not really a cookie person, but I really like it.\n\nI opted to try the red velvet cupcake - Oh my god - that cupcake was moist and the cream cheese frosting was amazing.  I am a big fan of Sprinkle cupcakes and I do love them, but the cupcake from Batter Bakery was much better.  The cream cheese frosting was the perfect sweetness and the red velvet cake was moist and just sweet enough.  It was perfect!  I was sad when I finished it because I should have gotten more.  Next time I have a party and want cupcakes I am definately pre-ordering them from this place.  I can't wait to go back and try other flavors.\n\nNext thing I tried was the devil's food brownie.  I tried to share with my husband, but it was too yummy.  It was the perfect brownie, not too cakey and not too fudgy, but just right.  I love love love it!\n\nAnd now I have just tried the lavendar sea salt short bread cookies. Yummy - it is the perfect blend of sweet and savory saltiness.  I think it is the perfect cookie to have with a nice cup of chammomile tea.\n\nI am so glad that I bike commute to work because with that place downtown it is hard to resist just a little treat for the the afternoon.  I highly recommend this place if you get a chance to pick a sweet.  I can't wait to go back and try some more items.", "author": "Janelle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "I tried their yogurt with dried fruit and granola (you can add on each) ... and it was SO GOOD!!! You may ask, a yogurt parfait is a yogurt parfait....but this one was one of the best yogurt parfaits I've had. First off, they use Siggi's yogurt and it's thick and creamy and ... LOW SUGAR! I LOVED it so much that I went to Whole Foods soon after to buy my own (and now they're residing in my fridge.) Their granola is really tasty with bits of coconut shreds. I like how it's not the gooey kind of granola but the dry, toasty ones. You can choose what combination of dried fruits you want.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "I read yelps about this place and had to try it. \n\nI walked the 2 blocks to find what looked like a glass newspaper stand filled with baked goods. I've driven past this kiosk before and never really noticed that it was a bake stand. \n\nThe girl working there was nice and offered me a sample of their Chocolate Cinnamon Cream cheese cupcake. Cupcakes are dense and frosting is gooey just how i like it! \n\nI read that their Sand Angels were delicious and I'm one of those taste it before I believe it gals. Boy was it delicious. I can only describe it as a light ginger spiced butter cookie. YUMMY \n\nI also purchased a red velvet as they my favorite cupcake. I will edit this page after I've eaten it; I'm so full after that Sand Angel!", "author": "J-nine I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-05", "description": "this review of 5 stars is solely based on their salted lemon cookies(shortbreads?) \nSO GOOD.  i don't even like cookies, and i ate one after another(and another) when someone brought a box of these into the office.\n\nthey're buttery but light, if that makes sense.  with the perfect balance of sweet & salty.  think i'm going to walk over and have another one!\n :)", "author": "kristina h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "I have had better Chocolate chip cookies, it had a weird clove smell that my mom and I noticed. But it still tasted good which is suprising because I hate cloves. I love that nothing is too sweet.\nI loved the blackberry hazelnut bread, it was delicious! So moist and it was around  \n3:00 so I expected less but I will for sure be coming back. Good job guys and great location. ;) only a block away from school.", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "They've opened up a pop-up in 2 Embarcadero Center for the upcoming holidays.  I needed an afternoon pick me up and decided to check out their offerings.  I am currently enjoying a Sand Angel cookie.  Oh. My. Gravy.  It is buttery, chewy and tasty.  Very pleased right now.", "author": "Jovanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-04", "description": "I just tried cupcakes (devils food, vanilla w/ cinamon buttercream, and pumpkin) and a lavendar sea salt cookie from Batter Bakery and thought they were quite tasty.  I ordered the cupcakes over the phone and found the customer service woman who helped me to be quite pleasant. \n\nThe frosting on the cupcakes was very light tasting, even on the devils food cupcake.  If you are looking for richness it would not be the cupcake place for you, but if you prefer a light frosting that's not overly sugary this is the place for you. The price at $2.75 per cupcake is reasonable - as far as specialty cupcakes in the city go. Unfortunatly I was only able to get three flavors in my order of 10 cupcakes, but this is a step up from some who only allow one flavor per dozen.  I find the flavors to also be limited but it is a small stand, so this is not unexpected.\n\nThe cookie was good, but the cupcakes were better.  The lavendar component of the cookie wasn't offensive, but it'd presence made the cookie unbalanced to me. It would be more of a home run if it just had the sea salt - which was a great unexpected addition to the hard savory sugar cookie. \n\nI'll definitely be back to try more, and am hoping they open a larger store front nearby.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-26", "description": "overpriced, nothing special..  the mornig pastries are typically dried out.  i keep telling myself do not go back and after buying a crazy priced pumpkin sugar cookie on halloween, i will not.  everything on the chalboard sounds delicious, but youd be better off without.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "I  loved working with Jen Musty for my wedding. She not only was a pleasure to work with but very easy going with great suggestions on how to stay within our budget but also allowing us to be creative. She gave me the best deal of any bakery in the city for our wedding cupcakes and for the delivery. Also, at the last minute she let me order more cupcakes since we ended up inviting more people last minute to our wedding. Now the cupcakes were absolutely divine! Not too sugary (which is a BIG pet peeve of mine when it comes to frosting) and very smooth and velvety! I wanted to eat the entire box that showed up with \"congratulations!\" on it while I was getting ready. \nThanks again Jen!", "author": "Christina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "I can only base my review on the Devil's Food Brownie.. my mouth is watering as I type this.  I absolutely love chocolate and this brownie satisfies my craving.  The texture is more gooey than cakey and I love it.  After you take a bite, it almost looks like it will melt.  The cost ($3) is probably equivalent to a boxed brownie mix that yields a lot more than one brownie; but you won't get the same amazing taste.  Please note that this location is just the kiosk--the main location is on Polk Street.", "author": "Doreen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "Newsstand-styled kiosk bakery that cures chocolate cravings. Best fudge brownies.\n\nI've been here twice and am combining my reviews into one.\n\nORDER:\nDevil's Food Brownie\n$3\nThis is smallish brownie wrapped in brown waxed paper. Despite its size, it's packed with the most fudge-like chocolate richness I've ever tasted in a brownie. This is definitely perfect for the brownie batter lover. It's incredibly moist and melts in your mouth. Yummmmm! It is very rich, so you may consider sharing it with a friend or savouring it across a couple snack breaks.\n\nMint chocolate cookie\n$2.75\nThis is a good-sized chocolate cookie that has a nice touch of mint taste. The cookie is reasonably thick, so the inside is soft and chewy, while the outside is crispy.\n\nAMBIENCE: The kiosk is a cylindrical location reminiscent of a news stand.\n\nSERVICE: Fine.\n\nVISIT DETAILS: Afternoon chocolate-with-carbs fix.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-09", "description": "Red Velvet cupcakes. Buy 4 and stuff them in your face immediately.\n\nThey're moist and light and the frosting is thick and sweet but not too heavy. Perfect ratio of frosting to cake and they come in little individual branded boxes. I dig it. You will too. Go stuff.", "author": "Jarrod B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-17", "description": "Scrumptious treats. They have the best strawberry cupcakes I have ever had. Its a small delectable portion, tasty strawberry flavored cream cheese frosting.\nTheir cookies are a bit too dense for my taste.", "author": "Soumeya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "Satisfying cupcakes and goodies in the financial district.  I like Batter over Cupcake Cove.  Better & cuter cupcakes (my fave are the red velvets) and a much larger variety of sweets.  The lavender & sea salt shortbread is unique and surprisingly good (I thought it would taste like a spa).", "author": "A C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-20", "description": "I was very skeptical about buying cupcakes from a flower booth... I felt so bad for the poor girl sitting inside too.  But when I went in and ordered one red velvet cupcake ($3), she handed me the smallest, cutest box ever!  Just enough to fit one cupcake. \n\nIt was actually for my boyfriend and he LOVED it!  Top 3 in the city (his words, not mines).  I also thought they were pretty good too.", "author": "Y L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "OMG the lavender sea salt shortbread cookies are to die for!", "author": "Sharon E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "well hello there, mister pb chocolate chip cookie.  and now, goodbye.  pb chocolate chip cookie was delicious - i ate the whole thing even though i meant to only eat half.  and you know how some pb cookies leave you with greasy fingers?  this one does not.  oh, the little things.\n\non a previous visit, i had the confetti vanilla cupcake with chocolate buttercream.  the cupcake was the perfect size for an after-lunch dessert but i couldn't get over how good it was, so i obviously wanted more. i'm really glad this place is an uphill walk (sort of) for me - because even if my willpower is sucking that day, at least i'll have to work for it. \n\nwhat would make this a 5-star kiosk is if they served a strong brew of coffee to go with their sweet, sweet goodies.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-11", "description": "yummy treats... cookies, cupcakes, brownies etc.  Cute packaging too if you are looking for a nice treat/gift for someone.", "author": "Robyn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-04", "description": "Tried Batter Bakery after a third failed attempt with Sibby's. \n\nThe BEST cupcakes we've ordered - they actually taste homemade.  Delivery was on time, the cupcakes looked great and I got rave reviews from my team\n\nI do a lot of corporate catering events, including monthly birthday celebrations.  Ive used Kara's, Sibby's AND Miettes.  Batter Bakery has been the best by far.\n\nJen (the owner) answers her own calls, emails and does her own deliveries.  Although German Chocolate Cupcakes are not on her regular menu, she happily made them for my team.  They flew out of the box.  She said she'd happily try to fill any special request.\n\nThe carrot cupcakes had chunks of nuts, moist shreds of carrots, and the frosting tasted homemade.\n\nIf you are looking to upgrade, try Batter Bakery.", "author": "Fräulein J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "A charming botique bakery based in the Mission District out of the Stable Cafe on Folsom St. A Batter Bakery kiosk is soon to open in the Financial District downtime. They use premium, fresh ingredients and offer unique products, such as the Lavender Sea Salt Shortbread. They offer catering -- typically with private and corporate clients -- and batter orders for at-home baking enjoyment. Among their clients is Fraiche Yogurt; their popular granola and chocolate chip cookies are Batter Bakery products. \n\nWhere: Batter Kiosk at 555 California Ave (California and Kearney), Stable Cafe, Fraiche Yogurt, Blue Fog Market, Dolores Cafe, Trouble Cafe, I dunno where else.\n\nWhat I've tried: brownie, peanut butter chocolate chip cookie, chocolate chip cookie, sand angel cookie, sea salt lavender shortbread, coffee cake, blueberry muffin, carrot muffin, cinnamon shortbread, pineapple zucchini bread, chocolate chip banana bread, lemon almond scone, cherry pecan scone. \n\nExperience: Every item has been a treat, but I have a serious affection for baked goods. The brownie is moist, airy, and rich with quality chocolate. The sand angel is thick, perfectly round, and a unique homemade blend that reminds me of gingerbread, graham, and snickerdoodle. The peanut butter choc. chip cookie is one of my favorite items, which is surprising because I'm not usually a fan of peanut butter cookies. These aren't overly nutty, sugary, or salty. I'd note that no Batter item I've tried has tasted too sugary or dry, which is a nice break from overly-sugared muffins and brownies.\n \nIn all, I always look forward to tasting their products and I doubt you'll be disappointed with any Batter Bakery item.", "author": "Heath P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "These treats also make a nice gift for your loved ones (including yourself) ~ go on, you deserve it.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-11", "description": "The chocolate shortbread cookie from a coffeeshop is all I've tried so far. Good, but nothing amazing. Perhaps I'll revise this after I've tried their other options...", "author": "Kimberley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-12", "description": "Carmelita bars are fantastic!!!!! Cupcakes are great too.  Here is how I like to eat a cupcake:  Tear the bottom half off, put it on top of frosting, press into a sandwich.  Eat!!  Perfect cake to frosting ratio every bite and you can bite into the whole thing.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "I love these cookies. I always get the peanut butter blossoms (amazing!!) and different short bread. Who knew lavender and sea salt make delicious cookies? Now I know! I can't wait to try try the rest.", "author": "Tracy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Picked up a blueberry muffin in the afternoon the other day as I had been hearing great things about the kiosk opening. Even the foodie in my office was raving about it.\n\nMy muffin was okay. It wasn't bad or anything, just not to the taste of what I like. I don't know if it was just this muffin as I haven't tried anything else or if things taste better in the morning when they first open. \n\nAm glad someone is putting the old flower stand to good use though.", "author": "Janice O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "This 5 star rating is for the brownies. SO GOOD. Very fudgy and rich and soft and moist. So delicious. \n\nThis place is just a little covered stand on the corner of kearny and california, but they do take credit cards! \n\nI'd also give their oatmeal cherry cookie 4 stars, and the chocolate chip cookies 3 stars. Now though that I've figured out their best product, I won't be trying anything else.", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "i was craving something sweet when i passed by the kiosk. decided to take a look. the girl working inside recommended the sand angel which is like a snickerdoodle. it was delicious!! crispy edges and chewy inside! i love how it wasn't too sweet or buttery like specialty's. it was just right. they also offer cupcakes, shortbreads, muffins, and various breads. yum yum in my tum!! this is going to be dangerous since i work right across the street...kinda skurred.\n\nupdate: chocolate mint cookies are good too, but the red velvet cupcake was a disappointment. A bit dry and plain...definitely not worth the $3...", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "Fantastic kiosk in the middle of the financial district.  Warm cookies and terrific scones for breakfast.  The cherry pecan scone along with the current / lemon scones are a hit.  You can't go wrong stopping by for a quick morning or afternoon treat.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "This little stand makes me think of Superman and his telephone booth. I go in tired, broken down by the banalities of work and come out energized and high off of that failproof combo of sugar, butter and combo.  The chocolate chip cookies are dense, chewy, melty and buttery.  I swear there's also a hint of banana in there. Eat one and I promise you, your outlook on life will improve.", "author": "Dianna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "Sand Angel Cookie: I like that the cookie is soft, but it's kind of pricey ($2.50) and it just tastes normal to me. Doesn't \"wow\" me.", "author": "Vera W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-11", "description": "Sometimes, one cannot fight temptations.\n\nAlthough I watch what I eat, I sometimes can't fight the temptation to eat something sweet (this happens probably about once every few weeks).  This is when Batter Bakery comes in to play.   It's so conveniently close to work, it could be dangerous for those with a serious sweet tooth.  My favorite item is the lavender sea salt short bread.  The combination of savory and sweet is perfect...neither flavor is over-powering.  Next are the mini cupcakes.  The pumpkin is mmm mmm good...the cupcake is soft and moist, and the cream cheese frosting is ooooey gooey goodness.  The red velvet cupcake is a bit on the dry side, but I do love the cream cheese frosting again.  The brownies are really rich...I can only handle eating about a 1/4 of it.  Their signature cookie is the sandbar and the ingredients are supposed to be a secret.  I just picked up one of these today and will have to update my review once I get a taste of it.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "Awesome cookies.  I bought a dozen cookies, two dozens biscuits, and half a dozen brownies for admin appreciation day - the ladies all loved them.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "4.5 stars if i could because this was the best chocolate chip cookie ive ever had....but they're pricey....and they don't have much of a selection of goodies....but the chocolate chip cookie is drool inducing", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-25", "description": "YUM!! Anything I've ever had from here is sooo good! Especially the peanut butter blossom cookie. Man that cookie is totally worth the extra 25 min on the treadmill. It makes me happy :)", "author": "lindsay f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "OOOhhhh-em-Gee! Who needs a man when you've got a polka dot cookie?  Orgasmic. Seriously.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "Just ate a chocolate/peanut butter cupcake with a peanut butter cup on top and wow!  Not sicky sweet and the chocolate cake is perfectly moist.  Quite the cool little kiosk.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-24", "description": "Bought a piece of lemon bread for breakfast. Very disappointed. The bread tasted cold, refrigerated cold. The cake was a little hard and not moisted like their other pastries. Tasted like yesterday's goods.", "author": "susan g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "Goodness gracious... CHOCOLATE CHIP BANANA BREAD!!!", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-20", "description": "AAAUUUUGGGHHHH oohhh goddddddd i just walked ten miles per hour over to the Batter kiosk before no one would notice i was gone at work, bought a sand angel cookie and a carmelita and ate them both within about 5-7 minutes while walking as fast as possible. not a good idea, but i love it when you're eating a delicious, sweet, creamy cookie and all of a sudden you get that faint taste of salt that makes your mouth water and everything even more delicious than it was a nano-second ago. time to go to the gym.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-03", "description": "2.5 stars. I've only had the sand angel, the lavendar shortbread, and the chocolate chip cookie, but I think they put too much salt in their cookies. I'm a bigger fan of moist baked goods and this place is a little dry; I want to dip it in coffee or tea! Its a cute little kiosk on the corner. Cookies run around $2.50. I definitely wouldn't go out of my way to come here, but its pretty convenient location for a sugar fix if you work in the area.", "author": "Julia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "Carmelita Bar: Delicious. Pretty much tastes like butter mixed with sugar and some toppings, which is to say it's delicious and homemade. I could list the ingredients just by the taste, which is awesome.", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "We were visiting SF a couple of weeks ago and decided to order a \"breakfast basket\"  from Batter Bakery so we could have a picnic brunch at the rooftop of our hotel (Hotel Vitale)  with a view of the Bay Bridge, \nWaterfront, and Embarcadero.\n\nThe breakfast basket was absolutely fantastic!!!  All our bakery goodies came in a cute wicker basket.  We were carrying the basket to our hotel and on the way, we received many compliments on how cute the basket was.  The basket came with an huge assortment of bite size cookies (yum!), a little loaf of coffee cake, a bag of homemade granola, a quiche for two, a bag of delicious dates, two oranges, and an assortment of 4 or 5 scones and 2 slices of coffee cake.  It was enough food to last us for a couple of mornings.  The bakery items were absolutely delicious.   Everything was so well prepared.  It was a really nice treat for our special visit to SF.", "author": "Happy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-13", "description": "Yum. I just had a honey vanilla shortbread cookie as a little lunchtime treat. Great little kiosk in a convenient location. Kind of difficult to see the selection of baked goods from the street level as it's kind of high up (or maybe I'm short). Not too friendly either, but the cookie was really good. Not too sweet, not too buttery, just right.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "Next door to my job, I'm addicted :) AMAZING Cupcakes!!! Sweet-creamy frosting, yummy:):)", "author": "Christie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Tried their cookies which were yum and a vanilla sprinkle cupcake which was Meh. I do love that there is a kiosk...", "author": "C D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-17", "description": "We used them to cater our Halloween Party and ordered a few dozen of the mini cupcakes with Halloween decorations on them, they were not only yummy but so cute!  We were a little last minute on ordering and most bakeries around town could not squeeze our order in but Batter Bakery is my savior!  The staff who answered was very friendly and accommodating.  The mini vanilla cupcakes had little black, orange, and white sprinkles,, they also used chocolate and sprinkles to make spiders, frosting to make a ghost, etc. They were adorable! They were a hit at our office party with the employees and their kids! I will be sure to use Batter Bakery again, as well as to recommend them to anyone in the area. Thanks Batter Bakery!", "author": "Tracy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-15", "description": "Yum yum yum. The batter kiosk is 1.5 blocks from where I work and I can't even tell you how happy that makes me.  The chocolate brownies and choc. chip cookies are there to satisfy my afternoon cravings. But don't go too late because they run out of the goods pretty quickly!", "author": "Janice Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-19", "description": "The cupcakes are a bit small for what you pay for. I had the red velvet which was nice and moist. The frosting wasn't too sweet either. The chocolate with cinnamon frosting on the other hand was quite dry. If you opt to try just one thing from this place I say go with the Sand Angel.", "author": "t s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "Batter Bakery is located on a corner of the BofA building in the financial district.  I'm very happy that they came to the financial district because there has been a severe lack of good cookies/cupcakes in this area (there are a few but it's a little bit of a walk)\n\nSquare footage: I would venture guess that it's less than 20.\n\nCookies:  their flagship cookies the sand angel and deservingly so.  I would also say any of their shortbread cookies are awesome.  \n\nBars:  not a huge fan of their 5-layer bar. it's just too complex of a flavor and so nothing really stands out. what stands out is how sweet it is.\n\nCupcakes:  red velvet is top notch.  all others are decent but nothing to write home about. not a huge fan of the german chocogate cupcake\n\nOverall: the desserts are great and the people are friendly but their credit card machine is the slowest machine this side of the mississippi.  if you're in the area, try it out but don't do out of your way (don't walk 20 minutes to go here) to try it out.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-13", "description": "got the lavendar short bread!! every last crumb was as good as it gets!! i wish i had gotten more, it was delicious! i also had the chocolate mint cookie, very chocolatey and minty.........YUM! i am a happy camper!", "author": "Stella J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-03", "description": "the mango bread is moist and delectable!!!  per wakako's suggestion, i also got the carmelita bar, which is huge and hefty.  i have yet to try it, so i'll update this review when i do.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-29", "description": "So expensive... but I kept coming back for more and introducing it to all my friends. I'd say the shortbread is definitely the highlight here, and I've tried the lavender sea salt (which is the only thing you need to buy here if you're on a tight budget), and the rosemary brown butter. Their sand angels aren't bad either. I have to say a large part of the appeal of Batter was the adorable glass kiosk it's housed in. Just walking into that broom closet-sized space to buy something is an act that somehow carries its own charm.", "author": "Angela X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-29", "description": "Meh...I've experienced better.", "author": "Jenna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-03", "description": "This place is across the street from my office. It's the type of place that people might not give a chance, but that would be a mistake. I just ate their chocolate brownie, and I have to say I almost crapped my pants it was so delicious. I could eat 8 more of them, right now. I have eaten their chocolate chip cookies before, and also very delicious.\nIf you are looking for a quick sweet in the area, I highly recommend this place!", "author": "Joel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-01", "description": "Wrote a review for BB about 2 years ago and had to write another. First of OMG the cinnamon shortbread and the peanut butter chocolate cupcakes are to die for. These are now my personal favorites. I also love the fact that BB not only does cupcakes but cookes and bars. I order for monthly b-day celebration at work and I like the fact that I can use them every time and get a great variety of yummy goodness is great.", "author": "Alana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-02", "description": "This place has been great! I have a muffin at least once a week. The variety has been awesome. The scones are good too, I personally like scones dry, but these are very buttery. They taste like dessert rather than a breakfast snack with my coffee. The cookies are great, and I love the cupcakes as well. This has been a great addition to my morning commute!", "author": "Jaime C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "from gilt city, i got the mixing bowl assortment of goodies...i was going to use it for some occasion, but of course, the expiration date crept up on me. within the mix, my favorite thing was the sea salt lavender shortbread and sand angel cookie. i think the quality is good and the kiosk is cute. i may come by again...", "author": "Marjie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-25", "description": "Love the cupcakes from Batter - especially that lemon-deeelish. The sponge has the perfect consistency and the frosting is light and flavorful but with just enough richness that you are in for a real treat.\n\nTo top it off, Jen is a joy to work with. She is passionate, generous and really customer service oriented. Delivery in the City is affordable and always on time which is a huge help.", "author": "Kristin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-18", "description": "EVERYTHING here is delicious.\n\nOne of the best cookies I have ever had in my life is the infamous Sand Angel.\n\nLove it!", "author": "Kelli S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-21", "description": "Now, I bake a lot at home, so I'm picky about things when I'm out. But I willingly walk the blocks from work to the Batter kiosk to get an afternoon cookie. Peanut butter chocolate chip is my favorite so far, and I also love their loaf cakes available at Stable Cafe. Items are always incredibly fresh, too!", "author": "Jess Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "Holy chocolatey amazingness!!!!!  This bakery bakes the BEST everything I have ever had in my life.  I am currently eating one of the devil's food brownies and I might pass out because it is so good.  You must try this place.  You can get their baked goods at Stable on 17th and Folsom....which is also one of my favorite places in the world.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-18", "description": "This place is awesome!  I ordered a variety of cupcakes for my Manager's birthday celebration, and they were able to take the order only a day before and they let me order other flavors that weren't going to be on the menu the next day.  Each flavor was super delicious!  Seriously!  They won't disappoint!\n\nGreat customer service and delicious desserts are always a good thing!  Btw...absolutely genius that this place is a kiosk!  Very convenient!\n\nI will definitely order from them at every birthday we have since they have a great selection!  I crave the red velvet...yum-o! o!", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "I love the lavender shortbread - they are amazing. This is not going to be good for the waistline but so amazing for the tastebuds.", "author": "Cbr A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-10", "description": "Expensive for what you get. Some times things are dry. I wasnt that impressed, I would rather have something from Specialties.", "author": "Vanessa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-28", "description": "not a ton of variety but for a little claustrophobic stand in the middle of the street, you can't ask for much. good cookies but i won't actively try to find my way back any time soon.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-26", "description": "Jen has been providing the baked goods for my store for about a year. Through all that time, I've begged her to start a catering business (and happily, she finally has).\nI can say with 100% confidence that she is the most talented baker I've ever met. Every single thing she bakes is better than any other baked good I've tried.\nShe makes everything by hand and uses only the highest quality ingredients (madagascar vanilla, etc).\nShe actually specializes in things like muffins, quickbreads and other morning items, so I would highly recommend her for morning meetings.\nIf I could give her 10 stars, I would :)", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-07", "description": "I just finished the most scrumptious cupcake from Batter Bakery - chocolate with peanut butter frosting.  I am a baker and a bit of a stickler for quality cupcakes.  This was the real thing.  Perfect balance of creamy, slightly salty peanut butter frosting to moist (but not faux-boxed cake mix moist) chocolate cake.  The frosting to cake ratio and texture is just right, not like Kara's where at times you have a slightly dry cake texture below a giant mound of hard and overly sweet frosting (don't get me wrong, I still like Kara's when in the Marina.)  This cupcake takes the cake, though - literally.  Best I've had in SF so far.  I have also had some of the cookies, the brownie, and the lavendar and sea salt shortbread.  I like these but the cupcake is the standout for me.", "author": "Molly V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-26", "description": "Just tried their red velvet cupcake and it was delicious. The frosting was lighter and more airy than most cream cheese frosting I've had. The actual cake was a little dry but again, not heavy or overly buttery tasting. Oh, and the two girls that worked there were hot! Cute girls and baked goods... what more can you ask for?", "author": "Salil A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-02", "description": "I've heard their baked goods are great, but hope that on the new version of the website they -have the correct phone number -explain they don't have a storefront and the location of the cafe that stocks their goods on Folsom.", "author": "KD D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "I was fortunate to be invited to the bakery opening in June where I got to taste Jen's Sand Angels.  My friend's description of the cookies sums it up: \"They're like crack.  You can't stop.\"  Shortbread was delicious, too - love the herb and sea salt combinations.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-03", "description": "best scone in sf, by a long shot.  \n\nYou can also get them at the Blue Fog Markets ( Divisadero & California, Gough and Green), but, if you got to Stable on Folsom they're fresh.", "author": "kate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-05", "description": "Tried Batter Bakery goods at the Coffee shop - STABLE.  She is the most talented baker I've come across in a while.  Quality of the ingredients is top notch.  She does interesting flavor combinations as well as straight ahead breakfast breads etc.  Am eating the pumpkin bread - crumb is fine and so moist you wonder how she accomplished.", "author": "kelly i."}
