{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Can I just tell you, I love this place. Perhaps because I am of European descent and it includes food of my grandparent's native lands..but it is a great little street tucked away and like less than a mile from Union Square. \n\nThere are so many favorites on this little European street. Amongst them are, B44 a touch of Spain, Cafe Bastille..can we say \"Bon Jour\", Cafe Tiramisu, a nice touch of Italy and a few more incredible places. \n\nSo are you feeling like you want to dine somewhere in Europe? Do you miss the food from your last journey to Italy or Spain or France? Why do you not do the next best thing? Go visit Belden Place in San Francisco!", "author": "Joey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "This really is a neat place in San Francisco.  It's tucked away right off of China Town in the Finance District, and easy to miss, since it is a small back alley.  Ever since discovering this place, I make it a point to go when visiting San Fran.  Some restaurants have been there for a while, B44, others change.   That's about the only disappointing thing.  Had a really great happy hour lunch at the restaurant next to B44 couple years ago, and now it is gone.  Oh, well, more reason to try the new place.   I'm looking forward to visiting soon, and providing reviews of all the places there, which I haven't review yet.   See some pics from the restaurant a few years back, forget the name, but was fantastic.", "author": "Frank T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "Belden Place isn't just one place, it's a collection of many places.  It's a neat hidden gem that you have to know what you're looking for, or it's easy to miss.\n\nSince many of the places are competing for your hard earned money, the prices are reasonable, and happy hour turns this place into a good bang for your buck experience.\n\nIt's close enough to the office for a quick lunch, but I prefer to come in the late afternoon when it's not as crowded and you can get a jump on the happy hour specials.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "#76\nWhat an enchanting surprise nestled on the cusp of the Financial District and China Town.  My friend Tony first introduced me to this strange, yet fantastically wonderful spot a few years ago.  Tony invited me for dinner and I said I wanted Italian or French.  For some odd reason, he parked on the street in China Town and we began walking down hill, in China Town... does not sound like any kind of Mediterranean/European to me ;(\n\nTony walked me into an alleyway, and at first I thought he might either be trying to kill me, or maybe casting me for an episode of \"Pranked.\"  As I looked into the alleyway, I realized it was a magical spot replete with delicious restaurants.  \n\nTonight, I wanted to do something different with a new friend, so I suggested Belden Place.  I tried to describe it, but my words were remiss.  There is really no way to illustrate this place in the proper manner.\n\nSuch a charming way to spend an evening in the city, yet not really in the city.  You feel as if you are whisked away to another place, somewhere in the Mediterranean possibly, where store owners still really care about the people who eat their food.  Each spot we passed the hostess greeted us in the alley sharing about the cuisine for the evening, the special delicacies, the drinks, etc.  \n\nWe decided to start our journey with a drink in the first spot, an appetizer in the second place, a meal in the third store, dessert in the fourth and an after dinner drink in the fifth.  This seemed like a perfect evening.  \n\nStephani Smiles for Belden Place ;)", "author": "Stephani M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Did you even know there was a French Quarter in San Francisco? I didn't, but I did happen to find it, it's known as Belden Place or Belden Alley , it is an alley way that is cut off from traffic, you can only access it on foot, \n\nIt's a little alley way lined with restaurants and it truly makes you feel as if you stepped out of the city for a minute. \n\nYou can find French restaurants, Italian restaurants and much more, and all do make you feel as if you are dining in a European café. \n\nIf you are looking for something different in the city, go check out Belden Place.", "author": "Monica O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "San Francisco  alfresco dining at its best, even in the Arctic summer fog. Belden Place is a cool brick alley in the heart of the Financial District very nconventinoal. Only foot traffic, it's a little bit of Little Italy/Paris just off Pine Street. Restaurants on the alley have outdoor tables, big umbrellas, great Happy and lunch hour specials and great family meals.\n\nA handful of cafes line Belden Place and offer a variety of cuisines at moderate prices. Cafe Tiramisu, 28 Belden Place (tel. 415/421-7044), is a stylish Italian hot spot serving addictive risottos and gnocchi. Plouf, 40 Belden Place (tel. 415/986-6491), specializes in big bowls of mussels slathered in your choice of seven sauces, as well as fresh seafood. B44, 44 Belden Place (tel. 415/986-6287), serves up a side order of Spain alongside its revered paella and other seriously zesty Spanish dishes.There's Cafe Bastille, 22 Belden Place (tel. 415/986-5673), a classic French bistro with a boho basement that serves excellent crepes, mussels, and French onion soup; it offers live jazz on Fridays.\n\nNghttime Euro-speakeasy vibe -- Cigars drinks aperitifs and nibbling on frites.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-21", "description": "cool but meh, there are better places to eat and see in the city. It really doesn't feel like Europe either, we'll expect for the rude hostesses and marina douche bags.", "author": "Sabrina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "A little bit of Europe, in a little alley way of San Francisco. Belden Place may not seem remarkable upon first glance, but come night fall there is a certain energy that exists here unlike anywhere else in the city. A world away from SOMA, the quiet yet infectious ambiance of several restaurants being clustered into a small area makes this a fun destination that is literally just off the beaten path.\n\nAt one point in time, Belden was more of a mini French quarter serving as a hub to the then French immigrants just making their way out west. As time went on, the one block stretch has became the home of several Catalan and Italian establishments; making this not only a noteworthy date spot, but an area to take aim at solid Euro fare. \n\nCurrently the restaurants serving Belden are:\n\nB44: http://www.yelp.com/biz/b44-san-francisco\nBelden Taverna: http://www.yelp.com/biz/belden-taverna-san-francisco\nBrindisi Cucina di Mare: http://www.yelp.com/biz/brindisi-cucina-di-mare-san-francisco\nCafe Bastille: http://www.yelp.com/biz/cafe-bastille-san-francisco-2\nCafe Tiramisu: http://www.yelp.com/biz/cafe-tiramisu-san-francisco\nPlouf: http://www.yelp.com/biz/plouf-san-francisco\nSauce: http://www.yelp.com/biz/sauce-san-francisco-3\n\nBe a tourist or be a diner or be both. Intimate company a bonus.", "author": "Jando S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "Jazzy and very classy. Definitely a date spot if you want to WIN.\n\nLove the Italian inspired alley and Vueve Clicquot parasols. Service and food at the Belden Tavern was wonderful. My date and I wish to return here again. ;)\n\nHere's a review on the Belden Taverna: \nI had the best salad at the Belden Taverna called the Steak Salad that I hope the chef doesn't take off this menu until I come back. The salad, which is a Gorgonzola salad (my fav) base, with pomegranate/blue/butter romaine/walnuts/medium rare steak and dressing on the side. The topping was perfect--as many restaurants overwhelm salads with too much going on or they're just ridiculously undelightful especially for herbivores. \n\nMy date ordered the 3 course lunch which you can pick and choose an appetizer, meal and a dessert. He said he really liked the Burger and clam chowder. He had to take the dessert to-go but it was a mango...so TBD on the review.", "author": "Iris Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "B44 owner was a jerk. Never will return. After ordering an appetizer that the waiter messed up since he said it would be 20 minutes until dinner, we cancelled the appetizers and the owner Jordin accused us of harassing his staff for his mistake. Avoid this place!", "author": "Ken V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "An unassuming street of San Francisco which can be easily overlooked by pedestrians. Belden Place is one of these streets where once you discover, you will want to come back for more!\n\nAt first, it may look a bit sketchy, but once we turned the corner to the actual alley way, we were blown out of our mind! The alley is colorful and bursting with various eateries and all of them have outdoor seating. \n\nIt's one of our favorite streets to visit and here is a list of the restaurants:\n* Sauce- Candied bacon Brussel sprouts...super!!\n* Brindisi- Best ravioli ever!!\n* Taverna- Juicy and tender Kurobota pork chop!! \n* B44- mouth watering Paella!!\n* Café Tiramisu-Tiramisu, of course, nice and moist!!\n* Plouf- oyster and mussels heaven!!\n* Sam's Grill-old school with a flare!\n* Café Bastille- Blue cheese burger...oh man!!", "author": "Gigi And Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "\"Sauce\" saved our evening with probably the best burgers in SF! \nHave no idea what to get for dinner? Swing over to sauce!", "author": "Ludvig R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Need a quaint date spot in SF with an European appeal? Belden Place is the location! A charming little alley tucked away in the Financial District, it may be slightly difficult to locate, but once you're there, you're automatically charmed by the atmosphere. \n\nSpanish, French, Irish, and Italian restaurants line the alley with adorable al fresco patios for outdoor candlelit dining. Not convinced? See it to believe it. Despite its tourist-like appeal, it is very off the beaten path, hence devoid of much of the tourist population.\n\nP.S. Be ready to cough up the bucks for the ambiance.", "author": "Mansi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "Did I fall asleep? Maybe I had a few too many pre-dinner beverages or I fell down the rabbit hole. Either way, the meandering walk from Powell (guided by geologists who don't need directions) to Belden Alley was worth it. \n\nI'm afraid that when I try, I won't be able to find this hidden alley again. I've convinced myself its like the Room or Requirements and may only appear when I am in the right frame of mind, which would be supper in an enchanting European alley. \n\nI remember not knowing what to expect, but was told to be patient, keep up, and be ready for something awesome! We walked down quiet and deserted streets, until reaching a little gate. That little gate separated me from Europe, literally the aromas, covered patio seating, twinkly lights, narrow alley, hum of chatter, a cobble stone street, and hosts pushing their menus and fighting over potential patrons accurately embodied evenings in Europe. \n\nMy friends enjoyed the attention and I dreamily followed them into an Italian themed restaurant and patio, where we dined on fine wine and pasta.", "author": "Alicia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "It's a nice little hole in the wall, but the food was not as great as I thought it would have been. The experience was nice when it came to great service. The food itself didn't live up to the expectations. My experience might change on my next visit hopefully.", "author": "Pj A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Whenever I walk this alleyway, I walk towards a close getaway. Take yourself away from the Financial District, and step into a side neighborhood of San Francisco. Walk five steps before getting a cheery greeting by a host saying \"hello, would you like to come eat at this restaurant. Take a look at this menu...\" Beautiful European restaurants fancy up this secret alley. An alley, we as locals, cherish much. \nTea lights, broths of mussels, tourists in the know, outside seating, beautiful inside decor, friendly staff, lush wines.... and be reminded why you fell in love with San Francisco", "author": "Jacqueline L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-30", "description": "Not as good as I remembered. My second time here and the service, food quality and overall experience was just meh. Nice place if you don't mind being crowded, have to wait to be acknowledged by your waiter and have mediocre food. \nIf you want a look at me tourist place, this is a good choice. Oh, I almost forgot. For some reason, people from out of town come here with their children. My wife and I voted not again for us.", "author": "George C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "Belden Place is a breath of fresh alternative air to the touristy crowd of downtown San Francisco. It's situated between Pine and Bush Street, but kind of hard to find. Make sure you arm yourself with a yelp app so you can google map the place. The alley has a row of European style restaurants and cafes and it's totally well worth investigating.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "This is an alley in the FiDi with Italian, French and Spanish restaurants. It feels very touristy to me with ushers trying to lure you into their restaurant. All the restaurants in my experience are pretty average and nothing to rave about. I give the edge to Claude Lane.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "Pretty good food and drinks. Last time I was there, they'd run out of about half the items I tried to order, and as we ate and drank the service became a bit lackadaisical.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "I've never even heard about Belden Place until I was going to one of the restaurants for dinner one night. My boyfriend and I walked there and we thought it looked kinda of sketchy, but once we turned the corner to the actual alley way, I was blown out of my mind. It was so beautiful! I forgot I was in an alley way in San Francisco and felt like I was on vacation somewhere else. All the restaurants have outdoor seating and the hanging lights make it feel so romantic and very date night appropriate. I'm definitely coming back here to try to the other restaurants.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Great variety of food options. The spanish restaurant and the seafood next by it are do good. Prices are ok. We always order several dishes and share.", "author": "Itzy I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "Very cute alleyway with fancy-ish restaurants. I wish it opened on the weekends though, when I actually have time to have a nice sit-down meal.", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-28", "description": "Super busy little alley-way.\nA collection of cool little restaurants.\nJammed-pack during lunch time.\nWhenever I'm around the area, \nI make a point to \"squish\" my way around.\nKinda noisy, but in a good way.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "I like this place...\n\nI like it better when it's not overcrowded and I can get a seat outside to pretend I'm in Europe somewhere.\n\nMussels at Plouf still own me.\n\nThe end.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "A little bit of everything. All my favourite types of cuisines in a small alley European style type of thing. \n\nItalian\nSpanish\nFrench\n\nRecommend it here just the price is way off.\nAlso that good thing is that it's far from tourist areas.", "author": "Nadav M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-15", "description": "Oh Belden Place - home of executive power lunches, $14 martinis, and any-weather al fresco dining.  You are not likely to have a bad meal here, nor bad service.  You are likely to spend a minimum of $50/person --even for modest fare.  You also aren't likely to get anything particularly innovative.\n\nIf you want a solid, upscale European lunch or dinner, and you want to impress a baby boomer, I highly recommend anything on Belden Place.  It's like a chichi food court.  You can have Steak, French, Spanish or one of several variants of Italian.\n\nIn most cases, if I'm going to shell out three figures for dinner, I'll pick something much more creative; more San Francisco.  But I've gotta say, the atmosphere is nice and the wine flows freely.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-05", "description": "Eh, nothing special. Then again we were here only for happy hour. \n\nThis was my first time visiting Belden Place & I think I expected more charm. I kept reading review about how this area is so quaint, will remind you of Europe, etc. What I found was a bunch of restaurants crammed in a back alley & all the outdoor tables were covered with low awnings. Maybe once the sun sets the ambiance changes but at the time we went, it just felt dark. \n\nI didn't like that the hostesses try to get you to eat at their restaurant. It seemed a bit desperate. If someone is begging me to check out their menu, the food must not be that great. \n\nWe decided on Plouf since their HH went until 7. They had a HH oyster special...6 oysters, 3 different varieties for $8. I also had a very yummy cucumber mojito. I'm into cucumber drinks lately. \n\nPlouf offered a great prix fixe menu & everyone around us seemed to be ordering off that menu. We might have stayed but we weren't feeling the ambiance.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-23", "description": "This has to be the best little place for great food and hospitality in any town I know - really good food with a sophisticated urban atmosphere and a place to go for an important meal or date, or planned party if you like postmodern intimacy.  Also remember the venues here are partly outside, and in good weather this is a nice idea save for when there is lots of auto traffic and exhaust.  Otherwise an excellent place of interest and for a meal or other event.  Really nice!", "author": "Thomas H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-19", "description": "Looooove this alley way of a variety of restaurants to please your palette (so far B44, Spanish, is my fave).  It's so quaint and charming, very European-like and festive.  Love it and I can't wait to go back to either B44 or to try something new!  Street parking seems to be a-ok from friends' feedback in the evenings (or maybe they were just plain lucky!).", "author": "Maile N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "If you are here on business travel and your significant other visits you in the Financial District, this is a wonderful respite from the concrete of the rest of the downtown area and definitely has a magical European bistro feel.\n\nWalk down the alley and lovely staff members from each of the restaurants will attempt to woo you with specials and descriptions of Happy Hour. I've not found a great deal of consistency or variation between quality of any of the restaurants, so eat where the menu looks best and the prices are fair.\n\nLovely date also for folks who live in the city but would enjoy seeing it in a new way.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "I was apprehensive about hitting up Belden Place for our Saturday night dinner. I had heard it's an alley reminiscent of Europe but had also read on yelp that the hostesses can be aggressive and annoying. Since we didn't have a reservation and we were a party of 6 I was expecting to encounter a long wait.\n\nWe found parking immediately a block away so things were looking up. We entered the alley right near Cafe Bastille and asked the hostess if we could check out the menu... (looked good) However since we were the last of our party to arrive the others had gone into the Taverna towards the other end for drinks. In our attempt to make our way down towards our friends we came across 3 hostesses that must have trained with NFL blockers. These vulturesque hostesses stepped right in front of us flashed open their shields (menus)  and tried to block us from passing their restaurants. What is up with that shit?? Does this demeanor attract customers? I found it a TURN OFF, personally I don't wish to be accosted by a hostess.\n\nThe best was the Taverna hostess, after being attacked by 2 hostesses we learned our lesson and managed to dodge her, but she hauled ass and physically blocked us by jumping in front of us so we explained to her that our friends were inside having a drink and we were simply going to talk to them. HOMEGIRL FOLLOWED US IN AND STOOD THERE! She was listening in our converstaion and interjecting in an attempt to offer us seating or menus. I had to contain myself and keep from turning around and yelling BITCH BACK OFF!!!! ( I didn't, but we didn't stay there either we went back to Cafe Bastille)", "author": "Lori K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Cool place to eat. A little alley offering lots of choice - Catalan, French, American, Seafood. Al fresco dining at its best in San Francisco!", "author": "Paul T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "Belden Place! Finally learned the name of this charming alleyway - I've fallen in love with this place first during a lunch rush hour some time last year, but during dinner time is so Romantic. Especially on a rare warm sf night! ah perfect sf dinner date spot", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-28", "description": "This totally reminds me of Europe. Several restaurants all lined up in a row with plenty of outdoor seating makes for a very romantic meal. You have your choice of Spanish, French, Mediterranean, Seafood, etc... to choose from. I'm not a huge fan of eating downtown but this place is a hidden little gem. \n\nThis is the perfect place to bring a date. On this night I went to B44 (Spanish) and it was very good. Got the peppers stuffed with dungenness crab along with the seafood paella along with a bottle of nice Spanish wine. Excellent.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-09", "description": "What can be better, on a nice warm day in San Francisco than  sitting outside, having a glass of wine and nice meal on Belden Place?\n\nEspecially good to remember Belden when the streets of the Financial District are all dried up at the end of the day and there is no place to find food when you wander out of the office late (or your family returns from their exile to Fisherman's Wharf to meet you on Union Square... and you really don't feel like mixing with the denizens of society... ).", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "Walking down the deserted streets of the Financial District in the evening, this place was a surprising alleyway find. The outdoor seating gives a very European feel and being sandwiched between tall buildings, the wind disappears making it quite pleasant to be eating outside.\n\nTake a stroll down the whole 'way and let your eyes sample all the menus before deciding. There are about five restaurants fitted into the small space and most of them are on par with each other. It can get pricey, but you get nominal food and service as well as a fine dining experience.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "Great location and amazing service. Get the Fish and Chips, the thick white cod is succulent and delicious.", "author": "Tony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "Probably one of my top 5 favorite places in the city.  I used to work on Belden Lane... I would hit Voda Lounge up at 5pm for 5 Lemon Drops which I would down in 35 minutes and then crawl home up Pine to Mason.  Unreal.  I can't believe I lived that kind of lifestyle... and I would do it again in a second.  See, I used to drink for a living.  Personal wine broker, no joke.\n\n\nBut really Belden Lane is home to Brindisi (Italian bistro with semi-hot hosts and ok food), B44 and Plouf (my fave lunchtime French restaurant - I wanted to screw this one waiter so bad!), Sam's and old school American joint serving up the classics and then the Vodka Bar aka Voda Lounge.  Yes please!\n\nBest place to hit up for lunch on a sunny day.  The Euro-fell outside patio is perfect for lunch or a beverage or 3.  Relax in the sun and enjoy yourself!", "author": "Shiho F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "Super cute little alley that will make you feel like you've been transported away from the business like nature of the FiDi. Great place for lunch or for drinking your afternoon away. The Maitre d's of the various restaurants can get  bit agressive, just stand your ground and they won't bug you. \n\nIf only I could find a place in this alley where I can get a bloody mary and a hot dog, I'd bump it up to five stars.", "author": "Chum L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "Pricey but soooo charming. Pick any of the restaurants on the cobble stone alley there and just enjoy a nice meal outside with heat lamps with all the giant buildings of down town surrounding you. I get excited every time I go.", "author": "Justine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "Who knew an alley would offer so much.\n\nA great find in an unexpected area of town.  After hours, few think to come to the financial district of San Francisco, but Belden alley is a quaint and cool place to grab a drink and a bite to eat.  It's got a very European feel with a variety of restaurants offering anything from tapas to seafood.  Competing restaurants all grab for your attention, but don't feel pressured; check out all the different menus and then just sit and enjoy the night.  You have the option of seating inside or outside of all the restaurants (very cool).  Personally, I like Plouf and B44.", "author": "Bo T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-13", "description": "It's like being in Europe...\n\nWell, I wouldn't know because I've never been - but it looks a like like it from the pictures I've seen!!\n\nAnyhooooo....I love Belden Place.  I'm usually there visiting my favorite little lounge, Voda.  I love this place on Bastille Day, they really know how to celebrate.\n\nTucked away in the alley, you feel like your transported away and on a European vacation.  Have a wonderful meal at Plouf outside under the awnings - they have really yummy mussels!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-29", "description": "Seriously a hidden gem in the city.\n\nI guess I shouldn't say hidden since everytime I go here, it's packed.  \n\nBut it's still an awesome great time every time no matter where you end up, Taverna, Plouf, Cafe Tiramisu, Voda, whatever.  \n\nIt's an alley full of European bars and restaurants with seating in the street, similar to how I would imagine you would see in Europe.  Big awnings give you shade while you enjoy the sunny downtown weather, with your meal or drinks.  The servers all come with authentic accents, and when you walk by the restaurants, the hostesses fight for your business.  It's nice to feel wanted.  \n\nDuring the week, it's filled with tourists and business people in the area alike, and on weekends it's mostly locals and tourists. Either way, why would you want to go somewhere with no business?  At least this alley has business?  Doesn't that usually imply that the places in here are good?", "author": "Denise B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-11", "description": "Sorry folks, I'm gonna have to go against the grain on this one...\n\nIn theory, Belden Place is cute.  It tries hard to re-create a quaint Euro feel.  Sadly, it fails.\n\nWhile the look of it is actually cute (if not cramped and chaotic) the rest of it just feels like it's trying too hard.  The \"hostesses\" implore you to eat at their restaurant as you pass by (I like to imagine that they have fake accents :-P and I'm sure it's true for some of them).  If a restaurant needs to be pimped like that, maybe you should think twice about going in.\n\nThe food here is OK but overpriced and ultimately nothing special.  In San Francisco there is no dearth of restaurants and you can definitely get more authentic than this. \n\nSure it's cute and romantic to every once in a while come out and sit beneath the twinkling lights but if you do it more frequently than that... well... I'm not sure what that says... but it ain't a good thing.", "author": "Rashmi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-11", "description": "Many many times during the day I forget that I am an adult, but places like Belden Lane remind me that I am.  I come here for happy hour drinks at Voda, for business lunches at Bistro 44, and an occasional romantic dinner at Plouf.  The attraction is the outdoor seating in the heart of the Financial District and the food which is always good.  By the way I have no idea if it actually is authentically European, but frankly every place in SF is a \"fusion\" of some sort.....so I think of this alley as Euro-Fusion.  Very satisfying in so long as you don't actually try to compare it to the real thing.  Oh and hopefully you won't mind sharing your lunch with the pigeons underfoot.\n\nIt's my perfect spot for spending a long ass lunch skipping work on a balmy day.", "author": "Ke-Bear Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-22", "description": "This is a special, adorable little corner of San Francisco, and a special treat on a warm summer night.  Sitting in that little alley, lights overhead, surrounded by lively people in all directions.  This city could use more places like this.\n\nBut let's face it.  The food at every restaurant on this alley is mediocre.  Plouf is by far your best bet - but you come to Belden for the ambiance, sadly not the food as well.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-13", "description": "First of all it's Belden Alley not Belden Place, because it's an Alley... a dirty little alley. If you walked through the Alley in the morning you would never eat here at night, it smells like pee. \n\nI don't need a menu, I'm just on my way to the bus.. or the bar... probably the bar.", "author": "matt l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-26", "description": "Love coming out here for French food. All of these places are pretty good. Some of the hostesses are pushy as you walk by on the patios, but don't let their customer hungry attitudes turn you off. Just go for the food.\n\nThe patios are nice to sit outside, but the tables are very small and it's crowded. Sometimes it's almost better (for me) to sit inside since it's less crowded and you can hear yourself talking. It just depends on what you need and how you're feeling that day.\n\nOf all the times I've eaten at each of the different restaurants in Belden Place, I probably got great waiter service 3 times out of 20. I just go for the food really. \n\nMy favorite of this alley is Cafe Bastille.", "author": "Lorrie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-23", "description": "While I thoroughly enjoyed this small gem (easy to miss), I found not much French about it.  Our waitress was definitely eastern European (charming, but not french).  Lunch time reservations equated to my party showing up, the host looking around and pointing to the only open table saying \"um, how bout that one?\".  Meaning, reservations are sort of like turn signals; completely optional.\n\nWhile I could have ordered something a bit more authentic, my grilled tiger prawns with sauteed garlic potatoes, asparagus and mushroom tarragon sauce was pretty excellent.  My luncheon companions enjoyed the steamed mussels marinieres and the hachis parmentier.\n\nOnly complaint is the tight quarters (I actually had to stand up next to my chair every time someone wanted to get to the tables behind me).", "author": "Ariana N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-27", "description": "I went to Brindisi for lunch today, and as usual, ended up ordering the most expensive thing on the menu PURELY BY COINCIDENCE.  I swear, sometimes I think the prices change just so whatever I'm in the mood for is the highest-priced item.  It's a blatant conspiracy.\n\nBut that didn't change the fact that while signing my soul away on the dotted line, my tears were ones of joy instead of sorrow.  Worth every dirty little penny under the couch cushions!\n\nAnd for those of you less inclined to scrounge in the nooks and crannies of your furniture to come up with the necessary tip money, the gourmet pizzas are only $12 and will easily feed two.", "author": "Kelly V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "Yes, it's expensive.  And I'm sure there is better food in the city if you know what you want.\n\nBut it is simply to walk through the alley on a warm summer evening (we have those once a year) and browse the menus.  Wonderful environment, cute restaurants, and over all I've always been happy with my food.  No, I don't remember where I ate -- it's about the experience!  \n\nAnd, I like being accosted by the hostesses!", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-07", "description": "I've only been to a couple of the restaurants here, but every time I walk through I don't know why I'm not here more often.  I love the European feel of this outdoor refuge in the middle of the financial district.\n\nMy one complaint: I felt like I was walking through Tijuana passing strip joint after strip joint with the way I was accosted by the hostesses in front of their respective restaurants trying to lure me into their establishment.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-11", "description": "I love Belden Lane, it's a little slice of Europe in downtown San Francisco. I've been to several of the restaurants with great success and one of my favorite \"street\" parties in SF is Bastille Day on Belden Lane.  \n\nSkip Brindisi and Voda.", "author": "Leesa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "You know those rare balmy nights we had just lately? God those are my favorite.  They are the reason for outside seating.  So when especially balmy night came, no matter how much I didn't have my phone, didn't have money and already had plans to go to another bar, I needed to spend some time outside.  I needed to chill out and bask in the fortune of good weather and pretend it is like this every night.  I needed Belden Place.\n\nIt is said that this alley reminds people of some Mediterranean town with all the little outside tables squished together and different southern European cuisines.  I can see that.  That's the main reason I love it.  But it is not quite European enough to deserve five stars.  I can't remember anytime I was walking through downtown Nice or Aix and was accosted by maitre d's to come eat at their establishment.  \n\nAnd when the waiters came by, they also had an air of \"make yourself at home, I'll be your server.  That means I bring take your order and bring your food.  You will not see me unless I choose to be seen. You will get a business smile, not a friendly smile because I'm not your friend. If you whip out a book I won't bother you until you call me.  I might come by every once in a while to see if you are alright, but that is very 'once in a while' because truly I could give a flying fuck about your American ass.  You will conform to how I choose to serve you and you will like it. And you will tip me because you don't know that it is included in the price.\"  They have mastered the art of being a server AND being French \n\nBut sadly this is America and we have no idea how to be French.  We totally know how to be American though in all our fake kindness and concern and desire to sell and make a large tip and flip the tables. That aloofness that I am so fond of in French waiters and the French in general just comes off as lack of concern here.  I'd like to see what they would do if I come back on some random warm Saturday and bust out a book and sit there for 3 hours.  If it were really like a European through-way, I wouldn't have to wonder.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-14", "description": "Pet peeve: people who write reviews based on a comparison to somewhere else.\n\nIf you're going to write a review, you write it for what it is, not if it stacks up to somewhere else you know.\n\nThat aside, I like Belden Place.\n\nIt's this quaint little location where you don't have to travel too far to get a little variety from Italian to Seafood to French; like Miquel says, 'if one is feeling less than creative'.\n\nThe atmosphere is neatly tucked away in the financial district, it's an alley way with \"Joie de vivre\" in mind (thank you wiki). I highly recommend sitting outside to enjoy the sunshine or the night sky under the umbrellas and space heaters.\n\nI always believe that half of eating is the ambiance of where you're eating, and I don't think you'll find much better than Belden Place.\n\nIt's only 3/5 stars because I haven't had the opportunity to try the other restaurants there, when I do, it should go up.\n\nFor now, it's a great change of venue with reasonable prices if you're looking for something different.", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-10", "description": "You'll forget you are in SF. The private and quiet street reminds me of NY mixed with the cafes outside of Paris. I love the area. Definitely brownie points if you take a date there...if you want to be romantic and what not. Belden Place AKA cupcakers street. As far as the restaurants there, so expensive! That's why I only come here when I go on dates because, shiet...I aint paying :) \n\nOr...during dine about town week. That's when you'll see me there. A full meal for $35! Other than that, I'll stick to a cheaper area.", "author": "Jacquelynne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-29", "description": "Belden is one of my favorite places in the city. Tucked away in a little side alley amongst streets dominated by banks, stores and chain restaurants, Belden Alley is a charming change of pace. \nQuaint, European to a tee, Belden is both a fun alley filled with great restaurants as well as one of the most romantic spots in the city. Anytime is a great time here--whether you prefer to lounge about on a sunny day, sipping a cocktail, French Tuesdays or hot summer nights...Belden is a fun, adorable little escape from the mundane day to day of the city.\nAlways a favorite place to escape, Belden has become one of my favorite places to take out of towners or come with old friends.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "I am true believer in second chances . Some times places we visit are just having a bad day after all we all are humans. The great part was the second time around to this place proved me right. Went back had Italian food and great customer service . Super fun place to have a date or a nice dinner with friends. Will definitely go back.", "author": "Eisa m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-15", "description": "Great outdoor concept. More than a few restaurants to choose from. You get the feeling your on a small street in Europe with this outdoor dining venue. Great for clients and visiting friends and choices to suit everyone. I have been a fan for over seven years and this review is way overdue.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "lived in san francisco all my life and i didn't know this place existed until last year. this is the coolest alley way with the cutest restaurants in the FIDI. my advice... try ALL the restaurants. when you walk through, check out all the menu's before picking where you want to dine. they have many daily specials!", "author": "Ann T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "Must haves at Belden Place\n1. Friends and/or lovers\n2. Wine\n3. Pasta\n4. Sit outside - even when its chilly. There are heat lamps.\n\nDon't forget to people watch.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-22", "description": "I will have to try the other restaurants at Belden, because I was thoroughly disappointed with this place. Despite the lovely atmosphere, the service was sub-par and the food was average at best. First of all, the maitre d' sat us down at a table, and then asked us to move to a \"better\" table. This was only to make room for a party of 8 that ended up sitting next to my girlfriend and I. Here are the other two things that were worth mentioning:\n\n\"Salted\" Oysters: We finally get our waiter's attention, and order drinks and  an appetizer: oysters. This sounded like a good idea as a start to a nice evening. To give you an idea of the taste, imagine that an entire bag of salt had been poured all over a small, cold oyster. Honestly that's what it tasted like, with a fishy aftertaste. Needless to say, we sent them back, and prayed we would get sick later.\n\nCockroach on my Lap: I am not making this up. After some decent main courses, we were discussing our plans for afterwards. I look down on my napkin on my lap, and see a small, winged roach crawling around. This was absolutely disgusting, and I was ready to leave. We got our bill, and did not mention the roach. However, the oysters were still on the bill, so I sent the waiter back.\n\nOysters, Roaches and Below Average everything... NOT recommended.", "author": "Dave D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-08", "description": "reminds me of Fishermans Wharf, nothing charming about having 5 different restaurants bombard you with requests to view the menu, if I want to look at the menu, then i'll stop.  My girlfriend loves it here, maybe i'll try it again, but this time i couldn't wait to get through there so people would leave me alone.", "author": "Michael I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-22", "description": "Ya know,  I like this place.  I know it's over-priced sometimes, but it feels like Europe, and I can appreciate that.  I actually have tried all of the restaurants on this street I think at one time or another.  They are all 3 Yelp Star places.  No stand outs.  But I think here, you're paying for the ambiance and not the taste of the food.", "author": "paul l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "Love the location.  The alley is very charming, and I appreciate the ease of parking on the weekends.  I've been to Plouf and enjoyed the mussels tremendously - I'll have to go back and try the rest of the restaurants now.\n\nI have to say though, that the restaurants that have their hostesses assaulting people with their menus as the door are a turn-off for me.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "This place feels like europe smack inbetween chinatown and the FiDi. A nice little choice of restaurants and bars with outdoor seating. It even comes with the nice array of euro-trash! Good times!\n\nGreat place to go anytime: business lunch, dinner with friends, first date place, during the world cup, during bastille day, during st. patricks day and i could go on...", "author": "Pippi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-13", "description": "Belden Place is a very, very convenient \"venue\".  This little euro-alley always comes handy when we are just to lazy to be creative in terms of selecting a place to go; especially I only work a couple of blocks away.\n\nMy favorite place there is Cafe Bastille.  It's a french cafe with no attitude and serves good casual food.  I always make sure I order their onion soup. Hmm.. best onion soup ever!", "author": "N. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-13", "description": "Adorable alley love....what a hidden gem.", "author": "Virgo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-05", "description": "Charmant. Romantique. Atmospherique. C'est Paris, avec les memes prix eleves mais sans mauvaise attitude.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "absolutely beautiful alley. its really a great place for dates. all the restaurants have outside heated seating with does get very warm. the lights and sounds of the people make this a truly unique little pocket of sf. everything is pretty pricey so dont think about making this your usual dinner spot (unless ur balling like that then by all means do your damn thang) i have been to two resturants and voda which i think is closed now.  i do usually try to go when it is a little warmer out. and everything has its only unique flare and signature. cant wait to go back soon.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-30", "description": "I love this place on a warm day. Its like no other experience in SF. Cruise by and pick what restaurant you want with all kinds of hosts trying to intice you to their restaurant. My favorite is definitely B44. I miss Spanish food so much since my trip to Barcelona and this is def my favorite so far. Sitting outside eating amazing food and drinking wine in this cute alley. Life aint so hard!", "author": "Kai T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "Tasty food with really nice people and good service. You'll enjoy your time at Belden.", "author": "Karolin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "Belden Place in San Francisco's Financial District magically transports its customers to a quaint street in Europe. The alley, tucked away amongst the many high rises of the San Francisco, offers an American representation of classic European dining. Eight restaurants line the alley providing both indoor and al-fresco dining. The alley is set up in classic European style with small 2-4 person tables dotted with large umbrellas and space heaters. Cafe Bastille, Cafe Tiramisu, Plouf, B44, Brindisi, Trademark, Sam's Grill, Belden Tavern line Belden Place offering Italian, Spanish, and French cuisine. Belden Place is a perfect place to have a power lunch with clients, enjoy drinks and appetizers for happy hour or to share a romantic meal under the stars. The restaurants lining Belden Place are usually quite busy. The convenient location in the Financial District and the quaint al-fresco dining make this group of restaurants one of the hottest tickets in town. Make a reservation on http://www.opentable.com/ or come during off-hours or expect to wait at least 30 minutes for a table. Belden Place is well worth it, so come down and enjoy a relaxing meal in European style.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-30", "description": "This alley is SO CUTE! It's like an urban oasis; a vibrant heart of color amidst the stale gray sea of the financial district. I always thought the space looked cute over the weekends when I'd walk by during an off-hour and it would be near empty... but recently, I walked through BP after lunch hour and it was thrilling! Full of [good] smells and dapper professionals enjoying their extended lunch meetings! Now... if only my checking account could handle a few more visits!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-26", "description": "San Francisco's Gourmet Getto with sun, fun and urban bliss all shared in this simple, short alley adjoining the financial district.  Anchored at the Bush Street end of the alley by Sam's Grill, one of the oldest and best seafood restaurants west of Chicago and going strong since 1862, with assorted gallic, Italian, fast food and various other mediterannean find food purveyors packing the space for three hours surrounding lunchtime every day, and into the night with bright lights and beautiful music filling the air scented with romance and chance.  This is the closest to Europe most armchair gourmands ever get, and its mighty close and great fun.", "author": "Stu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-01", "description": "This little alley of European restaurants is so charming and adorable that I can't bring myself to take off a star for perpetual crowdedness during peak lunch hours and steamy-sweatiness when it's hot outside.", "author": "Bonnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-01", "description": "Belden Lane... my favorite location to dine in all of San Francisco. Five stars just for the ambiance! Although I love the al fresco element, my secret indulgence is when I slip into Cafe Bastille on a rainy afternoon, order a plate of coq au vin  and a glass of wine, exhale and just let the world pass me by for a time. That's it,  that's Belden Lane.", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-05", "description": "If you're looking for a little bit of Europe in San Francisco, this is the place to go.  All of the cafes along this alley have outdoor seating that reminds you of Paris or Barcelona.  They have a few cool drinking spots and a French and Spanish restaurant (Plouf and B44) that are great for a sunny lunch or a night out.", "author": "Steven M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "I like to bring out-of-towners here to remind them that they can't get this kind of dining experience in any other U.S city.  Not as impressive now that I have been to Italy/France where it seems every other alleyway is set up like Belden Place. \nGreat place to bring dates. I have only been to the Spanish restaurant where I had a good meal @ a reasonable price.\n\nAmbience *****\nFood ****\nValue ***", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-01", "description": "Belden lane is cute and somewhat European looking/feeling but you're quickly reminded by the people that flock here in droves you're still in the US....and it really is a turn off to have those bastards trying to rope you in to eating at their establishments  There is some pretty good food tucked away back here though and it is worth seeing at least once or twice.  Not a destination for me but if I'm working in the area I would stop by and see if it wasn't too busy and half a meal.  Just can't deal with the crowds...", "author": "Spidermonkey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-01", "description": "Absolutely charming! Feels like a piece of Europe, right in the heart of SF. I've tried three restaurants in less than three months - I'm addicted. The Italian/French accents are a charming touch. Cozy seating within earshot of neighboring tables, beware!", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-25", "description": "Ok so the hostesses are a little pushy here but I would face them any day of the week just to dine in this charming alley.  I know what your thinking...AN ALLEY??? Yes...an alley with some of the best food in the city!! Go see for yourself!!", "author": "Charisse F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-28", "description": "restaurants are OK but\n\ncheck out little italy in NYC, especially in the summer. It much nicer then belden place!", "author": "J and K O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "Love Belden Place. Especially B44 which has good tapas and Spanish wine. Voda is an excellent place to start the night. It reminds me more of Spain that it does France, but same difference :)  I give it 4 starts instead of 5 b/c the hostesses outside are a little annoying trying to get you into their restaurant.", "author": "LeeAnn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-10", "description": "Bring someone you want to impress (out of towner, parents, hot date).  B44 is the best of the bunch.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-29", "description": "Is it true this place is called European Alleyway? I have heard that from a friend and believe every word he said. From the outside tables, small lights stringed above your head, waitresses soliciting your service from the doorway, and a selection of food that seems to be worth a Eurrail Pass. Seriously, get a taste of some great European food here, in a nice, authentic atmosphere. -Matt", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-11", "description": "This place is amazing if you are wanting to feel like you are someplace else other than San Francisco. I love it, but don't go here looking for any cheap deals.", "author": "Erin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-21", "description": "Brought an old friend here the other sunday for a reservation at B44, had a great time. Even though both of us were native San Franciscans we've actually never been here and it was great. Was a chilly night anyways so we ate inside, although it was still nice to see the lights and tables set up outside. But for anyone even considering outside dining, don't go on sunday, I think only B44 and one other restaurant was open, all the other places were closed and with it, the lights in front of their part of the alley.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-22", "description": "Ate here 3 times in the last week for lunch, and me and my co-workers just can't get enough! We're very fortunate to have such a great little spot like this smack dab in the middle of downtown SF. The perfect place to eat and relax on a nice summer day!!!", "author": "Victoria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-04", "description": "It makes me feel as if I am back on the rue de bouchers in Bruxells.  If only I could smoke inside the bars and restaurants that line it...", "author": "Francis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-18", "description": "Sure it's gimmicky but if you can't allow yourself to enjoy the charm of the place then I doubt you can have fun anywhere at all. Not much of a place to become a regular but you have to check it out at least once and it's sure to impress out of town guests. At the very least stop by for a few drinks and enjoy the outdoors on a warm starry night.", "author": "Gerald U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-03", "description": "Fantastic city find! There is a row of about 3-4 restaurants and a \"club\" called Voda. The small street is lit by white lights that builds the quaint and unique atmosphere. Great place to bring friends from out of town. Parking is tough, though!", "author": "Monica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-06", "description": "Delcious food with ambiance! Sit outside for a little Paris in the City flair.", "author": "Bee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-03", "description": "Anything or place that reminds me of  Europe gets my 5 stars.  Charming place to go for a nice night out.  I am not the biggest fan of Voda, but the restaurants are wonderful.  Perfect place for fine dining with a group of friends or with a date.  I don't go here too often so each time is special.  I love how it is kind of hidden and not too many people would think to go there.  Definitely not a tourists trap!  Love Belden Lane.", "author": "Dominique T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-22", "description": "The most awesomest place (yes, I said it)  to go to dinner on a beautiful SF evening.  I like sitting outside under the umbrellas and strings of light.   It's like a small part of Europe showed up in a semi-hidden alley.  My favorite restaurant there is Plouf.  The seafood is fresh and delicious.  Coming in second is B44.  I prefer going to Cafe Bastille for lunch rather than dinner, but either way, it's all good.", "author": "Miss T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-26", "description": "Very cute, romatic area. A little bit hard to locate, because it's tucked into a tight alleyway. I definitely want to try out more of the restaurants there.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "The restaurants are okay but I really like Belden Place for being a cute alley oasis.  It's a nice break from the crammed downtown streets by day and gives me the feel like I'm in Europe again. Thank you to the restaurants for providing heat lamps at night so we can sit outside even in the late fall and be cozy on group outings or dates!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-25", "description": "I don't go here enough, I really don't. There are some great, charming restaurants here that reminds me of Europe. It's an elegant and fun place to get food, mingle with friends, maybe even meet somebody ;)\n\nMy personal favorites are Cafe Tiramisu and Plouf. B44 is great as well. \n\nIt's one of the places that probably a lot of SF folks know about, yet it still feels sort of 'secret' in a way, sense it is tucked away from the main drag of the Financial District.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-09", "description": "Best place to be on a sunny day.  Too bad no one they're not open on Sundays.  Too many wines to even remember.", "author": "Rodney L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "the coolest place to chill outside with great food, wine, atmosphere and people watching.", "author": "Elena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-07", "description": "Cafe Bastille\nThis is my favorite restaurant on this alley. In the middle of the financial district, yet so far away from it - one is reminded of Europe. \n\nI am never disappointed here - perhaps because the food is yummy, the environment European and the service great.  Love being able to sit outside under the heat lamps and enjoy a meal for hours without being rushed. \n\nMy favorite is their fillet mignon - just mouth smacking, lip licking good. Usually part of the specials available on the weekends. \n\nThe Braised Lamb Shank is delicious too. It's a large helping so if you're hungry order it as you don't want to waste this entree. Served with mushrooms, baby carrots, garlic new potatoes, caramelized shallots in a Pinot Noir sauce. \n\nhttp://www.cafebastille.com/", "author": "shagun b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "nice little getaway from the city around. aside from the inescapable city sounds, you really do feel like you're in another world.", "author": "Marjie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-02", "description": "I found this place while walking around the area on a Wed night. I feel in love on the SPOT.. The area is great for a date... (turns out people don't know the place is around) great restaurants as well. FUN to sit outside and enjoy in the night.. DATE PLACE FOR SURE!", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Love the outdoor ambiance, especially on a Friday night. My roommates took me here for my birthday and I went to their website to check out the restaurants and the menu in this alley. My roommate Anna's favorite is Cafe Bastille but I didn't find out until we were already seated (and waiting for her) in Cafe Tiramisu. Great location - few blocks from Montgomery Bart and right in the heart of financial district. The Belden alley is hard to miss once you're standing in the Kearney and Bush intersection. Once you start walking in, each waiter will be all over you and will try to get you to sit in their restaurant. So, be strong and take your time to check out the menu from each restaurant before you decide. Overall, I agree with some of the previous reviews of the restaurants, which mostly say that the food is not as great and are kind of pricey but the ambiance is just wonderful and that it's a great place to people-watch or to unwind from a busy day.", "author": "Joselita T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "an italian array of places to eat..and my favorite is brindisi cucina de mare, tiramisu, belden, plouf,cafe bastille are just one of the best  places there...", "author": "cecille p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-30", "description": "I just love this place.  I used to work a mere two blocks away from here and enjoyed several Friday dinners and drinks with the crew.  There's nothing better than spending the evening under city lights, city noise, and heating lamps.  Yup, I said it.  It is the ideal yuppie place in the heart of the Financial District, where you have to walk the walk and talk the talk and spend your money like it's going out of style.  But you're spending your cash on amazing meals, delicious wine, appetizers that you won't find anywhere else, fascinating people and atmosphere you can only dream of.  Go ahead and say it, it's pretentious and overpriced.  But experience it first.  I (and my credit card) had a blast. Perhaps it's my quiet yearning to be in Europe again sipping cappuccino while sitting on the side of the road on my backpack, sweaty and tired and absolutely in love with everything around me.  OK, so this isn't exactly that, but you can dream, no?  Oh go ahead, I dare you.  ps:  go there after dark.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "love belden ALLEY. great for lunch, dinner, happy hour.  lots of great people watching.  my faves are cafe bastille, plouf then voda. usually end up hitting all three in one form or another when i go.  if you work in the financial district and its sunny definitely hit it up for lunch. the service is always fantastic.", "author": "Angela N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-28", "description": "i absolutely love this alley. i work right across the street. perfect to dine all year round. take advantage of their outside dining with the heat lamps.", "author": "Mika D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-31", "description": "i wish i lived in paris. this place will fit the bill for now....i guess. :(", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-18", "description": "One of the more closely resembling \"Paris\" - alleyways that you'll find in the city.  The food here is definitely good, but not \"brings me back to France\" good.  Overall, Belden Lane is just a really enjoyable area to hang out on a warm evening.  Great environment and a great place to lounge.", "author": "W. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "Belden Place guarantees to put you in a mood parallel to that with most intimate restaurants in Europe. Enjoy cuisine from France (Cafe Bastille, Plouf), Italy (Cafe Tiramisu) and even Spain (B44) in this little hideaway from the city dubbed as the \"French Quarter\" of San Francisco. The area may become crowded especially during warm summer nights when the stars and the bright lights entice more people to try the place.  However, it is a small price to pay for experiencing this small slice of Europe located smack in the heart of the Financial District. If you stumble on it by accident, it's a uniquely appealing discovery!", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "The charm of this spot is it is an alley & the hosts try to draw you into their restaurant.  I would call them \"forward\" not aggressive (amazing how many complainers their are).   I love this place on a warm evening but it is San Francisco & most nights are chilly (bring your jacket).  I had a hard time picking a restaurant based on yelp comments, seems like you either love or hate it.  I've been to Plouf & Cafe Bastille both are great!", "author": "Ed F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "We had a really good time here. Ended up at Belden Taverna, but could easily have chosen any of the other establishments. The food was good (not quite as amazing as I might've hoped), but it was really all about the ambiance and the great wines. I'm sure we'll be back to check out the other places (especially Voda).", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-28", "description": "The ambiance is very nice, outdoor dining in an alley - yes, though an alley it is still cute and a wonderful place to linger after a good meal for a (few more    :)     ) glasses of wine after dinner.  I started with the butter leaf salad, substantial without being overwhelming, and then the lamb shank which was done nicely in a deep red/brown wine sauce.  The house cab was just fine - nothing fantastic, but easily good enough.  It was a bit crowded, but their breadstick basket, with other bread crisps of odd variety, kept us nibbling while we waited for service which was understandably a little slow - but not unforgivably so, considering it was a weekend night with a wait just to get a table.  Great place to people watch, to be a little loud if you want.  They have an upstairs inside as well if you want a little more quiet, but really the best reason to go here is for the outdoor seating - the quality of everything else isn't far behind that.", "author": "Sophie B."}
