{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Chill vibes and cool swing usually\n\nGo during the later hours, it's very enjoyable to just relax and take in the city", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "The swing was gone. If you are going here for the swing, then don't. \nOther than that, the Billy Goat Hill has a really great view of the city.", "author": "Xiaohe F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "Shut up about the rope swing please.  The more that people talk about it and post pics everywhere with the rope swing, the sooner it will get taken down by the city.  It's a lawsuit waiting to happen in terms of injury and liability on city property so if it's there great enjoy it, but be discreet about it so it can be there longer for others to enjoy instead of drawing so much attention to it that it inevitably gets taken down.  \n\nBilly Goat Hill is a great viewpoint as well as a park.  The view looks East/North East covering downtown, Bernal Heights Hill, the East Bay, and Noe Valley and it's nice because you can just drive up and see it from your car.  If you like a night skyline view it's worth noting that you can't park here from 10pm-6am.  \n\nBeyond just the view there are a few staircases in the neighborhood to make it an urban stair hike walk. Down the street is the Harry Street staircase which connects Laidly to Beacon as well as some other staircases around on Castro, 27th, and Valley. \n\nEssentially Billy Goat Hill is more of a neighbhorhoody park that probably no one had heard of beyond people that lived in the neighborhood before Yelp.  So if you are looking for something spectacular like Twin Peaks it's not up to par but if you are near the neighborhood doing something in Diamond Heights or Noe Valley it's worth checking out for the view.", "author": "Joan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "THERE IS NO ROPE SWING.\n\nI wish I saw that review before I went on a trip here to visit that rope swing. \n\nBut it's okay! The view is absolutely stunning! Loved every minute of it. There's a short hiking trail up/down the hill and at the top you get a clear view of the city. Lots of greenery. Fairly easy to get to. \n\nIf you find yourself near here, definitely make a stop!", "author": "Berna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Just located by Twin Peaks, this is more of a quick scenic stop. There are open areas and a big slope going down hill. If you're not afraid of heights, I would recommend having a picnic here on a sunny afternoon since there is space for it on the grass.\n\nLike what everyone else said, there is no swing here. Just a lone piece of rope. But don't let this stop you from seeing one of the most beautiful views of the city!", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-02", "description": "Sad to get here just a few days after the swing was removed... that being said I'm glad there wasn't a line to get amazing pictures.\n\nAside from the two guys that were smoking weed on front of kids, this would have been a great experience.\n\nThe view is amazing and parking isn't difficult. \n\nWhen I'm the area, this is a must!\n\nMaybe next time I'll hit up Home Depot and make my own swing set.", "author": "Arnel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "A nice little gem in SF, with good views of the surrounding area. There is a walking trail you can use to reach it or you can be lazy and drive up by car and park. The weather can get weird up here, with some gusty winds. Guess there was a swing up here but its gone now because of the risk.", "author": "Wally B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "The view is awesome!  However, the rope swing no longer exists.  The trails and steps are steep, be prepared with good shoes.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "Very beautiful site,  would be better if the swing was still there.  Sad that others have to ruin it for those that want that experience. I recommend going up higher and check out Twin Peaks.", "author": "Christie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Okay who are the jerks that removed the swing? I heard about this place from an unlikely source and that is the friend of my last ex-girlfriend. Unfortunately to my disappointment it's been gone for many months. Now it looks like I'd be wasting good money on the Golden Gate Bridge toll now. Okay enough drama! I'm not here to review a dead tree swing. I'm here to review the great location this park is in. I love it a lot after you park your car and walk down the steps, you are treated with a great view of the San Francisco skyline. I am really glad I can see my workplace from the lookout point. The tram tracks are right in front of me. For parking it's not too bad on a Sunday. Just remember to do it correctly. It's on a residential street that's really slim. For the area itself it's dog friendly so please do bring your pets. The view is worth the drive.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "THE SWING IS GONE!\nIt used to be an awesome place for a view but there is no trail, no \"insta-classic\" swing, and no ambiance aside from the view. \nBRING BACK THE SWING PLEASE", "author": "Tooka Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "It's always windy in sf, and this being on a hill makes it no less.\n\nBut it's a good spot for a picnic, get together, soaking in the sun.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "View is epic! \nBest view of the city!!", "author": "Lynn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "One of the most charming views of San Francisco I have seen so far. Really lovely, pretty...do not expect to see that swing anymore, though. I knew I would not find it, so I did not get frustrated, but that was the reason why I discovered this place (though a picture of a friend posted on Facebook swinging on that tree with THAT view). It is off the beaten touristy path and the neighbors are really friendly there! My friend and are were talking (loud as usual) and we were asked several times where we were from and initiate conversation. Breathtaking views, pretty houses with many flowers and plants. A very romantic point in SF (not suitable for picnics, though, we carry our cute wicker basket for nothing).", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "How did I hear about this place??\nAbout a year ago a friend sends me a photo and I was blown away....\nI figure why not take a trip here on Mother's day!\nThe drive is around Twin Peaks, so you can see hidden views all over.\n\nBeware of parking, as signs says NO Parking in certain area's. Upon entering I was looking forward to take a candid on the swing but I noticed bummer someone took it off!\n\nA little disappointed but the breathtaking views took me in awe. A pure Gem! I heart SF!!", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-09", "description": "This place was alright... The swing wasn't here!!! :( came today 7/9/16\n\nIt's an easy walk down to the bottom. Parking was easy to find, as this place wasn't that packed", "author": "Amy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "First let me say that I love anything with goats in it! \n\nSecond views are spectacular. Parking is easy  and overall a pleasant park!\n\nI also liked that it wasn't crowded.\n\nI didn't take  my pooches with me this time but I will next time!! I'm sure they will approve haha!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "Came here because I heard it was a really good photo op place. Definitely was not disappointed about the view. It's a very short uphill walk. There was a really nice look out point. I noticed a lot of people brought their dogs to walk around the place.\n\nThere used to be a swing attached to one of the trees but now they're just ropes. Apprently, the swing and ropes come and go. Unless you want to risk fall and rolling down the hill, you probably shouldn't try to swing on it. I am 5'1 and could not get a good enough grip on the rope and couldn't reach the ropes. I watched one giy who was around 5'8-5'9 swing on it but still looked pretty dangerous. \n\nOverall, the view is great the park is nice! I would definitely bring my friends here!", "author": "Deedee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Honestly there's more than enough review to give the details about the not-so-big-dirt-path park, the often cut-down swing, and the gorgeous view. I am writing this review (my 200th!!!)  because the bf deserves some recognitions! \n\nWe visited on Aug 14 and back then I wasn't aware that someone often cut down the swing. I was devastated when we got there and seeing no swing. After much pleading and nagging, the bf decided that he will build a swing for me to swing on and take pictures. \n\nSadly, it seems like as of today, the swing is gone AGAIN! Dude it cost me $30 to get the supplies from Homedepot and the bf risking his life climbing up the trees. I should have stick with my original plan of using steel chain. \n\nThank you Mr. P for building me the swing!", "author": "Joanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "I love these hidden parks spread throughout the area with these ridiculous SF views. \n\nThis park is certainly more than just the swing and keep in mind it comes and goes without any warning. I've seen people park their cars, walk a few steps in to see that the swing is gone and they'd turn back around into their cars. The popularity of this park seemed to have grown as of late due to social media (admittedly this park offers some great photo ops) so it's sadly no longer a secret only known to locals. \n\nA nice park to enjoy with your dog(s) as well.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-02", "description": "Four stars if you prefer an easy stroll or something easy to walk up to. Two stars for me since I prefer something more challenging.\n\nFour stars for the decent view of the city. Two stars for me because it looks like any other view of the city from some hill up top.\n\nTwo stars for not having the swing anymore.\n\nTwo stars it is for me.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "No doubt the most beautiful views of San Francisco you will ever get for free unfortunately by the time we got up there there was no swing any longer, but the views were spectacular not to mention along the way we pick some blackberries and sat and looked at San Francisco and ate black berries. I encourage everyone to go at least once to Billy goat hill\n\n.", "author": "Lib B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "The swing is gone but still great views. My son even got to play some hoops on the upper part of the park. Looks like a great place to bring your kids and watch them play.", "author": "Lorena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "Before we went to SF, I read reviews that the swing was already gone--only ropes were there.\nSo we still checked this place out for the views, but when we got there, the swing was back!!\nThe views were incredible: if you like the views also check out Twin Peaks.\nIt's a neighborhood park and houses around here are nice.\nIt's also a pretty great workout with the stairs, too.\nI heard that the fence weren't there before, but for safety purposes, it had to be there.\nCheck it out if you're near the area. It's somewhat secluded!", "author": "Laramae E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "The views here are gorgeous! I love that this place is hidden away from so much of the other SF tourist traffic. It's a great place to see both the skyscrapers/city skyline as well as the beautiful colored houses and streets of San Francisco all at once. It's pretty high up too, so there isn't much obstructing your view at all. Heads up that you can't see the Golden Gate Bridge though! \n\nThe swing is no longer there, but there's a cute little park at the very top of the hill if you cross the street behind the lookout spot and walk up the path where all the trees are. Another great view of the other side of the city from this location!\n\nPlenty of parking (free!) and amazing views, tucked away from the busyness of the rest of the city. Definitely a great place to check out!", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "I was on a quest yesterday to see a few spots I had on my SF bucket list and this was one of them! A hidden gem in the city and a great scenic romantic spot for a date :) I don't know if there is always as much traffic as we saw, but usually 3-4 groups of people coming and going at least when we were there after lunch. It *was* a really pretty day yesterday with no fog in the city and sunny skies so I'm sure more people were out playing. \n\nIt's definitely a great place to sit and talk and catch a view. The swing appears to be back despite the reviews before...looks like someone put back the swing! It feels so nice and surreal swinging on it and that view....I was a little nervous before going because I wasn't sure how safe the swing would be but after seeing so many people try it, I was pretty sure my weight would hold. A little girl even came and stood on the swing, swaying back and forth until she was almost level with the tree branch! There's usually a line of people waiting to have a turn and take a picture but it goes by pretty quickly. There's a slight breeze on the hill, but it felt good yesterday...I'd definitely come back if I happened to be in the area :)", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Awesome view point of the city here and it never really gets crowded! Mainly because there's not much to do but check out the swing and take pictures.\n\nStreet parking is always plentiful and it's a short walk down the steps where the swing is. The swing always seems to change whenever I come here! It was a skateboard, then a wooden plank, and now it's an orange cone!\n\nDefinitely check this place out if you haven't had a chance yet. A go-to spot when I have people visiting - we always make a stop here!", "author": "Wing L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "No more rope swing but had an amazing view while eating lunch at the top of the hill where the swing was", "author": "Sara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Stumbled upon Billy Goat Hill by accident & I loved it! Came here with my boyfriend on May 14th & as of then the swing was no longer there. The view of the city is marvelous but if you're looking for an intense hike, this is definitely not the spot for you. As for photos? I'd say go for it! It's beautiful, quiet, & a nice alternate to the often crowded city.", "author": "Stephany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "You can easily find parking here and you get a great city view!\n\nI noticed the swing didn't have the seat, but I feel like people take them or bring their own? I'm. It's sure. \n\nI would definitely say to bring a professional camera for a better picture or else it doesn't do the view justice.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "Billy Goat Hill has an amazing view of the city. Go to the lookout by the big tree for a stunning view of San Francisco. The rope swing on the tree is frequently cut, then replaced, and then cut again. If you want to get that iconic shot of yourself swinging over San Francisco, be sure to bring a strong rope and piece of board to make your own makeshift swing. There are two paths up Billy Goat Hill, one is nice windy walking path and the other is a very steep unofficial path worn out by visitors. If its rained be sure to wear boots as this park and its steps tend to get flooded.", "author": "Lindsay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Another SF tourist trap. Sorta.\nI've been here twice. \n\nThe first time I went here was during the day. I took a couple of friends from out of town. The swing was in tact & there was one other group taking pics but there is a section with a view that is fenced off that can serve as an alternative or a distraction while you wait.\n\nA line can form rather quickly & you can't really take your time taking the pics you want to take because everyone is just standing there waiting for you. Just sayin'\n\nI went here at midnight the second time, &&&& my oh my, don't do it unless you're with a big group. Getting to the swing is SUUUUUUPER dark & although it's in a nice neighborhood it's still creepy & can have a couple of wanderers just posting up. The view at night though is GORG! City lights have always been a weakness of mine. OH! But when we got there, the swing was cut down. It was quite sad, actually.\n\nSo it's a gamble if the swing is up or not from reading the other reviews.\nThey should have a website that states if there is a swing up or not. SUGGESTION BOX!\n\nBut all in all, AMAZING views of part of the city & a great novelty idea for both tourists & locals alike :)", "author": "Camille C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-22", "description": "the swing is goneeee. THE SWING IS GONE. ://// I used to come here all the time, and I just brought a friend here who's in town and, alas, there is no swing. :(", "author": "Alexis Lynn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "This place is definitely one of the top spots to check out if you're visiting The Bay or if you're a local looking for a spectacular view of the city. No joke, y'all! Remember that scene in 500 Days of Summer where Joseph Gordon Levitt takes Zoey Deschanel to his favorite spot in Downtown LA? Well, sorry JGL, but this place is SO MUCH BETTER. Don't get me wrong, I love DTLA and that movie. ;)\n\nMy friend and I drove up the very hilly Daly City, passing by random streets, getting lost with navigation, and wondering if we were going the right way. However, once I walked down the wooden pathway, my jaw dropped because I couldn't get over how picturesque everything was! You just have to see for yourself. The day I went was pretty clear and nice. There's the view of downtown SF, Bay Bridge, East Bay, San Mateo Bridge, Golden Gate, beautiful Daly City homes, etc. \n\nOf course, thanks to social media this place has gotten so popular because of the SWING! Hashtag *Swing Life Away.* :P Fortunately, when we arrived, there was this friendly gentleman that put up a new swing! AKA: a piece of wood wrapped around a rope. Pretty scary, but super fun. The swing, I REPEAT, THE SWING is either there or not! We definitely got lucky that day! The swing itself is another bonus to this already awesome park. But even if it's not there, you won't be disappointed by the view...well, maybe if you were hoping to Instagram an epic swing picture. :P Either way, you'll appreciate the city when you look at it from this top view.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Wonderful swinging on a rope and scenic urban city view!  \n\nYou do it for the moment, the glee on hopping on to the swing and weeeeeee...smile for the picture snapshot!\n\nIt's a bliss and a pleasant breeze while on the rope!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Great view of the city. Went here in hopes to swing from the infamous tree swing with a view but unfortunately couldn't reach the swing. \n\nIf you're coming here with hopes to swing from the tree, bring your own heavy duty rope to tie to the tree just in case. Something I wish I had been told to do. \n\nIf you're coming for the view then you will surely be satisfied with that alone. I would recommend a picnic if the weather is nice and not windy.", "author": "Foodie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Best known for the popularly exhilarating swing perched over one its hills, this park is accessible via either at the bottom on Laidley St. or from the top on Beacon St. (both of which are connected through the breathtaking Harry Street!). After some steep steps, once you reach the top there is an open area for people to come and either line up to take a turn on the perilous swing, or to admire the view, which is certainly one of the more amazing ones from a park around! Be prepared though, it is usually windy and cold from the top, and the swing might not be there anymore. First time I came it was, a few other times it wasn't, and then it was back on. As if people bring their own makeshift seats. \n\nThe hike is worth the view! :)", "author": "Kyrie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "I went back in February and someone cut down the damn rope. I went again 8/1 and it was there! Yayyyyyy. I wanted that epic photo of me standing and swinging like Miley in Party in the USA and I think I failed haha. There is obviously a line for those photos which is the downside of this. You feel rushed and you cant take the photo you desperately want in every single angle. So with those few minutes, you better twerk it. This swing is lower than the other because if you sit on it and swing, your feet will touch the floor. I stood on top and it was a bit shaky and scary but needed that photo op. Yup you get that view of SF which is nice but I really couldnt enjoy myself entirely because there is seriously a crowd before and after you waiting and you feel damn rushed.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Swing your way to the top, my darling! :)\n\nThat's exactly what I did for Sunday Funday yesterday. What a perfect afternoon spent experiencing this amazing hidden gem of SF with my bestie!\n\nThe address gets you in the residential area up in the hills. Plenty of parking; I remember that the sign said no parking between 10pm to 6am, I think. Walk along the pathway towards down the hill along the wood steps & you will almost instantly spot the tree with the rope/wood plank swing. \n\nThere are two swings- one with the rope & wood plank seat while the other one is just of a rope. We both tried the wood plank one which was the less scarier one. Next time I'll try the other one. \n\nSuch a wonderful place indeed. Beautiful view of this city that I love and being able to be a kid again! LOVE!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Tons of parking around and the view is gorgeous! You get a glimpse of the residential parts of the city, as well as the downtown skyline and bay bridge. Also, this place isn't too crowded, which is a huge plus! The swing is there on and off, as I hear the residents cut it off to keep their peace and quiet. I don't blame them as the swing makes for such a great photo op and view of San Francisco! Unfortunately, I did not get to witness this swing on my first visit here. I bumped into someone who told me to check pictures of the location on Instagram before coming. If someone saw it within a week, it should still be there! I'll be sure to do so next time I decide to visit again!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "Let me start off by saying- Do not listen to google maps to reach this point walking. It took me an hour with all the hill climbing I did.\n\nTo find this location you must know to enter the dirt path which I didn't and wandered into the area. \n\nThe swing was missing and to be honest I don't think I would have tried it despite the fact that was the sole reason for the visit with the bonus view.\n\nIt's a dirty path so I would not recommend wearing open toe shoes. My sneakers got filthy and so did the bottom of my jeans. (Now I have to go back to my room and change) \n\nThe views are amazing from any angle so bring your selfie stick or another person to take photos of you if that's your thing. \n\nIt was a family of 3 when I arrived which was leaving and before I left a group of two. Safe to assume not many people visit that area.", "author": "Kinya L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "It was incredibly windy up here when I came so unfortunately I couldn't stay long to admire the awesome view. The swings were too high up to reach when I came which was disappointing but if there's a will then there's a way (even if that way involves dangerous tree climbing and rope swinging maneuvers). However, on a positive note, I really like admiring the houses around this area. Seriously prime real estate. The houses in this area all have ceiling to floor wide windows with which they can admire the glorious city scape. I'm envious of those house owners. \n\nThis place has a long staircase that leads down to the tree with the swing. Come here if you're a swinger. Or if you're in for a mood swing. \n\n\"Shawty swing my way, you sure look good to me so would you please swing my way.\"", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "This place is amazing, when the swing is there. \n\nWhen the swing is there, people are kind enough to take turns. Parking along the street is always easy too which is a plus. A lot of people know about this place, but its never crowded nor is there a line. \n\nSadly when I came on 8/15, the swing was gone. I know it's been cut down a couple times, but someone always makes a new one, so bless their souls. Hopefully the swing will return soon!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Swing is gone but still an amazing view! I went early in the morning (7am), there was hardly anyone there and it was super refreshing", "author": "Sammy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-01", "description": "Here one day, gone the next. \n\nSeriously stopped by yesterday and the swing was intact. Come back the next morning and it's cut down AGAIN!!! \n\nWho is cutting down the swing and why?! \n\nTrue mystery. \n\nThe view is still spectacular despite it being swing-less. \n\nBummer.", "author": "Annika H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "Love this place! Such a gorgeous view of the city. The swing isn't there anymore, but it's definitely still worth the trip. There's plenty of street parking and when I came here, it wasn't crowded at all! The lookout point is just a flight of stairs away from street level. The views are amazing...assuming it's not too foggy. You can see over the rooftops of all the little houses in the city, and you're high enough so that you can see way out. Great photo spot! Would highly recommend visiting.", "author": "Ashley Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "WOWW! Fun + great view + awesome ice cream near by!! Bring a camera & wear hiking shoes!! \n\nI've always wanted to come here because of the lovely view...I live in the sunsets, and to come here by bus takes too long (45min, 2 buses) so we decided to take an Uber ($12 split between 4 people). \n\nThe park itself is tiny, but you can see the entire city from the hill. There is a swing that hangs from a tree. IT IS VERY SAFE. Two of my guy friends were on it at the same time and it didn't even break. \n\nMake sure to ask someone to take a picture of you from behind, when you are swinging to the highest point - it'll look like you are flying into the city. Really cool!! \n\nYour shoes may get dirty since the park is just dirt. Wear something that you don't mind getting dirty. \n\nMitchell's ice cream is also 10-minutes away by walking, so definitely check that out!!", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Went here at night. There are stairs that leads you to a spot where there's a great view of the neighboring residential area of Bernal Heights. Nice view! Very calm and relaxing. You can hear the Muni buses running by though, but it's actually quite soothing rather than irritating.\n\nThere's also a swing that's hanging with just one rope from a tree branch (where's the other rope?!). It seems pretty sturdy, but also dangerous because if you fall off, you'll be tumbling down a hill...", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "This place is awesome! There are three swings tied to the tree branches overlooking an amazing view of the city. It seems a little sketchy but it's definitely sturdy. My friends and I bought sandwiches from Ike's Place and drove here to enjoy our lunch. Then we took turns swinging and taking pictures of each other.\n\nTIP #1: Try to come on a clear day. Don't come on a foggy day!\n\nTIP #2: My friend said it's even more amazing at nighttime, so I'll be sure to do that next time!", "author": "Lincy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "I am still very disappointed that the swing is no longer here. Although the swing is no longer there, it's still a nice place to just relax on a nice sunny day in SF with a amazing view. \n\nI hope for a miracle next time I come and the swings are back!", "author": "Danny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "I love taking my dog here! I just hate pulling all the foxtails out of her fur because Rec & Park doesn't trim them. Also the rope swing is gone! Whoever did that is a dickhead. The last swing that was there was VERY nice. It had a rubber coating on the seat. It's nice when there's no riffraff or thugs drinking booz & smoking cigarettes then leaving all their crap & trash behind. \n\nThe path near the rope hanging from the tree is slippery as heck from erosion. It's where there's a gap in between the set of stairs. Be careful or you'll slip and fall on your ass. I've seen that happen to people! Rec & Park needs to build stairs there too!! \n\nOther than that, it's a nice place for dogs to go and for you to get a workout from 9 flights of stairs!", "author": "Erika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Such a nice place out of the tourist areas! \nIt's a close walk (15min) from Glenn Park BART.\nNice houses and a breathtaking view over San Francisco!", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "Billy Goat Hill makes me feel like a child again!! The view is absolutely stunning!!! you can see all of SF, Some of Daily City, South SF and more!!!! It is the perfect view and on top of that, it has the most fun swing!!! Why would you not want to swing over on of the most beautiful cities in the world??? My experience was breathtaking! Swinging like a kid and over the most beautiful view!!! \n\nIt is by no means a hike, depending on where you park, it is vista point to enjoy =)\n\nMy goal is to come back at night and see the city!", "author": "Rochelle E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Nice little stop for a beautiful view of the city. No swing available on Labor Day 2016. I was hoping that someone would make one for the holiday weekend so that I could take a cool picture. Lol. Still a nice stop though. No regrets of coming.", "author": "Cat T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-04", "description": "Nice view of SF from here and very easy to get to. Sadly, the swing is gone now as of may 4th 2016. Parking is very easy in the streets. I will probably come back at night for a view of the city lights.", "author": "Dang L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "As of today, there is no swing. Great views though! Other reviewers said the swings come and go. Today there were just ropes left.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "The view from the hill is amazing. We were excited to try the swing out but unfortunately it was taken down while we were there.", "author": "Manasvi S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "Came here looking for a swing to swing on, however it wasn't there when I visited. All I got was a nice view and cold weather. Was a bit disappointed that the swing was cut down, but it was still a nice place to visit.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "This was my first time here and I have to say this place is a MUST if you are visiting San Francisco! Beautiful view of the city as well as killer photo opportunities.\n\nThe swing is pretty difficult and scary to get onto, but it is definitely worth it! My heart was beating fast and I got an adrenaline rush. However, it's very relaxing when swinging and enjoying the view. \n\nGood news is, if you happen to fall, the hill isn't too steep to kill you. You'd only tumble down and get some bruises. \n\nOverall, it's a great place for memorable experiences. I will definitely be revisiting!", "author": "Leah V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "What a wonderful treasure hidden near Diamond Heights! Today was my first time visiting Billy Goat Hill and my friend and I were a little nervous after seeing Angela I's review from 10/11 saying the swing was broken (thanks for the heads up!) but there was a swing up and running! It was really fun to swing on and the day was so beautiful you couldn't help but feel like you were in elementary school again. I would suggest wearing sneakers because there are a lot of steps to take to get there and an uneven dirt path to go through to get to the actual swing. And don't forget to be touristy and take lots of pictures! Even if you don't go on the swing, the view is beautiful and on a clear day, you get to see a lot of the city. Will definitely be coming back!", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "Although the swing was not up when my bf and I came on 1/1/16 afternoon(ish) the view was breathtaking! \n\nThe kid in me wanted to use the swing, maybe next trip I can catch it. Will be checking yelp for updates. My soul died a little when I saw just the ropes hanging from the branches lol   :-(", "author": "Lizbeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "The scenery is amazing here! You can see so far and the sun is just glistening. I really recommend significant others to come and just sit down and have a chat while enjoying the scenery. \n\nFor the photographers, there is this swing on which you can have your model sit on and you can take pictures of them along with the view. Just be careful about your footing! \n\nI also love the houses on the side of the park. The windows are big, doors are cute, and building is cute. I would love to live in one of these houses one day and enjoy the amazing scenery!", "author": "Doris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "One of the few places with swings around SF!\n\nDriving to this hill is all uphill, so driving stick can make it a pretty steep drive.  What I like is that there are plenty of spots to park at.  The park itself is somewhat small.  The secluded spots for a picnic with your date are usually taken whenever I've gone here.  Once you walk down the stairs you can already see the swings hanging on the tree or people using them.  \n\nThis place would've gotten a 5/5, but I gave it a 4 because sometimes the swings aren't there and that kinda the big reason why I'd make the drive here rather than a closer view of the city.  I'm not sure if the ropes wear down or people just vandalize and remove them, but when the swings aren't there it just seems like an alright park to me haha.  It gets pretty cold up there as well, so bring a jacket!  Bring food too to enjoy eating with a great view of the city.", "author": "Justin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "I came here a couple of months ago (I know, late review), and the swing was gone :( I think someone cut the swing off because there was still one piece of rope hanging from the tree. We still wanted the same experience everyone else was getting so we just took the rope and swung from that. Pretty scary if you can barely reach it (like me) or if you can't get a good grip. To be honest, the fall isn't thaaat far down hahaha. While one of my friends fearlessly swung from the rope, my other friend was terrified. I thought it was scary the first time and then kind of thrilling afterwards.\n\nOverall though, it was a good mini hike up the hill and the view is really nice. Totally instagram/facebook worth too :P", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Great views during the drive and when getting to this spot. Unfortunately the swing wasn't up when we got there, but still a nice place to stand around, take in the scenery, & take some really nice pictures. It's a nice little escape for the busy streets.", "author": "Rynel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "Finding out that this park is a mere 10 minute walk from my house, AWESOMEEE!\n\nFor the non-adventurous, there is a fenced off plateau where you can view the entire city skyline. For the adventurous, there's a swing off the tree....I literally just climbed up and used my momentum to swing, but I'll admit, it's probably easier with a partner pushing you. Regardless, the view is amazing!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Whether it be a death defying leap or a bird's eye view of San Francisco, Billy Goat Hill will quench any adventurer's thirst for excitement.\n\nAtop a hill that oversees the city, lies a sturdy tree with two ropes attached. Depending on how daring you are, you have the choice of a seated swing or one that requires Tarzan capabilities where you dangle freestyle from a single stick, vertically.\n\nOf course I chose the one where you sit and don't have to concentrate on pectoral, bicep, and abdominal coordination. \n\nUh chyeah... ain't nobody got time for that!\n\nIn anticipation, and with a sprinkle of nervousness, I sat on the flimsy wooden swing and prayed I wouldn't topple down the steep, rocky hill. \n\nAlas, I gained the courage and momentum and took the jump; and there I was... swinging like a monkey without a care in the world.\n\nThe views from uphill are incredibly breathtaking. You can see all the way out into SOMA, the Financial District, Potrero Hill, the bay waters, and on a clear day, you can even catch the Golden Gate Bridge in all its glory. \n\nIf you've ever craved to be that eagle in the sky, this is the perfect place to experience that wind beneath your wings. You truly do feel as if you're soaring in the clouds.\n\nOh and also, regarding the swing, the rope between the legs can cause a bit of chafing if you're not too careful. I guess this gives a new meaning to road rash. Just wear a cup if you're packing beans and a frank and you are SET. \n\nThere's a trail that leads down to the bottom of the hill. So if you're not as daring, you can still enjoy a beautiful view and a short hike.\n\nI highly recommend coming here to experience another one of San Francisco's hidden treasures. \n\nThis will be a memorable experience. \n\nRug burn or not.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Parking on a Friday wasn't hard to find at all as long as it's not the 2nd or 4th Friday of the month(that's what the street sign said). Getting up the hill is a bit of a hike, not a long hike just  a lot of incline. Once you make it to the top the view is breath taking! Girls who want to take pictures be prepared cuz it's very very windy! Your hair will be in your face. Sadly NO SWING!!!! You can see the spots where not one but two different swings were cut off. My guess is the neighbors don't like noise and people taking up parking so they cut the swings but don't let them spot you. The view is still worth the visit.", "author": "Hayley q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "I heard there was a rope swing here but it seems as though it is completely gone. Other reviewers state there was some remaining bit of rope left, but on our visit last week  there was nothing left of it. But the view was still amazing and hubby and I sat in the tree for cute little photos. \n\nRan into another group we had seen at another secret spot, and met some ladies who we chatted with and took a photo for them and they took one of us for us. I was nice to see the view and meet some nice people. Maybe the swing will be replaced soon but even if it is not, give this little park a visit and check out the view, don't forget the pups if you have them!", "author": "Tina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-22", "description": "Small hill with mainly a view of the residential homes. A lot of people and their dogs come through. The swing that is usually here was cut off.", "author": "Jami K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "Swing on hill overlooking the city. So San Francisco. \n\nOnly in this city would there be a swing on a hill with one of the most gorgeous views of SF. It's a shame I'm terrified of heights and could not even sit on that thing for more than 10 seconds without freaking out. My friends had fun swinging on it though. And if you're like me who has borderline acrophobia, you can still enjoy the pretty view and take some awesome shots of the city! \n\nTip: watch out for mosquitoes!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-23", "description": "Three stars because it's a small park and it's impossible to predict what you're going to get. Still worth visiting!\n\nFor me, the funnest part about Billy Goat Hill was trying to piece together the park's entrance location from pictures on Yelp/Instagram. Google maps takes you to a residential street; it's up to you to find the trail head from there (it's marked with a signpost!). The trail itself isn't hard (no need for hiking shoes or anything like that) - most of it is actually stairs. There were several dog walkers.\n\nThe star attraction of this park is the iconic swing that hangs from a tree at the base of the stairs and stars in many instagrams. I sadly missed out on taking a picture swinging on it; it was cut down just 48 hours before I got there. Previous reviews indicate that new swings appear every few weeks. If you really want a picture on swinging into the San Francisco horizon (and I don't blame you!), bring a swing with you. Or search for evidence of the swing's current status on Instagram before you leave. \n\nEven if the swing is gone when you get there, the view is gorgeous on a non-foggy day and has very easy residential parking. Bring a camera and maybe a picnic for a fun hour admiring the cityscape.", "author": "Varsha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "This was so much fun! The park was a little hard to find, but it was worth it! I wouldn't exactly call it a park though.\n\nThere's a rope swing at the top of some stairs that makes for some killer pictures. Awesome views of the city!!!", "author": "Fiana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Sometimes the swing is there...sometimes it isn't. It took me three tries to finally go on a day there was a swing :( but once I finally came here I LOVEDDDD IT. This place was a hidden gem but is becoming so popular that I've heard there are sometimes lines to take a photo on the swing. It sucks because it's such a relaxing place to be but now you can barely swing because there's so many people waiting for their turn, you kinda just have to get on, take your photo, and get off. I was lucky to get there when no one was there and had the luxury of actually swinging in peace. Just a tree with a swing and a view of the city. Everyone should come here at least once.", "author": "Maleah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Great views of the city from up here. There is ample parking right in front of the park if you are coming by car. Unfortunately the swing was taken out when we stopped by in April. It was quite empty for a Sunday afternoon which was nice.", "author": "Zoher Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "This is a great hidden park that not many people know about. The views are amazing from up top and there is a little ledge to stand at and, of course the swing. As of 7/1/16 the swing isn't there so I was slightly disappointed but it is definitely worth going to this place for the view and is close to Twin Peaks. We parked up top and walked down to the tree from there instead of walking up. Very easy and safe steps. Would visit again!", "author": "Ethan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "Amazing spot with a view. The swing looks a bit sketchy but it's super fun. I was a chicken and didn't swing out super far since it's quite possible to fall far far far down. Would have given it five stars but it's cold as Alaska up here. Definitely worth it though!!", "author": "Vivian X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Took a spur of the moment trip here this weekend and wasn't disappointed. The view is ridiculous. No swing (5/1/2016) but we enjoyed regardless. We easily found parking on diamond street and walked down beacon to get to the park. If you're from out of town I'd only recommend  going here if you're in the area as it is kind of remote and very small. Alternatively, Bernal Heights park offers 360 views, dog friendly walking trails and proximity to other must see SF sights.", "author": "Araba A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "Came here to take a cool picture on the swing but the swing was gone :( Still a beautiful park though, especially during twilight.", "author": "Kimmy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "A rope swing overlooking the city.. what more can you want!? This is so much fun and a must for visitors and locals alike.", "author": "Sara P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "Gorgeous view of SF! I'm so happy I was able to visit park while the swing was still hanging on the tree. I've heard that it's no longer here... :( it was definitely a fun experience. I was scared to def sitting and swinging on it for like 3 swings but I had to do it because it was so IG worthy. Haha. Things that we do for IG now a days. \n\nEven though the swing is no longer there, it's still a great place to view and to have a picnic at on a gorgeous sunny day. Views are great and lots of grass to sit and enjoy.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Gorgeous view! A place that must be known as a must see for tourists. I feel like the amount of popularity this place gets does not do it justice.\n\nThe dirt roads are kind of slippery so beware. There are two swings: one you can sit on and another that you can stand on. They're both freaking awesome to try and you can take great pictures on them with San Francisco right behind you !", "author": "Vernice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "This is an awesome place to visit as both locals and tourists! I think this is one of the places that not many people know about, so it's not as crowded as you think. It's also in a somewhat residential area. There's definitely parking in the neighborhood and you can park and just walk to the little spot. \n\nMy friends and I came here during night time, which was definitely a bad idea. We were visiting other places and ended up here after dark. It was a different experience I guess. But we used our flashlights and were able to get down to the swing safely! \n\nThe view was beautiful though, overseeing the city lights. No pictures could do it justice. And being on that swing was so much fun and so scary (because it was pitch black). But with the wind blowing into your face and your hair, it's such a lovely feeling! It's such a peaceful sight.\n\nI am coming back when it's day time to see it in a different perspective. I do recommend this place! It's a nice tourist-y place to visit.", "author": "Wendy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "When I went to the Bay Area in December of last year, I decided to go to Billy Goat Hill because I saw a bunch of Instagram and Facebook posts with people taking pictures on the swing on the top of the hill. The view from Billy Goat Hill was really nice because I got to see an amazing view of San Francisco from the top of the hill. However, I was not able to sit on the swing because it was quite unstable and the swing was a little too high for my reach even though I am 5'4\". When people got on the swing, it seemed too unstable for my tastes even though I wanted a picture on the swing. It has been 9 months since I went there, so I don't know if they have fixed it, so I am giving them 4 instead of 3 stars just in case it has been fixed. I will check this place out again when I visit SF in the future because I still want that picture on the swing LOL.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "This place was such a thrill for my friends and I, we love this spot. The walk down to the swing was a breeze of only about 20-30 wooden steps. I went during the night with two friends and we could see all the way until the bay bridge lit up and beyond.\n\nI would definitely recommend this spot to anyone up for a little adventure lol as long as you have a car! The drive up there is a bit tough especially at night so you have to be careful.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-23", "description": "great view, but the swing is no longer at the park.  if i had known earlier, i would've just visited twin peaks for the perfect view of the city sans the swing.\n\ndropped by after brunch one day in hope to play on the infamous swing over the city but there were only remnants of the rope from the swing being cut off.  sadness.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-26", "description": "No swing today--very disappointing. Still a good view, though.", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "I've been here multiple times, both when the swing was here and when the swing wasn't, and I enjoyed it every single time. \n\nThe swing definitely provides for some great photos and the fun experience of \"swinging over the city\". However, the view is just as amazing when the swing isn't there. This is a great spot to come and picnic or a nice spot to simply enjoy some beautiful SF views.", "author": "Manogi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Lovely little park on a hill. Almost always too windy to stick around, but on the rare occasion the wind stills, I'm running uphill to bask in the sun!", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-30", "description": "Very pretty but the swing has just been cut down! Directions are very straight forward and the view is amazing!", "author": "Kali D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "The swing was not there... Either way, it was a good time and the views were great", "author": "Michael B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-16", "description": "The view is beautiful! But the swing isn't there anymore!! \n\nTook the Uber here from sunset and it only cost $8! Whoo hoo!!", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Roped in.\n\nSwing is currently no longer. But you can still grab the remaining rope and handle and propelling yourself off the ledge. Skyline background is a major Instagram win.\n\nIt's slightly ridiculous, briefly terrifying and completely fun. Pretty much just like this beautiful city we call home.\n\nSan Francisco just won't let go.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "I came here on Saturday, January 24, 2015.\n\nWho cut off the swings? Reveal yourself!!!!!!!!!!!", "author": "Alice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Fantastic views of the city. Many photographic areas to explore. Someone should really go and put a swing back up there. One of the rarities seen by the San Francisco tourist.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Very short walk for a nice SF view! But super sad to see that someone had taken the swing down :(", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "As of 1/23 or as early as 1/19, the swing was taken down. I suspect is was some NIMBY neighbor but I sure hope it is replaced soon. There is another swing in Tiburon, fyi.", "author": "E E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "Great view of the city. It's true, the swing is no longer there but they're is a cool bench at the base of the park and a gated area for awesome pics.", "author": "Marcela M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-04", "description": "It's an amazing view of the city, but when I came down all the stairs there was no swing!!! It looked like it had been cut down. Very disappointing but an amazing view so can't complain.", "author": "Nicole Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "I concur with most of the other views, but I gotta say, as a country boy who visits his girlfriend on weekends, this is a hell of a swing, especially at night.  It's certainly not for the faint of heart, because losing your grip can mean a long tumble.\n\nThere were two swings there, one with a small plank of wood tied into it that you could use as a seat and another that is mostly just rope with some knots in it.  The one with some knots in it did have two loops at the bottom, where you could slide your legs into and sort of sit in.  It was a rush to do both swings, especially the 2nd one w/o the wooden plank, just make sure you hold on tight, don't trip on the roots or run into the tree when you are running back.\n\nIf you aren't down to swing the view at night is stunning, as the pic I uploaded shows :0)", "author": "Vincent-Arthur B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "I can't believe I was born and raised in SF and never knew about this place until recently! Absolutely breath taking with an entire view of the city, in the most peaceful neighborhoods ever. Today was also perfect weather but I highly recommend because of the coolest pictures! A little dangerous, so you better grip that swing unless you want to fall!", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Sweeping views! Can we start a campaign on kickstarter to replace the swing please? To the person that thrashed the swing off, you owe us all an apology and a new wooden swing seat.", "author": "Briget P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "This is a really cute park! It's super small but perfect for a scenic view of the whole city. Not 5 stars because the infamous swing was broken when I went there :(", "author": "Sophia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "I'm giving Billy Goat Hill 4 stars simply because the view of the city is beautiful, and the neighborhood is nice/friendly. however, the swing is NOT here :( I think I'm going to come back with some rope & a board & build my own next time", "author": "Brooke W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Pretty neat hidden spot which rewards you with a nice city view, minus the crowds and the parking issues of Twin Peaks!", "author": "Natz W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "Billy Goat HIll is a great place to go to check out a view of my favorite city in the world, San Francisco. You can get an awesome panoramic view while swinging around and feeling like a kid again. The city is literally at your feet. \n\nIt's pretty easy to get to and when I went around noon on a Tuesday, there was plenty of residential parking. Bring your camera when you come so you can get in those instagram/snapchat/fb pics!", "author": "Heesun L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "8/2/15 swing was cut down. \nViews were still incredible, definitely worth the drive. I wish we could have used the swing though :(", "author": "Adele T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "The view is amazing. The swing is fantastic! It's also a good place to go for a run. The only downside is the amount of garbage scattered throughout the hill (water bottles, beer bottles)", "author": "Maritza S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "Beautiful look out of the city. But I specifically came here for the swing since I've never Been here before and as of today 1/30/15 NO SWING =[", "author": "Sarra E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "excellent tourist spot if you're looking for a place that is not congested with tourists. It is located in a neighborhood so thankfully there are plenty of parking. \n\nI would not recommend coming here for the first time at night because it is pitch dark, plus there are sketchy cars filled with groups of men doing who knows what, and another man probably smoking weed behind a bush. \n\nBut despite that, I came here at night for the first time without no flashlight and thankfully we were able to easily find the hill and the swings. I think there is only 1 swing now, and it is perched on the slant of the hill. It is hard to get on this swing, but once you do you will find that it is hard to actually swing on it, but the view? definitely worth it. It is quiet, scenic, romantic, poetic. \n\n\nDefinitely a picture to be remembered.", "author": "Dixie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "I think the swing is gone? We went there around 11PM so maybe we didn't see it. But I definitely didn't see any swing-like figure anywhere. But it was still a good view.", "author": "Hina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "I love Billy Goat Hill! We came here while my sister was visiting from Irvine and I have to say the view from here is AMAZING! They have this swing by the tree which makes for great photo ops if you can get over the fear of falling. I have to admit I was a little scared at first because I'm not the swiftest on my feet. I managed to swing from it with the encouragement of my family and I'm glad I did! It was so fun and such a great experience. Definitely recommend this place if you're in the area.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "Ive visited \"the swing\" too many times, been going here since early 1990's, theres 1 person that always cuts it down because \"its not safe and it hurts the tree\"... Ohh stfu!! Its a childhood landmark for people that grew up in that part of the city. \n\nSince the 90's they added stairs coming in from Beacon st, it was foreal a goat hill were me & my friends scrubbed hella times. They added a fence, before you could sit on the edge and fall to a drunk concussion. \n\nThe rope gets replaced over and over, maybe 100 times since the 90's. I thought about putting a chain to replace rope, but drunk people would just hurt themselves...\n\nPoint is, GREAT PLACE TO CHILL AND SWING, i know i do..", "author": "Mono L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "Most important thing you might need: a windbreaker. I'm telling you now, this hill is super super windy even on a 70 degrees sunny afternoon according to the San Francisco weather reports. \nBesides this down, there's many many ups! The swing is replaced again supposedly. According to my friends, there was no swing but today, when I went with my squad, there was a swing hanging down from the tree. If you are up on this hill, definitely swing on this swing. You literally feel like your flying off this cliff, kinda scary but super fun! Don't worry, you won't fall off the cliff. I can assure you this because as I was sitting on the swing, I guess I was careless and thought I was secure already. However, when my friend pushed me to swing, I fell of the swing but was still somehow able to stay on the cliff! So you definitely would not fall of this cliff considering that I am a pretty big person. \nAn additionally plus to this hill is its magnificent view of the city. Oh so nice, so beautiful. From trees to houses to buildings to bridges to schools to churches to mountains, the view is drop dead gorgeous. Definitely recommend this destination for artsy pics!", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "Fell down the hill.... still worth it.", "author": "Chai S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "Great view and nice little hike. However someone either broke or stole the sit because it's a thick branch to sit on instead. Easy to get to, park on top of the hill it's a short walk to the \"swing\".", "author": "Nancy Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Too bad there's no more swing. What a kill joy! But anyhoo, the view is still spectacular! Just chill, sit by the fence & stare at the panoramic view of the city. WOW.", "author": "Arni D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-21", "description": "Every time my boyfriend and I go to SF we have talked about coming to this hill to take a picture on the swing. So this time we decieded to go an see it, and there was NO SWING! Sucks that someone had to ruin it for everyone else. But beautiful view! Would be great to watch the sunset or have a picnic.", "author": "Kelsey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "This place was pretty cool and it had an amazing view if SF. At first, it seemed pretty basic when it was just a swing, but once you get on and swing around, it's proficient.  It's literally on a hill so it seems dangerous, but the way the stairs, leading to the swing, we're made, it was not bad at all. You can take nice pictures here and they could potentially become your new Facebook profile pic. You will create long-lasting memories here. The place where you were Miley status and looked like you were coming in like a wreckingball.", "author": "Bryant D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "This is a cute little spot. The park itself is tiny. We opted to drive up to Beacon St and walk down the little dirt path and some serious stairs. You can do an urban hike to get there through the streets. I was surprised to see the area empty. We came at the perfect time. I was bummed to see that the swing was down. I guess we should have brought our own. The park may be small, but the views are really great.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "All views from the top in SF are gorgeous, but I do know there are much cooler ones than this one - the swing is gone too :( Still super cool to see different angles of the city!", "author": "Callan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "Billy Goat Hill was first on my list to visit when first moving to the Bay Area. \n\nIf you go on a clear day the scenery is AMAZING! The first time I went the ropes were still intact. It is definitely a risky situation when you first look at how the ropes are attached to the tree, but it is an experience I think everyone should try once in their life. \n\nThe temperature on the hill is a few degrees colder than the city, plus it is really windy up there. So, be sure to be a jacket. \n\nIt is a great place to hang out with friends, talk, and build memories. I highly recommend this place for first timers in SF.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "The swing was not up on a Saturday that I went there.  There was a car parked at the top filled with youth kids smelling like marijuana.  We didn't feel safe because they were screaming and yelling.  Nice view but I don't plan on coming back.", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "Amazing view !!! Came with a few friends and drove to the top. It was scary driving in such steep hills but well worth it when you get to the top. The swing was nice and new when we got here.   Highly recommend seeing the city from here if your visiting or if you want a break.", "author": "Tiffany B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-21", "description": "The secret is clearly out. I used to love this spot. Now it's just dirty, noisy and crowded. The views will always be awesome, but with all the folks coming here for swing selfies (when it's even there) the hill is so much less special.", "author": "Brendan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "true, this hill has a great viewpoint of the city but i would bet most people come here for the photo opp on the swing with the backdrop of the city. that's why iiii went anyway. i do beg the question \"who maintains the swing\" though. from the various photos i've seen the swing has come in different forms and when i went the rope was pretttttttty severed. nonetheless it was worth the risk of falling off the swing at it's furthest point out. actually, i DID fall off the swing but held onto the rope for dear life. i'm sure my audience was a little more afraid for their own turn following me. also, i sat on it backwards facing the hill so that my shot would be way more kick ass.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Incredible view of the city but one star taken off because they took out the swing. Regardless of the lack of swing the view is spectacular. You can see the skyline and the bay bridge as well as south of downtown. I understand that the residents around the area might be kind of frusturated with all the tourists coming for the swing so it makes sense that it was taken down. I will probably be back!", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Really enjoy eating here. Very quick delicious pizza. Pretty good location.. Streets are not too busy , you can usually find parking nearby. Always friendly employees bringing excellent customer service. Makes the experience that much better. Would definitely recommend :)", "author": "Vee G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-22", "description": "The rope swings have been all cut off in the last three days. Don't bother going until they are restored -- the nearby Twin Peaks have a much nicer city view.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "Great view of the city. We were able to find parking on the sidewalk luckily- not sure how crowded it can be since there's not much to do here from what I've seen. The swing was missing when I was there. Just came to say I've been here before since people talk about it but I'm pretty sure I wouldn't go here again since there's not much to do and there are other places with a view of the city.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-21", "description": "I'm a bit disappointed because I've been looking forward to visiting this city view. Come to find that the swing is no longer there :( on a good note, the view is beautiful.", "author": "Charlene B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "they cut the swing off :( great view of the city though! took us only around 10-15 mins to finish the tiny trail", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "This place means so much to me/us! I personally grew up down the street and used to go to this hill once a week just because of how quiet it is and how beautiful the views are. I brought my fiance(wife now) and we both have had some wonderful days there looking off at the peaceful view of the city. We loved it so much that we had a UNFORGETABLE wedding there. The only thing is it can be quiet cold on a regular so picking the perfect day to go up there or simply wearing a jacket to visit is needed lol such a small price to pay.", "author": "TheForeverFamily U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "Oh, San Francisco! You are always surprising me with places to admire your breathtaking views. I guarantee that most people come here because they have seen a picture on social media of someone swinging and hanging onto their dear lives on what seems like a very dangerous hill overlooking beautiful SF! I came here with my boyfriend, sister and family friend on a semi-foggy day and found parking right next to Billy Goat Hill. The staircase down wasn't too bad and according to my sister, the swing has been fixed from the last time she went. The swing was fun, but the views were absolutely beautiful, even on a semi-foggy day!", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "When my best friend and I came it was super windy and there was no rope seat like people put in their pictures :( So we didn't get the best pictures but we still did something daring and it has an incredible view of the city scape. I would recommend coming here in the morning or around the afternoon- night would be too spooky for me. And I would also suggest taking graduation or engagement photos here for those great puns that could be included in the photo ( aka \" taking that leap of faith\", etc)", "author": "Desiree C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "Great view of the city! Comes with a rope for you to hang yourself....but we just grabbed it and swung around! If you want to do this, I advise you to bring a pair of gloves because it really  hurts your hands. \n\nApparently there use to be a swing here...too bad it's not around anymore. But swinging on a rope and almost getting butt fucked on your way down by a big tree branch is also quite the thrill.", "author": "Allan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-01", "description": "Dont be a pussy, use the fence. This is how you do the rope swing:\n\nhttp://www.youtube.com/watch?v=xgsWUWRsCoU\n\nJust be careful, many injuries have occurred amongst my friends (including a broken collar bone).", "author": "Gray S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "PLEASE can someone put that infamous swing back up?? I really need that instagram photo! LOL. I mean who the heck are the haters who keeps cutting it down?!! If they don't feel it's safe then simply don't swing on it. I mean, are we going into their home and removing their donuts and ho-ho buns because it's making them fat? NO, we just turn one eye and ignore it. So leave us alone! Let us swing. We want to SWING damnit! lol. :(", "author": "Venus T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "This is a cool place to bring your friends, take pictures, and see the view! There are times when the chair at the end of the rope is either broken or missing so hopefully you go on a good day where someone makes one. You must take an obligatory picture seining on the swing if you get the chance!", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Very beautiful view.  Yes there is a swing.  Yes it is safe.  Yes it's fun  I could sit out there all day.  Climb the tree too!  I love this city", "author": "Kathie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-21", "description": "If you are a millennial, this place is for you. A lot of twenty-somethings hike up the streets to walk up the hill.  I've not seen a swing for a while, just some old ropes dangling from the branch, so I can't speak to that experience.  What's sad is the garbage the kids leave behind.  One of the neighbors who walked her dog told us that it's especially bad after weekends - alcohol bottles, beer cans and starbucks cups discarded everywhere and graffiti on the fence.  Not cool.  Sounds like the neighbors usually clean up during the week.  The views are great, but Bernal Hill is still my favorite open space in the city plus it's less crowded.", "author": "Stefan O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-09", "description": "Visisting SF? Great place for a relaxing and beautiful sunny day.\nThe rope swing used to be better, now its just scary; but Daredevils: knock yourselves out! \nLocation is perfect and view is spectacular, nestled between Glen Park, Noe Valley and Diamond Heights--sneak in a 6 pack but please don't litter.", "author": "Evelani Lei O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "we came when it was pouring, so the rope swing was pretty fucking scary.  the muddy walk down the stairs was frightening as well.  but all in all, the rain made the rope-swinging more exciting!  so, if you're looking for a little bit more adventure / danger, go when it rains!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-09", "description": "Good Lord this hill is fantastic!\n\nAdmittedly I was petrified of the rope swing and did not partake. It was mostly due to the fact that is was 7am and the city was blanketed in a stereotypical fog monster.", "author": "bo h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "There IS a swing (at least there was when I went on 5/31/2015). After taking a bunch of swing pics I realized it's best if you try to take a shot that doesn't include the ground underneath the swing...just looks better.", "author": "D R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-02", "description": "I grew up on this swing. Literally. I am 23 and lived for 18 years about a hundred yards from the bottom of the hill. Here is the scoop.\n\nYes there was a lower branch. And before that, there was one that was even lower. The swing was better, or at least safer and easier. To stop the rumor mill now, no one has ever died on the swing. A neighborhood kid broke his arm on the swing once. I myself have had the swing break on me, at which point I rolled the better part of the way down the hill. Great thing about being 12 is that you bounce back. One of my favorite views of the city is from BGH.\n\nGoing swing is now not for the faint of heart, and I'm not sure how much more dangerous the swing is, or if I am just getting old and lame, but it is definitely sketchball to the max. But the again that is what made it fun. \n\nFor those of you who were still reading this, I have to drop this in. See those stairs at the bottom. I built those. Or better yet, I helped build them as part of my eagle scout project. Yes, thats right, boy scouts do good things, even if the Boy Scouts of America is a homophobic, often right wing, Christian organization. Anyways, check the stairs out, they did not used to be there. \n\nGo, check out the stairs, go on the swing, drink a beer, scream and wake my parents and enjoy the view.", "author": "Morgan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "Four stars, not five, because you cannot see the Golden Gate Bridge and it's hard not to imagine the city bare, before there were buildings everywhere.  The hills and vistas of San Francisco can make one gasp in awe and wonder, but after years of living here, I just feel reflective.\n\nThis is a quiet hill.  It feels almost like you're somewhere in Marin; surrounded by million dollar homes on just a patch of undeveloped land, on purpose.  The bay area is full of beautiful spots, high and low, this can be the most beautiful spot in San Francisco if you are in the mood.  Tonight it was just OK as a resting spot after a jog and another Monday.", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-02", "description": "Billy Goat Hill, as the name implies, is a park that basically consists of a very steep hillside on the east side of Diamond Heights.  There is a single trail you can take from Beacon St all the way down to the 30th St cul-de-sac, and on the way you pass by a little outcropping with a pair of eucalyptus trees that would be a perfect spot to sit down with a book or picnic (and yes, I did notice a rope swing here, but if you let go at the wrong time it could be a long way down indeed).  There is a panoramic view of the east side of the city from downtown to Bernal Heights.  Now if only they would build a trail going uphill from Beacon St to Walter Haas Playground. \n\nIf you're in the area, another highlight to see is the beautiful Harry Stairway, a couple blocks south on Beacon.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-16", "description": "I also grew up on this hill. If you have a sentimental childhood attachment to it, it's the best place in the world. If not, a few pitfalls await:\n\nThe swing situation is catastrophic. The lower branch being gone, it's impossible to have a good swing and very easy to have a terrible, wind-knocking-out slide down the rocky hill. (Watch out for that piece of rebar jutting out!)\n\nAccess isn't great: It's not easy to get to the edge of the rocks for the view. (Plus, the full view is only visible from the edge of the rocks: Huge eucalyptus and the flat part at the top of the hill trees prevent a simple park-your-car-and-view option.) Stable shoes are the minimum. The sidewalk above is totally chewed up. \n\nThis is not the place for dogs. Broken glass has been a serious problem the past few years, and there are periodically sketchy items dumped there. (When I see spare couches, I think, \"Fleas!\") It's hard to see the whole hill from any one point, and Fido would not want to wander into traffic (sparse, but fast) on Beacon Street. Also, at night, there is the real risk of a dog getting stinkily sprayed by a skunk.\n\nThe hill is dry and dusty in the summer months. Winter brings overgrown vegetation and lots of mud. Not to mention that the valley sucks the wind right past you. Better have damn good balance while out there on the rocky outcropping. Because of the lack of cleansing rain in the summer, there is nothing to wash away the dog pee from the dogs that do venture there, and the hill often smells in certain parts.\n\nA lower part of the hill has been fenced off, and that wooden fence is covered with unsightly graffiti, visible from the main parts of the hill. \n\nThe tolerance of the neighborhood seems to have diminished in recent years. We never worried about making tons of noise in high school, but I've seen police roll by on both the upper and lower streets. Anyone downhill (especially when the wind is right) can hear absolutely everything being said on the rocky outcropping. I'd love the know the science behind it, but it seems that even a whisper is easily carried. Funny for passers-by, not so fun for rowdy people when the SFPD checks out the noise complaints. \n\nSo there you have it. I love Billy Goat Hill to death, but anyone without a serious emotional link to it should go to Bernal Hill for views and dog-friendly access, Corona Heights for more discrete hanging out, and Glen Canyon for more interesting vegetation and terrain.", "author": "Alexis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-24", "description": "I am so happy to see that there are already reviews of this place!\n\nWhen I lived in Noe Valley, this was my special place. A great location for resting midway through a hill-intensive run in the morning. Or a picnic. Or a swing session with someone you love.\n\nThere is usually a rope swing on the big tree near the top of the hill. I'm amazed no one has died using the thing... I've gotten a good twenty or thirty feet off the ground while swinging, which is exhilarating. And just the right amount of scary.\n\nCheck this place out day or night if you live anywhere near SF. You'll be hard-pressed to find a better and quieter view of the city. And you're pretty much guaranteed to be alone.\n\nOh and if someone removed the swing (the cops?), please do us all a favor and string up a new one.", "author": "Trey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-28", "description": "I love this place.  I heard rumors of a rope swing and had to check it out.  It's really not safe, but it's oh so much fun.  \n\nA few locals told us that there used to be a branch of the tree that hung out lower over the hill and the rope swing was so much longer.  The city cut it down because there were a few bad deaths on it, and they cut it up and gave it to the guy that made it as a trophy.  I would have loved to see this swing in it's hay day.  So much fun to hike up there and swing, still.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-08", "description": "An update for the summer -- the rope swing is back up, and it is definitely scary as ever.  I didn't go on it, but a few of my braver compainions did, and they screamed.\n\nA nice little neighborhood gem, quiet and tucked away.  Provides a nice view of the city, especially at night, and the swing. . .if you dare.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-08", "description": "So you can't see the Golden Gate, but that's not the only thing special in San Francisco. Billy Goat Hill is a place for serenity, with a large open hill, and lush field.  Like the Presido, or parts of Golden Gate Park, Billy Goat is a place that feels entirely separate and suburban, yet unlike the former parks, Billy Goat is a small spot in a neighborhood, which few tourists frequent. \n\nWhile in high school the rope swing used to be braved by some, now it stands cut and a memory. Nonetheless, a great spot to just lounge on a sunny day with a beer in a brown bag.\n\nSFCritic", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "Like scoundrels absconding with the tired, typical thrills that are a weekend night, we found this to be a passionate, salacious arena for our drive to publicly defile ourselves in this city.\n\nThis park was christened late on a clear, moonless night  The blades of grass crept up all around us and all I could see was the heaving tangle of hair below my enthralled, captivated eyes.\n\nThis city is full of these opportunities.... and it is up to you to create them.\n\nI enjoyed this evening to the core of my being.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-10", "description": "A note about the rope swing.\r\n\r\nEarlier in 2006: I've turned 23. My sister decides I need to do something I haven't done in a long time to celebrate such an unremarkable year. We go up to Billy Goat Hill, with our boyfriends in tow. We swing on said swing. Until... some nosy, over protective neighbor calls the police. At this point, my sister and I, simultaneously without premeditated thought scream, \"WE'RE ALL BROWN\" and the four of us commence to run down BGH and down some back streets, as though our lives depended on it. Party over. Irrational fears and buzz kill neighbors end the celebration.\r\n\r\n...\r\nIt was nice to have grown up down the street from this place. A secret view point to show all my college friends when they came visiting from the east. Nice place to walk your dog, and feel like you're a fly on the wall in this busy city. Very very great place to snap SF pictures for anyone in need of that sort of a souvenir.", "author": "Niki M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-23", "description": "The steep green of Billy Goat Hill offers a great vantage point of the City and across the Bay. As far as parks go, the view is about it since the steep grade of the hill is not conducive for safe kid's play or a dog run. Perhaps if you're into pipe smoking or drinking whiskey from a flask, you could better utilize the only existing flat space - a small outcrop of rock that juts from the hill like a worn tusk. There used to be a long rope swing from one of the few standing trees, but the rope has been worn away and severed. Though this is probably a good thing since a fall from that 25' rope would result in a world of hurt.", "author": "Be N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-12", "description": "This hill is just the perfect sort of slice of SF I like to share with others. The experience is unexpected, intimate, and subtle. Exactly what tourists miss when they're here.\n\nPlus it's about half a block from my house and my pal, Grennie likes it there.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "great views of the city from this quiet park. It can be a bit of a steep walk if you are coming from Noe. In terms of rope swings there were definitely a couple of sorry ropes tied to the tree but they looked kind of macabre and zero fun.\n\nAll in all a nice walk if you live in the hood.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-10", "description": "swing update: gone!!!\n\nas of june 10th, 2009\n\nstill a great view, though", "author": "Tyler b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-26", "description": "one of my favorite views of the city IN the city.  a great place to plop down and read a book while the dog tires herself out running up and down and back and forth across the hill.\n\nbeing quite accident prone, i've never tried the rope swing... it's a little farther off the ground than the one in bernal.  i'm quite sure i'd fly through the air and break both ankles!", "author": "hillary h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "Awesome tree swing. This is also on my SF tour list for when visitors come, but every time I've been to this park it's been great. The best have been clear nights, where you can see the oakland bridge, while swinging out over a steep hill.", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-25", "description": "This is such a staple of my teenage years its almost crazy. In fact, I just glanced over at a collage of photos that I put together representing my life from start to present, and yep, right in the middle is one of myself at age 14, pink hair, Live 105 tshirt, flipping the bird, sitting up on The Hill. Its the place we all went to when we didn't want to be at home with the 'rents. Its where we went when we needed to be as loud as possible because our teenage angst was just too much to be contained by 4 walls. We never got drunk up there, too young. We saved that debauchery for numerous other parks in the city but never took that to The Hill. It was almost like it was reserved only for after school wind downs when you had a shitty day. I haven't been there in years now, but I drive by at least once or twice every few weeks and always look up and see myself looking down 10 years ago, never thinking I would be driving one of the cars on Castro we used to throw rocks at.", "author": "Lou C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-12", "description": "8/10/2006 8pm - Billy Goat Swing found dead.\n\nhttp://www.billygoathill.org", "author": "Ryan O."}
