{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "It's tough to find real dives in The Marina/Russian Hill area but this one sure qualifies. Great service - was recently locked out of my house and got a pity shot of Jameson on the house.\n\nDecent amount of TVs, (relatively) inexpensive, and you can bring food in.\n\nRecently started taking credit cards.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "If you're in for affordable drinks and decent service, this is the place. A drink on an avg costs about 6-7 dollars and I guess that's an amazing option in a city like San Francisco.", "author": "Riya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "well, this review is a little out dated, but, I was in San Francisco about ten years ago and stayed at a hotel across the street.  I asked the desk clerk about the bar and he said it was very casual and I would enjoy it.  The name threw me off.  I have to say it was very enjoyable.  Laid back and comfortable.  Regulars in the place playing guitar and just having fun.  Why am I reviewing this ten years later, well I was watching tv and it reminded me of the place.  When I go back I will make it a point to go to this bar.", "author": "glenn s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Came into this place with my lady to have a drink. After meeting the bartender Steve who was very cool and sociable. We decided to stay and one beer turned into 4 and some shots. Great dive bar especially if your a Louisiana fan. Def recomend stopping by for a drink or two. Also it's really close to Lombard st. Thanks for the bag of dicks Steve!", "author": "Token M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Great bar to go to for the saints games! Cool people in a fun place. The bartenders are great. Don't come hungry because they don't serve food, but they were fine with us bringing something in. However they were giving out gumbo during the last saints game...", "author": "Lyndon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Bartenders are awesome. Best Moscow Mule in the Bay Area. Liz is a badass. I will be back. WHO DAT", "author": "Tim E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Amazing place! Try the white beer it is cool!\nAwesome and helpful staff.\nGood bartenders full of attitude but if you are nice they are too.", "author": "Louis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Dank but inviting, dark but fun. Incredible place. If you like nice bathrooms with all the sink knobs intact and door locks(men's room), don't come here. No one is snooty, everyone is cool. It seems to be intentional and I love it. Great place if u are happy to talk to strangers. Alone or in a group, it's all good. The staff is flamboyant and engaging.\n\nAlso, very specifically saints focused. So much so that you can drink Abita while checking out their signed memorabilia.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "Came here on the recommendation of a former local. This is a legit dive bar. Doesn't pretend to be anything it's not. Stiff drinks, reasonable prices, great bartender willing to strike up a conversation with anyone (that's Jackie I'm talking about)!", "author": "Dane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "If ya want an authentic \"bar\" experience, this is the place. Cold beer on tap and some really chill vibes make this a great place to unwind and leave the hectic life behind. Cheers!", "author": "Todd W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "I won't hold the fact that this spot is a Saints Bar against it.  But, since I have the opportunity, I would like to point out that the Saints are a bunch of cheating little ******* for deliberately targeting Brett Favre with cheap shots during the NFC Championship game.  Yep, they got busted, but they got to party with Mr. Lombardi.  Me, I got more heartbreak.  I've never seen a Saints game here, but I plan to come and talk all sorts of trash about my absolute least favorite team in the NFL.  The Saints were ridiculous cheaters in 2009/2010 - They should have lost their rings. \n\nThat's feels better.  Now, that one unfortunate fact aside, it's a cool bar.  I've got nothing against New Orleans itself.  There is a New Orleans theme to the decor here, but other than that it's hard to see much evidence in terms of the drinks, music, etc.  They do have one beer from Abita.  I'm primarily a beer drinker, and I'm not blown away with the tap list - they could use at least one higher ABV IPA beyond regular Lagunitas.  It's kind of a small bar and it's all in the one area - there's no quiet corner to hide.  The decor is pretty cool and they have a nice juke-box.  I've been impressed with the bartenders across the board - not because of any mixology prowess, they just seem like a cool group of people that help build the community of regulars that makes a bar more than just a place to grab a beer and watch sports.  That is what brings it up from a 3 to a 4.      \n\nThe location itself is also an asset.  You're in the confluence of the Cow Hollow, Marina, Russian Hill and Fisherman's Wharf.  Corner of Van Ness and Lombard.  As you are making your way from one district to the next, it's sort of at the crossroads.  It's opens reasonably earlier and stays open all the way until bar close.  There are a lot of motels/hotels very close, so you'll find this a reasonably friendly spot if you're visiting from elsewhere.  And, if you happen to be coming back, it's a good place for a \"final final\" before calling it a night.\n\n(Pro Tip:  Viking's Giant Subs is next door and they are open until 8:30pm - you're fine to bring in food if you'd like to grab a sandwich as you are enjoying your afternoon or early evening drink.)", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Definitely the place to go to watch football if you are a Saints fan. Literally felt like I was back in New Orleans when I came here to watch the Saints. Everyone in here had Saints gear on. They don't serve food, but are fine with you bringing in your own food. Someone even brought in Popeye's making it feel even more like New Orleans. On any other day it seems like it would just be a cool neighborhood bar to get some drinks in. Four stars instead of five because of the limited seating (although it would probably be enough if you weren't there during a game) and one of my beers was a tiny bit flat.", "author": "Alissa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "We chose this bar because we were looking for something a little divey with a good beer selection. We were underwhelmed with the beer selection.  The bartender was really friendly but we probably will not go back.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Dirty Liz is the best! Super friendly, and she introduced us to her signature drink, a Bag of Dicks (BOD). I'll be coming back for another Bag.", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Was here for SF walker stalker and after spending time at the pier and dinner figured we stop in for drinks before walking to our hotel. I admit with the name ones might question it but you'd be missing out on a bar that feels like a chill neighborhood bar where everyone just gets along. \n\nWe were first timers and we never felt out of place. The bartender was cool and nice and even suggested two drinks for my GF, she liked the milky way better than the other drink, let's just say it's called a bag of... :) TVs were on two games, a jukebox and just a fun chill vibe. If we stay close again we'll stop and you should too.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Love this dive bar! Friendly bartender and patrons, funky voodoo vibe, strong and reasonably priced drinks, and cool music!", "author": "Cindy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "Love dive bars, this is a good one\nGood drinks\nBut... I don't go to a New Orleans-style bar to listen to country music.", "author": "Gretchen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Fun, diver bar. Ask very pleasant staff. Left my bag there with my entire life in it and it was there the next day as the staff saved it. Amazing.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-10", "description": "Defiantly has a dive bar vibe \nI honestly wish they would up play the \"voodoo\" a little  more with drink specials or more Decor that didn't look just dirty old and upkept.\nWe received are drinks very quickly and we're pleased that they were all correctly made! (I hate a poorly made drink)  \nThe price point for the drinks were  somewhat pricy but what in sanfranscio isn't!  All in all not a bad place but no somewhere I would go out of my way for", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "I absolutely love this place. The bartender Alley was great!\nShe made us feel very welcome, so much that we spent another three nights there. Plus if you are a Saints fan this bar is the place to be Sunday's. Its absolutely crazy during a saints game.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Very chill vibe. There were a few locals there, including the bartender, who were very welcoming and shared a ton of recommendations for us during our stay in SF. We stayed right across the street so we ended up at the bar a few days in a row.", "author": "Ariel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-29", "description": "Came here on a Saturday night and it wasn't busy at all. We came during a Cal football game and seemed like everyone there was a Cal fan. It was pretty quiet even during the game and the bartender was even telling us it was okay to clap and yell when something good happened in the game.\n\nI've never been to New Orleans before but it seems like that's the team they were getting at here. They do take credit card here now which is obviously a good thing.\n\nOverall, this is a chill dive bar if you're looking for a quiet New Orleans feeling place.", "author": "Paul U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "If you are a New Orleans Saints fan this is the place to see the game with a bunch of like minded people. They have Abita Beer and the staff is fantastic!!! When it is the off season it is also a great place to have a drink and relax.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "First time in SF, our room was like two blocks from Lombard St. so location was the first reason. The outside look is what caught my attention when we walked by early in the afternoon. We decided to check it out at night, and after checking reviews it felt we were in the right place. New Orleans decoration inside, we get to meet great locals that gave us tips on what to do in the city. Ally the bartender was really nice and shared some good spots to visit while in the city. Ambience and vibes were great. Definitely a good local dive bar to check out when you are in San Francisco.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "The ambiance is amazing! Cute little spot to hang out. They are just a little bit on the smaller side but I loved the setting!", "author": "L C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "The perfect bar in SF for the true NOLA feel and catching the Saints game. All the authentic Saints fans come out for game day and never a dull moment. I love how in between commercials they play Jazz music, keeping the atmosphere super lively. Also all the regulars bring that good authentic NOLA cookin to share for all. \nWHERE Y'AT?", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "Nice spot and friendly staff. The place is really dark inside and can be a bit loud to talk to one another. It's completely New Orleans themed which is awesome. And they're open pretty late! Definitely a good spot to hit up.", "author": "Janice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Great place with an awesome vibe! Sarah was amazing! She answered any questions we had about the city and told us the best places to eat. I know great bartenders and she's a great bartender. When you come in here ask for a bag of dicks. Just saying.", "author": "Josh G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "Bartender so RUDE!!!!!! I was waiting for the restroom had never been here before so I knocked on the restroom door. She came out and said \"I'm out when I'm done\" (very rudely) I said that's fine I need to use the restroom as well.  SO RUDE AND UNPROFESSIONAL!! She should be fired!! I understand you need to use the restroom no need to be rude to a guest NOT KNOWING its one stall only. I will find out her name and post it. Totally unnecessary and unprofessional. Will not be returning.\n\nHer name is LIZ", "author": "Nicki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "What a great place to watch a Saints game! Friendly people, Abita on draft, Rebirth during breaks and free sandwiches, grits, muffaletta's and gumbo. A true New Orleans vibe. WHO DAT!", "author": "Thijs V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "We weren't here long, just stopped in for a drink before dinner. Short visit = short review:\n\n1 craft beer\n2 very strong cocktails\n\n$15\n\nSweet bartender. Friendly patrons. I would stop in here again for sure.", "author": "Randi B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "One of the workers here stole my backpack. He eventually gave it back, but I would expect that people put it in the lost and found rather than steal it.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "This place is definitely not your douchey meat market, the spot is super small, the bathrooms atrocious (peeing behind a tree is much cleaner).  But I love it. \n\nThe drinks are strong, the prices are good, the bartender (especially Liz) are great and you can either sit at the bar and be one of them or just sit in a corner in solitude and just people watch for hours.\n\nIt's the local dive bar where all the long-time local Marina crowd goes.", "author": "Edward M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "It's pretty small in here but the vibe is cool.  Drinks are a little pricey but not terrible. The main reason they got 5 starts from me is that the bartender acknowledged us as soon as we waked in even though she was very busy. Customer service is important!", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "I have been in a cab headed other places and passed by this place many times and have always wanted to stop in, simply because of the name of the bar, I finally had a chance to experience the Voodoo Lounge and had a great time. We went in around 3 or 4 PM on a Saturday and were the only ones there. Sarah-Alice was the bartender and she was a total sweetheart with a cute laugh, and made us feel welcome. After a while, quite a few regulars trickled in, ranging in age from about 30-80!, which was awesome. After ordering a gin drink, Sarah-Alice and I started talking about various gin concoctions, and she decided to hit up the next door market to get the ingredients to make a Ramos-Fizz! Talk about a fun, spontaneous bartender! My friends and I all agreed that although it isn't in our neighborhood, we will be returning to the Voodoo Lounge.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "A nice oasis  away from the tourist hordes down the hill at Fisherman's Wharf. Neo-dive bar with New Orleans vibe and decor, super-friendly locals who bent our ear about our hometown of Boston. Bartender Sarah was as helpful as could be, spending considerable time writing out a list of restaurants nearby we might like, complete with notes on what to order.\n\nTunes provided by bartender's smart phone; when I heard The Black Keys blast out of the sound system I knew I was in the right place as I sipped my locally-brewed Drake's 1500 Pale Ale.", "author": "Brett P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "Me and another local San Franciscan who lives in the neighborhood suggested we met at this friendly neighborhood bar for a couple of drinks. It's on the corner of Van Ness and Lombard St and is kind of a different type of bar. It's a bit small and has a interesting looking décor but when I noticed the New Orleans Saints banner and the little voodoo dolls hanging on the wall I figured it out. We got to chatting with some regulars there about Giants baseball and the old days. The bartender, maybe Liz, maybe Sarah, is very friendly and accommodating,.\nI liked the juke box also and found enough songs on it to last awhile.\nNice place to go for a drink and definitely not pretentious,", "author": "jack d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "We visited several times while in town and we were so impressed with how friendly our bartender was as well as the regulars. Thanks so much for the warm welcome and fun company!", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "Cash only places are hands down the best places you can usually find. This place is a New Orleans style dive bar less than a mile from Fisherman's Wharf. We stayed across the street and after checking all the most reviewed and highest rated bars we saw on Yelp only to be disappointed, we decided to check this place out. \n\nLiz the bartender was great. She was very personable and she knows how to pour a drink. This is my recommendation for all the visitors out there looking for a relaxed environment, good music and an affordable drink. I wouldn't bother with all those pretentious places that claim to make the best hand crafted cocktails. Those places are typically nice, but the bartenders in most bars we went too were rude and acted like they were going out of their way to answer any questions or take our order. Liz went above and beyond and shared the house specialties with us (including a Bag of Dicks and a Teabag)! She made our last night in SF really fun and made up for all the poor service and food/drinks we experienced around the city.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "This place was AWESOME! Great drinks, definitely must try the \"dicks in a bag!\" Sarah is a GREAT bartender! She knows when to say yes or no, knows when to watch out for the customers, and knows how to make the drinks just right. Brandon is a funny, good guy.. This crew is awesome to the core. For being out-of-towners, they made us feel at home. No pool tables there, but great music and a great atmosphere! Thanks for the good memories! Will definitely have to come back any time I come to San Francisco!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Get a bag of dicks! Actually, get four! Go to the potty before arriving, you don't want to use it lol. They accept voodoo dolls as donations, which I thought was really cute. The bartender said the voodoo dolls hanging above the bar were all actually made by customers, which I thought was neat :).", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-26", "description": "Sweet Bartender! I'm drinking one Drakes 1500 IPA and free tasted of Lagunitas IPA (local beer), loved the music (music comes from the bartender cellphones, whichs is great!) and the people, excelent to talk and watch some NBA game (now I'm watching NY Knicks vs Dallas Mavericks).\nNo one is eating, just drinking as a real bar deserves.\nIf you're in SF near Van Ness Ave I'm sure you need stop for an IPA!", "author": "Victor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "My boyfriend and I were in San Francisco on vacation. We were staying at a hotel down the street from Black Magic Voodoo Lounge and after reading the reviews we decided to go in for a drink. \n\nBest decision of our whole trip! First off the bartender, Liz, is the best! She is super friendly and just a great asset to the establishment. (If you visit, ask her to make you a 'Bag of Dicks' you won't be disappointed) We met two locals that visit the establishment as well and just had an amazing time! So much of an amazing time we closed the bar twice!!", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "Great Long Islands...\nCame across this bar while traveling to SF, had the best long islands in the Bay Area, juke box music was great, friendly locals...", "author": "Yolanda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Loved this place. We went there when it was me, my girlfriend and one other customer. The place is san francisco sized and the bartender, Sarah, was super nice and she suggested a beer that was cold and delicious. Yes it is small is size, but big where it counts ;) Will definitely go back when we are in town!", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Headed here after hitting up the black horse pub. It was a great bar and had very friendly staff. I also recall them playing some great 50's jams and i am all about the golden oldies.", "author": "Alyssa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Cozy neighborhood bar with a lively atmosphere. The bartender we met was awesome! Liz had great tips for our vacation: hot eats, epic sights, parking tips. She def rocked!! Drinks were fairly cheap yet well-crafted and enjoyable. We will be back mos def!", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Wow! We stayed nearby this place on vacation and saw some great reviews for this place and decided to stop in for one drink at 9pm. We ended having lots of drinks and staying until the bar closed. The bartender, Liz, was very cool and down to Earth. I had the \"Bag of Dicks\" signature drink which was delicious! My husband tried the Abita beers and liked them too. Mostly what was so great about this place was Liz. She talked to us, made us feel welcomed and definitely made us laugh. She's a great bartender! If we're ever in the area again - we will definitely come back!", "author": "Dawn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Cool atmosphere and perfect drinks. That's all you can ask for in a lounge. Brandon the bartender is off the hook. Personable and cool. I had a great time. Will be back the next time I'm in town.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "Well priced drinks. $15 for a Long Island and a whisky and coke whereas most places are $12 each.\n\nVery quaint fun place but no snacks so bring your own.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Loved this place! My boyfriend and I were staying down the street and stopped here for a few drinks before heading back to the hotel for the night. \n\nThis place is cash only and they have a lovely old register. There is an ATM for customers if you don't have cash. \n\nWe got to meet some of the locals including Ernie who is a crab fisherman and Fergus the Brave who is a charming Scottish terrier owned by another local whose name I have forgotten. (I love a place that is pet friendly!) \n\nI don't know if they have food here - I'm guessing not because I didn't see anyone eating. \n\nThis is a great place to grab a drink, play some Clash on the juke box and enjoy some local flavor away from the tourists.", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "The staff here is awful and rude. Too many other places in SF to go to settle for this treatment. Don't go here!!!", "author": "Heather D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "This is the kind of place we look for when we travel, the locals pub. After two nights of stupidly expensive cocktails we found this gem. Sure there's no \"elderflower\" cocktails here but they make a damn fine Long Island. Beer list is good. TV's playing sports, limited seating but we found a spot on Saturday night very easily. Let's hear it for $7.50 drinks that are a heavy handed pour!", "author": "Karlynn J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "Why 4 stars?  Because I assume those reading this are looking to get knocked on their ass.\n\n   ---   ---   ---\n\nI shouldn't rush to judgment, but I AM judging you...person who is currently reading this...and assuming you would really like a stiff drink right now.\n\nWell, let me tell you.  BMVL is your place.  I hope they go by their acronym and I didn't just confuse everyone.  It's probably pretty easy to confuse you tho, considering how drunk you probably are.\n\nI asked for a dark and stormy, I got a glass of dark rum.  It tasted pretty strong, but not extremely overwhelming.  Only semi-overwhelming.  I was pretty thoroughly buzzed up afterward.  I feel like I did not re-gain sobriety for several hours.  I guess that's why I usually just stick to beer.  I went through all kinds of phases, after this cocktail:\n\n-The ugh, this is nasty phase \n\n-The welp, I'm feeling good phase\n\n-The am I floating phase?\n\n-The perma-smiling phase\n\n-The is this light headed feeling ever going to go away phase?\n\n-The I would like to go to sleep right here, right now phase\n\nAnd finally...\n\n-The wow....I just realized I no longer feel like I am walking around in a 3x the legal dosage of Nyquil state - thank God that's over, I'm never drinking again phase\n\nObviously, it's hard to review a place when you were there for 15 minutes to have one drink and move on, but I had no complaints.  I could have done without wanting to be asleep while eating my delicious sushi from nearby Zushi Puzzle afterward...but maybe I should just man-up and be less of a lightweight.", "author": "Brett N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-10", "description": "It would have been an \"Eek! Methinks Not\" review but for the friendly bartender and customers.\n\nCame in here for a Friday night martini and asked for it extra dry. The bartender put in about a shot full of vermouth in my martini and then proceeded to dig out the olives from the jar with his fingers - right in front of me. I think that's a health code violation...?\n\nI rarely leave a drink un-drunk, but I think this is the second time in my life I think it warranted it. Still, if I was coming here for beer or shots, this would be the place to be as I love me a great dive bar with funky decor and great music.", "author": "Mi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "Great crowd. Great staff. Great venue. This place spot on has all of the things I love about a bar and I'm glad to have discovered it.\n\nCame here on a Sunday for the Niners/Saints game. I'm a fan of neither team, but I was going with a devout Saints fan and born-and-raised Louisianian, so we came here since this is where he watches most games. We arrived around an hour before gametime and the place was already packed with people, granted it is a pretty small spot.\n\nThe bartenders here were all fun and friendly, drinks were cheap and the place was teeming with fans. What made this place even more awesome behind all of that was the generous people here. Folks were coming through the door with multiple pans of food that they'd cooked at home to share with people at that bar, including the bartenders. A woman next to us offered some of her Jambalaya and it was pretty awesome, I must say. I thought this was pretty awesome since I've never seen that done in a bar that I've been to. New Orleans has some pretty awesome fans.\n\nAll in all. Extremely satisfied with my first time and even though I hate where the place is, I'll for sure be back.", "author": "Trav M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Loved! The bartender was great! Drinks were strong. Everything I wanted.", "author": "Alisa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-18", "description": "Cool bartender nice dive bar but is cash only and where you are drunk and you have to cross the street to get money from the next atm....", "author": "Saba P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-08", "description": "Its Jan 8th at 3:30pm. So far not looking too good. We were all watching the game and the numb nuts decided, without asking the patrons, to play music that he likes. Music that essentially sucks. Then he stops and looks at the game as if he is interested...which he didn't even glance at b4. He acts like he wishes no one was in here. The other regulars looked at each other like what the hell. They finished their drink and left. Probably be back when a different bartender is working. This guy has no social skills. Retrain or fire him cause he's costing you $.", "author": "Joe W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "Super fun and chill place. It has been a while since I was there last but thinking of returning to San Francisco and will definitely make another visit to this place. Check it out, it will be fun ^^", "author": "Rowan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-09", "description": "We came here on a Friday night after freezing our asses off at Off the Grid: Fort Mason for as long as we could handle it. I was not particularly excited about this place: It's close to a bunch of hostels, and more importantly it is in the Marina.\n\nI imagined people with triple popped collars and aviators doing lines in the bathroom and then trying to mack on the Romanian girls from the hotels down the street. Then at some point it would degenerate into an outright brawl and we would exit stage right and ride back to civilzation on our bikes.\n\nBut really it was quite the opposite: It was very quiet the whole night -- yet it was Friday! We got a couple drinks, watched the Giants pull a victory against the Rockies out of their ass, talked to the amazingly nice bartender Liz (who made me a Sazerac even though she hadn't made one herself before, usually the owners make it!)\n\nWay to ruin all my Marina stereotypes, geez.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Liz is the best bartender ever!!! She is so welcoming and makes the best drinks!!!Definitely the best bar In San Francisco!", "author": "Laura F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Here visiting from Philly and thank god our hotel is down the street from this gem.  Great juke box!  Great beers!  Great dive bar!!!", "author": "Keith T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "I visited this bar on a day trip to SF to visit my not-so-little-anymore cousin and her boyfriend, as they were on their one year anniversary trip in the city.  \n\nI asked the bartender for a common shooter here in Sacramento, and the bartender didn't know how to make it.  He was so nice and asked how, so I explained it to him.  I have met bartenders who don't give a f about new drinks, think are the bomb, blabidy blah blah.  But this guy ruled.\n\nHe even gave me some props for my sweet piggy back riding skills which came in handy when my little cousin was too hammered to walk to her hotel right across the street.\n\nI would recommend this place to anyone.  \n\nThere are only some things I would change, from a management standpoint.  This bar needs an atm, or the ability to use credit cards.  It's a strictly cash bar.  They should also check their facilities more often.  There was no tp, no hand soap, and no lock on the dudes door ... I saw more than one ass that night going to the ladies room.  But that's about it.  =]", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "nice place to hang out with a couple of people. the place is pretty small, dark, and has a few decent beers which is what dive bars are all about. I liked the music selection.", "author": "Nathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "If you're looking for a comfortable neighborhood bar, this comes highly recommended.  The place is neither a \"lounge\" (as promised in the name) nor a dive bar (as some reviewers claim.)  \n\nThe bartender was very friendly, mixed excellent drinks and made recommendations for nearby places to eat.  The crowd was cordial and in a good mood.   Nice place to visit when you're in the neighborhood.", "author": "Augie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "Rad little alternative bar. Visiting from Melbourne, Australia and felt right at home. Juke box in the corner, and the longer we stayed the stronger the drinks got. Really nice staff! I've seen some 'cash only' reviews, but they're accepting credit cards now.", "author": "Carly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "Strong drinks, broken ATM, surly self-righteous bartenders, no food and tiny space - it's a little of the Mission in the Marina! \n\nCome on down!", "author": "Raina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-09", "description": "Small and gets pretty crowded on a weekend night. Not sure what to make of the decor, but bartender was nice / friendly. Good place to chat, but you'll be standing most of the time because of limited seating. And the little seating there is, most people just put their coats there. \n\nDrinks are okay-priced. They have specials at night as well.\nCrowd is 30's to 40's.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "Voodoo lounge is so hard to define. It's so random it fits no category. It's a neighborhood hangout (in other words, it attracts bar flies). But due to the large hotel across the street, a few tourists tend to wander in (by accident I assume or horror-movie-like curiosity). And on football days, it overflows (I'm not kidding) with Saints fans. There are nights where you could hear a pin drop (that is, if the TVs / jukebox weren't blaring). And then other nights, it's packed tight; you'd better be comfortable from \"accidental\" fondlings from random strangers. \n\nBut come in anyway, it's a'ight.", "author": "Jen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Great spot with limited but excellent selection of local beers. We had great conversations with the locals and tourists that came through. The bartender was very friendly - not only did she let us sample many of the beers on draft  but she also recommended things to check out during our stay in San Fran.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-08", "description": "Good place to go if your hotel is across the street and you like strong drinks, the smell of urine, and the only bartender is hanging out outside instead of bar tending. Don't know why this place has such good reviews!", "author": "Jose H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-24", "description": "The bartender is an a-hole. First words out of his mouth as we entered the door: \"HEY PICK UP THOSE GLASSES FROM THAT TABLE. I JUST FIRED MY COCKTAIL WAITRESS!!!\"\n\nUm.. yeah. Way to go, sir. We'll be avoiding your bar from now on.", "author": "Tatyana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "Despite the many raves about heavy handed pours, such was not my experience. The drinks were not weak sauce, for sure, but neither were they haymakers. (This does not make me a lush: I watched the bartender pour the drinks.) The beers were either large, or just in glasses that made them look large, which for practical purposes is basically the same thing. \n\nThe bar, however, is small. It literally is a corner spot. They have DJ events here, but it is hard to dance if the attendance is reasonable. It might be a fun spot to watch a game since it's not really possible to sit too far away from one of the TV screens.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-30", "description": "I showed up last week and wanted to break a five dollar bill into singles, and the bartender was so amazingly rude I couldn't believe my eyes. She sent me this disgusting scowl and basically told me to go fuck myself and die slowly--the place was nearly empty and I've spent cash there at least a dozen times!\n\nThen I was standing outside the window and looked back inside, and the other bartender told me to get lost! I'll never spend another dollar here, will make a complete mess of the bathroom until the end of time, and hope you do the same.", "author": "B B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Love this Saints bar.  Nicki M. is a horrible person.  What a self titled moron. I witnessed the whole interaction between Nicki and liz. I hope I never see this idiot again.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-12", "description": "I visited from New Orleans and used Yelp to help me find a place to catch the Saints game. Best decision ever. \n\nThere are bars in NOLA that don't get this crazy for games. The bartenders are dancing and playing classic NOLA rock while dishing out cheap drinks. A small bar but plenty of standing room to catch the game.\n\nDon't drink and drive, its three blocks from the infamous Lombard St. curves!", "author": "Nick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-07", "description": "There really should be two sections of reviews here. One for people who come during normal hours, and another for coming during a New Orleans Saints' game. This is THE spot to be whenever the Saints are playing. Gets super packed but everyone is friendly and donning black and gold.\n\nWHO DAT!", "author": "Julian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "Love this place for the Saints games, and it reminds me of why I love living in New Orleans.\n\nI also stopped in on a quiet Friday night, and there is a good vibe going, even without blasting Get Crunk during halftime games.  \n\nReally, the antidote to the Marina blues.", "author": "Steve F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "If you need a place to watch the Saints on game day with Saints fans, this is the place to be in San Francisco. Good bloody Mary's (green beans and pearl onions) and Abita on tap, Saints on every T.V., with the volume up and Rebitrth during the commercials. Cash only and no food, but restaurants all around, and they don't mind if you bring it in from the outside. Saints jerseys are the uniform of the day, and everybody is just another New Orleanian here. Where yat?", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "I'm originally from New Orleans and go to this bar every Sunday for the Saints games.  It's amazing and I'm more than willing to pay the $15 dollar taxi from my place to get here at 10am on a Sunday with less than 6 hours of sleep to hang out with my NOLA friends, drink some reasonably priced (i.e., cheap) beer, and meet new people.\n\nThe bartenders are amazing.  We're all friends in this place, and there's nothing bad I can think of about this bar.", "author": "Steve W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-31", "description": "Cash only bar. It is exactly that, 1 small bar a good choice of beers on tap and booze. Pay your bartender and tip them well, get a good drink and relax. Tv with sports on and an ATM. \n\nLots of cool New Orleans style decor and right on the corner of Lombard. Everyone that seems to come to this place is super friendly and willing to strike up a conversation. The bartenders help you decide on a good drink and might even suggest a good place for dinner.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "Big fan.  I live a few blocks away so I've been meaning to check this place out for awhile.  I finally got my opportunity last night.  It's decidedly unpretentious -- there are voodoo dolls hanging from the ceiling over the bar -- and they've got a great jukebox and down to earth, easy-going bartenders.   Plus I love that they carry cheap Abita bottles (since it's a New Orleans bar).  What more could you ask for?  Food?  Well if you're hungry, head next door to Viking's Giant Subs and get the Mighty Viking.  You can thank me later.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-27", "description": "Randomly stopped in here last Thursday night while on vacation in San Francisco. I spotted it on the way back to my hotel across the street, and figured I'd stop in for a drink. I had a blast! Everyone was very friendly (despite my Redwings loyalties), conversation was great, and I really felt welcome in this laid back, cool spot. It is exactly the type of bar I frequent here in Chicago, and couldn't have asked for a more solid group of people. Awesome start to what turned out to be a fantastic vacation.", "author": "Cory C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-14", "description": "Absolutely the nicest barkeeps I've ever met. \n\nWe mistakenly wandered over from our hostel thinking they might have food. The lady behind the counter laughed when we asked if their kitchen was still open saying all they've got to eat is peanuts and pretzels. \n\nShe then turned around, poked through a drawer (swaying her hips to the music the whole time), and pulled out menus for all of the local eateries that were still open. With each one she emphasized what her favorite menu items were and the best things to get on them. She then said we could bring whatever we got there and eat at one of the tables. \n\nA 30 minute walk to get take-out and back and we're eating our Philly cheeses and downing them with ice cold beers and ciders. Seriously, that's some great San Francisco eating. \n\nSince coming back, there was a changing-of-the-bartenders and the guy who replaced the previous lady was just as cool. \n\nThere weren't a ton of people there on a Sunday night, just a handful of regulars. The decor could probably be compared to Alex's Bar in Long Beach (used for the bar in \"True Blood\" apparently). I mean, it's not crazy or anything, but the place has character.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-21", "description": "You can take the boy out of the South, but you can't take the South out of the boy. \n\nThat being said, I must say that I enjoy this bar, even if it isn't really \"New Orleans.\"  It's got some cute kitsch from Mardi Gras past, some clever devices to make you feel a step closer to Louisiana.  And, yes, lots of references to the Saints.\n\nBut, no, it ain't a genuine Southern bar.  And that's okay.\n\nWith that said ... I wish the Abita beer was on tap, rather than in bottles.   \n\nThe staff is quite nice.  The prices are just right.  I enjoy going here when I'm over near Ft. Mason or the Wharf area.  It makes for a great get-away when you just want a beer and not a lot of foof or noise.", "author": "Joe W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "Laid back atmosphere, a few local San Francisco brews.  More than a few Abita bottles.  Close to my hotel & I will indeed be back but not to that hotel... Whole other story there!  Drinks were cheap. Bartender Clay was awesome! I repeat, I will be back.", "author": "Jeffrey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Just the place to be with other New Orleanian's who are living here in S.F.!!!\n\nYa'll come out and see our boys head for the Super Bowl.\n\nGreat place to be for any Saints game.  See ya'll there!\n\nNolasusan", "author": "WitchesKnowBest O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "Awesome find during our vacation!  The bar was chill and reminded me of the local spots we hang out at back home.  If you're looking for a laid back spot with good drinks and craft beer this is the place to go!  Clay was our bartender and he was awesome,  we will definitely be back next time we're in town!!", "author": "Daina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-19", "description": "I must preface that this is in my neighborhood, and that I frequent there more than I should.  However, I don't break the bank going here.....\n\n-Very Reasonable Drink Prices\n-Friendly Bartenders\n-Neighborhood Feel, but welcoming to all\n-Yes, you can smoke\n-Friendly Locals - friends in and out of the bar, talks with everyone, great direction givers\n-Open Mic on every other Sunday\n-Dudes and Chicks with Dogs (only when its not busy though, there has to be room for the drinkers)\n-A few \"crusty\" old usuals, but they only look crusty (however very friendly)\n-Great Jukebox and some of the bartenders bring their iPods and hook them up to the sound system\n-Great Owners - Joe fed the bar corned beef and cabbage for St. Patrick's Day\n\nAs they say, you always come home....to the Black Magic.  Every one of my friends (smokers and non-smokers) have loved the place.\n\nP.S.  The smoking lamp has been turned off.  A sad, sad day........", "author": "Spencer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-09", "description": "Hands down the best place to be following a Saints Superbowl win!\n...um except at the Superbowl\n...or... um in New Orleans\nOK, hands own the best place in San Francisco to be following a Saints victory.\n\nDo you know what it means to miss New Orleans?\nWhen you need a little Nola fix and hopping on the next flight out of town just isn't an option, do the next best thing: head over to Black Magic Voodoo Lounge,  order an Abita amber, make friends with the super cool owners and shake your ass a little to Rebirth on the jukebox. \nIt's not New Orleans, but hands down the next best thing.....in San Francisco", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "A great place to go get drunk with friends....BUT~ beware of the loud, obnoxious people that can't handle their liquor and who have to SCREAM every sentence....they tend to be here during Union Street Festival.\n\nAlso, there is a wonderful assortment of classic rock and such on the Juke Box...except it tends to skip the songs you paid for, but whatever. Just go grab some Absinthe, and you'll be all better!\n\nThe bathrooms were a bit icky when I was there, but this is a giant city, so I'm starting to get used to pee on the toilet seats at EVERY bar. Seriously ladies, if you have to squat to pee, F%$#ing wipe up the seat after yourselves! Were you raised in a barn?!", "author": "adrienne l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-10", "description": "Best bar in the neghborhood, hands down. \n\nThey got nice big flat screens for football season, but goddamn, they were great during the series and all that which lead up to it too.\n\nShould have left this review a million years ago, but honestly, I don't believe in Yelp. They're more or less the small business gestapo.\n\nFor you, Joe, putting in my five stars worth, from your most loyal Raina.", "author": "Raina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "I like this place. but what was up with those old Australian guys the other night talking to our group?\n\nIt's in the hood and is comfortable and cool. I also like the whole Voodoo theme.", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "I'm from New Orleans so this place is perfect for me. the only drawback is that it is very small and it gets very crowded... Last game I watched peole were standing outside to watch it but it didn't matter because the atmosphere was awesome. Great bartenders ok priced drinks. Fun environment is what made me give this place 5 stars... Now if only they can get a bigger spot.", "author": "Davarieus F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-29", "description": "Whatever bartender guy \"that has worked there forever\" was a total jerk. We were staying in the hotel near this bar and went in for a cocktail and he wouldn't even look at us. Tried to order 2 different beers and he said they were out, once my boyfriend decided on his third choice he came back and told us to choose again because the keg was out. When I tried to order my drink he told me they were out of diet coke. Wasn't sure if he didn't like us because we weren't from San Francisco or if he just needed a bar back.", "author": "Ali M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-25", "description": "This place must have put some voodoo on me because it's now my favorite neighborhood dive bar. I've never once been disappointed with the service or the beer selection. \n\nIt was here that I learned how many fernet shots would push me over the edge. I also had absinthe here for the first time. Perhaps this is less of a bar for me...and more like a school.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-29", "description": "Great little bar! It's relaxing and the staff are really nice. I went on a Wednesday night and it was't busy which was nice. We were able accommodate for about 10-12 people. \n\nNote as of October 29, 2010, the ATM is broken and they only take Cash", "author": "Eric A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "Took over this bar for a birthday celebration on Saturday. The bartender was incredibly courteous even though she had to call in another bartender to handle our crowd. I hope we weren't too much of a handful and thanks again for the hospitality!", "author": "Bennett C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Geaux Saints!\n\nDecent Abita selection (Amber, Turbo Dog, Jockamo IPA)\n\nGood Hurricanes as well.\n\nWho Dat!!!", "author": "Greg C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-17", "description": "Very different than any of the other bars in the area. It's a small place and very low key. You don't have to worry about looking all \"corporate\" if you don't want to. Not as expensive as the other bars either. I've only been here once and the crowd was lively and dancing it up on the dance floor.", "author": "Rashid M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "love love love this place. THEY ARE GREAT PEOPLE AND THE SERVICE IS IMPECCABLE . NO JUDGMENTS WITH THEIR CUSTOMERS", "author": "B H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-23", "description": "How many years have I passed by this place and never popped in. Various events led me to the Voodoo Lounge this weekend and I'm glad that it did. Good drinks, chill vibe. I look forward to more visits.", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-24", "description": "A great bar.  That's what it is.  Beers are big and drinks are strong...a bar from the old age of real drinking.  If you are looking for a designer cocktail, this will not be your place.  If you are looking for a shot and a beer, you have come home and it won't cost you a lot of cash.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "I stumbled upon this place will visitng s.f. for my birthday and I had a blast. The bartender Liz was great. I enjoyed my favorite drink and was entertained as well. The bar is small inside but great atmosphere. I would definitely recommend as well return..", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-28", "description": "I had a beer and walked home as I was a bit intoxicated. As for the venue, it was pretty dark inside and loud. Since it's walking distance from my SF hotel [a.k.a. family's apt, hehe], I would give this place a try.", "author": "Suefow S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-20", "description": "If you are a New Orleans Saints fan, this is the bar for you!  The beer selection is great, but it get's a little crowded.  The bartenders are super nice and although appearing a little dive-y from the outside, it has a nice overall feel inside.", "author": "Bryson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "Fun small little joint!\n\nI seriously wish I lived right by this place :D\n\nVery cool very fun very obliging crowd - and wonderful bartendresses!", "author": "Aim E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "It was a cool spot I happened to pass by on my stay in the city, i went in with a friend. Service was very good, and friendly. The atmosphere is a bit odd at first but you get used to it quick. Drinks are priced fairly.", "author": "George G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-20", "description": "This place reminds me a lot of Latin American Club in the mission. Picture stuff objects hanging from the ceiling and a funky vibe. If you want something with a quirky twist, this is a good place to go. Only negative is that there's a jute box in the bar. Now..while one would think this is a positive, in the hands of the wrong person it can do more harm than good. We had a drunk country bumpkin monopolizing it for most of the night which led to me drinking my Vodka Tonic to the tunes of Hank Williams. I thought about yelling, 'Rodeo!!' outside and watching her run out looking for one but the better part of me refrained. \n \nOverall I'd say this place has a pinch of 'WTF?' that, once in a while, is fun to indulge in.", "author": "Shreya C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "New Orleans Saints bar in San Francisco, great times!  Best place in the city to watch football, can get a little packed during Saints games, but the atmosphere is great.  Being from the New Orleans area this is as close to being on Bourbon street during a Saints game as you can get.  Look forward to returning to watch more games!  Top Notch Bar!  Extra star for having Abita beer!", "author": "John F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "The drinks are inexpensive and I haven't found a place outside of NOLA where I can drink Abita while listening to Galactic, Rebirth or Johnny Sketch & the Dirty Notes while watching the Saints triumph on several TVs. Everyone is super friendly and ready for some Who Dat nation domination on Sunday afternoons.", "author": "Kristina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-14", "description": "I can't believe I lived here for over 6 years, and this season found out that this was the Saints bar to hangout at on gameday. A travesty. The bar has $3 Abitas, food from Cajun Pacific, and the Meters playing over commercial breaks. Saints fans, this is the place to be!\n\nNever been here on non-game days, but I'd imagine it's slow.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-07", "description": "Well, OK, jIM j.has a good imagination! \n\nI just came from there a short while ago. I stopped in when I was trying to go to the (closed) Mercury Appetizer Bar. Thursday, cocktail hour (6 pm). \n\nThurs cocktail is not a good representation overall, no doubt. \n\nThere was a pre-season football (Saints vs Cardinals). Clearly, \"we\" are for the Saints in the Black Magic Voodoo Lounge. There weren't many other customers, most were tuned into the game. \n\nI wouldn't bother to go back at cocktail hour. It's probably better at night.", "author": "Java G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-07", "description": "This bar is a true gem within the Marina. It is an authentic Louisianan bar (which sells Abida Beer and the best Bloody Marys) that tries to spread their southern love by keeping their drinks high quality and their prices low ($4.00 for an authentic southern spicy Bloody Mary). :)\n\nThe ambiance is also great. Most of the patrons, especially during Saints Sundays, have connections to or are originally from Louisiana. This gives the bar a unique feel, almost like you have traveled into New Orleans.   \n\nHowever, the thing that surprised me the most was the friendliness of the crowd and the bartenders. The bartenders go out of their way to make your drink exactly how you like it. They will personally deliver the drink to your table if they believe that they will take too long to make it.  Also, on a more personal note, we were getting a little hungry so we asked the bartender where there was a good pizza place nearby. He recommended a place that delivered, he then ordered the food for us, gave us paper plates and napkins, and then periodically checked on us to see if we were enjoying the food. I have never seen a bartender make such an effort to make their customers feel as comfortable as possible.   \n\nThus, if you are looking to experience Louisianan culture/friendliness at its finest, then I would highly recommend that you check this bar out (especially during a Saints game).", "author": "Scott E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "This is a Solid bar. The scene is lively and the music is a great blend of funk, soul, R&B, which provides for a festive atmosphere! Check em out if you're in the hood!", "author": "Crissy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-05", "description": "I was really happy with the Black Magic Voodoo Lounge. I had my birthday party here in mid April - and I couldn't get over the fact that there was such a great dive nestled in the Marina.\n\nThe club was great... especially with the old world New Orleans vibe. It was the perfect venue to accommodate my Black Magic Voodoo Vixen theme. I was at first worried about the size of the club. But they had a great seating arrangement against the wall, so we all fit in perfectly!\n\n The bartender was very friendly, and he knew exactly what he was doing when it came to a good NOLA Hurricane and Sazarac. They had a Kubler Absinthe Fountain, and I was served Absinthe the traditional way, with not sugar cube muss and fuss. \n\nOverall I had a really great experience with the Black Magic Voodoo Lounge. Affordable brew, a great NOLA vibe, and Absinthe done just right. I would definitely pop back in for NOLA time soon!", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "Quickly becoming my favorite local dive bar.  I always feel at home here, whether I show up to talk with a buddy or bring 20 after-partiers from my Peace Corps non-profit holiday party.\n\nSolid drinks.  Solid service.  Half a block from home.  (Grin).", "author": "Scott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "We were staying down the street and decided to check this out on our walk back from the MUNI stop.  Divey, but the bartender was really nice.  She recommended her drink of the night...basil martini...which she made from the basil plant on the bar and actually asked what kind of vodka we preferred.  Had a beer for our second drink and accidentally poured me the large instead of the small, but realized her mistake and only charged me the small(fair considering I didn't actually finish the large).  Ask for Liz!", "author": "Katie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-28", "description": "This a really good \"let's get a drink\" bar.  It's simple, straightforward, and never a scene.  The Black Magic has Molson on tap, and Pabst; that should tell you a lot about its vibe.  Every time I've been here there was available seating at the bar or at one of the tables.  Excellent jukebox.\n\nThe bar staff usually has some sporting event on the TV, but neither the tube nor the music overpowers the room.  You can converse without straining yourself regardless of the media.  That can be rare in the Marina.\n\nThis is also one of a handful of bars where people occasionally smoke inside and nobody seems to care.  It makes this place seem like a throwback to a different time, which adds to its relaxing feel.", "author": "John E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "If you are leaving the city headed for the Golden Gate this lounge is on your path.  Great for a nightcap before a safe drive home to Marin.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-21", "description": "'Jam Session' -  That's what brought me to The Black Magic Voodoo Lounge one Sunday evening. \r\n\r\nWell, it turned out to be an open mic night but  that didn't really matter to me since I don't really play an instrument and my singing causes small children to cry. I was just tagging along with my friend (for moral support) who became the fourth 'Black Magic Virgin' of the evening. \r\n\r\nThe bar is small with its regulars but everyone is really friendly contributing to a laid-back atmosphere which I really enjoyed.\r\n\r\nThey don't serve food but have several menus from nearby restaurants form which you can order in while you listen to both originals and covers performed by the local talent. \r\n\r\nOpen mic nights are every other Sunday. Details are usually posted on Craigslist.", "author": "shari d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "The New Year's Day \"pajama party\" is hilarious!!  Haven't been for several years, but drove by New Year's Day (literally), and saw a few folks out front in their PJ's!", "author": "Andy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Awesome neighborhood bar.  Opens later than Yelp says, but worth the wait.  Drinks are cold, and the day bartender was fun, and friendly.  Very relaxing with good music on the jukebox.  You can relax on a bench in front and watch traffic and tourists go by so be ready to people watch.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "It was recommended to us by one of our tour guides.  This place was a blast!  Its a small place and it gets crowded.  It definitely is a place where the locals go, everyone was very friendly and welcoming.  Our bartender Brandon was great! He was super friendly and even though it was crowded he always made sure we had a drink In hand.  If your looking for a laid back, low key bar to go to I would definitely recommend this place.", "author": "Elza F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-09", "description": "This place blows cuz there's no indoor smoking. Thanks a lot to you intolerant yelpers who blew the whistle on this once cool joint.\n\nok, just kidding. This is a nice mellow little bar decorated in low-key voodoo trinkets much too tasteful to be literally NO's style. There's a huge sign that declares sadly \"Sorry, no smoking indoors.\"\n\nThe drinks were cheap, service kind, noise level bearable. All around decent, but not the hidden smokers den that the old reviews make it out to be. We were disappointed, so we moved on to the authentic foulness that isn't illegal in the Marina: paul bunyan sized beer bellies, fake boobies, serious fashion faux pas and generally rude, ugly fugliness. \n\nKeep reading the list, it gets better or worse depending on your orientation.", "author": "G Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "A  friend and I were looking for the last drink of the night (or morning) that was close to our hotel (Comfort Inn-cnr of Lombard and VanNess.  The Voodoo Lounge was across the street so we walked in.  It was just what we were looking for.  The music was great.  There were a few locals at the tables and bar.  Liz was behind the bar and made us feel at home. There is not much around here but hotels.  The Black Magic Voodoo Lounge is the place.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "My Ole stomping ground. I love the friendly atmosphere of the BMVL! The regulars are a blast to converse with and the drink prices are very reasonable. The open mic. night features some great local talent that are always jubilant, and of course they have Tom Waits in the Jukebox, which is a major plus for me! Of course it always seems like the foreign hostel travelers end up at the BMVL and are always a great conversation. Where else are you going to run into the New Zealand Kiwi rowing team and another night country line dance with a mother and daughter duo from Germany!? Fun, bizarre, and certainly always something different!", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "It's not big, it's not utterly remarkable, but it's the best Saints bar in San Francisco. Black Magic has a full selection of Abita beers. If you're homesick for NOLA, or the South in general, the Voodoo Lounge is a good place to charge up your roots.", "author": "Blake R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-09", "description": "Ultimate dive bar.  Cash only.  Jukebox.  The occasional passed-out person on the floor or bar itself.", "author": "Princess L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-01", "description": "This has become one of my more regular spots in this neighborhood these days.  All the bartenders are great - and Liz is awesome (ask for a Milky Way).  It is very much a low-key neighborhood bar.  Every time I come here, I meet new people and have interesting conversations.  My drinks are always good, and the music can be just what you want to hear.  This is a place where you can/will get very very very drunk, without you really knowing it......and not just because the drinks are affordable, but because the places speaks that language to you.  You know what I'm saying.  It's kind of a long walk to Grubstake from here if you need to eat late to ease your drunkenness, but it may help you walk some of it off as well.", "author": "N F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-26", "description": "Kind of in love with this place, even before I found out it was a Saints bar.  Geaux Saints!  Plush yet funky decor, totally random crowd, good location (convenient yet somehow tucked away.)  Bartender was very cool - she even had her adorable mom tucked away at the bar.  Solid drinks, nice atmosphere, can't ask for more.", "author": "Jaimie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "Truly what I'd imagine an old school SF bar to be like, nothing fancy or frilly, but character in spades. The interior gives a fair match to the name--all black inside, and a rather tiny space. A friend had a pre-birthday dinner cocktail hour here, and indeed, he did imbibe of the libations here. Another friend chose an Anchor Steam(tm), a locally brewed beer, and yet another had a screwdriver. At first, I had wanted a hot toddy, but the friendly bartender regretted she lacked the appropriate liquors for this. So I settled on a greyhound. Really great service, very chill place. Cash only.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "Great dive bar.  It's location is amusing too because of all of the non-dive people that live in the area.  Cheap drinks and ABITA beer.  Not a lot of places service Abita, so I am totally a frequent flyer of this joint.  Leave the attitudes at home though.  This place is known to kick people out for being Marina douche bags.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-01", "description": "This is the marina? Really? But this is a totally comfortable dive... I guess such anomalies exist. Anyway, this is totally my kind of place. Not fancy at all, funky art hanging here and there, and a pretty decent DJ on a thursday night that isn't spinning house or techno, but funk. Thank god someone knows how to break out of the norm for a change.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "Hit or miss!  You can almost always count on a random crew at the Black Magic Voodoo Lounge.  The bar is close to a bunch of tourist hotels so you never know who'll you'll get but most all the folks I've meet there are decent folks.  The bartender is cool (can't think of his name) and the tall beer is just right.  I'll end up there at the end of the night for the final final with a friend or two to get a round of liars dice in before ordering a cheap crappy delivery pizza.", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-13", "description": "Its a bird, Its a plane, its not Superman, its FRANK effin GORE running over your crappy team Biotches!!!!!!  When the Niners win tomorrow, I'll be the guy eating crawfish and gumbo with my Speakeasy Big Daddy at the Black Magic Voodo Lounge laughing at Mr. Frachebois.  NINERS!!!!!!!!!", "author": "Sina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "Any bar you can hit on a weeknight and make friends with the bartneders, tourists, and locals all at once is a keeper in my book. Try the sweet tea vodka!", "author": "Monika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-06", "description": "great bar in a bland neighborhood.  great selection of beer and booze. fantastic jukebox. friendly barstaff.\r\n\r\nthis place is always fun, because you've generally got a good mix of folk in the bar - some regulars who have been sitting at the bar longer than norm and cliff, plus some younger people filling out the rest of the place. so, you can either drown in your whisky with the regulars, or whoop it up with those looking for a fun night out.\r\n\r\nalso, i know i said it above, but the jukebox here is awesome.\r\n\r\nnote: for those that are sensitive to cigarette smoke, you should know that smoking is allowed here.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-16", "description": "I like the small loungy feel, but not sure about the smoking.  I am trying my best to be good, but when you are in there you just want one.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-05", "description": "There's definitely some voodoo shit going on in here. Not that there's anything wrong with that...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "This is my local watering hole.  After moving into the neighborhood I made some of my better friends here.  They pour a healthy drink here... they're not shy.  It's a standout place in the neighborhood as it defintely draws a diverse crowd, most of them are friendly and somewhat or completely familiar with each other & might just be willing to make your acquaintance.  Not an uptight place.  \n   The jukebox is somewhat broken, but is at least not one of those digital jobs & many times the bartenders will hook up their own tunes via their ipod for listening pleasure.  I wish they had a better selection of drafts or bottles(no IPA) though they do have guiness served in an imperial pint.  \n   Since it's close to the hotels in this section of town you can often find people on vacation having a drink which can be interesting.  There's no happy hour, but still it's a good place to sit and have a drink while watching the world go by on highway 101 through the window.", "author": "Crispin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-14", "description": "i can't believe i haven't yelped this yet!\n\ncame crashing here after our wedding reception.  a bunch of us weren't ready to end the party at 1 fort mason, so we swaggered to bmvl.  you could tell they weren't used to 50 people showing up at once, but handled it very well.  it definitely is a great neighborhood bar.  it has great neighborhood people.  the drinks aren't bad either.  and people buy you drinks if you're a bride.  :)\n\ni highly recommend it for something low key.", "author": "jen b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-23", "description": "First time there last night with an old friend and will definitely go back!  Great atmosphere, good people, and Kevin makes the BEST Sangrias!  \n\nOh, and you can smoke in the bar!  Whhhhhhhat?\n\nOH, and there's this HOT guy Spencer that hangs out there.  If you should ever see him powering down just offer him a glass of water!", "author": "Kerry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-11", "description": "Ok... black magic... it's Sunday night, I'm sitting here at the bar and I'm a bit puzzled. Good service, BIG drinks (maybe cause I did a lil wink wink...nod nod..) live music, singer/songwriters, mellow, not over bearing, um..... I'm still here, will follow up in the morning with a full review...", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-22", "description": "My parents met there back when it was a real craphole in the Sixties. Since I owe my existence to the place, I have to give it 5 stars! \n\nAs for the jerkoffs crying about \"illegal\" smoking, it's not illegal if the bar is owner-operated. Also, smoke keeps the fleece crowd away.\n\nBloody Mary's have often been good there.", "author": "Justin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-04", "description": "Yes. Absinthe. It hits me like a ton of bricks. Love it then top that with an apple martini and I'm in heaven or hell?. Is there a difference? The crowd was English. It seems to be kind of a local bar. You know the kind of place where everyone knows your name? No but that messes me up because then both bartenders seemed to know the chick I was talking up. I like the place though- think king diamond.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-21", "description": "everytime i drive by to/from boys.. i tell myself to write a review so here it is! \nthis is not your run of the mill marina bar.. which is great.  and \ni will be honest.. I am not so sure i would have ever gone in to this joint left to my own devices,  but.... boy brought me here two years ago on new years day for their annual pajama party... come as is. hung over,  not slept....whatever you might be.\nfrom partying newyears eve to his casa to strolling down to black magic at 1pm for more mimosas...its perfect.  smoking allowed - yay.  tasty and cheapass mimosas and bloodys?  why not.   no attitude, friendly patrons and good service -  works for me.  \nwe did it again this nyday and had a blast.  makes for a nice little alt secret spot in the land of striped shirts, no?", "author": "Caroline S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-30", "description": "So I finally checked out this dark bar. Not pleased with the smoking but did find the cheap drinks to be a plus ($7 for a martini).  They also had a DJ on Thursday night. Seems like a decent place to go for a drink by yourself although still undecided if smelling smoking would entice me to go back.", "author": "elissa w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-06", "description": "Please people.....Black Magic is not *the only* bar in the city that allows smoking.  And if you took some time to go check out some other dives in SF, you'd know that.  Love coming here on with other New Orleanians and get crazy when the Saints play.  Props for serving Abita too.  Friendly bar staff and a GREAT jukebox.  It's nice to have a little slice of the Big Easy in the City by the Bay.", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-12", "description": "I thought smoking in bars was illegal? What gives, does this place have some special exemption? Met up with the old gang from a previous job at this Marina version of a dive bar for a few pops. A cheerful crowd of drunken yuppies sat around the bar, smoking and talking about whatever drunk yuppies talk about but they are a friendly bunch and won't bite. If you smoke this might be last place in California you can go and sit at a bar and not have to stand on the sidewalk.", "author": "Seamus M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "the interior is much smaller than I anticipated. \n\nI went here for a birthday party this Saturday night. Our group was fairly large, a good 15+ people and we fit fine. \n\nDrinks seemed a tad small, but the price wasn't bad. $6 for my lemon-drop. \n\nit was hard to hear my friends on the other-side of the table though.", "author": "Towanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-08", "description": "I'm almost scared to write a review for this place because it is a well-kept secret in the marina. Dive bar. Cozy. Only down fall is they allow smoking...which I loved up until I quit. Otherwise I'd give the place 5 stars. :)", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-14", "description": "As Erin Z. stated, things get a little crazy on Sundays. Don't know if we can label it a \"Saint's Bar\", but it is. During Saints games this place is energetic, alive and full of good people. The bartenders bust their a** to serve you and make GREAT drinks. Nothing beats feeling back at home 2,000 miles away.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-10", "description": "Newsflash: Smoking is no longer allowed indoors at Black Magic. But people do smoke right outside, and the windows are usually open, so those of you whining should still stay away. \n\nAs a South Louisiana native, I felt instantly at home when I walked into this place. Authentic Bloody Marys, Abita beer, Meters music. What more could a person ask for? Things get a little crazy on Sundays when the Saints are playing, so unless you're ready to yell \"Who Dat,\" you should stay home. I don't want to lose my spot at the bar.", "author": "Erin Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-03", "description": "Stop by for a short bit on a Friday night just to get a couple of drinks. A pretty low key atmosphere with maybe 15-20 people just chilling. We tried their special vodka sweet tea which seemed pretty weak, and tasted just like ice tea. On the other end, had some random absinthe cocktail which was very very strong. Not a place to go and party, and if you're just looking for a place to hang out, you could probably find a cheaper bar...", "author": "Jeffrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "this place was very cool and seemed like a little secret that you are happy to find. its pretty small and cozy. i love the voodoo decorations. when we went here on saturday, there was a big sign that said \"happy birthday\" and we realized that we walked into a b-day party. it wasn't private, but it seemed like everyone knew the b-day girl. we chatted with a 50 something year old guy who HAD to introduce us to the b-day girl and knew everyone in the place. we had shots of patron which are only $6. that is pretty cheap from what i've seen. i would come back for a chill night.", "author": "Shayna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-27", "description": "I love this place and it's right in my neighborhood!  it's a great dive to go grab a drink before heading out to the clubs (in my case) but I've definately spent a few fabulous night catching up with friends here.  drinks are strong and not over-priced.  if there is anything I would have complained about here... I certainly can't remember!! and I luv the voodoo theme... think I'm gonna decorate my house like that LOL ; )", "author": "Nieka B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-10", "description": "I really like this place. It's simple. No fuss. No scene. No gimmicks. It is what it is. The drinks have always been good every time I've gone and the bartenders friendly. It's small, cozy, and sometimes a nice break from all of the trendy, overcrowded and loud places popping up all over SF..don't get me wrong, I love those too, but sometimes it's nice to take a break and just hang out somewhere dark and cozy like the Black Magic Voodoo Lounge with some friends.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-21", "description": "Great little slice of NOLA right down the street.  Love that you can get an Abita, Pimm's Cup and a little southern hospitality smack in the middle of a bunch of touristy crap.", "author": "Joe M."}
