{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Boudins at the wharf was milling with thousands of people, so this spot was plan B.  Approx 20 min drive from the wharf, but definitely worth it.\nWe got a spot right in front of the shop.  We split a clam chowder bread bowl & an Italian sandwich.  \nPicked up three loaves to take home to family members and as a bonus they offered to slice them free.  They also have pastry items .  We got three cookies to take home for the grands.\nAte our soup & sandwich outside at one of the three tables available.\nService was fast and with a smile.  Will keep this spot in mind when I am in the city and don't want to go to the wharf for a Boudins fix.", "author": "T F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "This Boudin location in the City's Richmond District is not a bakery café as the ones at the Embarcadero or at Macy's.  This location is a bakery but it does have a small shop that has the full offerings of Boudin breads with limited menu offerings. You can't order online at this location. \n\nYou can get their famous clam chowder in a bread bowl as well as a cheese focaccia and an Italian Classic and a Turkey and Havarti sandwiches. There are some pastry and cookies offering as well. There are a couple of tables outside to enjoy your Boudin goodies.\n\nPicked up a loaf of Sweet French today.  They will slice it up for you if you want. \n\nThough it is not as large and doesn't have all the offerings of a bakery café store, this location offers what Boudin is known for...bread.  A neighborhood gem.", "author": "Al L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Not your typical Boudin Bakery, as this is more of a take-out café adjacent to one of their bakeries, but a hidden gem none the less.\n \nThis is not a café that you can really sit down at to enjoy a meal or drink (they have outside seating only- but as this is in the Inner Richmond, you tell me how many times a year the weather would actually allow for that). No, the reason to come here is for the seasonal breads and the cheap AF coffee.  Seriously.  A 16oz coffee is $1.50 which in my opinion is the deal of the century, AND it's delicious. As someone who can't seem to get it together and make their own every morning, this seems like nearly the same price per cup as if I actually did make coffee myself. At least that's how I justify being a regular.\n \nThey also have great loaves that you can't get at all Boudin locations such as olive bread, raisin bread and the animal shaped loaves they are famous for. It's a nice place to pick up something seasonal if you are going to a group dinner or picnic.\n \nAlso, I noticed other people had some opinions about the staff. In my many experiences they have been nothing but gracious and pleasant. I love this place!", "author": "Kathryn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Just came for the clam chowder and bread bowl. Totally worth it! I have this impression of Fisherman's wharf and clam chowder (must be in a bread bowl) and so when I made a recent trip to SF I said, we gotta go get clam chowder. I've already been to the wharf many times and we were on a short/tight schedule so my friend decided to stop by Boudin Bakery and boy was that a good choice. It's a small spot but perfect for having a nice and easy bowl of chowda! Would def come back next time I'm in the city!", "author": "Alfred H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Oh yeah. The best. SF favorite. SF classic. Boudin, I seriously love you. \n\nToday I went out on a whim and adventurously selected the garlic volcano loaf to pair with fresh dungeness crab tonight.", "author": "Christine V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "I flexed my \"let me tell you all about sourdough\" muscles pretty hard not too long ago when I got all science-y about it in another review. To save you the pain of having to go through that again, I'll just sum it up thusly: it's not just your imagination, sourdough really does taste different in San Francisco. It's science. \n\nWhile there are many other contenders for birthing the bread nouveau movement of the last few decades that are based in the Bay, that's not Boudin's trophy. But arguably, when it comes to that tangy sourdough bite, they may very well be the name. The big one. The most well-known slinger of sourdough.\n\nWhile the airport is packed with their stuff, and the waterfront has the massive spectacle of the flagship bakery location, I'm actually quite fond of this one on 10th. It's the peoples' Boudin. The Inner Richmond locale. The \"stop by on the way home for a loaf\" location. The \"let's duck in for a soup bowl\" stop. \n\nFor me, it's been a go-to for years. Usually, it's when I'm on the way out of the city and I want to grab some bread as a gift for special people back at home. Nothing says you care like a loaf of bead, so when you tote a loaf of sourdough on the plane, you must really really care about the person it's going to. \n\nI'm a fan of the simple rounds, so if you can get through a big one, great. If not, they do have a smaller loaf. They also have the festive ones--holiday shapes, crabs, turkeys, or whatever. That's sort of a bonus feature and novelty, as they're good but never as good as the normal boule. \n\nRemember that this is a neighborhood shop, and it's not one of their new cafes. It's first and foremost a bakery where you drop in for a loaf of bread, and secondly, a very limited lunch spot that's pretty much just bread and soup/chowder. That's the charm, really. This is a bread lover's bakery. Pure bread. Unadulterated yeast feast. I loaf it.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Leave the tourists behind on Jefferson St and come hang with the locals. Bread bowls, sandwiches, a large selection of breads and great service. For me it's a Richmond district institution", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "Went early in the year with my family, we enjoyed the clam chowder in the bread bowl and the cookies were are HIT. We will be coming back when we visit again !", "author": "Paul G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "And like a cartoon character floating down the sidewalk being drowned by the intoxicating smell coming out of the store as the door as it opened I went it to buy loaves to take home. There are sandwiches and sweet you can purchase but the whole purpose for being there is for the amazing chew, taste, and smell of their fantastic sourdough. It does not matter if you tear a piece off to eat just as is. Or with a little bit of butter. Or maybe you like to toast it it and slather some fresh berry jam. And then there is always stopping off and getting some brie to go with your sourdough. Needless to say. The bread is amazingly delish. And the staff in the store are very friendly. Sourdough...its the food of love!", "author": "Orleana P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-10", "description": "I tried calling several times to place an order to pick-up, but no one answered. Drove down a few blocks, luckily I was able to find parking on Geary. Got in and asked for some chowder. Yet again, they have ran out. I must have bad luck because this was the second time they were out. \n\nI still like going to Boudin, but this location seems to always run out of clam chowder, or they just dont want to make it anymore. Yes, lunch time can be a popular time to get clam chowder. Wouldn't you project making more to supply the increased demand? Nope, not this location. Just expect there to be no clam chowder from 12-3pm.", "author": "Justin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Food was amazing! Nice interior with a large seating area. Ordered a chili bread bowl and it came a couple minutes after. The lines were not long and had very good service. Employees were nice and had no problem with us. A definite must visit.", "author": "Jacob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Delicious and well scented bakery. They now open Sundays. Hard to find a parking. They have clam chowder bread bowls. Sourdough bread shaped like turtles and crabs. They have cookies and danish's. They have coffee but they didn't have orange juice.", "author": "Debbie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "I absolutely love. Coming here for lunch. The veggie sandwich is beyond yummy & does fill you up. My daughter would prefer to just eat the bread. If you can stand the busyness of the store, try out the food.  It's worth it!", "author": "Joni M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "My sister and I went here one cold rainy morning and had not even entered the restaurant yet when the general manager Doug came outside to greet us. He invited us in and told us all about the place and made some recommendations on what we should try. I have never tried eggs benedict but he convinced me to try the crab cake eggs benedict on sourdough and I kid you not it was the best thing ever. Great service, great management , great atmosphere, and a great location not to mention excellent sourdough.\nFor those who do not like sourdough bread the bacon waffle is an excellent choice.", "author": "Malibu Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "So I didn't get to try this place because I was trying to get a salad at the time. Upon walking into this Boudin, I've realized immediately that it's a really tiny shop compared to the other Boudin locations I've been to. The lady told me that they only sell the bread, soup, and sandwiches only. So I didn't end up getting anything.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "Went in 40 minutes after they opened. Was told there was no menu to look at, and the only thing she could make me was a Swiss and salami sandwich..", "author": "Evan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "this location is so amazing no need on que sour dough is so fantastic clam cowder was exallent", "author": "Nattakarn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Love it .. had jalapeño cheddar sourdough with cream cheese and also a wholegrain bread. Must visit", "author": "Sai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "What is there not to love about San Francisco originals sourdough company. Love their selection of sourdough, bakeries, sandwich, and soup offerings.  Always will be my favorite spot to get a quick bite.", "author": "Meishi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Signature Boudin's bakery!  \n\nSmall corner shop on a busy traffic street.  \n\nQuick service and the their sourdough bread is yummy! \n\nThe smell of freshly baked bread is heavenly.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "EXCELLENT PRICES for coffee drinks. I enjoy picking up their holiday sugar cookies -- three for under $5. They don't have a huge selection for lunch as most of their items are sweet pastries, muffins, cookies, and loaves upon loaves of bread. If they don't run out, you can order a clam chowder, turkey sandwich, or bagel with cream cheese. This is a great place if you're on a budget. This is not a great place if you're on a carb-free diet.", "author": "Ato Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-01", "description": "Regretfully I can't give more than 2*'s for this branch.  The clerk was absolutely nice and professional.  But this branch is nothing more than a small outpost of their original baking operations plant.  Thus, the food offerings are not more than a few items and a whatever baked items they have on display.  \n\nHowever, it would have been best to make signage alerting prospective customers that they do not offer the full café menu only what they've got on display (soup/chowder, sandwiches & salads offered are displayed on the small counter top as samples).  We were in the area, and thought that this 10th Ave. location would save us time than going to their café at Stonestown.  But it was a wasted effort especially as it's hard to find parking & we ended up having to drive over to Stonestown afterwards.", "author": "Luisa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-05", "description": "What I ate: Clam chowder & jalapeño cheese bread\nVisit date: July 5, 2014\nFirst time? To this location, yes.\n\nI had friends in town so I had to take them to get Boudin clam chowder, but what I didn't want to do was bring them into the touristy masses on a holiday weekend, so we ventured to this Boudin location, far, far away from the crowds. \n\nPros and cons of a smaller shop -- \n\nPros: same great boudin breads (maybe even more options, too!) and chowder, no crowds, lots of parking\nCons: small batch soups means we had to wait for a new batch to heat up, only a few outdoor seats\n\nWhat was exciting for me on this visit was my chance to try their jalapeño cheese bread. It was too good, especially with the chowder. It wasn't hugely spicy, but had great pepper flavor and was soft and chewy. \n\nThis location also has bakery sweets and coffee.", "author": "Erin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "I've always loved Boudin, but this was my first visit to this location, and was incredibly disappointing. The two women working the counter were too busy chatting to help us when we walked in, we stood there for a couple minutes before the acknowledged taking our order. There was no menu in sight, so we asked what was available and inquired about some of the prices, and what we got a very dumbing-down attitude and responses from them. Food was just okay. Sandwich was dry and chowder was watery.", "author": "Gina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "Hands down best clam chowder I've had in my life! So creamy, generous amount of clams, soft potatoes. Everytime I'm in the area I come back for more of their clam chowder! \n\nTheir sourdough bowl is a perfect complement to the chowder. Will definitely be coming here on the regular when I'm in town", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "I really like their bread - it's a San Francisco classic. I'm also a fan of their bread bowls and like their claim chowder. Good stuff. \n\nNut Allergy Note - While they do have nuts in some of their breads, I think some nut allergy folks can eat some of their non-nut breads depending on their sensitivity. I would always be a bit careful with breads, but I think these folks have good practices as far as these things go.", "author": "Sven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Clam chowder is good but I am never a fan of sour dough. Good place to enjoy the sunshine and the wharf.", "author": "Zona K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "A great sandwich on freshest sourdough bread. 2 choices only, turkey and Havarti or Italian combo. Mostly a bakery, many varieties, but this is the World Famous SF sourdough. Cookies and brownies for your sweet tooth.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-12", "description": "5 stars for the bread because Boudin's bread is pretty much as good as it gets. Come by around 9 (or 11?) and the sourdough is still warm.  \n\n1 star for the morning cashier. Am I inconveniencing you by always asking to have my bread sliced? I come here at least once a week and she rarely cracks a smile. I def don't keep returning for the warm welcome. That said, I love this place.", "author": "Hanster P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "The restaurant has, by far, the most delicious Crab Cakes you could every taste. I still find myself craving them, all the way from my home, Chicago. The sourdough bread bowls, however, are much more cost effective if you buy from the bakery downstairs. Altogether great service, definitely recommend.", "author": "Cosette T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "Drove 20 minutes from beach to eat here, and they were out of clam chowder.... on a Saturday at noon...", "author": "L M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "Tucked away off of all the Chinese restaurants on Clement and Geary is this hidden gem that has been cranking out sour dough beauties for over a century. Yes that is right the mother dough or starter dough has been around aloooooonnnnnngggg time. And boy does it taste good.\n\nEverything is fresh all their breads are baked daily. Try their sour dough sandwich rolls (pure heaven). Their chocolate and raisin, their olive, and all of the traditional loaves that they have to offer.\n\nI even like their clam chowder in a bowl...better than fisherman's wharf.\n\nPick up a loaf you loaf tonight!", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Chow-dah bowl is delicious  get the bread bowl and don't think about the extra calories because the sour dough is to die for", "author": "Terri G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Delicious sourdough bread.\nNeed I say more.\nConsistently good, they'll slice your loaf if you want and they even have sandwiches, coffee and soup. It's such a gem to have this place in the Richmond.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Small shop. Bakery mainly . Has some sandwiches but the main interest for me was the clam chowder and sourdough bread OFCOURSE. Meter parking. Few tables and chairs outside for nice days -otherwise you would have to \"take out\". I normally go to the location by the piers but I happen to find this location which is closer to golden gate park.  The clam chowder bread bowl will fill you up!", "author": "Maria V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "Note: I think some of the reviewers here are confused about which location this is. This is the small shop on 10th Ave at Geary.\n\nI've come here quite a few times over the past couple of years. Their bread is just as fresh as at the big bakery! Even at the end of the day, it's clear that the bread has been baked throughout the day because it's still just as good. I love this location because I'm in the neighborhood and can just pop on by for some bread for dinner. They also have pastries and coffee. At lunchtime, it can get busy (or seems that way because it's so small). They have two sandwich options, clam chowder, and sometimes some sort of pizza or foccacia bread. Prices are good!", "author": "Jess B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Don't  tell anyone they will toast the pizza bread and cut it in 4 pieces.Best carb loaded $3. snack .The bread is cheaper here than in the full service Boudin locations.A few tables outside.The light ryebread is almost the same as the New York Ryebread I grew up on.Good crust.Until now I didn't  realize the NY ryebread I had when I was a kid was a sourdough.The paper bag said they use no yeast.So it must have been a sourdough.Quick service.", "author": "I. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Best fresh French bread. Love the specialty holiday items. Always a hit at our house! Cookies and clam chowder are available. Small tables in front.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "We loved this bakery. Got the jalapeño cheddar bagel toasted with cream cheese. Excellent. Nice selection of sour dough bread and coffee. Only a few places outside to sit though.", "author": "Mary Lynn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-25", "description": "Booooo! No soup in bread bowl! ThIs hole in the wall joint is ridiculously small, expect a line out the door. I think the only soup they had was clam chowder but couldn't try it cuz the lady looked into their pot & stirred it & goes 20 more minutes! \n\nReally. Skip on this location. Outdoor seating but it's freezing in the city most of the time & very limited menu.", "author": "E W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Fantastic Fresh French bread!!!!!!!! OMG!!! To die for! \nCan you please open a location in LA? \nThese bakers are on point! I am traveling with French people straight from Bordeaux. So they have been a little.. Well maybe a lot disappointed on the mispresentation or the \"French bread\" that's being sold and called all over the place...\nBut this place... Hands down have pinned it on point! We were even able to still enjoy it the next day and it still tasted great! \n(That's rare for us since a bread in the LA atleast is only good for a day.)\nAnyway I'm fantasizing about the bread here. I'll just continue to haunt for some great bakeries in LA for some unbeatable French bread.", "author": "TinTin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Best chowder in a bread bowl in the Wharf.  Great experience and vibe and a must stop when visiting Fisherman's Wharf.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "I think this is the best thing about living in the Richmond, and for me it's right on the corner. The smell is intoxicating. Double shot and a pastry (go for the chocolate croissant) will cost around $3 and they are always bring out something new. Today, I had the richest brownie I've ever had. You have to stop by if you're in the neighborhood.", "author": "Jordan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "Boudin's has a small counter and an entrance on 10th ave. didn't see any deli nor clam chowders available. discontinued or wrong location reviered? just a bread couner here.\n\ndough availability: many kinds of breads, baguettes, scones, bagels, muffins, pastry\n\neats: sourdough bagel asiago cheese and ..sesame seed.(1.15)\n-chewy, not a lot  flavor, sour dough not tasted\n3ish stars for the bagel, experience 4 stars\n\ncrumbs:\n-fast service. out within 8 minutes, .25 cents on the meter.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "If you just want bread, this is a place to go.  If you want some of the fancier things they have at their other locations, then wait in line with the tourists.\n\nI like this location because I don't have to go to the other side of the city to get good bread.  In-Out and done.\n\nAlso, it's one of the few, if not the only, location that will slice the bread for you.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Pretty good customer service. Went on a not so busy Sunday and although the parking sucked the clam chowder, cheese pizza thingy and sandwiches made up for it. Yes-CARBS, but why go to a bakery when you're worried about carbs?!?! We had a long day and wanted something delicious without the tourist attractions. We stopped, grabbed our food and ate a nice meal at a park down the street on 7th I believe. The cookies are a bit small for the price, but you are paying for quality. We decided instead of getting cookies, we would just splurge on bread. We were full and happy about our clam chowder bowl. Plenty of soup and had a nice amount of clams. It tasted super fresh and not from a can.", "author": "Rocio G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "The best sour dough bread!  They even treated my 5 year old to a personal tour!  She was delighted!!", "author": "Mom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "Someone tried telling me this location had closed.... I'm pretty sure they're alive and still kicking. The line was out the door, and all I wanted was a croissant and a 1lb loaf of sourdough bread.  This bakery continues to make my life complete. \n\nI also learned they make sandwiches... I'll have to try them when I'm in the area next time.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "I've tried boudin throughout San Francisco, best known for their sourdough bread. This one has the best sourdough bread bowl!! My boyfriend and I got the clam chowder bowl Togo since the small bakery does have limited seating but definitely have a great assortment of bread for your choosing. Although we did get the bread bowl to go the bread stayed fresh and had a great crunch to it. The chowder was okay, I do prefer my chowder to be less watery but it is still great with their bread bowl.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Seriously good sourdough. Amazing waffles. Not too pricey for the amount of food and the quality. A must stop on fishermans wharf.", "author": "Kari H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "Gotta love the bread at boudin! I had turkey and cheese on sourdough and it was awesome! The staff was busy but friendly. They have wonderful muffins also! There is a seating area but depending on what time of day it is, you may or may not get your favorite spot. However, the bread and the sandwiches are worth it! Take home a loaf of their bread. You won't regret it!", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "Tried their \"lunch\" menu as a takeout...\n\nThey offer two types of sandwiches, a turkey and havarti cheese or an Italian classic, basically a dry salami sandwich; we ordered one of each.  In addition, we ordered two (white) clam chowders, one with a bread bowl.  When you skip the bread bowl, they discount the price of a clam chowder by $1.  We also ordered a 2 lb sourdough oval loaf, and took the whole kit and kaboodle over to my sisters house to eat...\n\nThe sandwiches were good, and so was the clam chowder, but nothing outstanding like the best I've ever had.  Still, the whole point is the bread.  The sourdough bread here takes the sandwich and clam chowder and \"kicks it up a notch...\"\n\nI wish I still lived close by so that I could appreciate the bread more often, it's not the same at the remote Boudin's stores outside of SF...", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "If you haven't had Boudin before, you haven't lived. I'm just going to continue on as if you have and give you the chance to go by your nearest location and read the rest of this later.\n\nDid you know this is the original factory location? I started to suspect this when I went on my first walk around my new neighborhood and I could smell the boudin 2 blocks away. How cruel.\nSo this is very different from any other Boudin location I've been to. It's extremely small and really just a storefront at their main factory warehouse. They have every kind of bread Boudin makes, some pastries, a couple pre-make sandwiches, the classic chowder in bread bowl, and maybe a premade salad? (don't quote me on that). They also have basic coffee. What they DON'T have is much seating. They have only outside tables (3 to be exact) that sit 2 at each. Surprisingly every visit I've made they've been pretty busy with take-out customers. They also only have one employee working given the size, so it can be a little slow.\nHaving said all that, once you realize this isn't much of a restaurant and more of just a take-home bakery, it is everything you could want in the neighborhood. I will definitely be a regular customer now that I live so close by!\nMy other minor qualm with this location is that they don't do the Boudin frequent buyers card. Weird, right? I could be getting so many Boudin points with all the bread I'm about to buy...\nOverall: Just know that this isn't a 'Boudin Bistro' like almost every other location. Plan to go in, buy, and bring home or to the park since it's very possible that they won't have seating for you at their outside tables.", "author": "Brad M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-13", "description": "The smell of sourdough bread caught our attention and we had to check this place out. To say I was disappointed is a severe understatement. \nI got the New England Clam Chowder with half of a crab cake sandwich and wish I could have taken my business elsewhere. The bread was hard as a rock and cut the top of my mouth and the soup was watery and bland. I'm glad I didn't spend the extra money to waste on getting that soup in a bread bowl.", "author": "Corissa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Everything is super duper fresh because baking happens at this location. They only have two kinds of sandwiches roast beef and turkey. There is always a line.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-05", "description": "Worst latte I've ever had. Seriously, I can recall gas station lattes that were better.\n\nThe croissant was good and fresh, but the dutch crunch rolls were void of any flavor whatsoever.\n\nThe cashier had major attitude.", "author": "Bianca U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "They only serve one sandwich, and it's perfect. It's turkey, havarti, tomatoes, lettuce and their perfect sourdough bread. You can add mayo if you want, thanks to a little packet.\n\nI just never thought I'd like a place that only had one sandwich, but crazy things happen all the time, I guess.", "author": "Sam D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-02", "description": "The staff may be great but for some reason this place in comparison to the one on fisherman's wharf is just OK. \nThe smell that comes out of this Boudin at about 5p.m. is just horrible. The soup here isn't as good as the other Boudin.\nThe staff is extremely friendly and so are the customers that walk in.", "author": "Cescilia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "Some of the reviews for this place are confusing. This is only one of the SF locations, so make sure you're looking at the correct address before you go. It's really just a bakery without all of the other foods that I guess are at the other location. This place has bread (duh), coffee, and I saw a big cauldron of I-don't-know-what. \n\nI went here just for bread and bought a 1lb sourdough. $3 and some change. I was pleasantly surprised that they offer to cut it for you. Yes, thank you. :) \n\nAnother note: I went really late in the evening just before they closed, and the bread was still wonderful and fresh. I've run into issues with stale bread at other bakeries when I've gone just before close. Not this place!", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "Best value coffee in the 'hood. \nDelicious baked goods. The almond croissant and ham+cheese croissant are deliciously unforgettable. \nVery gracious service in this sleepy little factory. It is a hidden gem.", "author": "Libra J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-26", "description": "I had their chocolate scone, chocolate croissant, a brownie, and a bread treat that was baked with cheese on top, the name of which escapes me.\n\nThe scone was alright. The Croissant and brownie tasted like they were at least two days old. The bread tasted like when you put your tongue on a piece of metal, like a key on a keychain.\n\nI'm from Europe and let me tell you, this isn't even on the level of what you get at a train station in rural towns in Germany.\n\nI also don't expect a \"French bread\" bakery to be run by people who clearly aren't french.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Came here for bread left with a 2 pound pumpernickel . They offer slice the bread but I like my slices thick and I had sandwiches for 3 days . They have many types of bread . I recommend rather then going to a store take the time to go and get a fresh loaf .", "author": "William W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-03", "description": "Sourdough here is good. Nice crackly crust with chewy inside. It's unfortunate the bread bowl is cold. Would be a hit if it came out steaming. Also place is tiny it's just a storefront with a few tables outside.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Dinner in the bistro upstairs was good. The sole was a generous portion served with mashed potatoes and spinach. The best dish of the night was the spinach dip with crab appetizer - the best spinach dip we've ever had, not to mention the delicious crab meat on top.....so yummy.....and great with a Red Trolley Ale. The spinach dip was one of the best dishes on our week long visit.", "author": "L M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-31", "description": "Nothing like a piping hot Tomato Soup for me and the Classic Clam Chowder for RL in a Sourdough Bread bowl to warm you up in San Fransisco's chilly weather. \n\nTheir Sandwiches are pretty lame so steer away. And don't even waste your time or money eating int the Restaurant. Service was awful and RL thought the Clam Chowder tasted different than from downstairs (and not in a good way).\n\nNext time I'll probably give the Chili Bread Bowl as it looked pretty tasty.\n\nAnd feeding the birds the bread I can't finish is always a nice treat.", "author": "Ciara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "Best. Bread. Ever.\n\nRecently came up for Thanksgiving and had to stop in for some bread on the way home.  The cranberry loaf was absolutely amazing.  I made grilled cheese with it and it was surprisingly amazing.  It's been referred to as \"Stuffing Bread\" and I'm totally addicted to it now.  Can you somehow get Boudin down to Los Angeles, please?  Would be really great.", "author": "Colleen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Now I love clam chowder and if it's Boudin's, that just makes it twice as awesome. I've been a inner-Richmond resident for over 2 decades now and I honestly, NEVER been to this location (until today). How did that happen will always be a unsolved mystery..\n\nThe shop is small and you can only dine outside with their limited tables which is fine but I came here to grab it to-go. I ordered my usual clam chowder in the bread bowl with an extra cup of chowder ($12.15 total). Rushed it back home and DEVOURED it! The clams were legit and had big portions of potatoes. Now the best part is decapitating the bread bowl (don't be afraid to get your hands, arms, and face messy!). \n\nIt was bliss.", "author": "Albert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "Warning: Parking is a bear and people will practically run you over to get their sourdough on.\n\nThat being said, we stopped in for a cup of chowder and a sandwhich on the way to John Muir woods while visiting SF.  This is a tiny store that makes a few sandwhiches but I was there for the clam chowder.  It did not disappoint.  They also have fabulous bakery items as well.  Cute little corner store that is FULL of flavor!", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "This place is great! It's a bakery. So you don't go there for chili, or pizza, or soup even, although they do have the clam chowder but it's not enough for a group of dipstick tourists. \nYou go here for bread. \nSuper nice staff and fantastic bread. They'll even slice it for you. \nIt's a bakery. They have great bread.", "author": "Suck It Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "This place has the best sourdough bread that I have ever tasted. It is always fresh and fairly inexpensive.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Nothing to add about the bread, simply the best in the world IMO.\n\nThis is in response to the kvetching about parking, which is admittedly limited.  People, this is San Francisco!  Take the BUS.  The SF Muni will get you from anywhere to anywhere.  Buses are clean and efficient and the City adds more all the time, unlike L.A. where they keep cutting the Muni budget.", "author": "Bonnie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "Amazing must visit. Bread is amazing and pizza is great.  Perfect location . Bread bowls are the best.", "author": "Jessie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "After spying this on the awesome show \"Eye on the Bay,\" I knew I had to check out the original Boudin location. Finishing up a day of walking around Golden Gate Park, it seemed like a great chance to do just that!\n\nI'm sure I've passed by this location many a time, but its location surprised me. It's a little place; well, the actual storefront is. The other parts looked to be put to good use for the bread making.\n\nThe ladies at the front were really nice as we ordered our clam chowders in bread bowls. This is a real treat; I only get this at Fisherman's Wharf, and I avoid that location like the plague. So it had been a while, and this location didn't disappoint! Same great flavors and same bomb-ass bread! Sooooo gooooooood.\n\nThe only seating is outside on the sidewalk, where they have a few tables and chairs. Thankfully the weather was decent or else the experience might have been different.\n\nThis is a great alternative to the Boudin mega-complex at Fisherman's Wharf if you're hankering for some great SF sourdough!", "author": "Greg S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "My first time at SF with my friends and we decided to get some Boudin...\nI was really excited because the bread smelled so lovely just outside the store. I went on a weekend so it was pretty busy...\n\nMy friends and I shared the soup bowl and the fried seafood plate thing...\nI was really excited but it didn't meet to my expectations...\nI found the soup on the salty side and the bread just average.... I felt that I could heat up a canned soup of clam chowder and it would taste the same.\n\nThe fried seafood was just okay...\nI kind of got sick from it since it wasn't cooked all the way....\n\nAll in all, I think Monterey's clam chowder on the wharf is better....", "author": "Eunice K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-28", "description": "As mentioned by another reviewer, this location isn't as good as some of the others in the city.  I went to order the half sandwich half soup combo, but realized that it wasn't offered in this location so I ordered a bread bowl with clam chowder to go instead.  When I went back to my work which was only two blocks away my soup was already cold.  \n\nYou know that feeling of excitement where you pull the bread to dip it in the soup?  It was sadly ruined by the long piece of brown hair baked into my bread.  Please use hair nets or tie it up when you bake next time... :(", "author": "Lynn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "Historical landmark in SF. Love this place. Always fresh bread and they will cut it for you. Clam chowder in bread bowl - YUM! I've tried their sandwiches simple flavors...\n\nI try to come here once or twice a month. I'm a reg", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-28", "description": "Hidden history.\n\nThis location isn't as well known as the other Boudins in town but it's been around the longest. A remarkable one hundred plus years dating back to 1906.\n\nJudging from multiple customers ordering significant quantities of freshly baked bread it's plenty popular.\n\nSipping an espresso and taking bites of my sourdough roll I can see why. It tasted like a quintessential part of San Francisco.\n\nNot my first Boudin experience and won't be my last. The true San Francisco treat.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "I definitely recommend the tomato soup in a bread bowl! So good. The shop downstairs has a variety of cool gifts. There is a museum upstairs, but honestly you can get just a good view of their kitchen if you peer through the window from outside. It's pretty cool watching them make the bread! I love the koala loaves!", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "Finally a place that serves clam chowder without bacon in a bread bowl. The sourdough bowl was perfect and the chowder has just the right amount of clams. Note that there's only a couple of somewhat run down tables and chairs outside for eating.", "author": "Amin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-06", "description": "Came here near the peer for some clam chowder. The soup was pretty good but the environment was not what I had expected. Small disappointment there. \n\nI wanted other food to go along with my clam chowder...but I guess their ONLY famous for their clam chowder because EVERYONE  ONLY orders a clam chowder. That didn't make me very happy.\n\nBut if your not VERY HUNGRY, then you can go there and just order a clam chowder.", "author": "Fiona X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-09", "description": "I love Boudin's clam chowder! \n\nNote: This location is small & pretty much take-out only, with a couple tables outside if you really want to eat there. All the bread is baked fresh - there's a huge workshop you can see right into!", "author": "Alysha K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-06", "description": "This location on Geary street does not have all the soups salads and sandwiches that the other locations have. They do have clam chowder, pastries and tons of sourdough. I'd give more stars if they had more options like the boudin cafe's do.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-23", "description": "Sourdough bread is phenomenal. Chocolate chip muffins have 2 chocolate chips and are dry along with the pastries.", "author": "Kait B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-14", "description": "The Panera of the West Coast on STEROIDS! This place is the bomb dot com. Absolutely loved it.\n\nGot the half and half special with turkey& harvarti sandwich & butternut squash soup and even though I was full not even halfway through finishing my meal I pushed through the end because it was that awesome.\n\nHad it again at the airport when I was leaving because I was in mourning of losing this wonderful place and got the chicken caesar salad and classic Italian sandwich for my flight. Everyone on the plane was definitely jealous of me. Because it smelled sooo good and trust me, it was.", "author": "Karis O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "I've only recently learned that there are places other than the Wharf that serve sourdough clam chowder bowls. & I was thrilled to find out that Boudin is walking distance from my house.\n\nOn a Sunday morning, I all of a sudden was craving some good old San Francisco clam chowder sourdough bowls. Not wanting to drive all the way to the Wharf, however, I found myself surfing Yelp to find if there was a place closer. And low & behold, there was Boudin. So I took a 15min walk and found myself in a nice cozy place, with outdoor seating (only), filled with breads of various shapes, sizes, and designs. \n\nI ordered the clam chowder bread bowl for around $6.50, sat outside on their tables on a nice, yet crisp, SF morning (which worked perfectly with the warm clam chowder) & I found my new go-to place for clam chowder outside the wharf. The clam chowder was nice & warm, and the bread was crunchy on the outside & soft on the inside. \n\nThe only thing that I thought could be a bit better was the temperature of the bread bowl. I felt like it was a bit on the cold side. I also feel like the clam chowder didn't have too many clams. But, it was satisfying to my taste, and it was a pleasant experience.", "author": "Junel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-02", "description": "So you know how Europeans always complain about American bread? Unfortunately, they are right.\n\nEnter this place.\n\nI wish I'd found it sooner - what's with the run-down, permanently closed look along Geary? Regardless, once I set foot into this store, a wonderland of European bread awaited. Plain Vienna, Ciabatta, Dutch rolls, and of course Sourdough in all sizes and shapes are available for your munching pleasure. Sure, this kind of quality has its price, and the place is surprisingly small, but it's really worth the wait.\n\nDitch the white boxy pre-sliced abomination that's sold in convenience stores, for heaven's sake, and get yourself some real bread.", "author": "C D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-23", "description": "I wouldn't call this place a restaurant since there isn't really a place to eat. Sitting around here, one is surrounded by the smells of freshly baked breads and exhaust from cars, with the sounds of fans and cars flying by. \n\nThis is a nice place to grab a quick snack and coffee on the way of going somewhere.", "author": "M C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-19", "description": "Way overrated. Had better clam chowder and crab bisque at other places. Also not worth it for the price. Portions are super small. Food is good though, but you can find other places around SF for the same price with better food.\n\nOnly went because had friends visiting from out of town who had heard about the bread bowls.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-27", "description": "Great bread and fast service!  I have tried a variety of different breads, and they have all been excellent.  Loafs range from $3-5, and are a good deal for the taste.\n\nThe coffee and pastries are also pretty good.", "author": "Travis R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-03", "description": "Legendary breads. Had the sourdough bread bowl an chowder. Kids had a pizza focaccia. 4 people ate for 14 bucks!!!!  Really nice ladies working in there too.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-19", "description": "hey it was good, it was a cold day. Totally hit the spot for what i wanted. and it was not gross. The bread was fresh, the clam chowder was clammy, and chowdery? haha not but they were good, not watered down real thick and hardy. \n\nBUT, it wasn't the best i've ever had. It was just the average (well just above average), bread bowl soup/chowder. You can find just about anything around this quality in most big cities i feel.  But hey, it was convenient, and exactly what i wanted on a cold rainy day.\n\nit was around 6.50 for a bowl\n\noh hey a bonus was they accept all major credit cards...even discover..hard to find that now adays :)", "author": "Barnabas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "When I'm on the 38 and suddenly smell delicious sourdough, I know I'm almost home!\n\nThis is where I come to buy my bread every week.  Everything I've gotten here has been fresh and fabulous, even their plain ol' white bread.  Some of the loaves are quite large, perfect for dinner parties or families.  They have a nice selection, but they are always running out of the seeded baguettes, my favorite.    \n\nThe staff is courteous and quick.  They will slice your loaves if you want, but I never have mine sliced.  It stays fresher and better tasting if you just slice it yourself as you need it.\n\nIt is definitely a take-out place, there are a couple outside tables but it is not really like the cafe ones downtown and the menu is more limited.\n\nMy one complaint is that this location does not accept the Boudin's rewards cards.  Only the ones at the wharf (hell no) and downtown will accept the cards, which is real bummer for us loyal customers.  If you buy loaves from the locations that aren't actually bakeries, the bread is not as fresh, esp. if you try to pick one up after work they can be almost stale.", "author": "Pinky S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "Have you ever smelt sourdough wafting through inner Richmond, not at any time of the day that you can pin point and its stops you in your tracks because the smell is so delicious? This is the source. \n\nNo need to go down to tourist-trap Fisherman's Wharf for good sourdough and clam chowder - the inner Richmond's got it here so remember that when visiting or shuttling outta-towners around to get their share of what makes the City-by-the-bay special.  \n\nFor meals or snacks, the chowder and sandwiches are good for the price and the pizza bread is really inexpensive for the size. Cookies, pastries, rolls and breads are all consistently good...there is a reason they've been in business for so long. There are  tables out front but I say soak in more of the city, -order stuff to go and eat in nearby GG park, or head out to Sutro heights and picnic there.  \n\nThis little hidden spot adds neighborhood charm...I primarily went there to grab a  (strong, full-bodied, usually fresh brewed) cup of coffee in the early am hours and I was always met with the smiling faces of the sweet ladies that work the counter.  I usually ran in and out quickly during the week but on the weekends I would take a second to enjoy the pictures on the walls of the company's bakers that still work there today...some of them possibly in the back at that moment at work... sometimes you get a glimpse of them,  so take a look, this is San Francisco.", "author": "Jodi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "Stumbled onto this unique diner by accident, searching for another cafe nearby. Frustrated and hungry, my dining mates and I \"settled\" for Boudin, but we were in for a surprise.\n\nMy sandwich was built of smooth guacamole, moist turkey breast, and veggies in between ultra fresh bread. Perfect ratio of bread to veggies to meat, too.\n\nFood came upstairs to our table quickly - luckily, we snagged one during the lunch hour rush they get here - and staff here were super nice, bringing my friend the bag of chips she had left down at the till. Nice.\n\nI could barely finish my meal, since I'd already been eating all day like I was on vacation (what? I was!) but a sandwich that good is but a challenge to me. Sadly, the 'wich took this round, but I'll be back, Boudin, and ready to take you on!", "author": "Brittany K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-19", "description": "Three words: CHOCOLATE RAISIN BREAD!\n\nAwesome bread, strong coffee and thankfully, conveniently close to my work!  Parking is difficult, but well worth circling for a parking spot!", "author": "Pb J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "love to come here to watch them make bread in the windows, watch the bread baskets above as they move on their conveyor and of course...eat!  Clam Chowder in a bread bowl is a must.  It is a quick service, you go up to the counter, order, pay and get your food on a tray and find a seat in the large eating area.\n\nRecommend for people visiting SF.  Great bread!", "author": "Gwen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "Right off Geary on 10th - FRESH OUT OF THE OVEN sourdough made on the premises. After you've had the sourdough here - you are spoiled forever. You can't go wrong with any of the bread they have - in fact - because everything is made on the premises AND you don't have to deal with all the touristy stuff that goes along with it if you were at Fisherman's Wharf.\n\nThey also have excellent croissants - and everyone knows about the ham and cheese croissants because if you don't get there before noon - they are gone. And fresh ciabatta??? OMG. No ciabatta is the same after you've had it here.\n\nThey also have excellent almond macaroons - not as good as Dianda's - but they are three times bigger and a little sweeter. You can get them plain or chocolate dipped. Sourdough bread lovers - this is a no-frills store that's a part of their bakery - excellent breads and the sweets I've had are comparable - a bit of real San Francisco right here.", "author": "Dee Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "Cute little bakery. We got 2 bread bowls and an Italian sandwich. The tab came up to just under $20 which was great. \n\nThe bread bowls were yummy but the soup wasn't as hot as I wanted it to be. There aren't any seats inside so we grabbed a seat outside. Good thing the weather wasn't too cold. \n\nWould go back.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "I just had to visit Boudin for clam chowder in one of the Boudin bread bowls. The bread is very tasty, but I concur with other reviewers that it is possible to get better clam chowder nearby, for example at the Hog Island Oyster company that I reviewed. I visited twice and during my second visit, it was quite windy. The seating is outdoor with warmers set up near some, but not all, of the tables. It's unfortunate that there is no indoor seating for those days when the weather is not cooperating, which caused me to remove a star. There is indoor seating only for the Bistro Boudin restaurant upstairs.\nStill, no visit to San Francisco would be complete without tasting some bread from Boudin.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "so so good! the sourdough bread is delicious. i especially love the clam chowder in a sourdough bread bowl :) that is my kryptonite! i've been here twice. the restaurant was nice and eating on the second floor had a great view. there's also a location at the airport that tastes just as good and is a convenient place to go while waiting for your flight. they even have bread shaped like teddy bears which is just adorable!", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "If you like bread, you'll love Boudin! The sourdough bread was the BEST! They totally skimped on the clam chowder in the bread bowl but other than that, no complaints. Order the pizza with sourdough crust - so good!!!\n\n(The wait staff was less-than-attentive but the bread delicious)", "author": "Leann C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-13", "description": "Back in the day (we're talking 1990 and 1991), one of our many  roommates would bring home yummy sourdough bread to feed the poor (i.e. Us, his lovely roommates).  We scarfed on the bread like there was no tomorrow-- it was awesome, really hit the spot, and was a great late night snack.  \n\nCome to find out, our roommate was getting said yummy bread from Boudin's dumpster at this particular location... Boudin would throw out the old stuff they couldn't sell anymore (not sure how old it was, though?) and trusty roommate would somehow retrieve the loaves to bring back to our loft.  Now, I don't recall ever seeing him in the act (honest!), but it must have been a sight... Wonder if he actually got in the dumpster (ALA dumpster diving)?  Or did he just reach in and grab the loaves?  I have no clue... I'll try to imagine that the dumpster was pristine and oh so sterile inside... \n\nOh hell... \n\nWell, I never got sick after eating the bread, so...\n\nWhatever the case, thank you Boudin for your charity all those years ago! :)", "author": "Janette M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "The windy, cold SF weather and the recent indulgence of asian foods directed me here. I ordered the clam chowder and a sourdough bread to take home.\n\nThe clam chowder was hearty, yummy, bread bowl. I never had clam chowder, or even clams before. I was a little hesitant of even getting it, thinking it may have that seafood taste. Thankfully, it didn't. It tasted like a nice hearty soup that happened to have chunks of seafood inside. Something you'd get at a sandwich shop. Nothing mind-blowing, but a nice hearty soup for those rainy days. It's a good portion for the $6. No regrets.\n\nI've tried a few breads from here too. Although good, none of them retain softness. The sourdough bread I bought was good the first day, but became extremely tough the next. This seems normal for these tough kinds of breads, but I can't buy them because of that. I alone can't eat an entire loaf in one day! I didn't see many (or any?) longer lasting breads on display. I'll have to order breads from another place.", "author": "Rahil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "Chowder bowl is excellent and so are the SPICY BLOODY MARYS!", "author": "Ann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "The crab bisque bread bowl is my favorite thing here. They also have clam chowder, tomato & a couple other good soup bread bowls here. This is a good place to get fresh hot bread & buns of all kinds. Stopped here many times on the way to picnic in Golden Gate Park.  Service is fast and friendly. It's pretty easy to find parking. Cheaper to buy a loaf of bread here than most stores. And they will even slice it for you.", "author": "Ron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-12", "description": "I did some perusing of other folks' reviews on here. I feel it's my Yelpy duty to do some clarification. \n\nThis red brick building nestled between Geary and Clement is not your standard run of the mill Boudin you pop into in tourist ville or the mall. There is no huge lunch menu. This is a big ol bakery that just happens to sell a couple of lunch nibbles as well as all sorts of yummy bread. You can also get some coffee and a cookie or a pastry if you are in more of a snacky mood. The main purpose of the building is to bake and package bread so the holy yum yum smell of baking bread wafts up and down this little corridor of 10th Ave. The majority of their wares are under $5 making it a stock up stop for those around the holidays or traveling out of town. \n\nThe lunch item menu is simple. Turkey and Havarti, The Italian, clam chowder in a bread bowl and cheese foccacia bread comprise the entire menu and they sell their offerings until they sell out. I have enjoyed all three, just for a change of pace to the other surrounding offerings. Plus I dig the clam chowder. No lie, I love getting this to go, eat the chowder and the top of the bread bowl for lunch (the chowder's thoughtfully provided separately in its own to go container to prevent sogginess prior to eating) and then eat the rest smothered with the butter also thoughtfully provided as a snack later.   \n\nSimple pleasures folks, simple pleasures.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "I've avoided Boudin's in the past because I only new of the touristy ones downtown and at the warf. I love this little shop though. I went on a Sunday afternoon, there was no line and their shelves were full. The cashier was helpful and friendly. Next time I have out-of-town visitors this will be the Boudin I take them to.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "Good food,  good staff,  ok prices. A little too formal for my taste.", "author": "P C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-13", "description": "Don't be lazy and buy Boudin bread at the market, this place is a stop point for true locals and is not at all like the other glamourized Boudins you find elsewhere.  A small shop, but worth the little trip to get here to bring home the best sourdough ever made.", "author": "Emy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-23", "description": "A great place for clam chowder in a bread bowl with a nice sitting area inside.  The bakery was awesome, with their machinery gadget thingamajiggers transporting the bread from one area to another.  \n\nThe price is decent, you can get a bread bowled clam chowder for about $7.00.  \n\nThe restaurant upstairs was another story however, as my boyfriend and I were actually planning to have dinner there.  However, after about 15 minutes of being seated and not even being acknowledged by the waiters, we decided to just head back downstairs for some clam chowder.  Which left me heartbroken because we had taken the train from Mountain View just for some CALAMARI!!! Waaaah!!!  Haha...and I didn't understand why we weren't at least greeted..there was only a handful of people in the restaurant at the time.\n\nOverall, an okay place.  But I like other restaurants on the pier much better.", "author": "Rei S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-20", "description": "A pretty cool place for tourists.  \n\nWent with some friends from out of town and it was pretty enjoyable. Really decent clam chowder in sourdough bread bowl.\n\nNot too pricey either. \n\nNothing particularly stood out about the place. Like I said, the food was enjoyable... But it's not above average. The service was okay... nothing you haven't experienced if you've been to any other tourist attraction type place. \n\nBottom line: I would eat there again. However... I would not wait in a long line for it. \n\nWas a good experience overall. It's fun to play tourist every once and a while!", "author": "Andre C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-18", "description": "I wish other parts of the US made sourdough bread this delicious.  When I first moved to California, one of my first introductions was to Boudin.  This bread screams, \"EAT ME!\"  Not only can you watch the bakers make the bread in all shapes, sizes, and animal shapes, but you can eat the fresh-out-the-oven bread as well.\n\nMy family came from Chicago for my graduation.  Without hesitation, I took them to Boudin.  On our flight back home, my best friend had TWO bags filled with sourdough bread.  Apparently, the #1 souvenir from San Francisco is sourdough bread.\n\nNow, I'm back in Chicago and all I want is some darn sourdough bread.  I don't want just any bread, I want BOUDIN bread.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "Delicious clam chowder on sourdough bread bowl, watching the sunset and listening to the street guitarist. I really liked this place!", "author": "Tae K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "I love this place!!! I have been going here since I was 5. My sisters would go get sandwiches and calm chowder for us all. They have the best clam chowder ever! I also love sourdough and getting a loaf bringing them home and eating it with butter!!! It's a small place so take your food togo.  I still keep coming and plan to keep coming as long as its over.", "author": "Annie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "Some of the best chili and clam chowder that I ever had in town. Worth every penny.", "author": "Lindsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "awesome tomato soup bowls, great sandwiches too! just try to get a seat", "author": "Hooman N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "You don't give this bread five stars you deserve to be slapped and driven out of the CIty. I'll let it slide for the touristy stuff elsewhere, but as one of the hearts of the City and bread central there is no other sourdough that compares. I'd sleep with a 2lb loaf as a pillow.", "author": "Tristan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-30", "description": "I love this place! A true SF landmark.\n\nThis year (2010) in some stores they are selling a sourdough loaf  with the inscription \"SF Giants\" across the top!\n\nIt's fun to bring one of their designs to a dinner table. Next time you have a pot luck dinner, announce \"I'll bring the bread!\" For best flavor, buy your bread the same day.", "author": "Xavier A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-02", "description": "The clam chowder was ok and the bread was fresh.  The sandwiches are a rip though, while the cookies were tasty.\n\nThere's not much in the way of seating, just some small tables with a handful of chairs outside.\n\nThe staff was very nice.  We saw some of the workers give some homeless people some free loaves of bread.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-24", "description": "Dude.. isn't like Boudin's known for their fucken Clam Chowder in a bowl? So why don't you make more of it instead of selling out during LUNCH HOUR! Walked in, staff gave me NO attention until I gave her a \"are you fucken looking at me or what\" look.  They she decides to greet me while doing whatever it is that she was doing on paper, and says \"Can I help you?\" with an ATTITUDE! All I ask is for a clam chowder bowl because I was sick and craving clam chowder! \"No, we're sold out.\" Are you kidding me? Sold out? Then I left and had to settle for Safeways \"Campbell's Select Clam Chowder microwavable soup bowl and a french roll from their bakery. Thanks a lot Boudins!\n\nI do like their clam chowder in a bowl though, when they DO have it.", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "Who knew that SF Sourdough somehow tastes differently than East Coast Sourdough? Not me. Until my mother-in-law informed me of this tasty tidbit on her last visit. She absolutely loves SF sourdough and detests anything that tries to resemble it. She loves it so much that she consumed multiple loaves on her last visit here, and took two home with her in the suitcase. I obviously married into the right family..carb-lovers like me!\n\nSo I was jazzed to find that Boudin in SF has a 'bread of the month' club. It's expensive for bread...thanks to the 2 day shipping and all, but the ecstatic phone calls and little love notes from my MIL make it all worth it. \n\nI've used this club for over a year now and the bread always arrives to her nicely packaged, they send it 2 day so it's still very fresh.They have a few types of clubs...but we just get the standard 2 long loaves per month. Too bad they don't have a 4 loaf version, I think she'd cry with happiness.\n\nSuper easy to use website (www.boudinbakery.com) and ordering process, notifications each month when a shipment goes out and my card is charged. They mention that most of their bread is baked at the 10th Ave location, hence the review for this Boudin even though I originally ordered online.\n\nLove this service, but not quite as much as my MIL loves her Boudin SF Sourdough shipments.", "author": "Mara T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "This location closes at 6:30pm.  I arrived at 7pm.  FAIL.  The smell of sour dough was so strong...and delicious... I was salivating...\n\nMy sister and I made eye contact with the only employee left inside, and he actually came out to talk to us.  The conversation went a little like this:\n\nKatherine C. & Sister:  \"So you're closed?  Is there anyway we can get some bread\" (gesturing to the shelves of bread just through the open door)\n\nOld Italian Man Employee with Thick Accent: \"There's a pillow in the street...blah blah\"\n\nKatherine C.: \"We can just take a loaf of that bread on the shelf? (as I reach for it...I swear that's what he said, I seriously couldn't understand his accent...)\n\nOIMEWTA: \"No, there's a pillow in the street, someone has no pillow to sleep on...ha ha ha...I'll be right back\"\n\nKatherine C. and Sister:  \"Wha?\"\n\nAfter a few minutes our Old Italian Friend returns carrying out this HUGE loaf of bread...like Ginormous.  As he hands it to use, we graciously say, \"Thank you, thank you, how much is this?\"  To which he just waves his hands and says, \"For you, nothing.\"\n\nThis guy seriously made my day.  A free loaf of delicious HUGE bread definitely made the fact that I had to stay late at work OK.  Thank you old Italian man, YOU made my bummer day a little happier.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-27", "description": "It's Boudin. Its a tourest trap, but its alright.", "author": "Carlos M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-16", "description": "WOW couldn't believe that at 11am on Saturday there was no one in a huge line forming to get this real san francisco treat. this is the place to get the freshest, sour sour San Francisco Sourdough bread for $2.50, and ask for them to slice it for you. Seemed as if people in cars were jamming to get to the myriad Asian style restaurants in the neighborhood..or had they already come out early morn to get the bread for the picnic basket for Bakers Beach or Wine Country? Prices are amazingly good for some huge breads that I will have to try next time.\n\nRemember that it is more the Bakery than it is the cafe and if you have the craving for the cafe lunching it is probably better at their other sites.\n\nThis bread is soo perfect for the sandwiches i make for the week to snack on instead of relying on all the preservative filled bread at the supermarkies.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-02", "description": "Craving clam chowder in a bread bowl for lunch, I drag a couple of my co-workers to this Boudin location.  (Used to frequent it quite often, but am trying, yes trying as the operative word there, to stay away from excessive carbs.  Usually just a whiff of the bread smell walking a block away from the store is enough to get me inside to buy a pastry or two.)  It's a pleasant little shop, and I stress little cause there's no where to sit inside.  I love their breads (need to try their chabata though), baked goods (the chocolate croissant and fruit tart are my faves), and clam chowder.  I ALWAYS get it in a bread bowl because I love scraping some of the inside of the bread bowl to accompany each bite of chowder.  My only gripe is that often times there are too many potatoes, and not enough clams.  \n\nI think this location would get  the final star if it was a bit bigger and had at least three or four tables inside...the seating outside doesn't cut it for cold winter days (or cold days in spring and summer for that matter).  But consistently good chowder and baked goods with decent, quick service keep me coming back.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Love the sourdough bread and the breadimals are magical! Lots of delicious food to choose from and the smeeelllllllll! Great place to bring kids as well as you can watch how the make it. Great experience!", "author": "Denise J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "Great Chowder bowl thanks to fresh bread the comes from the bakery on a lift.\nMy visit was at 11pm and a hot bowl with a beer out side by the fire was great.\nMany breads to choose from. Just a great place to eat.", "author": "Ocra G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-07", "description": "If you're only hankering for just clam chowder in a bread bowl, then this store is for you...strictly a coffee/muffin/bread/clam chowder offering.  There are some outdoor seating, but not meant for giant groups.\n\nThe plus of this place is that there's not a lot of tourists, it caters only to locals who just need that spot of sourdough goodness.\n\nThe servers were nice and helpful. The bread was hot and out of the oven. And offer only 2 choices for sandwiches for the small cup of soup with side of sourdough bread. Street Parking is not as hard as say, Clement, but it can be sometimes at night. \n\nAbsolutely helpful for those really foggy days that we have 90% of the time in San Fran. And it goes down like a great cup of joe.", "author": "Pauline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-30", "description": "If there's one thing that I love it's bread and lots of it.  I like to be filled up with carbs galore!  Boudin is an especially cute place in the heart of Fisherman's Wharf in San Francisco.  It was a must-see (must-eat?) for me and my friends.  My friends had clam chowder soup bowls.  I had a grilled cheese on their sourdough. Thumbs up all around.\n\nThe interior is super cute and friendly. There are lots of souvenirs and a variety of bread animals - if I wasn't visiting, that bear shaped bread loaf would be coming home with me stat!  There's bread floating in crates over your head. It's just a cool spot to go to if you're hungry. And now I'm getting hungry.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "FOOD - 5 stars - Can't get any better than Boudin's clam chowder bowls. :) I'm not a sour dough fan, but with their clam chowder, I can't resist. \n\nRESTAURANT  - 4 stars - It's more of a tiny cafe with only a few seats outside. Great place to get a to-go lunch especially if you don't want to drive to the mall or downtown to get Boudin's.\n\nPRICE - 4 stars - Decent price.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "Beautiful little place with wonderful croissants and delicious clam chowder. It's been here in like forever, and still manages. But then again, it is BOUDIN. \n\nI used to live by this place and never gave it much attention. But reminiscing back on the old days, I can picture it in my head. And that is why I love it so much. This is located a little off to the corner of Geary (very much able to be missed, if you can't read the big letters BOUDIN painted on the wall above). But on a sunny day when the angle of the sun is very specific, the light hits it just right. PERFECT for late morning breakfast, early lunch or supper (yes, its been too long for me to remember what time that angle is).", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-24", "description": "Good...but not great.\n\nI guess I was so looking forward to the \"best sourdough bread\" I've ever eaten.  I had heard that from a few people.\n\nThe bread I got was cold and hard.  Maybe I just was there at a busy time and I got unlucky.  I won't bash them too hard until I try for a second time.\n\nI hear for the best \"bread experience,\" you need to go during the week when it's less touristy.  My girlfriend had the clam chowder...it was pretty good.  I had a sandwich (pesto chicken) and it was delicious.  Too bad the bread was hard.  Ugh.\n\nI will try again next time I visit.", "author": "Devin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "Would definitely visit again if I'm ever in the area.\n\nI went there with a couple friends. We were just walking around and got hungry, so we decided to stop by this place since it's pretty reasonably priced. I got the clam chowder bread bowl - my first time ever having a bread bowl (deprived, I know), and it was DELISH! Probably the best sour dough bread I've tasted.\n\nThey also have really nice display (sour dough crocodiles, sour dough snowman, etc). They also have stuffed animals going around the place in little baskets - so cute!\n\nOverall:\n4 stars for good food and good price", "author": "Melody Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "YUM! Love this place. Only bad part is I get really hungry when I walk past it and they are baking fresh bread.... help", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "The sourdough clam chowder bread bowls are amazing!  There are a few different locations, but we went down to the one at Fisherman's Wharf. It's marginally more expensive than the places you can get chowder on the street, but it's totally worth it.", "author": "Tamiko T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "Damn homie, this franchise on the West Coast, DOES IT RIGHT! There's love in every bowl of chowder. And the sourdough bread bowl (I could chow down on that stuff on its own!), definitely takes it up a notch! To add, it's always a fun sight to watch them making a variety of fresh bread; if your watching through a window, I swear you can smell it baking! Perfect on a chilly West Coast afternoon. Loved it, happy it's on almost every corner,  and I will be back! :)", "author": "Savannah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "I used to come here to get bread with my mom when i was a kid over 30 years ago. The bread was great then and it's great now. Fantastic sourdough! I love their turkey and havarti sandwich on a sourdough roll. Very tasty!", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "I am a puppy with my head out of the window everytime I pass this place, day or night. Awesome... and way better smelling than the vagrants who hang out at the Jack-in-the-Box which is destroying my neighborhood... but that is neither here nor there...\nThis is the best place to get bread or a snack; my husband swears that their ham and cheese croissant is the best he has had outside of France... And even though you may only be spending two dollars, you still can use your credit card.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-12", "description": "The odor of sourdough wafting through the 'hood....doesn't get more mouth-watering than that!  This is definitely the best sourdough bread in the Bay area.  It's reputation speaks for itself!\n\nSidebar:  Once, when I was picking up dog food for Rocket Dog Rescue(www.rocketdogrescue.org) in San Leandro, the guy loading my car spied the lonely baguette peeking from the back seat.  Darn if I didn't get some premium dog food for the rescued doggies after that swap!  \n\nI have to say that I am over the fancy-schmanzy coffee drinks, just give me a cup o' joe with real half and half.  And Boudin's has that good cup of coffee for only $1....quite the deal, I must say.  Of course, you spend more money on bread so it must offset the coffee price.  And a slab of cheese focaccia for about $2! \n\nAnd they also do mail-order, so if a loved one is craving SF sourdough, order them a box of good San Francisco goodness.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-15", "description": "It's fresh sourdough bread that is made by what I can only assume are the gods and goddesses of baked goods themselves. \n\nPerfect as French Toast. \nGrilled Cheese. \nSoup Sopper. \nToast. \nOr just untoasted slathered in butter.\n\nGo nowhere else. This is sourdough made by the GODS.\n\nI love that this place is close to home so I don't have to wade through the tourists downtown or at the Marina.\nIf you get bad service, it's karma.", "author": "Desiree V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Wow. I really wish they had one of these in Chicago.\n\nWhile on vacation in San Fran we were looking for a cheaper, yet filling & yummy breakfast. Boudin most certainly delivered.\n\nMy fiancé had some sort of egg & chili scramble thing in a sourdough bread bowl. Although that's not my style, it looked amazing. They even gave toast the scooped out portion of the bread bowl & serve with butter. Carb overload but so worth it!\n\nI had an egg white sandwich on toasted sourdough, dusted with parmesan , with bacon & havarti. HEAVEN.\n\nNext time we're back in this city, I will definitely be dining here again. Would love to try their lunch sandwiches!", "author": "Mollie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-27", "description": "We took a spontaneous weekend trip to San Francisco this past weekend (May 29 to May 31, 2011). On Sunday, after walking all the way from Lower Nob Hill to Pier 39, we were hungry and decided that we wanted clam chowder in a bread bowl. We had seen pictures of them all day so being that is was cool out, chowder sounded great. \n\nWe decided to try Boudin near Pier 39. We were looking for something a bit more upscale and Boudin looked the part. The pier overall was a little quieter being that it was Sunday night around 830ish so when we walked walked past the sourdough bread factory and went upstairs to Boudin I thought we were in for a treat. The restaurant was very slow yet they made us wait about 15 minutes before being seated. Our server was Samuel. Right off the bat, they were out of the \"petite chowder bowl\" and the \"large chowder bowl.\" We instead ordered 2 medium bread bowls. She got the corn-chowder and I got the clam chowder. The chowders were pretty tasty, creamy, etc as was sourdough bread but it wasn't enough for the price. $23 for both bread bowls and a soda. \n\nWorse yet, was the service. Samuel was inattentive and was clearly favoring another table as I saw him make at least 5-6 trips to check on them for an extended period of time. I guess they were his friends or regulars. I don't want to sound like a complaining baby, but we would have liked at least ONE refill on our drinks. Lastly, he literally *tossed* the check on the table (I'm pretty sure the bill-plate bounced) and bid us goodnight and kept walking all in one motion. \n\nSo, my advice is to skip Boudin and try one of the mom and pop restaurants on the pier next time.", "author": "Don M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-14", "description": "For someone who grew in the city, Boudin equals the meaning of sourdough. All other sourdoughs, especially those not made in the city, just seem to fall short, and fall hard. Boudin gets it just right with the crunchy crust and soft, doughy inside. It truly is some delicious bread. This Richmond location provides all your needs and at really great prices. If it's a holiday, make sure to go early or order ahead of time for pick up.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-22", "description": "What can I say? If you're craving some clam chowder or need some fresh bread, this location right in the inner richmond makes it easy to avoid the traffic going downtown and to stay away from the tourists. It's not my favorite location as it closes early but it's still pretty good.", "author": "Petra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "I love the sweet baguette here.  Every so often I would come here to get a sweet baguette sliced.  The bread sticks here make a good treat as well.   And when I want an extra treat, I grab a few cookies as well.  They are always super friendly here and parking is usually not a problem.", "author": "Stella C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "Pastries are fine.... Nothing special. I should have just gotten a loaf of sourdough, it sounds like.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-09", "description": "Boudin bread, just how bread should be.  Crispy exterior, crunches beautifully when you set your teeth into it with micro bits of the browned crust flying into space like invisible aerial plankton waiting to be devoured. Chomp, chomp.  Soft, airy, white interior with that \"out of the oven\" smell.  Ooooooh, hard to walk by without wanting to get some.  I miss their Harvarti cheese bread, they used to take 1/2 slices of the bread and slather creamy Harvarti cheese on it and bake until the cheese would ooze over.  Just heavenly. \nNow I have to get the bread and make it myself at home. * Sigh*\n\nLove the clam chowder too, a bit too much carbs when you order the bread bowl with it but so delish when you're eating it.  It's one of SF's gems.  I was at the supermarket one day when a tourist from near Reno was going up & down the aisle looking for Boudin bread & had to take some home for dear old mom.  They were willing to drive all the way back to this store to pick-up some because they didn't know where was the nearest Boudin's.  That's how famous this bread is.  Just crunchiness delight.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-27", "description": "This bread factory had good bread and sandwiches, but the chowder was hurting!\nIf you do end up eating here make sure to check out the glass display where you can look at people making bread and the interesting bread creations of aliigators and other things that, had they not been bread, would never make it in my stomach.", "author": "E C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "stopped by for a quick san-francisco lunch: \n\nBOUDIN SOURDOUGH BREAD BOWL ($14.95)\n\nchoice of: crab&corn chowder  or  traditional clam chowder\n\nmy pick of the day was \"crab&corn\" chowder.\nit was good~!! felt like it could've used a little more soup \nand less bread but nonetheless, yummy it was!! result,\ncame out with full content belly.", "author": "patricia n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-25", "description": "You know I really want to like this place but to be honest its just \"A-OK\". \n\nThe food here is always lacking to me, I have been to Boudin 3 or 4 different times and I am always lightly disappointed with my food, IDK maybe its me. My partner definitely likes the food more then I do, but this is not his review so that doesn't matter.\n\nOn the other end of the spectrum the service is definitely this places saving grace for me. The waiters are attentive and quick, which is an \"A+\" in my book, be nice and serve me quickly and I am a happy camper!!!", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "I strolled in one day on the way home from the library, and bought a round of the \"garlic volcano.\"  I was not disappointed - that was some good, pungent stuff.  The smell of Boudin bread often permeates the air in this part of the neighborhood, and if you've ever eaten at a Boudin and thought, \"Damn, this bread is good!\" well, this is the source!  Though it was an amusing sight for me, I think it's a testament to the quality and consistency of their bread when the regulars appeared quite anxious to get their Boudin fix.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-11", "description": "God only knows why they can't manage a chocolate croissant the four times I've tried this place.  The other location is AWESOME and it only breaks my heart more.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "4 stars because its the best sourdough bread around!  1 star off because of the location of this particular boudin's and the fact that there are only 3 tiny tables to sit at. (If you really want a true boudin's experience, go to the one in Fisherman's Wharf!)\n\nI always order the classic clam chowder in a bread bowl. You can never go wrong. Absolutely delicious. The bread is warm, soft, sour and overall PERFECT! The clam chowder is nothing too amazing, but it's the bread that makes it wonderful!\n\nThe staff here is nice, friendly and greet you with a smile.\n\nI will need to go back to try their sandwiches sometime. Maybe even their chili in a bread bowl.", "author": "upper d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-20", "description": "Clam chowder bread bowl was ok. No in door seating and the amount of chowder in the bread bowl was a small.", "author": "Rick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-15", "description": "Meh. No doubt they have a neat operation and I would recommend at least seeing it, but it was way crowded and I thought the bread bowl and chowder wasn't anything to write home about. They are efficient, I'll give them that! But I wish I would have gotten my bread bowl at a less commercial place :) Felt like cattle being herded along. Oh yeah, another reviewer reminded me the mocha I got really was terrible.", "author": "Leah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "yeah i bought a HUGE loaf of bread here the other day on the way to my girlfriends' house. we ate the whole thing by the end of the day. it was so light and fluffy and wonderful. good for garlic bread.\n\nhad some clam chowder which was also kinda good, it was a rainy, cold day.\n\ncheck it out.", "author": "Georgia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-17", "description": "Delicious fresh baked breads! They don't only sell sourdough, but the head baker even gets creative to create some delicious breads. The customer service is excellent, if you're there in the morning you might find yourself having  a conversation with the staff. Best of all, its so close to home if you live in the Richmond. \n\nAnd the prices are awesome, I can get gourmet bread for a week for less than Safeway prices.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "I love come here buy fresh bread. I love flavor of bread so much. The smell of bread make my stomach rumble when  I walk by. I like Boudin so much.", "author": "Elizaveta C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-28", "description": "Probably one of the better calm chowder on sourdough bread. You don't get a lot of chowder but it's definitely good and so is the bread. Also had the grilled shrimp - recommend you try. No meal is complete without dessert so have yourself an oatmeal cookie - totally awesome!", "author": "Vinh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-08", "description": "Everything but their sweet baguettes are wonderful. Send a scout to France please, your baguettes are terrible. That being said the sour doughs are delicious and their Dutch crunch rolls are the best I've ever had.", "author": "M. R. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "I don't know about the food they serve there, but the staffs were really nice.  Especially the girl who was making animal characters out of sourdough bread behind the window.  She was very nice to our little girls and even gave the girls samples to eat.  Thank you for that!", "author": "Easy S K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "Can't drive past this place without picking up a baggette. Yum!", "author": "nathaniel w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "I LOVE clam chowder!!  Its really close to where I live so I usually walk.  The staff is friendly and the place is well maintain.  Got to admit that they don't have as many choices as the other Boudin's but I'm not complaining since they have all sorts of breads, soup, sandwich, and coffee in one place.  My usual oder : clam chowder (they give u a small bread roll with ur soup), jalapeno cheese bread (snack for later), and a cup of coffee.  Soft bread and hot soup...can;'t complain!", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-19", "description": "Every time we are in SF we come HERE! Gotta get our Boudin's fix. Agree, skip the mess at the wharf. And they have all sorts of breads and more. I like the sub rolls and as always the longs. We have crumbs all over the car as we head back to SoCal... but then it just gets mixed up with the sand anyway. Also they have great coffee, always fresh and nice and strong.", "author": "Curt A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-19", "description": "5 stars for the smell of this place.  I can smell it blocks away. This is the Boudin where they bake the bread for all the other stores. The place to go for fresh baked bread, the coffee is not bad, only $1.00, free refills and always friendly service. If I wasn't on a low-carb thing I would be outta control...FYI they only serve 2 sandwiches here a one soup, the clam chowder, but every baked yummy treat you could ever imagine!", "author": "Dee D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-04", "description": "My friend told me that this place had the best clam chowder in the Bay area. I ordered the Clam Chowder Bread Bowl. The soup lacked substance, had maybe 2 pieces of clams and tasted bland. Honestly, Progresso Clam Chowder tastes way better than this.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-22", "description": "Had the chowder for breakfast and the cheese scramble in a bread bowl at the cafe section (not the restaurant)...Great bread, great chowder, scrambles are ok, and the service was stellar...I'd come back again, seems like a fun little mainstay on the pier...", "author": "Benjamin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-04", "description": "This place sucks!   I moved and this was the nearest place to me so I tried it out.  I was so disappointed.  They just have bread, one sandwhich option and clam chowder.  No other choices listed on their regular menus, no pizzas, no chili, no tomato cheese soup....I was terribly disapointed especially after ranting and raving about the caesar salad and fresh croutons..  There was hardly any seating except for outside with the freezing pigeons", "author": "Nikki W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "The bread here is so chewy crusty and still warm unbelievably fresh and yummy I suggest to make your own sandwich don't purchase there not so good, service a little slow when your rushing because you opted for the ten minute parking but overall a great place to get what San Francisco is so known for !!", "author": "Sara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-07", "description": "Only thing worth gettin here is the clam chowder bread bowl and it's good but not GREAT.  I like Ivar's better.  But you can't beat it on a nice day in the city.  Worth the experience.", "author": "Lester A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-04", "description": "This is a really easy stop for those rush, rush mornings.  Parking is easy- a real plus for San Francisco!  There is never much of a line- another plus!  And the prices are very reasonable- a Grande size cup of French Roast will only set you back 1 buck- plus!  Grab a $1.95 chocolate scone or croissant to go with that coffee and it will still cost less than that fancy Starbucks drink alone.  You know everything is fresh since you see them baking away in the back of the small storefront.  There are 2 tiny tables out front if you have a few extra minutes, where you can enjoy this morning treat, while people watching.  Enjoy!", "author": "Judy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-28", "description": "Fun little neighborhood bakery where you least suspect it. Tables outside for you to enjoy your clam chowder in a bread bowl. If I'm in the area and hungry, I know where to go. Nothing like the touristy Boudin on Fisherman's Wharf. The same great sourdough bread though.", "author": "Alexander G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-21", "description": "their clam Chowder is phenomenon!\ni just hope it has more soup in the bun tho.\nnothing is better than having the chowder in a chilly nite!", "author": "Mutsumi I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "really neat retaurant. very fresh crab and great service. Erin the manager was amazing. She was friendly and made us feel like we were part of the family! Good job crew!", "author": "Ryan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-22", "description": "had clam chowder in a bread bowl and Anchor Steam finished off with an outmeal cookie...  I liked the soup and delicious sourdough.  Lots of good sandwiches and other carbo snacks..", "author": "jed p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "This is not likely the 'best' spot in San Francisco to hit up some clam chowder, but its the best available to a wandering tourist.  I like this location because they will sell you an Anchor Steam along with your breadbowl, which is something that the Wharf location does not.  Strange.  Boudin is a great spot to grab a snack that won't destroy the palate between savory meals in this culinary superpower city.", "author": "Maurice G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-04", "description": "I know this is a chain, but their bread is so dam good. Nice and crusty on the outside and soft and chewy on the inside. Dip it in some nice clam chowder and you have a winner.", "author": "Sammy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "I got the bread bowl, which to be honest, is not the healthiest thing you can eat, but it was so good. It's like one of those those \"last supper\" dishes for prison inmates that I could see myself choosing. The chowder tasted fresh and so much better than the canned ones I'm used to eating. Oh, the bread wasn't bad either. I had such a fun time cutting and dipping the bread in the chowder. The price point wasn't ideal, but I left with a full stomach, which is good.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-29", "description": "One of the things that i heard about San Francisco was that they make the best sourdough bread. So I went to the source of sourdough bread baking bliss. Ordered a clam chowder bread bowl and it was way better than the stuff they sell one block away in the street market. Very tasty and fresh. I only wish they would sell the sourdough bread started for baking at home. In two occasions i was told by the Boudin bakery staff and supervisor that they didn't sell it there, BUT, that the Franciscan restaurant next door did sell bread starter. And in both times i was told by the Franciscan restaurant they they've never sold it and have gotten multiple customers come in asking for starter. The Franciscan restaurant staff has no idea why the Boudin bakery has sent people there with the idea that they might sell it there. Other than that, the bread is good, not great.", "author": "Ray B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-14", "description": "My neighborhood may be overflowing with people, kinda dirty, hard to park etc.  But it also has just about everything I need.  Including fresh amazing sourdough bread just down the street.  Can't ask for more. This shop has most all kinds of fresh baked bread you would need.  I stopped buying sliced bread for the week and now I just go here and buy the fresh baked stuff.  Yummy Yummy!", "author": "cece S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-29", "description": "Dude... where else can you get DEE-licious croissants and $1 all you can drink coffee? Huh? Huh???", "author": "Andy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "Love it here! Bread bowl and clam chowder, what's not to like! I would always come here, and get the soup and bread bowl to go and take it home! I love the crabcake sandwich here..., it is the best!", "author": "C M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-11", "description": "The last of the great San Francisco Sourdough Bakeries playing different roles for different people, tourists down on the wharf where they offer a huge warehouse type food operation that also bakes thousands of loaves of their great sourdough.  Then you've got this neighborhood store and airports, so it's hard to nail down their mission and plan, but they do some great things that are vastly different like the hollowed out sourdough round filled with clam chowder at Macy's, the sourdough and other sandwiches, salads, and sntree's at the Wharf and even loaves to take home or on a trip at the airport.  Diversity and a broad vision business plan make this bakery hard to nail down, but their bread is damned good.", "author": "Stu S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "You can sit down and eat Chowder in a sourdough bread bowl. This is the only place you can actually walk into that isn't a restaurant to sit and eat. You can't purchase meals from the vendors on the wharf and take it to these tables either. So if you need a rest come here and get some grub.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "Croissant heaven, plus great place to pick up fresh sandwich rolls.  The only downside is that it's a tiny space, and it's often mobbed by the elderly and people with kids, which can make for a patience-trying wait.  But so worth it in the end!!", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "this place is kinda tricky because its looks more like a factory/distribution center than a nice little neighborhood bakery, but if you look closely on the side you'll see the door and find that it does have exactly what you were looking for. stoping by in the morning is always a good decision. they got all the necessities any bakery would provide and more. i recommend the chocolate criossants, and the huge foccacia that isnt too expensive. the place is mostly known though for their sourdough, which is tasty but not my favorite. if you really wanna experience this place its probably best to visit one of the other locations though.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-11", "description": "very good crabcake sandwich, fantastic bread, and i love their soup in the can... i always get it when im there. i recommend anyone to try this place out if they've never been", "author": "Mike M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-18", "description": "The food is certainly excellent. I wish the hostess would be a little more friendly. When asked if we could have lunch outside we were rebuffed as mentally retarding considering the heat outside. Apparently servers did not want to work the terrace on a warm day. Not much of a terrace there there, but I understand the concern. I just wished the hostess would have been less rude in communicating that info. Boudin's loss, cafe Gentil's gain.  We moved down the street and had a great lunch in a very friendly atmosphere. Boudin is of limit for us until they improve their greetings .", "author": "S B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-22", "description": "This one is different!  Ok, I know you've been to the one at the wharf but please, don't give up!  This one is waaayyy out in the Inner Richmond and there are no tourists believe me.  They bake the bread right there (I can smell it at my apartment and you can get just bread and leave or have lunch too.  Service is great, food is great and the bread just can't get any damn fresher than the ovens from the next room.", "author": "Misti L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "it's good. it's cheap, but i dunno...i just don't think it's 5 star worthy.  too small...i do enjoy the clam chowder bowls, though.", "author": "joseph k."}
