{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "REOPENED AFTER RENOVATION!!! \n\nFast and tasty neighborhood treat! Looking better than ever after renovation, and the food is still #1! My roommate and I definitely missed Buffalo Burger! \n\nTry it Out!", "author": "Nick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "Wings and burgers are a must. Fresh and juicy th.  Nice friendly staff and a neighborhood gem. Great burgers and nice small restaurant.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Solid lunch spot! Ordered a bbq chicken burger with everything- lettuce, tomato, pickles, purple onions ($7.25) and side of French fries ($2.50). Chicken size was kind of thin and not too much bbq sauce, which is good because I don't want a soggy bun. Very friendly and fast delivery of food. Even during Friday lunch there seems to be spots to sit, although a bit cramped. I'd come back to try the fish and chips.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Wings are great-burgers are great and so is the service. Been coming here for years. Highly recommend!", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Found this place by mistake. A lot of options. We ordered completely different things and they were equally amazing.", "author": "Brittany Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "Came here to try their pastrami and cheese sandwich, but it turns out they ran out.. & there's a minimum $10 for credit/debit.\n\nInstead, I settled and tried their infamous wings. I got the 6 bbq wings  that came with celery, carrots and ranch. I also ordered a side of chips. This came out to a little less than $10 and the guy was nice enough to let me charge it on my card.\n\nThe bbq wings were just okay, there was not much meat on my drumstick or wing and the bbq sauce barely stuck on. It was just mediocre. \nOn the other hand, the side of chips was tasty! Thinly cut potato slices fried are actually pretty good if you are craving chips instead of fries.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I love buffalo burger!! Me and my boyfriend come here a lot for wings and fries/onion rings. \nEverything here is super good. I love getting the Cesar  salad too usually. The people that work here are great and are always super friendly to us!", "author": "JR E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Fast simple and tasty burgers. Great fries and coleslaw. Fish and vegetarian options also available.", "author": "Greg P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "A no frills basic burger/wing/sub shop, this place is one of my old reliable go to spots whenever Im in the outer richmond. They finally reopened after renovating and the new interior looks nice. As far as the food its still good as I remember. The wings are crispy and well sauced and the burgers are solid. Now this isn't the spot for fancy food but for the prices its a good value. The service here is always friendly and it really feels like a neighborhood joint.", "author": "Peter P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "Super over rated!  Maybe because I worked across the street for a year.  Small burgers and sandwiches.  Tried most of the menu and was never thinking wow!  That was great!  I mean it's not bad, but nothing special at all.  Go to lous sandwiches down street.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Here's the thing: if you're hanging out in the Richmond and you want a bite to eat that won't make you broke as a joke, as well as some fried goods to soothe those craves then this is the place for your face", "author": "Yasmin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "We used to live a couple blocks away, and it was definitely our go-to burger spot.  The same (hard working) man takes our order, regardless of the time or day of the week.  Orders always come out perfectly, even with substitutions.  \n\nThe food is consistently great!  We've had the hot wings, beef burgers, turkey burgers, fish and chips, chicken strips and (plenty of) french fry variations - and we love them all.  Everything is made to order, so yeah, you have to wait a few minutes for FRESHER food.  \n\nWe've since moved 20 blocks away, but when we return to the neighborhood for other errands, we almost always choose to eat here.  Thank you Buffalo Burger! :)", "author": "Marisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "One of the best local burger places I've had. Quality food. Great service. Owner brought the food to our table and made sure we were doing ok. The garlic fries are so delicious they remind me of the ball park fries.", "author": "Suzan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "According to a Buffalo phone recording, starting from March 7, this joint will be closed for 2 weeks for renovation.", "author": "Yvon Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "The best Burgers in S.F. The onion rings garlic fries and our burgers are definitely worth writing about . BUT i was also so impressed with the fast friendly service . I was visiting for medical reasons , and the cashier woman seeing that i was recovering from a surgery , ontop of being super sweet , she went above and beyond to help me and bring everything to ur table took our second order at our table brought me change . . I WILL definitely Be back . Its my new fav spot in S.F OH and i guess they remodeled recently and it looks super fresh and Nice and clean", "author": "Christien B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "I ordered a 2pc. fish and fries take out order brought it home to eat. It runs $8.95 including tax. Still delicious but somehow I remember the fish fillet being meatier, it was mostly batter around a skimpy piece of fish flesh. The size of the fish fillets has really shrunk or maybe it was only my two pieces that were skimpy? Compared to some other yelp photos , I would hv to say I got the skinny ones ,also they were a tad over fried imo. Fries were good and crispy tho. But still okay around the Richmond neighborhood.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-21", "description": "I decided to try Buffalo Burger because its in the neighborhood and the reviews are good. I'm not sure whether it was just an off day for them or what but I really wasn't impressed with the food I received. \n\nI ordered their \"ultimate burger\", which is a cheese burger with avocado and bacon, and they served it to me on *white sandwich bread*. Did they run out of burger buns? I don't know, but when I got home and opened my takeout bag there it was, all the fixings of an ultimate burger: patty, cheese, lettuce, tomato, onions, bacon, avocado, and condiments sandwiched between two slices of what looked to me like wonderbread. \n\nWhite bread is much more thin and weak than a bun and accordingly the sandwich was soggy and within the first or second bite the whole \"burger\" just completely fell apart. Clearly there's a reason burgers are usually served on a bun: burgers are too greasy for sandwich bread.\n\nI'm guessing they just ran out of buns that day or something, but they should have at least told me and not just thrown together a burger on sandwich bread. The burger in their pictures is definitely on a sesame bun. What happened with my burger? \n\nOrdered garlic fries with the burger which were also very soggy. Soggy \"burger\" on white bread plus a soggy little bag of garlic fries made for a pretty disappointing meal.", "author": "Tomas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Pretty well priced. The fries are fresh cut. Decent burgers and fried fish. The place is now closed but I hope they reopen soon and without the usual dramatic price gouge.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Gotta love Buffalo Burger on Geary! Their 26 piece hot wings are the bomb, and allot closer the O.G. Buffalo Wings on Lombard. Burgers are good, as well as the Shrimp. I always go back here for Sat night take-out and movie night!", "author": "Enoch K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "Lazy Sundays. That's what happened on September 13th. The roommate and I ordered delivery for dinner through DoorDash. We ordered around 5:45pm and our food arrived around 7pm.\n\n*Bacon & mushroom burger: 6 oz of choice ground beef, lettuce, tomatoes, onions, pickles, ketchup, mustard & mayonnaise served on a toasted sesame seed bun ($5.95), add Cheddar cheese (+$0.95)\n*Ultimate burger: bacon, avocado, grilled onions & 3 kinds of cheese served on a toasted bun ($7.50), add Thousand island dressing\n*Buffalo wings: served with crispy celery, carrot sticks and creamy bleu cheese dip - Lemon pepper & Extra Spicy ($5.50 per order of 6 wings)\n*2 pieces fish: served with tartar sauce and fries ($6.95)\n*Caesar salad: romaine hearts tossed in caesar dressing sprinkled with parmesan cheese, no croutons ($6.95 large)\n*Garlic fries ($2.50 small)\n\nThe burger meat and toppings were good, but their buns are huge! It threw off the bun to meat ratio for the roommate. I didn't care as I didn't eat the bun, but get ready for a bready burger! The wings could have been a little meatier, but they were okay. The extra spicy ones weren't very spicy and the lemon pepper ones didn't have much flavor. And they were rather oily. My favorite part of this dish were the carrots and celery. Fresh and crunchy! The fish and chips were pretty good. Nice and crispy. And so were the garlic fries. The salad was pretty average.\n\nIt took us a while to remember that we also ordered a Chili cheese dog ($4.95) which was missing. I reported it to DoorDash and they gave me $5.38 in credit. No harm, no foul as we had ordered more than enough food anyways.\n\nPretty standard joint for burgers and such. It fulfilled my burger craving, but I probably wouldn't order from them again. Nothing about the meal really stood out.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "Decided to go here to get my wings for the Super Bowl this year. Very underrated wings spot here in the city. Definitely one of the best. I ordered 100 wings the night before and they were hot and ready for pick up come 3 o'clock.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "If you want a reliable burger joint that serves you up a juicy patty, look no further.\n\nBuffalo Burger is nestled near 17th Avenue on Geary and boasts a large selection of burgers, from bacon avocado to Philly cheese steaks. The food is typically cooked on the grills in the back, and you can hear it sizzling while you wait. The meat is always piping hot, juicy, and tender, while the other ingredients are always fresh. Never had a bad food experience here. They've got a ton of condiments to choose from as well, its good news for fans of Worcestershire sauce!\n\nThe joint is pretty small and can certainly get pretty cramped, but the food is worth it. Great place to indulge in a burger for lunch or dinner. The cashier can be a jerk sometimes which is a bit off-putting, but once you get past him, the rest is golden.\n\nBe sure to try the garlic fries and banana shake if you can!", "author": "George K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "Food and experience is amazing found d this place and the menu looks amazing, got the bacon avocado burger and 6 wings and they are so bomb. Definitely will come back here for more next time I'm in the city", "author": "Edward B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "Solid quick burger spot with a lot of other options.  Buffalo wings are one of my favorites here.", "author": "Avery N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Pretty damn good burger. It tastes like it was cooked on an actual grill, as opposed to flavored as such. Such perfectly crafted burgers on a great bun, served with what I can only describe as perfect \"chips\" because these fries are just large enough to go beyond our normal French fries. So friggin tasty.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "I like this little place! Great wings, good prices, and the guys who work their are super friendly. They also secretly have great sandwiches! I had the buffalo chicken sandwich and the chicken was tender, the roll was soft and delicious. Oh, and I LOVE the buffalo chips!", "author": "Goldie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "My go-to place when I'm craving a burger or chicken sandwich. The supreme chicken sandwich is my favorite! Very tasty and the grilled chicken is very tender. Their spicy buffalo and lemon pepper wings are also delicious. Staff are always friendly and welcoming.", "author": "Madeline Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "This might be my favorite fast food place in SF. Usually, I don't go out of my way for fast food. This place is the exception. \n\nThey have a pretty decent size menu with several options to choose from. Burgers, shrimps, sandwiches, saladas, fries... you name it!\n\nI have tried their burger. Which is fine. Better than most fast food places. But their burgers just fade in comparison to the true stars of the show: fried shrimp, garlic fries, and buffalo wings. I also order their greek salad as a way of atonement for my fast food sins. But I regret nothing. Nor should you.", "author": "Andréia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "This place is as good as it gets. The hamburger is the equal of any I've had here in the City and at a much more reasonable price. You get a burger the quality of, say  Burgermeister \nfor about the price of a Whopper. the only  difference between this and the upscale choice \nis the bun, which is fine for what it is, but a sourdough or whole wheat bun (or choice) would be a plus. I consider this place the best deal in the City- at least for burgers. They are so good that I've been eating here for 17 years and I've yet to order anything else (other than the buffalo wings, which are equally good). The fries are steak fries, home made, skin on and a small order is so big that I've yet to finish one when ordered with a burger. Any time I've taken a friend we've split an order and both of us were full. A totally huge bang for your buck!", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "I've been to this place several times as my office is just across the street.  I'm a sucker for fish and chips and this place has decent sized fish fried well without too much oil left over.  \n\nIn addition, I am a fan of the garlic fries.  They are liberally seasoned with their garlic mixture and evenly tossed for good coverage.  I've gone a couple times during the work week just for an order of to-go garlic fries to bring back to my office.  My boss may not enjoy the smell, but that's why we have windows.", "author": "V. Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "The french fries here are awesome, they taste fresh cut, which I think they are, but could also just be awsome frozen fries (as Rascal's in So Cal has).\n\nThe burgers here are okay, nothing spectacular, but not fast food styled either.\n\nThey cook 'em to order, (so you can get a more juicy medium rare burger).\n\nThe meat patty itself isn't necessarily huge, but is fair in proportion to the pricing.\n\nThe buns are fresh and big (a bit too big for me in my personal preference of a bun/bread to burger/meat ratio).\n\nThe fish & chips (we opted for the fries, as they were out of chips the day I visited) were good, 'tho the fish are small seemingly frozen fish sticks (not chopped and formed style, but similar to what you'd get at Costco or from the frozen food isle in a Gorton's Fisherman brand box at the supermarket).  But, nonetheless were good, moist and tasty.\n\nThe service was very friendly and courteous. \n\nParking in the Sunset District is always a slight challenge, and the meters of course are always a bit expensive, so if you have good parking karma and a little bit of luck plus perfect timing, you can usually find something in the adjacent neighborhood for unlimited street parking.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "On a recent trip to SF I decided to stop into Buffalo Burger. I used to live in SF, and I frequented an amazing Buffalo wing place as a kid. I don't remember the name of it, but I loved it... and the sign above the restaurant reminded me of that old restaurant so I chose to give this place a try.\n\nThe menu had quite a few options on it. You can get wings (of course), burgers, hot dogs, fries, and a few other various items. In the mood for wings, I went for the spicy Buffalo wings and the lemon pepper.\n\nI love my Buffalo wings when they have a great tangy taste. It can be spicy and hot, which is fine, but there has to be that unique tang associated with Buffalo wings. These wings were definitely tasty, but were just slightly lacking in what I wanted from a Buffalo wing. \n\nThe lemon pepper wings were on par with the Buffalo wings - they were pretty good, but not great. I wanted a little more intensity in both of these wings.\n\nSo while I did enjoy the meal, I wanted just a little more from this restaurant.\n\nI did like the size of the chicken wings. They are on the smaller size... but that was perfect. Some places use a gigantic steroidal chicken with huge meaty parts. I'm not a fan of that. Now, I don't know what kind of chickens this place uses, but I think they wing size is perfect.\n\nI also ordered some fresh chips to go along with my wings. The restaurant of my childhood offered fresh chips as well, so I had to get these. The chips here were very good, and I enjoyed them very much. It seems like the fries here get some very mixed reviews... just go for the chips!\n\nThe pricing at Buffalo Burger is good, and it beats many of the chain wing restaurants in this area.\n\nWould I come back to Buffalo Burger? If I were in the area and was in the mood for some wings... yes... I would. It's a good restaurant that delivers good food for a good price.", "author": "Luke C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "I went into Buffalo restaurant this evening to order 13 chicken wings three fish and chips. I got it all to go.The wings were nicely spicy, and not all lumpy and gross.  The fries were not soggy when i took them home. The fish were pretty good? I wish the fish batter has been a little fresher but it was still not bad.\nThat whole meal cost $20:12, not bad for a full meal with lots of fresh carrots and celery.", "author": "Paula M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-02", "description": "Small place to hang at a continent location. The burgers are a bit dry and bread is not toasted. Take a good 20 minutes for the food to make. Occasional interruption by incoming customers. Reasonable price at 5.25$ or add 2.25 for buffalo meat. Chicken wings and veggies sticks are pretty standard. Lunch okay.", "author": "Vincent Manjin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-01", "description": "Good burger.  One of the few places I have seen offering a Buffalo burger in California, so if Buffalo is your thing then it's a great place to go to. \n\nThe only problem I came across was that I ordered, and the guy at the cash register charged me 2 dollars extra.  This may have been a mistake though.  Other than that good place.", "author": "George P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "Best hamburger joint in town! I drive half way across town to sink my teeth into one of the juiciest, and tastiest burgers I've had - ever. Really good food, friendly service ((from obviously very hard working staff) even when super-busy)), and decent pricing. I've even told the manager/owner that he should raise the prices. The only down side, is they don't have a beer/wine license.", "author": "James M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-13", "description": "Good food, but terrible service. I asked the guy who worked there if the bag on the counter was our food, but he slapped my hand away and told us not to touch it. He ended up giving the bag to a man who just came in (we came in about five minutes before him), and who was obviously his friend. I am amazed at how rude he was.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "I wish I had taken a picture of my burger - but I ate it too fast.\n\nMushroom burger with swiss cheese and thousand island -- one of the best burgers I have ever had.\n\nI ordered delivery through DoorDash and was very pleased with the flavor of this burger. Honestly, I really can't say enough good things about it.\n\nThe fries were good as were the fried mozzarella sticks. The only way the mozzarella sticks could have been better was if they came with a side of marinara instead of ranch dressing. When did ranch dressing become the de facto dip for everything.  Although I did end up using it for my fries. :-)\n\nI will order from this place again and will definitely stop in the next time I am in the neighborhood.", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "This is our go to place when we want good burgers and awesome chips! My fave has always been the blue cheese or Hawaiin teriyaki burger. The oysters are just ok. Pretty small but I grew up eating oysters & chips from the pier 39 & navy pier so I'm picky with that. We've tried the patty melt and a few other burgers and they never seem to disappoint:) we've always ordered ahead of time and just picked it since it just a few blocks near our house. So i can't say anything about eating in.", "author": "lala d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "I came in early around 11am and no one was there.  Service was prompt & friendly. It only took 10 minutes for me to get my order of:\n\nBBQ WINGS:  the 6  wings were on the small side but at least you know they don't use steroids.  The wings were flooded with this faintly spicy bbq sauce accompanied with  a cool white dip with carrots & celery pieces to cool your palate. Grade=A-\n\nULTIMATE BURGER:The burger was cooked completely, juicy with grilled onions, avocado, cheeses.  I didn't think the bread roll was that fresh, but overall, a good burger for this low price. Grade= B\n\nGARLIC FRIES:  The fries were greasy, but I could really TASTE the garlic on the fries.  Other places just pay lip service and sprinkle dried powdered OLD garlic on top, but here, at least the garlic fries were not that far off from the fries at At&T Park. Grade=A-\n\nCHOCOLATE MALT: I really liked the chocolate malt, haven't had one in a very loooong time.  Grade=A\n\nI have to agree with everybody else that the pricing at Buffalo's is pretty darned good compared to other restaurants in the area.\n\nBuffalo's is a small restaurant (i wouldn't bring more than 1 to 2 people with me) although if you come early as a group around 11am especially weekdays, they can FOR SURE accommodate you. You can also take your food to go.  They accept CC.\n\nWould I come back?  For  sure!! I VALUE my money and the more \"bang for my buck\" I can get from a decent restaurant/eatery, then the better I like it, especially in the expensive Richmond district!!", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-03", "description": "I HAVE NEVER EVERRRRRR HAD SERVICE THIS BAD! \n\nI wanted to know how small is a small order of fries and BONNY, the guy taking my order, shrugged his shoulder and rudely said \"I don't know.\" In my mind I was thinking what do you mean you don't know, don't you work here? Even if you didn't know you should have a way to find out like show me the container it's served in. So I decided to ask him if he can show me the container they served it in. He rolled his eyes, let out a big sigh and went to grab the bag it's served in. After receiving that kind of attitude from him, I told him \"Nevermind, I don't want to order from here anymore\" and walked out. Guess what this guy did next?! He waved bye to me! ARE YOU SERIOUS?! \n\nNever ever coming here again. Yelp really needs to start letting us give places 0 stars because giving Buffalo Burger 1 star is soooo much more than they ever deserve.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-05", "description": "Ordered 50 wings for pick up at 3pm and called 3 hours ahead. Showed up at 3:10 and wings were not done and they said two more orders are ahead of me.", "author": "Jonathan Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "The only reason I won't give this place 5-stars was because the person working was pretty impersonal to the point of being boarder line rude. I walked out telling my friends that I'll probably come back again because their food was that good but the worker was a major turn off. \n\nThey're pretty decently priced. They have a restroom. They have a wide variety of food options. I got their wings and they were great (they don't have boneless wings). \n\nMy friend also ordered some cheese fries and they were spot on. I'll go back for the cheese fries any day!", "author": "Jenelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Ive had lots of good experiences considering I come here atleast once or twice a month and that my school also volunteering place is nearby as well. Id say this is the best burger place. Ive been to for a good price.\n\nNice cashier, good spacing between tables, clean, has a tv to watch news or sport games, good food!!!!\n\nI had the patty melt once, it was really\nGood but doesnt beat the turkey burger that I always get! The patties are freshly made same with the fries. Im not a big fan of fresh chips so I always get garlic fries. Always leaves a smell on me,  but its always satisfies me:)\n\nOnly thing I dont like is when me or my friends ask the owner for ketchup in cups. He gives this stingy face that makes me unhappy about this place. The cashier is nice, but this only happens when we ask the owner. Its kinda inconvenient theres no where to dip your fries unless you drizzle it all over the fries which i dont like to do. Other than that, this place is good for lunch, dinner, or when youre craving a burger while youre in the richmond district.", "author": "Josie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Fast and easy burger joint. Grilled chicken sandwiches too. Fries, onion rings and potato chips to compliment your burger. Inexpensive!", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "Let me get this straight - a cow works out a few too many times at 24HF then hops in a tanning bed for too long, and it mighty morphs into a buffalo? Somebody text Darwin and tell him he had it all wrong. Other than being leaner, drier, and costing over 50% more, I couldn't tell the difference between the buffalo and the beef burgers I've eaten.\n\n3 1/2 stars. 4 for their reliable taste & convenience and because I'm down to go here any day of the week. 3 for their ordinarity and because I'm down to go here any day of the week.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Buffalo Burger is a little gem. The owner is sweet as apple pie, the staff is warm & friendly which makes for a very pleasant dinning experience. \nThey have lots of options which can be great if you have a group who is feeling different options. I enjoyed the teriyaki chicken without veggies. They prepare the chicken to order which is just mouth watering and pleasantly filling. \nMy sweetheart for a turkey burger ala teriyaki burger style with a side of their delicious homemade chips.\nIf your in the mood to have a meal that is hand to heart made with Love, drop by Buffalo Burger... You will be pleased and satisfied :)", "author": "Rebecky L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-20", "description": "I reaaaally wanted to like this place because it was so close to my apartment and it's a small business. So I went in and ordered a philly cheese steak to go. So I get the sandwich and am about to eat it at home when I see a short black hair, UUUUGH! \n\nSo like I said, I wanted to like this place but once I see hair, my gag reflex kicks in. I will not be back to try anything else out.", "author": "Yvonne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "The food was great. My wife and I were walking by and wanted to try this place.  My wife got the Philly Cheese Chicken and I got the Crispy Chicken Ranch Sandwich.  We both loved our sandwiches and we will be coming back again.", "author": "Himesh P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "I really like this place!  I've been three times, and tried three different things (even though I'm vegetarian!).  The fries are amazing, a small size is actually pretty large, and you can tell they make them fresh because you can see the bucket full of fries soaking in water in the cooler.  Perfect amount of soft and crispy. Plus, malt vinegar! \n\nThe first time I tried the grilled cheese. Admittedly, I was a little underwhelmed.  Bread-to-cheese ratio was a little off.  The next time was Christmas Eve, and in this part of town everything had just shut down at about 9pm. I called, on the off chance they were open, and the guy who answered said he'd make my order if I ordered right then. Two veggie burgers, two fries.  Walked on down, and I felt so bad because clearly they were already closed. (Lights out, chairs on tables).  I was sooo happy he made my order for me, because he didn't have to.  The veggie burger is just a gardenburger I think, but at $5 or so each, the price is right.  Just now ordered the veggie philly cheese.  So good. Perfectly sauteed tofu, veggies, and cheese on a soft roll.  Perfect fries again.  I kind of hope the word doesn't get out because the prices are so low, it's almost unbelievable!", "author": "Sara R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Wife and I were hungry for a hamburger someplace different. She went online and found this place that looked decent, but the prices were too low. What the hell -- we decided to try it anyway because the \"health inspection\" score was so high. All that either of us ordered was  a hamburger with mushrooms and although they could have used a few more mushrooms, considering the low price, we were both shocked by how good these burgers were! Everything tasted very fresh and excellent quality. In this town, I can easily pay double the amount (I have) for a burger that won't be as good. So I'll be back. The place was clean and the guy at the counter was exceptionally nice. Excellent hamburger at low price in clean, pleasant surroundings. What more can you ask for?\n\nLooking at some of the reviews below, I can see complaints about some horrible person that used to man the counter. They've probably been fired by now.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "There is something really satisfying and comforting about a good, old fashioned burger... and Buffalo Burger is making some of the best around.  There is nothing fancy or gourmet about this place, they are just making delicious traditional burgers at a good price and executed to perfection.\n\nTHE ORDER - http://s3-media2.ak.yelpcdn.com/bphoto/FEvO7R8w1BDTUp_WibR7NQ/l.jpg\n\nUltimate Burger with a Buffalo Patty - 4.5 out of 5 - Buffalo meat patty with bacon, avocado, grilled onions, 3 kinds of cheese, lettuce, tomatoes, ketchup, and mayonnaise on a super soft roll.  Wow old school burgers really don't get much better than this!!  The Buffalo itself was well cooked and perfectly seasoned.  It is balanced well with the other ingredients.  The avocado is great and works well with the smoke and saltiness of the bacon.  The grilled onions are great as well.  I ended up really taking my time with the burger, enjoying each and every single bit.  I really haven't had a no frills burger this good in a LONG time.  Much better than Bullshead on West Portal.\n\nGarlic Fries - 4 out of 5 - French fries are thick... not quite steak fries but more than regular ones.  They have a very nice crisp to them, probably twice fried.  There is a good amount of garlic topping on them (I actually wouldn't have minded a little more, but I LOVE garlic).  Very well done and it really just felt so \"San Francisco.\"\n\nOVERALL\n\nWonderful experience!  It's the best Buffalo burger I've had thus far.  I really can't wait to come again.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-14", "description": "I ordered a burger and it dropped on the floor but it wasn't my fault and asked if they could've made a new one for me. But they were unprofessional and couldn't even give me a burger", "author": "Martin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "I tried the Buffalo Wings (mild) and the chicken teriyaki  rice bowl. The wings were spicier than I would have liked for mild (low spice tolerance) but still good. The rice bowl was okay, but I recommend leaving out the veggies as they're not good veggies. The veggies are non traditional rice bowl staples in my opinion.", "author": "Adamme K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "This place has one of the best burgers in town. Great quality meat, fresh veggies and much like me, a great bun. \n\nWhat I really like about their burger is the perfect ratio of meat to bun to veggies to condiments. It's a really well balanced burger.\n\nThe menu is big, so there is a little something for everyone. Although if you come and don't get a burger then you will be missing out. Wings are a great side addition here. \n\nGet the homemade chips instead of the fries. Don't get me wrong, the fries are not bad at all, but the homemade chips will make you question your sexuality. \n\nThe owner is friendly and almost always working the counter.\n\nSo go try this Richmond District staple and get one the best burgers in SF.", "author": "Adam N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-25", "description": "\" Meh I've experienced better \" really hits it on the spot.\n\nEating a really late lunch on a Saturday afternoon, this was the backup plan since sushi places aren't open till 5pm. Came in, stared at the menu for a bit and placed our orders.\n\nPhilly Cheesesteak; no bell peppers - It looked so yummy. (And when does philly cheesesteak not sound delicious?) I took a bit into it and was thoroughly confused. The meat was fairly soggy or soaked in juices that wasn't some sort of dripping oil.. a couple bites later I wanted to order something else.. but wasting 3/4 of a sandwich is terrible. I'm not sure what they cook their philly cheesesteaks in but this tasted like TERIYAKI sauce. if you're not going WTH then I will for you.\n\nSpicy Teriyaki Wings - My tongue got assaulted :( We asked for ranch and got blue cheese; which i really just don't like. and my cheesesteak tasted more Teriyaki than the wings\n\nFish Stick Sandwich - My friend said it was good ( +1 )\n\nMaybe i'll stick to burgers next time but I won't be back for a while. My stomach and tongue might boycott food all together after this experience.", "author": "Jenn Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-01", "description": "I walked in and was immediately greeted by the cashier. I placed my order - Chicken Tenders with Garlic Fries (what they're known for and for $.50 extra) he cashier asked me for my name for the order and then proceeded to ask me how my day was; to be honest, I was having a shitty day so the cashier just asking me about my day made me a bit fuzzy, so I dropped in a dollar for the tip jar. \n\nUnfortunately, this good service was short-lived. When receiving my food, there was a miscommunication about what sauce I asked for when ordering (I thought I said BBQ, and was given Buffalo) but it was so petty I didn't mind paying an $.50. But then looked at my fries, and turns out it was regular fries when I ordered it with Garlic so the cashier decided it was okay to not charge me for the $.50 BBQ sauce.\n\nThe chicken tenders were really yummy and had a lot of chicken too - 3 normal but thick pieces cut in half, so 6 were present. The garlic fries though were all sorts of inconsistent - some were okay while others were cooked too long(so biting into them was dry, hard and took about one and a half second to eat since it was really hard), cooked too short, etc. The garlic after eating the whole my meal left a terrible after taste that you can't get rid of until much much later.\n\nI threw about 2/3 of my fries away. And not sure how to feel, but the other table had a little girl with her two parents(I'm just assuming) and was given ice cream for free  (that's sweet of the staff but made me feel a bit left out, perhaps maybe should've waited until a left to do that sort of stuff and maybe would've made more sense to provide me some since I was only given \"free\" but not really free BBQ sauce and forgot my order too) \n\nPerhaps I had given my tip too early - and lesson learned - wait until after my meal to dispense into the tip jar.", "author": "Yeanne L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "They really only get a star because the staff was nice. Otherwise it was very disappointing. \n\nThe person saying this place has \"one of the best burgers in town\" must be on something because that is not even close to a true statement. A double double animal style at In-and-out has more flavor. \n\nI also got the garlic fries and the were lacking in flavor as well as not being fresh. \n\nI was really hoping that this place would surprise me but it left me not wanting to finish my meal.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "Me and my friends were craving burgers and found this place by Yelp. When we arrived we weren't sure if it was the right place for its appearance but were starving so decided to go in.  Best decision of the day! Great variety and awesome garlic fries and the people working there were super nice all the time", "author": "Ale E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "Good homestyle food. Kinda greasy but still delicious. It's pretty cheap so I don't feel guilty ordering anything off the menu. Although.. i do feel guilty for my waistline, haha! They have salads though.. I just prefer getting the deep fried fish and french fries..and burgers.. and chicken wings! yumm.. :P\n\nThis is an order at the corner and receive your food sorta deal. Although the person working there brought our food over instead of calling our name on the receipt so that is nice. You have to throw your own trash away although I saw some people leave their trash on the table. Shame on you!!!! \n\nOh yeah, there's a bunch of sauce on the tables.. like malt vinegar, tabasco, ketchup, Worcestershire sauce..\n\nThe food is nothing spectacular, but still good.. it's perfect for a low-key sorta night..you know, where you're too lazy to cook but still need to get food, and don't want anything too crazy.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Best burger and fries on Geary. U can upgrade to buffalo for 2.50. What makes this place stand out from the others.. U can put malt vinegar on our damn fries!!!!! The way it should be all u stupid ketchup people. Yes!!!", "author": "Satoshi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Best fries in the neighborhood!\n\nThe burgers are great too.  The menu has everything you could want (especially if you're hungover).  The prices are reasonable, the service is fast and the food is pretty darn delicious.  \n\nI am a huge fan of the Avocado Burger or the Fish and Chips.  It's been a while since I've had the wings, but if I remember correctly, they're pretty fantastic as well.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "I was so excited to eat here again after about 17 years. I used to live down the street but I happened to be nearby for work on Saturday afternoon and wanted to take my associate for a nice treat. Neither of us had eaten all day so we were pretty hungry. We both got vanilla milkshakes. He ordered a chili burger. I used to love getting the fish & chips, decided to change it up and got a seafood combo with fish, prawn, oysters and scallops (my favorite!) The thick-cut sliced potatoes fried up crispy were super amazing. Then I took a bite of a scallop! It was extra firm and tasted a bit funny but since I hadn't been in so long, I thought maybe it was a seasoning they used. We had to get back on the road so I took most of my order to-go and ate the rest of my delicious meal while we were driving. A couple hours later, my belly was full of gas and I was burping up foul sulphur nastiness which continued well into the next day. I don't know what exactly caused my body to react that way but I suspect a scallop a few days past its prime. :( I wanted to alert the staff in case more people had the scallops so I tried calling but the mailbox is full. One less star for my negative experience. \nI hope to visit again before the next 17 years. Thanks for keeping the Richmond delicious.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "What it lacks in atmosphere it makes up for in price and deliciousness.  Best fish and chips in the entire city, and a total bargain.  The other food I have ordered is also great - fresh, custom ordered, and delightful.  One of my go-to's in this neighborhood.", "author": "Emmett L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-12", "description": "Really great cheese steak for under $ 7. Go for it!\n\nThe burgers are good too, especially for the price.\n\nThe fries are ok and worth it if you are craving the deep friedness. \n\nI like this place a lot and so will you.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Why is this place not getting 5 stars? I have been coming here for years. Not only are all the ingredients SUPER fresh, but it is SO cheap! I mean, under $5 for a burger?! I only eat turkey burgers and they are not dry and have great flavor! My husband gets beef and loves them too. Their fresh cut fries usually don't make it home when I do takeout. You can call ahead to place your order too. We do go to fancy burger places too because we don't live near Buffalo Burger, but it usually leaves me feeling like I paid too much for something that wasn't nearly as great. Ok, now I am hungry.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "The food is sooo good here! So many options, I went with the crispy ranch chicken sandwich and it was amazing. My boyfriend had the double cheeseburger which was also very good. I'd like to go back and try the Philly Cheesesteak and mozzarella sticks as those looked very tasty.", "author": "Alyssa Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-09", "description": "3.5 stars.\n\nNothing fancy by any means but this joint is open late (til 10pm), relatively clean, and everything on their menu (burgers, cheesesteaks, and fish and chips) is around $5-10 bucks. Perfect for bargain bites when you're on that B.O.B. status, you know - Ballin' On a Budget. \n\nOrdered the patty melt - $6. It's a little different since there was ketchup but the beef had surprisingly good flavor. (http://www.yelp.com/biz_photos/Nvc1XZVJZhp2CHbh_hTLUw?select=-1kdrIpt0qSUu1SSrTuerw)\n\nPlus, is there such thing as bad buffalo wings? There's only better.  These are better than Hooters but not as good as Wingstop's and I like how they came with a bunch of carrots and celery. (http://www.yelp.com/biz_photos/Nvc1XZVJZhp2CHbh_hTLUw?select=jtVzcF6pTMDy1CxuPg1YeA)\n\nSolid spot for late night bargain bite eats if you're not feeling Jack in the Crack or Video Cafe.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "Ordered fish n chip w/ fries and Spicy BBQ Buffalo Wings. The food was great.  Really tasty home cooked style. Wings are really,  really good.", "author": "Garren .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-25", "description": "After so many times of walking by this establishment me and my friends finally decided to try it out.\n\nThere was nothing that made the burgers taste special. The girls working at the cash register asked to take our order and even thought I specified 'No tomato' there was tomatos on my burger.\n\nAnyways, I ordered bacon avocado and these descriptions sum up my experience: the meat pattie was very dry, the bacon was burnt and the avocado was not fresh. I know when you put avocado with hot food it won't look as fresh, but my avocado didn't even look green.\n\nI might give this place another chance just because I know that its a family owned business.", "author": "Oriel F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-21", "description": "With all the great reviews this place has , I decided to give it chance while visiting sf I was very disappointed.The burger didn't have flavor and the wings tasted as if they had been sitting there too long . The tables were all messy ! Immediately  after I felt my stomach cramping up, then I got nauseas and here I am not able to eat! Food poisoning is what I got. Def won't be returning", "author": "Luna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Food is great .. I usually order fish and chips .. Their fries is pretty good ... The person took my order is not very friendly the two times I went there the person didn't even smile I think person works to much but food is great.....", "author": "Muktar B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-06", "description": "AMAZING Garlic fries. so garlicky, so perfect. \n\nThe burgers (and actually all the food) are so cheap, it's awesome. The burgers were under 5 if you wanted beef, added a couple of bucks for buffalo meat. Solid burger, couldn't really ask for more!", "author": "Christine U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-20", "description": "The food looked fine to eat but the quality and timing was terrible. It took them 30 mins to make plain sandwich.", "author": "Sophia O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-29", "description": "I would give this place a 3.5, but my friend says 3, so our average rounds down to 3.  The burgers are tasty and the sandwiches delicious, but the french fries were a little thick for my liking.  \n\nBottom line: I was not wowed. If you are walking by and looking for a good ol' burger, this is the place for you.  It is not a place to seek out.", "author": "Jessyca M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-05", "description": "First the only bad thing about this restaurant:\n\nFRIES\n\nI dont know what they are doing wrong but they have a taste of old tea bags. That is really disgusting. I made a lot of times the mistake to order the fries in the hope that they will get better but... no. Always this disgusting tea bag taste. Terrible. Maybe something is wrong with the oil? I dont know, please improve. In that case i could give you 5 stars because:\n\nThe service is great.\nThe burgers are really awesome and so are the chicken wings. (but think about a napkin otherwise it will be a delicious mess ;) ;) )\n\nGreat restaurant! With good fries it would be worth for 5 stars in this price category :D\nBest wishes", "author": "Marco T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "HELLUH YUM HERE\n\n\nPhilly Cheese Steak Sandwich that was off the chain along with a side order of their garlic fries.  Solid combination fashow.  The dude working there was nice, greeted us once we got in.  I already knew what I wanted so proceeded to order.  Didn't take too long for the food to come and they bring it right up to your table. I thought it was a nice touch.\n\n\nAll I saw was the meat, peppers, and cheese spilling out the sides of my sandwich, in the bestest of ways of course, and then.. I saw a fork and was like hales yeahhh. I had to eat everything that fell off the sides, that's what the fork was intended for right? They already know wassup.\n\n\nGarlic fries were pretty decent too, just wished I had a COUPLE more. Other than that, no complaints. Will def be back for round dos.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "Out of the blue....I had no clue....Buffalo Burger.....\nQuick....with the help of Yelp.....\nWhat can I say?  Was it finger licking good or what.....\nSo....burgers....my cravings at the time...\nJust had to try it....\n\nOk....The Ultimate Burger with some Fresh Cut Chips and a Soda please.\n\nThe Ultimate Burger came with 3 kinds of cheese, letuce, tomatos, onions, alvacado and bacon on a french roll.  Lots of stuff in a burger....um....ok....but just ok and not the best....but good for being a $6.95 burger....because it had all the extras....with the cheap price I'd bumb it up half a star from 3.\n\nFresh Cuts Chips.....Ohhh....eat this first!!  Best when eaten hot!!  Fresh cut Chips......they make their own chips here.  Nicely fried, yet tasty...not too thick, not too thin....chips are fried just right....the slightly thicker ones especially gave you more of a potato .....something different, something tasty.  Get the Ranch Dip / Sauce (50 cents extra) for your Fresh Cut Chips!!  This item is a solid 4 star and recommended you eat it hot.\n\nThe Soda - Your choice of fountain or can....I snuck in a refill....not sure if it's free or not??\n\nKind of a small place, I watched the giants game here...quiet and enjoyable....nothing more.\n\nSo.....if your blue and you don't know where to go to\nWhy don't you try puttin' on the burgers.....\n\nGonna try the Fish and Chips next.\n\nWill return!!", "author": "Alan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "Well, a place that not bad to refuse, not good to recommend either. France fries are too thin to taste layers and the burger is not juicy enough.", "author": "Louie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "I really want to like this place...and since trying them...I've talked myself into going elsewhere for burgers.  Overall...the place is just okay\n\nThe burger wasn't anything special...dry and boring.  However, the Fish and Chips are good and the Garlic Fries are great...they will leave you stinking for hours\n\nI will try them again someday... but for anything other than burgers", "author": "Zoran L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-20", "description": "This place used to get five stars from me. I loved the Buffalo chicken salad and would order it every time I went. But a few months ago they were unable to make my salad because the dressing was unavailable. It was a special dressing crated just for that salad that worked well. After multiple occasions of them being out of that specific dressing they finally told me that they were no longer carrying that dressing. I tried the salad with other dressings but it just didn't taste good. Therefore my favorite thing on the menu is no longer available and unfortunately that has to lose a few stars. It is hard to fine a good buffalo chicken salad these days where the chicken is grilled and not breaded. Goodbye my healthy salad :( it's less likely I'll come back to this restaurant.", "author": "Maritza C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "This is one of the best places to grab some fish & chips as well as buffalo wings in the richmond district. The wings are crisp and crunchy but drenched in delicious hot sauce and they give you a side of carrots and celery with ranch dressing. The fish and chips are a big portion for what they give you where the fish is crisp and has a nice flaky crunch to it while the fries I typically will get the fresh fries which are not extremely salty and dip it instead in the hot sauce from the wings.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Cheeses takes aren't quite like the cheesesteaks in Philly, but this will do. It's a SF version. Fast friendly service and clean tables for eat in. They make the fries fresh! They're the best.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-24", "description": "The buffalo wings here are intense! Super tart and spicy, just how I like it. It's also drenched in sauce, delicious!  \nTheir garlic fries are good, but I've had better. Still worth trying though!\nThe service is great and the staff is very nice. \nThere's a good amount of seating as well. \nThe Philly cheesesteaks here are really good, but how could you go wrong with a Philly cheesesteak right?\nThe food is always hot and cooked to perfection!\nWould be coming back!", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "The ultimate burger and a side of Garlic fries hits the spot! This place is cheap and pretty delicious for a hole in the wall burger place. I can't complain! It's all very good :)", "author": "Jacqueline J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-03", "description": "I was in the mood for wings and decided to stop by here after work. \n\nThe wings are small, like you'll be done with each wing in 3 bites, max.  9 wings are just the right amount for one person and costs about $6.25. \n\nThe fries are cooked kinda funky. It's not like steakfries and there's really no crispyness. Then again, when you eat the fry, you're wondering wheres the potatoe?\n\nThere's a $10 min to use cards which I'm not a fan of.\n\nThe search continues for good wings in SF.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "[M]ona: 3.5 Stars\n[W]ayne: 3.5 stars\nAverage: 3.5 Stars\n\n+ Inexpensive\n+ Accepts Credit Cards\n+ Good variety of burgers\n\n- Didn't like their Lemon Pepper wings\n- Don't sit under the TV\n- Hard to find parking\n\n[M] Wayne and I came here in search of a new \"gourmet\" burger joint other than our usual Burgermeister, which can get pricey sometimes. Buffalo Burger is located in the center of the Richmond District right across the street from that Blockbuster on Geary. \n\n[W] When you walk in, you can get a big whiff of food being cooked on the grill. As you decide what to eat from their menu, don't forget to ask for buffalo meat if you want it. Of course there's an extra charge for that as well. Mona wanted to get that option but I totally forgot to mention it during our order, especially since it was written clearing smack dab in the middle in bold lettering haha. \n\n[M] The buffalo meat would have been a better option but anyway, we shared a Supreme Burger [http://www.yelp.com/biz_photos/Nvc1XZVJZhp2CHbh_hTLUw?select=2qBog85o7hAXqw6i3o0qCg] and an order of 9 lemon-pepper wings which comes with some veggie sticks on the side. [http://www.yelp.com/biz_photos/Nvc1XZVJZhp2CHbh_hTLUw?select=CKok9TWhauWGVRoQ5FXgzg ]Your meal includes a drink from their fridge as well so feel free to grab yourself a can of juice or whatever you like. [http://www.yelp.com/biz_photos/Nvc1XZVJZhp2CHbh_hTLUw?select=-3bfXJubDAjn1LHmvh4hMw]\n\nThe burger is made to however you want it to be cooked. We like ours medium rare and they cook the meat here perfectly. The only part that sucked about Wayne's burger was that it didn't come with a traditional bun and the juices from the meat were soaking through. \n\n[W] In my opinion, when you have the perfect burger, it has to come with a perfect unsaturated bun as well. Otherwise I'm just eating a slab of meat and wet bread... bleh. \n\nThe Lemon-pepper wings came right after the burger. Honestly, this didn't satisfy our palettes. I literally could've done a whole lot better job but I just wanted to compare this to Wingstops' lemon-pepper wings. Wingstop wins hand-down. Basically the wings were just fries and lemon juice was just squeezed all over along with pepper on top. The wings were too sour and again it's just something I could've done.\n\nOne disturbing thing about this place is that the guy that works there, probably the owner, was just chilling near the front door and watching the TV that was right above our heads from where we were sitting. I say it was disturbing because I can see at the corner of my eye that he kept staring at us. I was like WTF man! When the TV is bolted to the wall above our heads, normally your head is looking up to see the screen but she was just staring at us. That made me feel really uncomfortable but whatever, we just ate our food and tried to ignore that. \n\nAnyways if you come here during a weekend, good luck finding parking around this neighborhood because it seems like everyone's family including their baby and dog has a vehicle. That's the only thing that sucks when parking in the city is that there's one too many vehicles per household and they hog up all the parking. I would try this place again just to taste something else. Hopefully the guy won't be staring at us otherwise it'll just face my chair towards him and stare at him too haha. Just kidding.", "author": "Mona C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "Ate here with two friends. I got the fish burger and some fries, it was delicious! My friends got onion rings, the BBQ burger, and the Hawaiian Burger. All of us were VERY pleased with our meal and we were all in a food coma by the time we were done. For a burger joint and a quick bite, this place hits the spot.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-18", "description": "On my solo adventure to SF yesterday, I decided to have a meal here. It was quite the gamble because I don't normally go for American food. My typical food choices would be; Korean, Vietnamese, or Thai.\n\nAfter much deliberation and yelping near the Golden Gate, I decided to go for something different 'cause I had garlic fries on my mind. I also love chicken wings so I figured it was worth a shot. I ended up taking a few minutes to think about it since I never looked at the menu.. to then again stick with my original plan because it would have taken me forever otherwise...\n\nI went with a small order (1.95) of garlic fries and a 6 pc chicken wings (4.95) with spicy teriyaki sauce. I had forgotten my wallet in my car, so they were nice enough to make the food as I went to retrieve it. I decided to sit in the back corner and one of the cooks actually brought the food to my table. \n\nGood amount for the price. The spicy teriyaki was actually teriyaki and buffalo sauce together. It wasn't great, but it wasn't bad either; I'm not a fan of buffalo sauce TBH. I have this thing where I eat my chicken wings with 2 forks because I don't like getting my fingers all dirty, but I had to this time because the plastic forks were weak... Picked the meat off of all of them before eating for convenience, and leaving them to be drenched in the sauce was a bad idea... because I knew my salt intake was taking a sharp spike. I think that the chicken could have been cooked a little less because it was a bit on the dry side. The garlic fries were good, but I would have liked it if there was more of the garlic goodness. Even so, can't complain for the price.\n\nI honestly don't know if I'm going to make another stop here. That is a possibility if I decide to take someone if I'm in the area and we don't feel like the other options on Geary. If I do, I would probably go for a burger or a grilled cheese... or something.", "author": "Nga C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-01", "description": "First review I've ever written because I don't usually feel strongly enough about an establishment to write one.\n\nGood food. Of course, I had fish 'n chips so that's hard to mess up. Girlfriend approved of her supreme burger and I liked their fries--reasonably thick but still quite crispy. This alone would've been worth at least four stars to me, and it wouldn't have been easy to drop any lower. \nHowever, the not-so-gentleman/woman (for lack of definite identification) behind the register found a way to be the rudest, least helpful person in any food service establishment I've been to as far as my memory can take me. The interesting thing is that he/she didn't seem to be actively trying to come across as an employee that made me want to spit into their tip jar. \nMaybe you can decide for yourself:\n-Girlfriend and I approached the register and she began ordering her burger. He/she didn't bother looking up or making eye contact with either of us as my girlfriend was ordering, so there was never any confirmation that he/she ever heard anything she said until he/she finally said, \"Is that it?\"\n-I attempted to strike up some conversation with some questions about some items I was interested in ordering. I asked about the size of the fish pieces in their fish 'n chips and immediately received the answer, \"Don't know.\" Am I the first person in the city to have ordered this? Is this your first day? Not the best impression for your first day, so I imagine you're just not interested in being helpful in the least. There are other jobs for people with your level of customer service expertise, you know. I can suggest a job in advertising. A job involving some sort of edible-animal suit and a spinning arrow with a restaurant name on it.\n-I also tried to order a banana shake, and before I even finished, received another flat-toned, unenthusiastic response, \"No ice cream.\"\n-Before we got our food, he/she was cleaning a table up after some other customers didn't dispose of their trash by the door before leaving. He/she was very openly expressing his/her annoyance aloud to...no one in particular. Understandable, so sure, continue to enlighten us to how much you hate your job that you are incredibly ill-suited for.\n-After this, he/she brought us our food and tossed our baskets onto our table and basically ordered us, \"Make sure you throw your trash away when you're done.\" I responded, \"Sure!\" Naturally, it's obvious to throw your trash away when there's a trash can right by the door. And of course I would. But if I wanted to follow General He/She's orders, I'd join the military. But I didn't. I came to be served food.\n-Last one: As we were eating, a man came in and appears to have ordered what appeared to have been a shake, evidenced by he/she pulling out a large tub and scooping something into the metal container that milkshakes are mixed in. Wow, you guys must restock fast.\n\nIn conclusion, would come back again for the food. Oh boy, just tried a bite of my girlfriend's leftovers. Definitely want to come back to try some burgers. As long as it is during this lovely gentleman/woman's shift and I get to spit into the tip jar before leaving.\n\nNote: I don't mean to sound particularly insensitive about his/her sexual identity, and my problem is entirely about his/her attitude for the entirety of our encounter in this restaurant. My use of both male/female pronouns throughout this review is not meant to be insulting in any way, but merely to indicate that I was legitimately unsure of whether he/she would identify him/herself as a male or a female, and wished to be respectful of either scenario.", "author": "Kriz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Chowed down the Chili Cheese Buffalo Burger! It was extremely filling and cooked perfectly! Too messy to pick up, but I don't mind using a knife and fork. They fry their own potato chips! They are light and break apart when you bite into them! They are perfect with the burger. A perfect way to end any Sunday!", "author": "Jana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-30", "description": "5 stars - no complaints here!\nBf and I are regulars!  We come every few months and always enjoy whatever we order. Bf always orders wings super spicy and fish n chips. I've had their hamburgers, chicken sandwiches - all consistently satisfying! \n\nRecently had the philly cheese chicken and it was bomb! Will continue to be regulars here :)", "author": "A b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "Boss Dude: Hey, hey, hey, long time no see...\nMe: Uh, yeah.  My family and I have been trying to cut down on the red meat.\nBoss Dude: So no burger.  You want onion rings?\nMe: Actually, we're cutting down on the fried food, too.\nBoss Dude: You want a salad?  We have salad.\n\nMe: (Who orders a salad at a fast food place?) Uh, uh.... Um, let me think about it. How about the seafood combo?  No wait, that's fried too.  \n\nBoss Dude: Chicken sandwich?  We have grilled chicken, if you want.\nMe: (As I recall, the grilled chicken is dry).  Er no.\n\nCustomer at a table next to the counter: Man, these are the best burgers I've had in a long time.\n\nMe: (Nervously) Uh, shoot, let me just get a burger.  A mushroom cheeseburger with bacon and uh onion rings.  Just a small order of onion rings, though. \n\nBoss Dude: You just want one burger?\n\nMe: (Nodding silently)\n\nBoss Dude: You sure?  What about your family?  You don't want any drinks?\n\nMe (Glancing around the room, looking at all the happy munching, and obviously succumbing to the peer pressure): Six burgers, three large orders of onion rings and about six drinks.\n\nBoss Dude: OK, your order is ready.  Here you go.\n\nMe: OK, Thank you.  Thank you very much.\n\nMe (Mumbling silently to myself as I head out the door): You evil, little man, you....", "author": "Danielle O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "I hate to write a bad review here. I live close by and I've been eating here for years and have always enjoyed the food and service but in the past few months they have hired a new employee who goes by Bonny. Two times already he has been rude to my girlfriend and I. Last time we ate here he even made fun of what my girlfriend ordered. Today I tried to order buffalo shrimp fries, garlic fries, a patty melt, and lemon pepper wings and he could not even give me the price over the phone saying his pos was down. I asked him for a rough estimate of the price and he rudely responded that he wasn't going to take my order.\n\nBuffalo burger will no longer get my service or my friends. I hope the customer service standards improve. Best of luck to the owners of the business.", "author": "Konar S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "The burgers are simple but delicious. I always have to remember to ask for medium-rare or else my burgers are cooked well-done. Garlic fries here are wonderful. \n\nI think the wings and links are just okay.", "author": "LeTran B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "Fat, fat, fatty, fat.....and I loved every mouthful of it. I shared the garlic fries (so frickin' good), mozzarella sticks (average, served with a thick ranch), a veggie burger (gardenburger) that they load up with ketchup, mustard, mayo, pickles and cheese and washed it all down with a thick chocolate shake and then waddled home dehydrated and gasping for air as my overstuffed belly left little room for oxygen. \n\nHappy to have this spot in the neighborhood and looking forward to them curing my next hangover.", "author": "Cec D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "I ordered the Philly cheesesteak along with some wings. The wait time was about ten minutes which is reasonable. I got the philly first. Just looking at it I knew it was gonna be good. After the first bite I was in heaven! Great philly, gotta say one of the best I've ever had. The cheese really brought it all together.\n\nThe wings however we're boring, nothing particularly special about them. Also each wing ran you almost a buck.... Kinda pricey for generic hot wings.\n\nOther than that everything else was ok.", "author": "Serge C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "Delicious sauce, meaty wings, and AmaZiNg garlic fries...addictive. I come here at least twice a month for wings, maybe even once a week during baseball season. :D \n\nThey are Asian owned so service is typical, but they are really nice and take about 20 minutes. It's always best to call ahead of time for pick ups. I would rather support local businesses than chain restaurants that don't bring support back to the city. \n\nI love me some wings and beer!!!!", "author": "Andy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "4 stars for good food. Service is only okay. We ordered a burger, Philly cheesesteak, and fish & chips. Burger was excellent - well seasoned, definitely handmade patties, served on a french roll rather than a burger bun which I prefer. Cheesesteak was good and flavorful, also on a crispy french roll. Fish and chips were deliciously crispy, served with tartar sauce but I preferred the malt vinegar that was provided on the table. French fries were definitely made in house, not the precut prepackaged frozen ones you get at other places; these were legit - golden crispy on the outside and soft and chewy on the inside. All in all, food alone was enjoyable. Ambience was causal; we ate as we watched the football game on TV. Like I said, service is okay, but you're not going to a place like this for 5-star service anyway. I recommend and would come back!", "author": "Kortney E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Deserves a much higher rating. Best Buffalo chicken wings in the city that I've had. If you want other flavors go elsewhere. They're homemade chips are also bomb.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-17", "description": "Ultimate Burger and Garlic fries. \n\nBurger was better than average, not mind-blowing, but pretty good. If you consider the price, the burger was great. Garlic fries were also great, definitely worth it. I'll be back.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "This place is for sure a hole in a wall! I was with a bunch of friends randomly walking around Geary and we were hungry. We passed other food spots but they didn't seem that great. The burgers and fries are amazing. The burgers are also super meaty and big. I honestly thought it was going to be small because the prices were so cheap! If your looking some where for a big burger for a good price, come here!", "author": "Alexis I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-18", "description": "I've been coming here for years. The owner and employees are very nice, but today's experience was not good. The guy at the register was VERY RUDE. I've never seen him there before until today. I hope he's not there for long. It only take one bad experience to not make me wanna come back.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-10", "description": "Buffalo Burger. I heard some things about this place and wanted to try it for myself. The place looks like a run down diner on the inside... The place looks old and doesn't seem to have changed or something. Gives off a sleepy feeling. Time for a decor update? \n\n== Food ==\n\nBuffalo burger. Yes, they have buffalo meat here. It's an extra $2 to get the buffalo meat. Was it worth it? I can't really tell the difference between buffalo meat and regular beef so it wasn't worth it to me. The burger overall all was alright. The patty is a big thin and the buns aren't amazing or anything. It was a pretty average burger.\n\nGarlic fries. They're above average tasting fries, but they were really dry. Thick cuts of fries with garlic on them.\n\n== Service ==\n\nService was quick and the food came out within 5 minutes, which is pretty good.\n\n== Overall ==\n\nAn alright place. Decent burgers. It seems like the philly cheese steak is the way to go here. Maybe I'll try that when I'm nearby.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-09", "description": "Came here long long time ago, and tried the burger with buffalo meat... I don't really remember much, besides that it did not taste much different from a normal burger. So I decided to come back and try it again.\n\nI ordered the hamburger and asked for the buffalo meat and ordered small garlic fries with it. I still think that there isn't much difference between the buffalo meat and beef. I actually think that the buffalo meat is a bit more bland and dry. But it was still pretty good.\n\nThe fries were really good though. I love how they put a lot of garlic into it and the fries were cooked perfectly. Crispy on the outside but soft on the inside. Sooooo yummy.", "author": "Alicia W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "came here Christmas Eve because i was already in the area. My bf always talks about this place because he used to come here often as a high schooler so he wanted me to try it. It's pretty similar to Beep's Burgers. I had the fish and chips with garlic fries and he had the bacon mushroom cheeseburger. Fish  was smaller than i expected. So was the burger. A little pricey for the portion and it tasted alright. But i can understand the pricing - competition is tough in Richmond. Service was pretty good tho. If i'm craving burgers in the area, i'll def be back", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-18", "description": "My gf and I were on the bus heading towards the Golden Gate Bridge. We were right in Richmond and we suddenly got hungry and decided to find a spot to eat at before spending a few hours at the bridge. \n\nIt took us a few minutes to decide what we wanted to order. As we were looking at the small print on the menu, we noticed many customers coming in. It seems that this place stays busy consistently. \n\nI ordered a philly cheese steak sandwich, a chicken bacon sandwich and garlic fries. I was pleased with my sandwich but it was quit small. The bread was soft and crispy, the meat was tender and the cheese was good. For $6, I think it was too small. The garlic fries were a bit stale and had too much garlic on them. \n\nI was upset at how small the tables were. I felt like an adult sitting on a preschool table. I kept knocking over the napkin holder, ketchup bottle and getting stuck with the table and chair. As far as the interior, its too simple and white. It made the place feel empty and cold. In matter of fact, it was cold inside. \n\nThe service was fast but the customer service wasn't' the greatest.", "author": "Alexis D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Great service and delicious food. Ordered the spicy BBQ chicken wings, philly cheese steak, and the chicken club sandwich. Everything was great and well priced. I will definitely be back.", "author": "Julia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "Drunk finger foods.\n\nIf I hadn't decided to go vegetarian I would have ordered the buffalo wings at least once a week. Onion rings,burgers, cheese sticks and sweet potato fries are served in large portions and it is notably affordable. Beware, you may get fat.", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-03", "description": "I love this place. \n\nI admittedly get the same thing everytime, but that's just because it's too good to stray away from. I've never tried anything that I did not like, but I'm all about the buffalo chicken breast sandwich. It's got the works in between good bread; cheese, onions, avocado, bacon...yum! Also, give their chips a try. \n\nYou know what, aside from it taking a while at times, you really can't go wrong with this place.", "author": "Barrett I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-27", "description": "When walking into this ordinary & slightly depressing hole in the wall I wasn't expecting anything out of this world, just something fairly decent. I mean, it always seems busy, so they must be doing something right, right? \n\nI was having one of my occasional little guilty-pleasure-cravings for spicy Buffalo wings, so what better place than Buffalo Burger??  Wait. I'm somehow thinking now I should have gone when I was craving a burger...\n\nAnyway, I got the spicy \"buffalo wings\" . I liked the traditional tangy sauce, but the wings were gristly, and downright yucky. They were made up of protruding bones and cartilage, with very little stringy meat. I got  my two elementary aged kids the fish and chips to share. I couldn't believe the amount of grease dripping off the fish when you picked it up- just GROSS. My kids will eat anything fried, but even they took only one bite of the soggy fish and put it down. They ate the fries, but kids will eat anything resembling a french fry. What I tasted were obviously from a cheap and frozen source (and also terribly, terribly greasy). \n\nJust every bite didn't taste fresh and was of the lowest quality that money can buy.\nPerhaps the burgers are good--too bad I would never be daring enough to go back in there to try one.", "author": "nancy s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "I'm surprised that I don't already have a review for this place. I come here pretty often, especially when I'm in need of a quick greasy food fix or I'm on the way to the bank.\n\nEverything is relatively cheap and tasty (at least everything I've tried). I usually get the 6 piece wings in spicy bbq and yes all they do is toss it in their spicy buffalo sauce then drizzle it with bbq, but it's sure tasty. It also comes with carrot/celery sticks and your choice of ranch or bleu cheese. Most items will run you about $4-5. Let me tell you, GET THE GARLIC FRIES! They're so good. Once in a while they don't come out as crispy, but most of the time they're crispy garlicy goodness. I think they fry it in garlic oil or something, because the flavor is definitely there. Lately, I've been getting the BLTA sandwich on white, which is very simple and basic. I have also tried the burger and fish and chips and they were all pretty good. Nothing has let me down at buffalo burger thus far.\n\nThe owner is always here and is usually the one who will take your order and bring your food to the table. I love buffalo burger. It's fast, cheap, and good. The only thing that peeves me a bit is that they actually charge you .50cents for dipping sauces like bbq, ranch, honey mustard etc. Otherwise, if you're in the area and looking for good old fried finger foods, this is your place.", "author": "Stine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-20", "description": "Just had an awesome buffalo chicken sandwich. Very friendly staff. Really good little hole in the wall", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "Five star for the fries! Real fresh potatoes. The wings are good. The burgers are big and juicy. This is not fine dining but it is solid comfort greasy spoon grub!", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-13", "description": "Great cheesesteaks.. Not so oily and tons of flavor. I usually put hot sauce on everything. And I mean EVERYTHING. To the point where some question if my butt will be on fire later on. But tonight, I said no to the sauce. I enjoyed the savory sandwich in it's pure form. \n\nSide of garlic fries to boot. Warning...took 2 brushings for the bf to fully get the garlic taste out. But I think garlic is sexy. With hot sauce.", "author": "Maria B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-30", "description": "I ate here last night with my 7 year old son. It was good--what you would expect of a burger joint. They have the fries, onion rings, wide selection of burgers... they even had a light option for me as I am trying to watch my weight. \n\nSon ordered a cheeseburger and onion rings. It was tasty, but didn't really stand out. The onion rings were yummy, too. Fried to perfection. But alas, fried anything is greasy. But as fried foods go, these were great.\n\nI had a grilled chicken breast sandwich. I was actually surprised at how tender and flavorful it was despite it being pressed thin. It had me wondering if it just so happened to have some of that cheeseburger juice on it (which may have made it so yummy). As a dieter, I only ate 1/2 the bun (they are HUGE), but anyway, I still walked away quite satisfied. \n\nThe food did take a bit to prepare though. They call it fast food, but it was a little longer than that. Maybe because it's made to order?", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "Their French fries are always really good. The chicken salad is yum (I was drunk though).. I'll go again!", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "My favorite restaurant near my place. The burgers and garlic fries are great. My friends really liked chicken wings too", "author": "Nitish S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-06", "description": "This place is pretty good for some wings and burgers, but unfortunately there is this suposite girl that works there that has the worst attitude I have ever seen in the service industry. I actually apologized when he/she got my order worng and he/she said \"it's too late\" WTF. Who says that. I hope to talk to the owner some day so he can fix the problem before no one goes to his restaurant anymore. She's really that bad. \nNormally I don't give 1 star because of one person, but I would give him/her negative stars if I could. I don't wish his/her presence on my worst enemy. Good luck to any brave soul that still goes to buffalo burger after reading this.", "author": "mikayla m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "Great burgers.  This place has been in SF for as long as I can remember (I grew up there).\n\nIt's sort of a dive and situated in a nonchalant part of the block, but dont let their looks fool you!\n\nI've only tried buffalo burgers from this place, but I love love love it, and the sauce is tangy and has a great kick to it!  Very affordable and the home made chips are a must!", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "Been on the hunt for a burger made from buffalo meat - not hand ground, niman ranch blah blah blah beef. \n\nBuffalo Burger serves burgers made from buffalo meat. Granted they appear most likely of the frozen variety. I requested medium rare - which was denied & so I had to settle for medium. It arrived well done - disappointing. On the upside it wasn't tough nor dry. Iceberg lettuce & thin tomato slices (wish they were thicker or more of them).\n\nThe side of homemade potato chips was fantastic - thick cut & crisp. I can easily forgo potato chips & can eat just 1 from the mass produced bags - but hey, I'm human & can't resist homemade fried goodness. \n\nDamage:  less than 10 bucks.\n\nNo ambiance & it was freezing inside.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Our son picked this place after a Yelp search and we're glad he did. We received a friendly greeting from Bonnie (sorry if I misspelled that) and she was helpful with the menu suggestions. We had the fish and (excellent) chips, the Philly Cheesesteak, BBQ bacon cheeseburger, jalapeño poppers and a shake and everything ROCKED!! Great food, super- friendly service. Seriously, Bonnie was so nice and cool, and again, a great deal for wonderful food. GO TO THIS PLACE!!! You'll be glad you did. We'll be back.", "author": "Elma K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-11", "description": "First time here and first time eating eating fish and chips! Ordered the garden Burger... no...not again. Definitely go with the burgers (cuz that's what they're known for!) I also tried fish n' chips for the first time in my life! (Yes....believe it..) They make the gigantic chips themselves and the fish was moist, so I threw it into my boring garden burger and yum!\n\nIt's a nice hang out spot and during the right time in the afternoon, the street of geary looks almost dream-like. Makes me happy I live in SFC ^^", "author": "Anna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-05", "description": "Buffalo is one of my favorite places to grab a quick, cheap dinner when I'm out in the Avenues. I've had the fish & chips, chicken sandwiches, and hamburgers, all good.   The french fries are fresh, delicious.  \n\nLimited indoor seating, but (and this may be a secret...) they'll deliver to McKenzie's and to Nag's Head, happily.\n\nBuffalo beats out Bill's down the street bc they toast the buns.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "My hunt is not yet over, but as far as I can tell these are the best Buffalo Wings in San Francisco (okay - maybe Kezar is better - but it's close). Perfectly crispy, lots of meat on 'dem bones, great sauces. Yes please. To be fair, I've never eaten anything here that *isn't* the Wings or the Fish & Chips (which are also very good). If you need junkiness and saturated fats - which everyone does - this is a great little spot.", "author": "Jeremy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "Wow, the only place that I can get a real buffalo burger. Very over the top restaurant. It is the best, can not beat it.", "author": "Krystal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-02", "description": "Tasty grease pit to warm up your rain soaked toes.\n\nAfter pulling a two-movie marathon (warm regards to my Netflix queue) with the fellow that I'm seeing, I was slightly hungry and the idea of getting out in the open air prove stimulating to my senses.  We had just finished back-to-back serious heavy cop dramas and I knew that my usual chatter would be cut short reflecting back on the corruption, death and autonomy of the NYPD  ;o) \n\nMy date led us here, right on the main drag and it was totally empty.  I've always heard of this place but never really ventured by so it was a nice welcome.  I'm always up for trying new places.\n\nBuffalo Burger is probably known more for their wings, french fries and cheese steaks (for another $1.00 you can request a Buffalo burger patty) and I will order as such moving forward.  However, I was craving my usual slap of hamburger so I ordered the standard burger, medium rare.  We also ordered a basket of fries to share between us.\n\nI chose the counter facing the street.  I never use to like this setting, but when I was in NY, I was seduced and forever changed.  There is something very voyeuristic about sitting facing a busy road and watching the people walk by.  Some sad.  Some busy on their cellphones.  A world rolling by and all that separates you is a sheet of glass.\n\nOur burgers took about 5-10 minutes.  Nothing a small verbal exchange can't handle.  They were huge.  The bun was typical of the mass produced kind, complete with the smattering of sesame seeds.  But it was topped the way I like it:  two large slices of tomato, a ring of spicy red onions, two pickles and a leaf of iceberg lettuce.  I asked for a side of mayo, because that's just the kind of gal I am.  Not to mention, I like to dip my french fries in that creamy goodness.  The hamburger, slightly more medium to well done, was actually very tasty once I spruced it up with the mayo.  Our french fries were rough cut, with the skin still apparent.  Thick sticks of starchy hot delights.  As I took bites here and there, I noticed that once we were eating more people were actually taking the time to look in.  Perhaps the tables had been turned?\n\nTo cut any sort of silence between bites there is a flat screen on the wall.  At a point in time where my eyes darted to the screen, one player had two of a kind, Jacks.  By the time the flop was laid out, another Jack lay on the table.  Nice.  Three of a kind.  He won that hand, all in.\n\nI also ordered a soft drink which includes free refills for dine in customers.  Our tab was around $13 with tax.  Not bad for the two of us and enough to somewhat dull the muddled senses from the cop movie marathon.  Casual and quick, good for the late night munchies run.  Next time the buffalo wings will be my order.  I'm not comfortable to gnaw on a bone in front of my date yet  ;o)", "author": "Miika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "Freshly made burgers on the spot. I got the Hawaiian burger and it tasted awesome. It had enough sauce for the flavor that the moment I took a bite, the sauces started leaking out. At first I though the grilled pineapples wouldn't go well, but I was wrong. The beef and everything in it just came together. Though, I felt like one of the staffs in the back was being passively rude during our meal. Would have been a 4/5. Way to kill the mood. Nonetheless, it's a solid burger spot on Geary.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "If you are looking for chicken wings in the inner richmond, then Buffalo Burger is your place to go. Everybody there is really  nice, and knows what they're doing. We have chicken wings almost every week, and when we do, its Buffalo Burger all the way. It is our reward for working hard all week. Thanks!", "author": "Sam F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-04", "description": "Been here twice now... Both times the place stunk like acrid badger shit. You know badger shit must stink because you can see all the craziness they eat on youtube and shit!\n\nFirst time I went there I had the wings. My review? ...Gross. GROSS. They are soggy and quite honestly I think they're the culprit to why that stench is in there.\n\nSecond time I went I had the philly cheesesteak without mushrooms and garlic fries. That shit was good... I could eat that again if I could get past the smell inside..\n\nYou have to remember the place you're eating at though, ... It's a fast food joint. However not even Jack In The (shit) Box smells like that!", "author": "Seth H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-27", "description": "My roommate has always shamelessly plugged in Buffalo Burger in every non related conversation.  For example:\nMe: How was your day bra?\nHim: Busy...I went to school to print out some pictures then scouted some places for shoots...o btw...Buffalo Burger is so good\n\nThis abrupt shift in tangents leave me floored and flummoxed at the same time.  Buffalo Burger has also been a Richmond staple since I was a kid, however, I never had the urge to go...until yesterday at the request of lil Twist.  Walking in, this place seems to be the headquarters for many a characters.  There was a group of high schoolers taking up a couple tables playing cards, some couples in a booth enjoying NCAA and this boss elderly man craning his neck and speaking his order literally .5 inches away from the cashier's face then going outside to smoke a huge cigar.   Lil Twist and I ordered the philly cheesesteaks to go and when we got home, had trouble removing said sandwiches from the paper trey.  Philly cheesesteaks are messy by nature, but this was over the top messy.  Once I was able to remove half and take a bit, all the ingredients tumbled out.  There was a generous splay of beef, cheese, mushrooms, onions and bell peppers however, it just tasted bad.  The beef was sweet like it was marinated in teriyaki sauce.  In addition, the consistency of the beef was like mush.  It was soft to a point of 0_0 (wtf face).  We resorted to eat our sandwich with a spoon.  The cheesesteak tasted nothing like one should and was probably the worst I've eaten.  The sweet beef was just not cool.  Basically, if you come here ordering a philly cheeseteak, be prepared to get philly cheese soup.  \n\nOn another note, I don't want to bash this place completely.  Because this place is named Buffalo Burger, perhaps it should have been wise to order a burger, their named specialty.  It could be that I just ordered an item they are not known for, which is not an excuse on their part.  I will try this place one more time before I desist from biting my tongue.  Btw, they serve homemade potato chips which I do want to try.  This is the first place where Fish 'n Chips truly mean just that.", "author": "Brian V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "Prob one of the best burger joint.   \nTasty buffalo wings with dipping\n\nTheir garlic fries could do better but everything else is DELICIOUS ! \n\nIt's a small plaace but good for going with couple friends or grabbing to-go\n\nthey have TV so they always show NBA games and what not", "author": "Paul J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-29", "description": "First time I got food from here I was considering the philly cheese steak. My friend lived right by it (I live near it too now) and said he didnt like the cheesesteak there cuz it was hella messy. (actually i dont think he used the word \"hella\", thats just my brain translating, he's from Massachusetts)\n\nI got take out and much to my surprise it was one of the neatess least messiest cheesesteaks id ever seen. So i didnt understand what he was talking about\n\nUntil the other day I had another one there. The guy served me the cheesesteak with a fork, that gave a hint. The sandwich for some reason this time fell apart nearly immediately. They use colombo rolls which are tasty (but small), wonder if they used a different one before.\n\nNow to the actual taste...beside it falling apart super easily..the steak seems to have been marinated in some sort of sauce, similar to terriyaki or another japanese sweetish salty sauce. At first this sauce is tasty but as I predicted it gets old real quick. Besides real cheesesteak's steak should not be marinated or sauced, only lightly seasoned with salt pepper etc.\n\nSo the cheese steak is edible, but def not traditional and def not that great. \n\nI will not have another cheesesteak here again, though I'm interested to try their buffalo wings, they have many flavors. \n\nThe man who runs the front of the restaurant is very good with cleaning up and making sure the restaurant is in order, which is nice when you are serving such greasy ass foodz. He also seems polite, not the chinese assho type that is common in the Richmond eateries.", "author": "Belito L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-21", "description": "Nothing fancy, but clean, nice, and reasonably priced.  Convenient, if you're in the area and a good place for a quick bite.  Had a very late lunch there recently and loved the pricing of the burgers, but ended up ordering their fish and chips which cost more,but was more of what I was craving at the time.   The three pieces of fish were smaller than I expected, but also tasted a lot better than I expected as well.  Nicely cooked and they were actually pretty good...a screaming bargain after the $23.99 for fish and chips at Fish in Sausalito the other day.\n\nHomemade potato chips were a nice change of pace from the usual fries.  With a can of Diet Coke, the total came out to $9.80.  Not too many places like this in the area and it's open late too.  If you take it for what it is, it's not bad at all.  Works for me.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "I have ordered wings and tried all the flavors and they were good.\nI like that it comes with carrots and celery.\nOne star off because they have hydrogenated oil in the frying oil (Maybe in the bleu cheese and ranch sauces too but I'm just guessing) because it is not good for you.\nAll in all I will be back to try the sandwiches.", "author": "Vincent T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "The bacon avocado burger was delicious, and beautifully layered.\n\nThe garlic fries were real GARLIC fries, and reminded me of the garlic butter toast my mom used to make me.\n\nAnd it was cheap: burgers are around 5 bucks, plus some change if you want special toppings.", "author": "Surat L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-23", "description": "If you Google'd \"hole in the wall\", I'm sure this place would appear.\n\nBasically, this place is a total dive.  Everything is overpriced for a burger joint and not to mention you have to pay for everything separately.  When you order a burger it doesn't come with fries or a drink.  The place is small and cramped.  \n\nYou're better off hitting up a fast food chain, at least you know you're getting your moneys worth.", "author": "Valentino L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-21", "description": "This rating is totally for their meau and foods but the male cashier \"the younger one\" had the worst attitude ever, I had been working in customer service field for 10 years, I never seen anything  worse  than that !!", "author": "Ricky K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-02", "description": "I feel very unhealthy after I ate here, hence the 3 stars. But overall, it was very tasty!\n\nI got the Hawaiian Chicken Burger (grilled chicken with pineapples) and it was quite delicious. But it became a huge mess at the end with all the juices dripping everywhere, so it became a knife and fork type of dish haha. \n\nWe also got the Buffalo Shrimp with fries, and that was okay. They were small little fried shrimps, with buffalo and tomato sauce on the side. I personally like the tomato sauce a lot more than the buffalo sauce. \n\nThe wings are supposedly amazing here, but perhaps next time...\n\np.s. It's mostly hard to find parking around here, but they have a garage right where Ross is and the rates are really cheap.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "The food is just okay. Nothing special about the burgers. Its not good but it also isn't nasty. I ordered a bacon and mushroom burger and garlic fries to go. The burger looks huge but once you unwrap it, it is actually all bread. The patty was thin and they forgot my bacon! I was pretty upset that i didn't get bacon. There were also very little mushroom. So the burger tasted pretty plain. The garlic fries were not even garlicky at all! There was only a hint of garlic. Whack. Garlic fries NEEDS to be very garlicky like the ones at the baseball stadium. Yum. The lady taking my order was nice though. Overall food quality was disappointing.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "I LOVE buffalo wings!\n\nMy friend and I often eat at a dessert place up the street and one day we parked near here and we couldn't resist coming by since we both love to eat buffalo wings! The ones here are drenched in the buffalo sauce (YES!) and you can order it as spicy as you'd like. For a first try, we chose a safe level of spiciness. But next time we come, I am going to ask for it much spicier! \n\nAside from the deeeelicious buffalo wings, we ordered a small side of chips, which are fresh potatoes thinly sliced and deep fried. They are so much better than potato chips and definitely rival french fries! SO DELICIOUS!\n\nI have heard the burgers are good and I see people here watching sports, but we girly girls come by to get down and dirty with the wings!", "author": "Stella C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "it's been like 3 or 4 years since i last came here, but this restaurant hasn't changed much. this place is still one of the best burger joints in town hands down. most of these burger places in the city charges 9-10$ for a decent sized burger, if not less than normal size. this place charges 5-8$ and has a large variety of burgers, fries, fish and chips, sandwiches, even rice bowls. the burgers, fries, and although i haven't tried there fish and chips and sandwiches, i'm sure is also delicious. also very large portions, so it's definitely worth your money. you can't go wrong coming here. you can't", "author": "Jason A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "My boyfriend and I love Buffalo Burgers.  When we saw this place driving down Geary we we excited to try it.... also presenting a non-asian food choice as we live in the neighborhood.   I ordered the avocado burger (hold onions and mayo).  He ordered the ultimate burger with the works and we had both buffalo style ($2 extra each).\n\nWhat We Got:  2 Dry burgers- Avocado burger with the works and the ultimate burger hold the onions and mayo. (GRR!)  I'm sure it was buffalo but I could not tell at all.  It was definitely frozen meat and pretty tasteless.  We also ordered a side of onion rings which was not bad but unimpressive.  Total was $21 we regret spending.  We both walked out still hungry :(\n\nFor the record though the fish and chips looked good, but I didn't try it.  I mean, the place is called Buffalo burgers!", "author": "Suz L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "Size matters.\nYes, it does\nPeople like it if it's big.\nA Dripping Hot Mouthful Big Thing.\nThat's the truth and it's sexy.\nIt's a HUGE SINGLE BURGER for $4.50\nBIGGEST 4,50 BURGER IN SF !!!!\nThis is good deal burger here.\nThe burger was pretty juicy, the sesame bun was good, so as the fries.\n\nI SHALL RETURN.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-09", "description": "Great burgers and great service.  Their buffalo burger patty is exceptional and the views are nice as well.  Had to dock a couple of stars solely due to pricing.  I got the buffalo burger with just a small handful of fixings, and one beer, and my total with tip and tax came to 42.", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "If you're near that area, please walk slowly 'cause you might miss this restaurent. It doesn't stand out and it's ran by a chinese family, but they KNOW their american burgers. The place was packed when i went, so i sat by the window, after 10 mins, the order was ready, and the fries and the burger was so big i knew i wasn't able to finish it. The fries were freshly made, and the Ultimate Burger i got had ample avocado in it (just the way i like it), the grilled onions and bacon are individually seasoned too (i think) which makes the burger an explosion of favors. If you're not so into strong favors, try patty melt. The bread is the regular rye bread slices, and it's grilled onions, ketchup and cheese, it might sound simple, but the texture was great! \n\nI really wish i had the stomach space to try the wings D:, maybe next time", "author": "Lizi F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "Great, cheap spot to satisfy your burger cravings without spending $10+ for good burgers..\n\nThey recently remodeled the place and it looks better then before.. The owner was really nice and was joking around with us.. The menu was BIG. Not only do they have burgers, they also serve buffalo wings, fish and chips, Philly cheese steaks, chicken sandwiches, buffalo shrimps, mozzarella cheese sticks, and salads.\n\nMy burger was huge even though it's only 6oz of beef.. I didn't like how the burger was smaller then the bun though.. I had plenty of bun left after the burger.. But the burger was pretty darn good and juicy... Served with your usual burger toppings.. I had bacon on mine but it was all clumped into one another so I had to touch the greasy bacon to pull them apart... I also ordered a small side of potato chips.. Gotta order this. A small is like a large and a large is like a XXL...! The chips were not greasy at all and I think it's better then the fries..\n\nThey also have some bomb ass chili cheese fries.. Yummy...", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-02", "description": "A solid burger joint in this part of town.\nThe burgers are tasty, and the fries are thickly cut (and NOT greasy!  YAY!)\nIt's too bad you have to order everything separately, but hey - the fast food chains do it that way.\nMy brother and I were REALLY hungry when we visited, so everything tasted extra fabulous to us.\nMy recommendation:  Try the Avocado burger, but add mushrooms and Swiss cheese.  Soooo good.  ^_^", "author": "Christine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "I had the Philly Cheese Steak, and it was so delicious. I'm not quite sure of what sauce they put inside, but I am sure that it really makes the sandwich tastier. \n\nThe food and selection here is definitely better than Belly's, and it's cheaper, too!", "author": "pauline joy r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "I come here for the burgers, mostly. But wings and Philly Steaks are also good. Wings are a little tough for me, but that's the cooking style.\n\nBack to the burgers. Most cost around $5 and change. A great value in the city. You can pay a lot more for a burger plenty of other places. Needless to say, there's million places to get a burger. But there's do stand out. Juicy, always freshly grilled. Good balance of toppings, depending on what you order. They'll make it however you want. Makes it my local go-to for burgers, other places I'll order something else. \n\nYou can also substitute a buffalo patty for an additional charge. If you've never had buffalo, it's leaner than beef with a meatier flavor without being to gamey. \n\nAnother reason I love this place is the home made fries and chips. I have a little rule, I only order fries at a place unless they are homemade or at least a really well seasoned. Can't stand limp, soggy generic grease sticks from a bag in the freezer. Not worth the calories and fat to me. Some reviewers seem to prefer those, to each their own, I guess, Micky D's sure sells a lot of them. Not for me.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "I absolutely love this place.  Their burgers--juicy, fresh and just delicious.  I love their fish-and-chips--real homemade chips or fries, your choice.  Their fried seafood is just so good.  I love their hot wings and other appetizers too!  \n\nThe service is good, as it is run by the owners only, and they're friendly and quick.  \n\nSeating is limited, but take out is good, so long as you're not driving too far.  \n\nCash only policy.  It's worth going to the ATM for it!  Trust me...I've done it way too many times.  :-)\n\nNote: This review is based on when I frequented in 2004-2007, but not since the 'remodel' that everyone else is talking about.  Guess, I will have to go and see what the fuss is about.\n\nEDIT 1/15/08:\nSame good food!  They take credit cards now!  And they have actual seating now!   \n\nFor you whiners, stuff it.  Let the rest of us enjoy our food.  \n\nGo, you go now! :-D", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Today was my first experience with Buffalo Burger. Ordered by phone, told it would be ready in ten minutes. It was! And it was still hot when I got it home. Double, bacon cheeseburger and garlic fries. The burger was perfect. huge and the fries were even better. Fair price. Friendly and efficient staff. I'll be back ... after several hours on the treadmill.", "author": "NEIL L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-30", "description": "My last review for Buffalo got flagged because I only wrote \"Ew.\" - I guess Yelp didn't think it was \"personal\" enough. So here's my very personal experience at Buffalo: it gave me the diarrhea and the chicken was dry. Granted it was $5, but you REALLY get what you paid for, aka it's not worth it.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "Great spot if you're in the neighborhood. \n\nThey've got some of the most reasonably priced burgers in SF, and they're tasty too!\n\n-1/2 star for having a $10 credit card minimum.", "author": "Murphy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-19", "description": "I was born and raised in Buffalo, NY.  Chicken wings (or as San Franciscans call them, Buffalo Wings) were also born and raised in Buffalo, NY.  I have high standards for chicken wings.  Buffalo Burger has OK wings.  They were a bit small, and not as crispy as they should be, but the hot sauce was good and the chicken was tasty. Not bad for the West Coast.\n\nI also ordered a Philly Cheese Steak, which was mediocre.  I know what you're thinking: \"What kind of asshole orders a Philly Cheese Steak in San Francisco from a place called Buffalo Burger Restaurant?\"  My answer: This asshole.", "author": "Nick F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "My two cents.  Foods great, service is lacking but not rude, just disinterested.  I eat here often as I live near by and I go for the food and take it home.  Great wings with a variety of flavorings.  Love the fries and onion rings were bomb.  Burgers and cheese steaks are on point.  If you want service with a smile go somewhere else.  If you want bomb ass food go here often.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-04", "description": "Meh. Meh. Meh. The burgers here are pretty boring. I was pleased by the amount of avocado I could get for a modest up-charge, but the buns they use are just terrible. The meat was cooked to post-apocalyptic, and there is almost no reason (and certainly none related to flavor) to pay $2 for the \"buffalo.\" (Is it actually bison?! I'm not sure.) What's making the joint 3 stars instead of two is how cheap it is. If you opt for beef (which you probably should do), you can get a cheeseburger for less than $5. Just set your expectations to \"under $5.\"", "author": "Luke M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-24", "description": "i didn't feel like a burger, so i ordered the fish and chips.\nnot terrible but nothing special either.\nrecent remodel on the dining space so it's cleaner than your average burger joint.\ngot to go for the wings next time.\nwatch for an update soon.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "their burgers are good. I really like them and when I feel like I want my day's worth of calories and I don't care how im going to get it, i come here. the ultimate burger is awesome, and if you have to get anything on the menu, be sure to get their garlic fries! they are the bomb, just don't let them get soggy.\n\nthe only thing about this place that I have to say is that sometimes I don't know if we get real buffalo meat. One time we ordered for it and noticed the meat looked more like beef. the patty's are pretty thin too. I would also call in to pick up if you aren't planning to eat there, because if you order there, you might have to wait a while for your meal. We waited for about 25 minutes. good place though, definitely try it out.", "author": "Katie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "Good food, good price. You really can't mess up a burger, but you have to try their homemade fries and chips! There's nothing special about this place except for that, but if you ever crave a good burger and fries and don't have much money, Buffalo Burger is a good place to go.", "author": "Sara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-10", "description": "5 stars for the best fresh chips!\n-1 star because their fish should be called batter.\n\nI came here with my bf today because I was craving fish and chips and he had a brilliant idea in taking me here to fulfill that urge. I ordered 2 pieces of fish with their lovely fresh chips. It looked delicious until I saw my pieces of glistening, greasy battered filets of fish. Sigh. The kitchen didn't need to hurry that much! I was glad that I got what I wanted but not what I was expecting.\n\nOne thing and only one keeps me coming back here and it's the chips. I buy a large bag and I'm good to go. I haven't tried much else but I'm content with that for the time being while I finish NOM'n on the golden crisp goodies in my brown bag. :)", "author": "Carol L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "In short, totally friendly on the wallet, food was delicious, and an abundance of drinks (diet Pepsi and diet Coke? Heyyyyyy).\n\nKinda of place that has you thinking, What makes this so good? Eff it, I don't care, it's that good. Also, don't let its semi-hole-in-the-wall appearance fool you, it's anything but. You could get a far less amazing, more expensive burger at a bigger, fancier venue. Trust me, I know, its happened to the best of us.\n\nOne of my favorite things was my burger actually came with food on it, none of this \"would you like to add lettuce or tomato?\" Each vehicle comes STANDARD with plenty of lettuce, tomato, onion, pickles, and sauce. \n\nTry the Avocado burger like I did to ensure meal happiness.", "author": "Kendra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "Used to come here all the time when I worked in the area. They knew who I was when I called in because I always ask them to cut my burger in half. \n\nI only get the spicy bacon cheeseburger with everything on it burger. Love! The spicy sauce they use is the same stuff they use on their wings. I love that they fry their wings so there's a crunch and then they smother it in sauce. Extra spicy is perfect and will make me break a sweat while numbing my lips. Yum! I love the chips there too! Fresh and  crispy. Only big boo is that they charge for ranch... \n\nThe owner is super friendly and I don't recall I time where knave been there and he hasn't. Whenever I crave a burger and don't want to go far, I come here.", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "I love Buffalo Burger. For three years I've been going through phases of my favorite things there. First it was the burgers. Then it was the Buffalo Chicken sandwich, now it's the wings. Everything I've had there is just perfect. There's nothing I would change about it. Awesome bread, delicious meat, very saucy and never dry.\n\nThey have buffalo meat too. And buffalo wing sauce. They even have lemon pepper wings, which is pretty rare here. \n\nBut the potato chips. Holy potato chips. They're the real winners. Homemade potato chips, mandolin-ed and deep fried idaho gold.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "I go to this place often because it's just down the street from the apt. I've eaten in and picked up take-out. The food is ready fast. \n\nSo, the place has burgers, wings, fish&chips. All the food groups. The burgers are ok. Nothing really fantastic about them. I LOVE a good hamburger and I hardly ever order that here. \n\nWhat do I always order here that is absolutely top-notch? The garlic fries! They are super-duper tasty. So garlicky and awesome. Just fantastic! I can't get enough of them. They also have homemade potato chip thingies. They're very good as well. I also order the fish & chips a lot. Surprisingly, the fried fish is decent. It's perfectly crispy on the outside and the fish is delicious. \n\nWarning: The cheesesteak sandwiches are NOT the traditional cheesesteak you're probably thinking of. I think they use teriyaki marinated meat for the cheesesteak, so if you're into that sort of thing, give this place a shot. Especially if you love garlic!", "author": "Malisha J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "Man this place is packed tonight! Their Philly Cheese Steak is boom!!! Don't forget their fresh cut chips cause it's off da hook!!! The people there work so hard and are super friendly.", "author": "Michele T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-27", "description": "I came to this place because my friend recommended it. She loves their homemade chips.\n\nFood:\n\nBuffalo Potato Chips: Crispy not soggy, fresh, not too greasy.\nBuffalo Wings: It had a lot of flavor, a tad bit hot for me.\n\nIf you are want to get some wings and chips, this is the place to stop.\n\nEnjoy!", "author": "Irene L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-14", "description": "Man I was hoping for a nice tasty burger but I was let down by a variety of factors here at Buffalo Burger.\n\nAt first I thought it was a place that specialized in buffalo meat burgers, which they may, but the logo on the signage was that of the buffalo wings style places (which I do love actually!). \n\nAnyhow, I decided to test out a standard burger as I always do at a new place so there's not too much to confuse the palette.  So the good thing was that they had onion rings, but it was $2.95 for a side of them which you can see in the pic I uploaded.  Then the ranch was another $0.50 as well -  that was a bit high it seemed, but I know how you have to maximize things as a small biz.\n\nThe burger itself was decent, but a bit oily and I guess when it's a thinner patty it's hard to get one that's actually medium rare as it was cooked much more thoroughly than MR.\n\nI think post-hangover this place would be better than just a straight up lunch/meal..", "author": "Gene X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-09", "description": "This place is overrated. I've been here twice. \nEverything here is really greasy, ESPECIALLY the chips. The buffalo meat was dry. The chips and french fries and fried fish were all under seasoned. The first time I went here, the fish batter on the fish was too soft but the fish in it was cooked perfectly. The second time, the batter was good but the fish was a little overcooked/dry.The buffalo wings taste a bit odd and the ranch sauce for the celery had dry lumps on the bottom like it was old.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "Attention potato chip fans:  *THEIR CHIPS- you HAVE to order their chips!*  SO, so much better than just french fries!  I got greedy and ordered the large size for $2.75- it really was enough for 4 of us to share!  \n\nI also ordered their Cheese Steak- it came out a bit different than what I was expecting but DANG- it was good!  It tasted more like a Teriyaki sandwich, dripping with yummy sauce.  A steal for only $4.95- I will definitely be back...real soon!", "author": "Judy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "Chicken wings are hands down the best. I usually get the 6 piece mild wings (some times they throw in an extra wing) which comes with celery and carrot sticks + bleu cheese dip. Pretty cheap for about $5.\n\nI've tried their garlic fries which were really good. \n\nCredit/Debit if over $10.\n\nHighly recommend this place!", "author": "Jen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-03", "description": "On a whim, I stopped in and ordered the Philly Cheesesteak with no peppers or mushrooms. Mushrooms should be right out anyway, not authentic. The cheese was Monterey Jack - not reasonable as a default cheese on a Philly Cheesesteak. The meat was freaking Teriyaki-flavored. This sandwich was absolutely nothing remotely like it should have been. But if sold as a Teriyaki Beef sub, it'd be worth one more star.", "author": "Joe G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-06", "description": "I was pleasantly surprise that their fish and chips here was pretty good!!!  I knew it was frozen but it's probably one of the best frozen fish and chips that I have ever had.  I asked them, in a very polite manner of course, if these fish filets were frozen.  He said Yes they are!!!  Then he goes on to explain the reasoning behind frozen fish filets.\n\nThe reason why they choice frozen over fresh is because it is less oily.  I go really?!?  He goes absolutely.  He goes on to tell me that there is far less oil on the frozen one than the fresh ones.  I had to agree with him while I was eating.  The fish was surprisingly moist and the batter was crispy. I am still a little puzzled by the moistness from a frozen fish.  The tartar sauce was good and the fries that came with it was good.\n\nSo........if you are ever around the richmond district in San Francisco and craving for amazingly moist fish and chips that are frozen.  Look no further!!!!", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "This place is great for a quick bite to eat. It's not to pricey and has a sizable menu.", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "I'm not reviewing this based on the service, because there isn't much service involved. There is only this one guy who takes your order and maybe 1-2 guys in the back (but visible) making your food. \n\nWhen your order is ready, that one guy who took your order, brings the food out to you.  \nHe doesn't enjoy his job and he is bored out of his mind so you will not see him smiling.  \nHe needs you to make a decision and not be indecisive. \nHe needs you to make the order clearly and quickly and he will not be patiently waiting because he is annoyed with you.  \nDo not change your order after he started writing it down on his notepad or he will be very upset.  \nDo not ask others in your party what they prefer and be wish-washy about anything, or else he will not be happy with you.  \nYou must not pause while making your order.  \nDo not think too much and just order already!!!  \n\n oh dear! the pressure of standing there and ordering food from him was stressful!! I was sweatin' beads!  *phew*  now that you've ordered...go sit down and wait for your food. \nThere is a T.V that's always turned to some sport channel or the news; watch it.\n Do not try to change the channel or ask to have the volume turned up. Just watch it. \n When your food comes, you will eventually tune out everything and not even notice the T.V so why bother making any adjustments?\n\n It's a messy ordeal, these chicken wings and hamburgers!  Expect to eat like a man. No, not like Kim Kardashian for Carl's Jr.  but more like Conan the Barbarian for Buffalo Burgers! \nTake BIG bites confidently, chew and taste the meat, let the juices drip everywhere, just go buck-wild!! Stuff your face!!! The rest of the world just becomes a blurry background/white noise because the burger is all you can see, feel, smell and taste.  You can hear yourself pigging out too..and it's not a pretty sound but damnit, who cares!  \nYou know you've just had a pretty damn good burger when you burped and the taste of your burp makes you want to order a second one to save for later! =)", "author": "Tu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "Been coming here ever since it opened some many years ago. Ive tried most menu items but have grown to like the Bacon avocado Burger the best. Hot dogs are also good. The managers and operators are all quite friendly. If the place wasn't any good I wouldn't eat there so often. \n\nYou can order pick up via phone. $8 minimum to pay with card. It is right by the 38 stop. Food usually comes quickly, and is brought to you. You can watch TV.", "author": "Arjun S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "I went here once with someone. Their portions are so big and we got some garlic fries here. It was good and I really enjoyed it. They have other foods on the menu too. I think it's near Walgreens and Ross and at a bus stop in Geary street.", "author": "Serena Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "Had a buffalo burger here...pretty good, better than regular burgers, better than Nation's...ordered a 9 piece buffalo wings next time n they gave me 12 pieces...tasted great! Addicted to wings now...their original spicy is kinda hot and sour ish, and once in a while I just crave for it and have to come here or the one at Lombard, depending where I am at.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "I love the leaner meats, so when I see the opportunity to try out a new place that has buffalo, I go for it!\n\nUnfortunately, the buffalo burger I had here was pretty tasteless and dry.  No complaints about the bread used in the burger or the lettuce/tomato etc.. etc.. but also nothing to write home about either.\n\nI also had some onion rings.  They were just ok.  I can't say that I could tell them apart from an onion ring from any fast food joint.\n\nThere's a buffalo burger place over in west portal that I can't remember the name of (but it's the only one over there duh..) that I still think of as the #1 destination for a reasonably priced awesome buffalo burger.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "Onion rings are outstanding, burger pretty good, fries were weak.  Long waits.", "author": "April M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "Honestly the burgers aren't that great. Not bad, but not great. The thing is, they have AWESOME chicken wings. Like seriously they are super tasty. Fuck the burgers bro, order some spicy BBQ chicken wings. DA BOMB.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-24", "description": "Avoid, they lied about garlic fries being garlic fries to save themselves some work and then closed. Sad face. Food otherwise 'was not terrible'.", "author": "Russell S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-03", "description": "i broke the cardinal rule... \n\ni went to buffalo BURGER restaurant and ordered a philly cheese steak and buffalo wings. \n\ni'm the first person to give my girlfriend a hard time for ordering steak at a seafood restaurant... or seafood at a steak restaurant. the other day we went to Himawari (ramen) and we saw this table of 2 order fried rice and we were clowning them so hard. i mean who goes to a hot pot joint and orders chow mein? you get the idea right???\n\nwell... i was that guy when i ate at buffalo burger restaurant. so in all fairness... this has nothing to do with burgers... but this review has to do with their poor excuse of food other than burgers that they serve there.\n\nthe cheese steak had no flavor, the beef was cut way too thick, and was borderline cold. the garlic fries were cold, soggy, and the garlic was still bitter and sharp/spicy. i asked if i could get another order of fries because mine were cold and soggy and the manager simply said \"that's how they come... they're a little soggy from the garlic\" so i said \"ok, can i get a regular order of fries... extra crispy?\" he did that for me at least. \n\ni don't want to get started on their buffalo wings... what is that SH!T??? is it tumor meat? barely describable and as thick as my index finger (at the widest part). it's hard to get full on some anorexic wings. \n\ni got to man up and admit i'm a dummy for ordering everything BUT the burger there... but that doesn't make my poor excuse of a meal acceptable. \n\ni wanted to leave half of my cheese steak there but my girlfriend doesn't like wasting food. so we boxed it and gave it to a homeless guy later. i don't know if i did him a favor though.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "An awesome hole in the wall place to get onion rings and other snack. I did some research on yelp before going. It has good reviews so i guess i will try it.  Once again, i went after my braces appointment because it was near the place. \n\nI ordered small cheese steak sandwich and onion rings.  My sis said she wasn't hungry but she wants a bite. Then she started to eat the whole half of the sandwich. I was like WHAT? The cheese steak sandwich is good. The onion rings are even better. THEY ARE THE SIZE OF MY HAND!! Where do they get the onions from?  \n\nNegative: IT'S IN RICHMOND??!\n\nWill definitely go back again. Recommended for onion ring lovers!", "author": "Lily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-25", "description": "I'm going to say it that this place is a dive. However, it is cheap and the consistency of the food is the same every time I come here. I usually get the 2 piece fish and chips and the fish always seems fresh even though I know that it is frozen. The chips are really potato slices that have been fried and salted. I also like the cheesesteak sandwich and the garlic fries here as well. The man that runs the place is always very friendly and he can recognize you even if you haven't been there in a while.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-02", "description": "This place is delicious! It's pretty damn cheap, and they have buffalo. And I love me some buffalo. And hamburgers, and fries, and hot wings, and a whole lot of other things that are absolutely terrible for me. At least I don't have to pay much to clog my arteries here! \n\nThe service is quick, and pretty nice, so I must say! I found another spot in the neighbourhood :)", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "The only thing that prevented me from giving this place five stars was not wanting my personal bias to get in the way too much. The first time I ever came here was when I was 12 (I'm 20 now) and I must say that is is an absolute staple for the Richmond district restaurant scene.\n\nFood wise, this place is exactly what you'd expect. They don't skimp out on their burgers, the flavor is good, and they've got plenty of menu options if you're not in the burger mood. Everything is fresh cooked and prepared quickly enough for you to be in and out in a matter of minutes. My all-time favorite is the fresh fried potato chips. Eat one, and you're hooked for good.\n\nThe dining area is a snug fit (But hey if you remember their old location, you know its like a convention center in comparison). The workers are super friendly, and know the faces of their locals. \n\nNow the prices have gone up some over the years. Not super high, but enough to make you kind of squint your eyes and go \"Didnt this used to cost...\" Im not sure if they even do the little combo thing they used to have anymore. But overall, this is a hot spot eatery if you're ever looking for an easy lunch on Geary Boulevard.", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-10", "description": "I love Buffalo Burger. A great asset to the Richmond District.  It is owned by the nicest folks around - Annie/Larry -  (they also own The Royal Ground next door)  The guys who work there are always friendly, the food is good for a buffalo burger place and the price is definitely right\n\n A couple tips\n- call your order in ahead - 10-15 minutes\n- get the fries extra well done with a side of buffalo sauce - yum!", "author": "Noah W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-28", "description": "This place is a hit or miss, the wings can be good....but most of the time is just alright. it tends to be dry and needs more sauce. The only thing i feel is good here are the potato chips. Oh one more thing, the guy with a hair bob thing and eye liner who takes your order....depending on his mood he could be nice, but from my experience he seems pissed all the time. So if he's taking your order and he seems rude or he's rushing you just tell yourself the chips are worth it.", "author": "R S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-25", "description": "The hope was for buffalo meet, but my cheap ass was saddened when I saw that to attain that goal, I had to pay $2 extra.  Alas, I went with the cow in the form of their Ultimate Burger topped with bacon, avocado, cheese and onions on a fresh hoagie roll.  The burger itself was actually worth four stars.\n\nThe three star status is because when I walked in, there was a party of little flies buzzing all around the seating area.  Less than appetizing and worth one star at most.  The second reason for the three stars is because I ordered the garlic fries, which could have been amazing, but weren't.  They were soggy and somehow too salty, but needing salt at the same time.  The garlic itself was somehow bitter, pungent and lacking flavor all at the same time.  It was like when you smell a delicious sauce and saliva starts pouring out of your mouth, then you take that long awaited bite and....nothing.  It is the mystery of mind blowing smelly goodness followed by taste bud tears at the lusterless flavor.  Another good way of putting it, for you men especially, would be the foodie's equivalent to blue balls.  \n\nFor a quick, fresh burger, it'll work.", "author": "Tyler B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "I've tried the chicken wings here & they were pretty good! Got the garlic pepper and teriyaki chicken. Also tried the garlic fries & those were really good as well.\n\nI've also ordered the Philly Cheesesteak & that was pretty decent. Not the best, but I'd get it again if I couldn't decide on anything else.\n\nTry their Banana Milkshake!", "author": "Danika H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "I've been here a couple times and I am hooked on the Turkey burger! :) IT is sooo good, a little pricey for a burger but I think its worth it. I came here with the bf and he got a turkey burger, I ordered a supreme burger aka. philly cheesesteak toppings on a burger. Was not as good as I thought it would be, bf's burger tasted so much better. \nEver since.. hooked!", "author": "Lily K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-26", "description": "A very easy-on-the-budget burger place with good selection of 'hand foods'\n\nIt's really hard to beat buffalo burger's price.  A bacon avocado burger, fish and chips, 6 wings with 2 canned soda cost $20\nBased on value for your money this place deserves a 5 star\n\nThe food themselves were good.  Not great since the chips were not crispy and the wings were not juicy but good enough.\n\nOn the downside while they do serve your food fast they got our orders wrong.  The bacon avocado burger came avocado-less.  Not a big deal in the grand scheme of things.\n\nThe other downside is that the place is pretty small and during dinner time you probably won't get a place to sit.  However, this is probably an excellent place to buy food-to-go.\n\nAll in all if you're in the Richmond and craving for tasty, greasy food this is a very good option.", "author": "Andi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "Having lived in the Inner Richmond (well...closer to laurel heights) for well over a half a year, I constantly think about what the IR is missing.  For me, what was lacking was good cheap american grub.  By grub, I mean anything that is fried and tossed in a basket.  Enter Buffalo Burger.  Open until 10 every night, including Sundays.\n\nWhat it is: A dive burger bar with a huge selection of heart-attack.  \nWhat it isn't: Expensive.  Also- not cuisine.  But it's not as though they are pretending to be fine dining.\n\nThings you should try: \n\nGet some friends and split a 50 rack of wings.  They'll happily split the wings into at least 2 different flavors, and they came w/ all the condiments (ranch/blue).  The spicy wings were excellent and vinegary like a good buffalo sauce should be.  The lemon-pepper were good, but a bit greasy.  At the bulk rate of 50 wings, it comes out to be about 50 cents a wing. \n\nThe garlic fries should come with a warning that you'll be sweating garlic for the next day and a half.  Fries still retain their crisp shell while holding thick clumps of garlic.  A-mazing.\n\nThe Philly Cheese Steak is a mess, but the juices from the steak-chop combined with the onions and molten cheese is divine.\n\nI would pass on the Onion Rings.  They were passable, but nothing special and for the price I'd rather get the Garlic Fries every time.    \n\nThe best part: you can stuff your face for less than 10 bucks every time and leave hating yourself and checking to see if your gym membership is still in effect.", "author": "Richard Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "I've been going to this place for over 15 years and watched it grow from one small counter and 3 tables to a nice little restaurant. Annie, the owner, makes the best burger I've had here in town and I do love a good burger. Good meat and friendly service. No gourmet style, just hearty american burger faire.", "author": "Robin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "Did you know...\n\n- Depending on the cut of meat, buffalo/bison can be up to 80% leaner than beef?\n- Bison meat has 35% less cholesterol than beef?\n- Bison meat has 30% more protein than beef?\n\nAccording to the USDA Handbook, just over 3oz of bison meat has roughly 2.42g fat + 143 calories, while a little over 3oz beef has 9.3g fat + 211 calories.\n\nSo with facts like that, I'm practically doing my ass a favor by eating here and ordering up one of the delicious buffalo burgers. In fact, that totally leaves room for cheese, bacon, and mayo. After all, I tell myself, the bison is HEALTHY for me. So I then shove all the homemade potato chips and fries I could possibly want into my mouth and add a soda to my evening.\n\nAnd you know what? The delusion works. My pants feel LOOSER!", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "Finger Licking Delicious Wings + HDTV Flat Screen  = Ultimate Happiness!!! \n\nWhen you don't live with cable, you need to find a place that has sports playing on the screen.  I'm talking about the NBA Semi-Finals 2010!!! \n\nAs soon as my fiancee and I stepped inside this restaurant, we had an instant connection with the manager.  He was glued to the TV while he was working.  This made us even more happier. :D\n\nSo, let's cut to the chase on what to order. \n\n1) Get the 26 wings.\n   (Comes with celery & carrot sticks w/ bleu cheese dip)\n2) Flavors:  Spicy & Spicy BBQ \n3) Side of garlic fries!!!!!  \n\nTotal of great food = About $20\n\nNBA, great food and people is PRICELESS.\n\nHappy Yelping!!! \nAnd...\nGo Lakers!!!", "author": "Deborah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "I went in here today with my friends for lunch and ordered the 13 pieces for $8.25.  We were only allowed to choose up to 2 flavors so we chose peppered lemon and teriyaki!  The peppered lemon was delish!  The flavors were there and didn't overpower the chicken taste.  On the other hand,  I wasn't that satisfied with the teriyaki wing.  It just didn't suit my tastes.  Not saying it's bad though! I was actually pretty satisfied with the customer service even though it was a long wait for our order to come.  They also gave us an extra wing (totaling up for 14 pieces) which I thought was very generous since I was sharing with my other friend.  I would come here again to try other flavors and also the garlic fries that are so famous!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-12", "description": "Generic clean hole in the wall place with a tv on the wall. \n\nOk for a quick bite if you're on the go or just real hungry and can't wait. \n\nThere are a lot of things on the menu. It's kind of scary cause the menu is on a giant blue back ground and it reminds me of the 'blue screen' of death when a computer breaks down.\n\nTakes credit cards. Clean restroom. Convenient.", "author": "Daniqua J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "BOMB WINGS! Flavorful sauce on a juicy wings. The wings are drenched in the sauce like some places. It was fantastic. I got spicy sauce and lemon pepper sauce. The lemon pepper let me down a bit I have to say (minus 1 star).\n\nWe also got the fish and chips. The fish was so soft and tasty. The batter was crispy and delicious. Overall the best fish and chips in richmond and sunset. I definitely will come to this place more. It's cheap, good tasting food that is not super greasy or unhealthy. \n\nPros:\n- Cheap\n- Great Spicy Wings\n- Great Fish and Chips\n- Good Location\n- Friendly, Quick Service\n\nCons: \n- Bad Lemon Pepper Wings", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "I must say these are some of the best onion rings ever! Also the buffalo chicken is good. I have a feeling the food from here is fresh and not left sitting out. The service is usually quick when I have ordered to go. Located on Geary. Highly recommend some onion rings!", "author": "Austin P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-27", "description": "Fries seemed like they'd been frozen for some time and the buffalo patty was fairly low grade meat. Not sure how others are rating it so highly.", "author": "Brendan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-22", "description": "Having lunch and getting my usual 13 wings with half spicy and extra spicy. This place is one of the few buffalo wings that that I go now. I had the buffalo burger before and it was cool. Their cups are fresh and good but don't get it by yourself. I think you can share with three people.", "author": "Minh H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-22", "description": "The burger was pretty good, but the patty really wasn't that big, either around or through.  For the price, I figure it lived up to its expectations.\n\nI've cancelled the rest of my weekend's activities, because surely the garlic from the garlic fries will still be coming through my pores over the next 48 hours.  I think it's recommended that you wait at least 72 hours before undertaking strenuous activity or strain after such an attack.\n\nIf you're into vinegar-y, extremely tangy buffalo wings, then these are for you.  The best buffalo wings, IMHO, aside from those that come from my own kitchen, are those from Kezar Pub.  Buffalo Burger's wings also have the tiniest amount of meat I've ever seen on restaurant wings.  I guess they don't get them from Costco...", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "We've lived across from this place for a long time. This is our go to take-out when we are hungry & can't figure out what to eat. Wings are my go to, chicken gyro my husband's. But I've had most of the burgers on the menu, all good. We always order pick-up, they always say 10 minutes, & food is always ready on time. For 5 years they have never disappointed.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "My go to neighborhood spot for some cheap & good burgers! I usually get the regular hamburger, but I replaced it with the Hawaiian chicken sandwich!!!! It's cooked with teriyaki sauce & topped with a slice of pineapple. Every time you bite into that thing, all this juicy goodness comes out lol....It's only $5.25 too, what a steal! Aside from that I can do without the fries since I'm not a fan of their fries, but it's up to you cuz who eats a burger w/o fries right? In this case me.", "author": "Diane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "This place is not your fancy burger joint. It's all about a high quality buffalo burger that is consistent and tastes great. I would highly recommend their BBQ burger with bacon added and while you're at it don't be shy to try their garlic fries.", "author": "Damoon M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-30", "description": "It is difficult to ruin a burger, but it is even more difficult to make a burger exceptional.  Buffalo Burger is comfortably burrowed in the middle ground.\n\nI had the mushroom burger with cheese fries, and was starving at the time.  Usually when I am starving, my taste buds are universally accepting of anything edible.  This time, though, after my first bites of the burger and fries, my taste buds were on their guard.  The burger was standard, with the usual dressings of onion, lettuce, and tomato, but the bread was immediately soggy, and the meat's main flavor was salt.  The fries were starchy and limp, drenched in nacho cheese sauce that was more fit for an elementary school fundraiser.\n\nWhen I evaluate a burger, I deliberate if I could make a product of similar quality to conclude its worth.  The answer to this question for the mushroom burger was a resounding yes.\n\nIf I still have time to consider the burger, I compare it to a Carl's Jr. burger and decide which one I would rather have.  Almost immediately, my taste buds pined for a six dollar burger over the one I was currently occupied with.\n\nThe burgers are mostly under 5 dollars, making it attractive for a cheap, on-the-go meal, but I would not revisit this place unless I were desperate.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "Nice find!  Tiny tables.  I really liked it, my husband thought it was ok as his Philly cheesesteak had too much sauce.  He felt the meat had enough flavor they didn't need to slather so much sauce on it.\n\nThe fish and chips IS good!  I just ate the fish inside but it was so moist and tender.  The batter was nice and crisp, but I try to avoid eating too much of it.  The tartar sauce was AWESOME.  The fries is also AWESOME.  I also ordered a teriyaki shrimp with rice plate.  I say don't bother with that.  It's just rice with cabbage, carrots, shrimp all slathered in teriyaki sauce.  \n\nNext time I'd try the buffalo shrimp or something with hot sauce.  \n\nFive stars from me, but probably 3.5 from my husband.  Average four stars - till I return then we'll see.", "author": "Mrs F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-03", "description": "Pretty good burger for the price.  It's honestly hard to find burger's at a reasonable price these days in SF, and Buffalo Burger does a pretty good job with the pricing.  \n\nThat being said, the burgers are also pretty good ,but I don't like how the bun is usually soggy if you order one of the saucy burgers like BBQ, Spicy, or Teriyaki.  The burger tastes fine, and its good with their sauces, but a little too messy that it's hard to handle.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "I love Fish and Chips and I love to try it at different places. This place has some pretty good Fish and Chips. \n\nPrice- Decent\n\nTime- No wait time place is pretty small though but okay size\n\nWill I come back?- Yes.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "Just moved to the Richmond area and have been eyeing this place for weeks.  From the outside this place is average, but the menu is sprawling with options to satisfy everybody.  So one night I decided to order some to-go and I was not disappointed.\n\nBuffalo Cheeseburger, small chips and a Sunkist for like $10 bucks. Burger was delicious! Juicy and flavorful with toppings galore. Chips are so great. Crispy, warm version of a potato chip. A MUST.  Dipping sauces cost extra but ketchup is free. \n\nI'd definitely return and try the variety of other burgers, buffalo wings and cheese fries.  See you there!\n\nPS: It's open until 10:00 pm every night!", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "Can I get some clogged arteries on the side? Thanks. Just what I needed.\n\nThis place is some artery clogging goodness! Their food is good, service is always friendly, and prices are pretty reasonable. One of my favorite places in the Richmond district!\n\nYou gotta try their home made chips. They are delicious! I ordered their 1/2 lb Buffalo shrimp and chips (around $7). SoOo yummy! I love the buffalo dipping sauce. Their burgers are also pretty good...sandwiches...hotdogs...fish n chipps...just try it all and see for yourself!\n\nThank god I don't live around here. Otherwise, my fatass would be here all the time!", "author": "B B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-05", "description": "Not a bad burger place at all!  Their garlic fries are very tasty, but their burgers could be a bit tastier.  The strange location and cramped-like feeling I had while I was dining turned me off a little bit from this place sadly.  It's actually not so bad ,but the burgers could be juicier.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-19", "description": "The burgers are good, the fried fish filets though I hear are frozen, are still tasty, and the fries are crunchy.  M and I have both eaten here before, but we were women on a mission this time - to test the repellent effectiveness of their garlic fries.  We're both complete garlic-philes so we thought maybe we had found a place that would outdo Blondie's, right in our own neighborhood, but alas, Blondie's has yet to find a formidable garlic fry opponent.  Because everything else they serve here is pretty decent, they still get a solid 3.5 to 4 stars.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "i've been coming here for 10+ years now, and i'm sure i will continue to in the distant future! i always get the burgers or the fish and chips. the fish is always served piping hot, and the batter is fried to golden crispy crunchy salty perfection. i prefer the french fries, but the fried chips are really good as well.", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "This place is great ive been here quite a few times and have never had a bad meal and it's never cost more than $10 a person. There burgers, always tasty and the beef tastes really fresh, there chicken sandwiches are juicy and never dry (which is a far to common problem at many places) and even there gyros are tasty! Plus there garlic fries kick ass! Super garlicky and just the right amount if crunchy. The people that work there are always super friendly and even though they have a little sign that says there a $10 minimum for plastic they've never enforced it if my meal was like $8. Overall a great place to stop for a tasty burger or chicken sandwich or gyros if your in the neighborhood. i cant wait to try there actual \"buffalo\" burger! next time!", "author": "Dominique D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-09", "description": "Really wanted to like this place since its local, but couldn't.....the quality of the steak meat was really poor.  Grainy, already cook and stored in a huge tub....say no more.  The flavor was 1.25 stars at best.  Maybe we'll give it another go and try something different, but need to let some time pass to get over this recent experience.  Ughhh....", "author": "J J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "If I could give this place a 3.5 I would. The burger was pretty good (the ultimate cheese burger) and the onion rings were good too...but what really made it was the price! You cant beat the prices here. The only reason I gave it a 3.5/4 is because the burger wasnt AMAZING, good, not great. If youre in the area, give it a try tho...especially if youre short on cash", "author": "Tyler L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-26", "description": "Maybe I had a particularly bad burger here, but it was not satisfying. The bread was low-quality and dry. \n\nMy dad got the fish n' chips; I tried some and those were bomb.com so I guess there are some good things here. I have friends who love this place, so I don't know, maybe I just had bad luck that one time.\n\nFood is cheap though!", "author": "Trish P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "Food is incredibly affordable and delicious! My friends and I went here to grab a bite to eat. We've never eaten at this place before, but we had a great experience. The cashier who took our orders made a mistake on my friend's order, instead of taking the food back in exchange for another one, she just let her keep it and brought her a new fresh cooked meal. I ordered Fish and Chips and it was yummy. The fried battered flour doesn't overpower the Cod Fish because there is still a huge chunk of fish meat (they weren't skimpy giving you the real deal). Will come here again!", "author": "Clementine D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-22", "description": "Fck you buffalo burger!   This place used to be good. Saturday december 22, 2012  I ordered my burger. I got charged for bacon but it was not on my burger. And since i had already gotten home, I wasn't going to go all the way back. Also the burger was soooo effing burnt and dry. Never going back. What the heck happened to this place?", "author": "quentin l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-20", "description": "I like everything on the menu! Although it is a burger restaurant I'm a big fan on their take of a chicken gyro! I gave them a 4 out of 5 because the wait is rather long.", "author": "Julie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-19", "description": "I had quite a mix of emotions leading to my tasting the food at Buffalo Burger.  Allow me to elaborate.  \n\nCame in about 4 PM on a Sunday.  Place as nearly full.  Good sign.  I place my order (Ultimate Burger, small fries, large drink = $11).  I notice the cashier is taking her lunch break and having spaghetti.  Bad sign.  I also notice two people have left after barely touching their food.  Also bad sign.  The two guys who ordered before me and start chowing down.  One of them raves about the chips.  Good sign.  So far, 2 good signs, 2 bad signs.  Ohhh, this will be interesting!\n\nOrder is ready in about 5 minutes.  I dash home and plop down to enjoy my weekly pig-out feast.  Burger is fantastic - just the right temp, smorgasbord of toppings is neatly in place, avocado is a great touch,  onions are done just right.   Fries are solid.  Soda is refreshing.  \n\nIn most books it's only a 4-star, however I really have to place it a step above the other B-Burger joints in the Central Richmond and thus am crowning a 5-star here.  I'm just a little disappointed my next visit will not be filled with such exquisite anticipation.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-29", "description": "After our first choice ended up being closed, we came here as an early lunch alternative. In terms of the place, it's okay. Nothing special, but satisfied our hunger.\n\nIn terms of the location, its pretty cramped for a seat in, but there are enough spots where it shouldn't be too hard to find a spot to sit if one is looking for it.\n\nAs for the food, it was okay. We ordered a avocado burger and a chicken avocado sandwich. Both were decent. The patty on the burger tasted a little like what one would expect from a Burger King Whopper, but the additives like the avocado and mustard did make it stand out positively. The sandwich was also decent. It was a little dry, but still tasted good.\n\nWe also ordered a side a fries, which were also so-so. On the plus side, they weren't greasy, but weren't as flavorful as others we have had. An acquired taste perhaps, although to be fair we have had a lot worse.\n\nAll in all, the place was decent. Not something we would come back to, but it hit the spot for the hunger craze we had.", "author": "Sami R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "Mhhh Mhhh Mhhh Finger licking good! \nBBQ Buffalo Cheeseburger! \nSoooo goood!!! very nice staff! \nAlways have something good on the tv.", "author": "Jake R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "When the inner richmond used to be my major stomping ground I would usually come here for a burger and fries. Actually when McKenzies the dive across the street had the old owner Jay. I would ask them to deliver it there too.\nI just had a burger and fries here about 2 weeks ago. The burgers and fries are sold separately. I would love it if they had like a burger combo special, but not here. I always opt to get the actual \"buffalo burger\" and not the regular beef burger. It cost a tiny bit more.\n\nThe only eatery that gets more business from me in the richmond is\nWing Lee Bakery at Clement and 6th.", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-02", "description": "When I was in high school, this was the place I always went to for burgers. They had a good cook in the back and would make the burgers exactly how they should be made. \n\nNowadays its 4 years later and their new cooks are not anywhere close to being at par with what Buffalo Burger used to produce. 3 out of every 5 times my orders come messed up, sometimes I get a burger with just tomatoes, mushrooms, and onions. There was no lettuce or pickles or avocados. I ordered an avocado burger, and I was severely disappointed. \n\nA 3 star rating because of what Buffalo Burger used to be, and what it is now.", "author": "Andrew O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "Fish and Chips!  I've had the burgers and wings here, but fish and chips are the way to go.  Don't get me wrong, the burgers are good, but trust me, fish and chips.  fish and chips. fish and chips. fish and chips. fish and chips. fish and chips. fish and chips.  Just in case you didn't understand, order the fish and chips.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-24", "description": "Quick, Cheap & nice Burgers.  \nNothing else.  \n\nTip: Ask for extra veggies if you want a \"beefier\" sandwich.", "author": "Artnok A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "Everything I've eaten here has been quite okay - not great, but very edible.  The burger and sandwich portions are pretty generous, and they prepare orders quickly, making it a good spot to grab a quick lunch or take-out.  It can get a little busy in late afternoon, when school lets out a lot of kids show up.  Otherwise it's usually pretty empty but don't let the empty restaurant mislead you. Worth a try!", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "Very unexpected!\nThe garlic fries were pretty damn awesome!\nIt's hard to find a good veggie burger, but this place definitely had it. \nI was lucky enough to grab the veggie Hawaiian burger. I don't think I exhaled once during my gorge session...", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "Buffalo Burger is my favorite burger joint in the city.  Ultimate burger = A+.  My wife loves the mushroom burger, lemon pepper wings and chips.  Service is fast and friendly.  Family owned, very nice husband and wife team.  Easy parking for pick up - just use the 38 bus stop!  Love this place!  Not for fancy foodies that eat their burgers with a fork and knife, but lovers of good ole greasy American food.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-04", "description": "This is stop #1 to recover from a vegan restaurant that my wife took me and the kids to - I'll get to the Buffalo Burger review in just a moment - wtf is with a restaurant that doesn't serve any slain animals?  They also have the nerve to name their entrees things like the 'Grateful', or the 'Enlightened'. Is this so they can charge $17 for a ceasar salad?  Please shoot me.\n\nOn 2nd thought, I'd rather die from a good-old American-style heart attack. Enter Buffalo Burger.  I could eat here every day, but I'd like to live to see my kids graduate college, so i only go 2-3 times a week.  I usually get the 9 piece spicy wings, which are fried so hard that they have a crispy kind of shell, and nice and hot.  The fries are great, and they refill their ketchup bottles, so you don't have to shake the bottle for 10 minutes - you get half a bottle in about 0.5 seconds. \n\nYou can get fried oysters, shrimp, scallops, fish, and just about anything that would be fried on a grill.  Also, no pious waittress nodding in approval because you ordered some brown rice sushi disaster.\n\nBig screen LCD TV.  They had a recent renovation - had to make the place bigger because they kick so much ass.\n\nFor the temporary pangs of guilt, as well as strategically-placed roughage between your burger and the chicken wings, they give lots of celery and carrots...\n\nOh, you can get a caesar salad there, they call it the \"caesar salad\"\n\nYou can stuff your face for less than ten bucks.  I'm training my twin sons to prefer deep-frying over all other food preparation methods, and I'm succeeding with my partners at BB.", "author": "tom p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-03", "description": "This is honestly one of my favorite places in the City, and my absolute favorite Burger place.\n\nDo yourself a favor and get a burger.  My personal favorite is the BBQ burger.  I often add Avocado to it, and it is divine.  The BEST burger for your money that you can find.   $5-6 for a burger twice the size and four times the quality you would get for the same price at any chain (Mc Donalds, BK, Carl's Jr., etc...).\n\nThe fries are also really good, but I am usually too full after the burger to fit much else in, and usually end up splitting an order of fried with 1 or 2 other people.\n\nThe fish and chips are okay....  The Fish could be better.  The fries are great.\n\nThe flat-screen HDTV means I can watch sports while I eat, and the seating along the window, facing out means I can also people-watch with friends as I eat.\n\nI make sure to stop in every time I am home from college.\n\nGO HERE FOR THE BURGERS AND FRIES!", "author": "Jo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-24", "description": "Good, juicy, flavorful, and plentiful. I ordered the Ultimate Burger and it was one of the best tasting burgers I've had in a while. \n\nLong wait though, like 15 minutes for our two burgers to get to us. Guess quality takes time. \n\nI'd call in advance next time and to go too.", "author": "Johnny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Love this place. Have been coming here since before there expansion when it was just a whole in the wall. Food has always been good. Burgers are great, chicken wings are great, and I love the fish.  We will always stop here for a great bite to eat.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "One of my new favorite places to go in the neighborhood.  The prices are fair for what you get.  Have tried their Buffalo Wings, Burgers and Fries.  So far so good.  I've run into a lot of places in the last few years where I haven't enjoyed my burger.  Something was wrong, either the patty was too loosely packed, the bread wasn't fresh, the meat tasted like a non-burger.  Whatever it's been, something's been slightly off but here I found that the burger tasted very meaty, just the way I like it and it was pretty big and wide and cheaper than alot of other burger places I've been.  \n\nBuffalo Wings are also pretty good and I do get the cravings for some good buffalo wings pretty often now.....  \n\nThank goodness there's a place pretty close to home...", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "I am always in the mood for a good burger.  My gf, not so much.  Therefore, if I am to make a convincing argument that we should spend our hard earned dollars at a burger joint, it had better be good.  Buffalo Burger is the newest weapon in my arsenal of the \"burgers for dinner\" argument.\n\nThe burgers cost about $4.50 each; fries were $2.50 for regular, $2.95 for garlic.  I got an avocado burger, she got a mushroom bacon burger.  Both were flavorful, juicy and overall very good.  My one complaint would be that the bun kinda started to fall apart (with help from the meat juice).  I managed to scarf all my down, but the gf ate the patty and left half the bun on her plate.\n\nThe fries were great, just the way I like them.  Crispy, thick-ish, slightly overdone - not starchy/soggy/ or underdone in anyway.  We got a basket of both regular and garlic.  The garlic had tons of fresh garlic sprinkled over the fries along with a flavoring garlic powder.  We barely touched the regular fries, but they were good too.  One basket of fries would be plenty for at least three people.\n\nThe place was small, but there were about five 4-person tables and a counter to eat at.  While this wasn't the best burger I've ever had, it was very respectable and I will definitely return.", "author": "Thor M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "I always come here to get my hang over burger.  Which is not the best place to go when hung over because it's not fast food, but it's worth the wait.  the burgers are big & juicy. The fries are salty& greasy.  Milk shakes are milky & shakey.  They have other stuff on the menu but since this is a burger joint, don't get all crazy and order something else.  Stick with what they do best.  Oh and if you are paying with a card you have to at least spend $10, which it's easy to do.", "author": "ashley m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "Well considering I live only 2 blocks away, this place sees my face all too often when I am craving the grease soaked food to replace the alcohol in my system from the night before. \n\nThe food is exactly what you would think it is. The burgers are juicy and the wings are small but tasty. They do make these homemade chips which are not my favorite (sliced potatoes that are fried), but I would recommend giving them a shot. Onion rings are beer battered to perfection and for about $10 a person you can get the fill that everyone craves after a ridiculous night of drinking.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-27", "description": "If you've ever had even halfway decent buffalo wings, you will be very disappointed after you leave this joint - gross! Out of 9 soggy \"spicy\" \"buffalo wings\", I had only ONE drumstick! The rest of them were made up of mostly protruding bones.\n\nThe Philly cheesesteak was O.K., somewhere along the lines of being comparable to an elementary school cafeteria lunch.\n\nNot every meal has to be fine dining, but this place completely failed at even the bare necessities of very simple American cuisine. Money, calories, and taste buds wasted...\n\nSan Francisco, why is there a shortage of good buffalo wings?", "author": "Matt D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "I never tire of eating chicken wings and the delicious crispy chicken covered in buffalo sauce from Buffalo Burger always puts a smile on my face.  The wings may be on the smaller side, but I love the fact that they always give you a couple extra.   The BF and I usually get half Mild and half Medium - both are full of flavor and have just the right amount of spice for our tastes.  \n\nIf you enjoy the fiery hot spiciness that keeps your tongue burning all night - try the Fire flavor.  I have a friend who absolutely loves this flavor.  Unfortunately I mistakenly tried it once and it was the worst chicken wing experience I have ever had....seriously try at your own risk and keep a large glass of milk handy.\n\nTo accompany the wings, garlic fries are a must and the ones here are out of this world.  They are covered in garlic and just carrying them home from the restaurant to my house, the strong garlic smell permeates the air and the apartment.  It's so worth it.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "Whenever I'm in the mood for a good sized burger that hits the spot, I always go here.  Good portions.  Good meat.  My favorite is the Bacon Avocado burger with a side of fries.  \n\nThe place has tv's usually showing sports in case you are running out for food and don't want to miss the game.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "So far I have enjoyed everything on the menu execpt the chicken wings.  They deep fry them and then cover in sauce, a bit too greasy for my taste.  \n\nTry the home-made chips.  They are outstanding.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "9 Buffalo wings = good\nCheeseburger = better\nGarlic fries = hellsa good!!!!\n\nAll of the above for only $14.  How can you beat that!?!?!?  Stop reading this and check it out for yourself!", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-22", "description": "For everyone who raved about the burgers here: COSTCO. Look it up. They have these frozen patty things... SAME. Buns, too. The burgers are edible -- It's hard to get essentially pre-made food wrong.\n\n$13 for a mushroom swiss burger, 9 wings, and a Sobe. Yeah, I'll pass. Eat here only if you happen to be walking around the Richmond and your date suddenly says s/he will cut off one of your appendages if s/he doesn't have cheap red meat immediately. Otherwise, go for Asian -- you're in the Richmond, hello.\n\nOh, and the place is tiny, there's no ventilation, so it's smoky from the grill, and you're served your burger on a piece of paper in a red plastic tray. For those who gave this place five stars: what is upscale? In-N-Out?\n\nIf you're going to go somewhere better than a fast food franchise for burgers, get a real one with handmade marinated patties and handmade bread. My loud vote is for Chez Maman.", "author": "Perci N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-12", "description": "This place was so great!\n\nWe've been searching for a good burger and this place is the best in the Richmond we've found above fast food and below gourmet at a nice restaurant. \n\nThe meat is delicious - tons of flavor and juicy. I got the bacon avocado burger and it was nothing below superb. We also got the garlic fries and they're crispy, hot, and the best amount of greasy,and they DO NOT skimp on the garlic. Fast service, clean restaurant, and tons of options. Will definitely be going back!", "author": "Sam T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-16", "description": "Trust me.. I wanted to love Buffalo Burger like I wanted to be a fan of Ashlee Simpson. Her songs sucked so bad I really wanted to buy her albums so i could play them over and over to any my friends. But she did this retarded Leno interview and I couldn't listen to that crap for a million dollars. That's how I feel about Buffalo Burger... except if you have a million dollars I might go back. \n\nThis place is damn small. You can walk past it as I've done for a year without noticing it. It's about 5 yards wide... so it's cramped inside. The chairs are all rickety and the tables look like they were found off the street. Smoke from grill fills the small place quick. I've never seen more a couple of customers in there at one time. Yeah this seemed like my type of ghetto place that reminds me of home. \n\nI got the ultimate burger and had them double it. I need a big burger and this was the only way I was going to get. The cook told me I wouldn't be able to finish it so I added a large order of fries and a diet coke. He laughed and I figured the more the merrier. \n\nSo i sat down on my broken down chair and took a bite. The burger was ok but  I didn't find anything special with it. The fries were the worst. They looked more like thick potato chips.. hand cut with skin on.. and they tasted really stale. Ugh. I'm a big eater but I didn't want to finish my meal because it wasn't very good. But I did anyways to give the cook a good laugh. \n\nSo less than average food in a restaurant with bad decor.. Normally I'd give that one or two stars. But it's a hamburger joint in Richmond so you have to give it props. But the decor.. that's what I like. I wouldn't go on a first date here..but broken down tables, smoke from the grill..empty and it's near my house. it's a perfect place to break up with a girl. Feel free to give me a high five when you see a guy at a table consoling a crying Ashlee Simpson. Why don't you go La La that!", "author": "Dan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-08", "description": "$5 to $7 dollar burgers in the richmond 'hood.....dishing up burgers, wings, chicken sandwiches and fried anything.....fried fish...fried scallops...fried zucchini, fried steak fries, fried fried fried~!....a true hole-in-the-wall grease joint.....\n\nbacon mushroom burger...(buffalo burger for $0.85 extra.....).....1/3 lb. of buffalo....grilled medium-well...slightly dryer..less greasy than a standard beef burger....served up on a large bun....not much bacon..but crispy....bit of sauteed mushrooms for flavor....the whole construction fell a bit short...home grilled bbq burger feel...nothing spectacular....\n\nburger with fries and soda will run about $9....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-31", "description": "I can't think of what more I could look for in a burger place.\n\nMy buddies and I went here after the ballgame, walked in 5 minutes before the place closed, and instead of being treated as unwanted - cause I know how it is when someone walks in right when you're trying to close - the guy behind the counter struck up some conversation with us after our order, which is always nice.\n\nSpeaking of the order, hot damn, buffalo meat is pretty epic as far as tasty carcass goes.  Price was solid.\n\nSo my buddies and I get our stuff to go, leave the place, walk across the Geary and then across 17th to wait for the bus.  As we're waiting, eating our burgers, the guy runs out of the store, across Geary on a red light, and then across 17th to give my buddy avocado he forgot to put on the burger.  \n\nSeriously, the place is closing and we're the drunk assholes coming in at the bell to score food, and this guy still has the consummate restaurant professionalism to run through traffic to ensure that our burger order has been served to us as we placed it.  Outstanding.\n\nThere was no way I couldn't yelp that.", "author": "Matt R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-05", "description": "Really friendly staff! The people running this place know what customer service is all about. I really liked the spicy chicken sandwich. This place is great when you are in the mood to GREASE yourself up. I had the buffalo shrimp (battered, deep fried), I ordered them with fries (the staff gave me the house chips on the house as well), and potato salad, nothing close to a healthy lunch... but it did hit the spot. The only thing I would change is the size of the shrimp. The meal would have been so much more tasty if they were bigger instead of the tiny little guys. \n\nGreat for fast food and cheap, greasy eats.", "author": "Rada I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-27", "description": "I must have picked the wrong day to eat here. I came away unimpressed. I ordered the ultimate burger on a sesame bun, philly cheesesteak and small garlic fries. The \"ultimate\" burger (which comes with avocado, bacon, 3 cheeses and grilled onions) actually tasted bland and the meat was overcooked. The philly cheesesteak and garlic fries were ok. Just okay; nothing to get excited about. Bottom line, you get what you pay for. Also don't expect service with a smile. Lastly I wanted to note that instead of napkins they provide household roll towels???", "author": "Andyt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-09", "description": "Awesome burger place in the Richmond district.\n\nThis used to be a hole in the wall burger joint but now they have finally bought the space next door to expand the restaurant. Great new remodeled place but classic buffalo burger delicious grub. I highly recommend the hot link sandwich or a mushroom burger with swiss. You could get fries but why get fries when you can try their homemade chips. They are soooooo goood. Great prices as well and it will definitly fill you up.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "The East Bay was so hot I decided to wear flip-flops and shorts, thinking it would be nice and hot in the City.   But NO, I forgot, it's the City.  So to remind me that there was sun some place other than the City, my girlfriend suggested BBQ style burgers from Buffalo Burgers on Geary.  She heard about this place from her food buddy coworker who said the Buffalo wings were \"East Coast\" style and the fresh cut chips were kick ass.  So blame him if you don't think so.\n\nAfter a nice walk over and some frozen toes, we walked into a very small establishment that is Buffalo Burgers.  Nice guy behind the counter with a couple of guys working the grill in the back.  Buffalo Burgers is NOT a loud burger joint with a lot of \"character.\"  Buffalo Burgers is just a simple place with a menu above the counter.\n\nWhat we ordered:\n\nAvocado Cheeseburger *****\nBacon Cheeseburger ****\nOnion Rings ****\nBuffalo Wings ***1/2\n\nOut of ***** stars\n\nThe burgers were good at this place.  We both thought the charbroiled burgers tasted really good, hot and juicy.  I thought the burger was pretty generous for around $6, and that's not bad in the City.  The onion rings were delicious, crispy and not greasy, but for the price, we wanted more.  The wings matched what we expected for \"East Coast\" style wings, but again, not the price point we were expecting for what we got.\n\nOverall, I liked the food from Buffalo Burgers.  I wish some items weren't so expensive, but they were still delicious regardless.  In addition, the inbound 38 bus stops right in front of Buffalo Burgers, so it's quite convenient for bus travelers to get here.  I would definitely come back again for their burgers, and try the chips this time.  Buffalo Burgers is a nice place to get a burger.", "author": "Edmund Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "I love their fish and chips here! The fried fish (cod i believe) was very crispy and moist inside, and the chips were freshly fried. Their malt shakes are also very good because it was not too sweet and was not too watery. Next time I come here I must try the burgers which is what they are know for.", "author": "Philip T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "On Saturday I visited Buffalo Burger for the first time in 7 or 8 years!  I try to avoid burgers as much as I can, because, well, burgers don't go well with cholesterol medication.\n\nThis place was very different than I remembered.  Old dinky chairs and tables gave way to clean, efficient vinyl benches.  The interior looks cheap, just like a neighborhood burger place interior should, but tidy and even inviting.  There are about 8 tables in the whole place.  A plasma TV on the wall was the main attraction.  The patrons, patiently waiting for their burgers to arrive, tried their darnedest to feign interest in the Olympics crew competition.\n\nI don't know why I didn't order the buffalo burger, but I didn't.  I ordered a bacon and mushroom burger with Swiss cheese.  My friend ordered a mushroom burger with no cheese, and we split a basket of fries.  All this, with 2 cans of soda, cost less than $14.  That's really cheap, folks.\n\nIt took us a while to get our burger, but it was worth it.  Piled high on top of a slightly toasted bun were fresh veggies, quality Swiss cheese and slightly overcooked bacon.  The burger itself was a bit overcooked, but I suppose I should have asked them to cook it medium.\n\nOverall, good, solid neighborhood place, but I wouldn't go out of my way to get a burger here.  Bullshead at West Portal is a better option: http://www.yelp.com/biz/bullshead-restaurant-san-francisco#hrid:IymS0Yq1JwsF-8OBTqCK4g.", "author": "Yan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-21", "description": "I was hanging out with my friend today who lives in the Richmond. As the bus delayed me, we went to the Buffalo Burger Restaurant.\n\nMy friend knows I love chicken wings and she reminded me that I ate the wings at there Lombard Street location and enjoyed them.\n\nWe decided to get the wings to go, but it was a clean place. More upscale than McDonald's, but not a sit down restaurant with wait staff. The people who worked there seem nice and the order was prepared quickly.\n\nI enjoyed the chicken wings and we also shared a corn dog. So, there food is not exactly health, but it is certainly tasty.\n \nIf I lived closer, I would certainly go more often. If you are a New Yorker and/or love chicken wings, this is a great place to go. I saw some other dishes that people were eating and they looked good as well.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-27", "description": "they close @ 10 pm\ni gotta be honest, i am not a fan of the fries.  it is my personal opinion.  the freshness and authenticity are undeniable, but i prefer my fries crunchy airy and crispy, while buffaloes' are potato-y and root veg starchy, you know what i mean?\nthe burgers and sandies are fine, grilled cheese is a rip off, the wings are hot and vinegary good!  i like that.  this is a great place in the richmond.\nthey also have other random rice plates, wha?  its all good.\nthanks for reading!", "author": "yayoi s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-19", "description": "I see everyone else giving 4-5 stars but don't worry I loved it, I'm just picky with burgers I don't think they are the best. Came here yesterday straight after work. This place def stands out on Geary from the rest of the other mostly asian restaurants. The place is very small inside but enough room for sitting and it is clean as well. I ordered an Avocado Burger but I think next time I'd try something else. The fries were fresh and the food came at a good time. Big Plus=Prices. Well worth it. Cus I hate how some burger joints try to jip you for a $8 burger. C'mon! ahem** like BurgerJoint =( haha. \n\nIt's so far away from where I usually eat but heyy I love to just drive around the city until I find something. What better way to explore! You'd be surprised to find I've lived here most of my life.", "author": "Sarina I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-12", "description": "Their burgers are great and they will make onion rings for you even though it's not on the menu if it's not too busy (shhhhh... It's a secret!!)\n\nIs this place still open?  It looked closed. :(\n*extremely sad face here*\n\nUpdate:  I just heard they reopened and they're twice as big!!  Looks like they took over the space next door that was originally taken up by a vegitarian vietnamese sandwhich place  or something like that.  Ironic, don't you think?  :-)", "author": "Theron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-20", "description": "I came here because it's soooo close to my house, and I was craving the XXXSpicy buffalo wings (like Original Buffalo Wings on Lombard).  The guy is super friendly and always has a smile on his face everytime I go.\n\nThe buffalo wings were not exactly the same, but it was still good enough to satisfy my fatty craving.  The one thing I realllly love are the chips.  They're made out of real potato slices -- which somehow convinces me that they're not as fattening as Lay's potato chips -- and they kinda have a potato-like chewy center.  Sounds gross, but I love it.\n\nIt's definitely not a place to sit and hang out, but it's perfect for take-out.", "author": "Betty W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-05", "description": "Craving beef teriyaki with grilled onions? Then come on down to this joint! It's the best in town, I swear! Too bad I ordered a Philly Cheesesteak. How complicated is that? Seriously, why does my cheesesteak taste like teriyaki?", "author": "BORAMEY H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "I like Buffalo Burger for what it is. A decent burger in a convenient location (a coupla blocks from the BF's house). Sure, it's not the best burger in the city, but it certainly satisfies me when the craving strikes. Lotsa options for customizing your burger. It's filling and tastes good.\n\nTheir fries, however, are t3h awesome. Consistently good with their fairly thick cuts, crisp on the exterior, moist on the interior. The wings are pretty darned tasty as well... served with the traditional blue cheese and celery. I have yet to try much else on the menu, for my standard order here always includes a burger.\n\nThe service is fast and friendly, we always get our orders to go. Go order a coupla burgers, then walk across the street to get some beer at Rite Aid. What a night in this is!", "author": "Courtney P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "Pretty good stuff on the menu and since my friend got the veggie sandwhich, (tofu, green bell peppers and cheese) and liked it. It'd say that's an accomplishment. \n\nThe guy taking orders was very nice and friendly. I'd go back since it's in the neighborhood and customer service was good.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-04", "description": "I'm a wing addict.\n\nI love buffalo wings, but only if they're done right. And the wings here are the best.\n\nI judge all wings against these wings.\n\nThere's another location in San Bruno on El Camino... Sauce tates the same.\n\nGreat chips and my nephew loves the burgers here, he eats every last bite, including all the veggies on the burger. (he's only 8)\n\nI love buffalo wings. If you love buffalo wings, eat here.", "author": "Anita R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "Yum.\n\nThe hamburgers here are so good. The Chicken strips here are even better. But my favorite thing here is the freshly made chips. I tend to go here more often then not just to get a big bag of chips. When they closed down to remodel I went to one of their competitors but dropped them so fast once they reopened. \n\nThe staff is always friendly and quick to get you your food. The place is much bigger then it once was so now there is plenty of space to stay and eat. The prices for the quality of the food are very reasonable and if you are at one of the nearby bars drinking this place is a must if you are hungry and they are open.\n\nThere are better hamburgers out there and burger joints that are better but not by much.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "The East Bay was so hot I decided to wear flip-flops and shorts, thinking it would be nice and hot in the City.   But NO, I forgot, it's the City.  So to remind me that there was sun some place other than the City, my girlfriend suggested BBQ style burgers from Buffalo Burgers on Geary.  She heard about this place from her food buddy coworker who said the Buffalo wings were \"East Coast\" style and the fresh cut chips were kick ass.  So blame him if you don't think so.\n\nAfter a nice walk over and some frozen toes, we walked into a very small establishment that is Buffalo Burgers.  Nice guy behind the counter with a couple of guys working the grill in the back.  Buffalo Burgers is NOT a loud burger joint with a lot of \"character.\"  Buffalo Burgers is just a simple place with a menu above the counter.\n\nWhat we ordered:\n\nAvocado Cheeseburger *****\nBacon Cheeseburger ****\nOnion Rings ****\nBuffalo Wings ***1/2\n\nOut of ***** stars\n\nThe burgers were good at this place.  We both thought the charbroiled burgers tasted really good, hot and juicy.  I thought the burger was pretty generous for around $6, and that's not bad in the City.  The onion rings were delicious, crispy and not greasy, but for the price, we wanted more.  The wings matched what we expected for \"East Coast\" style wings, but again, not the price point we were expecting for what we got.\n\nOverall, I liked the food from Buffalo Burgers.  I wish some items weren't so expensive, but they were still delicious regardless.  In addition, the inbound 38 bus stops right in front of Buffalo Burgers, so it's quite convenient for bus travelers to get here.  I would definitely come back again for their burgers, and try the chips this time.  Buffalo Burgers is a nice place to get a burger.", "author": "Ed Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-06", "description": "$16.00 = 26 buffalo wings\nAllan, Melanie, Furisuko = fun friends\nLakers losing game 1 = woot woot!\nMy time spent here watching the end of the game and waiting for Allan's tattoo appointment at the oh so swell Picture Machine = Magical!\n\nthe wings were sweet for being \"spicy\" but the folks at the joint make it fun, they make jokes, in their broken english. LAKERS LOST LAST NIGHT!\n\nGame two i am waiting for you!", "author": "danny e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-31", "description": "Buffalo burger I've never been a big fan of this place, even in my youth it always seemed alright to me.  Anyways I dropped by here a few weeks ago as I need hangover cure and I have to say the food was pretty good my burger was really good, although I think the hangover helped it taste better. Anyways I also tried my friend cheese steak and it was alright really grease and not where as good as the the cheese steak shop. Overall the burgers aren't bad here and the price is firkin cheap compared to Bills. The fries here sucks, but I am snob about my fries, but then again I'm French. \n\nI was going to give this place a 3 but the food was dam cheap so an extra star for the price.  I guess yelp can say I'm a fan now. Great place to come after a night of drinking.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-23", "description": "I tried the fish and chips here, and it was good. \nI can tell the fish was fresh. The fries were good. \nThey give big portions, and I was not able to finish everything. \nI would definitely go back to try the buffalo wings and burgers.", "author": "Monina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-27", "description": "Came here super hungry and ready to eat a juicy burger, came out full of regret. UGH. Had the mushroom burger, fries, and potato salad. The meat is kind of dry while the sauce from the mushrooms was constantly oozing out of the burger with each bite. Overall a very heavy burger that did not leave me happy. The fries tastes disgusting, every bite tastes like seafood for some reason. Don't get me wrong, I love seafood but not as fries, sorry. And the potato salad was ehh, I had way better. And there was a miscommunication on the size of the a large potato salad. I was not happy with what I got.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-10", "description": "I love this place. The burgers and fries are so good. And the hot dogs are great too. There is other stuff on the menu, but I've never bother to try any of it, because I love the burgers so much.\nWait, that's not true. I ordered a salad once, and it was pretty dreadful. But I can forgive that because the burgers are so great.", "author": "Kristen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "Great burger joint, food can take a bit longer than you would want. For the price the value is there. Burgers use a sesame bun and the meat portion is perfect. Fries are excellent but need salt. They have a bunch of other things on the menu like fried fish and cheesesteaks. Seating is limited.", "author": "Joel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-08", "description": "It's a sunday afternoon (or morning) and you have a hankering for a drink. You're in the Richmond, where do you go? The Nags Head of course. Which is a different place during the day than night. Especially if you enjoy talking and smoking with 80 year old vets. Now this isn't a review for Nags, however a little known secret is that BB loves Nags so much, they deliver to us across the street. \n\nI don't even have to move my drunk ass away from the bar and the TV (Food network + History channel only in the off season) while tasty burgers, wings & fish & chips (note: order fish & fries! fish & fries! or else, you will quite literally get Chips) I have made that mistake before, and nothing is worse than a sad drunk. Also, if you forget a condiment, they keep everything behind the bar. \n\nThe wings have the best sauce I've had in town. Ever.", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-26", "description": "4 words: garlic. cheese. fries.  HEAVEN!!\n\ni bartend across the street, so i`m a regular when it comes to ordering at buffalo burger. everything is AWES0MEE here!  the fish and chips are one of the best i`ve ever had.  you get these big thick slices of fish, which are crispy on the outside, moist and juicy on the inside.  the burgers are big and juicy, topped with all the fixings [lettuce, tomato, pickles, red onions, etc.].  the wings are really tasty as well, but they`re small.  oh, and i love the fact that they`ll deliver to local businesses.\n\nthe garlic cheese fries are in a league of it`s own!  crispy fries, tons of aromatic garlic chunks, and ooey gooey cheese!  S0 G00D!!  definitely one of my newest guilty pleasures ;D  even the garlic fries by itself are delicious, better than gordon biersch...blasphemous, i know LoLx\n\nbottom line: you really can`t go wrong ordering food from here, and i intend to keep on ordering ;D", "author": "Dee W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-11", "description": "EAT AT YOUR OWN RISK! \n\nI went here a couple of weeks ago and ordered a TON of food to go. While I was waiting; I watched the chefs stick their bare hands in raw chicken and touch prepared foods over and over and over again!!! The straw that broke this camel's back was watching one of the chefs come in off the street, go straight to the kitchen, stick his hand in the bucket of raw chicken and go straight to make someones turkey sandwich. NO ONE EVER....NOT ONCE...WASHED THEIR HANDS!!!! I was watching the ENTIRE time! \n\nI complained and demanded my money back. Even when I complained; not one chef washed their hands. They just kept on cooking and wiping their NASTY raw chicken hands on their aprons! This place needs to be shut down and fined BIG TIME!!!!", "author": "Karla F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-18", "description": "The burgers are okay for the cost. The person that called them Costco burgers might be right, but at least it's a real grill and not too bad overall.\n\nThe fries rock - real hand-cut fries and potato chips. Come for the fries.\n\nThe buffalo wings are fair - and that's what I first came for. I like mine crispy and big - and while they tried to make them crispy, these were small mini wings.\n\nThe place is a total hole in the wall, and you would miss it if you didn't pay attention.\n\nNot bad for a quick bite, overall.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "When I am too lazy to cook dinner, this is my run to place.  Satisfying burgers and their chips are always fried crisp and never soggy.  I prefer to call my order in and just pick it up (they usually  have it ready in 10-15 mins).  This is a great  little place for a burger (decent prices, too!)  I will be coming here for years to come :)", "author": "Maggie U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-16", "description": "I stopped by Buffalo Burger yesterday afternoon for a cheap bite to eat. I had their 2 piece fish and chips, and my fiancee had their 1/3 lb buffalo burger. The food came to us hot off the grill, and it was pretty damn tasty. The fish was, well... fried, but the fries were damned good. Over all, the fish and chips were decent for the price. Though next time I would go for the buffalo burger. I had a couple of bites, and it really was good. I've had better burgers, but the price is right, and the location was convenient.\n\nGive it a shot if you're in this part of town. Be warned, however, that the place is t-i-n-y!", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Me and my bf stopped by on our way home tonight.\n\nWhat drew us in was the different selections of the menu- burgers, sandwiches, fish and chips, gyro's, teriyaki bowls, milkshakes etc. and most importantly the cheap prices. We ordered this for $19-\n\n-mozarella sticks\n-cheesesteak\n-2-piece fish and fries\n-1 fountain drink\n\nMy bf had the cheesesteak and he enjoyed it. I got the fish and chips and i was happy too.\n\nWe left satisfied. If we are in the area again we will probably go, i want to try a shake or a root beer float next time!", "author": "vanessa g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-21", "description": "A few years back, I was hit with a buffalo wing craving. It was weird. I had never had a buffalo wing craving. I didn't know where to go, since I had never had such an urge. So then, where did I go to to feed this craving? \n\nUnfortunately - No, not buffalo burger.\n\nI went to TGI Fridays. \n\nThe craving was eased, but had not gone. I needed that firey, vinegary goodness. The tearing of bone and cartilage. Gnawing to get every bit of chicken.\n\nThus, the search went on for a buffalo wing that would satisfy my new found desire.\n\nThen, it finally hit me. Duh. There is a place called BUFFALO burger 5 mins from my house. DUH.\n\nAnyways, that was a really long way of saying - yes, they have killer buffalo wings AND great burgers. AND it's cheap. A great burger for under five bucks. Can't beat that.\n\nI gave them one extra star then i normally would because they're so very nice there. I am always amazed when there are nice asians... so I always have to make that a highlight. :P", "author": "Bonnie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "The fiance and I probably frequent this place every other week. We get the old standby...cheddar mushroom burgers. Yum. About 80% of the time they're cooked just right. Only real complaint is that they switched their bread to some sesame type bread. I just want a plain old hamburger bun!", "author": "Janelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-23", "description": "Usually a great lunch spot with really good homemade fries and potato chips.  Their burgers are tasty as well.\nI tried their \"Philly Cheesesteak\" tonight, but it was more like the  cheesesteaks retarded cousin.  They put mayo on it with under cooked onions and the meat was marinated in \"?\" sauce and not really sliced and diced.  To their credit there was a decent amount of meat on my sandwich.   Being from the Philly area I have very LOW expectations for cheesesteaks in the Bay Area.  I would never order Mexican Food in Philly.  Hint Hint BB, do not advertise that you specialize in  Philly C-steaks.  \nStick with what you know!\n...also call in advance for pick up to avoid annoying locals and high school kids...", "author": "David A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-01", "description": "I went here looking for a philly cheesesteak sandwich, and what I got was FAR from one. The Cheesesteak Shop cheesesteaks kill this one, as the one served at Buffalo Burger should have been called a \"Teriyaki Steak Sandwich\" I'm guessing the meat is the same meat they use on the rice bowls, it tasted like teriyaki sauce!! Bleghh!\n\nBesides the meat my other gripe is that it came standard with mushrooms. I'm of the school of thought that cheesesteaks should not include them, but shrooms be an additional topping available upon request.\n\nI will not be back anytime soon", "author": "Kevin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-13", "description": "Great burger joint. Always fresh, the buns are amazing, and the homemade chips push it over the edge. If you're a SF native and you have not eaten here....SLAP YOURSELF!", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "I've already been here twice this week! Sooo good..I've had the chicken cheesesteak and the crispy chicken sub..oh..my...SO FRIKIN GOOD! My husband raved about his burger with avocado both times. Very wallet-friendly as well. All ingredients are so fresh and the garlic fries were amazing. I wasn't a huge fan of the potato chip fry things, they were too thin for my taste.", "author": "Dana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-08", "description": "Got a regular cheeseburger (buffalo meat is $.85 extra) and fries.  Burger was good, but nothing special.  The thick fries had that interesting chewy/crunchy combo going similar to Big Mouth Burger in Mission and were very enjoyable.  Asked for a cup of water the guy forgot to give me, and then gave me this tiny cup like at a water cooler.  Cramped place, but enough seating at lunch on a Saturday.  Bathroom in the back room was clean.  Good selection of items on the menu;  I'd go back again to try some of them.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-19", "description": "These are my favorite burgers.  I had heard about it from my roommate when I first moved to the Richmond after asking her where a good place to eat on Geary was.\n\nThe burgers are juicy, thick, and so flavorful!  \nI need to come back more - I've only eaten here a few times  - but every time is as good as the last.  \n\nThey remodeled it not long ago, so now it's a nicer place to eat in, though I normally take mine to go.\n\nThe pricing is completely valid -- I would probably even pay more.\n\nYou do wait a little while for your burger.  I can be impatient when I get hungry, but I don't mind at all waiting for it!!  I just order, walk around, go to blockbuster or whatever, and come back.  \n\nAlso, if you're interested in actual buffalo burgers, you can get them here!  I heard they're tasty!\n\nBUFFALO BURGER 4 LIFE!", "author": "Liz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-03", "description": "Hi...I'm Katy and I'm a converted pescetarian. ...it happened here at this Burger joint where my craving for a cheese Burger was lifted...juicy.yummy.beautiful Burger.", "author": "Katy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "for a place that's named buffalo burger, you'd either expect them to have either great buffalo wings or great burgers or both. or great buffalo burgers i guess. i came here craving wings. but also ordered a philly cheesesteak and garlic fries. the wings were delicious in the spicy bbq flavor sauce. the cheesesteak was not very good--the beef was sliced too thickly and was a bit chewy. the garlic fries were delicious and garlicky and you get a good amount for $2. everything was pretty fairly priced.\n\nmaybe next time I'll try a burger with the wings. i'd come here again next time I'm in the richmond and want chicken wings.", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "ive officially been wasting money elsewhere.. this is where its at. its up there with bills place as tie for first in burger dept out here in the aves.. both are totally different but equally spot on.(Buff's is fired/Bill's is griddled). \nhand cut potato chips and buffalo burger no cheese everything on it.. im going back today. and probably tomorrow. wings are next and everything else. no beer though. drop the sprites and get some man sodas.", "author": "aidan m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-25", "description": "Tried their regular burger, tasted like a standard burger.  No frills.  \n\nAt least it didn't taste like microwaved costco, like some other places.", "author": "Dong T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "**Burger review only folks**\nOverall: The burger was good and very reasonable at $6.15 for the burger and a soda. I would say that it was nothing overwhelming, but it was tastey and cheaper than Bills down the way. The burger patty was a little thinner than optimal, but they tried to get the burger to medium rare as requested; almost. If you were to come back and get the combo (with fries order crisy) you would not feel cheated at all. Over the In-N-Out line? No.  But tasty. 6.5/10 \n\nBurger: Quarter inch, thinner than I like. Much more medium than medium rare. \nBun: Typical white bun, but grilled (Nice Touch)\nToppings: The cheddar didn't have the bite of a gourmet place, but their grilled onions were good.\nSides: No fries this time, but they are steak fries and quite good if ordered crispy.\nSidenote: I had a revelation about this whole burger list process as I was chowing down to my Buffalo Burger Burger... Cue Revelation: There are quickly developing two classes of burger on my list; the larger than 1/4 inch patty, and not. This is important as it is nearly impossible to cook a 1/4\" patty to perfectly medium rare... And thus the division line above and below In-N-Out on my list.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-14", "description": "I'm having a hard time giving this place a good review, but it's my first time. Strictly speaking about taste, my spicy buffalo burger and garlic fries seemed like they had the right ingredients, but it's hard to make a good determination when the food shows up cold. Obviously my burger and fries sat somewhere for awhile before I received it. Sorry, that's a pet pieve of  mine. I order hot food. I expect hot food. Besides that, the fries tasted stale. Not sure if that's because they weren't hot, but it just seemed like they weren't made fresh, as if the whole garlic fries mixture was pre-cooked. Anyway, if they had given me the food hot, temperature-wise, things probably would have been different.", "author": "Rich M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "Consistent and delicious burgers. \n\nBurgers are always juicy, meat tastes fresh, and bun is always toasted. Fries are always done well - plus you can request them to be well done if you want them extra crispy. \n\nFish and chips are also wonderful. The fish has a tasty, crispy batter and the size of the fish piece is generous. \n\nPrices are also great making this our regular/quick burger joint.", "author": "Lily H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-22", "description": "Man, what the hell are people thinking giving this place such high reviews?!?  I came here after a session at the gym with a buddy because I was craving for wings like some crack addict.  I ordered the lemon pepper and my friend ordered the spicy BBQ.  The lemon pepper had way too much lemon and less pepper.  Veg sticks were too thick, and sauce didn't have even distribution.  They just dumped the sauce on it.  Seemed like there was no care into cooking the wings, just cook the chicken, dump sauce and take it to the table.  At least the fries are decent, but if you can't even make a decent french fry, you don't belong in food service.  I should school the cooks on how to sauce wings.", "author": "A L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-09", "description": "Unfortunately small but delicious and cheap.  I highly recommend their buffalo burger.  The 'mom and pop' that run the joint are friendly folks.  If you're worried about the slow painful death that is BSE but can't give up your burgers, this place is your answer.\r\n\r\nHere's some pics and menu details: http://www.inetours.com/Pages/Dining_Archive/Buffalo.html", "author": "Eric X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "Great place and I will go back.  Awesome chili cheese fries and yummy turkey burger.", "author": "Julia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-01", "description": "Stumbled in here on a sunny Geary Blvd. walk - great price and tasty, fresh ingredients but nothing worthy of coming back frequently.", "author": "Bao N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "Great prices for wonderful burgers. It's a small place but I ordered a Medium Rare Swiss Cheese Burger with Mushrooms and it tasted great. Service was good and we got our food quickly. The burgers are big but they could work on they appetizer portions. Aside from that I'm really happy with this place.", "author": "Jaden M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "I like this place. Great burgers. If you want to eat a real tasty burger and pay less, you should visit this place. French Fries is amazing! Sometimes I want to eat just french fries, and I always go there to fulfill my desires, hahah.\nCostumer Service is good, people are very friendly!\nI recommend!", "author": "Jenna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-23", "description": "I love it here. The remodeling looks great, the food is delicious, and every time I'm just sitting around, I crave their CHIPS so bad. Their portions are super generous. A large bag was seriously enough to fill up me and my two cousins (they had burgers, but I didn't) and I think it was only a few bucks. \n\nOn top of that, their burgers don't disappoint either. I think I had one a few months ago, but I remember it being particularly tasty. It's a great, small establishment and I'd go there time and time again, both for their burgers and for their chips.\n\nFor those who are unaware, their chips are basically thinly sliced potato that is then fried. So it's like giant potato chips actually made from real potato. I swear it is the most delicious thing I have ever eaten haha.", "author": "Janet W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "I miss this place ever since I moved out of the Richmond district. I've been here plenty of times and have seen it outlast its neighboring store (now part of Buffalo Burger) time and again. The burgers are a knock-out (plenty to choose from) and fries are thick and meaty! I've also ordered their buffalo shrimp and fish, both of which are pricy, but good. The Chilli Cheese Fries is always a winner and I felt like their portions grew bigger ever since they expanded. \n\nNow with the extra room, it's an awesome place to sit and eat instead of cramping in the corner of the store. The best burger joint on Geary Blvd, hands down!", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-21", "description": "I've lived in the neighborhood a few years ago and used to go to this place when it was just a little tiny hole-in-the-wall.  Now it's a bigger hole-in-the-wall.  They have the same menu now as they did then. Let me tell you, I love this place!  Burgers are always big and tasty, and the fries are cooked perfectly!  The gyro and fish burgers are good, too.  Even after all these years, there are still a few items I have yet to try.  Next time, I'll try the wings.  Every now and then, I make a special trip to go to the Outer Richmond just to go to this place.", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-12", "description": "I gave them another chance.\n\nThe fact that everything takes a loonnnggg time to cook is still really frustrating, but the food is good. I'll probably keep coming back because it's convenient. But I usually order, take a 15 minute walk, and come back for the food.", "author": "jared c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-12", "description": "This place is actually bomb...better then the average grub spot...big sloppy Philly for $5...good patty melt...solid menu...I'll go back", "author": "Christian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "I came here on a whim.  I always walk by and was craving a burger, so I decided to finally stop in.  I got a bleu cheese burger, but I thought it was going to be cheesier.  It was pretty satisfying though.  I also got some garlic fries and they were delicious.  The girl who works here is adorable and super nice.  I would definitely come back and order another burger because it's closer to my apartment than In n Out.", "author": "k h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "Great neighborhood joint. Bought hawaiian burger and 2piece fish/chips. This place aint fancy but its real easy on the wallet, and perfect execution on the food. The burger was a little messy cuz of teriyaki sauce but hey thats what multi- napkins and soap and water is for eh? Yeah TV on the wall. Sports was on. If I was standing there at the bus stop I'd be tempted.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "Best Fish and Chips ever.  Even though they are frozen and prebreaded, they are fucking awesome!  The fries are good, too, usually.  Hit or miss on those, though, as they cut them there, and I don't know if they preblanch them once before frying them.  i hope so.\n\nAnyways, this place rocks.  Check it out.   And don't waste your time on the burgers, just get the fish, yo.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-17", "description": "Forget about Custom Burger, Burger Joynt, Urbun Burger, and all those other kitschy burger places in the city. Forget about In-N-Out Burger, although considering that they're a chain they're actually pretty awesome. Buffalo Burger is, hands down, the best burger place I've been to in the city thus far. Their burgers are huge and delicious, their fries are perfect, and their prices are unbelievably low. I highly recommend the teriyaki burger, although you may want to split it with someone (it's that big), and you'll definitely be washing your hands afterward.", "author": "Kathleen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "Came here this past weekend since we didn't know what to eat! Surprisingly I was satisfied. I got the Philly Cheesesteak and my friend got the avacado burger. We also ordered large garlic fries. \n\nThe Philly was not a Philly. The meat was marinated in some sort of teriyaki type sauce!  It came with onions and a bit of mushrooms. It wasn't what I expected but it was still good. So don't expect a great Cheesesteak from this place. \n\nThe burger was pretty good. Lot of toppings, hot and fresh.\n\nThe fries were not bad at all. They weren't as great as the garlic fries from Giants games, but they were tasty and a large order of fries is wayy too much. Get a small and it will be okay.\n\nThe prices were fair and they seem to have a good selection of food. I'll be back to try their fish n chips probably!", "author": "SF N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-26", "description": "What I ordered: Avacado Burger\nQuality : 4/5 stars. Something was missing...ketchup? Too much onions?\nPrice: 4.95\nWait time: approximately 20 minutes\n# of workers: 2\n# of messed up orders: 2\n# of people waiting for food: 6 before me\n\n\nNumber of orders stolen by the wrong people: 2\n\n\nSeriously, this lady came in, \"mistakenly picked up\" somebody's order, sat her ass down and started chomping. Then this other guy came in and did the same damn thing. I felt sorry for the guy at the counter, he was working his tail off switching from cashier work and running to make the food. Grab a seat, you'll be waiting for awhile.", "author": "tammy m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-13", "description": "It's a good burger, that's for sure. The hot wings and the fish and chips are good also. The teriyaki burger is a no go, don't do it. The garlic fries are sent from heaven with love. The place is a burger joint and best enjoyed with a joint. The food is dependable in all sense. It offers a wide variety of burgers and greasy food fare but it also offers up just a nice place to sit and people watch and let ketchup or for you over the tops, avocado drip down your chin. I have gone back time after time and will continue, just make sure you got your Pepcid on hand.", "author": "Patrick K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "Love it!! this is the second time i've eaten there. The first time I had the patty melt and it was meh. This time i had the burger with peppers,onions, and mushrooms. It was great, the burger was well-prepared and the toppings made it pop. What really got me though were the cheese fries and wings. Great stuff, not too expensive, you should try it. Do It", "author": "Greg H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-03", "description": "Place is good when they get your order right, problem is they never do. \n\nI called in to place a pick up order and specified that I wanted BUFFALO meat very clearly and it was confirmed that I wanted buffalo meat when I ordered and when I picked up but when I got home I was disappointed to find it was ground beef. This has happened the past 3 times despite how much I verified that I wanted BUFFALO meat.  When I call back in they mumbled incompetently and were absolutely no help. \n\nDo not go there! \n\nUnless you plan on eating there so you can have your order fixed when they mess it up, because rest assured they will.", "author": "Shaylene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-14", "description": "Teryaki Philly Cheesesteak. Let that sink in for a second.", "author": "Jimmy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-06", "description": "This place is great. After work, for lunch or \"the day after\".\n\nBurgers are good, fries are EXCELLENT (maybe the best I've had in SF) and the wings are superb.", "author": "Theodore C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-29", "description": "Been here twice and got the same thing, bleu cheese burger.  Both times made me seriously ill.  Just saying, don't eat burgers here or get them very well-done.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-22", "description": "*This review is for their buffalo wings.\n\nOMG!!\n\nI came here for the first time a few years back and ever since, this has been my FAVORITE place to get buffalo wings!!\n\nThey are SO good. Takes a while to wait for the wings to get cooked but in my opinion it's worth it! Excellent buffalo sauce with the wings. I usually order about 7-9 wings for myself. You can order them spicy or non-spicy I believe (haven't been here in a while because I live far from here).\n\nI'm surprised no one took a picture of the wings. Guess that gives me more reason to come back soon!\n\nMy arteries are sad but my tastebuds are happy =)", "author": "K P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-07", "description": "Yes, they have Fish and CHips...yes, it is fairly cheap...but they are greasy beyond belief and leave my stomach upset everytime....\n\nNice place, independent etc...and I;ve only tried the fish and chips...so that's all I can say/.", "author": "Sir Paul L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-15", "description": "Garlic fries were thick and crispy. That's probably the top draw here. Burgers were substantial, with a nice char, and the price is right -- a little less than $5 each for most options. But the service is a bit slow for what you're getting. And unless the wings here are out of this world (and they very well could be), I think this place is probably a little overrated at 4 stars.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "Great buffalo burger at a very reasonable price ($5.75 sans fries). Wish more places in the city served buffalo meat - nice alternative to turkey or veggie, and still super healthy.\n\nBonus props for the guy handling my order noticing that I was scrambling to make the arriving 38. He quickly got everything into a carry out bag, enabling me to make the bus.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-30", "description": "Have tried.... wings (5 stars), burger (4 stars), cheese steak (3.5 stars), Fries (eh).\n\nWings- Great buffalo sauce, even makes up for small but juicy chicken pieces. I would dip the fries in the sauce to make them better.\n\nBurger- Nice variety of burgers and toppings for a very good price. It may be nothing special, but definitely satisfies. What you picture the burger being is pretty much what you get, nothing more.\nReminds me of making burgers at home, but getting it perfectly right.\n\nCheese steak- Not worth trying. There is better in the city, for sure. An alright cheese steak, for a good price, but everything doesn't melt together like a cheese steak should.\n\nFries- First time was terrible, but the second time we tried getting well done fries, much better but still nothing special. Next time, garlic fries.\n\nThe variety on the menu makes it perfect for big groups, prices just make it more perfect.", "author": "Lynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-30", "description": "What a find! Great burgers and cheese steaks. The onion rings are up there with the best. You get plenty of food for a very reasonable price.", "author": "Danny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "Ok I can honestly say I LOVE their fresh chips.  I swear this is the only reason why I walk in to this place.  Sure their Philly cheese steaks are good and tasty.  (A wee bit oily but what do you expect when ordering a cheese steak?)   But it's those fresh chips that I dream and drool about!  When you bite into one and it goes CRUNCH! omg - heavenly!...But now that I've read about the buffalo burgers being good from other yelpers - guess I'm going to have to try it!", "author": "Cris H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-17", "description": "Boy after reading the reviews here i figured why not give buffalo a shot. DOH soo wrong. I've tried this place twice to give it a fair shot. umm no bueno.\n\nBurger - well..... they do the charbroil thing, normally a very tasty way to prepare a burger but it just sat there on the grill being torched, i was like well whatever lets see how it tastes. Like Charcoal. one big briquet of burnt something. It may have been better had it not been drastically overcooked. Toppings on the burger are top notch. Kudos on the red onion.\nCorn Dog - perfect golden brown, the batter had the perfect taste, but alas the dog itself was cold. dud.\nChili fries - its hard to mess these up but somehow they did, maybe its the straight from the can chili, and undercooked fries but boy did they blow it.\nThe CheeseSteak - ok, well as for flavor, umm i tasted grease, onion and pepper. not the greatest and by far doesnt hold a candle to Buster's.  The special sauce they use is a mixture of grease and mayo. lol yeah. good stuff. \nFries - ok, i guess i was pretty much disappointed in everything here so far. \nMaybe the chicken would be better. But it may be a while before i try again. \nOh for some reason it takes an unbelievably long time to get your order. Normally not a problem but the anticipation of good tasting food and then having a letdown like that. Something they should work on.", "author": "Cooper M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "It's not the greatest burger I've ever had (really good though), but if you're a burger fan, this is exactly the kind of place you want to have in your neighborhood.  I live right around the corner so I can phone in an order pick it up and be home in 5 minutes.  I love, love, love the french fries.  From reading other reviews, not everyone likes them as much as me... oh well.  Combine the neighborhood convenience, excellent value, tastiness  and friendly enough service and that equals four stars in my book.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "The philly cheese steak  sandwich was delicious. The bread was toasted just right. Inside the sandwich was a lot of steak, cheese, onions, and green bell pepper. As i was eating the sandwich, the insides started to fall off because the sandwich was packed with goodness. I also tried the avacado and bacon burger, which tasty, but not as good as the philly cheese steak.  The burger was huge! I had a hard time eating it. The good thing about the burger as that there was a huge chuck of avacado  (usually other burger joints give very small pieces of avacado) and big piece of bacon. Unfortunately, the lettuce and tomato overpowered the entire burger. I also tried the garlic fries! This place has the best garlic fries. Only 2 dollars for the small size (which was plenty!) The fries where thick and you can actually taste the garlic. I always walk out of the restaurant satisfied and have  garlic breath.", "author": "Eva L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-25", "description": "came here after spending the day at Academy of Science at Golden Gate Park. We drove by to the Richmond District to find some cheap eats.I was craving Piroshkis and actuallu found em,but after that we were still craving more substance.Walked by and looked up at the signage above this establishment.A big red buffalo on the sign. How can we  go wrong in a place like that. Anyways we ordered a  burger,hot dog,salad, and  buffalo wings. Burger was soooo good! and juicy good. Hot dog tasted so beefy good too, and they toasted the buns too, even without asking.I love that little extra. Wings were authentic with a good selection of sauce options to choose from.   Check out this place for sure!", "author": "ernie s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-25", "description": "The Buffalo Breast Chicken Sandwich was pretty forgettable. The fries were great, but the main meal lacked any taste punch. It felt like the cook just didn't care about it. Maybe the burgers here are good, but there are definitely better sandwich joints in the City.", "author": "Haz O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-04", "description": "Nice little burger place. I decided to try a different place besides belly burger and Buffalo burger was it. I have passed it many times on the 38 and always wondered how good it was. So we went last night to try it out and it was worth a little walk. The burgers are HUGE and very filling, as well as what you'd expect a burger to taste like.... We also got the homemade chips that they had there and I must say they were very delicious and I plan on going back as well as getting the chips again... Next time I'm going for the Philly Cheese steak I hear people really like it.", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-08", "description": "This place easily has the best hamburger in the city.  I don't know how they do it.  I highly recommend trying their food.", "author": "Raphael R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-22", "description": "burger was good. the ultimate is not quite 'ultimate'\n\nnix the garlic fries. they're so garlic-y it no longer tastes like garlic.", "author": "L P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "Needed a change of pace from my normal lunch foods.  Always passed by this place and my curiosity finally said, Lets do it.  The menu was very extensive and took me a while to decide.  Decided to go with the fish n chips.   Went with the 2 piece order with fries.  Glad I did as the pieces were huge and I could barely finish it all.  Batter was kinda on the heavy side but made up with it with big pieces of fish.  Ample amount of fries, nothing special about them fries.  \n\nMain drawback, and this is going to be common is that it took a long time to get my order.  It's a small place with a small kitchen and everything is cooked when ordered.  I think it's well worth the wait.  The next time I'm there, if there's a line.. I'll just place the order, then go next door for the coffee and be back in 10-15 mins.  I'll do the buffalo burger this time.  It's their namesaket..... has to be good too.", "author": "Guy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "Tried this place tonight and it was great. Good prices and fresh tasty and not overly salty ingrediants. Got the buffalo burger with avacado and bacon, with all the trimmings and garlic fries and a soda. BF got same burger, bill was under $20! The burger was tasty, lean and didnt feel gross afterwards like when you eat most burgers. It was not dry at all despite it being much leaner than regular beef. The onions, pickles, avacado, lettuce tomato were all really fresh and tasty. The bun could have been thicker but hey less calories! The inside is very clean as well and food came out fast. They even have  a nice flat screen inside, so not sure if they have recently renovated but i was really expecting a hole in the wall, but this one was actually a clean and updated hole in the wall! A must try if in area!", "author": "Petri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-01", "description": "awesome 'junk food' place. took the bf on a *hot* date to grab some burgers. the fries are thick and delicious the cheese that came on it tasted nacho-y but good. the buffalo wings (spicy) were probably the best we've had in the city so far and at a good price. he got a cheeseburger, a little squishy and reminded me of a McD's burger *it was fantastic*. and i tried the supreme burger, grilled peppers, onions and everything else, it was w-o-w factor great. couple things my bf didn't like- the lighting, that it was 'order at the counter' style, and a lot of fat little kids were in there. once in a blue moon i think it's good to chow down on a burger and fries :)", "author": "Abigail W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "sometimes, on a blustery saturday night, all you wanna do is eat artery-clogging food and introduce whatever calories you just burned off at the gym back into your body. and, since i am one for overindulgence, i most certainly don't give a shit. &, lucky for me, i have a wonderful boyfriend who doesn't either :]\n\nthis whole-in-the-wall on geary has a tremendous selection of burgers &, as far as the sauces go, a good selection of chicken wings. i kept it classic with a hamburger (hold the ketchup please, ew) & a side of onion rings. my boyfriend kept it classic in his own way, ordering the BBQ burger as well as 6 spicy wings. we sat at the window counter & enjoyed the SF Reader while we waited for our grub.\n\nthe onion rings arrived first & were gone within 5 minutes. they were perfect & crispy & oniony & big & yummy. my burger was quite tasty but nothing too extraordinary. i noticed that a fellow yelper posted a photo showing that their hamburger patty was not of adequate size. i didn't have such an experience & my patty was plentiful! my boy seemed to enjoy his BBQ burger but focused more on his wings. i'm not a huge fan of buffalo wings but i gave them a try & they were SPICY. their extra spicy wings must be explosive, i had to down my sprite after just one bite of a spicy wing.\n\nfour stars for serving a tasty burger for under $5 in my neighborhood & for the best onion rings i have ever tasted.", "author": "Lizzy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-02", "description": "Me and my husband visit this place every weekend even though we live 1 hour away from San francisco. We went to about 10 different places in this area and couldn't find anything better. The wings are not fat, they put a lot of sause on it so it tastes very good. Personnel are always friendly and very nice to us. They are always interested in our opinion about wings. and lately they have even started giving us extra wings just because we are regulars. Also, the location is perfect for us. Since we are a russian couple we are able to visit all the russian stores on Geary before we grab some wings.", "author": "Margaryta M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-26", "description": "You know your hormones are surging when all you want out of your weekend is a cheesy turkey burger and a Project Runway marathon. Thank you Bravo and Buffalo Burger.", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-02", "description": "I had a friend who swore by this place but for some odd reason I never wanted to try it.  I'm not sure if it was the name, or the thought of eating buffalo (bleh), or the fact it just looks old and small and needs a paint job. But I finally went in and was shocked by very good and very cheap food here.", "author": "Starla D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-01", "description": "I go here every so often after a comics run from Card & Comic Central up across the street. Its very small but its nice that way i feel. Its hardly crowded so there's no wait for anything. Its an awesome place to get fried EVERYTHING and some pretty sweet burgers too. This is a place you can definitely sit and take your time eating Grade A heart attack food.", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-15", "description": "Buffalo burger is a solid grease and fried joint but not at all gross. The food tastes exactly like you want it too, served grill and fryer hot. All that and the friendly staff make this a great place to help soak up those many PBRs you drank or cater yourself a tv sports event at your house. Wings, fried apps, fish and chips, Philly Cheese Veggie and burgers are all winners. They even make actual chips as a fried potato choice.", "author": "William R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-12", "description": "Buffalo wings are so easy to make, but plenty of places still find ways to mess them up - too soggy, undercooked, too mild, ranch instead of blue cheese dressing, and once, sauce on the side...the side!\n\nNot so at Buffalo Burger-the wings were crispy, spicy and delicious. No ranch in sight. The fries were pretty good too, but there was one stray potato chip thrown in and it was delicious.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "Came here on a whim and had their bacon & avocado burger, garlic fries, and a coke. It was pretty darn tasty! The patty was so beefy and yummy and the sesame seed bun was perfectly toasted. Their potatoes are so pretty good too (fries, garlic fries, chips, all kinds). My bf had the philly cheese steak, which was also good, but my burger was effin' awesome!", "author": "Jane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-29", "description": "My favorite Bay Area burger place because I can get real buffalo burgers (slightly healthier for you and a novelty) and yummy fries for a reasonable price.  It's a good thing I don't live in the neighborhood anymore or else I'd be eating my way through too many buffaloes and feeling slightly guilty about the bisons I adore in Golden Gate Park.", "author": "Surf R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-20", "description": "This time I tried the supreme burger and it was delicious!  This place is an  awesome burger joint!  They do cut/make their own fries too.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-01", "description": "I love this place! The asian guy that works there looks kinda intimidating, but he's actually a nice guy.  Food here is great! The buffalo wings tastes good....just wish it had more meat on it.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-12", "description": "Good burgers and fries, fish and chips and buffalo wings. Their potato chips are the reason that I don't go there much. Very addictive and oh so good. You have to get them when they're just out of the fryer. Crisp with a nice texture, not too thin or thick.", "author": "cyndi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-15", "description": "Wow this is the best chicken sandwich I've ever tried so far in this area. Juicy and perfect seasoning just the way I like it. Oh and cheap! $4.95 I guess it was... no compare with other fast food restaurants. I haven't tried anything else from their menu, but looks like they have a quiet of variety. Maybe next time I go will order a burger and fries!", "author": "Ricardo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "Solid burgers. Parking's a bitch.\n\nEDIT: Remodel? Wow. Now more room to sit and they take credit cards. Same menu (I think). So far, same food, too. Stay tuned.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-04", "description": "I love this place.  I live two blocks away and go there all the time.  I've never had a bad meal, the burgers are super fresh, the fries are always hot, fresh, and krispy.   I usually order a side of cole slaw, which they make house-made to order.  The owner is such a nice guy.  Very friendly and professional.", "author": "Warren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-03", "description": "Buffalo Burger is the quintessential neighborhood burger joint. The burgers are straightforward without the glitz and hit the spot. I ordered a regular burger with sauteed mushrooms. The bun was toasted, the lettuce crisp and the patty grilled just right. I had been initially hankering to try their fried mushrooms and zucchini sticks, which were cooked well- not greasy. The ranch served with them wasn't my favorite, but all in all a good experience. Buffalo Burger is a locally-owned restaurant I will revisit again (ready to try the Spicy Chicken sandwich).", "author": "Annelies Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "Buffalo Burger is without a doubt one of the best kept secrets in SF. I actually ended up here one day while doing a load of laundry up the street from this place and decided to give it a try. I ordered a veggie burger and a side of potato salad. The burger was excellent and one of the best I've had anywhere. The potato salad was pretty good and though it couldn't possibly compete with my mom's killer potato salad, it was much better than most of the potato salads I've tried at various delis throughout the city. They also are very generous with their portions and their prices are super reasonable. They have a fantastic menu and offer everything from burgers to wings to fish and chips to teryaki bowls and salads. They have numerous different selections of fries so next time I plan on trying one of them. Needless to say, I would definitely recommend it and will be going back real soon.", "author": "Rabbit B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-25", "description": "Despite my previous statements, I decided to give this place another try. I went back and got fish and chips, but this time, got fries instead of chips. Much better.", "author": "Katie I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-17", "description": "I had a chicken burger here once with fries.  Definitely pass on the fries.  They were nasty, like soaked in grease.  The chicken wasn't much better.  The beef or buffalo burgers might be the best bet.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-29", "description": "A small restaurant that seems to have a local following.  Had their fish and chips, and it was pretty good.  Service was great.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "Oh how this place reminds me of growing up in North Beach.  This restaurant use to be on Union St. between Columbus and Powell.  When I finally fell in love with hot sauce and spicy foods at 9 years old, this place was my haven.  So I found out they moved out to the Richmond district, and I finally stopped by to check it out.  I ordered 26 wings, extra spicy, and got my siblings all a vanilla shake.  When the wings arrived, I took a whiff, my nasal hairs probably all burned off.  My clogged nasal passages suddenly became clear.  I picked up my first wings and sucked the meat off it.  Took a sip of my soda and then, my tongue was on fire.  My lips felt like they plumped up with collagen.  I could barely talk cuz I couldn't move my tongue.  I wanted to eat more, but I had to stop after consuming half.  I was in pain, but oh was it worth it.  I am a hardcore buffalo wings fan and if you love'em too, to stop by and see what you're missing.  They serve burgers, Philly cheese steaks, and typical sides, but I don't care about any of that other stuff.  I felt like a kid again when I was here.  Come and see how much it means to me, cuz you'll dig it.", "author": "Janice F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-19", "description": "burgers are alright. chili dog/fries, are mediocre. staff is very nice, even if the food takes quite a while. the fries are hit and miss. \n\nit's close by me though, and the hours extend far enough into the night that i find this place convenient.", "author": "Darrell L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-01", "description": "Good Burgers!  Even better fish and chips!  Ill go back as soon as I scrap together some pocket change!", "author": "andrew l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-14", "description": "The wings are good. And the burgers can be somewhat large. But never leave this place without the chips! It's too good NOT to order! It's greasy, but what delicious food isn't?!", "author": "Bub B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-28", "description": "I hardly eat burgers but tend to crave them once in a while. The mushroom burger with Swiss cheese was flavorful, fresh and big. It took up to 10 min until it was done but totally worth it. I was starving though. Next time I'll try the avocado burger. I would always go back and order everything on the menu. Also, a big plus is the nice staff.", "author": "MS K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-26", "description": "Better than Belly burger.  No salad bar of condiments though.  The wings are ok...bordering on not ok.  Some were kind of small, the sauce was ok and one of them still had a foot attached.  I'm not stranger to chicken feet but not with my buffalo wing/drumstick order.  If you're looking for wings, stick to Hooters.", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-04", "description": "I haven't been back since it has been remodeled, so I'm still under the impression that it looks like an illegal little place. The food, well, it's not cheap but it's better than McDonald's at least.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-16", "description": "Great, tasty, and authentic buffalo wings! Much better than hooters wings and in the same caliber as the great wings of the infamous San Tung restaurant. Burgers are average, but the garlic steak fries that accompany the burger makes it well worth it. Very affordable prices and great service make this a regular stop for full-filling my chicken wing cravings.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "Good tofu sandwiches. The fries are fresh and in generous portions. I really like how they remodeled the place.", "author": "N C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-24", "description": "My first stop in was a hit, except the miss on the mushrooms. They forgot to add them. But I'm not holding it against them, everything else was hella good. The fries had enough variety in shape and size  to give me that little in your head chuckle, and since even the thick square ones were cooked throughly, it even cracked a smirk on my face. I'll stop by again for the wings.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-11", "description": "Excellent customer service. Gigantic burgers and if you haven't tried their Buffalo burger, try it. It's moist and wonderful. I think it's even better then a regular old beef patty.  Their Fries are good, but their Chips are way better.  Their super crunchy & salty & delicious. All I can say is I dream of buffalo burgers & chips at night!", "author": "Claire S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-19", "description": "People, just go spend your money at BELLY BURGERS ( on Geary)..  is so much more tasiy and clean.\nThis place just does not satisfy me!!", "author": "Cynthia K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-26", "description": "i really wanted to like this place.  first experienced over a year ago was blah...the wings weren't crunch, the sauce was ok, and it was the smallest wings i've ever seen.  price was ok and the people seemed nice.  but still, when you are hungry for a type of food, you want it to be good!\n\nafter over a year, decided to try it again.  too bad nothing has really changed after all this time.  OBW (original buffalo wings) is still the best buffalo wings in the west, just like the originals.", "author": "Food Is L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-14", "description": "The burgers here are pretty good...but what is really tasty are the homemade chips.  Way better than french fries or any other chips you've ever tasted.  If you order a burger it's definitely worth it to call ahead.  This place is a bit of grease pit but hey we all need a grease fix now and then.", "author": "Cooper's Uncle .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-25", "description": "I ordered a mushroom burger. It was okay. It probably would have been better if it had cheese. I like the celery and carrot stick option for the side. I would go here again, if I want to be full. In N Out are still my favorite burgers though.", "author": "Charlene T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "I like this place. Great burgers. If you want to eat a real tasty burger and pay less, you should visit this place. French Fries are amazing! Sometimes I want to eat just French fries, and I always go there to fill my desires, ha-ha.\n\nCostumer Service is good, people are very friendly!", "author": "Ron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "I like the food here, but i was surprised by their homeade chips. I heard how good they were by a number of yelpers but i just feel that theyre just ehhhh. but i do love their fish n chips, fries and onion rings. though i was a bit disappointed by the fries it was all good cause i had a pretty  good time hangin here wit some friends, gettin some food before we go skate around.", "author": "Brian Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-14", "description": "best steak fries-extra crispy and they have great fish and chips!", "author": "Jesica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-11", "description": "We have been going to Buffalo Burger for a few years now.  The owner is always friendly and the food is always good. The chicken club is awesome and I always order the buffalo wings to go with it.  Sssssoooo good!  \n\nThe fish and chips are great too. The tartar sauce is homemade and is very addictive. I would pass on the ketchup with the fries and ask for extra tartar sauce, you won't regret it.\n\nFor prices are relative cheap for what you get.  Better priced than Mel's.", "author": "apple b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-04", "description": "Great burgers, cooked when you order them.  Not much for atmosphere, but still a great place to grab a burger.  Great for those late nights in SF.", "author": "Luke G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-16", "description": "my go-to burger joint in the outer richmond. decent cheeseburger + fries, for $7. can't go wrong.", "author": "Sam Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-05", "description": "the worker dude doesn't mind having dirty unwiped tables all the time, everytime.  really now???", "author": "Ethan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "I love this place, good old american food, and the service is ok alas sometime s spotty", "author": "Leigh McInnis Lee G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-19", "description": "Good food at a decent price. Alot to choose from. Clean resturant. nice people. GET THE CHIPS!!!!", "author": "william w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "this is my go to wing spot in sf.  here's what's good:\n\n- the wings\n- the sandwiches (recommend the buffalo breast)\n- the fries\n- the chips (thin sliced fries, awesome)\n- zuchini sticks\n\njust good take out.  dont know why this is hard to find in sf but it is and this place does it well. the owners are super nice and friendly.  love it when i need a break from all the good asian food.", "author": "shar d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-26", "description": "Buffalo Burger has the Best Chicken teriyaki and Garlic Fries In the City! I like to get mine with veggies and my girlfriend prefers no veggies. They  give it to you in a white take out box with Grilled Chicken over steamed rice and mixed veggies. The Cheese sticks are really good my favorite! A guy named Paub runs the place very nice man! He brings your food to your table talks to you from the minute you step foot in the door to the time you leave A+ Great service! Goel is the Master Chief with excellent culinary skills very professional! I witnessed with my own eyes that Goel and the other chiefs wash there hands and are very clean people we have been eating here for years and never had any problems or complains", "author": "The Food Hunters C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "GREAT burgers, friendly service, at good prices.  If you're like me and get in the mood for a good burger, go to Buffalo.  They will not dissapoint.  I ordered the Supreme on the soft roll.  Very tasty!  I will definitely become a regular!!", "author": "Jason T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-21", "description": "I happened across this place over the weekend and, boy, was I pleasantly surprised!  The restaurant is TINY--a true \"mom-and-pop, hole-in-the-wall\" establishment.  Even if diners squeezed in like sardines, I'd estimate that the restaurant could only accommodate 10 to 12 people at most.  In terms of decor, this place absolutely has nothing to offer.  It is truly a grease pit.  You can just feel the grease that the walls have absorbed over the years.  Needless to say, my expectations were quite low.  I only ordered a cheeseburger (although, reading the previous reviews, I now wish I had ordered some fries or chips).  It was fabulous.  The patty was 1/3 lb. and had a slight gamey flavor (enough to make it interesting, but not enough to make it over-powering).  (I generally don't like things that taste gamey.)  The cheese, which was a slice of American, was nicely melted onto the patty and had a nice, sharp milky/salty finish.  My favorite part, though, was the bun, which was yellow and sesame-seeded.  The texture of the bun was perfect:  it was soft enough to chew (not like a baguette bun or a ciabatta bun, which you have to work on), but firm enough to maintain a nice, spongy texture (not like some breads that crumble when you eat them).  The best part of it all was that my cheeseburger was under $5!  Fabulous price performance.  I'm definitely heading back for some fries and chips.", "author": "Sophrosyne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-18", "description": "i've been here only a couple times, and for a place called buffalo burgers for some reason always end up ordering the deep fried seafood, go figure.. anywhoo the thick cut fries, large pieces of fish, oysters, and scallops were enough to keep me coming back.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-17", "description": "yelp lied. they do not deliver. my hopes of burger delivery are shattered. :(", "author": "Miss Kae O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-18", "description": "they can never get anything right, and i agree with the person talking about cosco, how can they screw food up that is already made. dont waste your time. and for those of you that think this place is great, how often do you eat cardboard? you can make this food at home just stop buy the frozen food isle of your local grocery store.", "author": "daniel a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-29", "description": "Great burger.  IT was juicy and grilled to perfection.  You have to know that this looks more like a run-down burger joint.  You can barely fit 10 ppl in there, but their skill with the burgers are excellent.  I cannot say so for the buffalo wings.  They taste pretty awful.  The sauce smelled excellent, and that fools you into taking a bite.  The meat is dry and there is really no taste at all.  The smell is all a LIE.  The fish and chips was ok.  The chips not so great, but the fish was crisp, moist and overall not bad.  We also had an order of the chili cheese fries.  Again, the chili cheese was good, but the fries were a disappointment.  The fries was too try and none of that oily fries taste, so it doesn't even taste like a fry.  I will not apologize for my high expectation of fries.  I think they are really important in a burger/fry meal or fish and chip meal.  I think I'll only come here for the burger.", "author": "AhLin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "Okay, so, they definitely have the best hot wings in all of SF!!!  I really miss the hot wings from the East coast (just like the bagels as written previously), but they taste almost as good, they of course aren't $ .10 a wing, but they are delicious!!  Their spicy chicken sandwich used t be very good to, but it is slacking off in the past 2 years, sometimes I get one and it is just pieces of chicken, falling apart, to messy.  the other reason why they do not get 5 stars is due to the fact that they don't deliver, why????????", "author": "J C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-30", "description": "All I care about is burgers.  Buffalo Burger's burger tastes bland and is not worth even the low price they charge for it.  It looked like it might have even come from a frozen package, which would explain the extremely long preparation time (over 10 minutes).  Belly Burger is still the best burger in the area.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "yeh i was there with that brian y guy rite below me i have to says hes rite i agree with him bout all the stuff he said", "author": "justin l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-23", "description": "We had the fish and chips and cheesesteak with a side of onion rings.  It was crowded so it took a really long time to get the food and it seemed like the restaurant was unable to handle such a long line.  The fish was good, but the pieces were smaller than your average portion for fish and chips.  The fries were big thick steak fries, which I don't love but my friend liked them fine.  My cheesesteak was NOT a philly cheese steak, but like a terriyaki marinated steak sandwich.  Even though I wanted a cheesesteak, the sandwich tasted pretty good, so in the end, it was fine.  Just don't order the cheesesteak if you're expecting a philly cheesesteak.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-27", "description": "I always eat at the Buffalo Burger when I want a fantastic burger and wonderful French fries. I eat burgers with fries about 4-6 times each year. Buffalo Burger is the only place that I go for burgers and fries. Just thinking about their Ultimate burger with buffalo meat with everything on it and their fries makes my mouth water. As soon as I have placed my order, I ask the cashier to deliver it to the coffee shop/cafe next door, Royal Ground Coffee. Buffalo Burger will deliver your order to the Royal Ground Coffee if you ask. The owner of the Buffalo Burger owns the Royal Ground Coffee, which is a great place in its own right. I walk about 50 feet to the door of the Royal Ground Coffee, order a drink, and sit down at a table. A few minutes later one of the Buffalo Burger employees brings my buffalo burger and fries to my table. The burger and fries are always the perfect temperature. Instead of ketchup, I eat my fries with tartar sauce. The last bite is as superb as the first. If you are a connoisseur of burgers and fries, this is the place to go.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "yum yum yum! this place is awesome! burgers=bomb, homemade chips=bomb, philly cheesesteaks=bomb. can't wait to come back and try the wings!", "author": "N. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-03", "description": "love this place. i always get the wings. some people might say they are small, but only compared to gigantic hormone injected wings you see at some other places. even if you happen to get an extra tiny wing, they always throw in another one to compensate. good pricing and i love the spicy sauce. the burgers are also fairly priced and the fries and especially chips are pretty good", "author": "Bobby J."}
