{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-07", "description": "This just a bar. I realize that may be obvious but I came here around lunch time hoping for food with my drinks and I was sadly disappointed. Admittedly, this is something I could've figured out ahead of time if I tried. They were super busy because I think it is the team bar for UCLA (and a few others if you check their website). They have beer buckets and specials each day. They have two pool tables in a separate room. There is some seating at tables, but mostly standing and stools. It wasn't what I was looking for that day, but if you know what you're getting and prepared ahead of time, you'll probably have fun.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "$11 beer + shot special\nplus various nightly specials\nplayed lots of Jungle [thumbs up emoji]\n360 tvs everywhere\nchill bartender", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Bus stop was bumping yesterday (Friday) when I got there around 11 pm. Great vibes, fun music (they have an electric jukebox so you can choose what you'd like for a dollar), and a lot of seating and standing space. Not overly crowded, but definitely had a good crowd. Pool table system seemed pretty efficient with a blackboard where you add your name if you want to play. Lighting and ambience were excellent. Bathrooms are a little small (only one stall for ladies). Maybe it was just last night, but I didn't see a dance floor. Drinks were great -- huge selection! Definitely a cool spot to go if you're in Cow Hollow.", "author": "Meagan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "It's the Marina, and it's a bro bar. That's all you need to know. Flooded by kids who just turned 21 ordering bucket loads of Bud Light. We had to leave, the atmosphere was just annoying.", "author": "Ern D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Came here while bar hopping on Saint Patrick's Day. Just another dive-y type of bar. It has a good party vibe though, if that's what you're looking for. Nothing special, otherwise. Bathroom situation is a little dire.", "author": "Marie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "This is easily one of my favorite bars in the marina/cow hollow. The bartenders and staff are friendly. The type of people that visit this bar aren't your typical marina type. Bus stop bar definitely attracts the dive bar crowd, and I love it. The prices are also a bit cheaper than many other marina spots.\n\nThe chalkboards in the back room are fun to draw on after a few drinks. The pool tables are awesome. The bathroom had toilet paper. Lots of TV's with sports. Last time I visited was on a Friday, and they had live music that was really good.\n\nMajor thanks to the bouncer for letting me come inside and hang out with him when I was waiting for the bus. It was absolutely pouring outside.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "This is my first review EVER on Yelp! I've lived in SF for 11 years now and by FAR this is the worst bar I've EVER been to in SF!! The bartenders are absolute garbage! I would and will never go here again!! The bartender who served me was allowing his brother to disrespect any and all patrons. My wife was completely disrespected by this bartenders brother and of course she was kicked out for speaking up about how disrespectful he was acting! The owners of this bar should really reevaluate their staff. This is a bar that deserves to be closed for the lack of respect its owners and staff have for its patrons!!!!!!", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "Good bar to grab a drink any time. If you're a sports fan they have a good amount of screens so you wot miss the action. This is a hot spot for college football so come early for seating during big games. Decent beer selection on tap, and nice causal environment!", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "We actually just stumbled upon the Bus Stop while visiting San Francisco for Thanksgiving week. We were looking for a place to watch the Cowboys game and this was one of few places open. We stopped in after hiking Lands End, and the patrons were some of the friendliest we had met in our week long trip to SF. The bartender was especially kind, and attentive. We left at half time (serving food would have given extra stars as we were hungry!) Luckily several people recommended a restaurant just across the street. After eating we headed back. The Bus Stop Margarita (with honey!) and Iris Coffee were especially delicious. There were lots of TVs, pool tables, and areas to relax and watch the game! Will definitely come back on our next trip!", "author": "Courtney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Neighborhood pub. Easy vibe. All around cool. The only downside is that they have no food.", "author": "Shawn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "No better place to hang out. Good layout and table proximity to the if that's your thing. Lots of brews. Cool people.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "Fun bar full of locals, $4.00 beers and a killer pizza place around the corner that delivers to the bar. I watched Monday night football here, had a good time and will be back the next time I'm in town. 5 stars all the way.", "author": "David R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "Fun little stop in he marina. Nothing incredible, but a great place to grab a beer and watch a game with friends. There are tons of bars within blocks, so add bus stop to your bar crawl. They have a pool table, and a back room. Wouldn't go out of my way to come here, but definitely a fun place to check out.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-10", "description": "I'm constantly coerced to go to this bar but it's really just awful. Crowded, bad service, not well set up for groups. Still not sure why people go here for games. \n\nMore than anything, I've gotta say the bouncer does a really bad job of representing the place. This guy took issue with my government issued passport that I've used to fly into the country more than once. I am 24, almost 25. I haven't had this sort of issue since high school. \n\nI asked for the manager, and this bouncer kept saying he was \"the highest ranked employee here,\" \"the most powerful,\" \"there's no one else higher than me you can talk to\"... it almost seemed like a joke. The strangely hostile attitude.. the aggressive, quixotic demeanor... it reflects badly on the place. I've been to bus stop over 10 times, but I won't return there as long as this individual works there.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-14", "description": "My friends and I did an impromptu bar crawl while on vacation in SF. We stopped by this spot for a drink. Unfortunately the bathroom flooded while we were there... whomp whomp. We had just bought 2 buckets of beer and were told we needed to leave. At first I was told I couldn't get a refund but that I could take the beers with me?? Hmmm... this isn't Vegas. But after some back and forth they gave me my money back and all was well with the world. I wish I could've checked out the bar more. It was reminiscent of Cheers. All in all a good bar.", "author": "Christina P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-09", "description": "Pretty cool/all right bar. Every time I came here the age group of people was usually early to mid 30's. Small bar up front, but many tables and seats on the other side of the bar. Jukebox has a good selection of songs. \n\nCool thing about this bar is the two pool tables in the  back room, a lot  of room to play pool and also a lot of space to hang out with friends while playing or watching friends play pool.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Sports? Drinks? Food? Altogether? The Bus Stop has it all! Located in one of the loveliest neighborhoods of the city, it has a modern take on your most typical sport bar. And it is one of my favorite bars, precisely because it ISN'T always a total mess on Fridays and Saturdays.  \n\nThe menu consists of very broad selection of beers, most of them really good and inexpensive. The atmosphere was great and the bartenders are knowledgeable and super chill. \n\nI went in expecting your typical sports bar but the Bus Stop took it one step further!", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Space to sit on game day, while still being packed. Cheap drinks, bucket offers of beer on Sundays. Great place with a good vibe. They don't have food though, but you can bring in whatever food you like! Nice sports bar, good sound and TVs all over!", "author": "Nilay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-28", "description": "I kinda wish the UCLA bar wasn't here. It's a pain to get to the Marina if you're not driving (and if you're going to a bar to drink beer and watch sports, you shouldn't be driving), and there's nothing super exciting about the ol' bus stop. But it could be worse and the $20 for 5 bud lights beer bucket is a good enough deal.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "The UCLA bar in SF! Great place with really charismatic bartenders, great deals, TVs everywhere and a pool table.", "author": "Thielson D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "One of my favorite bars, precisely because it ISN'T always a total mess on Fridays and Saturdays.  Been coming here with friends for as long as I've lived in SF (~3.5 years), and it's definitely starting to feel like my Cheers.\n\nSay hi to Matt and Josh when you're there, they're wonderful people... and really, they're doing the Lord's work.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-20", "description": "I've been here a handful of times and had a mediocre night, nothing to sing home about, but also nothing that would make me want to never come back here. Until Sunday night. Granted it was the MLK holiday weekend, my friends and I knew bars wouldn't be packed as everyone did not have the Monday holiday off. With that being said, we didn't take that as an excuse to be disrespected and belittled at the one bar we ended up finding that was open! First, no one at the door checked our ID's, so my group of five girlfriends and I were accosted when three large men came up to us and held our ID's, assuming they were fake, and refused to give them back. Not only did we feel uncomfortable, upset, offended belittled, but the bar was dead and it wasn't clear who worked there and who was a drunken bar patron!", "author": "Frankie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "This bar was a great local find. I was in town looking for a place to watch March Madness and this place was perfect. They had about 8-9 tvs with different games on. The drink specials were great! Happy Hour offered $4 beer which you can't beat!\n\nI am from Indiana and was told this is a gathering place for Colts games so in the future if I'm ever in town I will remember this tip!", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-24", "description": "So several years ago we were touring SF and checking out Union street and actually were waiting at a bus stop when we saw a sign for happy hour at The Bus Stop.lol.  More than 5 years later we remembered our visit and found ourselves on Union street and used Yelp to find a local bar. I saw The Bus Stop and had to come back!  Plus seeing a Yelp check in special 50% off of your first drink made it even better!\n\nWe sat at the bar and were immediately greater by the bartender. They actually had a good selection of craft beer on tap from Lagunitas. We just felt welcomed from the start at this bar. It's a little dive but with charm and warmth. Plus there is plenty of room in the bar and a back room with pool tables and several TVs throughout. Bonus its dog friendly so bring your pup with you. Overall a cool chill spot, we will surly find our way back here. Heck we might even take the bus.lol.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-28", "description": "I wanna say I hate this place because I feel like i get a gross film on me every time i walk in, but I also have never had a bad time here. Its college-y, dive-y, and douche-y all at the same time but you're bound to have fun, even if its an off night.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "Great drink deals! \n\n2Gingers Irish Whiskey and beer for $7\n\nWho wouldn't love that! \n\nBartenders are very friendly too! \n\nSlainte", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-29", "description": "My husband, and I live a stones through away from this bar, and both were stuck working a Saturday. My husband, who is a huge 49ers fan, suggested we stop by to watch one of the pre-season games. Well, it was okay at first. The bartender greeted us nicely, and asked for our orders, but it went down hill after that. Let's just say, we ordered two beers at $5 (The special), and my husband ordered 3 beers at $6.50, and we somehow wound up paying over $50. They take advantage of people!", "author": "Suzanne T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Good home base bar. Watched the Georgia game in a room full of fellow Georgia fans, there is no food so be prepared for a liquid diet. I'm not from here and still felt very at home.", "author": "Jon U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-10", "description": "Decent sports bar.\nLet's start with parking: Parking, like everywhere else in the city, is tough. Drive around the block a couple times and good luck!n The bar itself is small, and gets quite crowded especially when the Giants play. Plenty of TVs but only 2 decent ones.  Not sure about cocktails, but beer was about $4-5. Not too expensive. The bathroom is shitty = one stall, TINY SPACE, you can barely turn. \n\nThe bartenders were nice and attentive. Overall, this is a decent bar to have a beer and watch a game.", "author": "Mya M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-19", "description": "Forgettable.  I will only come here if I have to.\n\nThe line is never long, but it always takes a long time.  I get that the place isn't that big, but still - I feel like there's always room in the back that the bouncer can't see.  You can play pool in the back room or sit at tables in the room adjacent to the bar.  It's very much a guy's bar... and that's not always my scene.  No real complaints except for the line.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-24", "description": "I came to SF for my laser hair removal treatment - which hurts like a bitch!  However, I figured out a good a$$ remedy  - get extra buzz before I go.  Usually we bring alcohol from home and drink in the car when we see the bay bridge (ghetto style), but we didn't have any liquor at home.  Therefore, we went to closest bar near Laser Away.\n \nThis bar opens at 9am. Bartender was nice, Hennessy was $10.50 (which was kind of expensive), and unlimited chaser.  This place would of been better if they served food, but at least they let you bring in outside food.\n\nGreat vibe - other customers at this bar was friendly.\n\nThree shots later, mission completed - I went to my treatment not feeling any pain.\n\nOne star off for not serving food.  Another star off for expensive Hennessy (not like it's a night club).", "author": "Mary B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-09", "description": "If you want to post a neon Boston Red Sox sign in your window and tout your establishment as a \"Red Sox\" bar, you should show Red Sox games and own the \"package\" that would allow you to show all Red Sox games. I've been here four times expecting a game watch opportunity, most recently Red Sox vs Yankees (a brand name type of game), the last excuse for not showing the Sox on even 1 TV was: \"It's now football season.\"  Buddy -- it's September and your \"namesake\" team is hot!", "author": "Aimee F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Best bar on Union, Jay the bartender rocks!  Nice pool tables in the back and always several games on the tv's and not just the local games.  Friendly neighborhood bar where everybody knows your name!", "author": "Joe I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "Too much volume on the TV and dirty beer lines otherwise not a bad place.", "author": "Luda F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "I have fond memories of the Bus Stop. Sometimes it's not so much the place as it is the moment and the company you were in, so I have to say I am biased by the good times. \n\nA fun place to meet up with friends for cocktails. I may not come in often, but I always can find my way back to the Bus Stop.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "Best local bar on Union Street.  It's more of a casual sports bar than a dive bar.  Always get good service and they have good prices.  It can get a little crazy on big games, which can be fun or not fun depending on your perspective.", "author": "Greta R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "We have been here twice and just gets better. Excellent customer service, hard working friendly staff, great food, drinks, and people. Cottage Pie, Chicken Pie, Bangers & Mash delicious.", "author": "Hugh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "\"Here\" \n\nHe plops down a pair of wooden carved hands on the bar in front of me.\n\n\"What is this?\" I ask\n\n\"The hands of poura. From thailand. A gift for you.\"\n\nAnd then the man left. I have never ever been given a piece of art at a bar before, and granted this older man in his 60's definitely had a few whiskey's on the rocks in him, but any bar that gives people experiences like this is a winner in my book!\n\nWhat made it even better, is right before I donated those hands to the bar in honor of that man, the bartender decided to find a use for it and discovered that a beer could fit in the hands! It was definitely a conversation starter! And I have to say that people in this bar I swear are much friendlier than most places! People would walk into this dive like bar complete with pool tables which is always a plus and see these hands sitting in front of me and just kind of stare until we both started talking and the story of the hands was passed onto about 10 people that day!\n\nThe bar tenders here are great too. Very attentive, and you can tell that they have quite a few regulars on that come here, knowing them all by name and knowing their drink preferences too. \n\nFor $3 drafts and free little pizza tapas during happy hour here, on top of daily specials they have on beer and mixed drinks, this bus stop is more like a bus party!", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-15", "description": "Fun spot to watch a game and discuss sports with others.\n\nAtmosphere: Dive-e\nQuality: All your bar essentials. Light beers, Irish whisky, etc.\nValue: Good. A little on the expensive side for the atmosphere, but made up for in portions.\nService: Excellent friendly and tolerant of outsiders.\nLocation: For locals.\n\nMy time there: Shots, beer, yelling at the T.V. and meeting new friends. Towards the end of the night the bartender busted out a couple pizzas for our wasted heads. It was so good!", "author": "Steve L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-19", "description": "Cheap drinks + a good bartender. That's why you come here. And maybe if you want to watch football. But that's pretty much it if you're a girl.\n\nThis guy sitting at the bar began to chat up my GF, telling her that his friend has lots of money and a big cock, so she should give him a chance. Wow, does that actually work on people? She rolled her eyes, then we rolled out.", "author": "Joy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Liquefaction under my parent's old apartment.  They said it had a murphy bed.  Goes for $3500 now.  Each step is three feet off the ground, like I'm wearing stilts. \nI stilt around the neighborhood.  Bus Stop since 1900.  My folks went here.\nIt's packed.  A seat opens; I sink onto the stool.  Comfy.  Amongst me, Eleanor Rigby on Bloody Marys and newlyweds nursing their first date out since they birthed their baby subaqueous.  A photo of the little one.  Cheers ( Jesus that thing's ugly, which hole did it come out of? )  Big white Dave, an elemental healer in Mexico, buys us a round and rips my team, ucla.  I serve it back.  Guffaw, backslap, I'm in on the next round of Jager with the Camp Pendletons and Circle Techs.  Over and under, parlay, cover the spread, bubble and squeak. The gurgle cup.  Circle Tech just came back from Yacht Week and got french kissed or more.  Photo of a boat.  Cheers.  Sorority mermaids and gregarious doormen toe up-15 of us with shots.  It's college football.  It's noon.  I'm in a low gravity logjam on a former landfill with perfect people.  Then The Big One hits.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "Great prices,  amazing staff. 10+ televisions for all your sports needs. Jukebox for you earworms. Can get crowded on game days and weekends. Some of the stiffest drinks in the Marina!!", "author": "Annika J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Fun spot to watch a sports game with your friends. Tons of TV's and a good amount of tables and stools. Also, two pool tables and other arcade games (pac man)! Drinks are good and inexpensive and the bartenders are great. I've never done this before, but I've seen many people bring food inside, which is an extra bonus for this bar.", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "My marina hole of choice!\n\nI will admit, I really like Bus Stop. I've brought pizza in, played some killer games of flip cup, shared laughs, met friends... the whole bit. They offer Bartab (and actually understand it) too. \n\nPool tables, check (I am horrible at pool yet still insist on playing), drink specials, check, on the bus line that takes me home? Check! They don't call it bus stop for nothing.", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-21", "description": "Stuck in the Marina? \nNo problem, the Bus Stop is here to save the day! (or night)", "author": "Giana M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-02", "description": "Okay, if I were rating on a heavy handed pour and service this place easily gets a 5 star. EASILY!! Walking into the place you immediately think back to your college days. Awesome. Now, you might be saying why did I rate it 3 stars. The bathroom. You can't piss without splashing the dude next to you. Seriously. Put up a cardboard barrier! The best part of the bathroom is hearing the chicks talk through the vents.But honestly  ut's crappy when your leaving with another dude's urine on your pants!\n\nBottom line, great bar! If you have to go piss, walk outside.", "author": "Mason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "Came here with the date for round 2. Since I was drinking already I just order a Mandarin & sprite. It was strong( I'm a cupcake/lightweight drinker).My date had to finish my drink because I don't like wasting. The bartender was nice. It wasn't too crowded since it was a Thursday & that's sweet b/c I hate crowded bars.", "author": "Court S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "My girlfriend accidentally dropped a drink and josh yelled at her like a jerk.  Never coming back", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "Came here with some friends and my girlfriend following our stay at a nearby bar that had taco Tuesday. We were trying to play pool and have some drinks at the bar we were at, but people crowded around the pool table and made it nearly impossible to play and they just didn't get the hint that they needed to get out the way. Somebody mentioned Bus Stop had pool tables so to this bar we went to try out.\n\nAt the time we arrived, which was 9pm on a Tuesday, it wasn't too crowded but one thing that stood out was a woman playing Nintendo Wii by the entrance. Pretty cool feature to this bar and would surely be fun if drunk and took a chance at the Wii while drunk. The bar has three primary areas: the bar itself, an area to sit down and have drinks and in the back there are two official looking legit pool tables that brought out big smiles. It was free at the time so we were ready to play and at a cost of $1.25 per game, we realized it was well worth it. There are many sticks to choose from for your use and the tables were specifically designed for pool and they had rules up indicating this place is no joke when it comes to pool.\n\nIn terms of drinks, we bought some Old Fashions and Manhattans to warm us up a bit and we realized after 10pm on Tuesday it was happy hour, cutting the price of our drinks in half to a cool $3 instead of $6. Of course our extra change went to the bartender and our pool games. By the end of the night, we ended up having about five such drinks and were clearly buzzing/drunk by the end of the night. Strong drinks, good bartenders at this spot.\n\nOverall, it was a good first time and must return here on another day to see if its just as cool as the first time. Definitely a must try spot.", "author": "Jesus A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "Came here near closing time and grab a last drink with my friend.  Didn't really get to enjoy everything this place had to offer cause we just sat at the bar and chatted, but there was some game machines, a pool, table and plenty of seating in the place.  Will definitely need to come here on a Friday or Saturday night to check out the scene.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "Great spot.  The bartenders are conversational yet they take care of the brisk business.", "author": "Doug B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-19", "description": "I got 8 beers ($46) for my table. They charged me $113. The girl said \"sorry people were charging things to your tab\", they clearly knew and agreed I didn't order that amount, offered no resolution, and then told me I need to leave. The only name I got was Craig, a manager. Also no resolution. Unacceptable.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-11", "description": "Awesome little sports bar in the Marina!!\n\nthis place gets really packed on a saturday, the bartenders and workers that work here are really nice and made sure I was accommodated, I'm not sure if it was one of the bar backs but I thought one of the guys that worked here was really cute, lol. Oh, and $6 peligroso shots btw..as in peligroso tequila..which one of the guys I was chatting with said that peligroso is the Spanish term for 'dangerous', this turned out to be completely accurate..so basically it's called dangerous tequila..how fitting..hahah. Here the drink prices are cheap and the crowd is pretty cool, your typical rowdy and fun sports fanatics.. I came during a  UCLA  football game so there were a lot of Bruins fans and people there just hanging out by the pool table room just watching the game and they even brought their own pizza..lol, so I guess outside food is allowed. I had no idea how many UCLA fans we had here.. I would definitely be back and bring friends! :)", "author": "Amy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-05", "description": "This place will also hold a weird memory for me as it was where I watched the replacement refs ruin an excellent bet for me by deciding to call an interception a touchdown allowing the seahawks to beat the packers and stunning everyone in the bar. However, I have been here other times than that and there are some cool things. One it definitely seems to have a less aggressive crowd than the other sports bars in the Marina. I have watched a lot of different things here including march madness, college football, nfl and nba and never had the kind of people shoving around experience that I see/experienced at Monahans. So that is a big bonus for me. They also have really cheap drinks during non-happy hour times, a good number of TVs and a decent amount of space. \n\nThey let you bring in food from anywhere else since they don't serve any, which I actually prefer. \n\nNot thinking of any huge negatives, but I can't really justify giving this place 4 stars just because I prefer it to the other sports bars in the marina. If you are in the neighborhood and looking to watch a game and have good priced drinks definitely come in here. However, if you are planning a big special day or coming from the other side of town, it is probably not worth making a special trip.", "author": "Clayton V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "I root for three NFL teams every week.\n\n1. NYG\n2. OAK\n3. Whoever plays SF\n\nThat being said, I like to watch games at sports bars when I am not working.  Bus Stop has tons of TVs and the service is good.  i wish they had food (the box of pretzels is a short term fix).  I could spend 6 hours watching games, enjoy a cold beer but with no food, I have to pick a game, then leave for food.\n\nAtmosphere is good and the girls are pretty (I met the love of my life there - she was actually trying to set me up with her hot friend - little did she know...)  LOL.\n\nAnyway, try the place, esp. if you are a Packer fan.  Good crowd.", "author": "Allan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-18", "description": "Decent drink prices accompanied with memories of going back to the college frat scene. Decent place to watch a game. Nothing too special.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "Please do your self a favor and stop at the Bus Stop! \n\nI absolutely love this place and have become a familiar face at the legendary sports bar. They have the absolute best drink specials which you can enjoy when you watch our World Champs dominate on one of the many TVs they have hanging around the bar. The crowd is always super friendly and easy to socialize with which I love! Not to mention, I absolutely adore one of the servers there -- Brittney I believe is her name. She's always smiling and has a damn good sense of humor which I always appreciate.\n\nGrab your friends, grab a brewski, and grab a seat. It's game time.", "author": "Sara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "One of the best bars in SF despite being in the heart of the Marina. The owner is always friendly, as well as the rest of the bar staff. Highly recommend if you're looking for a place to watch a game or just want a cheap drink. No food service but if the free pretzels don't tide you over, feel free to bring outside food in.", "author": "James O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-25", "description": "THANK YOU! for being the only bar open on union st christmas eve!\n\nI needed to loose up and hang out with a few friends after christmas dinner with the fam and this was the only spot open. thank goodness it was discovered!\n\nroomy bar w/ cool dude bartending. They have multiple beers are on tap and plenty of drinks to choose from. They have specials EVERY DAY and it's posted behind the bar up top according to the day.\n\nthey also have this fruity beer all the ladies would love of course.\n\nin the back, two pool tables and a quarter machine to play all the games you want. I was wondering if there were any pool table fights / bar fights back there though", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "Good times.  Good low key bar that's not too pretentious in the Marina.  Usually has a good and friendly crowd.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Great atmosphere. Bartenders are knowledgeable and super chill. Classic sports bar with pool tables and live music on popular nights. Everything you'd want to watch the game and hang out.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "The Bus Stop is the classiest place around. Bartenders are great and so are the waitresses. Once they get to know you, they hook it up very well\n\nThere is also trivia on wednesday nights where you can win free drinks. \n\nOccasionally Pat the Bat rolls thru and that's always an awesome conversation. \n\nOverall just a sweet ass establishment!!!!", "author": "Charlie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "Old stomping ground back when my friends and I visit the Marina Bars at LEAST once a week.. yeah, we're kind of a big deal! LOL This place is usually our first stop and end up at City Tavern/Circa/or Hi Fi (?) I think that's the name of it. Last time we were here, we met some cute Aussie hunks with their Aussie accents! We're such suckers for accents and Aussie's so we hung out with them all night! That was a blast :-)\nThe drinks here are always made good, you get your money's worth since they don't skimp on their alcohol and it's cheaper than going to Matrix or Circa. There's plenty of bar stools and seats to chill if you're tired of standing around. We always meet some wonderful and interesting people here, too. Good place, I highly recommend coming here!", "author": "Jojo N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "I love this bar because they allow you to bring your dog inside since they do not have a kitchen! How awesome is that?! Aside from being a pet friendly bar, they pour awesome drinks. They are never watered down, and completely filled to the rim of the glass. Even if you order a straight glass of liquor. Aside from the drinks being great, the bartenders somehow remember who you are when you return despite the number of patrons they see a night. Although this is not a fancy bar, it is a great casual neighborhood spot.", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-21", "description": "Like Fillmore the van said in the movie Cars...\"Respect the classics...man!!!\"  After leaving the latest hotspot on Union, aka, The Brixton, I needed a little grounded normalcy on my way to The Brickyard.  Popped into the Bustop and found it here.  This place has been around since 1901!\n\nAround 8PM on a Friday night, it wasn't too crowded and as always the bartenders were great and pouring strong, real drinks at reasonable prices.  I had a nice Absolut Citron and soda with a lime and got on one of the two tables that I've been playing on in there for years.  Although the table looked to have been recovered in a tan cloth that I wasn't particulary fond of, I was happy to see that it played better than ever and after I finished playing with myself (pool...get your mind outta the gutter!), was able to five bank the cue ball into the last remaining ball.  This would not have been possible if even one of the bumpers had been a touch off.  The table passed the Roy test!  \n\nI had a ton of great times in here back in the day...I really need to come back here more.  Truly a great bar, may it never change and last another 100 years.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-19", "description": "If you want a laid back night, enjoy some drinks, and socialize this is the spot.  The only headache for me is parking.  If you don't get to this area early enough you'll find yourself going in circles.  \nWhy a 3?  exactly as described it was an A-OK bar. What would make it better...THE BATHROOM..It's so stinkn small, I was thankful that once in my life I don't have long legs.  If  gossiping you'll also find yourself in a lull conversation since the wall is thin, the guys can hear what your're saying clearly and vice versa.  \n\nAnyhow I wouldn't object coming here again..it just wouldn't be my ideal place to hang out.", "author": "Blue S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-06", "description": "A nice little dive bar, this place is actually a bus stop outside. I came for Trivia Night on Wednesday and it was fun! The questions were a perfect skill level. Not too hard, so it's no fun because you never get one right, but not too easy so that everyone does well.\n\nThe drink special during Trivia was $2.50 Sam Adams and $3 Kamikaze shots. The service was decent and the crowd diverse. The Trivia girl was entertaining and I would certainly come back!", "author": "Steve V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-22", "description": "A nice spot to grab some beers and relax with a group of friends. It does get surprisingly full but that makes it more lively and fun. Went here to catch the Cal game on a sat and the place was full of people from all schools. It really has a nice vibe and cheap beer, really worth a visit!", "author": "Edwin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-17", "description": "Super crowded bars during football season. They should also have better drink specials.", "author": "Brynt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "Please disregard Kevin C.'s review. I was here when that lunatic delivery guy came in and behaved like....well, in his words, a prick. I'm an SF native and have been coming here for years. Easily one of the coolest spots in the City. Fun and chill, best juke box, spacious and great people! Check it out - you won't regret!", "author": "Q M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "My favorite sports/dive bar. It's everything you would expect from a bar called the bus stop. Atmosphere is always loud, energetic, and fun. Cheap beers, lots of TVs and a fun crowd. No food but they do let you bring in your own food.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "Have you ever left a sports-bar after a full day of NFL playoffs drinking, started walking home, and then felt a place you were stumbling by, draw you in? Well, this happened to me a few weeks ago, and it seriously was like the Star Wars tractor beam just pulled me in and I had no control. OK, that's a horribly nerdy analogy. Retake, let me try again. It seriously was like Heidi Klum slid out of her mini-skirt, stood there buck-naked & wanting, and motioned to me with one finger to come in. I couldn't resist!\n\nThe crowd was fun, it was not over packed, and the beer was flowing. Next thing I know I'm dancing with a bunch of people I don't know and screaming out \"G L A M O R O U S ! !\" (hey, don't judge me on that one, I had a few drinks).\n\nThere are plenty of TVs to watch games, pool in the back, and a sit-down Ms. Pacman for you to challenge unworthy opponents (just don't play my friend John, he's a ringer). They don't serve food (that's why I didn't make the Bus Stop 5 stars), but they do allow you to order in, which is pretty cool. The owner even sometimes orders in Amici's for the entire bar. They have the best drink specials you can find every day too. Very Cool!\n\nOn of my favorite little things about the bar is the picture near the front door of Bill Clinton running in his Bus Stop t-shirt on near the Golden Gate Bridge.\n\nI'll see ya there! Maybe even after the Superbowl Go Giants!!!", "author": "Dave L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-17", "description": "This place was pretty fun last Thursday night. I went after dominating in a Kickball game with some friends and then met everyone here after for flip cup tournaments. \n\nThe place was packed. Pretty fun, but kinda messy. Pitchers of Coors light were $11. They do have pretty great beer and cocktail specials. Thursday night had $3.75 hefenweisens and sunday's have a good bloody mary special. Most drinks are all under $5 for these specials. \n\nMy recommendation: Good place to pre-party and watch out for organized sports teams on the week days. It's pretty packed from 8 PM-10:30 PM.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-13", "description": "Some friends and I ventured here over Fleet Week weekend. Per usual, I was a) grateful to abandon Chestnut Street and head to it's more casual cousin Union and b) always down to try something new. I had never been to the Bus Stop before!\n\nI must admit- despite the craziness that was Fleet Week, the Bus Stop still maintained a relatively laid back and enjoyable atmosphere. \n\nI'm not really a Sports Bar/Dive Bar kind of gal (exception: Love me the Final Final!) so I'm not sure I'd venture back. \n\nCan't comment on the bar tenders, but the bouncer was friendly!", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "This is a great place to watch a Giants game or Niners game with your buddies and knock down a few buckets of beers. They have a decent selection on tap as we'll and bartenders Jason and Ron are quick on the draw. There are free pretzels and you can buy smokes behind the bar. One of the few great watering holes in yuppieville. There are two pool tables, pacman, and buckhunter if watching the game doesn't appeal to you. Once in a while you'll get lucky and Ron or Jason will treat customers to Amici's pizza! If you are a regular you will earn free drink tokens that you can save for rainy days.", "author": "Billy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "What can I say about the Bus Stop? Well, it's a bar. Yup. Pretty much. It's a good place to grab a beer if you can get a table. If not, and it's overly jam packed...not so much. The crowd is mediocre, but pretty chill, so it's alright. There are definitely some odd ones though, so just remember that some people might want to start fights with you if they feel like it. Also, for some reason the bar brings out the \"wasted\" in everyone. I swear, every time I've been here, the end of my night becomes blurry.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-21", "description": "Came here on a Tuesday after going to 2 super crowded bars for Taco Tuesday. Anyways, it was really empty (expected for being a tuesday). It has pool tables and a lot of seating which was nice. It has a super chill vibe. I'll come back again to get a better feel for it but it was a cool bar. \nEveryone I was with said we had to go there so I guess it has a good rep in the Marina.", "author": "Cesie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "I have to give this place 4 stars because they are a Cincinnati Bengals bar and I come every Sunday that plans allow. The female bartender makes FANTASTIC Irish Coffees - the same as Buena Vista Cafe except a little more booze.  This is a plain old Sports bar so don't expect anything else.  The bathrooms are teeny tiny but it is what it is.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "Nothing amazingly great or horribly bad to say about this place. I come here usually for one beer during a Giants game, or meeting up with a friend. We always end up migrating elsewhere, but it's an alright spot. \n\nThere's pool tables in the back underneath a nice skylight roof. A nice spot to be when it's sunny out. If you plan on sitting and watching the game back there though, be prepared to get poked by the pool players. Honestly, not the best seat in the house unless you're there to play pool or watch your friends play pool. \n\nThis bar gets really crowded at times. Almost hard to move around, and that's usually about the time I leave. I must admit though, this place is always the loudest bar on Union during a big game. It's definitely a fun game-watching spot. \n\nOn my last note about this place-- I've never seen the bathrooms clean here... meh.", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "I can only speak to this bar's ability to host my WAKA (Kickball league) post game drink ups. They excel in this capacity. Go Suck My Kick! \n\nBeers come by the bucket, in tall boy form. The other special we are permitted to indulge in is pitchers of Amstel Light. During our post game revelry we suck both of these down en masse, utilizing the pitchers for exciting games of flip cup. In fact, I have to give this place a star for allowing us to play flip cup on the pool tables in back.\n\nThe kickball crowd is full of fun, and we love to drink, so if you see us in here (look for people in the back wearing outrageous sports gear and shirts with the bar's name on it) come and join in.\n\nI don't know what the usual crowd in here consists of, but if my previous experiences in the Marina are any indication this place is full of overgrown frat boys and the bubbly vacuous women that they love so much. Got money? No money, but you LOOK like you've got money? You'll be OK.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "Strongest drinks in the city! Great place to start the weekend nights off right! Also fun for Thursday late nights! Fun dive bar when you're just trying to have a good time - pool table in back! Good for big groups, guys who work there are a ball! So fun,so casual. The only thing that is a downer here is the tiny girls bathroom --- awk. But other than that great!", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "I live up the hill and this place pulls in all the \"bro mentality\" Frat boys.  Be prepared to high five all drunk Fraternity folks, these people never grew out of the \"being in college stage\"  Oh yeah, don't forget your Letterman's Jacket!\nThis place is really lame and smells like barf!", "author": "Hesam E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "First straight bar I have been to that pours almost as strong as a Castro bar.  That's four stars in my book.  Bus Stop seems like that great dive where everyone can congregate and drink without worry.  We're all just at the Bus Stop, waiting for our ride to come.  That being said, might be more a pitstop and less of a destination.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-08", "description": "Great place to watch sports games at. It can def get crowded and you can get caught up with a younger crowd depending which day of the week it is. But great happy hour, and during baseball season, when SF wins, PBR specials for 30minutes after.\nHey, it may not be good beer, but for \"celebrating\" it gets the job done.", "author": "Jenn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "The Bus Stop is a great place to unwind in Cow Hollow. My wife and I love to hang out in the back and play pool and enjoy the drinks. It's one of the only blue collar spots on Union St. Ron's an excellent bartender and we always end up talking to the friendly regulars like \"PBR Brian\". No bullsh*t here.", "author": "Pete F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-03", "description": "Really cheap drinks, a cute arcade game corner, good amount of seating, and pool tables in the back!", "author": "Melody L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-24", "description": "We go here to watch UGA games during the fall. It's super crowded but they have TVs mounted near the ceiling, so it's easy to see. You can get a bucket of beers for $18.50. Main complaint is that they charged everyone different prices. They charged me and another girl $18.50 each, they charged my boyfriend $18.00, and they charged our guy friend $16.00. Seems ridiculous to charge girls more than guys.", "author": "Jillian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-31", "description": "This has been my second time here at Bus Stop. There is definitely an older crowd feel, but the drinks are HELLA cheap. The two times I've been here was to celebrate a friend's birthday - the SAME friend. When we were here the firs ttime last year, we were there for 40 minutes, decided to leave and bar hop, but little did we know - our bar hop count that night would be ONE. My bday friend was fed drink after drink by us and was GONE when we left. \n\nWe spend the rest of the night taking care of her and cleaning up her puke. Yeah.........\n\nLet's move on to this year. The night we went, Tuesday, 2 shots of Jameson for $7!!! Ka-ching! SO CHEAP!\nThe special that day was also some ridiculously cheap amount for a bucket of beer. The crowd was still old, but we didn't care, we had fun by ourselves near the back with the arcade games and the high top tables. This year was a success, we were all happy drunk, didn't spend a lot of money and had a great time.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "Friendly bartenders, STIFF drinks, good prices, lots of TV's, great ambience, great scenery and awesome location.  I'll be back.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-29", "description": "I wish the staff was more professional. Whether you work at a bar or in an office you can be courteous.", "author": "Dee O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "I swear the only actual bar I was able to find on union St... I was looking to kill some time Saturday morning and the bartender was sweet. The mimosa was great- I like getting my own mini Korbel bottle!", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "I have been going to the Bus Stop for almost a decade now.  It is hands down the best Sports Bar in town!  The bartenders there aren't trying to make fancy cocktails that take us back to the Prohibition Era. They are slinging drinks and pouring beers and talking to us about our day and our lives!  That's what it's all about right?  Not about waiting fifteen minutes for a drink and then another fifteen minutes debating about Rye or Whiskey...  Keep it up Bus Stop!  We love you!", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-17", "description": "HAH. The name of this place is so confusing, I hate it. Whenever someone says, let's go to the bus stop, I always have to double check to wonder what they actually mean. Parking around this area is NOT FUN not to mention IMPOSSIBLE. uphill parking amongst a crowded area. \n\nReally does remind me of what I would think a college bar should be...not at all sophisticated or chic but more like... grungy and pool-table and crowded/hot. Lots of frat guys or guys who were in frats that still act like they are....\n\nJello shots for a dollar!", "author": "Joyce D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-23", "description": "Just a bar, in front of a Bus Stop. The bartenders are bitchy, well at least when I was there. The drinks were average, def a beer place. I'd say if your a dude looking to slam some beers with some more dudes and talk S%^&$ about sports and how the Giants are better than the Cardinals, then I'd say this is the place for you. However I'm just a girl who drinks Vodka Tonics, and is still bitter about Pujos leaving the Cardinals...so Bus Stop could possibly lead to a bar fight with a Giants Fan.", "author": "Lannette G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-24", "description": "This is the spot for a beer and a ballgame in the marina. Not too many pretentious marina types, decent sports bar, and great beers on tap. I wish I had a dollar for ever saturday afternoon I wasted in this place....", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "Love this bar! Fun atmosphere, great service, and the bouncer, Tom is the funniest dude! He is awesome!", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "Any place that has Pac-Man gets some automatic love from me. And pool. And buckets of beer for sale. And drink specials!\n\nI came here the same night I went to Bar-None and hands down,  the folks at Bus Stop were way cooler. Bar-None was fratastic - Bus Stop hosted the crew that was too cool for frat parties. You know, the guys who would skip frat parties to get wasted with the owners of the local dive bar down the street and drive pitchers of beer back to their house at quittin' time. Those guys ruled.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "The Bus Stop is a Marina/Cow Hollow landmark!\n\nI have been going here for quite some time but really settled in over the past year that I was living in SF.   We considered this place our home base for any night out and typically started and ended most good nights here.\n\nThe drink prices are very reasonable and they have specials for each day of the week.  It's usually not super crowded (outside of major sporting events) and it's also the last place that you will still be able to get in at the end of the night.\n\nMake friends with the bartenders and the guys at the door and you will be golden.  \n\nDon't expect much from a cleanliness standpoint though as things have not changes much inside for a long time.  I only have two complaints really which are lack of cute girls and lack of a clean restroom.  But then, that's not really why you come to the Bus Stop is it?\n\nThis is not where you take your date.  This is not where you go to meet dressed up women.  This is not a classy establishment.  This is a great, historic, down home bar to start your night with the boys or have a last shot before you head home.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "Good sports bar, nice vibe with good drink specials. The owner is great and the bartenders are always on it for my group (we watch football there).", "author": "E. H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-03", "description": "A friend was in town from Boston, and a common friend who was also originally from Boston suggested we meet at this bar because it's a \"Boston bar.\" I was curious about that. I showed up with all suspicions immediately proven--skinny white boys with baseball hats gazing/shouting at television screens with sports. A wall of men. I could not proceed. Sports galore.\n\nThere were more TV screens visible than wall space. Within seconds of walking in, a drunken guy screamed \"I LOVE YOUR HAIR\" at me. Things only got worse from there. I came here with an open mind, but all the rumors/stereotypes/suspicions of Marina types were proven correct. Very correct. If I wanted to live in Boston, I would have stayed there, but I moved 3,000 miles away for a reason. (And that reason is the Mission.)", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-02", "description": "I have no idea why I got the stink-eye from the bartender the first time I stopped in here on a Friday afternoon for a beer. The important thing is that he didn't give me seconds the next time I came through, and he got me a cold beer in a hurry. \n\nI think the Bass tap might need a little cleaning though - my beer tasted suspiciously botanical. This is very much a neighborhood maintenance bar. That having been said, it's a pleasant enough place to put your head in your neck and open your throat.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-03", "description": "This is a nice little bar on Union.  I went there on NYE to watch a mid-afternoon Mizzou bowl game, and found the crowd friendly, the beer cold, and the multiple televisions perfectly perched for maximum viewing pleasure. This place was essentially a good copy of every decent bar in every decent college town in America, and it made me a little nostalgic for my Alma Mater. \n\nThe bathroom was incredibly tiny.", "author": "Sarita T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-23", "description": "I need to update my review since I have read some of the posts. \nThe owner has put the place up for sale! I just pray to God that whomever buys this bar keeps it as it is and doesn't try to change it into a manicure/pedicure place! What will all us regulars do? This is truly a place where we feel like family. The bartenders are cool, and the drinks are a good deal!\nFirst of all , this is not a bar in the Marina. It is in  Cow Hollow. I think people get confused since they see Marina people going in there.\nSecond of all, the place has a comfortable feel, and the bartenders have been there a long time. They know what they are doing, and their drinks and knowledge of them show that fact. They have great drink specials too. Every day! This is a sports bar, so during the games it can get crowded, so don't take stars away because of that. If you're not into sports, you can go down the street.\nSecond of all, it isn't a dive bar. It is an historial landmark! It has been there over 101 years!", "author": "Fog City Girl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "There is a good reason why the Bus Stop gets 3.5 stars and Bar None only gets 2... the Bus Stop is a better bar! Next time, [you know who you are!] please listen to me and come to the Bus Stop for a much better time. I swear the extra block walking will not kill you... and, if you're already blacked out, you should really let me choose the bar because I will actually remember it! I still love you though...", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-06", "description": "I love the Bus Stop. It's a great atmosphere run very well by the staff. There are plenty of TV's everywhere. You can stand in one place in the small bar and have a view of at least 3 screens at one time.\n\nThe back room has 2 pool tables and offers more space for larger groups to watch their team. There is no food service but they do provide a stack of menus from the local eateries and a telephone to reach them. You can pick up and eat the food in the Bus Stop. There are times when the bar will order pizza for the patrons.\n\nI'd visit more often if I didn't feel like every time I watched my teams on the TVs they lose.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "This joint is just so good!!  Love the location! Can't beat the decor! Always fun and friendly. Don't miss their Festive Fifth celebration every January for a real good time!", "author": "Junie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-21", "description": "It's a good place to go if you've been biking all afternoon and kinda grimy.", "author": "Suz L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-05", "description": "If you want me to vomit, and/or shoot myself in the face, take me here. \n\nI just wasted 30 seconds of my life writing this review.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-05", "description": "Did I just walk into the movie \"Heather's\"?  \n\nGenerally, I can go into any bar and make friends.  Girls, boys, queens it doesn't matter.  (Take a look at my picture, I'm cute and I'm friendly.  However, I am not blonde and that's all I'm gonna say about that.)\n\nHere...I get NO LOVE.  I'm exaggerating a little, but people are so consistently unfriendly and cliquish that I've actually had to rate the place 2 Stars for their sucky-ass clientele.  Can we please get a little more discernment at the door? Isn't there a Frat boy capacity? or a limit on boring blonde's?\n\nWill someone please sign my petition to bomb this place for hurting my feelings?\n\n*Note to YELP Gods and the Bus Stop- I was kidding about that last part.  I kid. I'm a kidder.", "author": "R M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "This is a nice little bar on Union.  I've been here a few times to watch the Dallas Cowboy games with friends. This places tends to be either really crowded (clausterphobic crowded to seating available bare). \n\nThe crowd is usally friendly and rowdy depending on which games are on the screen, the drink prices are pretty good and there is always something on special on anyday that you are there.\n\nParking is practically impossible here, I recommend taking a cab and the bathroom is one stall and tiny!\n\n(  I mean itsy bitsy teeny weeny, might need to suck it in or depending on your body stucture you might need to walk over to another establishment tiny.... and if you think you can grab your girlfriends for a quick gossip session in the bathroom..FORGET ABOUT IT, just go and enjoy your time by yourself, oh and no real room for anyone to hold your hairback either so make sure you can hold your alcohol or leave before you get to that point in the night or day)", "author": "Sandra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "where everybody knows your name!  and your favorite bartender ron hooks you up with giants v cubs tix every year.  \n\nwe love this bar - it's a bar's bar.", "author": "rachel s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-20", "description": "I'd like to thank the asshat patrons that rule this Marina bar. Not for their ever courteous and friendly hellos (wanks), or their total lack social regard (boo) - but for their sucky Tetris skillz. Because of these drunks, I've been able to maintain the spots #3, #8, and #11 on the Tetris High Score list on 3 measly quarters.\n\n\n********UPDATE (2/07) Someone removed the Tetris Arcade! Loss of 2 full stars.*********\n\nIf you're going to party in the Marina - hit it on a Wednesday night. Buckets of Bud Light for $12, good music, and at least 5 dudes who have just finished reading \"The Game\" and want to test out their new pick up techniques. \n\nHowever, if I hear one more Marina turd yell \"ANOTHER ROUND OF JAGER SHOTS!\" in here, I'll puke. No, really. I'll puke. In fact, I have puked. I'm puking right now. Gag me with a silver spoon.", "author": "Katelin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "How did my Monday night become a Friday? \n\nVisiting Bus Stop was were it all began. Even though I had a blast playing the video games and watching sports while enjoying a beer, I'll never want to relive my Monday night drinkfest. The rest of the week becomes a blur.\n\nThe bar is fun, but very divey.", "author": "Dee C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-19", "description": "Ok, I think I figured out why us Yelpers like to talk mad smack about the Marina...\n\nIt's because us \"normal looking\" kids never get hit on in this neighborhood, and lets face it, Yelpers like attention. \n\nAfter a day of playing San Francisco touron with three of my ladies, I ended up in the Marina, at the Bus Stop, downing bucket after bucket of icy Budweiser. Sitting and watching Ice skating and Tony Braxton on the televisions (sports bar? hmmmm, very interesting), I looked around at the pretty frat boys and noticed something...\n\nNot one of them was looking at me! Blasphemy I tell you!\n\nI immediately turned into my prudish, uber-self conscious self from the 9th grade, and let me tell you, it was no fun.\n\nI was all of a sudden turning to each friend telling them about how gross I was and how after recently looking at photos of myself, I realize what a hideous beast I am.  (Each friend sat rolling their eyes, as the boys I pointed out as hot hit on them)\n\nI mean, I've got the never-ending tata's, but they were getting absolutely no ogling. They just about shriveled up an died. \n\nSo after trip after whiny trip to the bathroom (I'm mystified as to why bars like to paint their restrooms black...it doesn't cover up the dirt, just makes it look like the den of Charles Manson), I decided enough was enough. So I dragged my tired and non-hot ass out of there and joined the ranks of the plain looking-folk on the bus.\n\nAhhhh, my haven!\n\nLady with the biggest FUPA known to man\nChristian Scientist boy in a blue suit\nCrack-head in the back with holy pants that revealed his nether-regions\n13-year-old wannabe gangstas with pants the size of Wisconsin and cellphone charms\n\nThese are MY people\n\nThe guys who are not MY people are those douchey losers that were sitting next to us talking intimately about getting head from hot chicks. So not a conversation I wanted to listen to. \"So I'm about to cum and....\"", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-05", "description": "I'm not someone who typically goes out of my way to review places (good or bad) - but I thought this incident warranted one. I was out with a friend who had a couple drinks, enough to be buzzed, but not drunk - he was not allowed into the bar on the account that he was too \"wobbly\". My friend was fully coherent, civil and competent yet the bouncer made him stand outside in the cold - it was a poor choice on the bouncers part and a very poor stubborn judgement. It was very frustrating and condescending to see and am no longer recommending the bus stop to my friends from now on based on this incident.", "author": "Z. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "OK, I'm really biased when it comes to this place.  Why?  I used to work here.  So I'm obvi going to give it 5 stars.  Now that we got that out of the way, here are reasons I still frequent this bar:\n\n1. The drink specials are legit.  $8 for 4 tall boys in a bucket?  $4 bloodys on Sunday mornings?  .50 cent PBR after a Giants win?  Ok, that clearly didn't happen that often this season, but it's the thought that counts, right?\n\n2. The staff is awesome.  The cocktailers get the job done, the bartenders rock the stiff drinks and attempt to get to you asap, and the door guys keep the under-agers out as best they can.\n\n3. The new jukebox keeps the music diverse, the pool tables get covered for huge ragers (Georgia games, flip cup tourneys) and are pretty easy to get on when uncovered, and although the crowd can get a little....fratty, it can still be fun and definitely an adventure.\n\n4. I live less than a block away.  Convenience is key.  Plus I know everyone so I get served extra quick.  So HA.\n\nAll in all, its a good bar thats unlike all the other Marina bars where you can go after work, unwind with a stiff drink and watch whatever game is on the tube.  Say hi to Devin* for me while your there.\n\n\n*obviously staged shout-out per her request :)", "author": "Erika C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-17", "description": "There's Video Golf and some other pinball types of attractions and if you want to fit two girls into the bathroom stall in the ladies' room, you're going to have a hard time but it can be done. \n\nWell drinks must be cheap here on Tuesdays because I had 4 or 5 of them and Matthew didn't complain once about the rising cost of keeping me inebriated. I can tell you that Bus Stop is the quiet, shy little brother to the rockin, raucous Blue Light down the street. I know because we rolled in here, 5 or so cocktails into the night and continued to down 'em like we were practicing for the binge drinking olympics. Bad idea. \n\nNow that I've officially adopted the Marina as my bhf (best hood forever), I'll probably start spending more time at Bus Stop. But next time I'll come sober(er) and write a more USEFUL review.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "The bus stop is a great local/sports bar. Every weekend there is a game, my friends and I go there for drinks. They have good drink specials, but what's easiest is the bucket of beer. I think they give you 7 or 8 bottled beer and if you can't find a place to sit/stand these are perfect.\n\nThe bartenders are very nice there too. Love you bus stop!", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "Great neighborhood bar. Always a good crowd of people, unpretentious, and the bartenders are friendly. I like the layout, with the pool tables in the back, and tables in the adjoining room.\n\nYou come to the bus stop to throw back a few, laugh with friends, and forget about the previous and upcoming week.\n\nDefinitely  a college bar feel, but hey, sometimes you just want one of those nights...", "author": "Mike K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-17", "description": "Whether or not you go to The Bus Stop to watch the game, that's what you do because you can't not watch the game at the bus stop because everywhere you turn, BAM!, there's a TV and the game is on. It is an immersive televised sports experience. Some kind of bookmaking operation is all it needs; the mob presence in SF is something of a disappointment. \n\nBut there are drink specials every night of the week, and the bartenders are friendly, There are chodes but they didn't bother us none. And a bus really does stop right outside.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "best bar ever, doorman jordan was really cool and helped me", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-10", "description": "Swaggered into this fine establishment on a Saturday looking for booze to kill time bumming around the marina. It was the opening day of college football season, and without fail, this place was packed with folks cheering on their teams and yelling at screens.\n\nEvery day there is some sort of drink special, but since we drove up, I took it easy. Liver's been giving me the finger lately so I've been trying to cooperate. Also, my friend's hella picky on drinks, where as I, the lush, will drink just about anything and try anything thrice (this is the basis of my ongoing relationship with liver). Otherwise, I'd make a drinking game out of who gets the 5th bottle of Red Stripe in a $16 bucket of em.\n\nSo, bottle of Rolling Rock for myself and a Yaeger-Redbull for my comrade. Except there's no Redbull and just Monster. Managed to inch and squeeze past people into the back where a ton of Mizzou alums were crowding around covered pool tables while cheering their team on a variety of tv screens. Their enthusiasm was contagious and it was cool to experience a little midwestern friendliness.\n\nMy buddy's a sports nut, especially with football. And I know enough of the basics to be able to follow the game but it's cool just hanging out and getting the added commentary and explanation of why teams do what they do.\n\nBounced after Mizzou's game was decided by the statistical anomaly known as \"We could replace our team with kindergartners and STILL win.\" Chill place, if I lived around here I'd quickly become known as that token Asian kid who always orders specials.", "author": "Alan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-20", "description": "This is THE worst bar I have ever been to. The bartender made us wait 15 minutes until he came our way. He was busy chatting with his friends. When he finally came over he asked us for our IDs, I handed him my US passport, he went and looked at it under the light, and handed it back to me and said they could not accept US passports as valid IDs. \n\nFirst of all this pissed me off, since a passport is -everywhere in the world- a valid ID. I also don't have a fake passport. You have to be an idiot to think that my 3 year old, American passport is a fake.\n\nWhat came after really made me mad, I told him that a passport was as valid as it would get, that it was issued by the government and I could go anywhere in the world and they would accept it. He became pissy and told me to go get a driver's license (I don't drive -nor am I obliged to get a driver's license). \n\nThe environment wasn't that great as well, the place was falling apart and looked horrible. \n\nWe left after the whole shenanigan with the bartender. I wish I could give the place minus stars. Like I said it was THE most crappy bar I've ever been to. \n\nI will never ever ever go there again.", "author": "Denise Eda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "I once played pool with a man who told me that the cue lockers in Bus Stop were among some of the most expensive pieces of property in San Francisco.  And as I looked around at the men who were sinking shot after shot effortlessly and casually in between sips of beer and whilst exchanging charming (yet masculine) anecdotes, I could see why this was true.  It is an old bar, and a respectable one at that.  Paulie is one of the most amiable bartenders I have ever met and the people that come during his shift are close, if not equal, to him in charm.  \n\nI recommend coming here for happy hour.  Drinks are super cheap and you'll find mild competition for the jukebox.  And really, if you're feeling saucy, chat it up with one of the patrons.  Really friendly and remember, they've been drinkin' just like you.  Oh, and they have a series of menus for you to order delivery.  Great Christmas parties and sooo many TVs.  Sports memorabilia on the wall and even some videogames in case Pacman happens to be your sobering cure.  \n\nPeople often overlook Bus Stop because it's in the Marina.  Yeah, you might run into your typical Marina bore.  But you'll also find the awesome handful of people who exude old-fashion San Franciscan integrity, a gem if you've been living there for 4 years and are sick of the bike hipsters and their esoteric juice brands.", "author": "A. N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-20", "description": "I have little to base my review on as I have only been here two times...\n\nTime #1 was the during the Marina street fair. We all know you can't get a good feel for a place based on the day the amateur drinkers carnival is in town.\n\nThe next time was last night.\n\nI dont know if you all remember this little thing called Fajitagate. Well, it started here. Since then I have often thought that this is not the type of place that brings people together in perfect harmony. \n\nWe were a nice, happy, somewhat inebriated group of 6 when we arrived here. When we left we were an even more inebriated group of 4 (which is odd since I didnt even have time to order a drink at this establishment). One of us got kicked out for being too drunk about 1 second after we arrived, another one of us refused to show solidarity and wouldn't leave, and yet another one of us decided halfway to the next destination that they needed to hop out of the cab,.... thus proving, in my mind, that my theory about this place spawning bad chi was correct.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-25", "description": "As good a place as any to catch a drink. You can walk in on any given night and find people in jeans and a t-shirt sitting next to a table full of guys in buisness suits.  Some of the best drink specials in the area.  besides that, there is always a lively crowd here, and unless you get there before 7PM it is going to be tough to get a seat right away.  That said, the staff is quick and friendly.  and you have to love the sit down ms. pac man game...  big nostalgia points!\n\n\nedit....\n\ni love this bar...  i now live around the corner...  if you are in the mood to see about 20 different crowds in any given night... this is your place...  You will see marina kids (obvy), hipsters (only for a few, they don't like to be seen), and full on nerds (takes one to know one)...  it doesn't matter.... Ron is one of the best bartenders in the city...  anyone who knows will back me up.....", "author": "Robert R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-30", "description": "My friend told me to meet him at the bus stop and I stood in front of the nearest bus stop not knowing there was a bar named bus stop. \n\nWhy did i just tell everyone what a dork I am.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-13", "description": "I'm not a Frat All-Star, but I could be.\n\nI'm not really into bubbly blonds, but I could be.\n\nOur WAKA kickball team is centered out of this bar, and I had a hell of a time playing flippy cup there. I'm not giving this bar 5 stars, but I could.", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-29", "description": "Ugh. Everything I loathe about the Marina conveniently located in one place. Such a meat market you actually feel like someone is going to weigh you as you walk in the door. \n\nQuite frankly, if I was in the SFPD and saw someone standing outside the Bus Stop eating fajitas, I might want to beat them, too. \n\nCaveat: Have only dropped in on crowded evenings. Judging by the other reviews, it sounds like a perfectly nice place to watch the  game and have a few beers on a quiet afternoon.", "author": "Pumpkin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-08", "description": "Have been to SF a handul of times, and somehow I end up having atleast 1 drink here.  I swear all roads lead to this bar.  \nStumbled here after going to a rooftop party to see the Blue Angels do their thang..... And proceeded to have buckets of Miller Lite for $8! FREE! Really when was the last time you paid $2 for a not 12 oz but a 16 oz of Miller Lite!  Oh the buckets were flowing. Lots o fun, and even more fun that Stanford upset the spread and was victorious over USC!", "author": "Lisa V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "(singing)\n\nSometimes you wanna go, where you can get shitfaced on a Monday then carry some British girl who's puking in the gutter to her cab and then have her puke in the cab too then tell the cabby it's not your fault then go back to getting shitfaaaaaaaaaced...\n\nwhere you can meet a cute girl but it's not a pickup bar 'cause most pickup guys are creepy and would get kicked out of a cool bar like thiiiiiiiiiis...\n\nYou wanna go where people know, Marina girls are all the same, but who gives a shit cause I'm gonna ignore them wear a winger shirt and flip flops and play pac man and pool...\n\n(piano outro)\n\nI like Cheers, I like Sam Malone, I don't give a shit that all that didn't rhyme, and I like this bar.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-07", "description": "So here's the thing... I actually prefer the bus stop over most marina bars but it still has douchebags in it.\n\nIt also has a tiny bathroom, pool tables, TVs and random arcade games. Oh and douchebags as well as dirty old men - I'll be back.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "If you end up here, your probably drunk so in that case, it's AWESOME! If this is your first stop of the night, it's okay. Small, dark and generic drinks. I give it a solid 3 out of 5!", "author": "Bobby T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-22", "description": "When I took the bus to work, this literally was my bus stop.  How sweet is that?  Bus Stop may be kind of a dive but they have a ton of TV's, making it a great joint for watching sports.\n\nThey are also pretty cheap considering they are on Union St. and every other storefront there is empty.  Take advantage of their deals and you don't need to drop too much coin.\n\nAuf", "author": "Dave K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-27", "description": "3 stars for encouraging the ordering of pizza to be delivered to their bar.\n\nAlso props for 5 Red Stripes for $14. That's a good special.\n\nI can't say I'm a huge fan of this place, in fact I've alway thought it should be called Truck Stop. But I don't hate it.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-19", "description": "LOVE LOVE LOVE this bar! \n\nGreat drinks, great crowd, flip cup and popcorn...nuff said.", "author": "Cassie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "What can you say about a sports bar?  Well its crowded. Loud. Smelly. Wet and Drunk. So yeah. Perfect. I was able to watch 6 games at the same time because of where i was standing. I like that.  I like this place.", "author": "douglas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "Great local dive bar to meet up to start the night or finish up a great one!\n\nThe original... this mainstay has some major history and continues to be a favorite among the locals.\n\nThey've got great specials every day (+1) and the bartenders are some of the friendliest in the city (+1).\n\nPool tables in the back, pacman and the jukebox up front.  \n\nTip: No food, but you can order from local spots or bring your own!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-16", "description": "My friend's kickball league was having a get together at this bar last night so we decided to check it out.  I never ventured out to the Marina really so I was pretty stoked.\n\nWe got there after dinner, just in time to catch the last couple innings of the Phillies/Dodgers game. Nicely-sized TV's mounted on the walls. Yes! I loved watching the Dodgers lose.  Anyway, our server was super nice.  I ordered a cider, which was disappointing.  It honestly tasted like old lipstick or something. I don't know.\n\nHowever, I still ended up having a good time.  Might check it out again one these days.", "author": "Jillian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-23", "description": "Love the bartenders (they actually remember your name and treat you like a regular, which is lovely). \n\nPopcorn and Pretzels, flip cup, pool, sports, good crowd only problem... the womens loo is a nightmare, one tiny stall... but it does not stop me coming back again and again to have fun at this place.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-11", "description": "Me and the coworkers always head to this place after eating lunch at extreme. The dude behind the bar always remembers our drinks, and pretty much opens the bottles when we step in the door. There's always a few sharks hanging around in the back during the day, mixing it up and talking shit. We play a few rounds, and take off back to work.\n\nAt night, we usually hit this place up first to start it off. Jukebox is connected to the net, so you can get whatever. And it's a pretty big joint so there's room to move. Good crowd most the time and dope prices. It's impossible to have a bad time at this bar.", "author": "Tom G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "I am not a sports fan so I am not going to like this bar as much as sports fans would.  That being said, it's a cool bar with plenty of drink options.  When you're bar hoping in the neighborhood the Bus Stop is a must.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-11", "description": "One Saturday morning about 2 years ago, a group of excited Virginia Tech Hokie Fans wandered Union St. at 9 am in hopes of finding a place to watch the football game.  Our bar we used to watch it at shafted us on the TV situation.\n\nSo walking down the street, about 30 hokies peeked in doors and lo and behold....the Bus Stop came to us like an angel from the sky!  They welomed us with open arms....gave us a large space with a few Tvs and sound!  Their Bloods Mary's are the best in the city.  The owner and the bartenders are more than incredible and kind.  For 2 years they have gone above and beyond to make sure the at Hokies have a great place to gather every game day!\n\nIt does get crowded during football season, however, I like all the\n energy there!\n\nTheir drink specials rock as well.....did I mention the bloody marys??  :)\n\nLove the bus stop!", "author": "Claudia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-05", "description": "It pains me to give a positive star rating to a bar on Union St. HOWEVER! \n\nListen to my story from days of yore. Once upon a time, I lived right on the beach on a little spit of land between a bay and the Pacific, called Mission Beach. Mission Beach is a special part of San Diego, where Zonies (tourists from Arizona) and college students roam freely about on the wide beaches, drunken 20somethings stumbling over small children and trying not to run them over with their beach cruisers.\n\nI was in college, and life was chaotic. You could say the one constant in my life was my Thursday night activity, $1 beer night at the Beach Comber. The Comber, as it was known to regulars, is a Mission Beach institution. I have traveled far and wide, and when I mention San Diego, in certain company it is very likely someone will speak fondly of their times at the Comber.\n\nI never once paid full price for my tab. I would over tip, they would change what I wrote. I didn't have a forwarding address when I moved out of my beach house after graduation- my best friend jokingly suggested forwarding my mail to the Comber. I considered it for a second- and they would have let me do it in a flash. I spent the San Diego Cedar fire there, my 23rd birthday. I visit whenever I'm in town, and they always remember me- and my cocktail.\n\nWhy this long winded story? The Bus Stop is the sister bar of the Comber. I have to represent, just for that.\n\nThey have daily drink specials, and they serve up some mean Bloody Marys.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-09", "description": "Great place to watch college football on a Saturday.  There will be lots of fans for lots of schools, which makes it fun.  However, it does get packed so get there early or be prepared to stand.", "author": "Bill K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-02", "description": "We stopped here on Halloween night, and considering all the other bars we went to, it was relatively uncrowded. The drinks were cheap (3 gin and tonics and 5 kamikazes totaled something like 35 bucks). So those two facts alone lend me to believe that this place is pretty good right from the get go. I will concur with some of the other reviewers that it is a bit of a meat market. This group of guys \"Night at the Roxburied\" every girl that walked through the door, which was kind of gross, but my group of friends kept to ourselves at the bar, so it was pretty chill. \n\nOverall, with cheap drinks and even an ounce of breathing room, you can't complain that much, so it gets four stars. Hopefully I can go back to see what it's like on a non-Halloween night.", "author": "Alex V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "As the sign says \"Bus Stop\" Just swing on by for a quick drink and move on... NEXT...", "author": "Minh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-13", "description": "Came by here for a Friday happy hour and it was just what I was looking for...  grabbed a table with 5 other friends, waitress brought our drinks, talked some shit, watched some sports, checked out some scenery, and then...  And then, what really topped it off was that 2 people from Amicis came by with slices of cheese pizza and just started giving small slices of it to everyone.\nIt was Awesome!", "author": "shaun l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-13", "description": "OK,\n\nThey've got pool tables and a sit down Ms. Pacman table.  That's cool.\n\nIt's kinda close to being a true dive bar, except it's on Union St., so the majority of patrons will have a full set of teeth.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-15", "description": "Once when I was at Bus Stop, I decided I didn't want to talk to some lame-os I'd been socializing with. I excused myself to go to the bathroom, and then pleaded with the waitress to please go get my purse and jacket from the table so I wouldn't have to go back and talk to these guys. Awesomely enough, she did it. I then proceded to fall down by the video games.\nI was even more mortified by my behavior when I returned a couple of weeks later and the waitress not only remembered me, but also knew my name. 5 star service, but I would have preferred to just forget the whole night.\n\nBus Stop: 5 Stars\nMe: 0 stars", "author": "Kate P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-17", "description": "this place is so wrong it's right\n\nI recently met up with a girlfriend that was here with her husband and his guy friends.  I won $30 playing dice, saw a girl with a green scrunchie and witnessed several other crimes of fashion.  Not a bad night after 3 vodka tonics.  Save this spot for a few beers and the game, but come on a Saturday in sweats and a ball cap.", "author": "rachel c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-02", "description": "This is the only bar north of Broadway and west of Franklin where I have even the remotest chance of getting laid. \n\nThey also have cans of Pabst and Tecate for sale like every night -- which is partly why that chance remains remote.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-28", "description": "Very solid bar. I have only been there during daytime hours, during last year's Opening Day of baseball when I was in town for the A's - Red Sox Opening game. VERY friendly crowd that was on the older side (at least during the day - I heard it gets pretty \"Fratty\" at night. The bartender was excellent, he was a bit gruff, but in the way a good bartender is supposed too be. Like, he'd get me a drink without being asked (I'd only been in there twice and the second day he remembered my name, where I was from, and that I drank PBR), but he always acted like he was a bit annoyed to be doing it. I'm looking for service, not a friend, and he met that expectation. \nExtra points for making sure each TV was tuned to a different ballgame. \nWhat a neighborhood watering hole should be. I was an outsider, but it really did seem that everyone knew each other and it was a real neighborhood meeting place.", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-18", "description": "This place was really cool. i rarely go out in this are of the city because of live near USF and it is just such a hassle getting across town, but last night I had some friends in from Los Angeles and they wanted to go out near their hotel so...\n\nLong story short, i had a blast. met some great people, played pool, enjoyed good Irish drinking music (although after 12 it got switched to rap, which was unfortunate) \n\nI definitely recommend this place if you want to hang out and shoot pool and watch crazy videos on the TV's with friends.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "Bus stop is my number one.  I spent my 21st birthday there and the kind bartender forced a shot of vodka up my nose with a straw.  As bad as things have gotten inside, they never refuse an open tab and a warm smile.  I have only been kicked out twice and they were both my fault.  This, coupled with the very nice crowd of people working there make it more fun every time I go back.  \n\nMy only complaint is when 49er fans don't get rowdy enough.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-03", "description": "Stopped in here for a quick beer, definitely a cool little place. I especially admired how they had Arrogant Bastard on tap... you don't see too many places with obscure micro-brews on tap these days. Stone ftw.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-03", "description": "strong drinks and great football games.\r\n\r\n(new review inserted here)\r\nI do love this place for mid-afternoon sports.  Baseball, College Football (UCLA all the way), ro just meeting with friends before you go out for the evening.\r\n\r\nThe drink specials are really good deals and not only for cheap beer or well drinks.  Happy Hour is half off everything.\r\n\r\nI guess if you get over the SC frat-guys and the former frat guy business men, you cna have a great time here.\r\n(end of new rewiew)\r\n\r\nNot the best place to meet people (except of course all those kids you went to high school with)\r\n\r\nSeems to be the escape route on Tuesday Taco Night when Blue Light turns into a round robin red rover tournament.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-10", "description": "Excellent Bloody Mary's! Great neighborhood bar. Was there for entire football game. Waitress never asked if needed drinks (and she wasn't that busy), had to keep going to the bar, but the bartenders were great, very friendly and helpful.", "author": "Aimee G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-06", "description": "I've only one had one experience here,  the crowd was very cliquish.  Didn't matter though I was with a group of drunken raging dudes so no worries.\n\nIt was a Saturday night, place was packed full of people.  Impossible to take more than a few steps in any direction.  I hate that.  The place is noisy as hell, couldn't have a conversation to someone you were standing right next to.  I hate that too.\n\nAnother thing that was funny, yet foul was the bathroom situation.  They have a trough style urinal, so the bathroom ends up smelling like intense urine.  \n\nThe one toilet they had someone had threw in a whole roll of TP making it impossible to flush and proceeded to diarrhea on top of it. It was so funny yet absolutely disgusting, I almost vomited from the smell.  \n\nThe cheap drinks are good, the rest of the scene is not my style, but I'm glad I have my poo story.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-23", "description": "The Bus Stop is my \"nowhere else,\" bar. \n\n\"Nowhere else to go? Alright, let's go to the Bus Stop.\"\n\nIt's conveniently located right around the corner from my house so when I need a quick fix and am in the mood for a decent crowd, I'll take a stroll up the hill and park it on one of their stools. I've also been known to watch a big game or two on the tubes. \n\nTheir cocktails are pretty standard but they do offer some great daily specials which I always try to take advantage of. This place serves up your typical Marina crowd, so if you're not in to that, I would stay clear.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-09", "description": "Ms. PacMan table?  Check.\r\nGolden Tee?  Check.\r\nA bunch o' televisions on a bunch o' channels?  Check.\r\nFifteen beers on tap?  CHECK.\r\nSurly service with a nod and a wink?  Oh, yeah, check.\r\n\r\nYep, there exists a bar in the Marina that's not full of pansy boys and fake women.  That'd be the Bus Stop.  I'd stopped in here a ways back in between jewelry stores (I was shopping for an engagement ring), and I was miraculously saved from wobbly knees with a pretty good jukebox and a well-layered Black Velvet (pear cider with Guinness layered on top).  Sat at Ms PacMan and got munched fairly quickly by Inky (or was it Blinky?).  Doesn't matter.\r\n\r\nJust hung out there tonight a bit with a buddy of mine, between his shopping at jewelry stores for an engagement ring of his own (superstition be damned!).  Went to the back room to play a few rounds of pool, and DAMN!  I would have to say that out of all of the bar tables I've played on in recent memory, these would have to be the best in a while.  Red felt, plenty of chalk, fairly straight cues, and a smoking patio right to the left of the playing field.\r\n\r\nI usually avoid the Marina like a cold sore, but if ever I'm in the area, this is probably where you can find me.  Good drinks, good barkeeps, a constant barrage of telly, and some good games going on ... what gives?  All in all, a pretty damn cool bar.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-12", "description": "I don't so much remember too much about this place which i'm not sure if that reflects well on the bus stop or the bars I went to before hand.  i'll give it 4 stars cause my friend's roommate bartends there.\n\ni went again the other night.  sketchy things happen here, minus a star", "author": "Lindsay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-04", "description": "I'm yet another that learned of this place because of Georgia Bulldogs connection! This was only the second time I had been to the Marina (not my scene), but I'll definitely be coming back for the rest of the season...and however long the Bus Stop can continue being SF's home for [nothin' finder in the land than] drunk, obnoxious Georgia fans!\n\nOf course, I love that there's a place in to watch UGA games, but the Bus Stop earned its stars for having great beer prices and doing its best to keep 'em comin', despite the place being almost unbearably overcrowded.", "author": "Derek R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "So, this is a place where everything is happening and everyone feels welcome. \n\nI went for the first time a few weeks ago for happy hour and I had a lot of fun. I was in a really bad mood after I had the longest taxi ride of my life, due to heavy traffic.\n\nThe drinks are inexpensive and strong. The server, Emily, who I discovered to be the best server at Jillian's was the cocktail waitress and that made me really happy. She is funny, quick, and adds a special energy to the room.\n\nThey have a lot of televisions. When I went, I was able to watch the vice-Presidential debate and the baseball playoffs, which you can't do very easily in San Francisco. \n\nI had my drinks, then I started craving chicken wings. Emily brought over a menu from a marina restaurant, my friend and I ate the wings, and then the Pizza arrived!\n\nThis is the best part. When happy hour ends, they order Amici's pizza for everyone at the bar. I really enjoyed it, but I am glad I had wings, as I only had a piece of pizza, I didn't want to take advantage of the bar my first time going.\n\nI highly suggest this place to any age group, 20's, 30's, 40's..... It's just a mix of everyone just having fun.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-14", "description": "So, I had to wait outside for a while, which is fine, my friend got in before they shut the doors and saved us some stools at the bar. We stood outside, had a nice cigarette with some new \"waiting in line together\" friends. \n\nFinally got inside and it was packed to the gils with jock types who hadn't realized they graduated college 10 years ago, and that their third string football team membership wasn't impressing anyone other than each other. The women were very, very.... VERY drunk. Most looked on the verge of puking, and it was only 11.  At one point, one of these college bros leaned on me like a chair while I sat at the bar with my friends. \n\nAll that said, the bartender was a cool guy, bouncer was nice, let me outside to smoke and back in without waiting in line. TVs were great for watching sports if that's your sort of thing. Looked like they might have had food during the day? Not sure. I think it'd be a decent place to have a beer and watch a game, just not for a Saturday night when there's football on TV.", "author": "Mckay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-08", "description": "Lisa V is right; all roads TRULY lead to this bar!!!  Awesome daily drink deals (I simply can't say no to $3 Absoluts on Thursdays!)\nOther great perks:  random free pizza, internet jukebox (but pricey!),pool tables, and literally \"the bus stop\" for the 45. (If you see one go by, you know you have time for ONE MORE DRINK!)\nNot so great:  lost cell phone incidents, hangovers, and one of SF's tiniest bathrooms!  Beware of squealing drunk Marina sorority girl types(unless that's your thing) on friday & saturday nights; otherwise a very cool bar!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "New to the city or just looking for new friends then check out Bus Stop. Its a place where a mix crowd is drinking spirits while in good spirits! You are going to bump elbows but that is the best way to start small talk. Then before you know it you have joined a birthday party, got new hiking partner or met a common college alumni (Go VOLS).", "author": "Justin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-05", "description": "Too crazy for me on the weekends but on a Sunday night it can be alright. Used to go here with the ex-gf, swilled a lot of beer, and had small talk with all the other Sunday lushes. I'm guessing it makes a great locals bar during the week but is to mostly be avoided during the weekend crush.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-25", "description": "People say a lot of things about this place, but I love it.  I've always had a good time.  You really have to be open minded and just want to have a good time.  They ALWAYS have great drink specials.  The juke box is great as well as the pool tables.  There's definitely an interesting mix of people at this place.  If you're looking for a LOUNGe, This is NOT it.  But its fun if you're just looking for a place to drink and have fun with a group of friends or even watch sporting events.", "author": "Ronjini M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-01", "description": "Always a lively crowd, Great drink specials, but something tells me I'd like this place more if I were really into college football and liked crushings things with my forehead. Thursdays seem to be the most popular night (I work in the neighborhood and have to wander through the drunken piles of blonde extensions and popped collars on my way to the actual bus stop).\n\nIf you grew up in the Suburbs, or think the Suburbs are a nice place to visit once in a while, then Bus Stop is worth checking out.", "author": "Sachi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "You know you've had a good time when you can't remember what the hell happened or are drunk yelping.  \n\nThis is actually the second part of my WAKA review.  Our kickball league drinks here on Thursday and I can say I could not have had more fun here.  After about 30 rounds of beer cup flipping, I am convinced that the kickball league could be avoided and we could just head to this place with our kickball color shirts and play drinking games.  We just hung out in the back with other WAKA players and left the Gap wearing stripe shirt wearing douchebags and the Prada bag carrying blonde bimbos...(actually blonde bimbos aren't that bad) stayed in the front.\n\nThe place is small as $hit and the service was kinda slow now that I think of it, but hell, it was a Thursday night and we had a good time.", "author": "patrick o."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-05", "description": "They stopped serving Coors in the can.  BUMMER!", "author": "William K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "If you are a Virginia Tech fan living 3,000 miles from campus... this is your only option for games not on ESPN360 in the bay area. For that, you get hella stars. Go Hokies!", "author": "Durand B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "Ahh, the infamous site of Fajita-gate (just kidding)...\n\nDecent casual hang-out bar.  Big bartender dude was really nice and friendly.  Pool tables in the back, and a jukebox that spits out 90s alternative works for me.  The only minor problem I had with the 3 draft beers I ordered was that none of them were all that cold.  My only suggestion would be to lower the temps on those keggers.  But all in all, I'd come back for sure.", "author": "Ash C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "Simply put ,the Bus Stop is the best neighborhood bar  in the city... Its been a saloon for over 100 years. Jason and Ron are great bartenders who are always happy to help their customers. You will also find some of the best pool players in the city there. \n\nBecome a Fan of The Bus Stop on Facebook!", "author": "Layne P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-24", "description": "I'm agreeing with Mandy F. My Southern accent is pretty under control in SF, but there's something about that precious bartender pouring me a toddy at nine in the morning ... I give myself away everytime when I find myself saying \"thank yewww!\" That's about when he knows to pick up the remote to find the Ole Miss game for me. Bless his sweet heart. \n\nWouldn't go at night, though. Best for sports during the day.", "author": "Jill C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "I am new to the neighborhood and only live two blocks away from The Bus Stop, in fact my actual bus stop is right in front! I finally went to the Bus Stop with some buddies last night after some intermural game and I am so glad I did. It clearly is a fun, reliable, neighborhood bar, and the bartenders were significantly better than most of the other bars I have been to in the area. Not only did they make a good stiff drink, but they didn't put off that weird, pretentious, marina thing that's going around down here. \n\nI like it and I look forward to becoming a regular here!", "author": "LeeAnne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-25", "description": "Drinking here reminds me of being in college, so it's fitting that it is indeed the unofficial alumni bar for Hoyas. Also fitting are the buckets of Miller Lite (4 for $8) and groups of drunk guys (in khakis, flip flops, and baseball caps) to really drive home the fact that even though you're nearing your 30s, inside these walls you're forever 21.  \n\nSeveral TVs strewn around the place make it impossible not to be watching some kind of sport (or lifetime movie with subtitles in the off-season) and pool tables in the back sometimes get converted into flip-cup tables during the kick-ball season. While the clientele often resembles the over-spillage from nearby Bar 'intelligent? witty? here you'll find' None--I do always have fun at the Bus Stop, taking on several buckets at a time.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "Best bar in the Marina, hands down.  Jason, Devon, and everyone there are friendly and there is an excellent tap beer selection.  Lively atmosphere and is an awesome place to watch Giants games.  Pool tables in the back and tables/booths to sit at in addition to the bar.  Can't say enough about this 100+ year old bar, if you every come by (which you should) you'll probably find me on the short end of the bar clutching a Lagunitas IPA and/or Racer 5 IPA watching the game after my shift", "author": "Zack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "Great bar, even better bartenders and the prices are fair. I wish I could get a print out of all the money I have spent here, I'm in the market for a good cry.", "author": "Sean T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-11", "description": "Absolutely loved this place.  Was waiting for a bus, and turned around it noticed it was happy hour.  Crafty advertising!  I really enjoyed the vibe of the place, just a simple watering hole with good selection and deals.  Servers were friendly and attentive.  Definitely just a great all around hangout spot!", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-07", "description": "Solid bar - especially on weekday nights.  Great place to meet up with buddies to watch a game and perhaps play some dice - also a phenomenal bar to saddle up to at about 4pm on a Monday and get stinky drunk (been done).  Careful of coming here on Fri & Sat nights and it can get too packed.\nOverall (in my book), it's light years ahead of Bar None, a tad knotch above Mauna Loa but not quite at the level of Shanghai's or the M-Lounge.", "author": "Murray H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-12", "description": "Totally underrated place.  It's definitely a sticky floor kind of bar, but a great place to watch football games.  There isn't a bad seat (or place to stand) in the house because there are great flat-screen TVs everywhere...  And, unlike other Marina sports bars, it isn't too crowded so it's pretty easy to get a seat.  The place is small, but the waitresses are good about coming back to check in on the beer situation.  I also appreciate the fact that they let you bring in outside food (slices from Extreme Pizza!).  Good, relaxed crowd (another patron gave us her two leftover cans of beer!).  I'd heard the place was a big Georgia bar, but it was pretty filled with Michigan and Cal fans last weekend...", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "Loads of tvs, and decent drink specials. This is probably the best sports bar on Union Street, though Blue Light is good too. This place is extremely crowded during games, so if you want that atmosphere and live near Union Street this is your go to place. Was absolutely a riot here during the world series games last fall.", "author": "David K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-01", "description": "Do Not go here unless you are in college. If you are there, enjoying yourself and not in college, start asking yourself why you feel so darn comfortable among girls celebrating their golden 21st and the 35 year old men spitting game and sipping Amstel Light. Boo.", "author": "Dinelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-04", "description": "Where was I?  Ah yes, the Marina.  But why was I here?\n\nWell, in lieu of a Christmas party, it seemed easier to try a Christmas-themed pub crawl this year.  The trick was finding a neighborhood with plenty of holiday spirit.  Sure, Union Square has a big tree, but I was intrigued by the \"Union Street Festival of Lights\", which promised lots of lights and even a parade!\n\nThe parade was supposed to go until 9, but when we got there at 8:30, it was nowhere to be seen.  And the lights weren't anything that Noe or Haight didn't have.  I guess the moral is the advertise-y neighborhood gets the revelers.\n\nAnyway, on to the drinking.  Bus Stop was first, and I figured it would be a gentle ease-in to the Marina scene, being early and all.  But this is a sports bar, and it was the night of the Big Game.  So the place was one big college football party, and it's fair to say I haven't been around this many young, corn-fed, non-ironic Americans in a long long time.  Clearly the Marina rumors are true.  Good drink menu with good prices, but non-Marinans have plenty other sports bars to choose from.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "My favorite place to watch sports in the marina.....bartenders are  very friendly and  the waitress from vegas is super sweet!!  if your ever looking for action this is your spot.......actually, anywhere in the marina!! The triangle is always nice!", "author": "daniel c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "Big Ron is the MAN!!!!  This is the quintessential neighborhood bar - where everyone knows your name.  And I'm not gonna lie, they had me at \"free popcorn\".  Also, being the Giants fan that I am, anywhere that does 50 cent PBR's after a win is ALL good in my book.", "author": "Daniella S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-26", "description": "Oh bus stop....\nThis place literally lives up to its name....\nYou somehow always end up here somewhere along your bar crawl. Its not usually first, its not usually last, but for some reason when your trying to recall your night in your tequilla haze you remember that one cocktail you had at bus stop....hopefully =)\n\nEither way, love the pool tables in the back(when their open!!! which actually isn't too difficult if you get there on the early side). And for some reason I find that little window in that area oh so amusing... \nIts like bartendar in a box. Awesome.", "author": "Stacy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-19", "description": "It's impossible to say enough wonderful things about this home away from home!  \n\nMy sanctuary during the month of October/MLB playoffs, and my morning ritual for the early morning Sunday football games.  A place where a young innocent girl like me can just walk in, sit down at the bar by herself, enjoy some $2.50 Highlifes, watch the games, chat with the older locals/regulars and get the royal treatment from the bartenders.  \n\nIt's a special bar that offers more then just a comfy and safe feeling for me to go to when I'm in the mood for sports, but also where I met my sweet bf.  It IS possible to meet your life-mate at a bar!!  I am living proof and even though I was meeting another guy there the night we met and left the bar to go to another bar with him, I came walking back to my now bf of 8 months, after the other dude confirmed of being the ultimate douche bag with an ego bigger then his head.  \n\nIt was a magical night that I will never forget (and the most horrible hangover the next morning), but I made the best decision ever by returning home to the Bus Stop that night.  I/We go back every now and then and the smiles on the bartenders faces when we walk in is priceless and makes us feel special for meeting at such a wonderful place with a big heart.\n\nThank you BS for changing my life in SF for the better.", "author": "Ayrn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-02", "description": "Bus Stop supports the Hokies + I love the Hokies= I love Bus Stop\n\nGreat place for college football. They put up with all our drunken VT cheers and keep the buckets coming. Can't complain about that.", "author": "Chrissy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-15", "description": "This is a Roxanne, Red Light kinda place.  Whiskey, light beer, pool, some, games on the tube, coed kickball teams getting trashed on a Sunday after their game....what's not to like.  Don't go here if you're more dressed up than jeans and a t-shirt.  This place is casual.  \n\nFun though.", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-26", "description": "It's really difficult to review bars.  So, the location of the bus stop is primo Union street, yuppy kinda area.  Like any other bar they have all the requisite beers, but they have a LOT of them on tap and they have the taps lined up as a gimick.  It works.  \n\n like the place, I just can't get excited about four walls, neon lights, and 6 dollar beers.", "author": "Amir B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-18", "description": "updated 5 years later:\nYep - this place still got it!  \n\n=========\n\nGreat drink specials just about any day of the week...\n\nTons of TVs and some great old timers to hang out with.\n\nRick pours a stiff drink...and watch out, magic is known to happen on Saturdays...$3.50 jager shots...MK is with me on this one!", "author": "Ken S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-14", "description": "I can't complain about this place.  it's a neighborhood bar with tv screen here and there and kick butt HAPPY HOUR!  Two shots of Grey, 2 bottled beers, and 2 cape cods for $15, you can't complain!!\n\nLove the pool tables is the back and the fact that there are sreens at each corner so u can watch the game while playing a game.  One thing I don't like, the fact that guys, young and old, get crazy generous and talkative when two asian girls are drinking and playing pool.  All of a sudden, there is a line to play winners on our table, while the poor guy on the other table were looking for players!  Would go back for sure, but I have to remember is bring a guy friend next time so other people won't constantly interupt our night out", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "I have lots of reason why I love the Bus Stop but meeting my fiance there isn't what you came to read about. So instead, let's talk about there Friday HH with Harp on sale at 2.00 a pint. Always a fun place that gets packed but also chills out even on the busiest nights. One of my favorite things about this place is the history. This is a true SF establishment here with close to 100 years of service.\n\nI no longer live in the city but when I am in the Marina - this is one places you might see me at.", "author": "Jack H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-20", "description": "I like to hate on all things Marina but I really can't hate on this place. Every time I go to the Bus Stop I have a great time. Beer buckets and all the free popcorn and pretzels you can eat, not bad. I'd like to thank the staff for not yelling at us for throwing popcorn all over the pool table area -- Tosh.O imitations...sorry!", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-14", "description": "The absolute best place to watch a game!  The Bus Stop is part of my favorite Saturday:\n\nPlay a game of AM hoops\nGrab a cup of coffee and read the Chronicle Sports Page \nHead to the Bus Stop\nWatch Big Ten Hoops at the Bus Stop\nHave a Bloody Mary\nHave a few beers\nStroll the Marina \nGrab lunch - preferably sit outside and enjoy the sun\n\nA great start to any day!", "author": "Todd S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-08", "description": "Went there once with my boyfriend and his friend. I thought the place was chill and had some great drink specials, $1.50 domestics and $2.50 imports from 4-6pm. Typical sports bar with pool tables and TVs to watch the game.\n\nUpdate(4-20-2007): Cheapest bar in the Marina to get so drunk you don't remember how you got home! They had Kamikaze shots and apple martinis for like $3.50 a pop. The bartenders are soooo friendly and the jukebox selection isn't too bad. This place is my favorite bar in the Marina!", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-15", "description": "Lots of Boston fans, lots of seating, pretty cheap beer. As a Boston expatriate, I have to say it's the best place in the city to watch the Red Sox or Pats. \n\nGood, loud crowd and beer specials include Red Stripe & Miller (neither are my preferred choices, but when they throw them 5 in a bucket and charge $15, I'll take it.)", "author": "Tim I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-18", "description": "A sportsbar.  The only thing that makes this place special is that Georgetown alums always gather to watch basketball games here.  \n\nTip: Don't order food from around the area to the bar -- the minimum orders are WAY high.  Just walk down the street and get some pizza or crepes.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-16", "description": "Although I'm not a fan of the normal clientele that calls this place home I had to give it at least 3 stars for the Bar tender. While talking to a somewhat intoxicated young women she, unbeknownst to me, knocked over my freshly poured pint.  Shortly after she was ushered away by her gaggle of friends and I turned around to find my pint spanning the length of the bar... drats.... \n\nWell I was somewhat intoxicated as well and was throughly confused by this sudden loss of all that mattered to me at the time. Next thing I know the Bar tender brings me a new pint and tells me, \"hey she knocked it over, here's a new one on the house\" As you guess he got a huge tip.\n\nHe even allowed me to wake up my friend a few times who was passing out at the bar instead of just kicking us out like most would have done.\n\nSo 3 stars for the bartender, 0 stars for the patrons.", "author": "Donovan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-28", "description": "For those of you who don't live in the Marina, yes, weekend nights are going to suck, and they are going to be filled with more striped shirts than you can count. \n\nFor those of you who do live locally, and are not the bridge-and-tunnel crowd, it's a great place to go when it's not ridiculously overpacked on Fridays and Saturdays. Great drink specials every night, pool tables in the back, enough TVs showing everything from football, to soccer, to even surfing and snowboarding. Bartenders are really nice, and you can't beat the prices. If this place is within walking distance for you, it's always a nice place to come when nothing else is going on.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-28", "description": "This place is a very nice neighborhood sports bar. There are to many televisions to count that show to many games for even the most fanatical fan to keep up with. Drinks are well made and reasonably priced. They have a good local following as well as many out of towners that frequent when they are in town. Just ask for Rockin' Ron and he will show you a good time.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-10", "description": "So I went to the bus stop after work on Friday night with a bunch of Marina Girls from the marketing/p.r./sales department at work... Yeah, so what,  sometimes I smoke with them outside. Anyway, so they took me to this bar full of douchebags. Here's the thing about douchebags... they're not so bad. They buy you drinks. Plus, this place has Bon Jovi on the jukebox. I thought that was pretty freakin' awesome. Something else that's cool about the Bus stop, there's actually a bus stop right in front of it. There's no irony there. It's no Mission Hipster bar full of sarcasm.", "author": "Ahnui Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-16", "description": "A neighborhood favorite! Great beer on tap and I love the monthly cocktail specials. Gets very packed & no matter how you try the door guy will not let you in. No matter what you say!  A fun place if you are able to get there early.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "Be prepared to be close to people. This bar is very small but also very cool. I've lived near this place for 20 years and just now went to it last night. Drinks were ok prices... 8.50 for a long island. While ive had much better mix drinks in Chicago, this place wasn't so bad. The waitress was terribly nice and gave my friend water after it was obvious she had too much to drink. There is a cool looking cupcake store that apparently open end in may right next to it. Nothing like a good cupcake after a night of drinking!!!! By the way union is filled with frat boys-and guys who were obviously not in frats but try to act like they were. A major turn off, but it's close to my house.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "I went here last week for an Alumni Event to watch a Hockey Game.  The happy hour is solid with reasonable prices on drinks.  It's also not too crowded (this was on a Friday between 5-8).  Pretty friendly service from the staff.  Our waitress was pretty attentive, not to mention pretty cute (not factoring her cuteness to the review).  They also came around with free Popcorn and Pizza at one point in the night.  A good place to go to hang out with friends and watch a game for sure.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-23", "description": "Oooookay, so I owe the B-Stop a good review cause I was a cotton-headed ninnymuggins on Wednesday night. Quiet you, Wednesday's the new Saturday- at least when you're a kickballer. So, sit down Indian-style in a circle kids, Auntie Annie has a story!\n\nIt all started on the kickball field, where I tend to regress to a college freshman mentality and have too many adult juice boxes. Cut to the afterparty at Kezar, where team Kick-In-A-Box dominates in flip cup. But this fateful evening, some English gents refused to relinquish the flipcup table, 'cause they were watching their precious soccer match. Puffs. So we mosey over to Bar None, in hopes of acquiring an arena for our flip cup shenanigans. Alas, the other league had commandeered all tables. The situation appeared hopeless- until I had the bright idea to abuse my Bus Stop connection (I used to work there slangin' cocktails). I herd my team over, and Ron gives us the green light to turn a few tables into our own little flippy cup venue. All started out fairly tame- until I got a little too competitive and, um, started wrestling all the dudes on my team. We're talking no holds barred, choking out, kicking and punching WRASSLIN'. So... sorry teammates for your newly acquired bruises, and a big \"my bad!\" to the 'Stop. I'd like to say it'll never happen again, but I don't want to sit on a throne of lies.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-04", "description": "Drink specials every night?  $2.50 pints of Harp?  $5 Belvedere Martinis?  No bullshit? Count me in!!!", "author": "Erin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-28", "description": "This place spelled L-O-V-E for me and my boyfriend! Maybe it was the great bartender Rick, maybe it was the darkhazzy bar on that Saturday morning, or maybe it was the $3.50 jager shot special, but magic happened at the Bus Stop. It is my local oasis in the Marina where you don't have the pretentiousness of East Side West or Balboa, and you dont' have the immaturity of Bar None or City Tavern, you are somewhere in between and is it awesome!", "author": "michelle k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "Bus Stop is awesome, especially on a weeknight.  The bartenders and servers are great and will put on any game you request {even when it's a Sacramento Kings game...trust me}, they pass around Amici's pizza for free, and have cheapo drink specials. AND if you are there for a pub quiz night and do well, you get fun little drink tokens you can take with you to use next time!", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-15", "description": "I like the bus stop.  It's my favorite place in the marina to watch sports because it's not just college students and it's not usually as busy as bayside.  The one downfall is that they don't have food but you can order in if you want.  Every time I've asked them to put a game on they have been really helpful and put it on one of the big screens.  One time we were there the bartender ordered a pizza and gave some to everyone sitting at the bar.  The bathroom is TINY because I'm really tall and I can barely sit on the seat because my legs are long.  Also, if you've stand on the sink you can look down into the guys bathroom which is sort of funny.....not that I've done that or anything.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-05", "description": "Full of frat boys and girls - or their wannabes.  We actually couldn't stand it and so we left our unfinished beers.", "author": "A L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "I've been here so many times, but it's always to meet up with friends.  Forget the friends (sorry) I'm going back for the maitais!  They're huge, cheap and made me feel like I wasn't in SF, but instead enjoying a wonderful, sticky hot beach.  Plus, they go sooo well with the free popcorn stashed in the back.  Pure class.", "author": "Crystal K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-17", "description": "The Bus Stop is a quirky little bar.  It's got a mellow vibe, that bubbles just under rowdy, but may at any time bubble over.  Two pool tables make it extra cool.  Going to the women's bathroom feels like being on an airplane - your knees are touching the wall, literally!  It's the kind of place where 20 Santas just may, and in fact, did, walk in.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-08", "description": "The least annoying bar on Union Street in my opinion. I won't really say much more than that because I've only been a handful of times on various pub crawls, but overall it seemed decent and like a good spot to grab some beers with friends.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-16", "description": "Dont like it here, its all the people that make the marina suck on fridays and saturdays and none of the ones that make it rock the rest of the time!", "author": "Tom V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-11", "description": "Good happy hour.  Great location.  Lots of history on the walls.", "author": "Ben U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-19", "description": "I watched the USC/Cal game here after stumbling down the street from the OSU/Michigan game at another bar. It looked good and had a good crowd so why not?  And we had a blast despite the fact that I really, really wanted USC to lose (not so much for Cal to win, just USC to lose). Yea, it felt like a B&T type of crowd, but so what do you expect, you're on union street on a weekend. And as bad as you could claim the crowd is/was, who gives a crap if they're not bothering you let the frat boy douchie wannabes be frat boy douchie wannabes. Sometimes eclectic is bad, which is why this place gets four stars for not being that.", "author": "Joe K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "So I actually love this place. I love 5 bud lights in a bucket of ice for $11. I love that a whole bar had a bet on how old some crazy cracked out chick was. I love that everyone bet over 35 and it turned out she was 31.... she looked 45. I love we easily found a seat without thinking twice and that I was able to sit and watch the NBA All Star game with my friends and sister.", "author": "Nancy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-30", "description": "Great specials every day, and the pours on the drinks are very nice to say the least. The abundance of large Flat Screens is a bonus, as are the pool tables and plenty of seating...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-08", "description": "What a sausage fest!  In other words, LOVED IT.  Ladies, come here for cheap drinks, games, and eye candy!!  The drink specials are quite generous...I had multiple dirt cheap vodka tonics with Belvedere.  I would've given this place 5 stars, but no one mingles, and what can I say?... I like making friends after I've had multiple intoxicating beverages.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-13", "description": "Rick is a super cool bartender first of all. Secondly this place has a really good vibe going most of the time. People usually come in here to watch sports or after work to hang out, and it really is not that bad. Its  fun with a group to come during the day and catch a game. You can play pool in the back too. Overall its just got a good vibe and you don't really get that \"I'm definitley in the marina\" feel when you are inside.", "author": "Ash D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-01", "description": "This is the FIRST bar i ever set foot in the first time i came to san francisco, so it is memorable in itself.  But i will say that its a nice little bar to catch up with friends, make new ones, or just play a few rounds of pool.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-04", "description": "So if I had to go to any bar in the Marina, I guess this is the one I'd choose.  Mostly because it's a total dive and they have buckets o' beer.  It's pretty laid back and mellow.  Plus you can have any food delivered there, ie Jakes Steaks.  Good spot to watch games.  And take John Carr bombs.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-05", "description": "i was the only brown person in the building.\n\non a thursday night expect :\n - many frat/marina/drunk off $11 bucket of coors guys\n - kickball teams sporting their hipster pride\n - excessive testosterone in a small enclosure\n - no place to sit between the hours of 930 & 11\n - flip cup in the back & beer everywhere : don't wear nice shoes\n - age range: barely legal with fake id - i just got my first job in the real world\n\nthey earned an extra star because i whooped ass at flip cup.", "author": "Madhu D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "i like beer and sports and drinking beer and watching sports with other people who like beer and sports.\n\nand i don't really like sports. i just said that to fit in.", "author": "Jessi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-13", "description": "The Bus Stop is a major hang out for some great pool players.  The staff is amazing and there is always some good games on.  That's just a few reasons that I love, love, love this bar.  You can find a good pool game going on any night of the week.  I especially like the afterwork happy hour crowd.  What great spot to slug back a few wines while decompressing from work.", "author": "Angel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-18", "description": "Beer is important to me. I like to take care of it, and can't stand to see it wasted. That's why I was so sad this past Saturday when my friend accidentally knocked a pint out of my hand as I was coming back to the table. When I went to grab some napkins from the bartender he not only asked if I was OK (he'd seen it all go down) but prompty poured me another pint. Definitely a plus for service as far as I'm concerned.", "author": "Jesse E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "one of my fav bars in the city! being that my ex was the one who brought me here first, i can't completely hate him.\n\n1. HAPPY HOUR! half off the drinks and they don't skimp on good stuff\n2. tv's EVERYWHERE! (i like to keep track of my  teams)\n3. pool tables (yes plural not singular)\n4. video games for the kid at heart\n6. HAPPY HOUR! wait, i already said that (oh check the daily specials...$8 for bucket of beer)\n5. jukebox with a good selection of music (rock to rap to pop)\n6. eye candy...what ever flavor you like, good chance you'll find one here!\n\nCHEERS!", "author": "Lola L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-05", "description": "LOVE this bar. I always come with friends but the times that I haven't, I've made friends pretty easily. There are pool tables in the back if you wanna play and other times they have flip cup available - who doesn't LOVE flip cup?! You're crazy if you don't b/c its a great way to meet people, get wasted and have a blast all in about 15 minutes :o)", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-27", "description": "years ago, i used to drink here. pretty interesting place with interesting people.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "I heart this place... it's definitely on of my favorite pubs in the city. There's 2 tables to play pool and they also have some arcade games. the employees there are super nice (one looks like Ryan from the O.C.) and they always have some kinda deal.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-27", "description": "I love this place because it's conveniently by the 45 bus stop AND they have great drink specials, thus preventing both drunk driving AND bankruptcy. It's one of those no-frills bars--nothing special--but always a great backup when you have no idea where else to go. I'm not one to get dressed up every weekend and sometimes I just feel like wearing my jeans and T-shirt while enjoying some beer on tap. Some nights it's pretty chill, but on the weekends it can get kind of rowdy. Take your pick.", "author": "Natalie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-01", "description": "This is a fun bar on Union St. with some of the best happy hour deals I've ever seen! Sunday evenings, 75 cent beers, and after a Giants Win? 25 cent beers! You really can't beat that, even at the supermarket!! There's a pool table in the back, and has about 3 rooms total. Fun place.", "author": "Jon N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-09", "description": "The beer is pretty cheap.  Tons of tvs to distract you from the fact you are in the Marina.  Probably a good place to watch a game.  But no food though!", "author": "Marcus E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-11", "description": "I come here rather more frequently than I would like due to coercion by some of my friends. However, it's often better than being dragged to places like Bar None which are way too hectic for me. The service is good - I really can't fault them here. I just get tired of how nasty the bathroom is and how generally dirty the place seems to be. It could be the clientele, but this place has a distinctly dingy vibe. I'd say - fun every once in a while, tiring if indulged in too often.", "author": "Sven S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-03", "description": "The first time i came here was when i was visiting SF and i thought it was a decent sports-bar. i was able to watch the games i wanted. There was a softball league that was there that night celebrating (don't get me started on rec softball players wearing full on gear) winning the Union St cross town, I hit a triple cuz the chic in the outfield couldn't catch the ball trophy. They had the whole back where the pool was and they were playing flip-cup. Awesome!!! That is not why i only gave 3 stars. That is because when baseball is on the most obnoxious of ALL fans descends on this establishment. I'm talking about Red SUX fans. Hey dip-shits there are 150 + games left it will be okay if they didn't execute that sac bunt. Seriously, they make Colombian soccer fan look sane.", "author": "Stephen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "I stopped in here for a couple of drinks on my birthday and this place is great! I wish I could come back more often to take advantage of the drink specials, but I don't live in the neighborhood. Anyway, we had great service, enjoyed the music and of course the beverages!", "author": "Caroline S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "When I lived in the Marina I walked by here often but had never gone in. One time a group of guys who were standing outside the door tried to persuade my girlfriend and I to enter Bus Stop. I was reluctant, feeling a bit tired and cynical for the whole, \"Hey, what's your name?\" thing. My friend talked me into it.\n\"We'll only stay twenty minutes!\" she said. I agreed when she threw in a beer to the deal.\n\nWhat I liked about this bar was how friendly the staff was. There seemed to be some regulars in here too which gave it a chill vibe. There wasn't anything uppity or snobby about it at all. I wish people were more into \"mingling\" instead of sticking to their own group at Bus Stop.\n\nWe ended up staying longer than 20 minutes. My beer turned into several. We had good times.\n\nBus Stop is your average neighborhood sports bar, but it has something to it that makes it better than the rest. I don't know, it's just a fun time.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-16", "description": "Definitely 5 stars for taking care of the Hokies during football season - the staff really knows how to treat their regulars.  I'm also a huge fan of the bucket-o-beer specials on Saturdays.  It felt strange to order a bucket of Red Stripe at 9am the first few times, but you get used to it.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-15", "description": "Not the ideal spot for a big group of pubcrawlers since they stop letting people in while there's still plenty of room inside.  If you go, make it one of the first stops.", "author": "Rego S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-14", "description": "Horrrrrrible service! Door guys are a$$holes.  Who tells a group of four good-looking women that there is no more room in a bar when the bar is a cock-fest? Second time I went there, the older man who bartends there was a complete and total jerk.  Quality service for a QUALITY bar.", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-29", "description": "Good, just plain old good. Decent drinks, no froofroo crap, fairly priced. Order food in from around the neighborhoood...", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "This place has some deals on certain nights. MGD high life is 2 bucks on Friday nights which is a deal even though it is MGD. The bartenders are quick and there were 3 of them.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "In the heart of the Marina with a lot of people in their mid to late twenties hanging out over here.  They offer your usual beers on tap and hard liquors and also a special of  four 16 oz miller and bud lights in a bucket for about $8.  It is definitely great when you bring a group full of people who are down to drink some cold ones and end up ordering about three to five buckets.  Throw in some drinking games like flip cup, which they have in the back along with some popcorn and pretzels, you are definitely set for the rest of the night.", "author": "Kris A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "Love this place.  Finally got to drop by this place last weekend with some friends and had a great time.  The drink specials here are oustanding and just a great place to chill at with friends watching a few games going on.  Even better, its in a great location near other great bars and rests.  Definitely will be back.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-11", "description": "Good drink specials. Lots of good TVs for sports. Decent space. Crowd wasn't my type though... To say the least, I saw 2 'I heart Marina Chicks' T-Shirts while there buried within crowds of popped collars (le sigh!).", "author": "linda t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-15", "description": "\"So do you...\" that was a line we used for a few girls here... Its ok... Marina Crowd, few good looking girls it gets better after you have been bar hopping.", "author": "Nicholas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-13", "description": "here is what i did at the bus stop:\n\nwent inside\ntook a jager bomb\ndanced around for 5 minutes\nleft\n\nit seemed like it would be a fun place to chill!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-12", "description": "Definitely the best on a street of bad.  The barkeep is money and popcorn ad pool table are huge.  Sometimes a goober crowd but its a respectable joint for a Giants game and its was rocking when the Sox took the series.", "author": "Porfirio R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-09", "description": "OK. \n\nI'm not really sure what to make of this bar. \nFirst off, i'll say that the drinks are cheap. \nThen...i'll say...the crowd is Very interesting. Here's a rundown of the characters on a Friday night\n1) A visibly strung out middle age guy was hitting on my friend when i first walked into the bar. He had coke on his upper lips. WHY my friend would still chat with him is beyond me\n2) There were quite a few OLD people sitting at the bar, visibly Drunk off their arses.  When i say Old, i mean, these were 70-80 year old folks. \n3) One of these women stumbled out around 9p and almost got run over by the MUNI. She then hit on a middle age man and proceeded to hang on to him like a koala on an eucalyptus tree\n4) Another one of these Men, helped his equally drunk, old friend out of the bar to catch a cab...only to stumble right back to the bar for Another drink. It was painful to watch\n5) Then, Coke guy came back and proceeded to tell us that he has 7 GFs and wanted to know if we were 'interested\". GROSSSSSSS\n\nNeedless to say...i'll only return if i'm looking for entertainment on a very Slow week. \n\nInteresting", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-10", "description": "It's hazy, but I believed I stopped in here once with Nish to do a shot of Jagermeister or Dr. McGillicuddy  or some other such nonsense shot just to make us all the more drunk. Yup. That sounds about right.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-14", "description": "Great daily drink specials, chill atmosphere, and a killer jukebox.  Seems like a good place to hang out and watch games during football or baseball season.", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-26", "description": "Thanks for actually serving until 2am.  Good bar, just a little too packed most of the times I've stopped by.  Don't go out of your way, but if you're walking by and it looks decent, check it out.", "author": "Neil I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-31", "description": "I'm not sure why I haven't reviewed this place yet. Ron and Jason are my favorite! It's one of the only places on Union street that I frequent. Great drinks, great people, and TV's everywhere!", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-28", "description": "Any place with sports, pool, and buckets of beer is a place I can call home.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "good happy hour price, always end up here (when im in the marina) to watch the giants game.", "author": "Zachary B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-04", "description": "pool tables, tvs, and beer.\n\nyour basic sports bar with action varying from surfing, wrestling, baseball, football, and even soccer.  a reasonable place for a post bowling league drink, but not really a place i would think of going any other night.  i will say that it was reasonably full on a monday though.\n\non this particular night, i overheard a conversation about the worst medical emergencies people had heard about.  it was kind of disturbing as you might imagine...lots of dismemberment coupled with objects going places they don't belong under any circumstances.", "author": "eric g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-09", "description": "I just don't fully understand this place...I've had some good times and I've had some - really wish the slimy, stinky guy, who is still in his suit from the night before and hasn't taken a shower would get out of my face ;) times. I feel like it's a very typical marina dive bar. I still try to keep an open mind though, I have had some funny times here. It's really all about the company your with! Right?", "author": "christina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-16", "description": "Hit or miss, so bring people you like with you, don't expect to find them there. Last night there was an impromptu arm wrestling tournament between two girls which was higly entertaining. Probably a good place to watch a game and relax.", "author": "Barbara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-13", "description": "My fellow Southerners and I gather here to watch SEC sports.  The staff is very accommodating for our impromptu gatherings.  I like the fact that they'll let you bring food in from neighborhood restaurants. I'm sure that it can get crowded during peak times, but honestly I'm rarely there during peak times since it seems like only the 11 am CDT games are televised...aka 9am PDT.   Woohoo...drinkin' and watchin' football at 9 am on a Saturday, now that's hardcore and definately Southern.", "author": "mandy f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-15", "description": "I came here to use the bathroom and grab a drink, but they don't take CCs...booo! So, I left and went to Bar None.", "author": "Charm N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-19", "description": "At night it tends to draw a younger, less rich, crowd than the other bars in the area. Fitting in to that group, means that I like the place. Drink specials too.", "author": "Jack O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-08", "description": "One of the better bars in the area.  when i have to go out in the marina/cow hollow i think this is one of the places i'd rather go.", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-11", "description": "#1of a four part crawl.  Classic bar decor, high ceilings in the two table pool room was pretty classy.  The ability to order from local eating restaurants is a useful feature.  The daily drink specials are nothing short of cool, e.g. $10 for 6 Tecate's on Mondays.  The beer buckets are a first for me to see this side of the border, it's reminiscent of how they do things down in Mexico.  Overall, a pleasant experience.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-18", "description": "I came here looking for food but all I got was airplane-style peanuts and beer ... so I left.  There are TVs, a pool table and a decent crowd, so the place looks like it has potential.  i just didn't have that much fun when I came here, so I was left unimpressed.  And they don't serve food, just peanuts.", "author": "M P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-02", "description": "Bus Stop is a good hangout bar in the Marina. It's a good place to watch the game, hang out with guys and have a good time. The women in this bar are usually pretty cool for Marina standards (compared with the typical i'm an ex-sorority, living off of daddy girl).", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "Fantastic bloody marys and nightly drink specials. Good for  early in the night before heading to other bars.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-27", "description": "Really like this place when it is not too packed.  Really fun place to go watch a game during the day.  I especially like that you can order food to it from the restaurants in the area.   Not a big fan of it when there are so many people you cant move and there is not a single place to stand without being in the way.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "When seniors in college, we had SF pub nights.  Buses would drive us up from the Peninsula and deposit us at the Bus Stop, and we were asked to re-board, same place, 2am, after carousing our collegiate selves around Union Street.  I always thought it was just so funny that they would drop us off and pick us up at the Bus Stop.  So funny.  Ha.\n\nThese days, I most remember the Bus Stop not as my pick-up spot (well, not in the sense I described above), but for the following three reasons:\n1. The older gentleman behind the bar is really sweet (sweet?), and makes me liquid cocaine shots when I'm feeling self-abusive.  \n2. I shot my best game of pool ever here (they have two tables).\n3. They have TVs to entertain you sports fanatics, and pretty darn decent nightly drink specials to entertain the rest of us.", "author": "Hannah J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-06", "description": "I like this place. Maybe because most of my time spent in here is during daylight hours and the crowd is good. Great place to stop and grab a beer (or 4) and watch the game. It's also super close to my bff's house so we can stumble on home afterward for a nap before we conquer the City at night! ...Bloody Mary isn't too shabby either.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-10", "description": "I love this bar, in part because it is conviently located two blocks down from my apartment.  The bar tenders are awesome and really friendly and they have great daily drink specials.  It's not the typical uppity marina bar and i've always had a great time.", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "A little small.....gets crowded......but a really fun place!! Couple pool tables and some great drink specials every night of the week. Also a good place to watch a game!", "author": "tom h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-18", "description": "Had a great time here watching college football about two weekends ago.  There are other sports bars in the area, too, but this one didn't necessarily do anything wrong, and the atmosphere in such a place on  a Saturday afternoon is hard to beat, so it gets a decent rating.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-06", "description": "i really like bus stop because it has both marina people and locals but without the marina attitude that plagues some of the other places around the area (matrixfillmore cough cough).  \n\ni definitely recommend the buckets of pacifico for 15 bucks, and also the bus stop car bomb drink.  not sure what exactly is in it, but it's pretty tasty and a fun thing to drink with your friends.  \n\nnice place to come for a more relaxed night; people can come and eat food inside, they have ball games playing in the background.  \n\nI've only gone to bus stop on thursday and friday nights, and it's usually not tooo busy but always fun.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-03", "description": "UGA BAR!\n\nGet there EARLY on Saturdays- I was there last weekend to check out the UGA Game and It was wall-to-wall packed. I think it's also a VT bar... \n\nAnyway, awesome drink specials, good crowd that gets into the games, and the bartenders are friendly- it was exactly the type of College Football bar I've been looking for.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-25", "description": "One of the only places I really go in the Marina.  It's a really laid back crowd for the most part.  You don't necessarily feel the pressure to wear a striped button down collard shirt.\n\nThey have different drink specials every day, so you can get away with a cheaper tab.  Wednesdays or Thursdays they have a cheap Skyy Vodka special ($2-3?).  And I think everyday they have a Bud/Coors/Rolling Rock bucket special of 5 beers for $11 or $12.\n\nMy favorite thing about this bar: COMPLIMENTARY Amici's pizza around 8 p.m. or so!  The bar just gets it delivered and then hands it out to anyone who wants it.  I LOVE IT!\n\nThere's a pool table and some pin ball machines and a couple flat screen tv's for your entertainment.\n\nOverall, a laid back place to grab a drink or two and move on - or a good place for last call.", "author": "Liz T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-28", "description": "The bar is a pretty cool place, but what makes my visits to this fine establishment worth the trip every time, is the waitress/bartender Devin. Not only is she extremely efficient at her job, but just her mere presence makes coming to the bus stop a phenomenal experience! Devin is the best ever!", "author": "Thomas E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-01", "description": "Fun place to watch sports on the many many TVs with your friends. I never realized it was a V Tech hang out spot, but it was fun nonetheless.  Service is a bit slow, even at the bar, but the beers were cheap.  They do not serve food here so we ordered pizza from North Beach. Regardless of those issues it's a good place to go with a bunch of friends.", "author": "Po L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-15", "description": "This is a great place for catching any sports game. The bartenders are nice and the drinks come fast. During the weekends, there is an abundace of young professionals that haven't given up on their frat boy days and girls just trying to stay drunk to keep their sorority mindsets. It's certainly high school/college all over again. On the weekdays, you'll find retired Hemingway types that make for better conversation. The best way to enjoy this place is to seat yourself at the bar, near a tv and make way for the libations.", "author": "Cris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-31", "description": "The Bus Stop is great for those Saturday college football games. There are good-looking sexy guys rooting for their Alma Matters. The drink specials are plenty, although I've never bought myself many drinks while hanging out. The drinks magically appear.", "author": "Johnna R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-06", "description": "i left this place 10 minutes ago and am convinced it's one of the worst bars ever.  yes, maybe a pubic hair better than bar none, but still ridiculous.  i live 2 blocks away and hadn't been for 3 or 4 years.  i wish i'd extended my streak but got dragged there for a b-day party.  the guys are all from the east bay, the girls are either 22 or complete bimbos, and it couldn't suck any more.  indeed, it has more testosterone than floyd landis.  avoid at all costs.", "author": "schnarf-a-larf a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "This review is about a year or so late . . . I used to bartend and I was pounding the pavement looking for bartending jobs after I lost my other job.  The bartender at Bus Stop was one of the only nice people on my never-ending search for a bartending job.  He seemed sympathetic to my search, said that it was really hard to find bartending jobs especially in that time.  Then a little old man next to me offered to buy me a beer.  He was so cute!  It was afternoon, though, and I wanted to finish doing that neighborhood, so I declined.  I really should have just sat down and had a beer with the man. .  who cares?  I needed it.  Anyway, most places I went to to job hunt - well it wasn't unusual for bartenders or staff to practically spit in my face if I dared ask \"are you hiring?\".  The women were always the worst.  But this day someone was actually nice, and didn't make me feel stupid just for asking, and that meant a lot to me.  Thanks, Mr Bartender!  :)", "author": "Muriel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-15", "description": "2 1/2 stars. I don't really get why this place is so popular. It wants to be a dive bar, but all the people in here have 7 jeans and popped collars. Plus it is so tiny and always packed to the gills. Bartenders are pretty friendly but it's usually impossible to get  a drink. It would be a good place to come watch sports, except that a) there is never anywhere to sit and it can be tough to stand, hold your drink, and cheer for your team for hours at a time and b) there are always some obnoxious wasted guys getting in fights over whatever game happens to be on. I guess this is where the Boston fans hang out because my roommate and her friend always go here to cheer for the Red Sox, which makes it even worse in my opinion, since their fans tend to be some of the loudest. Oh yeah and the bathroom? Quite possibly the worst design EVER. It is so narrow that your knees actually touch the wall when you sit down on the toilet.", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-04", "description": "MyGodwhataDUMP.  The odor of spilled beer and bleach and cheap perfume combined with the low-end, public school clientele will hit you like a brick wall upon entering.       This is where people come to drink shots and throw up outside.   This is where boys wear their trucker hats sideways and the Marina girl-wannabees walk around in cheap attire.  This bar belongs in another part of town - far, far away....", "author": "F. V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-30", "description": "came here on a tuesday night so it wasn't too busy.  the bartender was super nice and friendly (maybe because i'm a woman) but he was all smiles which made me pretty dang happy too.  drinks were strong and people seemed to be having a lot of fun.   good casual place if you don't like things too hectic.  got to play wheel in the sky on the juke box!  gotta have my journey", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "went here for the man-u/chelsea game because kezar pub was too packed and bayside is closed. had a great time! we got a couple buckets of miller(i think) and they were very cheap. they dont serve food, but they allow you to bring food in and even order food to be delivered to the bar. the staff was friendly and the fans were in attendance. and man-u won! played some pool in the back afterwards, and had some popcorn. im definately a fan!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "i like this bar.  although the bathroom is horrible.  but good drink specials.  fun people.  definitely a nice stop in the night.", "author": "jessie h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-26", "description": "Great local bar, but gets really packed during peak nights. We usually order a bucket of red stripe (5)  for $16.  Good luck finding a seat to enjoy it though. Plenty of drink specials everyday of the week. Bathroom is SUPER small.", "author": "Simon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-16", "description": "friend took $100 from phil gordon playing rock, paper, scissors.", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "Had a great time here on a Sunday in March. Came during the day, everyone there was super nice, cheap drinks, and it was actually pretty full. I love the fact that people in SF make Sunday the 3rd day of the weekend. Will def be back with a group of friends again.", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "they have amazing drink specials every day of the week...i'm not usually a fan of bars in this area but this is one of the bars i can tolerate..i arrived closed to midnight in sf and decided that this would be the bar for me to go get wasted because it was walking distance from my hotel..the crowd is nothing to  write home about..there will always be middle aged men trying to buy younger women drinks and frat types with their friends watching sports...it's a sports bar, it's the marina, it's going to happen..that aside, they play good music, have about 5 different channels playing at once and their drinks aren't bad...if you're lucky, maybe a super drunk middle aged man will buy you and the rest of the bar a round of drinks (true story twice over)..score!", "author": "monica p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-15", "description": "good place to watch football and bball games. watch out for those crazy georgia peaches on football saturdays.", "author": "Dean E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-16", "description": "I signed up for Yelp just to review this place. I lived close to the Bus Stop for about a year and I think it is the thing I miss most about my old apartment. Crowd here is friendly and fun at the same time. All the people that work there are a fun group and most of the patrons become friends with the bartenders/waitresses/bouncers, of which most go to the bar even when they are not on their shift.  The bus stop is really two bars in one: the back room with the pool tables and the bar/front room. The back room is usually where the regulars hang out. Most of them have been coming for years. The front room is the one that gets crowded on thurs/fri/sat nights. occasionally you have some douche bags from bar none or matrix fillmore come in, but for the most part the crowd is mellow and laid back. Drinks are good, specials are good. The only time I wouldn't want to come to the bus stop is on pub crawl nights when there isn't any pool. I live in San Diego now and go to a lot of bars down here but Bus Stop is still my number 1.", "author": "James R."}
