{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "OMG the best Crepes.\nI love this place, more important my children cant wait to get here. They are such picky eaters. All the moms out there know what I am talking about. My children loooove this place\nDefinitely recommend to stop by here.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-31", "description": "The crepes here are tasty, but the staff seemed unknowledgeable and inflexible. I saw a waffle that had a tasty set of toppings, so I asked for that set of toppings on my crepe. The staff told me that I had to choose from the preset options of crepes, and after pushing the issue, she asked her supervisor, whom instructed the employee how to ring up the item. After being charged extra for the custom crepe, I was still given a preset menu option different than what I ordered. \n\nThe lack of employees nowadays who know the POS system their using and how to sell the product they carry seems poor in many stores across the board, but this experience stuck out most memorable. \n\nIt seems that denying a customer what they want even if the customer is willing to pay goes against better business practices and creates attrition in return business.", "author": "dAvid s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "Used to stop by here to get a smoothie to refuel me for my shopping ...until today. The person who took my order not only touched the cash I gave him, but made my smoothie without changing his gloves. When I saw him touched the banana and avocado with those same gloves it was an internal fight to bitch about it or walk away. I consumed all my energy on shopping earlier in the day so I went with the latter and threw the smoothie away. After that incident, I will not be coming back there.\n\nFor those who come here, please be more aware of who makes your food after you place your order. Those who touch cash should not be touching your food unless they wash their hands regardless if you have gloves on... or at-least change your gloves!", "author": "C O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-24", "description": "There are so many people doing nothing.  I had to wait 15 min just to buy a dessert because some people in front of me were doing a special order.  I looked at the people just standing there, asking if they could ring me up.  They stood there.\nThat's okay, because I will never go back.  There are too many good places to get better food, and have service much better than this place.  This place sucks.", "author": "Arlene C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "I usually come here after 5:30PM for the 50% off specials they have on sandwiches and salads so this review is mostly based on those items. The place is located in a stall near Panda Express.\n\nThe salads tend to be a bit over drenched with dressing and by the time discount time comes around, a lot of it is rather soggy so I usually tend to avoid the salads.\n\nThe sandwiches vary in quality, and they will toast it up for you if you want it hot which is nice. I've generally like the BLT or the chicken Milanese the most, while the other ones don't really look all that appetizing by this hour.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "This is such a cute little bakery located conveniently at the underground floor of Westfield Mall. \n\nEverything is perfect except the waitress lady was rude and impatient. Honestly we did not understand her English either- she said no to the question then yes the next second. She grabbed the pastry with her hand that we did not feel sanitized. \n\nShe did not pass our food to the cashier so the cashier ended up charging us for something we did not have. She then came over to the cashier line to stress the cashier out. \n\nWe were informed that she is the boss of this bakery.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "I was super ill after drinking the power house juice (with beet, apple, celery and carrot) and eating a banana waffle with Nutella. I stayed in bed for hours after that.\nI also waited for a long time to be served as communication did not seem to have been done between counter and kitchen.\nNot my best SF experience!", "author": "Anne M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "The worst cakes ever, they were made when Jesus was walking on the earth. Please avoid unless you are having a medical emergency and every thing else is closed.", "author": "Harish G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "We went here for a late night dinner on a Monday. \nOf all the tables in the restaurant only two of them were occupied, yet three or four tables had not been emptied of plates, silverware etc. They had the radio blaring some music with a lot of static. \nWaitress and waiter behind the bar were busy joking around and singing (not well) and did not seem very interested in taking our order. \n\nThree of us wanted to order paninis but were told that they don't make paninis after 6 pm. Might wanna mention that on the menu. We then ordered pizzas instead. They were subpar and by no means worthy of the ~$18 price. \n\nWaitress was busy chatting up her colleagues behind the bar and only managed to remove two of our plates after we had finished our dinner. \n\nWaitress left check with handwritten note '18%=$18,56' - needless to say, she did not get that kind of tip. Tips are earned, not a given. \n\n1 star is for the bottled Coke.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "Visiting SF and looked pretty good so we decided to try it. Once we sat down, we waited about 10-15 mins to get our order taken and be acknowledged. Once order was taken, another 10mins for our drinks (even a glass of water). Food comes out and no offer of condiments or anything else, not even a refill on water. We frequent SF often, and we will definitely NOT be trying this place again. There are plenty of other restaurants with BETTER service and food quality. For the price, food was mediocre.", "author": "F C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "I ordered the smoked ham sandwich during the happy hour sale. It was very good, but then I found a blonde hair inside! I have black hair so it definitely isn't mine. I didn't bother to go back and get a refund because it was half off.", "author": "Meaghan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Love their fresh fruit and veggie juices. \nIt's great that you get to see what they actually put in, which are fresh ingredients and they fill it up to the max!\nIt's pretty pricey $8.95 plus tax for a juice that I can sip in seconds! lol\nBut they taste great!", "author": "Ariene S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "It's my first time to try a food here and was dissappointed... The desserts looks great but be very careful! I bought a Dutch apple tart and found mold when I was almost done eating it.... :( I would like to ask for a refund but I have no time to go back there...", "author": "Jaypee V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "From the outside it looks like your average grab and go pastry and coffee café. When you walk in it's actually much larger. On the left they have their café - barista station with all of the grab and go pastries and sandwiches, and on the right is the bar. Farther in the back is all of the restaurant seating for the sit down dining. My fiancé and I were very hungry after we did a road trip from Los Angeles to San Francisco. We knew we were going to have a big dinner so we really didn't care where we went for lunch. We got frustrated from walking around so much so just decided on this for pure convenience. We were able to be seated right away. It was about 1 PM on a Saturday afternoon. It's very close seating so expect to sit close to other tables. We were greeted right away by our server, Carlos. I was between two different Panini's and he told me to get the Bellini special. I was sold. Anytime they put their restaurant name on a sandwich, it better be good! Also, I always take recommendations from the staff. My fiancé got an cold, Italian sandwich. We waited for about 20 to 25 minutes before our food arrived. The environment was growing more and more busy. At this point, the place was still not completely packed but for some reason they sat a couple right next to us and it felt like we were sitting with them! I wish they would've spread them out a little bit more. At the end, it didn't really matter because the place was almost completely full. This made me feel like we made a good decision. Our food was delicious, because it got so busy our server didn't come back for a while to bring us our check. We had to track him down. Once we did, we were able to pay and be on our way. This whole process took about an hour. The next morning, we were ready to begin our road trip back and wanted a coffee and some breakfast to go. Since we didn't feel like going on the Internet or walking around, we decided to return to Café Bellini. This was around 10 AM on Sunday morning. The place was very busy. We were able to get our coffee and a breakfast burrito to go in the course of 20 minutes. Overall, this place will not blow your mind - but it is a great place for some quick breakfast or lunch. My fiancé's Italian sandwich was better than the Bellini Panini so I definitely recommend that. The California burrito to-go was delicious as well, lots of cheese though. Enjoy!", "author": "Addy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "Dont go. Turn back. A waste of time and money. waited 40 minutes for the whole tables food to come just to find out they \"forgot\" my order so I had to wait another 20. Mediocre taste, would recommend going to the pier for better food", "author": "Jenika O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "Terrible, dried out sandwiches. What chicken there was in the chicken-cranberry salad had no flavor. \n\nTasted like cardboard.", "author": "Kirk K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "$10 for a regular size fresh squeeze juice?!?! \nThe cashier charged me for the wrong drink that's more expensive and can't reverse it so I can't get the difference back?!?! I don't mind the mistake and care about the change to cover the difference, it's principle that matters.\nWow!\n\nBelow average drink. \nOverpriced.\nPoor service.", "author": "Raymond F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Half off sandwiches and salads at at the end of the day! I tried the chicken cranberry sandwich and it was pretty good. They even offer to toast it for you. Probably wouldn't buy it for full price though since the portion is smaller than most deli sandwiches. Buy great value when it cost around $4 in the evening.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "The wait to be seated was awkwardly long as we were effectively ignored for a few minutes.\n\nOnce seated however I was treated to some phenomenal latte and a decent breakfast. \n\nI would definitely come back for coffee. I will fantasize about that coffee.", "author": "Bob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Love their macarons!!  Bought 2 macarons...strawberry & lemon flavors.  Strong flavors.  Tiny in size but very tasty!!  You can actually taste the chunks of strawberry.  Definitely worth getting more & in different flavors.", "author": "Leafy Kitty S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-09", "description": "Overprice...super slow service and too many people doing nothing!!!\nOrder coffe and sandwich after 20 min I got the wrong coffee and this panino soaked on sauce", "author": "Matteo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-13", "description": "It's an open coffee/dessert bar in the middle of a busy food court.  Although there are several stations, there is only one line for ordering and paying.\n\nI ordered their L'Amour crepe as a neutralizer for the excellent ramen lunch we had at Ajisen.  The crepe was slathered with Nutella, a handful of strawberries, and the folded twice and drizzled with chocolate sauce, a few shakes of powdered sugar, and then a side of whipped cream.  I actually liked it, but be warned its on the sweet side.  The crepe itself was thin and moist.  My wife complained it was too sweet for her though.\n\nI also got a single Americano to wash things down. The flavors were there but the cup was like really small for $2.50.  Starbucks makes a larger version so I'll stick with them next time.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Overall, the people are very friendly and offer wonderful customer service! I love that they have Happy Hour on Coffee and Tea on weekdays from 9am-11am and 3pm-5pm; 50% off original prices!!! Also, I tried the L'Amour crepe today and it was delicious! I'll definitely be here a little more often :)", "author": "M T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-15", "description": "This place has all these pastries displayed in the glass shelves and they look so appetizing...\n\nBut are they?\n\nI've only been here twice but I've actually never tried and of their foods. I've had the matcha chai latter, which is basically a green tea latte, and that fared decent for me. I've also had their cappuccino, and its pretty straight.. Although I would like it to have more flavor, in my opinion.\n\nI finally tried their crepe, and it was kinda weird when I noticed that the woman working on it kept taking it back. I ordered a gelato crepe, which is basically a choice of your own gelato added into a classic crepe. I chose banana gelato and when I watched the woman make it, I noticed she was adding BANANAS. I didn't ask for bananas... But I guess she noticed the error she made and it was really weird seeing her pick up the gelato by hand (although she was wearing gloves.. Thank goodness) and just dump it back into the crepe lol.\n\nI didn't finish it in the end... I think I will just stick to drinks here instead.", "author": "Jerianne G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-13", "description": "I have never been so disrespected in my life. I order a veggie crepe & nutella crepe from the front and pay. The lady making the crepes LITERALLY STARTED YELLING AT ME FOR NO REASON AND ACCUSED ME OF NOT PAYING. I was standing there with the receipt from three minutes ago in my hand. Im not sure what error of communication happened but it is never okay to treat your customers like crap. I will never ever return and I will tell everyone of this horrible experience.", "author": "Brittney V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "Great made-to-order beet juice (Power House). Fast and accurate service. Much needed after lots of vegan junk food.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Very fresh and delicious food. Bacon is crispy and the crepes are a must! Clean dining area and helpful and pleasant servers.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "This cafe is in the Westfield San Francisco Central Mall. It offers many kinds of desserts, such as crepe, cakes, pies and so on. We ordered strawberry & banana crepe. It taste good. But the caramel is too much and it is a little expensive as a crepe.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "I looove this place. Each time we go downtown I go here to get a quick fix of my favorite ooh la la crepe  photo is posted too. Very nice employees, good sandwiches and juices. I stay away from the green smoothies though.", "author": "Katherine J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-10", "description": "Overpriced mall cafe.\n\nTheir fresh press juices are thirst quenching and undoubtedly tasty, but filled 3/4 of the cup (with the other 1/4 being airy foam) and cost a whopping $9. At that price, might as well make your way over to Bristol Farms and buy a fruit basket.\n\nThe gelato tastes commercialized and flavors aren't unique. There are so many better options outside the mall, that it just isn't worth paying premiums for standard gelato.\n\nI do love their dessert pastries (i.e. Opera Cake, Tiramisu) and have gotten them every now and then.\n\nCafe Bellini is a safe bet when it comes to mall food, but terribly overpriced.", "author": "Diana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-08", "description": "I come here all the time for Happy hour - 1/2 price on Tea & Coffee Drinks mornings & afternoon. In the evenings a lot of sandwich & pastries are 1/2 off as well. The service is friendly for the most part but this place really isnt all that Special despite being quite Convenient which is how I end up bringing my Custom here.\n\nIt bothers me when I order a cup of Tea & I get handed a Tea bag, it really would be more professional if they prepared it for me instead, but they cant be arsed/asked.\n\nThey have room to really Step It Up which is why im just giving them 3 stars but I really want to like them more. \n\nTheir iced coffee is dissapointing & defenitely not on par with Starbucks but their Tea is heaps better (Mighty Leaf) than the likes of Starbucks.\n\nIts pricey if your not there for 1/2 off but I suppose its meant to be given the location & tourist, but a lot of us that come by also work in Westfield or somewhere close by.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-20", "description": "Average, but convenient.\n\nMid point break from an exhausting whirlwind of shopping, you can say I was in need of  a little pick me up before continuing my shopping crusade. \n\nCafe Bellini is located within the food court area of the West field Mall. The pastries and treat are all displayed  on the shelves behind glass windows. Most of them are more appealing from a distance, though, some of them look worthwhile indulging in. You order/say what you want with one person, where you the proceed down to the cash register to pay. \n\nI eyed a mini  sugar free cheesecake that I decided upon getting, along with a small cup of coffee.\n\nMy total was $7 and some change. Thought it was a tad pricey, but go figure.\n\nCheesecake was pretty good. Not great, but decent. Coffee was ok.\n\nService is just so-so.\n\nThis place is great convenience wise, but certainly not a place I would go out of my way for.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "This eatery is in the Westfield San Francisco Centre Mall.  The strawberry & banana crepes were good and very stuffed with fruit!  It looked better than it's replica display.  For the price, it was worth it.", "author": "Rolena I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-14", "description": "If it weren't for the food the place would have been a complete loss. \nDecor was nice, baked goods looked incredible but service was horrible. \n\nTook ten minutes to seat and almost 45 minutes to receive our meals after ordering. The servers were slow at best and completely inattentive. \n\nWe watched two tables after us seat, eat, pay and leave before we were served. \nSo sad indeed.", "author": "Anastasia W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-05", "description": "I believe Cafe Bellini is one of the only places in Westfield that serves crepes, so when I was craving a crepe one day, I decided to visit Cafe Bellini for the proximity and convenience. After browsing the small selection, I settled on an Ooh La La, which is a crepe composed of strawberries, bananas, caramel sauce, and whipped cream, totaling to be around $9 and some change. The crepe was pretty large and they gave me a ton of fruit, so I was very satisfied, but still thought that the price was steep for a crepe. After all, it is San Francisco! In addition to crepes, Cafe Bellini also serves various drinks and pastries. I probably won't be back!", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-26", "description": "Stay away! Stopped here for a slice of cake and creme brulee. Both were horrible. Not just not good, but horrible. Stale dry and tasteless. I dont expect much from mall food but come on - you at least need to serve fresh. Walk to the grocery store and get fresh cake. Buyer beware.", "author": "Bezi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-02", "description": "I'm only a fan of their 1/2 off case... Everything LOOKS and smells delicious but the taste is just average. They price everything pretty high so if you can wait, wait.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "Despite their main picture being their creme brulee, I would highly advise against actually ordering it. That is unless you are interested in the kind of creme brulee that is served without a crispy, caramelized brown sugar top coat. \n\nI ordered one being that it's definitely a favorite dessert. Upon noticing the top brown coating to be completely liquid, I requested if they could retorch it to solidify the brown sugar. I was regretfully informed that this is simply how they serve it. They proceeded to joke about remembering to bring a torch next time they come to work as I was walking away.\n\nThe level of customer service/professionalism was definitely subpar, even if it is just a food court shop. But this could have just been the luck of the draw in terms of employees.", "author": "Jenny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "Customer service was good. Can't really say much bc ordered only one item, Creme Brulee, which was actually pretty good. Not too much on the sweet side, and not the best I've ever had, but good. :)", "author": "AJ J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "(See pics)\n\nReview #1079.\n\nI am always in a rush, as most people know me know this, that every micro second counts. So when I want a cap at a coffee bar and saw the line, I immediately ran though my mental map to find the next great special coffee drink shop.\n\nTook the escalator down and you reach Cafe Bellini. It's a pretty decent size with full espresso machines and lots and lots of desserts. This cafe chain makes a mean Lavazza drink as I always love. No line with a few servers making sure you are being attended.\n\nThey also have some panini, holiday cookies and other drink items.\n\nOf course by then I also got one of the cannoli! It was good but I still prefer illy shop in Fidi. Next time I will check out other sweets. A great treat in the afternoon either you need a sugary break from shopping, or rushing somewhere.", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-02", "description": "Stopped for a cookie before heading to BART. I love peanut butter cookies, and the large ones in the display case caught my attention. Stood in line to pay $2.50 for a stale, dry cookie. Oh well. lesson learned. Don't be tempted by a cookie in the case.", "author": "Delaine Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-21", "description": "Shame on you Cafe Bellini!!\n\nWe bought several items and took them back to our hotel.  They were ALL STALE AND OLD.  Bleh!!!\n\nSure they look good in the case - but they are merely display items.  Lord only knows how long they've been sitting in there.\n\nFAIL!!!", "author": "Li J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "5 Stars...... Yep for being in the mall with all the typical mall choices this was a great choice. I had the veggie crape which is absolutely off the hook using a half of avocado, bell pepper, mushroom, onion I'd buy it again!!!  Good to find a decent place to eat without the typical fast food seen.", "author": "Maurice D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-05", "description": "If I could give this place zero stars I would.  My experience was sooooo bad I e-mailed the company.  Customer services is totally lacking.  Cashier was soooo rude I walked away without food and with out paying.  I don't care if they lost a panini and $6.95 in the deal........learn some customer service and manners and things like this won't happen.\nI will tell everyone I know to avoid this poorly run establishment like the plague.  FYI - went over to the little Japanese place and had a wonderful lunch servced by people who actually know something about manners and customer services", "author": "Roylen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-27", "description": "Just a very average shop.\n\nNothing special. The cappuccino was too bitter and the crêpes my wife has ordered was not great at all. \n\nThere are better cafés around... it seems conveniently located but it is not worth going for.", "author": "Jens L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "We got the L'amore crepe and a lemon  bar it was good! The crepe had plenty of Nutella, but not enough strawberries. And the Lemon bar was pretty small for the price. \n\nOverall the it was good dessert. Quick too. All together it was $15 which is kinda pricey for dessert. \n\nNice staff", "author": "Genie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-08", "description": "Love love this place, so many deserts to choose from. \n\nThey have the best coffees, wines, sodas.\n\nThey have Mismosas for Breakfast, and yummy breakfasts here. \n\nGoing back for sure!", "author": "Raquel I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-26", "description": "I'm writing this review literally 5 minutes of leaving here. This is like the 3rd time this has happened to me and now it's just become pathetic. I ordered a cold drink and a chicken pesto crepe... Alright so I'm a little confused on how things work. You wait for the drinks at the front, but you wait for sandwiches/crepes at the back. So I waited in the middle, hoping that I could see if one was being made first. 10 minutes passed - okay, where's my drink? I walk around and see nobody making a drink. I then have to ask one of the workers, \"Where's my drink?\" She then goes and grabs it... So it's been sitting at the counter the entire time without me knowing that it was ready. \n\nOkay, so about the crepe now, I waited literally 20 minutes. When the guy finally passes me my box with my crepe inside, his female coworker grabs it back, without saying excuse me, opens the box and starts examining the crepe with him. What are they talking about? Was there something wrong with my crepe?! She then tells me to wait 5 more minutes and throws my crepe back onto the heater. I guess my chicken crepe was either cold or not cooked all the way? I didn't want to know, so I didn't even ask. I just waited and waited until I got my food. So now, I'm eating... And writing this review.\n\nOh, and if you want to pay $6 for orange juice and $8 for an average sized Cannoli, this is the place for you.\n\nNot happy.", "author": "Rayne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "I work near the mall (but not at the mall) and often need to bribe myself with a coffee break to get through the day. \n\nMy go-to drink is usually a caramel macchiato, which I usually get from the Starbucks at the entrance to Powell Station. That can get very pricey, so I've been trying to cut the coffee break out of my day... until I randomly passed by Cafe Bellini on the way to work and noticed their happy hour pricing (Half price for all drinks after 3pm)\n\nI think it's amazing that I can get a quick caramel macchiato in the afternoon right when I need a pick-me-up...for $2.10 !!!  \n\nThanks Cafe Bellini, I'm more awake now and I have an extra couple of bucks in my pocket :)", "author": "Alicia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-20", "description": "A cafe inside of the Westfield Shopping Center on Market Street.\n\nEuropean style (similar to Paris) in display, but poor customer service ruins this place. The server was busy chatting away with her friend instead of serving customers today. Shame on you!", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "What I like most on Bellini are their service. Nice smile with awesome Food and Smoothies and of course my fave Crepes snd Coffee.", "author": "Robbleeav D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "This place is yummy. I ordered the crème brûlée and the spinach quiche. Both very delicious. But my quiche could have been a little warmer and they could have told me were to receive it at because I was standing at the condiment bar forever looking like a idiot but whatevs great place.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-26", "description": "Great for after dinner dessert.  Not because of the food, but more for its proximity to Union and its hours of operation.  The desserts were ok, as you expect for mass produced sweets.  Coupled with the coffees, it gets better.  \nService was great, Taylor was engaged and a great at making you feel welcome. \nPrices pretty reasonable - $5.50 - $7.50 per dessert.", "author": "Rome B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-26", "description": "Situated in the center of the bottom floor of the San Francisco Center sits the cute little cafe known as Bellini.  After a long day of exploring the city, my feet were killing me and it was time for a refreshment to reenergize my holiday spirits.\n\nI decided to ruin my dinner appetite by indulging in a tiny raspberry tart washed down with some XXX Vitamin Water.  My eyes nearly popped out when my bill came out to nearly $10 for the two.  This place is a highway robbery!  The tart itself lacked the sweetness and tartness that I craved and the tiny portion was less than satiating.  While it may be the only reasonable alternative to the fast-food dominated court, the only impression that it left was that I didn't ever want to spend so much on a pastry again.\n\nI can understand how their location and clientele might drive up their prices, but never this much for such a mediocre pastry.  If their pastries really popped, I might consider it a fairly decent deal, but at any cost, I felt that it really wasn't anything more than glorified mall food.\n\nFood: 4/10\n\nService: 6/10\n\nPrice: $\n\nAtmosphere: 6/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "We ate here frequently while staying at the Marriott just up the street on Sutter. Nice and convenient walk from the hotel, this place has a great menu selection to choose from. We ate here several times for breakfast, lunch and dinner. Each meal was fresh, served hot and ingredients were of high quality.  Service was excellent too; however, a little slow at times. The atmosphere is nice; however, does get a little crowded and noisy during peak times. Coffee's are also excellent. We tried a few of the smoothies, and weren't a fan. Not that they were bad, just not to our liking. We will return here on our next visit to the Bay area.", "author": "Alan N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-14", "description": "Perhaps I selected the wrong items.\n\nI was feeling a bit down from a lack of caffeine and since I've tweaked my back, feeling depressed more than ever because I can't go to the gym to work off the flab on my butt AND be ready to fit into a specific dress for an upcoming holiday party.\n\nAfter hitting the Gap, Urban Outfitters, and subsequently H&M, and failing at all three in finding that perfect gift for a finicky relative, the day was none the wiser.  I headed over to Nordstrom to see if anything there would strike their fancy and on the way, decided to stop for some caffeine.\n\nCafe Bellini is located on the bottom floor of the Westfield mall made famous by variable floors of circling escalators.  This is away from the frou frou shop additions on the other side near Bloomingdale's.  The counter is nice, with one side for drinks and the other to feature fresh made sandwiches, salads, and pastries.  The sales staff and baristas are also very nice.\n\nUnfortunately, my choices were not reflective of the initial impressive view of this place.  My Ginger Spice latte was lukewarm and whatever syrup that was pumped in left a chemical taste in my mouth.  The Blueberry scone was dry and bitter, which is usually the case when the dough is left out too long.  I ended up picking off the top part spreckled with sugar and dumped the rest.\n\nI really wish my experience was better.  I do, however, appreciate the slight moment to rest my aching old bag back prior to heading back up to Nordstrom.  Hopefully, I will have made a wiser choice, such as a simple cup of the Lavazza coffee and a little yogurt next time.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-10", "description": "Strawberry nutella crepe is quite subpar. The crêpe itself is over-cooked and stringy (not soft) and too thick. There's way too much chocolate sauce and the sauce itself tastes nothing like chocolate. I couldn't taste anything but tortilla-like dough drenched in heavily-sugared-with-a-hint-of-chocolate sauce. If you go here, don't get crêpes. \n\nOther items might be good; I didn't try them. Convenient location. Large menu ranges from fresh juices and smoothies to ice cream, to-go sandwiches, bakery items (cheesecake, tiramisu, etc.), crêpes (which I don't recommend) and tea/coffee.", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-03", "description": "The chocolate chip ice cream barely had any chips in it. It wasn't the traditional black and white color, instead it was dark brown with some chips in it. Pretty disappointing. \n\nMy boyfriend got one of their crepes and it was way too simple. Nothing special. No ice cream in it. We needed to add Nutella to make it taste better. They were nice enough to give us Nutella  on the side for free.", "author": "Christina V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-07", "description": "I was ultra thirsty after a long run so everything tasted good.  I was just taken aback by the price- $8 for a 12oz or so juice.  Service was meh.  I was confused as to where to order and where to pay.", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-23", "description": "I've passed by this place one too many times and never gave it a shot. It's such a tiny little shop tucked away in the concrete and practically lost in all the craziness of downtown San Francisco. The only way you know what's there is the giant umbrella covering the sundae pictures which is enticing but not quite what a girl needs in December.\n\nWhat a girl needs in December is coffee though! Coffee coffee coffee. And if a place sells Lavazza espresso beans, then I'm a fan. I've found the selection of drinks and quality of drip coffee to be most excellent here and I've discovered my new favorite drink-the Depth Shot! Espresso + Coffee=Happy Girl. \n\nThank you thank you thank you Cafe Bellini.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "I had a lovely experience there,  the crepes were delicious! And their staff is absolutely kind and fast, i encourage you to go to this place and have a good time!", "author": "Johanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "havana coffee was a great choice. if you love a little sweetened latte, this is it. forget the regular caramel lattes that tastes fake as hell, try this one.\n\nthe patries looks delish too. will try next time. a little pricey but if you don't love the blue bottle acidity, then this is great.", "author": "Thankie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "Looking for a tasty treat to sneak into SF Century Theater last night for \"Coco Before Chanel\", I pass Cafe Bellini right off the Muni \n\nDecided reluctantly to grab a brownie, thinking it's going to be dry & tasteless but I hadn't planned enough time to browse \n\nWell let me just tell you that this was one of the best brownies I've ever tasted!! Super moist, chocolaty, decadent little square of heaven.....dark chocolate that was so rich, cakey but fudgey w/ creamy chunks of chocolate throughout.....not bitter & not too sweet \n\nTriple Chunk Brownie - you're now my all time fav brownie & I can't wait to sneak you into more movies!", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "For a quickie, this place does the trick. \nI just arrived from Seattle, and wanted to have a bite to eat, but nothing fancy. I asked them for a ciabatta bread sandwich, substituting their prosciutto with ham (I wanted a ham and cheese), and they did it graciously.\nI also tried one of their desserts, but I wasn't terribly impressed (their version of a strawberry shortcake).\nBut at least the West Field mall has free wireless :)", "author": "Gustavo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "It's a nice little eatery with good breakfast, brunch, and lunch offerings. Their cappuccino is extremely good, to the extent that BF felt compelled to ask how they made their coffee... He just got a \"from our machines\" answer LOL. They like to leave a strong coffee flavor and do not masquerade it with lots of steamed milk. Still, milk was poured in and lots of fun foam was present. \n\nThe first time I visited I went for the vegetarian crepe, and it was just heavenly. It had an array of vegetables paired with a fluffy crepe. There was nothing else one could do to improve it; it was perfect. It came with a spring mix salad, which I also enjoyed. BF had the Pan con Pollo, which he found delicious and small.. The small part can only speak volumes to the deliciousness because he enjoyed it so much, he wished he had more. We dined in, and service was optimal.\n\nThe second time I had the Vegetable Delight Omelet, and I thoroughly enjoyed it. It came with 4 pieces of 1/2 regular cut slices of toast, if it makes any sense. It also came with delicious potatoes from the griddle. It was really good, and it left me very full actually. Good to keep me going until late afternoon. BF had the Prosciutto Ciabatta, and he considered it to just be okay. Again, we dined in, and service was excellent.\n\nThe third time, regrettably, was our breakfast before we returned back home. I don't know if the establishment read our mind set of \"regrettably\" because the service was not our usual top notch experience. The service was regretful. They were full, and we decided we did not have enough time to dine in and catch our flight. Therefore, we ordered to go. I ordered the Eggplant and Mozzarella Ciabatta, which I found okay. It was good, but it didn't blow me away. BF had the Pan con Pollo again, and he loved it. They took a long time to give us our food and it didn't come with fries, only if you dined in they included it. Also, they had to be reminded we ordered cappuccinos, but at the end they delivered. Additionally, I had ordered a fruit tart. When I got to the hotel, I noticed I had been given actual fruit. I was like \"what?\". I went back and told them I had ordered and paid for a fruit tart. They quickly exchanged the fruit for the right item. The tart wasn't even all that. I guess when they are really busy, the food and service are not the same.", "author": "Stephany R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-15", "description": "I LOVE HE WHIP CREAM ON TOP OF MY SINGLE HOT CHOCOLATE!\n\nSome slices of cake taste good, such average tastes! If you want a quick breakfast or dessert, go get stop by here.\n\nOh, I wanna try their imported drinks.", "author": "Calvin Nicholei L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-26", "description": "HAPPY HOUR: HALF OFF DRINKS every day from 4:00p - 6:00p.\n\nI came here the other day for an Americano. It was alright. I'm not complaining about the drink itself for paying half the price....\n\nHowever, Cafe Bellini was lacking a few 'essentials' in terms of its logistics. For some reason only Nonfat milk was available. Maybe they forgot to refill the 2% milk because they were busy? Also, where was the trash canister for used stir straws & sugar packets? ...Is the lack of one implying that we just leave our trash on the counter to make things dirty & unsanitary for our fellow patrons? OR to the considerate individuals: have to go through the bother to carry our trash to the nearest trash can we can spot?... Either way, annoying. \n\nOtherwise, excluding the minor inconveniences, the happy hour is a great deal!", "author": "Mari S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-26", "description": "Mall food is rarely above a three-star rating and that applies to the Cafe Bellini food station on the lowest floor of Westfield. There's little I can say about what I ate here, because it was that forgettable: a basic chickpea and kale salad that tasted fresh but absolutely plain/bland. No vinaigrette tang, no garlicky edge, nada. My friend ordered a panino with a small helping of a caprese-ish salad and said both were, \"Eh, okay.\"\n\nStill, I can't ever say no to a $4.50 lunch! (The salad is priced by weight and comes with a nice, yummy piece of soft bread.) My food wasn't memorable, but it's not a bad deal in the slightest.", "author": "James L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-27", "description": "After finding out dinner with a friend wasn't going to work out due to a family emergency, we kicked it here for a few minutes before leaving. The place is literally a 360 counter with a few tables scattered in the area to catch the mall passer by. They do seem to have a large selection of snacks but we didn't try any before hitting dinner. Got a decent iced chai and a spot for a quick catching before heading on our ways.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-04", "description": "DONT DO IT. \nSo many better small companies to give your $$ to. \n\nThe pastries dont do it for me (pastries that come in a box? no thank you), and their prices are ridiculous for what they give you.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-07", "description": "Service was horrible. It took forever to get the food and we had to practically beg them for a glass of water. My boyfriend got a side of ham with his veggie omelette and they gave him three slices of cold-cut and still cold ham. Who would want cold ham with their breakfast?  My panini ended up being a cold sandwich made w hamburger buns.  Menu looks great but execution is awful... Not worth your money", "author": "Megan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-23", "description": "cafe bellini is an isle in the middle of the food court. pay at the cashier and someone gets what you want and gives it to you at a designated station (which is marked but unseen till it is pointed out to you).\n\nmenu: coffee, lattes, smoothies, italian pastries, paninis, froyo,\n\nfroyo review only:\npricing: not listed  cone:? sm (2.98) lg (4.07) toppings offered, no price listed. toppings not in plain sight.\n\nfrodrips:\n-taylor dispensing machine, small  3 oz plastic cup\n-no chocolate, only vanilla available. \n-froyo soft, very sweet, somewhat icy, was water needed to mix?\n-wacky wabbit wating, 1 star.  pricey  only adults can afford to come here.\n-yoppi on 2nd floor has better froyo.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "Went here like three times when i was in SF!! We just had breakfast though, but it was sooooo good!!! The desserts are super duper tasty as well. The staff was very friendly, and the service was pretty speedy. I like the location of this place as well. Double yumm! :-)", "author": "Lilian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-22", "description": "This is the bakery/coffee shop located in the center of the concourse level at SF Centre.  This was the place where someone jumped from the main level and hit their awning and broke their expresso machine a couple of years ago (I think there was even a Chron article).\n\nAh well, that's neither here nor there.  Anyhoo, they sell cakes that look very much like Cafe Madeline's and Cocola's.  Only they are much cheaper ($4+ compared to Madeline's $5+) and bigger.  I ordered a Raspberry Chocolate Marquis.  It was very fresh and oh so yummy!\n\nI notice that they also sell quiche, sandwiches and other lunch items.  They also have lunch deals.  For $6+, you get a sandwich, soda and chips.  Not bad!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-14", "description": "The food and pastries were alright here...they def looked good but I wish I could say the same about the taste. However the kids seemed to enjoy the flat pizza and bread pudding.", "author": "Zaynaf S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-25", "description": "Came here while shopping with a friend in SF since we wanted something different than the foods offered at the Westfield mall's food court. \n\nWe shared a ciabata parma panini and a calzone with mushrooms, cheese, beef, and proscuitto. The taste was pretty decent and the panini came with great fries! The fries were big and crunchy, and you could taste the real potatoes in them! The biggest disappointment was the size. The calzone was about $14 but was about the same size as the panini. The taste of the foods wasn't extraordinary for the prices that they charged. Overall it was a decent dining experience but nothing about the place stood out.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-06", "description": "Remodeled. Reheated.\n\nAnd yet still a very good barbecue chicken sandwich. About eight bucks. Loaded with chicken plus the ever so loved sauce.\n\nFresh sandwiches are available too along with a host of other breakfast and lunch items. Overall nothing fancy or memorable. Just quick, friendly and good.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-25", "description": "Stopped by the cafe Sunday morning, September 23rd around 10:15 and ordered a croissant to go on my way to work. I know that the pastries are fresh baked daily which is why I stopped by. Once paid for and stepping away I pulled off the end of the croissant and got a hard and tough mouth full. I knew that it should be better and returned to the counter to enquire about the freshness of the pastry. I was assured that it was freshly baked and that no pastries from the previous day were in the cafe. I said that the croissant was tough and did not taste fresh. The woman who seemed to be the manager behind the counter repeated herself about the freshness of the item I had purchased. Her attitude came across that there is no problem with what I had purchased. She dismissed my inquiry with a smile that said \"you don't know what your taking about\". She did not even try to test the pastry for being over-baked or dried out. I have no idea why a fresh baked pastry would be tough and chewy, Especially a flakey croissant. The manager was so stead fast that there was no other option - I tossed the white bag containing the rest of the pastry on the counter and said \"It's not worth eating\" and turned and walked away. The customer service by the manager was poor, she was rude in her attitude and she had an attitude that she knew best. She is not someone that I would want representing my business. \nNeedless to say I will never return to this cafe to be treated like that again.  All I wanted was to have a freshly baked croissant that was not over cooked and dry. I headed to La Boulange where I had got a fleshy baked flakey croissant that was so buttery it made me happy that the first one was not good. Anyone looking for a better pastry option should walk over to the Metreon and have a better experience that Bellini. Yu will be met by friendly staff and freshly baked pastries. This morning my croissant was actually warm from the oven!", "author": "Douglas R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "After ice skating, we were freezing cold and wanted to get a hot beverage, preferably hot chocolate. We didn't want to sit at Cheesecake Factory and order just 1-2 things, so we strolled around the city and we accidentally found this little coffee shop! We got 2 hot chocolate-Simply delicious! I was glad it didn't taste like instant hot chocolate! We also got the spinach Feta Puff and the Almond Cake with Flax Seed. It was a perfect late snack after our strenous ice skating date. They have a lot of pastries, too!", "author": "Jojo N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "Happy Hour!  The barista is so nice!!\nI love her accent.\n\n-1 star for crazy pastry prices.", "author": "Phil M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-26", "description": "Got the energizer juice.  Not bad, fresh ingredients, but nothing to write home about. The server was very nice.", "author": "Julianna K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-11", "description": "Meh, mostly a tourist trap. This place survives because of its location, not because of the food or service. However, the to go line is a viable option if you're in a hurry and staying nearby.  Eeks out that third star because I would grab something to go in an emergency.", "author": "Bill W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-29", "description": "This is a great place!!! Low expectations as the entrance is a sandwich place but don't be fooled very delicious. Portions just right enough to finish the plate and want to come back again...", "author": "DAMIEN I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "Very good food. The crepe are very good. Service was okay but food stagered out to the table and I didn't recieve my crepe for 45 minutes.  Other then that it was great", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-14", "description": "Ordered the Super Combo Pizza and the highly recommended Bruschetta by Alicia which I later found out was prepared in part by Mr. Man.  I must say that Manny provided us with one of the best tables and a welcoming smile.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-03", "description": "Oh boy, I was beat tired after a day of walking all around SF Chinatown and shopping down in Union Square, and needed a place to temporarily sit and grab a java to keep me awake and kicking. \n\nTOTALLY bad choice. I got the white mocha, which they named to a more fancy title of \"cafe bianco\". \n\nLooked promising since the food in the display cases were visually tempting, but my coffee tasted NOTHING like coffee. At least it was piping hot... it tasted like the barista poured in 5 packets of sugar (the raw kind too) in my drink. \n\nThe only pick me up I got from this drink was maybe a sugar high that lasted about 30 minutes. :( Not worthy of the being called 'cafe bianco'.. I might as well have gone to Starbucks if I wanted to drink liquid sugar!", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-21", "description": "I have been to a previous location and I wasn't to fond of what I had purchased..soggy french toast=no. However,at this location staff are friendly and the the food on display looks yummy.Normally I would not even look at the sweets(I had my eye on the sandwiches) but looked at the brownies and cheesecakes.I believe I was in a mood for something sweet so I thought I would embrace my sweet craving moment with a purchase of the New York Cheesecake. Even though the brownie winked at me and wanted me to pick it I had to go with the Cheesecake.\n\nLet me say that thischeesecake was creamy,very yummy and not that expensive by the slice.I mean it is in a mall,but atleast the service was good overall and made my sweet tooth very happy.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-18", "description": "Formerly known as Segafredo.  There are few things I cherish more than munching on a warm Chicken Club sandwich here after a couple hours of shopping. Okay, maybe that's a bit of an exaggeration...but these sandwiches are GOOD.\n\nWhen I shop in SF, I make a point of trying to stay until after 7:30 ish so that I can get a sandwich half-off at Cafe Bellini. They Panini-press these sandwiches so that the cheese is all melty and the bread is toasty...and yeah...so damn delicious! I've had the tomato mozzarella at the UCSF Parnassus location too--yumyum. \n\nMy favorite is still the Chicken Club though. Scrumptious quality chicken and bacon with tomatoes and melted swiss cheese. I'm a girl who knows her sandwiches and I say two thumbs up for Cafe Bellini's.", "author": "K W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "We were around union square and thinking of a place to get some dessert after dinner and we just passed by this place. my friends and i love our brownies, tiramisu and cappuccino cake, with our hot chocolate, mocha and coffee.", "author": "Anne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "I love this Cafe Bellini location. The staff is super helpful and very friendly. I also love the food options here. They are always stocked. The salads are delicious. I frequent this location at least four times a week, either for lunch or a snack.", "author": "Nava N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-25", "description": "It's ironic.. Their coffee is supposed to be good since they serve the Italian Bellini coffee. So, they either do not know not know how to make a simple filtered coffee or they are just cheap and they keep throwing water on the same filtered coffee. As a matter of fact, I just returned my 2.75$ cup. It's definitely a place for tourists. Their 8$ veggie bagel is not worthy either", "author": "Biemme B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "I was here for sales force and ate here every morning. Mimosas and bellinis are of course wonderful. The bacon onion precooked quiche was good (well precooked by an hour or so and still yummy) and best of all: the nutella crepe is a must!!!! Service was good at the counter and amazing in the restaurant. There was a slight hiccup and the waitress couldn't have handled it better and made my day. The manager had to know how good the waitress was and then she herself made it even better! Definitely, come here and support them.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "Lavazza coffee is rarely disappointing. \nMany hands here made me a good espresso so you can pretty much trust them. For $1.75, it is worth stopping for a little cup.", "author": "Dario B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-09", "description": "Came back here again caus I noticed that with a student ID you get a discount! Got the blueberry italian soda...only to find out that they were out of blueberry five minutes later. You'd think they'd keep track of inventory/know what they had a little better...but i just got blackberry instead. It was okay.", "author": "Melody L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-27", "description": "If I can shut this place down I would. If I can give it a - 5 I would. The servers are EXTREMELY rude. I am a student and I can't tip big bucks but I do what I can when I have money. After a good meal the server brings the check and leaves. I pay the amount due via debit card and leave 3$ for tip. The server comes back and disrespectfully asks \"Is that 3$?\" I tell him yes. He picks up the receipt with his index and middle finger and throws the receipt on the plate which I was eating from. I was speechless. I got up, and left. NEVER GOING BACK TO THIS DUMPSTER. I HOPE THEY SHUT THE PLACE DOWN.", "author": "Taibah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "4 stars for pastries & drinks.\n\nBuy your GF a pastry, guaranteed PANTY DROPPER.\n\nI used to heart the pesto salad because I heart all things pesto, it had a somewhat creamy consistency to it, and satisfied my taste buds to a T. HOWEVER, I recently noticed that the pesto salad didn't taste as it used to. =(\n\nI tried to convince myself that it was a one time thing, but\nto my surprise it was NOT. It doesn't taste the same! WHY!!!\nIt's bland, kind of sourish. IDK. All I know is that it better not have been\nspoiled in the few instances (plural) that I've searched for the same taste I originally fell in love with. I usually get it to go and never really understood why they put it in a small plastic container and not a box, like they do with the other pastries. \n\nTheir \"homemade\" tiramisu was nice. The cake was soft and fluffy (sorry lack of a better word) and you can definitely taste the espresso, but it wasn't overpowering.\n\nI've also tried the Strawberry Exquisite as a potential antidote to a horrendous day and boy did it lift my spirits.  DELICIOUS-O. Soft, creamy, fresh, & not too sweet. It came in a very small circular personal cake. Presentation was muy BONITA. What more can a girl ask for to cure a poopey day.  \n\nMint Italian soda is coo, but the Orange White Mocha, Coconut Frap was BOMB! The oranges were freshly squeezed (saw it for myself). I've never tasted a chilled beverage that tasted SOFA  KING GOOD in my 26 years on this planet.\n\nKinda pricey, but worth it, with the pastries that is.  Excellent customer service. =D", "author": "Eddi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-21", "description": "i would give them a one-star rating based on their coffee alone. their lattes are some of the worst i've ever had. either they have absolutely NO kick to it and taste like milk, or they burn the espresso really badly. ick.\n\nbut...their almond croissants are AMAZING!!!", "author": "Caroline I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-21", "description": "Get the Peach Italian Soda--it's the best!", "author": "Charles M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-23", "description": "Stale!!! They massacred my biscotti like they were old stocks. high-priced but undeserving, well yes i know its SF. WTH, not worth it. so i had to buy two sparkling waters just to get their minimum price limit. \n\nthumbs down.", "author": "Athens r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-14", "description": "$6.52 for an egg and cheese bagel! It was decent for a quick bite walking around Union Square, but definitely over priced!", "author": "Paul D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-08", "description": "Find them at the food court at the Westfield Shopping Center at Powell, dead center.  If you find yourself standing behind the ropes three feet away from the museum of chocolate, custard, fruit and other diet-sabotaging pastries, you've found it.  Talk about sweet selection.  It took me a few seconds to realize that these people weren't in line and I should be on the other side of the rope to order a Caesar salad.  I did so from a smiling counter person and it was about $7.00.  It wasn't bad.  The lady actually making the salad asked if I wanted the dressing on the side or mix it all in.  That was nice of them to ask.  Yeah, poor it on!  Pretty good.  Even around 2 PM, it was a little difficult to find a table.", "author": "Bernadette M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "I eat here pretty much every day I work. Partially because whatever I get seems to be pretty tasty and also because the staff is so nice. They pretty much know my rotation by now ( caprese salad, quiche lorraine, roast beef sammy) by now and they always make good small talk with me while we wait for my receipt to print. They even give me my mall discount as a default, even when I'm not working.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "During one-week stay in San Francisco, we went there over 10 times.\nCafe Bellini was our first and last stop almost every day. \nFinding European quality food, with American customer service in the mall is like finding water in desert \n\nTheir mini sandwiches were my favorites.\nThey also have fantastic pastry; they were always fresh, and not too sweet. \n\nIf you are health concerned, and enjoy European food, you should try this place.\n\nWe loved every thing about Cafe Bellini", "author": "maryam r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-20", "description": "I've never eaten here, but I'm a regular morning-coffee patron.  The staff is friendly and efficient, and to my taste, their espresso drinks are the best to be had in the Union Square area.  Reading some of the other reviews here, I can see that this is a matter of opinion but... I enjoy the place a lot so I wanted to cast my vote.", "author": "John M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-01", "description": "Awful service. The waiter totally misguided us about the serving size of the pizza. We had to wait for several minutes for a to-go box.", "author": "S R."}
