{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I have rarely visited a cafe with such good coffee and food as this charming destination. It's specialties are surpassed only by their kind and wonderful employees. I have been here many times and happy to say that I have always been treated with respect and care. I give 5 stars only because I cannot give more. I'm so happy to be a small part of the clientele of this wonderful place. I wish them all the best and my days are brighten by spending time in this terrific establishment! So much so that I will sign my name to this post. Thank you and I'm glad to be a friend of your cafe!\n\nSincerely,\nRyan Hallerud", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "5 stars is for the folks who run this place! They're observant, friendly, and highly helpful. The owner noticed I got a to go box whereas my cousin got for here. So the owner asked if I needed to replate my items for here. Super cognizant! Thank you\n\nI got a 3 salad combo\n\n-potato salad\n-brussel sprouts\n-fruit\n-cousin got the arugula salad with beets, walnuts, chicken and another item\n\nA good place to go for a quick bite or to enjoy the SF charm!!!", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "You need caffeine. Maybe you need a nice place to have a chat or get some work done, a place to study. You're near Montgomery BART or somewhere in the Financial District. \n\nYou want a good cup of coffee, maybe even a proper pot of tea, or a solid, healthy lunch. You want friendly, chatty people who will remember your face, maybe even your name or your usual order. You want ambience, service, live plants, interesting architecture, fresh-made, healthy, even indulgent, real food. \n\nDon't go to Pete's. Don't go to Starb's for buck's sake. Don't, for any reason, go to the fracking robotic coffee place around the corner. Because you don't want San Francisco to turn into a robot-coffee, Starbucks-zombie, nightmare, do you? DO YOU?!\n\nYou want Caffé Bianco. You want it bad. You want our city full of places like this, places with old-school charm and real conversation, and you know you're lucky to be alive right now, while there's still one left. And you better go spend some money there, make sure they make it, vote with your dollars, because if you don't, and the robots take over, it will be all your fault.", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Today I came here for my first time, and will definitely be coming back. It has a spacious interior with an airy feel, plenty of seating. There were a few outlets along the walls. The avocado smash is amazing! They serve their lattes in the European style glass mugs, and the coffee is strong. If you're looking for a quieter coffee shop in the Financial District, this is the place to go.", "author": "Mary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Soo delicious! The most serene spot to grab a bite to eat. The food is soo fresh and delicious! The pesto goat cheese vegetarian sandwich is creamy and flavorful and totally hit the spot. I definitely recommend this place! The ambiance is light and airy and makes you feel like you are in a Parisian cafe.", "author": "Madi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "I was walking down Sutter, trying to find a place to eat... And lo and behold I looked to my right and I found this beautiful little café. I walked in, and they had avocado toast on the menu! So of course, that's what I ordered! The place is very bright and airy... Very clean, if you stay, they give your coffee to you in a beautiful mug. They also had an upstairs seating area that was more like a loft. The music was jazz, The staff was very nice, it seemed like you could also come here and get a salad or a sandwich or something. I Will definitely come back here!", "author": "April C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Pros: A lot more spacious seating than expected. \n\nCons: This cafe is hidden! No easy visible signs or address and since it was my 1st time there I walked passed it twice trying to find it. Pretty long wait during lunch time obviously but it was surprising for me that they didn't have any of the order ahead app meals ready. My order through Ritual and a bunch of Meal Pals orders needed at least a 10-15 min wait for them to make it. Took about 20 mins for my friend's juice to be made too. She had to get up to check on it twice and at one point the waitress had to come over and asked again what was ordered because they couldn't read what was written down. Seriously?!\n\nOrdered: Havarti & Dill Sandwich through the Ritual app. \n\nWould I recommend: Meh... Food was mediocre at best and the service was just super slow.", "author": "Terry N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-19", "description": "EU style cafe i.e. small tables ;-) with good food...seating on two levels...liked the fresh OJ...liked the choc croissant and the egg, cheese, avacado wrap in lavash bread.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "This is a hidden gem...quite literally, it is hidden along Sutter in a very inconspicuous string of random stores.\n\nFirst off, the service was friendly and prompt. The gentleman behind the register asked if I had been in before and if there was anything in particular I was searching for - not in a pushy way, which can be the case when you stand and stare at the menu for ~45 seconds. The two customers who came after me were clearly regulars, and he said \"the usual?\" to both of them. Love a place like that - great customer service.\n\nNext up - the price is great. Smoked salmon bagel sandwich + large iced coffee for under $9. Can't beat that in SF, much less in the financial district.\n\nAnd finally, the food - the bagel was better than many of the bagel-only shops around, the smoked salmon was fresh, and the coffee was strong and delicious.\n\nI will definitely be coming back here for more takeout breakfasts. The room is cute, so I imagine that staying is equally nice.", "author": "Katherine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "This is my go to place to hangout, work, and grab a bite to eat.  Whether you want a sandwich, soup, dessert, coffee/tea, or drink, they've got a selection.  What I like most is the free wi-fi (with a code from the staff) and service.  \n\nThe son of the owner has exceptional customer service.  Although the Morning Glory is healthy, the ginger and tumeric might have been a bit strong for my personal taste.  Thus, I asked for an avocado smoothie that wasn't on the menu.  Not only did he make one, but gave me another experimental one for free given his desire to optimize his recipe.  \n\nThe music fades into the background in a way that allows you to work and talk.  Even Toastmasters have conducted training sessions upstairs with the tables reserved.  Plus, they offered free cookies, brownies, and treats too!\n\nThis \"white cafe\" is full of character to make it not bland at all.  I'd come back time and time again just to try every item on their extensive menu.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Great service, good coffee and breakfast options and a lovely space. It is one of the few places I have found in the financial district for a breakfast meeting or morning work session. It's an actual cafe--not a coffee bar.", "author": "Amy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Cafe Bianco was my go to place when I was working in the area. Convenient and delicious! To top it off, the owners remember you by name and your orders if you're there regularly.\n\nThere are plenty of places to sit here. They have an upstairs area which is quieter and a great way to get away at lunch.  \n\nIf you're here for breakfast, their breakfast burrito is a solid option. You can add sausage or bacon to make it heartier! The burrito isn't huge, but big enough to keep you satisfied till lunch.\n\nIf you're here for lunch, I definitely recommend their wraps for filling lunch. You can also select pre made items from their salad bar all of which are pretty delicious as well. They also have yummy soups for a lighter option!\n\nThe service can lack sometimes when they get busy. Definitely order online if you don't want to wait and avoid lunch crowds.", "author": "Mehak D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Great coffee and ambiance. Wifi, charging stations, calm music, plenty of places to sit, has a classic coffee shop feel. Unfortunately, not so good muffins. I love to sit here, I just don't order muffins!", "author": "Rashmi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Amazing food, great ambiance. You have to try the vegetarian goat cheese sandwich. The owners here treat you like family. Highly recommend place!!!", "author": "Nima S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "This is the place where people pop open newspapers in the morning, where plants grow in the windows to mask Market St busyness, and where regulars line up for their \"usual\". \n\nLow-key French-bistro vibe suits the space well, and there's an upstairs if you really want to get away. Good coffee, great people.\n\nHidden gem fa sho.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "Pretty good place for a smaller breakfast on the edge of the Financial District.\n\nWe arrived with no one in line and placed an order for a pumpkin muffin, OJ, coffee, and oatmeal.\n\nThe muffin, coffee and juice were given to us right away while we had to wait for the oatmeal. I'm not sure if the main guy was getting flustered with all the other customers who came in after, but the oatmeal took quite a while to come out. I think there might have been another worker who was doing all the egg orders. \n\nAll the food items were quite good. If you like loaded oatmeal, this is your place - bananas, raisins, nuts and a ton of other stuff. The muffin had the right amount of pumpkin flavor with a little crunch on top. The orange juice was super fresh and sweet, reminding me of the same juice that we had in Barcelona. I wish I could drink that every day.", "author": "Cassie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Love this spot. Food quality and staff deserve 5 stars. \n\nThank you to the family for great service.", "author": "Jake L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Great lunch place! I got their Italian salad and it was perfect! Light and tasty!", "author": "Dan N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "I have only been ordering through meal pal from Caffe Bianco. I have had their Chipotle wrap and Arugula chicken salad, which were really good! The chicken Caesar wrap was not that great. Too much garlic with rare chicken pieces. I threw half of it as it had a very strong garlicky smell. I love garlic btw, but this was way too much! Cappuccino is OK. I love the vibe in the restaurant and the younger guy is nice and friendly. Also, they don't give a to-go box if you ask for one if you're ordering through meal pal. One time the wrap was so juicy that it was leaking all the way back to my office. Not a bad place, do give it a shot!", "author": "Ano N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "I ended up here after a very disappointing americano experience at a different chain coffee shop the previous day. Needing to reaffirm my faith in a good pull of espresso I ordered a hot americano with the housemade vanilla syrup. It was delicious! I loved the cup it came in. \n\nI took my americano and my bagel and sat by the window with my dad. The place reminds me of the east coast, which, being from Arizona, is a wonderful thing to find. \n\nThe staff was very helpful and obviously cared deeply about the cafe.", "author": "Tori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Basically a bakery/Café with some yummy sandwiches. They are definitely not gigantic sandwiches, but tasty and filling nonetheless. You can order takeout directly from Yelp which is a great feature. I have tried the prosciutto sandwich and thought the bread was airy and delicious. Ingredients in the sandwich were also fresh and tasteful. Overall, I highly recommend sandwiches here based on my experience.", "author": "Chris O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "This is a nice quiet cafe. I ordered the scrambled eggs, apple sausage and sourdough toast. Eggs were made to order which was a plus. It only cost $7.05 for a good meal.", "author": "Rommel Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "In addition to the authentic Italian cafe vibe, neighborhood feel, and friendly staff, I also love the food here. As a 2-3 day a week regular I have the option to alternate between the 3 salad sampler (choice of homemade kale salad, marinated giant white bean salad, brussel sprouts, Russian potato salad, arugula salad, and whatever else they come up with that day along with a side of chicken breast), the prosciutto de parma sandwich (add turkey), as do many others on this thread and lastly they have a vegan hummus wrap (also choice to add chicken) which is unrivaled in the city. \n\nIn my journey towards a perfect balance between healthy, happy and within budget I haven't found any other lunch spot in the city that compares. \n\nFrom what I've heard the revamped coffee/tea offerings are great as well (not a big coffee guy) and i occasionally dabble in the fresh pastries.", "author": "Ramsin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "Decent lunch spot. I love their prosciutto di parmo sandwich. It's so filling and a great value for your money. It's a toasted ciabatta roll with generous portions of prosciutto, mozzarella, tomatoes, and a great basil pesto. I usually get it with mealpal. \n\nI tried their organic arugula salad. It was okay... I wouldn't pay for it if I wasn't on mealpal. It's a mediocre arugula salad with cranberries, chicken, and blue cheese. Not enough chicken and blue cheese in my opinion. Pretty unoriginal.\n\nI would definitely come here for the sandwich though. Great space, convenient Fi-Di location.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "In the City for a meeting and had a little time and looking for coffee and. lunch.  So glad I stumbled upon Cafe Bianco.  Friendly service, quick and clean Caesar salad is excellent.  Jazz playing low in the background. Perfect place to relax for a few minutes before my meeting.", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Eggs, toast, sausage, wi-fi, OJ... great mood. What's not to like!? This place is a throwback that focuses on service.... REAL service not overzealous \"do you need your glass filled 3-times\" service. I'll definitely be coming back here for breakfast or perhaps next time I'm going to test their cocoa and grinds.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Love this place! I come here as often as I can. Great selection of soups, salads, sandwiches, and pastries", "author": "Jason D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "This is a cute cafe with yummy food! Ask for the avocado toast it's really good! The people that work there are a little rude but meh at least the food is good. Coffee is aight ..not like the best thing in the world ..but its a good place in general.", "author": "Divya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Always a solid lunch time choice. It's never crowded and there's always plenty of space to sit down and eat. The upstairs is a great place for a quieter lunch.", "author": "Miss'e O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "No place has a better atmosphere for FiDi lunching or coffee break.  I have eaten here only a few times on MealPal items and I've liked what I had; chicken pesto sandwich and a chicken Caesar wrap.  I'd probably give 3 stars but the extra is for the cool dining area upstairs with old school feel.  Nice workers, though prepare to wait if busy.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "SO GOOD! Overall just a great choice. The food is awesome and the staff is even better. The owner and his son are always so accommodating. I work in the same building as the caffe, and even though my company gets catered lunch, I still come here almost every day! The peppered turkey melt sandwich is to DIE FOR!!! Definitely check them out if you're looking for something new!", "author": "Courtney P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-09", "description": "Slow service and disappointing portion of food.\n\nI ordered arugula chicken salad via MealPal. I was set to pick up between 12-12:15; arrived at 12:13, waited in the long line along with other MealPal customers, and got my meal until 12:33. This long wait totally violates what \"ordering in advance\" is for; hate to see if MealPal brings the \"Groupon effect\" to this business :(\n\nThe salad tastes fine but super small in portion. I paid ~$7 to MealPal for this lunch while the portion worth like...$5?\n\nOh... and when I got my meal to go, they ran out of forks. Only if they weren't short of staffs...", "author": "Ya-Lin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-11", "description": "Probably the worst service in the city.\n\nAfter many bad experiences and multiple second chances, I just had yet another unacceptable experience.\n\nMy boss asked me to join him for lunch here today, and I reluctantly accepted.  He ordered a chicken soup and salad, and I ordered a BLTA with chicken added.  Soup and salad were provided right away, and we sat to wait for my sandwich. After about 18 mins sandwich still did not come.  I checked a few times during that time and was told it was on its way.  When I checked again, I was asked if my order was Avocado Toast.  At this point, I asked for my order to go.  About five minutes later I was handed a sandwich.  I turned around to talk with my boss and another person, at which point another customer tapped me and said I think they are discussing you being given the wrong sandwich.  Shortly after a person came with a new sandwich in hand.  I swapped the sandwich and was on my way back to the office.  Once in the office, I found a Prosciutto sandwich... NONSENSE!\n\nThis is one of many bad experiences including ordering a pre-made salad and having them sell my portion to another person before they could deliver to my table.\n\nThis place sucks!  I'm not going back!", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "PROSCUITTO #1 SANDWICH\nProscuitto, pesto, tomato, and mozzarella. So good.\n\nConvenient location near Montgomery. On MOGL for cash back.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "I love getting my coffee and breakfast at this wonderful cafe. Today I got the egg, ham, & cheese on whole wheat with pesto and arugula but I substituted the ham for turkey. It is amazingly delicious. I highly recommend it. I love the coffee, white mocha, breakfast burritos, and quiches. Everything I have had here is delicious. I also recently had lunch here and tried the Mediterranean chicken wrap. YUM! It's delicious. So fresh and tasty. They also have this DELICIOUS almond toast (almond butter, sliced bananas, sprinkled with honey on whole wheat). That is actually my favorite breakfast here. The gentleman that run the register and take your order are always kind, friendly, and efficient. I really appreciate this spot as my morning go-to for coffee and breakfast.", "author": "Jamie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Good breakfast. Good lunch. Food takes a while but it's made fresh and the ingredients are high quality.", "author": "Ranjeev H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "This gem is smack center of downtown and located conveniently on top of the Montgomery station. It's a surprise to me how it doesn't get more crowded. Great spot to bring your laptop to work in and there are plenty of food options, too, for when you need breaks between work. \n\nBest part is: this place is run by incredibly friendly people. They always greet me when I enter the cafe. And they didn't mind us taking our time hanging out in the seating area upstairs.", "author": "Yad L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "They need to work on delivery time, but really good chipotle wrap. Not going to order delivery again but may stop in.", "author": "Ann M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "First time check in but I have been there since 'last year', \nThey have Doblet phone charger, so I can charge my phone whenever I am staying there which is very convenient. \n\nBesides, all the good thing, I order Espresso always, cause after 2 times trail, I am positive I won't fall sleep until late night with that. \n\nThe environment is my favorite, I always wanted staying longer. More than one time, I wish I knew the place while I first moved to SF. Cause it's next to Montgomery bart station, center of downtown, and just way better than franchises coffee places nearby.", "author": "Donna Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "This cafe is the bomb. Great food and coffee, awesome service, quiet and spacious with plenty of light and high ceilings. Light jazz in the background and a cozy upstairs area make it perfect for working or having a meeting.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-14", "description": "I ordered a burrito and a cappuccino. The cappuccino was well made and served in an old school glass. The burrito was not good at all. The potatoes were a bit raw and crunchy. I asked the guy taking the order to check the potatoes and he came back and agreed that the potatoes could be cooked a bit more.", "author": "A M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Been here a few times now for breakfast and lunch, and the people are incredibly nice here, or in my experience they have been.  I think it's a family owned business but can't say for sure.  \n\nI've mainly stuck to their sandwiches and you really can't go wrong with whatever you choose, especially if they have dutch crunch as an option.  You may have to wait a little bit for your food since they start preparing right after you order, so be sure to avoid the lunch rush!  \n\nOh, and if you have the Belly app, you can earn points for every visit!", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "I initially stumbled upon this place because it's so extraordinarily beautiful - or what I would consider a perfect work environment. The staff seemed apathetic and bored, expressionlessly took my order and gave me the tiniest cup of slightly mediocre [insert any coffee drink here] possible. The coffees honestly weren't great, and I struggled with finding vegetarian options for lunch, so ended up going the egg-cheese-on-bagel route (not bad). \n\nHowever, as I kept coming back for that pristine decor, the staff started to recognize me, warm up to me and started making conversation, smiling when I came in and remembering my regular [insert any coffee drink here]. I started staying all day, ordering breakfast, lunch and snacks throughout, as they graciously hosted me as I set up my mini mad scientist lab in a corner. \n\nThat being said, I still come in now not only for the amazing environment, but the super sweet staff - who I realize appreciate regulars and genuine conversation more than flashing a fake, overly polite smile every time you ask for a water refill. I'll take my mediocre coffee and egg-cheese-on-bagel here all damn day.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "I came here to grab a cup of coffee and I must say that I like this cafe. It is a great place to get work done. It is spacious (in the sense that it has a lot of 2-person tables) with an upstairs and downstairs. The service is fast and the coffee is great. I settled with a 20 oz. iced latte and I was happy with how it turned out. I will be coming back here the next time I want to get work done and when I am in the financial district area.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "I originally came in here due to them being on the Cups app; did I mention I dislike Starsucks?!\nThis two-storey Coffeehouse is awesome!!\n1st - they have pretty good coffee \n2nd - they play Jazz music, not that John Tesh smooth jazz muzak at SB\n3rd - the building is very European & indicative of Eastern European Coffeehouses\n4th - they have free WiFi\nLastly, it's a great place to sit & people-watch; especially on the second floor.\nI wish they stayed open past 6pm...\nI guess that's why I love Cafe Prague", "author": "Schmedley Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-19", "description": "Ordered an americano- medium and small contains 2 shots and the large contains 3 shots. \nQuiche Lorraine (5.50 -a slice) has some filler- probably flour, which makes it taste more like a cheesy egg cake. Filling is also all cake mixture and only the top is dotted with cheese and bacon (taste like turkey bacon) pieces. Will be back for coffee but not for their breakfast cake.", "author": "Derrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Found this place through meal pal. Got the PROSCIUTTO DI PARMA SANDWICH. Bomb. It's sooooo delicious. Definitely coming back here. Cute place with tables to sit at too!", "author": "Alicia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-14", "description": "So slow. It's painful to wait 15 minutes in line just to pay (with 3 people in front of you) only to have to wait even longer for your food. \n\nFood is solid but small portions. Do not come here with expectations of reasonable or decently timed service.", "author": "Edward H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Finally! A coffee shop with a real coffee shop atmosphere. Quiet, soft sweet (non-rock) music, fab service, clean bathroom, clean everwhere and hello--good coffee and excellent cappuccino. The place looks and feels like it's loved & cared for by its owners. A real gem in the FiDi where coffee establishments have all gone commercial, noisy and awry with bums here and there. Don't change anything--we love it here in your cafe.", "author": "Reena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Caffe Bianco feels much like it must have in the 1930s and 1940s when the financial district was a banking center. Spacious with soaring ceilings and old-fashioned marble topped tables and wrought iron chairs, it is like an oasis in the busy crush of downtown. I came just before close and had a tea and freshly made apricot walnut rugulah or rugelach, one of my favorite desserts. They were amazing, soft and buttery with just a touch of fruity sweetness. I could have eaten a dozen. It seems to be popular with locals who all know the staff by name, another reminder of a earlier time. If I'm ever in the area at lunch, I'll definitely give it a try. The owner said they were putting hardwood floors in soon which will be an improvement over the aging carpet. Sounds like just one of many improvements this business is always making.", "author": "Angelique L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "This place is a gem...\n\nThey don't make \"the best\" anything, but what they have is consistent grace, TLC, and wholesome food. The staff treats each customer like you live next door. There's jazz playing in the background, lots of natural light in the high ceilings. It's peaceful here. \n\nThis cafe is not a trend nor a fad. And all the better. I hope they outlast every juice place in fidi.", "author": "Lily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Great cheap eats (in SF$s :) just off market street. Friendly folks, fresh ingredients, great combos. Ya want more? Feggedaboutit. They make their own lemonade.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "Food was good, but they didn't provide straws with drinks in a home delivery. I would encourage them to think of the end to end experience of the customer, and include those smaller items like cutlery, napkins and straws that really enables eaters to enjoy a meal.", "author": "Blooming F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Super friendly and helpful cashier at 7:30 in the morning and a latte done right.  I know my day will start off on the right track if I come here.  I also ordered a tuna egg salad to go.  The drink and salad was good, but I did notice a few leaves that should've been removed.", "author": "Lynn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "I'm a regular! I love their salad bar because it never ever fails to disappoint. The staff are amazing too which makes it easy to go back. I can have lunch there every day of the week and still not tire of it. Oh and try their freshly squeezed OJ if you have the chance. Yummy!", "author": "Gitanjali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "A delightful oasis amid the hustle bustle of the financial district. Marble tables, high ceiling, large windows, and the relaxing, leisurely tempo of a jazz combo, played not too loud.  This place has a very civilized, European feel. The coffee is good and the food is fresh and carefully prepared.  Step in, get a coffee and something to eat, take a seat and feel the clock slow down a little.", "author": "J E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-17", "description": "Was looking for a nice place to have my one hour lunch. The place is super cute but the food was not good. I got the turkey melt. When I got the sandwich, I was wondering where the cheese was. Should have just call it a turkey sandwich. I normally wouldn't be able to finish a sandwich myself but I was still hungry after eating their turkey melt. It was served with a hand full of chips that looked like fries. Prices are high for the portion size. Services was kinda slow. Took about 15 mins for our food to come and 10 mins to order. There was only 2 people in front of me. Too long of a wait for me, especially in the FIDI. But the place itself is very charming.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-05", "description": "Cute cafe! I really like the fact they had an upstairs and downstairs where you can first order ur food and then sit anywhere. Really cozy :)\n\nDidn't order food but my friends wrap looked really yummy. Service was kinda... Cold.. And grumpy...\n\nBut other than that a nice quiet(er) part of FiDi to stop by for a quick bite.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-28", "description": "Salads are good quality. Will you get the value for your dollar probably not. The portion sizes were also very small. Not going back however my colleague loves this place.", "author": "Kam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Lovely cafe that has great ambience and food!  I got the salad sampler and it was so delicious.  The wait staff are super nice and attentive.  I was there all afternoon and the tables are being cleaned all the time.  Definitely the place to go if you want somewhere quiet to chat.  The music in the background was low and the patrons are more sophisticated than your average rowdy crowd.  It is a gem in the bustling heart of FiDi.", "author": "H. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "Caffe Bianco will never be extraordinary, but it's been there on Sutter next to the Flatiron as far as I can remember working in the FiDi. In fact, I recall having one of my first job interviews there back in ...oh never mind. Besides, I didn't get the job, but I don't hold that against Cafe Bianco. No, it's still a great place to get a chicken salad sandwich or some pasta for lunch. The high-ceiling, Continental-style decor is a nice change from the coffee chains and formica-friendly cafes in the area, and seating is rarely an issue at their tiny marble tables.\n\nI came in and had one of their $3.50 Egg Sandwiches with Cheese on Sourdough, which you see was quite generous for a supposedly light breakfast (see photo). The cappuccino is also $3.50 and comes in those huge cups just like you was the King o' France living in Versace ...I mean Versailles. Service is very serviceable here, and I do believe it's the only cafe in the city where the server asks, \"How's the WiFi workin' for ya?\" As you know, most cafes usually have some curt message on the table saying you have a time limit unless you order a succession of meals. Nope, I think they really want you to hang out at Caffe Bianco.\n\nFOOD/COFFEE - 4 stars...pretty generous if you ask me\nAMBIANCE - 3.5 stars...like I was in Versace or somethin'\nSERVICE - 4 stars...like I was the King o' France\nTOTAL - 4 stars...definitely a cut above the rest of the FiDi coffee stops", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "Caffee Bianco has an amazing atmosphere. It's a great cafe to hang out it (I would take someone to a business lunch here or for a professional coffee date).\n\nThe food is expensive for the price you pay (but hey, this is FiDi), and the service isn't great. It feels like the staff resents the fact that they have any customers coming in and bothering them, which is the biggest minus. But...\n\nSandwiches are delicious - Proscuitto di Parma I and II are both delicious, well-crafted and well-executed.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Have been going here for a few years now.\n\nPros: delicious fresh-made food. I especially like the salad sampler, and the Antonio's Wrap. \nPlace feels like a real European cafe.\nOwners and staff are very nice.\n\nCons: (which I think is a pro in a rush rush world) food is not instantly ready. But hey, that's why it's fresh, that's why it's tasty, and frankly I don't mind having my intensity reduced a bit, with a short vacation to Europe for lunch!\n\nThis is my \"go to\" place when meeting friends for lunch, when we need a civilized place to sit and chat, that doesn't break the bank.\n\nIt's also my go-to place for fresh salad to go: I'm a glutton for the salad sampler (choice of three of the salads in their display case, usually they have great kale salad, along with other well-prepared, healthy gourmet salad choices)", "author": "Josh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "When I want my Italian sandwich fix this is the place to be. Delicious food and love their coffee. The ambiance also reminds me of having espresso in Italy. Their workers are sweethearts. Alfredo is one of them. Love him. One drawback is the long lines at lunch. Food is worth it though.", "author": "Constantine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Nice cafe to handout, watch passersby, good music, decent coffee.  Big windows to watch the life of city.  Not fancy.  Friendly.  Many tables and the food look good and cheap for the city.", "author": "J I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-21", "description": "We went to this place on recommendation from a friend. Well it did not let us down. We had our coffee meetup here and there was ample place to sit down and chat. There are places to sit on the 2nd floor too to accommodate a larger group. The coffee here was delightful.\nThe Almond croissant was a little let down as I was expecting it to be sweeter. This place is moderately priced. Would not mind to go back again.", "author": "Kunal K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Hate to write this review --- why? The service is great, food is delicious and the price is right. You can get a sandwich which includes potato chips for less than $10, have meatloaf with spaghetti or just a cup of coffee for a reasonable price. You can enjoy the sunshine and high ceilings downstairs or hide out upstairs. A real delightful place. Catering too --- very reasonable. SUPPORT A REAL LOCAL BUSINESS.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "I have been coming to Caffe Bianco for years and just realized it was finally time to leave a review....Anu and Benny are the sweetest and most welcoming owners!  They greet every guest and really enjoy getting to know the regulars.  The whole staff follows their lead and the whole cafe becomes such a warm and cozy place to sit down for a morning coffee and pastry or a deli sandwich during your lunch break.  The Havarti and dill sandwich is my favorite but they have a really great selection to choose from.  I love everything about this place and  I couldn't image my daily routine without it.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "Went here a few times, owner with the mustache always seems to be in a bad mood. Have never had a positive interaction with him. Like their food and ambiance but not going back, tried to give the staff the benefit of the doubt.", "author": "J H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-10", "description": "Horrible service - long wait and they don't process their orders in order of receipt - 3 people who came after me received their meals before me - and I only ordered a turkey club sandwich! stay away if you're in a rush - don't let their short lines fool you - there is a reason they weren't crowded when we went there.\n\nredeeming qualities:\nchipotle chicken wrap was okay. \n\ntomato cheese olive side salad was good.\n\nturkey club was also good.\n\nfood was inexpensive relative to the city (lunch for $12)", "author": "Tweekie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Quite the FiDi gem. This is a fantastic, simple cafe with a nice balance of Art Deco charm, old wood fixtures, and a quaint atmosphere. Whether you want to power through some work on your laptop or catch up with a friend, this is a great place to do so without the distractions of loud, blaring music, too much noise, or tight spaces. The coffee and food are what you expect of a good cafe, but not extraordinary. The bigger draw is the atmosphere in a rather bustling part of SF.", "author": "Anil C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Pasta was good! I got the meatball pasta with bread. Wish I got more bread, but otherwise food was good. Loved that there was the right amount is meat sauce (yum)! The restaurant was very cute and quaint. Enjoyed sitting on the second floor with a view.", "author": "Ameera D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "The food here is great. It has become my go-to place for late working take-out dinners. There is a really good cook working back there, who seems to produce great things out of passion. (Right now, I'm having some sauteed vegetables and chicken, roasted Brussels sprouts, and a lentil+corn salad.) This place also has decent coffee, personable staff, and a very charming old world vibe and old school decor.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-09", "description": "Ordered a sandwich for lunch and asked what comes with it.  Was told \"either a pickle or chips\".  He never asked which one I wanted.  If I didn't ask, he never would have bothered to give me the chips.  So I said can I have a pickle and some chips?  He coldly looks at me said we don't typically do that, but today it's ok (as if he's doing me this huge favor).  So the sandwich arrives with about 7 potato chips and a measly SLICE of a pickle.  Not the typical deli spear pickles you typically get in a restaurant or deli.  Curiously, the person I was with also ordered a sandwich and not once did the guy offer him a pickle or chips.  So must be a big deep dark secret with this place and they only give it to you if you beg.  I've been giving this place business for over two years.  It's cheap service like this and the attitude you get when you expect more to come with a $9.00 sandwich than a paper napkin, that makes you want to venture out and take your business elsewhere, which I will.  Family owned business who just lost a lunch customer due to crappy customer service.", "author": "True Reviews S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Great place to sit down and enjoy a good espresso based coffee, breakfast or lunch. Great for a coffee/lunch meeting or to just escape the streets of SF for a moment.", "author": "Julie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-20", "description": "This place listed an all day breakfast on Yelp, but that's false.  This needs to be corrected.\n\nSecondly, if you want to see how to inefficiently operate a cafe, this is the place to go.  There's always a line, even though very few people are being served.  I went in during a pretty slow period, but I can't imagine how they handle the lunch rush.\n\nWill not good to this place ever again.", "author": "R L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "Tasty, nice staff, good location. Nothing to complain about. Perfect for a quick lunch and coffee", "author": "Filip S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "I don't know their secret to preparing kale, but their kale salad is simply delicious. I am not a big fan of kale but I love this salad.", "author": "Monica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "This is my favorite cafe in the city.  It is family run and they have terrific Italian coffee and an impressive selection of teas.  I love their breakfast burrito and they also have quite a few other very good breakfast options.  I like many of their lunch options.  They have both hot and cold sandwiches, wraps and salads.  The service is always fast and friendly. Every meal I have had there over many years had been great.  They have many tables both upstairs and downstairs so it is an easy place to have a business coffee or lunch.", "author": "Kendall F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "This coffee shop is my go-to for coffee at work. While it's not gourmet coffee, it beats the three surrounding Starbucks. \n\nI've probably visited this coffee shop 50+ times but haven't written a review. \n\nI'd probably go 50 more, if I hadn't tried their havarti and avocado sandwich. Add some chicken for protein and you have a delightfully filling sandwich. The havarti and avocado make a wonderful combination. \n\nThe staff take some time to make your food (5-8 min) so try to avoid the lunch hour rush. Bianco won't make the best place to grab a sandwich on the run.", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "Caffe Bianco has become a workday fav.  \nI work in the financial district and I always struggle to find something I can eat quickly because I can't eat gluten. \n\nThere are a milion and one coffee and sandwich shops around but this one stands out because it has gluten free bread, everything is homemade, and the selections are endless.\n\nThe service can be VERY slow but it's common sense, since everyone knows its all homemade, perhaps they shouldn't go directly at 12PM.", "author": "Kaylee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-19", "description": "It was a dark and stormy night...well, afternoon. Ducked in to grab some soup to go. Just one small soup. After watching for 3 or 4 people (not to mention the owner) wandering around at the speed of tortoise for about 8 and half minutes, I finally got my soup - after I heard the PING of the microwave. It wasn't even warm. What a rip. \n\nOh, and where were these \"nice people\"? Maybe they had the day off...", "author": "Mi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Charming ambience, great food and coffee, reasonable prices, and very friendly staff! Would come back in a heartbeat!", "author": "Kathie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "We did an 8 am breakfast meet-up for five people. The service was friendly, the food good, and the noise level low.", "author": "Philip G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "Decided to check this place out since it's close to my office. Food was good (BLT, Ceasar Salad) and was reasonably priced. Quick service and plenty of seating. Would recommend this place for a quick bite.", "author": "Jerry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "I'll open by saying if it weren't for the pace of service/prep, I'd give them 5 stars in a heartbeat.  Everything is handmade, fresh, custom to your order.  They have a wide variety of options, predominantly sandwiches, including soup, side salads, small dishes, and entrees as well.  \n\nBut they are definitely a little slow, and I recommend double checking the details of any custom sandwich needs just in case.\n\nToasted salami sandwich is great.\nLove the spicy chicken wrap.\nVegan/hummus wrap also a winner.", "author": "Jeremy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "I definitely have mixed (but generally positive) feelings about this place. It is my go-to spot for business meetings because it's close to my office, and one of the less-populated spots to sit down and have an informal coffee meeting. Their regular coffee tastes pretty bad, and the service is a bit slow--but I get it all the time anyway.\n\nHowever, their sandwiches are AMAZING. The Creamy Havarti + Dill sandwich is so delicious, that I don't care that it doesn't have meat in it.\n\nAlso the old man (who I think is the owner?) is such a sweetie and always offers me little samples. When I ask about what it is, I always get, \"It's good.\"\n\nCute place. Meh coffee. Amazing sandwiches. Slow service, but nice staff.", "author": "Elly F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "Good coffee. Nice people. .good looking fresh prepared food although I haven't tried it. I'm a sandwich in the afternoon or bagel in the morning person and need it faassstt. \n\nI got a bagel just this morning. ..The place was busy even at a quarter to 9 and it did take awhile for a single bagel to be toasted. But more disappointed when bringing it back and seeing it wasn't cut in half. Seems like a basic fundamental characterstic of a bagel and cream cheese sandwich. I noticed that Noahs is doing the same kinda lazy thing..now you have to request for a bagel to be cut in half...why?! It takes 1.33 seconds for the servicer to cut it for the service-see..so what I'm supposed to eat it in one big sandwich like a pig at my desk w/ executives walking by as i try to look professional or do I try cutting it at the office with a butter knife? !\nIt also could be I'm a little steamed that the bagel was tough. I know BREAD..i went to Culinary School just for the love of it and took six weeks of bread classes. And i know if the bread is tough it's either San Francisco sourdough or frozen, defrosted and kept longer than a day. \nOk I'll give them a break..i know they don't bake bagels fresh in the back daily..that's not what they do but at least have your bread delivered daily and throw out or donate old stale bread at the end of the business day.\nI'll try to be less harsh because they are nice people and the guy who appears to own it or at least run it, is hard working and really my bagels not the biggest deal. Just might not get a bagel there again. \nCheers!", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-12", "description": "Tucked in here for a quick lunch before my noon appt today. Very strange ordering/paying protocol. Seemed as though many were regulars. I felt as if I were either in Italy or some Mafiaso enclave in Philly. I got the special salad, arugula, blue cheese, dried cranberries, and either chicken or steak, for $7.25. Seemed very reasonable. The wait was a little long, but that's because they cooked up the chicken breast fresh. It was juicy and well seasoned with a bit of a middle eastern slant. Dressed perfectly, it was a little bit small, but all arugula for the greens. Whatever the dried fruit was wasn't cranberries. Some tasted like raisins, others like dried blue berries. I would have preferred cranberries. The blue cheese was scant, but turned out to be just the right balance. The wall was mirrored-perfect for a quick check to catch any errant greens stuck between my teeth before stepping back out", "author": "Diane B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-09", "description": "This place is so frustrating.  I simply said I wanted the am wrap which specified that it was made with lavish bread. The cashier, manager and food preparer each had to reclarify what I wanted. The food preparer asked me if I wanted a burrito, and I lost my patience.  I said am wrap. What did I get, still a freaken burrito. Don't ask me three times what I want if you're not going to listen.  On top of that,  make other people's order first because you are confused by mine.  It's too early for all this.  There's is a reason why I wanted the lavish bread and not a tortilla.", "author": "Gin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "Caffe Bianco does not have the best coffee in town, nor is the service as quick as you'd like but it's a great spot to sit down relax or meet people. It has the feel of a mom and pop shop and all the staff are wonderful. \n\nThe food is actually surprisingly good - the Harvarti sandwich is an office favorite and all their salads, pastries etc. are quite good and sometimes even delicious.", "author": "Neil W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "Located on Sutter, away from the grime and noise of Market St., Caffe Bianco is situated in a gorgeous gilt and marble shopfront with atmosphere to spare.  From the personal attention to the handmade fare, you get the idea that this is not a fast-paced, dine-and-dash establishment.  It's a great place to sip your espresso and people-watch from the cushioned benches in the bay windows or enjoy the view from the balcony of the quiet upstairs dining area.  Smooth jazz plays over the PA and the friendly staff will bring your food to your table if you dine in.\n\n  The food is prepared to order, and with a long list of ingredients there are thousands of options.  We ordered the lox and cream cheese bagel, a breakfast sandwich, and a substantial glass of fresh-squeezed orange juice.  Our bacon-and-egg breakfast sandwich was fluffy, flavorful, and served on a massive ciabatta roll, well worth the price.  The orange juice was almost as much orange as juice.   Comparable bagel shops may offer more salmon on their lox, but our bagel arrived quickly, dotted with capers and accompanied with Persian cucumbers.  The food wasn't cheap, but little more expensive and much higher quality than the fast-food options in the surrounding neighborhood.\n\nThose looking for a quick bite to eat may prefer to try their luck elsewhere.  There was still a significant line even after the 9:00 A.M. morning rush.  Although we ordered together, our meals arrived a few minutes apart, but the food was well worth the wait.  If you want a break from the crowds to relax and decompress, this hidden gem offers a leisurely cafe experience in an elegant setting.  An odd duck in San Francisco's hectic financial district, but that is half its charm.", "author": "L L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-04", "description": "I wanted to like this place. I have been coming here since the start of the new year. The food has always been pretty reasonable, despite waiting 10-12 minutes for my sandwich after I have ordered it. Which has happend numerous times. But what happened today, cannot go un noticed. \n\nI came in early so that I could beat the lunch rush. I ordered my food, paid and took a seat and waited for my food patiently. It usually arrives within 10 minutes. After 15 minutes without food, I asked an employee if they had forgotten my order. I was told no and that it was on its way. Another 5 minutes passed and nothing happened. I started to see more and more people getting their food and not mine. I was one of the FIRST people to arrive for lunch. Another 5 minutes passes and I again ask about my food. The server comes back telling me they LOST my order. After 25 minutes of waiting I find out that they lost it. I then waited another 5 minutes until my order was finally delivered to my table. 30 MINUTES after I ordered. \n\nThe sandwich was just okay, and so was the soup. The food wasn't very good and the service just made it taste even worse. Not to mention my bread was incredibly soggy. \n\nLike I said, I wanted to like this place, but I am going to be taking my lunch breaks elsewhere. They didn't even offer to refund my meal, nor did I see the owner Benny apologize for losing my order and having me wait 30 minutes for a simple soup and sandwich. \n\nP.S This isn't the first time I have seen this happen. I have also noticed they have lost other people's orders and made them wait longer than anyone should for a soup or salad.", "author": "Hillary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "This is a really cute deli/coffee shop in the heart of the Financial District. The sandwich I had was great and I can say the coffee is excellent. The guy who runs the place is really nice. It's a cool old european cafe vibe in terms of ambience. Highly recommend!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-15", "description": "I was looking for a quick place to grab a bite to eat before going to an appointment. What a lovely lunch spot with reasonable prices as compared to other places in the Financial District. I ordered a chicken salad sandwich ($6.50) that came in less than 5 minutes. It was so delicious-- although I think that may have been butter that was put on the bread! But still the chicken salad was very good. You can also grab pasta salad and other things if you need to get back to the office and don't have time to eat there.\n\nHaving a quick lunch here was nice because it's located around all of these beautiful city buildings, bustling area, it resembled Manhattan, a tiny bit. The decor on the inside is fabulous-- looks like a place out of the twenties. Go up stairs if you need to use the restroom and there is also more seating up there if you want more room or want a quieter place to sit.", "author": "Ally W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-27", "description": "Nice atmosphere and staff. I haven't found a beverage I like there yet. The pasta is  tasty. My problem with them is their refusal to fix the leaky sink in the women's room. When I mentioned it months ago the owner said they were fixing it 'this weekend'. A month or so later still dripping like crazy. I mentioned it again. More months go by and today I find it's still leaking like really bad. How hard is it to fix or replace a faucet?", "author": "Ramani C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-18", "description": "GRUMPY, RUDE OWNER!!! WILL NOT RETURN...\n\nI am repeating what other reviewers have said... the food is bland, mediocre, and overpriced, ambiance is lacking, and the owner is a mean jerk!\n\nI've been coming here because of convenience, and have always been friendly and tipped well. \n\nHowever, the worst part is how rude and mean the owner is!!! He has a nasty attitude and makes you feel like crap. He always treats me like I'm stealing something, or bothering him! \n\nEvery time he's given me a glaring, dirty look and hostile vibe, I've brushed it off... thinking it was just a bad day. Well, it's happened EVERY time I'm in there now, and I am no longer going to support this business!\n\nNothing worse than spending money at a place, only to be treated in a degrading manner. There are PLENTY of other establishments in the area where I can get a coffee and not get treated like a piece of crap.\n\nGood riddance! With all the new spots opening up in the neighborhood, it's only a matter of time until this one bites the dust... FUCK THIS PLACE.", "author": "Judah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "I basically never write yelp reviews, but have to for this place...  \n\nI've been coming here for over 3 years and it actually brightens my day each time that I do.  The owner and staff are all so kind and friendly, welcoming me like a friend each time I come in.  The ambiance is almost equally warm - with plenty of seating and wifi.  It's like the 'Cheers' of cafes!  \n\nAside from all the warm fuzzy, the coffee is also excellent (a plus that they serve almond milk without having to make a special request!) and I never seem to tire of the egg white breakfast wrap on lavash!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "Last Monday noon I found myself hunting the streets of the financial district for a \"clean, well lighted place\" I could eat and read. \n\nThis place fit the bill!.The sandwich and cappuccino I ordered hit the spot too!", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "This a cute little cafe. I ordered the egg sandwhich for breakfast. It was tasty. You can order your lunch using the gopago app. On another visit I got the veggie lasagna and it was good. They have these little pastries that have apricot inside them. I'm not sure what they are called but they are sooo good. The only down side is they are $1.50 each and it's not that big probably the size of a donut hole. \nI will go back here again. My co-workers like it too.", "author": "Jeanie Ann D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-17", "description": "I was excited because they said they had wheat tortilla.  I ordered an egg white and feta cheese breakfast burrito and added avocado for $1 (total was roughly $5.70 with tax) to go.  I should have checked it at the cafe but how could they really mess up my order? Well they did. Not only was the tortilla wrong, there was no avocado.  Lame.  They get 2 stars for getting the egg white and feta cheese right.", "author": "Mari Dani B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-24", "description": "This place is unfortunately not that good.  Once I had a BLT that really hit the spot, though.  However today I ordered an egg white + turkey bacon tortilla wrap and instead got a regular scrambled egg with a slice of turkey for a sandwich.  Gross.  When I got my food  the cashier who took my order (and who I saw explain in detail to the chef what to make me) was nowhere to be found.  I also had already waited forever and didn't want to make a scene.\n\nI always feel like supporting this throw back Italian SF caffe, but honestly it's worth the walk to Starbucks to get what you ordered for $2 less.", "author": "Madeleine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Have a fat wallet and need a healthy breakfast downtown?  Make a pilgrimage to Caffe Bianco!  I had the privilege of traveling with my meals covered, so the \"quality food downtown\" prices weren't a big deal.  I was simply on the lookout for quality food, and I found it here.  For $12, I was able to build a generous fruit and nut yogurt parfait, with an egg, a banana, and a side of salmon.  Friendly people behind the counter, too - willing to accommodate orders like \"a side of salmon\" even though they weren't on the menu (bagel w/ salmon was).", "author": "k j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Wonderful fresh food, Delightful atmosphere. Really the Go-To meeting place in the Financial District. Was delighted to see the article in today's Chronicle that gave Banipal and his delightful establishment the recognition it has long deserved.", "author": "Suzanne T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "An inexpensive sit down spot for lunch in the FiDi! Great ambiance too. Nice quiet spot to meet a friend for lunch, coffee.", "author": "Cool K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-18", "description": "The first time I came, the older man who I'm assuming is the owner was extremely rude. I came here to use the Paypal coupon through the app, and I was having some troubles. The second time I came, they took 20 minutes just to make my salad. It was ridiculous.", "author": "James T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-03", "description": "Came strolling by for lunch to start the New Year.  I ordered the Skyscraper ~$6.75.  Let's just say I can basically make this sandwich at home.  A slice of cheese, some pieces of turkey and half an avocado on a sough dough bread. \n\nIf you read other yelp reviews, they mention mainly about the marble tables and that's about it.  Other than that, this would not be a place for food.  Instead, this is more for coffee and conversation if anything. \n\nBottom line: I left there still hungry!", "author": "Elliot Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "My favorite meeting place! Caffe Bianco takes me back to Europe every time I go. I'm addicted to the Mocha Blanca coffee drink, which tastes best topped with whipped cream. Whenever someone wants to meet for coffee, I suggest Caffe Bianco. I've converted many of my friends and colleagues into customers.", "author": "Marina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Best chai tea latte ever. Period.", "author": "Claire M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-03", "description": "Blech. I don't know about you, but when I order a salad, I'm open to many toppings. Nuts, cranberries, vinaigrette, cheese... but SAND?\n\nMaybe it wasn't sand. Maybe they just didn't rinse the spinach. Nevertheless, I fought my gag reflex every time I took a bite of salad and tasted hard, grainy bits of sand/dirt/pebbles. I couldn't see the nasty particles were causing the crunch, but every other bite made me feel like I was eating wet and dirty spinach leaves.\n\nFor $6.95, I got a relatively small (as compared to many other salad serving places downtown) and grainy salad that I could make at Lee's Deli for less than half the cost. Did I mention the chicken breast in it? No need I guess, seeing as there was so little of it. What little there was was fatty and mushy.\n\nNo thanks.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Super people running this place, Benny is always there to greet you with a smile!  Food/ beverage made fresh with a passion for perfection.  It's like a hidden gem in the middle of the financial district.", "author": "Victoria W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-28", "description": "I work in the same building as this cafe and will no longer visit it. Does that tell you enough?\n\nCoffee was always horrible but hey, it was convenient. I always ordered a medium, but when the owner rung me up, I'd without fail be charged for a large. Always had to repeat my order twice. And then he would stare me down until I walked away from the counter.\n\nI see such mixed reviews about that guy here on Yelp. I can't figure out what his type is. Racist? Sexist? Well, I'm an Italian female, so I really am quite lost here.\n\nOne star just because their sandwiches are so darn good. And the guy that makes them was always kind and courteous. But I'll gladly walk the extra block to Prima Cosa for better coffee, better service, and for an experience that won't ruin my entire day.", "author": "Donna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-16", "description": "Ordered veggie lavash wrap, they were out of avocado, and asked me do I want cheese instead. I said okay and chose provolone. Employee (he was very nice) asked me if I also want sprouts. I said sure. A female worker there made my wrap. When I got back to the office, there was nooooo cheese and noooo sprouts and the hummus that was supposed to be in it was such a small amount that I thought seriously? Ehhh, sorry, I don't think I'll try them again.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-01", "description": "I now agree with my fellow yelpers about the mustache man giving attitude to customers, and being mean to his staff.\nNot good !\nBut their staff is really good and the food is good too, so I will go back nonetheless.\nThe old man needs to get his shit together.", "author": "P D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-24", "description": "This place makes a mean sandwich. I'm down for the ol' Subway/Quiznos numbers, but this place blows them out of the water, and it isn't much more expensive.\n\nIf/when you visit this place, I recommend you try one of the salami sandwiches. They are specialty salamis, and the quality is extraordinary.\n\nStaff was super friendly, and the food came out quick. The interior space was decorated tastefully, with big windows that open onto Sutter. Me gusta.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-19", "description": "I had caffe bianco today for lunch.  The office ordered for a meeting.  I ordered my sandwich with no cilantro and low and behold there was cilantro on it.  I also ordered any kind of cookie besides peanut butter and what did I get?  Peanut Butter.  I picked off the cilantro and ate the cookie buy was a little annoyed about it.  The Sandwich was on the small side but it was okay.  The box lunch (sandwich, salad and cookie) was overpriced at $9 in my opinion, the salad that I had was flavorless (spinach, tomatoes and mushrooms).  One of the tomatoes had a rotten spot on it.  It would have been nice if the salad had something on it to boost or bring together the flavors.\n\nI would be willing to edit my review if some of the mistakes are corrected.  I did not contact them after receiving my food.  If I went in to order and had the same problems I would have addressed it on the spot, but I didn't encounter them until I was in the middle of my meeting.", "author": "Ty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "I love love love this place! It has been around for ages (according to my friend's mom who has worked in the Financial District for over 20 years) and I can see why. They have amazing choices for sandwiches, salads, and soups They can be quite packed during lunch so make sure you allot enough time! The interior is great for coffee meetings.", "author": "Anchal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "Even from the outside looking in, this place has a very inviting feel to it. The upholstry and color tones used inside give it a warm and cozy feeling and it almost has an old vintage appeal.\n\nThe menu has a great selection for a small cafe. Soups, sandwhiches, salads, lazangna, pasta, breakfast, pastries, coffee and more! The prices are great too. I didnt see anything on the menu that was more than $7 and the most of the sandwhiches were under $6. Not bad at all.\n\nI had the tuna melt sandwhich and a side ceasar salad. Both were delicious. The tuna was not doused in mayonaise and had great flavor, and the ceasar dressing was very tasty. I also had a vanilla late which was very yummy.\n\nThe service is prompt and friendly, and they seem to have a good amount of people in there throughout the day.  I'm sure there are a lot of regulars that come in here because everything is affordable and of good quality. \n\nThis is right around the corner from my work so I will definitely be going back again.", "author": "Heather G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "Very good deli. I always enjoy the turkey. Nothing too special, but really hits the spot when you want a good sando.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "The smoothies, tea, rad service", "author": "Ali B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "I absolutely love Caffe Bianco on Sutter Street in San Francisco. I've been coming here to get coffee off and on since 1994. Today, I finally had the pleasure of meeting the owner, Benny who has operated the cafe since 1981. Benny makes the best Americano in all of downtown. The beautiful seating area has old world charm, with high ceilings and beautiful marble tables. Hurray, for one of the last standing \"mom and pops\" in the Financial District!", "author": "Laura W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "This place is usually packed but lunch was slow there today. I got the cheddar tuna melt on sliced sourdough. It came with various veggies as well and I added avocado at no extra charge. Really good, well priced and nice staff.", "author": "Edward H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Stopped by because I needed a quick spot to make my lunch. I ordered their chipotle chicken wrap, it took awhile to get my order made (there wasn't anyone else there) but it was a good wrap and reasonably priced. I'll probably stop in again for another lunch sometime.", "author": "Analisa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "I absolutely Love Love this place! The atmosphere is amazing, the people there are really good people, because of that, I have been going at least 4 times a week there for lunch!. I ALWAYS get their quiche with a side of Kale or Caprese salad. The food is so fresh you can taste and smell it. this is not a place for someone who is expecting restaurant chain service. It is not Starbucks and it is not Chipotle. No mass production here and it is part of the charm. Be patient and enjoy the process IT IS ALL WORTH IT :)   They also have capuccinos with almond milk unlike Starbucks :D", "author": "Brenda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Great little spot nestled in historic San Francisco charm.  Set in an older building with classic French cane chairs and great bites too! I love the chicken chipotle wrap, but also have indulged on the hot Italian food, sandwiches and breakfast foods. Now a father and son team running it, always great customer service. I've had them cater a few meetings and everything ran great. Even having a cup of coffee at the tables in the window is delightful there.", "author": "Traci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-03", "description": "Cafe Bianco is an awesome QUIET place. You can have a business meeting there, you can work or read, have a conference call, without having to shout or use earplugs.\n\nFor best results, go upstairs. Feels like a quiet nook in a hotel lobby.\n\nMinus: water comes in really small glasses and you need to ask the cashier for it.", "author": "Vlad V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "Best place to have a lunch meeting downtown", "author": "Joe G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-25", "description": "After reading all these wonderful reviews on Yelp, I had high hopes for Caffe Bianco.  Alas, it was not meant to be.\n\nI went in, looked at their sample for the Chix Caesar Wrap and was unimpressed.  It looked like a tightly rolled Examiner newspaper.  So not worth $5.\n\nSo I decided to order the Mesquite Chix Sandwich on a ciabalta bun.  Well they charged me an extra 30 cents for the fatter bun.  So I ended up paying $5.60 for a cold sandwich.  Really I could do that myself at home.\n\nAnyway, I took it back to the office and threw it into our sad toaster oven to heat up the sandwich (I like hot sammies!).  There was nothing special about this sandwich.  They just gave me some tomatoes and lettuce.  No special dressing nada.  Chicken was so flat that it looked like it was steamrolled into submission.  Sandwich was blah.  Not that great.\n\nNope, as my Kid likes to say, \"me no like it that one.\"  Not gonna come back.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "Not a bad spot to enjoy breakfast and a coffee drink. The interior has a vintage-decor feel which is different from your corporate SBUX. The workers here are chill and the ambiance is pleasant. There were a lot of MacBooks being typed on the day I was there, which means CB is a good place for your pseudo-office as well.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-13", "description": "MEAN OWNER; MEDIOCRE FOOD\n\nI've been going to this cafe for 12 years, only because it's convenient, open a little later than some other places, and always has free tables. The owner never remembers me, even though I say \"hello\" every time. The coffee is watery, the pastries are hard, and the food is inconsistent at best. \nRecently I stopped in for a coffee and asked for the key to the bathroom first. The owner was the only one behind the counter and he said \"no.\" Only customer (no 's'). I said, \"I am a customer, I'll buy a coffee, I just need to use the bathroom first.\" He said again, \"no - you buy something first.\"  I've seen him over 100 times before and can't believe he didn't recognize me; his wife always did. I was wearing a suit - obviously not a street person looking to mess up their bathroom, and I REALLY had to go and couldn't wait. I ran next door instead but promised myself I'd never buy anything there again. His employees and family may be nice, but he's a jerk who doesn't deserve to be in business.", "author": "Lynn Marie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-12", "description": "Randomly stumbled on this place near my work today. Had an excellent breakfast sandwich. Nice guy working there. I thought it was really good. Easy for a casual breakfast meeting a step up from Starbucks.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-03", "description": "Service is mehh, okay. Food is mehh, okay. Price is kinda pricey. Environment is a  hit or miss depending on what you're doing at Caffe Bianco.\n\nI come here to pick up lunch for my boss sometimes, and honestly i guess it's the quality?! I'm not sure. But i don't see anything in particularly special about this place. Since i'm an avid coffee drinker, maybe i should get coffee here just to try next time. \n\nhappy eating!", "author": "Liberty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "This place is fantastic - a great coffee shop in FiDi that has a ton of character.  High ceilings, jazz music, great coffee.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Love the quiche, arugula salad, sandwiches and fresh fruit. Quick service, great to stop by on your lunch.", "author": "Kim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "The lunch salads offer a good variety and are certainly well-prepared! I like the space - upstairs is spacious and comfortable, lower level a bit more crowded but still ok. Occasionally will branch out and try other things but usually stick with the salad sampler", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "This place reminds me of the cute cafes near the Berkeley campus, like Cafe Milano. I love the independent feel and they make really good mochas/white mochas. I haven't tried anything else but I'm liking their coffees so far. \n\nI like the open space and the European seating. I wish I didn't have to go to work every time I'm in there so I can just sit  in there all day!", "author": "emme n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "Cafe Bianco has been my go-to lunch spot for nearly 7 years.  \n\nIt's very reasonably priced and offers a good selection: your basic sandwich fare, plus a few creative options.  \n\nTry their havarti special for a great cheese & avocado showcase.  \n\nTheir lasagnas are good (though I still can't fathom why they throw in a pepper and a pickle as a garnish for this).  \n\nThey have a rotating selection of salads every day --- from pasta to veggies to tomato & mozzarella.  \n\nVery decent minestroni soup (though after years of eating it, I'm a little burnt-out on it).  \n\nAcross the hall they also have a full salad bar and burrito-making counter.  The regular burritos aren't impressive, but the *breakfast burritos* are great!\n\nI also love love love their juice bar.  Yes, it's a bit pricey, but the fact that they use FRESH produce, not frozen, makes their juices and smoothies far superior over that JJ chain.\n\nI've had a couple of disappointments, but the selection and general consistency keeps me coming back.  The owner is also very friendly and chats up the regulars.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-09", "description": "OMG, what a pleasant oasis in the frantic bustle of the morning coffee rush!\n\nI've been doing the \"Stand in line at Peet's\" thing for a few months now.  And that's been fine, I guess.  But today, on a lark, I decided to give Caffe Bianco (which I've been PASSING BY for MONTHS) a try (probably because of my need for eggs this morning, after one too many drinks last night).  And what a pleasant experience it turned out to be!  Even the SOUND of the place was so much more peaceful.  There was just this CALM...  I loved it.  And honestly, I didn't find the coffee half bad.  I like the fact that if I'm in the mood for eggs, I can actually get REAL ONES here (unlike Subway (vile chain that it is), or any of the other fast-food choices I would never go to anyway (http://www.forbes.com/sites/daviddisalvo/2012/04/13/before-you-eat-that-breakfast-sandwich-read-this/).  I didn't think my egg sandwich here was anything to write home about, but at least it was made with REAL INGREDIENTS, and that's a start.  Caffe Bianco was a really pleasant change.  I WILL be back...", "author": "Eric H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-13", "description": "Had the cafe bianco club sandwich: turkey, salami, cheddar, lett., tomato.  The sandwich was very skimpy, maybe half a slice of turkey and salami.  No sides included.  This sandwich is not worth the cost.  Maybe other selections are better values.  One star for being centrally located.", "author": "Gordon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-25", "description": "This is as good as it gets. Great Jazz, wonderful proprietor, concerned employees, great food, terrific setting.\n\nPatronize often, it will make you a better person. \n\nHave lunch there. Read a book there. Meet someone for coffee there - the result is always the same - \"wow, this place is awesome, I didn't know it existed.\"", "author": "Ian T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-21", "description": "My coworker had been raving about Caffe Bianco's lavash wraps so I had to come try it yesterday. Boy was it busy in there around lunch time! I noticed there was ample seating and a variety of choices on their lunch menu such as lasagna, quiche, and sandwiches at reasonable prices ($6-8). They accepted credit card too which was a plus.\n\nvegan lavash wrap ($6.50) - I went the healthy route with this whole wheat wrap containing avocado, hummus, cucumber, lettuce and tomato. It was grilled on the outside so that it had some char marks. It was HUGE and I had to split it into 2 meals so it was totally worth  the price. It was filling and tasted OK but there wasn't anything special about it.\n\nIt was definitely a good deal and I would come back to try their other offerings!", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "Caffe Bianco is a lesser-known gem in the Financial District and my one of my go-to places for casual meetings over coffee. Their salads and sandwiches are good, and their prices are pretty reasonable for a FiDi cafe. I like that they have the upstairs seating area that's a bit more quiet when I need to focus and work. Even during the busy lunch rush, I've usually been able to find a seat here. There's free Wi-Fi too - just ask the cashier for the access code. The occasional negative is that sometimes there's miscommunication between the person taking the order, the food preparer, and the cashier, so I've had my order not prepared in a timely manner a couple of times.", "author": "Anne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "I went here a few times to study.  I liked their scones and it was pretty calm in the mornings.  Lunch crowd gets a little busier - I haven't had lunch there, but I'd gladly go back for coffee and a pastry.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "I'm giving this five stars not because it's some sort of world class dining experience, but because you can sit down and have a \"grown up\" lunch here.  Why go to a place like Subway when for about the same price you can have a nice sandwich on a real plate with real silverware? If you ask for tap water, they give you a real glass. The food is tasty, the old Euro decor is charming and I've only had good experiences with the staff.  For a \"order at the counter and they'll bring your food to your table\" place, it's rather elegant and you leave feeling like you had a more expensive lunch than you actually did.", "author": "Craig C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "I was in SF for three months with a colleague (Feb through April 2013).  Tried a handful of places for coffe/tea/breakfast.  This is by far our favorite.  To the food in a minute . . . the ambience is exactly what we had hoped for: a quiet, friendly spot. The proprietor obviously knows his regulars and is a welcoming sort without being obtrusive (I think we exchanged a dozen words total but he welcomed us with a smile in the morning and knew our regular order).\n\nWe often ordered the egg white wrap with avocado and it was freshly made and very tasty.  Likewise we stopped by for lunch on ocassion and found the food to be freshly made and delicious.\n\nDefinitely, top of our list.", "author": "A B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "This place is a block away from my work, the coffee is GREAT, and the man behind the counter (owner??) has always been super kind and friendly. I also do love the ambiance--very pretty, roomy, clean, quiet interior with comfy seating and big windows overlooking the street.", "author": "Marie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "Love their coffee and the sweet man who seems to run the place, perhaps he is the owner? Anyway, all of the staff is wonderful and very friendly. It's a bit pricey though, but then again, this is the financial district. I give it 4 stars because the sandwiches have disappointed me before, though others are great, and the chicken caesar salad fell a bit short. When I am at work and I need coffee, I much prefer this place to Illy.", "author": "Kristin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "Awesome place to grab breakfast or lunch in the financial district. \n\nI like the \"Skyscraper\" sandwich on dutch crunch. Smoked turkey, avocado, alfalfa sprouts.... Mmm.....", "author": "Jorge S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-14", "description": "It is sad when the best thing about your lunch was the Kettle Brand Potato Chips. \n\nI ordered a basic peppered turkey sandwich with all the fixings on light rye. The bread was dry, there was very little mayo and mustard, all the meat (the very little bit of it) was piled in the middle and nothing around the edges, there was zero flavor. Aside from the nice staff and my potato chips this was a terrible experience. \n\nNext time I will skip this place and go to Subway at least I know what I am in for! Sorry guys but if that was a typical sandwich you need to rethink your offerings. \n\nMaybe it was a bad day but with all of the other cafes in the neighborhood you better step it up!", "author": "Scott P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-01", "description": "I can't go on much here,but came when we had those previous days that it was really cold out in the morning.\n\nI actually walked by,but went back and thought I would try something out.The place is a decent size and with tables to the left when ordering.I can't remember if there was tables to the right but I remember the feel of the place being comfortable,clean and people inside looking satisfied.\n\n1. You can get coffee\n2. Breakfast (bagels and sandwiches,etc)\n3. Lunch options also\n4. Hot Chocolate too ;)\n\nQuick friendly service with a smile and prices decent.\n\nI can only comment on my hot chocolate and breakfast sandwich,but I think this is a place to try regardless and I was quite satisfied with what I got.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "Okay, so Caffe Bianco hasn't quite got the coffee house cozy, or the über primo beans to compete with today's heavy weights.  Yet there's SOMETHING about it that keeps me coming back, be it the cool marble or the old timey disarray.  Think of it like your grandfather's house: It's sort of stuck in an older time, and your cappuccino may not always come out the same way; yet for some reason, you always have fun when you visit.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-17", "description": "Caffe Bianco is one of the better reliable lunch spots in the Financial District. It's a great spot for meeting up with friends, or to hang out on your own with laptop, newspaper or book.\n\nAlso a convenient location for informal meetings outside of the office!\n\nHealthy food, and plenty of vegetarian options.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-19", "description": "The only bad thing about Cafe Bianco, for it's own sake, is that it's located about 30 feet away from a hole-in-the-wall income thief, a.k.a. Starbucks.\n\nCafe Bianco absolutely sh*ts on Starbucks, from customly crafted sandwiches on fresh baked bread, to tasty pastries and cookies, to probably the best coffee in the financial dist.\n\nI come here almost daily simply to grab a cup-o-joe and sneak upstairs to casually kill an hour of my workday reading.  I almost hope it doesn't become too popular, which I'm sure it will.", "author": "S M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-30", "description": "Like their hot chocolate here. Thats all I ve ever had here. Thats pretty good. The atmosphere is laid back and very old school-ish. Looks like it gets busy there during lunch hours. Hey, just saying! \n\nPrices are reasonable,cant comment on the quality yet though.\n\nPS: They have Wifi here,you need to get the code though.", "author": "Natasha I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "I have had some of the most interesting and unusual salads from this cafe and I'm left craving more.  I have been coming here for the past year and would order a sandwich and while waiting I would check out the variety of salads that were being offered that day.  Most of the salads looked far too healthy to be tasty, large white beans, kale and anything, brussel spouts, beets with avocado.  One day I felt the need for greens and I gave the 3 salad option a try and OMG! Every single salad was not only palatable, but they were down-right good!  I now am in there 2-3 times a week and the selection is always changing.  I have not been disappointed with anything and I'm enjoying things I never thought I would like.", "author": "Ericka C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-13", "description": "I have worked in the FiDi for almost a year now, and never knew that the Market street Ritchey-Chancery corridor next door to the 7-11 led anywhere worthwhile...until today! My coworker dragged me away from work (or hanging out on Yelp and not working) to grab a quick bite to eat. And that's exactly what it was.\n\nWhile we walked across the street, he mentioned I should try the Chicken Caesar Wrap...although he had 'overdosed' on it himself. We stood in line for a few minutes, placed our order with the older salt & pepper haired owner of the cafe, and then went upstairs to wait for our food. The ambiance of this place isn't anything special--cheesy art on the walls & no music to speak of.\n\nI munched on my wrap, which only cost me $5.50 and was actually really good! Not too much caesar dressing, and just the right amount of grilled chicken. There's another place down the street that also does a chicken caesar wrap with cold chicken, doesn't nearly compare to this one in quality.\n\nTheir pastries looked fresh, but the lasagna did not. I would opt away from lasagna at this coffee shop/cafe, unless you want a long afternoon in the bathroom and a rough n' tumblin tummy.\n\nSo yea...Chicken Caesar Wrap with Lavash bread at Cafe Bianco is definitely a winner. I'm asking that they add some olives next time.", "author": "matt m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-24", "description": "Decent sandwich shop in the Financial District. I love all the mismatched tables and chairs. Gives this place a nice Euro feel. \n\nI went with the 1/2 chicken salad sandwich on wheat bread with swiss cheese and a bag of chips and a freshly squeezed lemonade. The chicken salad was ok, but lacking flavor a bit. Salt mostly. But I love how it came with a pickle slice and pepperoncini. Nice touch. The lemonade was REALLY good. \n\nAll that for $7. Not bad at all considering the location.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "Out late last night.  Now hungover and in a climate controlled office downtown.  Bad air.  Staring at a computer screen.  Feeling gross.  Need to get out.  Need nourishment.  \n\nWhat does any of this have to do with Cafe Bianco, you ask?  \n\nThe answer is simple, Cafe Bianco has the best vegetarian Minestrone soup around and it helped sooth my wretched condition.    \n\nnow if I could only find a conference room or something so I can take a nap.\nWhy did I even come to work?", "author": "G L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "OK, I completely reverse my position on this place. They've exonerated themselves. Luckily, I did return here despite my last review's oath and, incidentally, was served by the same people as last time. However, they were actually very, very nice this time. Extremely accommodating, and I was a little taken aback, to be honest. \n\nIt seems like they're making leaps and bounds of substantial progress, and I'm forgiving them. I sincerely hope they keep it up.", "author": "Federico E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-23", "description": "Maybe you are risk averse and want only the simple meat-cheese-lettuce and bread sandwich that you make for yourself at home.  Maybe you are an Earl of Sandwich classist, and don't like your subs tarnished with embellishments.  Or perhaps you work at 44 Montgomery and have 7 minutes to eat your lunch.  Any of these would be perfectly valid reasons to visit Caffe Bianco.\n\nI, unfortunately, enjoy things such as vegetables, spreads, and, if I'm feeling particularly red-blooded, maybe even some sauces.\n\nIt was a bland and dreary lunch for me.", "author": "John F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-19", "description": "This place serves up a fairly large selection of sandwiches and hot dishes.  I've tried the turkey club sandwich, breakfast burrito and the pre-made Ciabatta sandwich.  Hands down - the best bet is the pre-made Ciabatta sandwich: turkey or salami.  Both options are winners!  As for the turkey club, it was mediocre at best...something I could make better at home.  The breakfast burrito was just plain terrible.  It's overpriced and bland.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-15", "description": "This place gets 4 stars because it's quick, the food is decent, and the price is right.  The pre-made, house special salami sandwiches on chiabatta bread are great and huge, and you get one plus a drink for $6.00.  If you want more, have the meatloaf sandwich or the meatball sandwich, or the Skyscraper club.\n\nI'm not a \"lunch\" guy.  What I want is decent food that I can grab in 10 minutes or less and drag back to my desk so I can stare at Yelp for a few minutes before going back to work.  This place fits the bill excellently.  You can't eat at Tadish's (or Aqua) every day.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-06", "description": "Caffe Bianco makes for a weird place. It has a European-style seating area, makes decent sandwiches, and have fairly quick service (a necessity when you're on your way to a meeting and your beemer is double-parked). So they definitely satisfy some essential criteria for lunch in yuppie-land. But then come the parts that weird me out.\n\nFirst, across the little corridor is another cafe or branch of the cafe. Or maybe it's the Bianco annex. Whatever it is I can't figure it out. They seem to have a decent salad bar, although I am far too fond of meat and carbs to eat that shit for lunch. It creeps me out and they should get their shit together and either make it one place, with a coherent decor, or just really make it obvious, and paint one place black or some shit.\n\nSecondly, there is a really angry man with a moustache manning the register. He doesn't seem to really have his shit together, and it takes a long time for him to ring people up, creating a long line. But I can only assume that he owns the place, because not only is he kind of short with customers, but he barks orders and complains to the sandwich staff, even though they seem to be working hard and (almost) never screw up my order, unless moustache man was the one who took it down. Mr. Moustache Man, if you are the owner, let your staff do the work, sit down with an espresso and the \"gazzetto dello sport\", and live of the profits. You're not helping!\n\nLastly, their lasagna sucks! I love lasagna, I eat it and make it all the time. But theirs is honestly weird. the beef is all pale, and there doesn't seem to be any bechamel sauce in it. it is like buying frozen lasagna at safeway and cooking it in the microwave, but it costs you $6 or so, instead of $0.35.\n\nDespite all this, I come all the time. It's literally across the street from my work, so it is too convenient. But stick to the ready-made salami-cheese ciabatta, or the melts. Don't experiment with the pre-made \"Italian\" food. And don't be nice to the Moustache Man, cause he won't be nice to you.", "author": "Anders L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-28", "description": "So my office building decided to schedule a fire drill and evacuate our floor...minutes before a presentation call with a client. Uhm, panic.\n\nLuckily, Caffe Bianco has free wifi AND upstairs seating that no one seems to know about, so I was able to scramble over and hop on my call with a few seconds to spare.\n\nCaffe Bianco, yay.\n\nI also love their super simple breakfast burritos with egg whites, cheese, salsa and bacon.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-13", "description": "A trip back to the 1920s, or 1940s, or 50s, or 70s, this lunch push-a tray-and-point joint occupies both sides plus the upstairs of a cramped \"arcade\" in a dark old wedge-shaped office building.  Red wine poured generously into chipped little glasses is a perfect accompaniment to highly cooked soups and dutch crunch bread toasted with some orange fat spread.  Between being refrigerated cold and the vin-o-vac stopper, its' a remarkably fresh glass of vino for $3.50.\n\nIf you are on the run from somebody they will never look for you here.  Beware the incessant light piano jazz.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-27", "description": "Liked the ambiance.  Breakfast sandwich took a long time to come out but tasted good.", "author": "K L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-11", "description": "Besides the slight long wait,  the sandwiches are made to order. My favorite is their Salami-Balsamic Ciabatta and second, the Caesar wrap. All sandwiches can be toasted. Their pastas also looks healthy and delicious but it's a meal I would only order for dinner. \n\nA salad buffet is available in the room next door for your own salad creation to-go, 1lb =$5.25.  You can also dine upstairs if you want to be away from the lines and noise. This cafe gives off an old charming SF financial district feel. You'll notice the many customers eating and chatting in their black or navy business suits.  \n\nFor eating in, you can walk up the stairs for a more quiet atmosphere. It's the most convenient lunch spot for me since my building is directly across the street.", "author": "Oanh N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "I would love to give this place 5 stars -- great environment and pretty good food. Here's my rub -- they charge more for coffee when you bring your own mug (mine is 15oz). They always charge me for a 20oz coffee, not even a 16oz coffee, when I bring my own cup. Call me cheap, or an environmentalist, but I they lose my business when there are dozens of other coffee stops that incentivize bringing your own mug. Get with it guys. Everything else is all good...", "author": "Vroom V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "I am writing this review for essentially one item theme, their breakfast sandwiches.  They are the only thing I have had from there and they are really tasty.  I am keen on good quality eggs (in my household I am known as the egg-whisperer), and this place is legit.  I recommend their wrap (tasty and cheap) but any other sandwich with egg involved is tasty.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-21", "description": "Perfect for solid lunch fare at a reasonable price. \n\nGreat salad sampler-- beet salad, green bean salad, potato salad... you name a veggie and I am sure they'll make a salad out of it. The meatloaf sandwich is yummy. My co-worker swears by the chicken Caesar salad.\n\nFor mornings go for the breakfast burrito. Comes with a nice bit of fruit salad.\n\nA smidge on the dirty side. I saw a staff member kill a cockroach behind the bagel toaster once, but at least they killed it.", "author": "Brad C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-03", "description": "This place gets two starts because the space is nice and the service was very friendly and prompt.  Lots of pretty women coming and going from this place in their business suits, heels and take-out salads so if you are into business-suity women, the scenery is great.  \n\nThe food is shite!", "author": "B G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "Update - service has been a bit faster since the very long wait i had.  Maybe they were having and off day.  Still not as fast as i'd like but gotta admit, great food and the staff if very friendly", "author": "Craig G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-01", "description": "Caffe Bianco is a no frills lunch spot with a bit of an odd atmosphere.  Every time I go there are a bunch of the \"senior crowd\", folks above 60, having lunch.  Odd.  \n\nTheir wraps are decent, and I typically stick with those and an iced tea.  For the price, for an average but decent lunch, and an atomosphere condusive to seniors, it's a ho hum alternative for lunch.  It works when you're too lazy to think of anything else to eat.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "Very relaxing traditional cafe. A great vegan wrap (lavash) and good (though simple and small) sandwiches. (The lasagna is sweet and disgusting.) The pick-3-salads lunch is also good. But great is the breakfast. The breakfast burrito is clearly the best in the FiDi and one of the City's best. But it's the simpler options that really shine: a toasted baguette with butter or a hard-boiled egg enjoyed with a perfect Americano or French Roast.\n\nThe setting is perfect. Right level of bustle. Solid and non-annoying staff. Free wifi. Stable, marble-topped cafe tables! Perfect place to meet after work (BART, buses) or enjoy a long read. World Cup was great here giving me hope that the new nighttime hours will work as well.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-03", "description": "My mom and I got the bacon & egg breakfast burritos on the run one morning.  I am rather disappointed.  Maybe because we are from Texas but these things were beyond bland even with the salsa.  I will not be returning.", "author": "Kacie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-13", "description": "I just 'discovered' this place the other day.\n\nIt does not look like much from the outside but once in I found a great old school interior with a tremendously high ceiling - and a very well priced menu. It reminded me of the kind of place you might find in Paris or London. Faded grandeur, unreconstructed. I was also delighted to see that it opened into an (Edwardian?) indoor shopping arcade, which is very European. I have never seen another one here in SF.\n\nI had the veggie lasagne and it was served by a sweet lady and came with a very fresh side salad. The guy behind the counter pulled me a really excellent, smokey espresso. I sat in the late afternoon, the place was almost empty, and had a relaxing meal, enjoying the pure, slightly shabby but homey old-worldliness of it. \n\nI will be back.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-02", "description": "Years ago, when I first came to SF on vacation, I stumbled into this cafe for a quick bite to eat. I remember ordering a burrito, and a side salad, and was quite satisfied. Pretty affordable after a week of tourist traps (Boudins, places of Fisherman's Wharf... I did 'em all).\n\nAnd now I find myself working across the road from this same cafe which fed me well all those years ago. I come to the salad bar about once a week... no longer buying burritos from here though (better places across SOMA). \n\nWhilst some people rave about Mixt Greens, I'm quite happy to put together my little concoction of lettuce, spinach, corn, beets, carrots and tuna (with low fat honey mustard). Something simple... just what I need.", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-24", "description": "Spacious & cosy breakfast/lunch/coffee oasis.  \n\nIf you are tiring of starbucks,  this old school spot is a good escape from the office to sip some joe and chill.\n\n...and they make a mean tuna on rye.", "author": "Dpb T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-23", "description": "We call this place Hemingway's.  I had to do some crazy research to find out its real name, since every time I go to lunch these days I always call Brandi and ask if she wants to have a Hemingway beer with me. \n\nHemingway?  I mean, I thought he died in Florida.  So weird that he chose to haunt this place.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "Stumbled in here while looking for the Galleria entrance (yes I was turned around).  Wonderful espresso.  Will be back.", "author": "Amelia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "The best fruit and breakfast bar in the mornings!!!  You can make your own yogurt parfait with granola and fresh fruits daily.  They have cottage cheese or greek non fat yogurt - the good stuff.  The lunch timesalad bar is pretty awesome too, a really good selection of toppings and always fresh.  They have really good coffee (if you want to stay away from big corporate chains - this is the spot to go).  This place is located just across the street from my work so the convenience makes it all the better.\n\nThe owner Bennie is friendly and welcoming.  The staff is friendly too considering the place can get pretty busy during the morning and lunch time rush - so just be patient it will be well worth it without hurting your wallet :)\n\nThe seating isn't dressed to impress, but I have never had a problem finding somewhere to sit with my lunch mate and enjoy my meal comfortably.  I definitely recommend this place!", "author": "Virginie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "High protein or protein-only diets can be hard to adhere to. Not at Caffe Bianco- they have Prosciutto (bad jew!) and a meatloaf that doesn't exactly rival mom's but tastes pretty damn good and is a deal at around $4 a slice. Plus, there's an added iron kick in there from the spinach). They also have diet Dr. Pepper (me) and Protein shakes (for boy). Pass on the marinara sauce on your meatloaf (it's on the tinny side) and take it cold- it loses it's herby flavor when warm. I can't wait to go back for the pesto pasta once these last 10 lbs come off. It looks divine.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "Old world charm, friendly staff and great eats - an inviting oasis in the middle of the concrete jungle!\n\nI love this place and always feel like I am in a scene from Casablanca when I pass through its historic doors and take in the vaulted ceilings, marble floor and lovely ambiance - the dapper and personable owner is usually there and looks like he could be a part of the movie, too.\n\nThis place is perfect for casual yet nice business lunches or coffee meetings with colleagues new or old.  The airy environment makes a welcome alternative to stuffy offices or chains.\n\nDefinitely recommend this cafe - it's a gem!", "author": "Glitter K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-07", "description": "Awesome breakfast/lunch spot downtown. I hit both today. Started with the Cafe Bianco, which is a mix of the house coffee and cinnamon, delicious. That was accompanied by egg whites and salsa wrapped in lavash bread. The perfect combo.\n\nA bigger than normal breakfast leads to a smaller than usual lunch, and after spotting half sandwiches on the menu in the morning, I returned for a tasty house baked turkey cranberry sandwich. No complaints whatsoever.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-10", "description": "It's a nice spacious area with good sized tables.  However, I got the roast-beef sandwich and it was disappointing - dry, tasteless, and small.", "author": "Sushant P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-24", "description": "It's a funny place; kind of like they just threw a salad bar in the lobby of an office building. Actually, that's exactly what it's like. But they have sandwiches and soups and fresh fruit, too, and plenty of seating. Overall, not a bad option.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "In these tough economic times (hi Britt!), Cafe Bianco serves your financial district food and beverage needs at a fraction of the cost of some of its nearby competition.\n\nMy coworkers and I would come in for their coffees. I like the white mocha (it's really sweet) and the coworkers like their chai lattes. Generally these are like 2.25 or under 3.00 - a cheaper option than Starbucks or Peet's (and I freakin love Peet's)\n\nFor the afternoon, we like the Italian sodas (yes it's soda water and syrup, but it still tastes great).\n\nThen we discovered the breakfast burritos! Well Stephanie K. told me about them. They're a perfect breakfast size and you can get them with egg whites with your choice of added sausage, bacon or whatever. Great when you want more than cereal for breakfast.\n\nI always saw the salad bar but was kind of wary - but now I love this too! Fill up a box with your favorite salad ingredients and it's charged by weight. I want to say it's $5 per pound. So long as you don't load up on like 10 beets, the coworker and I stay under a pound pretty easily.\n\nAnd their regular lunch options are proving to be pretty great too. My salad sampler today was 6.95 - I got generous helpings of pesto pasta, curry rice with chicken and portabello mushrooms with tofu.\n\nIt's just a nice option for when you don't want to spend $10 dollars at Mixt or nearly $10 for some sort of sandwich. (and you're too lazy to bring lunch like I am a lot of days)\n\nAccepts credit cards for purchases over $5 or they charge like a .35 surcharge\n\nOh and their menus are all over the place, which is probably why I keep discovering things like weeks later. Don't be discouraged by the odd decor!", "author": "Karen J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-18", "description": "This is a great place for a morning pit stop! I had their Chi latte today and it was superb, even better than $tarbuck$ and at a much more reasonable price! They also have a great selection of fresh fruit, bagels, and breakfast burritos. The service is excellent, they get you through quickly and everyone is nice. I have stopped there a couple of times for lunch and their sandwiches are pretty good as well.", "author": "Kristin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-22", "description": "This is just an average and un-interesting lunch spot in the findist.  I worked in this area for years and it took me a while to get there and when I finally went there I was non-delighted.  I think if you are going to spend money for lunch--it should be delightful, exceptional.  I think the findist is not a cheap place to have lunch.  I do expect a lot because every dollar I get is very hard earned.", "author": "Jaime Patricio M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-29", "description": "Bianco gets outsourced by Sutter Station at lunch time which makes for a pretty good pair. The sandwiches are pretty standard, but also not too expensive, leaving a little change in your pocket for a noontime beer. I'll have to visit Bianco proper to allow for a more robust review, but until then an average 3 stars.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "One of the few places in the city where you can buy a 16 oz. drink for less than $3. Kudos on the pricing and flavor, jeers to the $5 minimum (or a fee will be charged) for credit cards.", "author": "Selina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-19", "description": "Had a lovely latte here. Maybe one day I will get to try the rest of the menu.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "it's right behind my office and offers a delicious chicken wrap.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-31", "description": "Caffe Bianco is a god place to grasp a fast breakfast and lunch.  The owner is a very nice guy and his workers are mostly helpful.  I use to have my oatmeal and boiled egg for breakfast, sometimes a bagel toasted with cream cheese or a low fat blueberry muffin.  Coffee is fine there.  For lunch, I love the salad bar, with lot of choices of green.  Potato salad, bean salad, apple salad, pasta salad are all so tasty.  One of the must try is the lavash wrap.  Try the chicken ceaser or the caper tuna and you won't be disappointed.  My husband tried its meatloaf and lasanga, he likes it.  The price is quite reasonable for a downtown restaurant in Financial District.  Well, I also like the smoothies but it's a bit quite pricey.", "author": "Roserrele W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-11", "description": "Any place that gives you real cups and saucers and has little marble tables gets a plus, even if the tea selection is semi-uninspired.  It's friendly, not too crowded, and a good place to have work meetings over coffee because it's quiet and spacious with nice tables.  Their lunch food doesn't look inspiring, but the pumpkin scone I had there once and the proximity to my office go a long way.  With how crowded some other FiDi spots get, the quiet dim upstairs is a nice change of pace Once my friend sweet-talked the cashier (en espanol, claro) into \"lending\" her a bag of chips to eat upstairs until she could bum cash off of me to pay for it.", "author": "Gloria B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-01", "description": "Decent coffee, but it is an odd atmosphere and something just feels a little off. However it's really the only coffee spot near me that has a good amount of tables.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-06", "description": "Pleasant north-beach style cafe with marble tables, homey atmosphere, right in the heart of downtown. Quiet and easy place to work from on this Thursday afternoon. I can't figure out why anyone would sit in starbucks when you can hang out here. Wifi access if you ask behind the counter for the password.  Good coffee, and looks to be a kick ass lasagna for $5.50 - wish I hadn't eaten lunch.", "author": "Jaymz D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-26", "description": "Having worked upstairs from Cafe Bianco for almost two years, it has worked its way into my heart. The coffee is great, and all fair trade. Everyone is friendly, the prices area reasonable, and the food is tasty and fresh.\n\nIt's a shame it's not open on weekends or later at night- but it really caters to the financial district lunch crowd. The side with a salad bar and burritos isn't quite as nice as the main counter, but it's convenient, fast, and clean. I like how the whole place is sort of welcoming, with decent music that's not too loud and a steady stream of interesting artwork on the walls.\n\nI can't find another place to get coconut macaroons- Cafe Trieste has them, but theirs are no better, cost more, and are smaller. I hope this place lasts forever. With all of the fast food garbage, and all of the really mediocre independent eateries out there, it's great to know you can stop in at Cafe Bianco for something wholesome that doesn't cost an arm and a leg.\n\nI'd give it 4.5 stars if I could, but not five. It's a dependable favorite of mine, but if you're willing to pay enough you can probably get better food elsewhere. It's an awesome lunch spot, but I reserve five stars for the elusive combination of stellar quality and value.", "author": "joe c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "This place is very a very mom/pop shop - and I adore it.  The people are super friendly, the food is always good (not fanastic, but solid), the prices reasonable, and the lines not too long.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-25", "description": "Quaint place. Cheap coffe. But, the ham quiche I was served had a total of four small (1/8 x 1/8\") chuncks of ham. The crust was soft and not flaky as expected. The texture was odd, not unpleasant but different than any I have ever tried. I will give it snother shot since it is quick and close to work. But, Bianco won't become my go-to spot.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-18", "description": "I've been working so close to this place for the past 5 years and would have never noticed this place nor eaten here had it not been a suggestion made by Marcia W. Located inside an old office building, it faces out to Sutter Street, but is accessable through this easily missed lobby door that faces out to Market St (right next to GNC and 7-Eleven). There's also a nail salon and alterations shop in the lobby, and you can tell that the owners have been there for a long time. The cafe has a big selection, so if you are feeling up for anything, you'll be able to find something there. There's a big salad bar, where you can make your own salad for $5, a burrito station (I got a small chicken burrito which was quite good and the perfect portion for only $3.50), sandwiches, pastas and soups. Everything is priced around $5, which is great if you're someone like me who eats out practically every day. Very casual and nothing fussy, lots of seating and not too many people.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-24", "description": "I have been going to Caffe Bianco for over 15 years, I bet. I just walked by it yesterday, and thought again to myself, how happy I am that it is there. (Didn't have time to stop in and eat though.) Their sandwiches are custom made, and they're nice about tweaking things with whatver extras that make you happy. Soups, salads, lasagna... plenty of variety for everybody. They aren't spectacularly creative meals -- but just nice pleasant food, at nice pleasant prices, served by nice pleasant people. Good espresso drinks too. The thing I probably like the most about it is the ambiance. It's quirky there among the office buildings. Huge windows to let in a lot of light, and a somewhat European flavor to the decor.  Lots of little round marble tables to sit at -- and the best kept secret is that there are stairs off to the side and a whole upstairs section with even more seating (still with the window light) for when the place looks full. I really like supporting the little guys, and although there are probably 75 Starbuck's within a block of here, if you feel like sitting down and reading the paper and enjoying a good latte -- this is definitely the better option.", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-17", "description": "Nice place to grab a salad or sandwich... pretty quiet atmosphere right in downtown... reasonable prices too... I recommend the Bianco Club on sourdough bread.  The Chicken Caesar is a nice choice too... the staff and owner are friendly...", "author": "Amar M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-16", "description": "This place is okay. Sandwiches are small and they slap wwaayyy too much mayo on the bread. The staff were all really nice.", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-17", "description": "I like their sandwiches. Quite a bit. And the price is OK. But again and again, I am put off by how unfriendly the two people behind the cash register are (the man with the moustache and a lady). The sandwich preparers are fine. I am not usually that sensitive to frowns, but those two just make me want to go money elsewhere. As if it's bother to take my money.", "author": "Victoria A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-27", "description": "before you scoff at me and impugn my credibility for having given some old world cafe in the financial district four stars, please hear me out.  yes... i know cafe bianco isnt going to win any awards for its food, but in the somewhat monochromatic downtown scene filled with the likes of specialitys, chili up, lee's, generic burrito places, starbucks, et al., cafe bianco's old world charm really shines through.  the food is typical cafe style with sandwiches, some hot plate items and your typical salad bar.  the main room has a lofted ceiling, is airy yet cozy, seating is plentiful both on the cafe level as well as on the mezzanine level.  music selection is always jazz or classical.  prices are cheap and the food is satisfying (i like the breakfast burrito with fresh fruit for under $3.00 and the meatloaf on penne pasta with marinara sauce and baguette for $5.70)  okay, so that doesnt exactly blow you away, but if you work near sutter and market, i urge you to step into cafe bianco for a coffee break and check it out.  youll find yourself wanting to just kick back for a while and relax, and thats worth something in these fast paced times, isnt it?", "author": "Curtis Y."}
