{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Cantina Verde is awesome! This week I had a number of meetings my team needed food for and Cantina Verde was fantastic. We ordered breakfast twice and lunch twice and everyone loved the food. All of the salsas, sides and guac were super fresh. The meat and sides were seasoned really well.  \n\nOn a customer service note, Ada, the catering director is the best. She called me after I submitted my order, was early for delivery every time, set up all the food with beautiful presentation, and followed up a few hours later to make sure everyone enjoyed. \n\nOverall a great experience with Cantina Verde, I definitely will be back.", "author": "Lindy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "This place was ok. Service was great but food just ok. I came in around 1:30 pm on a Friday for lunch and ordered right away. I got a burrito with the chipotle chicken. I'm not sure if it was the chicken, rice, or anything else in the burrito but it was extremely salty. If I come back I will probably try something else. \n\nNot bad but better than chipotle. Good for lunch if you are looking for something quick. If I am looking for an authentic burrito I will go somewhere else.", "author": "Taylor F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-12", "description": "The best way to describe Cantina Verde is bland. You can kind of see it the moment you go inside - the white interior and minimalistic design almost look sterile.\n\nI got a carne asada burrito, and the meat was chewy without much flavor to it. Beans were kind of old too, and though I added jalapenos, it didn't really do anything for me.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "I went here for a quick breakfast during work. My ideal breakfast is truly lunch and this was the closest I can get. I got the egg whites, red pepper,\nBlack beans and all the toppings available. It felt fresh and flavorful. The other notable thing was that the portion size was truly huge and I did not finish it. Considering SF prices I feel like I got my money's worth. This will definitely be in my list of go to breakfasts", "author": "Sharvari J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "As far as fast food goes I think this place kicks chipotle, cava, and every other chipotle style restaurants butt. Don't get me wrong it's very similar to chipotle but the ingredients are so fresh and so much more tasty. I'm glad I stumbled upon it.", "author": "Sam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Updating my review for a recent catering occasion: we requested Cantina Verde for a company lunch event, and Ada was extremely pleasant to work with and came right on time (even though it sounded like they were neck deep in orders). She set up the food quickly, and even gave us free chips and salsas. Everyone enjoyed the food! Would definitely recommend them for your catering needs. Thanks Ada!", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "We just had a lunch catered here from Cantina Verde. We did a taco bar for about 13 people, and 2 of their large catered salads. My whole office LOVED it. Super fresh, flavorful, and just the right amount of food for a catered office lunch. We had both chicken and steak taco bar, and even the person who delivered it was super professional, friendly, and very well prepared. Was so nice that she set everything up for us too, instead of just dumping the food and leaving. I have already been told by several people that we need to order from here for lunch again, and we definitely will!", "author": "Becca R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "had the verde house salad, it was a huge salad. It is crazy busy during lunch hours and there is seating. The food is fresh, the tortilla chips were a little bit not crunchy but overall the food was good.", "author": "Maria N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "It's probably more than just salads, but for me it's been a go-to quick and tasty salad-house. I've had the \"Verde House Salad\" and the \"Fiesta Salad,\" both with chicken, quite a few times.\n\nBoth the salads are built on a mound of crisp (as in fresh, not fried) shredded lettuce, black beans, and chicken. It's either the cilantro lime chicken, or the chipotle chicken; they are both served warm and contrasts the cold ingredients of the salad really well. The mustard, and the chipotle based creamy dressings are both delicious but may well prove to be  calorie-bombs, so be wary of that when dressing your salad.\n\nI love the mango in the fiesta salad, as well as the salsa-avocado in it's verde counterpart, as are the sweet corn and boiled egg, depending what you chose to partake in.\n\nIn conclusion, these very generous portions of salads represent a well composed compromise between the balance of healthy and tasty.", "author": "Umesh T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-06", "description": "Worst customer service I have experienced in a long time!!!! I had a strange experience on the first visit when a well dressed, articulate black women in business attire comes in. The business has a posted policy that you must make a purchase if you need to use their bathroom, understandable. The lady complies by purchasing a coffee and by this time she is clearly dancing in place because she had to use the restroom. The manager responds by telling her that she did not spend enough money, we were both in complete shock!!!! I paid for my breakfast burrito, which by the was was bland to say the least, then I asked for the door code to the bathroom where I proceeded to give it to the lady in need. I should have posted a review right away but thought that everyone can have an off day.\n\nYesterday I came in and stood at starting point to order my breakfast burrito and waited there almost 7 minutes, clearing my voice and trying to politely get the employees attention, but they looked right through me and never acknowledging my presence. As I begin to turn and walk away, a gangly white male walks up behind me and they instantly as him if they can help him, I just thought, \"WHAT IN THE ACTUAL F\" I was furious but went on about my way and got breakfast from a much friendlier and accommodating restaurant, Focaccia, where the food was fast, hot, delicious, made fresh and the customer acknowledged was immediate and professional. \n\nI tried to give Verde a second chance but this second visit just further confirmed that this place is absolute garbage when it come to serving people. Horrible customer service and their staff needs retraining!!!! Don't waste your time or energy there.", "author": "Darrin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "So after my most recent Mexican \"Veg\" Salad experience (let me catch you up, it wasn't veg), I was pretty much having Mex Salad PTSD. So when a coworker said we should get burritos/Mexican food, I hadn't planned to get anything.\n\nLo and behold, he ended up choosing Cantina Verde - which I had carefully bookmarked after seeing photos of their salad. This is like a Chipotle with way more options. But with decisions comes indecision.\n\nThey have pre-set menu items and also a make your own salad. Wahoo. Of course I choose that. So I start adding everything under the sun - grilled onions, regular onions, grilled squash, cooked mushrooms, pico de gallo, corn, tomatoes, eggs (I made her pick mostly whites) and then....okay they have listed avocado is extra, but why are cucumbers 50 cents extra? Why is mango salsa $1 extra? Why? I feel like this place invites pricing confusion so beware.\n\nHowever, for $9 or so, you get a much bigger salad than elsewhere in the city. So it isn't a bad deal. It's an SF meal steal deal. Just double check what is extra and what isn't. \n\nAnyway, I am for sure returning.", "author": "Libby J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-18", "description": "I thought I would give Cantina Verde a chance especially since they seem to be popular with the lunchtime crowds. However, my experience can be summed as mediocre at best.\n\nI'm not sure if I missed a sign or anything, but the worse part about my experience was that there was no explicit signage pointing out the limit of extras you can put on your tacos. I assumed that we can put a bit of everything, but sadly, the worker misheard me and gave me the two things I wanted to be omitted. \n\nThe three tacos- carne asada ($1 extra), chipotle chicken, and carnitas were fine, but lacked any flavor that Chipotle has. Even homemade tacos with my friends tasted better than these. \n\nBeyond the flavor issue, I was sad to discover that they don't use fresh corn. Their corn tasted exactly like the canned corn you get from Trader Joe's. \n\nLong story short: save yourself the disappointment, and walk to Chipotle a block away.", "author": "Eva L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Amazing team of people very considerate and cooperative. Super attentive and excellent food delivery service and catering.\nI had ordered food for an office event and they did an absolutely emaculate job setting up and delivering right on time. They made sure the food stays warm till the time people eat them, provided small burners and set the stands up. Beautifully decorated the food and so presentable. I had ordered taco bar with chicken and steak. We had tofu for vegans. Excellent vegan salad and mango relish , salsa, guacamole tastes heavenly. Will totally recommend this place for dinning and for any event catering too.", "author": "Neo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Another MealPal review! Rather recently, the portion sizes are less. Cantina Verde used to give you the same amount as if you were to order regularly; this was the best part of it. The salads are pretty filling and full of flavor from the well-seasoned chicken and the dressing.\n\nDuring the lunch rush, you could sometimes see the line go out the door and wrap around the corner. This one time, I even saw a substantial MealPal line, which is surprising.", "author": "James N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Thank you for responding to my comment about the issue with pricing for chips and guacamole. I like going here because the staff is friendly and you get quality food!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "I don't know why this place gets so much hate! I really enjoy coming here. The ingredients are fresh and very flavorful+ organic! I would say it's a upgraded version of chipotle for the same price. Where else can you find a huge salad in the Fidi for under nine bucks? I really like their Fiesta Salad that I usually get through mealpal. It has Lettuce, Kale, Cilantro, Chicken, Black Beans, Cheese, Tomatoes, Mangoes.. AND this amazing mustard vinaigrette. The ingredients just bend very well together and the chicken is grilled to perfection. Probably one of the best salads I've tried. I've also tried their Verde house salad, but would pick the fiesta over it. \n\nI didn't care for the horchata or aguas frescas here. I like my horchata to have a strong cinnamon flavor and this didn't cut it for me. Also, the aguas frecas were way to sweet for my liking.", "author": "Mehak D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-19", "description": "Cantina Verde vs. Chipotle this place will always win!!! \nThey're not stingy they have plenty of different meat options that toppings are endless plus  the staff is friendly and the establishment clean. I just love this place!", "author": "T A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Came here for lunch two times on a weekday. \n\nFood: They have the same options as Chipotle (tacos, burritos, bowls) but seems healthier. I have gotten a tofu bowl and the tofu tacos. I liked the tacos better because they weren't as heavy. The bowl almost had too much tofu. The one thing I dislike about this place is how big the tofu chunks are, if they could just cut them half the size it would be perfect. \n\nService: The service here is like Chipotle too.  You stand in line, order and watch them make your food as you tell them what you want on your meal. The line went very quick. \n\nAmbiance: Inside is very clean and modern. Lots of seating and I love the bright green colors they have everywhere. \n\nI would come back and get the tacos. The bowl was too heavy for me.", "author": "Hayley D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-27", "description": "Their food is good, but they don't cook their chicken thoroughly. I have gotten sick a few times because of this.", "author": "Jackie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Terrific, quick service for breakfast and lunch; both dine in (limited seating) or in my case, grab & go. \nThe organic locally sourced ingredients are both simple, fresh and reliable. Add on's like avocado, extra vegetables and so on are both fairly priced and predictable. Service is very friendly and efficient.\n\nThe food is reliable and the location is excellent. This is one of many Financial District quick stops during what is certain to be another full day living in this most busy of districts in San Francisco.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Delicious and cheap. Every time I go here I wonder why I don't go more often. The salads are great value and you can add multiple high protein items to your chicken like egg and beans for no extra cost.", "author": "nicole f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-17", "description": "Breakfast shouldn't cost $9. Or at least for what i was served.  Five oz serving of pinto beans, three oz serving oz diced potato, three oz serving Turkey sausage diced,  approximately 1 oz of guacamole and a dusting of cheese in a bowl. Had i elected to get a burrito it would have been a chicito. No thank you.... cant go back.", "author": "Francis M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "AVOID AVOID AVOID ... This place is a nightmare ... I got a salad and found a live insect in it ... watch what you're serving guys !!", "author": "Aditi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-15", "description": "Chipotle with more veggie and sauce options but missing key criteria: fresh chips to go with your burrito bowl. Also the portions are super small, Chipotle doesn't skim on ingredients.", "author": "Alita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "My only regret is that I did not try Cantina Verde sooner. I'd like to point out how fantastic the staff is. They're always so friendly and never seem rushed.\n\nThe food is outstanding. I especially love the cilantro lime chicken. I would also recommend the tomatillo salsa. Many of my fiends love their salads. \n\nPrices are very reasonable but this place is packed during lunch hour. The food is always fresh and high quality.", "author": "Jacqueline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Great food with quality ingredients and options.\n\nI absolutely love this place because of their delicious fresh food. I do love Chipotle but after visiting Cantina Verde, I honestly cannot think of a reason to go eat at Chipotle anymore.\n\nThe only con I can think of is the duration of wait during lunch time.\n\nHighly recommended.", "author": "Manpreet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Got the Fiesta salad here and it was good but filling. I was trying to be healthy by getting a salad for lunch and this definitely didn't do it. It tasted great but I could feel how unhealthy it was. There were chips and eggs and dressing etc tart made it filling. I couldn't eat the whole thing for lunch but would get it again.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Stopped by for lunch today for a steak salad and GOD THIS THING TASTES AMAZING. They give you a huge box of vegetables - you can either get romaine lettuce or mixed greens, brown or white rice, choice of meat, and so many toppings such as onions, salsa, corn, boiled egg, etc. I was so excited that the boiled egg comes with the salad because it's usually charged more. The steak is delicious and they don't skimp on the portions like Chipotle might. For around $9 I don't think you can get these ingredients and portions anywhere else. \n\nI definitely will be coming back here and really recommend trying this place out for lunch if you're looking for a healthier option around this area!", "author": "My N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Amazing salads ! Fresh salads .. my go to salad place in the financial district! Though they put beans in the first salad and Verde house salad I could feel the difference in taste compared to other salad places. There's always s line during lunch hours.", "author": "Aravind J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "I've walked down here so many times, but now just finally stood in line to see what was up. This is a great Fusion Mexican spot that is sort of like Chipotle, but has some really good ingredients. I came here and ordered a Salad which is sort of like all of the stuff in a burrito just in salad form. It was really good. I ordered romaine lettuce with chicken and all the works including sour cream, corn, mango salsa and cheese. It came out well and for $9.00 it was a lot of food! I ate it up and was very full. I will definitely come back here again soon to try a burrito this time around!", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "My co worker and I decided to try out Cantina Verde after walking past it one day during our break and seeing the \"Breakfast Burrito\" sign outside. We decided to try it out the next day for lunch. I ordered a bowl with carnitas, onion, corn, black bean, white rice, guacamole, and salsa. I really enjoyed my bowl it was very flavorful the only downfall of it was it was super salty. \n\nI really like how you can customize it in so many ways. There are a ton of toppings that you can get. The prices are super reasonable considering that this is the Financial District. They also have a variety of aqua frescas as well. I really enjoyed the watermelon one, as it was super fresh, light and refreshing. \n\nThe line does get long but it goes by really quick. The service was fast and friendly as well.", "author": "Yinja L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Hi the salad I had here was definitely a good sized and very tasty definitely worth the mealpal cost.    I will definitely look at this place as an option for lunch. :)   You can judge by how it looks. \n\nNice space.", "author": "Homer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Cantina Verde has the best salads! Both the Verde House and Fiesta Salad are filling and delicious! The chipotle dressing on the Verde House Salad is spicy and there are many ingredients including beans, hard boiled egg, and jicama.  Verde House Salad is one of my fave salads of all time because of all the variety of ingredients. The service via Mealpal is fast and the staff that I spoke to at Cantina Verde was friendly and efficient.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "This review is strictly for Cantina Verde's catering service.\n\nI've used Cantina Verde to cater office breakfast and once for a large happy hour we hosted in the office. \n\nThe most important thing that keeps me coming back for more is the easy ordering interface on their website, prompt, professional delivery, and most importantly Ada! Ada goes above and beyond to make sure even a simple breakfast burrito spread looks like something special. She has baskets and other things like placemats that make a real difference in how the food is displayed. Most food delivery, even catering, in the Financial District is just a drop-off-and-sign-here kind of thing. Not with Cantina Verde. Ada thinks of catering the way an office manager would. She sets aside the tops to the salsa rather than throwing them out so they can go back in the fridge. She pays attention to the way people will approach the food and what order they will want to add it to their plate. I like these kind of details.\n\nNow for the food. The breakfast burritos are amazing. They are fresh with real tomatoes and plenty of flavor and quality meat. They also do vegan and vegetarian breakfast burritos that taste even better than the meat ones, which can be hard to find in the area. These are the only breakfast burritos I get rave comments about from all of the employees. They are truly different than the standard in the best way.\n\nThe taco bar we had for our happy hour was also thoughtfully assembled for our needs. Ada brought chafing dishes so the food would stay hot. She made the display look abundant, festive and inviting - something that is important when you're trying to get people out of their work minds and ready to eat and socialize. She also did all of this on very short notice. Like VERY short. Probably the most amazing thing she did (and I know this sounds tiny) is that when I forgot to order guacamole, she ran back to the store, packed some up for me and met up with me out in the neighborhood where I was picking up other stuff for our event. \n\nOne last thing: Aguas Frescas delivered in pitchers! What a great thing to add to breakfast to make it a little better.\n\nI highly recommend using Cantina Verde if you want a professional, thoughtful and delicious catering experience in the Financial District!", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "\"Yeah we're kind of like chipotle, in that our set up is very similar. But we are a little different\"\n\nThat was a statement from a rather humble employee from Verde. Allow me to keep it real for him:\n\n\"Yeah we like chipotle, but better.\"\n\nBut exactly how are they better? Let's analyze under the following exhibit.\n--\nExhibit Guac:\n\nIn 2016, the second most commonly used phrase in the United States was \"You know that Guac costs extra?\". (#1 most commonly used phrase was, of course, \"The Warriors Blew a 3-1 Lead.\") Being reminded that guac costs extra is exceptionally sinister. Instantly after acknowledging the extra cost, you get to observe a Chipotle trained employee scoop up a measured and meager spoon of guac. Just as the rain of regret begins to sprinkle on your life, you witness the employee go through the final step of company protocol and begin fiercely smacking the scoop of guac against the counter to fling off any extra guac over the spoon.... to rob you of any excess guac that spilled over that calculated, pitiful spoon....The employee then shifts his eyes from your burrito and into your soul, \"Yeah homie. You done got hustled.\"\n\nGuac-enthusiasts are spared from this terrible experience at Verde. Get this: Verde employees do not remind their customers that guac costs extra, BECAUSE GUAC IS FREE!!! That's right, every customer is entitled to a healthy slab of guac on their burritos/bowls/salads. Sure, it's not a monster scoop (not that chipotle's scoop is either), but it's free! What's more, you can even add slices of avocado, in addition to your guac, ALSO FREE. No more psychological abuse from \"You know that Guac costs extra?\" No more regrets on saying yes to the guac. Verde got you covered on your guac needs.\n--\n\nJust based on the guac exhibit above, Verde already earned the epithet - Chipotle, but better. But if you want to see further proof on why Verde is Chipotle on crack, feel\nfree to check out the bonus exhibit below.\n\n--\nBonus Exhibit: Vegetarians\n\nAt Chipotle, a vegetarian burrito is either plain, or you get some bull known as Sofritas. What is Sofritas exactly? Chipotle claims that it's tofu, but our experience tells us otherwise.\n\nAt Verde, a vegetarian burrito can be defaulted into a Tofu Burrito. (Unlike Sofritas, I can attest that they're actually cubes of Tofu)\n\nThe Tofu Burrito can be accompanied by 3 of the 4 following veggies:\n\n-Mushrooms!\n-Fajitas (Chipotle has this option as well)\n-Chopped cucumbers\n-Freshly grilled onions, evident by the dude grilling them on a nearby grill\n\nAnd yes, the guac mentioned in the first exhibit can also be applied to your Veggie Burrito, FOR FREE!", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "I am a big fan of Cantina Verde and it makes me kind of sad that this place only has 3 1/2 stars. It also puzzles me because the lines are always long and it's obviously a fan favorite to a lot of people in FiDi. The Verde House Salad is my favorite but you can also customize to the way you want it. Cantina Verde reminds me of a sophisticated version of Chipotle. Love this place. !!!", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Went here for lunch and tried their steak burrito bowl.\nDon't let the long line fool you. The staff at this location moves the line fast. It also helps when you know what you want to get.\nThey serve fresh ingredients daily and their presentation is way better than chipotle. I loaded my steak bowl with extra steak and all the fixin's\n\nIt always pays off to be nice to the person helping you and chat it up a bit. The scoop portions became more generous as we got to talking. My burrito bowl was heavy! It was all worth it for $9.00\n\nI will be coming back to this place!", "author": "Rommel Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-22", "description": "Horrible service with rude staff. Treat customers like a production line. \n\nVery disappointed", "author": "Harneet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "When your staff votes on Breakfast Burritos for an all staff breakfast - you realize it's not easy to find a breakfast burrito caterer for 100+\n\nEnter Cantina Verde!  We worked with Ada, who helped us order - including a few dietary restrictions - with ease.  You can place the order online and narrow it down to a 30 minute delivery window.\n\nThe burritos were great - bacon, chicken apple sausage, chorizo, veggie, vegan - our staff enjoyed them!", "author": "Katy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-11", "description": "Definitely good food with tasty ingredients but it's a bit underwhelming how little they give you for the price they charge. I can't eat beans so I ask for an extra veggie option but am stonewalled. And to top it off, simple options like lettuce, onions, cilantro etc are apparently limited? I was told that lettuce was 50 cents extra after getting onions and cilantro. It's lettuce and judging from the look of it, iceburg lettuce, so nothing so special. At some point itll make it hard to justify this place for the price versus just getting Chipotle.", "author": "Nirav C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "Went here for the first time today with a friend. Overall a decent spot for a quick lunch in the FiDi area but nothing mindblowing (i.e. a solid 3 stars in my mind).\n\nI got there around 11:45 and the line was already pretty long (about ~15 people in front of us) but it moved fairly quickly and we were able to order in 10 min or so.\n\nMy main impression as I was ordering was that I felt very rushed going through the line. I barely had time to look around at all the different toppings before I was rushed onto the next person. \n\nFor example, there were no labels so I wasn't sure which salsa was which, and when I hesitated because I wasn't sure, the lady handed my bowl to the next person on the assembly line and I had to ask him about the mild salsa.\n\nI got the bowl with white rice, pinto beans, carne asada, corn, lettuce, guacamole, and mild salsa. Unfortunately I didn't realize the mild salsa was the one with a ton of cilantro (which I can't stand) or else I would've skipped it...labels definitely would've helped.\n\nThe actual bowl was decent. Paid around $10 for it and it was pretty filling. The carne asada was a bit on the dry side, but I thought it was well flavored and went along with the rice and guacamole really well.\n\nThere are a couple tables scattered throughout, but it seemed like this was mostly a takeout place. My friend and I ate here and did not have a trouble finding a table even though it was right around peak lunch time at noon.\n\nI work really close to here so I'll probably come back here once in a while. It's a better alternative to Chipotle for me for one simple reason: this place has wayyyyy less cilantro in its ingredients. The less cilantro, the better!!", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "My first thought was that is just another version of Chipotle but after a couple visits, I feel this place has its own unique experience.\nThe food are fresher and the line moves faster. \nI usually get burrito bowl with steak and add-ons for 9 bucks. Can't beat the deal.", "author": "Russ C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-23", "description": "I'm a huge fan of customer service and was a big fan of this place but I took a coworker here today and received major attitude from the employee making my burrito bowl. As he was making my bowl he put a small amount of rice in the bowl, it did not even cover the bottom of the bowl it was so sparse so I asked for a little more rice and he responded \"You should have asked for extra rice\" I responded back saying \"I can see far more bowl then rice, I didn't think I would have to ask for extra\". He put some more rice in the bowl then threw the spoon down and scooped my beans and threw that spoon down then tossed my bowl to the next employee and walked away. I was ready to just leave that place and my bowl but I hadn't eaten breakfast and it just wasn't worth it. Very disappointed and sad to say I will not be going back there. Additionally it seems like they're charging more for toppings then they used to.", "author": "Ra Sjeon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "I got my salad with meal pal and there's dirt all over the lettuce. I have eaten probably about 50 salads from this place and I'm feeling pretty disappointed at their lack of care.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Better than Chipotle's! The staff is always friendly, smiling, and attentive. I often hear the manager reducing the price when someone gets a simple burrito (like just beans, rice, and cheese). \n\nHouse salad is my go to lunch. No dressing (tasty without) and I get double jicama instead of chips. \n\nFull disclosure, I usually go in for breakfast and off-peak hours (because why spend half your lunch standing in line) so I'm not sure how they handle the \"pressure\" of the lunch rush.", "author": "Ruthe R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "I used to love this place because they use fresh ingredients and tasty proteins for great price. But ever since I start getting them on Mealpal, I've noticed that they start to skimp out on the quantity and ingredients in their salad. The amount of lettuces in my house salad today barely covered bottom of the box. There were also things missing from what's listed on the menu (probably too good at skimping lol).", "author": "Z P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Big fan of their cantina verde salad.Very generous portion sizes, everything tastes fresh, and I like the chicken and jicama especially. Seems packed for lunch though the lines move quickly. \n\nDefinitely worth the mealpal cost.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "My favorite salad place in sf so far!! You definitely get your bang for your buck, as my salad cost $7.95 for a make your own. I got half cilantro lime chicken and half tofu - both are highly recommended! I got a balsamic cilantro sauce (I think) and it was well balanced. Would come again!", "author": "Serena W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Awesome catering experience! We ordered a bunch of burritos from here for lunch. Everything arrived right on time and the catering director, Ada, did a great job setting everything up. The burritos were very tasty, I loved the fresh ingredients and flavors. My coworkers were all very happy with the lunch! I would definitely over from them again in the future.", "author": "Gabriela S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "I tried Cantina Verde today. I have to disagree with the comments that staff is friendly and helpful. They were actually very rude today and actually gave me incorrect information just to keep it moving.  I specifically asked if mango has onions mixed in and they said of course not.  Now, bringing the lunch back at my desk - mango has lot of onions in it - should have checked right then but I trusted them.  Also, even though I ordered house salad and I told them thats what I ordered - they charged extra for avocados (which is included in the house salad). I corrected them twice but they insisted since I said no to eggs it doesn't qualify as house salad.", "author": "Chintan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "I've been going to this place ever since it opened. Never again! First they raised their prices so that they are now more expensive than Chipotle. Then they started charging for cilantro. Now they are charging for onion as well (and who knows what else). This is ridiculous! Cilantro and onion are cheap things to buy. Nicke and diming patrons is no way to run a business. And they still don't carry hot sauce. Unbelievable. Never going back.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "Early to a meeting this morning, I had time for some food and the breakfast burrito caught my eye... but when at the ordering counter I noticed the carne asada burrito to be the same price $8.95 so I went for the real deal!  Clean and friendly, it was very promising.  As I selected my stuffings, I started with the rice... thinking it was dirty rice I pointed at the brown rice.  Staff told me it's brown rice.... so I chose the other one.  Needless to say, the rice was meh.  No saffron, no chicken stock flavor... nada.\n\nThen I chose all the other ingredients including my carne asada (had to mention it again).  All wrapped up, I tore into it.  So disappointing.  It was still flavorless.  No spices or salt on the carne asada.  Pretty bland.  So I asked for more salsa... still did not do the trick.  And sour cream is extra $0.50 btw....\n\nIt's fresh and saltless... no seasoning like garlic or ancho or saffron.... or whatever is in a good burrito meat.  Oh well.  Ate only 1/2 and that's all folks!", "author": "A C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "I work around the area so this is my go to place when I want a salad with a Latin taste. I have tried their burrito bowls and are satisfying but I always get a romaine salad with the chipotle dressing. This is by far the best chipotle dressing I've had. I always add the lime chicken, brown rice, corn, cucumber and chips to my salad. It's a good serving size, possibly even for 2 people. They have a decent variety of drinks. BTW they serve aguas frescas (definitely a plus for latinos)! \n\nService: They typically always have a long line but it moves fairly quick which I like. Reminds me of Chipotle serving system. Employees are nice and quick to take orders.", "author": "Rose M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Amazing breakfast burritos! The burritos are HUGE (mine lasted me three meals) - stuffed with eggs, your choice of meat (bacon, chorizo, or apple sausage), potatoes, beans, mushrooms, grilled vegetables, salsa, etc). It's a Chipotle-style restaurant, where you order at the counter and tell the person behind it what ingredients you would like to add to your meal. Choice of flour or wheat tortilla, and many other options for things to add. There was no line when I came in the morning around 8:45am, and the woman making my burrito was really nice. Every scoop of filling that she added was huge! Breakfast only is served from 7-10am, and their other lunch menu items are served after that.\n\nBreakfast burritos are around $7, and considering how much food you get, it's definitely worth it!! Such a big bang for your buck and delicious too! Will most likely be back to try some of the lunch items or even if I'm hungry in the morning for another (very filling) breakfast burrito.", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-03", "description": "Staff is a friendly. Clean place.  Open early. Breakfast burritos are just okay.  I've had way better burritos but like the fact these r semi healthy...spent about $10 on a chicken apple sausage, black beans, egg whites, guacamole, salsa, cheese, potatoes, on wheat wrap.", "author": "Jill P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-07", "description": "Seems like Chiptole clone, but with more options for fillings.  Doesn't compare to what you can get from a joint in the Mission or even a sketchy looking taco truck.  The burritos feel haphazardly thrown together with novice wrapping techniques.\n\nAfter I paid, I noticed I got charged 50¢ for chips, which I didn't ordered.  When I asked about this, the person at the cashier said it was because I got extra dairy; extra dairy being sour cream *and* cheese.  I pointed out the \"No Charge\"  section of the menu where dairy resided and the cashier admitted that the sign needed to be updated since many customers have complained about the charge.  Having created a bit of a backup, I was refunded that 50¢ probably due to exasperation.  The whole overcharging under the guise of \"No Charge\" rubbed me the wrong way.  And to boot, the food quality didn't make up for that snafu.\n\nCarnitas Burrito: The carnitas were tender, but they lacked any crispy ends that more authentic carnitas typically have.  The burrito wrap was loose, resembling a blob rather than a tightly rolled cylinder.  This made it sloppy... well more sloppy than a typical burrito.  The choose you own tortilla, rice and beans made it quite a heavy meal which would probably satisfy those focused on quantity at a reasonable price.  There were so many options, it felt like Subway.  But the risk of mass customization is that clients may not choose the best flavor profile.  It would have been nice if someone with a culinary degree curated a few themed burritos with well thought out ingredient pairings.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "It's pretty telling that in the two times I've tried this place, several months apart, there was a long lunch line, mostly suits, yet no one sitting at any of the tables. What's that about? I mean even at Chipotle, its obvious inspiration, there is always somebody who wants to sit under those weird faux-Mayan wall hangings and wolf down a burrito. But not at Cantina Verde, a rather generic place from a decor perspective, and I guess people just don't want to stick around. I sure haven't been tempted. It's not ugly or unclean, it's just, well, dull. Speaking of which, can anybody remember what their menu is (photo: http://bit.ly/1AswJmT)? That's probably because it's fairly identical to Chipotle's except they claim to be fresher and healthier.\n\nMaybe. But it's also a whole lot blander like senior-center bland. I ordered the same thing both times, the $7.95 Verde House Salad (photo: http://bit.ly/1PG6ErD). BTW, it actually went up by 45-cents between visits. The salad consists of a plastic bin full of Romaine lettuce (locally sourced, of course), grilled chipotle chicken, black beans, sweet corn, tortilla chips, cherry tomatoes, hard-boiled egg, chili-dusted jicama, cotija cheese and avocado, all of it doused in a chipotle dressing. The term 'avocado' is emboldened and underlined in the menu to separate it from all the make-your-own salads that don't offer it. All of it sounded just fine, and frankly it tasted just fine. It just made me feel like the nurse was about to wheel me back to my room after bingo.\n\nFOOD - 3 stars...bland Mexican food just seems wrong no matter how fresh it may be\nAMBIANCE - 3 stars...clean but apparently nobody likes to sit here\nSERVICE - 2.5 stars...automated with minimal eye contact\nTOTAL - 3 stars...hey, I'm not that much of a Chipotle fan either so what do I know?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "I went on a weekday for lunch and LOVED it! It gets packed during 12 and 1 pm. But the lines move fast so don't get scared by the long lines. \n\nLots of choices and pretty cheap ($8.50) and YUMMY! \n\nYou get a choice of mixed greens or lettuce as a base. And you can add your own beans/rice/protein/salsas/vegetables/guac/cheese etc. \n\nLove the concept and the food. Highly recommend it!", "author": "Hiral P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "Not here to discuss food though.  My issue is with their website and customer service.\nThe prices for food advertised on their website are not the prices when you walk in the door.  Very misleading.  I rely on the web search to find a place and I guess I don't expect the price on their website to be different.  They need to be consistent.  Also, I pointed (actually showed) the cashier the price difference and the fact that they advertise items for free (veges, etc.) when in fact they are charging for such items.  I was still charged $0.50 for a \"free\" item,.  The place reminds me of Chipotle.  I was not that impressed.  I can get a better deal at Chipotle.  Won't visit again.", "author": "Casandra B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "This is my go-to for a quick, healthy, solid lunch. I love the guys who takes your initial order. Great, quick service!", "author": "Danielle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "This place is like Chipotle but with less oily meat, avacados as an option for the bowl, and is maybe a bit pricier. The meats taste healthier and more flavorful, and you also have an option to do half-half for the meats!", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-10", "description": "Total Chipotle ripoff but clearly not as good hence no lines which is about the only good thing it has going. \n\nThe setup is exactly like chipotle - choose a protein, toppings, and add ons.\nI got a steak salad - portions a pretty big but the steak pieces were chewy/ tough and totally lacked flavor. \n\nThe rice was bland, the sauteed peppers/onion topping was mushy and somewhat bitter. The dressing looked like jar thousand island - so I passed. The salsa was odd - not light and refreshing but rather thick like a marinara sauce....the sour cream was watered down...you get the idea\n\nThe whole salad was odd and not one of my better lunches. Just go to chipotle - heck of a lot better.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Who cares if they're ripping off chipotle? They have better sauces, more selections, and cheaper prices.\n\nAnd in Fidi, can you really expect more?", "author": "Mingmei N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "House salad is one of my top items around for lunch.  Filling yet healthy.  Ton of great ingredient and price is fair.  Way better than anything you'd get at Specialty's for same price.  Excellent chicken.  Mealpal is a great way to enjoy as you skip line and save a little.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "This place is amazing, a real San Franciscan gem! Very healthy Mexican options from salad to bowls.  The service is really what makes it next level. Everyone is friendly and very helpful (plus it's quick) reasonably priced salad and burrito bowl for only 7.95.", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "Pretty good food, and ingredients, and packaged better than Chipotle. However, the chicken bone frag was an unexpected bonus (bone-us?) item. This wasn't nearly as traumatic as when the other poster found a carnitas bone the \"hard\" way, because no mere chicken bone is gonna crack my enamel. But it's still not pleasant to bite into your food and find something that can cut your mouth.\n\nSince this is the 2nd post regarding bones, might be time to look into the deboning process. I wouldn't want this spot's reputation to get ...fractured.", "author": "J S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-17", "description": "I had gone by this place a million times, but never gone in because the line is always insanely long - so I made a mental not \"must be good, gotta try\". The issue was when... Then yesterday I had a very late lunch so I walked over to Cantina Verde and there was no line. Score!\n\nJust like others have said this is Chipotle with more options - and so far no ecoli ;-)\n\nYou start with what you want (taco or burrito or whatever), then move on to what you want on it ans you move through the station. I had the carne asada taco (3). They were fresh and yummy. \n\nWill be back for a late lunch soon.", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "This place is a hidden gem in the financial district! Just go after 2 pm to avoid the lunch rush if you can, it gets a bit hectic down there! \n\nSuelia (Spelling may be wrong) was super helpful and sweet! Actually everyone who was there was pretty chill! \n\nI had a Chicken with Cilantro and Lime Burrito and the way that the Burrito was toasted and folded was just like how my buddy's mom used to do it for us back home in Texas! \n\nI also had the best Fresca Juice Ever! The Strawberry and Watermelon juice was to die for! Plus, they told me how fresh the food was when I cam in and it was vibrant and colorful and not like a cheesy or run down salad bar thing. I love that it looked so clean and fresh and they were so friendly and helpful! I was in a good mood when I walked in so I think that might of had something to do with it. \n\nThe burrito was not soggy or anything and it was filled all the way to the end and like a bunch of tortilla at the bottom like other places! I wish more people made it their burritos like this. \n\nThey are closed weekends which is a big bummer for me but I make it down there for a burrito about once a week now and they are probably my favrite place for a burrito in the City right now.", "author": "Adam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "This is my go-to place for a quick lunch. The line is always so long, but it moves pretty fast. I like it better than chipotle because you have more variety in your meats and veggies, and the salsa is delicious (and spicy!). I also love that they offer whole wheat tortillas, chipotle doesn't!", "author": "Trishna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Cantina verde is lovely Mexican outlet with good options of Mexican food like burritos n salads with includes of veg n non veg. For selecting salad bowl we can have our own options to have a salad and its yummy and healthy option too. Avocado is one of the famous fruit which is in green but not so tasty for me. But it's a good option to have in salad bowl. Along with bowl I had jarritos in tamarind drink it's a quite new to me and better than artificial drink. Finally a good visit.\n\nStore is quite clean and always popped up with crowd from 12-2 , they have quite limited seats to dine in. Staff is terrific in explaining the menu.", "author": "Sandeep R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-23", "description": "I'm giving this one star because the service was quick. My chicken bowl was ice cold, only got about 1/4 cup of rice and chicken had gristle on it. The black beans were okay. The place is a wanna be Chipolte. I won't be back.", "author": "Sharan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Great food, friendly service and body moving music make this a great local lunch spot. I'll certainly be back for lunch and any of our future company catering needs .", "author": "Roberta G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-12", "description": "the house salad they gave me today was missing 2 of the  ingredients.  corn and avocado", "author": "Richard M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "If I'm craving a Mexican/taco-style salad or looking for a breakfast burrito (with chorizo) to last me through the day, Verde is my spot! It's reliable, consistent, and my choice for salads (more lettuce options and toppings) and breakfast burritos (chorizo! yay!) when compared to Chipotle or other fast casual Mexican spots. Many times, I'll get the salad with just lime instead of dressing. The chicken is so flavorful that you don't really need the additional calories in a vinaigrette or creamy sauce. You can get a meal for less than $10 that will keep you full for the rest of the day. The components taste like they're cooked fresh daily and the employees always serve you with a smile. Finally, my favorite part about the burrito is that they automatically toast it for you (crisping the tortilla and softening the cheese).", "author": "Tammy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "The food here is very yummy. I like to eat it. The staff is very nice to me. There are tables there so there is a place to sit and I can eat it there. They also allow me to take food to-go which is nice. The food is very healthy so I will be strong after I eat it. They have a lot of vegetarian options so I don't have to eat animals.", "author": "Ken K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "I don't think you can get a salad better than this!  I joined Mealpal in SF.  For about $5.11 a day, you get 12 days a month to try different restaurants form a group of menu choices for the day.  They have other plans for 30 days or less days.  That is how I found Cantina Verde.  I have to say that this is the best salad yet - fresh and tasty...  great lettuce, avocado, beans, spiced jicama, great chicken (grilled and seasoned) and a fabulous southwest dressing that was not too little or too much.  It was a large salad and I won't be hungry anytime soon.  I will definitely go back.  I looked up the calories online and it is 600 for this salad - well worth it!  Ole!\nI should add that it is hard to find - around the corner from the listed address of 398 Market Street...  look for the sign on the sidewalk - shown in one of these pictures...", "author": "Winston O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-05", "description": "This place used to be my go-to! They are a little more stingy on the portions now and the new staff isn't as friendly as the prior ones. The man with the mustache who I assume is the owner/manager is great but hardly there now. :(", "author": "Eve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "SO FAR I'M A FAN\n(4 stars)\n\nJust another boring FiDi food review. Skip if you please.\n\n-FOOD, good\n-PRICES, affordable\n-SERVICE, quick\n-AMBIANCE, like chipotle but better\n\nWhy is it so difficult to find a decent salad (that's healthy), preferably not costing an arm and a leg, in the FiDi? Don't think this place is about burritos because it's not. The line moves fast. The concept is very much like Chipotle BUT FRESHER AND MORE SELECTIONS. Different rice, different taste in their meats, and a variety of add-ons at the end. When real Mexican-Americans make your food, Mexican music playing in the background... you get that \"Mexican\" feel with the \"Chipotle\" flair.\n\nHEIFER STATS.\n\nSALAD BOWL ($6.50) - that's a decent price for salad in FiDi. Choice of mixed greens or lettuce. Chose mixed greens. Jalapeno white rice or cilantro brown rice. i'm a sucker for cilantro - went with cilantro brown rice. I rarely eat (red) meat and went for carne asada/steak for protein (hitting the gym hard after work), skipped on a bunch of roasted veggies and added the roasted zucchinis, JICAMA (wow what a great selection for salad add-ons), dabble of shredded cheese, and chose the cilantro vinaigrette (although i'm not adding any to the actual salad). The portions are great for one really hungry person or two semi-hungry people.\n\nGUACOMOLE & CHIPS ($3) - typical tortilla chips. The guac. is really good here. I'm not sure how or what was mixed in but it was just tasty. \n\nWATERMELON FRESCA - refreshing. Starting to feel like summer. \n\n\nWill I be back? Sure why not.\n\nUntil the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "The price point makes them a winner when compared to Chipotle. I went with the bowl but the salad looked big when compared to their competitors  \nFresh ingredients and a couple more add on choices like fresh jalapeños and mushrooms. I think they had some sauteed fries looking potatoes? too. The fresca was good\nDefinitely has potential.\nWill go back again", "author": "Sam K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "Second day of MealPass, and I was praying to the FiDi salad gods that they would deliver unto me a better salad than the one I had the day before. I ordered the Fiesta Salad at Cantina Verde, and it was just middle-of-the-road lunchtime fare. The salad was a better size and had more vegetables, but the cheese melted in a pretty unappetizing way (see picture). It had a good amount of chicken, though, so that was nice. Nothing special, but giving this a solid 3.", "author": "Shayna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "Was so happy to see this place open up right across from my office building.  It's like a healthier spin on Chipotle.  You have your choice of burrito, tacos, and salad bowls with grilled chicken, carnitas (braised pork), carne asada (grilled steak), grilled & roasted vegetables and even braised TOFU. Wow!\n\nI came here for breakfast today after I saw that it had newly opened about a week ago.  I got a breakfast burrito it was so delicious! I really loved the fact that you have a choice of flour or wheat tortilla.  You also had a choice of regular eggs or using egg whites.  I wasn't going to put any sausage or bacon but couldn't resist when I smelled the chicken apple sausage and the bacon and was able to get half and half.  Had some chipotle to top the burrito which gave it that extra umph! It was very filling. \n \nThe owner was giving complimentary green juice, he said it has spinach, ginger, apples, pineapple it tasted refreshing and I felt healthier just drinking it. \n \nThe place is clean and well maintained.  I am sure it is going to do really well because their ingredients are good and they put together good and healthy simple Mexican fare.  Four stars!", "author": "Maria M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "good food but again w/meal pal since they make alot of the same thing for those meal pal customers the product isn't as great.", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Yummy food especially there breakfast burritos! I've heard good things about there catering as well. I'll have to try them. Very friendly staff. Will go back again.", "author": "Roxy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-25", "description": "This place has really good fresh food but it is so unfortunate that they purposely give the smallest portion so that they can force to pay extra for everything. Every time I go there they give you less and less. Not paying for their food anymore. Chipotle is so much better at give you the portion you are paying for.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "It's not on Market Street so the address is confusing.  It's on the corner of Pine and Front.\n\nI had the carnitas burrito on whole wheat tortilla, with black beans, brown rice,  cheese, grilled onions and mushrooms.\n\nAll I could do was point at what looked good. Nothing is labeled so I felt I wasn't able to get exactly what I wanted and probably missed something.  \n\nI thought the price was fair and I shared the burrito and it filled us both up. But I probably wont go back", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "We came by this location - mostly because it was a coworker suggested it being a better alternative to Chipotle. It's a bit further from work, but honestly, I'm always up for a good walk around Fidi. \n\nI ordered the verde house salad: romaine lettuce, chipotle chicken, black beans, sweet corn, chili dusted jicama, cherry tomatoes, cotija cheese, hard boiled egg, tortilla chips, and avocado. with homemade chipotle dressing - and it was delicious. I think there could be some tweaks to the salad, but it was pretty good otherwise. Always ask for the dressing on the side because you can then track how much you're using rather than what they're putting in. \n\nThe next time I went I got a burrito bowl. Similar to the bowls at chipotle, you can choose what to go in it. Not in love with the process since it was a little too quick especially since I've always gotten the bowls at Chiptole. \n\nProtip: the salads are great!", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-20", "description": "Sometimes the financial district of San Francisco reminds me of cable tv. All these channels I flip through on my remote, and there's nothing I'm interested in watching. That's how I feel as I aimlessly walk down each street in the financial district. Sure there are places to eat but nothing that I'm interested in eating at the moment. There's only so many Subway sandwiches, Lee's deli, and McMuffins I can eat before I want something new or different.\n\nCantina Verde provides a niche that is a refreshing change from the usual. The other day I passed by Verde and decided to try them out. They have regular burritos for lunch but I arrived around 7am. So the only option of course is a breakfast burrito.\n\nSo the friendly lady that makes the burrito asked me which wrap I preferred, wheat or flour tortilla. Then I got one choice of meat, vegetable, eggs, salsa, and sour cream which they actually charge an extra 50 cents for which is kind of nickel n' dime'ing in my opinion.\n\nOverall I thought the burrito was a tasty, good-sized breakfast for $6.47 total. Would I go back again? Absolutely. It's a good option in a area filled with options I don't want. Now where's my remote??", "author": "Michael L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-10", "description": "Hmm, I a bit undecided on where to rate Cantina Verde, so I'll do 3 stars and update this if something bumps things up a bit to 4 stars.  I'm rating this a 3.5.\n\nI'm going to base my rating on a comparison to Chipotle.  I would rate Chipotle 3 stars as well.\n\nThe food at Cantina Verde tastes better.  I like the meat (carnitas in particular) better here.  I also like the flavors of the salsas better and I like the grilled peppers much better.  They also have a bit more variety here, but the menu is a little confusing and it is hard to figure out what is included and what costs extra and they don't really do a great job explaining it.\n\n6.95 is your base cost for tacos, a burrito, a bowl etc.\n\nUnlike Chipotle, you only get cheese or sour cream.  If you get a bowl, you can't get a tortilla or taco shells on the side, that is also extra.\n\nThey also don't fill the bowls up as much as Chipotle.\n\nThe guacamole is less expensive here and I did not have the chips.  A co-worker said that they did not like the chips very much.\n\nCantina Verde does have more options of things you can put in your burrito, but they all cost extra for the most part.  Make sure you check before you add something unless you are ballin and don't care.  If that is the case, add whatever your heart desires.\n\nThey also have agua fresca available, but I haven't tried them.\n\nThey have Dr. Pepper as a fountain soda option, thumbs up for that one.\n\nFrom the reviews I read, they recently raised their prices up from 6.45 to 6.95.  It still isn't bad at 6.95, but 6.45 is better.  :)\n\nFrom what I've read the breakfast burritos are pretty good, so maybe I'll have to check that out one of these days.", "author": "Ty C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-14", "description": "Imagine Chipotle only with a ton more custom options. They offer up an array of veggies/sauces and proteins to please anyone + 2 options for tortilla (wheat or flour).\n\nThe burrito was filling but felt all the ingredients lacked flavor and salt. With a little adjustment I feel it could be more worth wild then going to Chipotle. \n\nOverall Thoughts\n\nChipotle might have some competition after all", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "I like this place because it has so many more options than its rival, Chipotle. The price is decent... or should I say the BASE price is decent. They really nickle and dime you for the ingredients that blatantly say \"NO CHARGE\" on the menu... First of all, they are REALLY stingy with their toppings, so when I asked for a little extra cheese on my burrito bowl, I was then charged 50 cents for \"Extra Dairy\" (as the employee wrote on top of my lid). I was so confused as to why I was being charged extra for \"No Charge\" toppings.... Makes no sense at all. Not to mention the mean scowl the woman gave me when I asked for a little more. Yes, lady, you are an inadequate scooper and I like more than 6 strands of cheese... deal with it.\n\nIt honestly put a bad taste in my mouth (no pun intended) after I left, that I'm not sure I feel like coming back. Which is a shame because I came here often and this is a new development in recent weeks. I realize it's /only/ 50 cents, but it's more about the principle. \n\nNo charge should mean no charge. If that isn't the case, update your menu to reflect the correct prices.", "author": "Kelly E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-19", "description": "Cantina Verde is a restaurant located in the Financial District of SF between Beale and Fremont right off Market Street on Pine Street. This is one of the restaurants offered on MealPass (now MealPal) that sold what looked like a healthy salad, which is exactly what I was looking for for lunch on my visit.\n\nFREQUENCY: I've ordered at this establishment three times.\n\nFOOD: Cantina Verde offers a pretty hefty salad. It's pretty rare that I get a salad for lunch and am not hungry for something else two hours later. The salad kept me satisfied until I got home for dinner. The ingredients all tasted fresh and made for a good lunch. I've been three times now because whenever I'm looking for something healthy that I know will also be a real meal, Cantina Verde seals the deal.\n\nDRINK: I have never ordered any drinks while at this establishment since I'm always ordering and then bringing the food back to my work place. As with any restaurant I assume they have the standard assortment of fountain drinks and water.\n\nATMOSPHERE: Cantina Verde has a pretty standard made-to-order style atmosphere. I wouldn't say anything unique or special stands out about it. But at the same time I can say nothing bad about it which is a win in my book. Pro tip: the line can get very long so try and get there for lunch early.\n\nSTAFF: I've only ever talked to the staff when picking up my food. Every time the staff has been incredibly polite during the quick process.\n\nPAYMENT: Credit cards or cash were acceptable.\n\nI haven't had anything but the house salad so I can't say much as to whether or not Cantina Verde will blow you mind food wise. I think I'll have to stop by another time and see what else they offer on their menu. But that aside, if you want a decent salad that will definitely fill you up given the portion size then Cantina Verde is a good stop. A recommended place for lunch in the Financial District.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-08", "description": "They rushed me so fast through that assembly line that I didn't get what I wanted. All I needed was an extra 20 seconds to elaborate what I wanted as my toppings. My order now has missing lettuce but they gave me the ever-so-hated cilantro. Hard to palate.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-11", "description": "A solid three stars. Satisfied my rainy day hunger pangs. I walk by this place every day to and from work and always considered it to be similar to Chipotle. I came in during an off hour around 4:30. Kinda random that they close at 5 on weekdays, but I suppose since they are open for breakfast, it's a push.\n\nI ordered a carne asada burrito and though it was so-so. Smaller than I expected, and the meat was pretty dry, but overall the taste was good. I know this had a lot to do with the chipotle salsa I doused over each bite. Also, please give free chips. For an almost $9 burrito, come on. Who is with me?!\n\nNot sure I'd race back in, but considering there are very few Mexican spots near my office and apartment, who knows, maybe I will.", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "It's average. The food needed salt. This cannot compete with my taqueria pancho villa.\n\nOrdered carnitas \nAvocado\nPico de gallo\nVeggies\nCheese \ngrilled onions\n\nNeed gravy\nOr\nSomething to flavor it with.\n\n\nSalsa was ok\n\nAlso\nWhy is there food not hot but lukewarm.\nI ain't digging that.", "author": "Charlene C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-06", "description": "Stingy Chipotle clone. I don't like rice and prefer beans. These guys are like the Soup Nazis. Another scoop of beans and they want to charge you. Everything is really extra. Order the tacos and you'll get almost nada on them for the same inflated price. They pretend it's your way but it's nothing of the sort. The people are likewise brainless and not customer service oriented. Very low quality experience. Save your $$ and go to a real Mexican establishment not some corporate fast food cultural appropriation.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-08", "description": "The carne needs more time in the asadafier.  \n\nThey'll give you real jalapenos, so that puts it ahead of a lot of the crap food around here.", "author": "Jared L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Just used a gratis MealPal from a friend for their house salad.  Man, was that satisfying and yummy!  Filling, spicy, delicious!", "author": "Donna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "New work office location = finding a new place for breakfast burritos.\nCantina Verde doesn't disappoint! HUGE breakfast burritos for $4.95. Choice of wheat or white tortilla, choice of egg whites or regular eggs, choice of meat, and choice of toppings incl fajita veggies/beans/potatoes/salsa/etc. \nBreakfast hours are 7-10a.\n\nI also stopped in for lunch and their bowls are pretty good as well. Good portions for a small price.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "This is the best place in FiDi (Financial District). They are so well priced and you get a ton TON of food. Especially the salads. I come here often and will continue to", "author": "Michael J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-30", "description": "We all are guilty of putting a person on bootycall status once in our lives.  And we all are guilty of putting a so-so place on bootycall status when we are too lazy to go all the way to the original place we want.  So would Cantina Verde be a bootycall for Chipotle?\n\nI was grabbing lunch with a friend nearby (Chipotle is actually closer to my office) and we decided to check out to Cantina Verde. I decided on a burrito bowl and she got a salad.  While CV gives you more options with fillings the rice is so much better at Chipotle!  Fillings include: mixed veggies, mushrooms.  The menu however isn't clear, like I wanted some mixed veggies instead, but they told me I couldn't get any more toppings because it only includes 4.  The carnitas was fine, but I felt like my dish was a little on the bland side, and unlike Chipotle they don't have some assorted hot sauces on the side to top it with.  My burrito bowl was about $7, so more or less slightly cheaper than Chipotle.  Line gets long during the lunch rush but moves quick enough.  Would I go back?  Maybe if I wanted something Chipotle like & was closer to it than Chipotle.  Maybe I should try one of their much talked about breakfast burritos if I'm nearby one day.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "My favorite foto lunch.  Long line goes very quickly.  Staff are super friendly and make my day brighter with their quick chat.    The food is super fresh, excellent ingredients and fantastic price.  Can not recommend this lunch spot enough.  Six stars!!", "author": "Annette M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I love the verde house salad here. I get it for Meal pal almost every week. The quantity is really good and the salad is fresh and tasty.", "author": "Haritha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "This is basically the pumped up version of Chipotle. Fresh ingredients, large portions, and it's delicious! I got the cantina verde featured salad! You can choose romaine lettuce OR mixed greens! Ask for mixed greens, if they just hand you romaine. \n\nI also substituted the tortilla chips for mushrooms! The salad was really tasty, and you can shake it up with the dressing inside of the box! \n\nGlad this is an easy option around! $8.16 was the total for the verde salad! :D", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "obsessed!!!! eat here almost every day\n$6.50 (edit: they just raised to $6.95 over the weekend :P) for MOUNDS of delicious Mexican tastiness\nI go for the romaine salad with tofu (or chicken)\nif you get tofu, you get 3 additional roasted veggies\nthen the cheeses\nthen the salsas\nthen all the raw veggies\nthe jalapenos, don't forget your jalapenos\nthen the dressing\nso good so good so good!!!\n\ni hope they get a loyalty card ^_^", "author": "Kristal N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Fresh food peppered at break neck speed... Perfect for a rushed lunchtime meal that is healthy and well priced. It has huge lines that move very quickly so don't be put off of the line is out the door (which it often is and for good reason!) very similar to Chipotle but fresher cheaper faster and bigger.  Highly recommend the ochata", "author": "Robbie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-14", "description": "Price is now the same as Chipotle, but Chipotle tastes a lot better.\n\nThe last two times I had their salads, I had a mild case of the runs, don't think I'll be coming back.\n\nNotes:\n- Warm toppings on cold salad greens = unappetizing\n- Their cooked vegetables always kind of give me that oily after-taste in my mouth (no bueno) and the zucchini & squash don't go well in a bowl. Who thought of this? They're always super watery b/c of the mushrooms too. \n- Their black beans seem like they come straight out of the can, just heated.. meh\n- Their salsas leave something to be desired", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "This was my first time visiting as I was picking up an order for my co-worker. As I watched the nice lady make this enormous breakfast burrito I couldn't help but want one too. I ordered a chorizo and bacon breakfast burrito and not only was it feeling... It was good as hell! I'll be back for sure!", "author": "A. C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "Just another FiDi lunch place review...\n\nPlant Organic's line was just insane so we crossed the street over to Cantina Verde. \n\nSince everyone is making the Chipotle comparison I guess I'll follow suit. I'm not really a huge fan of Chipotle but they surely have this place beat in the taste department. The flavors here just were not there. A small dash of salt would go a long way and it looks like I'm not the only one who has noticed the lack of taste in their food. \n\nI did however enjoy the fresca but only because I tend to like it not too sweet. Free refills. \n\nMexican cuisine is pretty flavorful and somehow this placed managed to make it bland.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "Fun new place in the FiDi with some really friendly staff!  It's Chipotle-esque concept is definitely not original, but hey, sometimes you need a change.  And, sometimes I just don't want to wait in the REALLY long line either.  So, Cantina Verde was a great place when I was in a hurry and in need of a customizable lunch.  I will definitely be coming back, I especially like all of their toppings and add-ons, with the exception of charging for teeny avocado slices.  Meh. That aside, I really like this place!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "Awesome budget lunch spot :) for 7 bucks you get a big fat burrito or a big box of salad. \n\nIt's a better version of chipotle - can't expect it taste like really Mexican food but I love the fresh ingredients that they offer. It's healthier. \n\nIt's usually packed during lunch hours so I go there in the late afternoon. \n\nThe staff are friendly and efficient.", "author": "Sophia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "This is one of my usual lunch spots. People are complaining that this is a Chipotle knock off and its not authentic but what do you expect when you order a burrito or a salad. It is similar to Chipotle but there are some notable flavor differences, in my opinion better. \n\nI usually order a burrito with chipotle chicken, white rice, black beans, bell peppers, cotija cheese (a salty cheese which maybe why I love this place so much) and chipotle salsa. \n\nSometimes, the lady sprinkles cheese and salsa which is a little annoying. The guy at the front is very nice and friendly. He is saving grace of the customer service", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "I am a bit of a breakfast burrito fanatic.  I used to get my fix at Un Dos Tacos until I found a long, thick black hair in my burrito a couple of weeks ago.  I have tried Caramba and Rico Mex since then.  They were okay, but nothing to write home about.  \n\nThen today I decided to get off BART at Embarcadero because I was restless after a stop and go ride and remembered that I had read that Cantina Verde was open for breakfast.  The overall reviews I read were mixed, but the ones about the breakfast burritos seemed mostly positive. \n\nI am SO glad that I decided to try Cantina Verde this morning.  I have now found my go to breakfast burrito place.  It was a bit more expensive than the ones closer to my office, but a lot bigger and SO MUCH tastier.  Rather than nickel and dime you for each add on, they charge a flat $5.95 plus tax for all the fixings you want (other than avocado or guacamole).  You get eggs or egg whites, choice of meat (carne asada, chorizo, sausage, or bacon), choice of beans (black or pinto), choice of salsas (you can get as many and as much salsa as you want - green, red, or pico de gallo), plus you can add grilled peppers and/or onions, and/or mushrooms, potatoes, as well as cheese and/or sour cream.\n\nI went with eggs, chorizo, black beans, green and red salsa, grilled peppers, potatoes, and cheese.  It was one of the best tasting breakfast burritos I've ever had, and I was full for over five hours.  It was more brunch than breakfast.", "author": "Vanessa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Overall, I'm a fan of this place.  Yes, it's a blatant copy of Chipotle, but the food is a bit better and seems fresher.  The cilantro lime chicken is a favorite.\n\nSome of the items are really salty, which is why I knocked off a star.  I also wish they had spanish rice, not just white and brown.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-12", "description": "It was 12:45pm today and I had a hankering for a quesadilla! I've had quesadillas there before and they are pretty good. I waited in line for almost 15 minutes and it was finally my turn...I was so excited because I was starving at that point. I get to the front, and the man who is always the first guy in the line, asks what I would like. I politely asked for a quesadilla. He huffed and puffed and said, \"it's too busy to make a quesadilla. We don't make them between 12 and 2.\" WTH!!! I waited in line for 15 minutes for that answer?! Nowhere does it state that in the place! If I had known, I wouldn't have wasted my time waiting in line. I was astonished and just left. Chipotle has much longer lines, and they are never \"too busy\" to make me a quesadilla. I will never go back there. In the amount of time the guy huffed and puffed, he could have made me a quesadilla! \n\nThey forever lost my business to Chipotle. I can always count on Chipotle.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "I'm horrified it took me so long to update my lukewarm review. The issues have been resolved and this place is now far superior to Chipotle, at least for my purposes. A few points:\n\n1) They actually know how to cook and season beans correctly.\n\n2) They selection of veggies you can add to your order is really not something I've seen anywhere else. It's almost a cross between Chipotle and Mixt Greens in that regard.\n\n3) Fresh avocado slices!\n\n4) The habanero sauce... oh my god, so hot; so good. And if you ask them, they will smother your meal in it. \n\n5) Everything just seems fresher than Chipotle... it's really hard to put your finger on, but it's the case. \n\nI love this place.", "author": "Logan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "I love this place. Fresh, amazing food and even if the line is long at lunch, it moves pretty quick. Staff are always helpful and courteous. One of my favorite lunch spots.", "author": "Jessica X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "For at least the first 3 days this place was opened, they served free breakfast and lunch. I went in for one of the breakfasts and got a legit breakfast burrito. 1. It was big 2. It wasn't generic 3.I had the option of getting egg white,  real avocados, and wheat tortilla.  A Healthy, delcious breakfast burrito!? I have died and gone to heaven.\nOn top of that the employees were sooo friendly and so nice. They were giving us free burritos, they didn't expect a tip, and they were genuinely smiley and genuinely nice. \nI love you, Cantina Verde. And I am so glad that you are across the street from my work. Now I have an alternative for that overly priced Plant.", "author": "Julianna I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Great food... found this place while shopping and decided to give it a try. I'm glad I did because the food is fresh, tasty and health. I definitely will be back. I give it 5 stars...", "author": "G R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "This place has the best, freshest ingredients. Made to order, always super fast friendly service. I eat here at least once a week.", "author": "Justin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "Hands down better than Chipotle! You can taste the freshness in their ingredients and they have better sides. I love how they have mushrooms, different cheeses, and jalapenos. The portions aren't huge like Chipotle but it's cheaper so you're still getting a bang for your buck. The line is always long, but it moves fairly quickly.", "author": "Irma R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-12", "description": "I ordered 2 bowls and 1 burrito. It's true what the others have said.   The music was loud so you have to shout for the staff to hear you over the glass panel.  The lady in front of me kept saying, don't leave my tortilla in the heater too long I don't want it crispy.  She must have said it three time until I couldn't take it any longer and shouted her directions to the staff member. \n\nAnyway, they should really think about investing in slotted spoons for the beans because when they scooped them up, they took a lot of the water and that soaked the burrito and nearly decomposed the paper bowls.  Really, they should think about investing in either slotted spoons or aluminum bowls.   Chipotle got it right with the aluminum bowls.\n\nThey were cheap with the protein but generous with the veggies but again, we have the soggy, decomposing issue. \n\nAnother thing, I asked for 2 soft tortillas so I can make my own wrap from th bowl. The worker repeated \"2\" but she only gave me one. What gives?\n\nIt was ok but not as good as Chipotle.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "This house salad is becoming addictive! I'm about to brave the rain and head back to my office...but not without this yummy salad. It's the only thing I consistently get here as I find \"down home\" Mexican goodness at competitive restaurants closer to Mission, but as far as salads go, I'm sold!", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "A great alternative to Chipotle. I always get the salad,  and the portion here is much larger. The carne asada here is a little drier, but the chicken was good. There are TONS more toppings here. It's not immediately obvious which toppings are free, so be sure to ask them. Another reviewer commented on a lack of labels and a feeling of being rushed--this was definitely true. The price was like $7.50 for base price of anything, but $8.50 if you want carne asada. Great deal, great food, and you will get your food very quickly. I will definitely be returning.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "This place is an amazing gem. \n\nTheir lunch menu is pretty typical of an establishment like this and has many similarities with that of Chipotle, except you have a few more choices in meat and can top off additionally here without ridiculous pricing.\n\nWhat I really want to emphasize here and place in focus is their breakfast menu. I am a big fan of their breakfast burritos here. The staff they have in the morning is extremely chipper and they brighten up my day. Along with the most humongous burrito for $5.99 with my choice of meat and either regular eggs or egg whites. \n\nI have not been able to finish a breakfast burrito here. I usually split it and have half for breakfast and half for lunch.\n\nIf you're on a budget in the FIDI but need a power breakfast to carry you on through the evening this is the spot. It's a no fail because the combination of great service with a smile and awesome food make it a seller!", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "Cantina Verde reminds me a lot of Chipotle in all the good ways.  Great and fresh selection of meat and sides.  There was a line out the door so you know they have to be on to something.  I got a bowl with the chipotle chicken and it was really good.  If it was closer to my place I'd come here more often.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Yes it is similar to Chipotale style but few different choices. \nFor example, you have mushroom/zucchini -squash along with bell papers.  They offer chunks of tofu plus choice of wheat tortillas. Avocados are considered as prime item and can cost extra $1 here. \nI have tried tofu burrito/bowl with 3 free vegetables few times. I liked the variation and found it very nice.\nWhile ordering pay attention to 'No Charge items' and avoid using word 'extra' ;)\n If you stick to defaults, then it cost you 6.95$ with good portion to eat.  Some servers do inform you about extra charge if you choose unconventional path. They also offer signature salad at 7.95$. Salad seems to more popular here and will try some time.", "author": "Sunny G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-30", "description": "Worse ingredients, worse food, Cantina Verde. \n\nChipotle me-too restaurant with little flavor. \nI had the Steak (beef) Burrito on a whole wheat tortilla. \n - Tortilla was unsteamed; Beef actually ok. \nIncluded was pinto beans, cheese, guac, fresca and hot salsas. \n- Plain, needed salt and spice. Clearly corporate culture voiding all flavor. \n\nWould go to Chipotle as an alternative. \nWould go to Tlaloc by choice.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "Further from my office than Chiptole, but comparable. My friend and I were the VERY LAST people they let in during their opening week of free food. We both ordered the burrito bowl, he had already been in for the breakfast burrito and said it was very good. \n\nPros: Lots of options for additions: guac or sliced avocados, sauteed veggies, tofu.    I'm not sure if they up-charge for things like guacamole since it was free at the time. They give a large portion of beans and meat, which is important to me. Everything is the same price $6.50 for 3 tacos, a burrito, a burrito bowl, or a salad.\n\nCons: The salsa was not spicy, the rice was undercooked, there was no lettuce to top off the bowl (maybe because we were the last people), the staff was not trained on what was what in the array of food, and the guy making my bowl put soo much sour cream and advised that the red salsa was spicy (as noted, it was not).\n\nThey certainly have some kinks to work out, but it's a starting business so it's very understandable. It's probably hard to compete with all the places in the FiDi, and it's going to be hard to beat Chipotle's limesalt chips. I will certainly be back to try again. Good luck Cantina Verde!", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-26", "description": "No. On the surface this places look innovative and delicious, but it IS a ripoff of chipotle and really not enough flavors in their ingredients. Portions are small where are you're bowl is half empty, bland, and ultimately unsatisfactory. U get like 2 ingredients before you are charged extra! There's plenty of other bowl/burrito joints nearby so for this one I'll pass.", "author": "Daniel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "This is where all my money would go every day for lunch.\n\nThoroughly enjoyed the salads here. Salad portions are huge and only cost ~$9. Customer service is EXCELLENT. Line moves fairly quickly. I also love how they have fresh jalapenos.\n\nMinus one star for possibly giving me food poisoning. Since I probably ate other questionable things that day, the 4 star rating stays.", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-26", "description": "I wanted a light breakfast, little did I realize I was getting a gut bomb which was rather expensive for breakfast. I just wanted a simple taco, but they don't have this so I got the burrito bowl which was massive and filling. None of the items in the bowl were particularly great, but they weren't horrible either. Might as well go to Chipotle for better food, which is also a meh...", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Great service + fresh food. Great spot for vegetarians and vegans. Items are customizable and there are great veggie options.\n\nThe food is well priced at Verde. You can get a filling salad for under $8.00. Their breakfast servings are very filling as well.  \n\nFinally everything at Verde is very clean - you'll want to take a seat and eat here.\n\nSay 'hi' to Alex who is always working with a friendly disposition and the efficiency to keep the line moving and food tasty.\n \nEnjoy!", "author": "Maude B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-11", "description": "Went here with my coworkers for a lunch break around noon. Hectic as always, the line snaked around the corner in a what seemed like an irritatingly long line. Luckily, this didn't prove to be true. \n\nWe were able to quickly pass through, almost too fast tho, as I barely had time to dither between all the different fresh options -avocado, black beans, corn, overwhelming array of choices- I ended up getting a house salad with everything on it upon my coworkers advice. \n\nA great choice! Paired with my sandia agua fresca, it made for a refreshing and (what I hope was) healthy meal. It was great for the price, a pretty hefty amount of salad with good chicken breast to jicama to corn ratio. Don't forget to squeeze a lime!\n\nOverall, not bad food, seating was limited, but I was prepared for it. Definitely a convenient and solid stop if you're in a hurry and don't feel like trekking over to chipotle.", "author": "Oliver C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Been eating here for quite a while. Basically Imagine if Chipotle wasn't as horrible for you. The meat is much better quality and I love their red and green sauce. Big lines at lunch just like everything else, but I would defenetly say it is worth it.", "author": "Ozzy I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "They increased the size of the salad close to it's original quantity...Still not to where it was initially but pretty​ close", "author": "Sanam H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-06", "description": "Seeing that the place look clean and always packed with people, I thought: \"Okay, I will give it a try\".  After all, what could possibly go wrong?\n\nA lot could go wrong, as I found out.\n\nThis place felt like a mildly upgraded Chipotle, and I must say that I was quite impressed initially.  My first bite into my carnitas burrito was aromatic and full of flavor, that I actually vowed to never go back to Chipotle again!  But something bothered me... Something...  (crunch crunch).  Oh yeah, the rice was under-cooked and crunchy.\n\nFew things bother me more than crunchy rice. Seriously, rice is not that difficult to cook. To make it crunchy is just inexcusable. A bit more water and a few minutes longer in the steamer would've been nice. For the rest of my burrito, I just could not shake my hatred against the crunchy rice and focus on the nicely marinated pulled pork (carnitas).\n\nThen, there's also the kitchen... It was nice and clean at first glance. But I made the mistake of sitting at the bar/counter in front of the kitchen, and witnessed the horrors that goes on in that kitchen first hand. \n\nFirst off, the chef cleaned the grill with a short-bristle broom.\n\"Surely it was a special grill cleaner!\" You protest.\nNo, it was a broom. With a long handle. Designed for sweeping.\n\"Then it must be used only for cleaning the grill and kept clean!\" You suggest.\nNo. It went back down to the floor after use. With the bristle end on the floor!\n\nThen, there's the bucket of murky water used for cleaning EVERYTHING.\n\"Oh come'on, it was for the counter top only!\" You defended them.\nNope. It cleaned the cutting board as well.\n\"Then it was only for cleaning fully cooked stuff!\" You yelled.\nNope. It wiped up blood and marinating juice from raw meat containers too.\n\nTo be fair, most restaurants probably would be guilty of the same shenanigans. But those restaurants do them behind the door, out of sight. They don't do this in plain sight to gross people out. Seriously. Bucket of yuck here!\n\nI don't want to be mean about it and give this place only one star. After all, it's not like they molested my dog and set my jacket on fire out of malice or something like that. But the poorly trained kitchen staff who decided to put on a terrifying display for everyone to witness, and the carelessly prepared rice that was supposed to be fluffy but ended up crunchy made me wishing to never come back again.\n\nSuch a pity... The carnitas really was quite tasty.", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "I'm a regular here :)\n\nThe house salad is bomb.\n\nI ned to try other stuff as well", "author": "P D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-02", "description": "Fresh and better flavor a than Chipotle. I think they have more options as well and the price is really reasonable. The staff has always been nice the times I have gone in there.", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-12", "description": "I always get the salad here. It's pretty hearty and decent quality. The salad dressings are good too. The amount of ingredients is a little haphazard but it's a great lunch option for the area if you don't want to spend $10+ that's common in the Embarcadero area. Maybe some time I'll try the burrito bowls or burritos.", "author": "Elsie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-04", "description": "Had a huge caterpillar in my salad. No one should eat at a restaurant with this kind of hygiene and quality control.", "author": "Angie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "Great Mexican to go spot. It's like Chipotle but cheaper with the salad option. I especially like the fact that they have jicama. Their line is not too bad and moves quick. $7.60 for a carnitas salad is fair/reasonable.", "author": "Tracy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "Plagiarism is the sincerest form of flattery. As a Chinese guy who's been to the mother land of knock-offs, I can always appreciate a quality replica when I see one. Who wouldn't want a Bolex watch or a Sorny TV =P  ? While many have referred the newcomer, Cantina Verde, as a copycat Chipotle or 'Fake Chipotle' as my co-workers have coined, the subtle additions that Cantina Verde offer, makes it very distinguishable. Does Cantina Verde borrow a concept or two from Chiptole? Sure. A simple menu of the traditional burrito, burrito bowl, salad and tacos, all customizable to your taste and preferences. Comparable price point. Quick in and out service. But it's the plethora of additional veggie options and variations of proteins that make Cantina Verde a worthwhile experience, even for the biggest Chipotle loyalists. \n\nI crammed my burrito bowl with white and brown rice, two types of chicken, no beans (musical fruit), fajita style bell peppers, zucchini, mushrooms, mild salsa, avocado, tomatoes, corn, two different types of cheese and lettuce. A titanic work of art so large the lid would not contain all of the goodness. An amazing lunch for $7.50 (avocado was $1 extra) \n\nPlus:\n\n- Chipotle is two blocks further than Cantina Verde\n- Lines move much slower at Chipotle, which creates longer lines", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "With Chipotle and the authentic Tlaloc Sabor Mexicano restaurants nearby, this place still shined. A chipotle ordering style system but with more interesting and flavorful ingredients. This place is amazing and you can't beat the price. Not to mention aquas frescas for under 2 bucks. I'll be hitting this spot up frequently.\n\nI ordered a cilantro lime chicken burrito on a wheat tortilla, brown rice, black beans, sautéed onions (nice flavor and twist to a burrito), jack cheese (they also have a cotija cheese option, winning), more cilantro, sour cream, pico and the hot sauce (while eating the burrito I requested a side of the hot sauce cuz it was off the hook). Bam, great flavor great price. I'll be getting burrito wasted at the Cantina Verde again.", "author": "Carlos S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "I went to this place for lunch with my coworkers! The prices are unbelievable. I ordered a salad with steak and chicken, onions, pico de gallo, chips, corn and other fixings! It tasted very good; the price you can't beat! It is cheaper than mixt greens! Definitely worth going back for again! Maybe I will try the tacos!", "author": "Jaiesha C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Much better than chipotle and you get so much more selections. Taste awesome too! I am a big fan! :) this salad portion is enough for two people.", "author": "R A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "LOVE IT - I will never cross the street for Plant food again.\n\nThis place is definitely worth a try.  In the last 16 days, I've been here 8 times - does that qualify as food addiction?   The service is fast and pleasant, the price is cheap, and the food is very fresh and YUM!  I'm big on eating healthy for fuel, and Verde fits the bill.  Friends would say that I have a thing for customizing food orders - this place caters to that need - as many add-ons as you want, most free.  I haven't found the food to be bland or \"unsalty\" at all (this from a girl who regularly salts everything from oatmeal to sliced fruit and enjoys extremely spicy food), so those comments seem weird, but maybe things were different in the beginning and they've adapted?  Here's how it stacks vs. my previous FiDi healthy go-tos:\n\nVerde vs Mixt Greens: salads - MG is still salad heaven, but Verde is on the same level given the low wait time and half price.\n\nVerde vs Foccaccia: Verde hands-down in price, taste, and speed.\n\nVerde vs the Plant: see above: Verde has fewer menu options (they're a Mexican cantina, ya?), but way more food for your money (anyone else feel like Plant is running a racket?), better taste, better food quality (yes!), and MUCH more organized and speedy.  \n\nChi-pot-whaa?  That crazy loud franchise place with not-really-fresh food?  Seems overpriced and corporate, but I guess great if you support that kind of thing...", "author": "Charis S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-23", "description": "It's good, cheaper than Chipotle (as everyone's said). \n\nProblem is the food isn't hot. I've been five times now, and it bothers me every time. I work a block away so it's not my walk back.\n\nThis would be a five star find if they'd just get their food to a higher temp!", "author": "Derek S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-21", "description": "Just got into the bathroom and one of the employees was knocking on the door telling me to hurry up. Wtf? \n\nFood is alright. Overpriced, would rather get chipotle.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "I had their burrito bowl for lunch.\nTheir price is fair & moderate serving time. Taste is pretty much same as any other Mexican place. \nI really like their burrito quantity and more options in every category (eg: wheat tortilla & their variety of sides) Not sure if their food is organic, like chipotle, if so this will be my New Mexican food favorite.", "author": "Venkat K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "Closed on Sunday - even though their website says they're open from 7 - 7 Mon - Sun", "author": "Ken P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-14", "description": "I came over here yesterday to grab some lunch to try them out now that they're officially open and have stopped giving away free food.\n\nI like that they have more options than Chipotle, but otherwise I didn't really notice too much of a difference. I also liked the strawberry and watermelon agua frescas that they handed out to those of us in line waiting to place our orders.\n\nI ordered a carne asada burrito bowl with white rice (they were out of all other types of rice), shredded jack cheese, red sauce, shredded lettuce and mushrooms. I did also notice that they offered some squash, red onions, and a wider variety of salsas that I barely looked at. They also had egg pieces, avocado, guacamole, chips and some other various toppings that I could've added. They advertised corn on the menu board, but I didn't see any, so I didn't get any to put on :(  Sad.\n\nThe red sauce/salsa isn't hot (thank goodness; didn't think to ask before ordering but there wasn't any sort of hotness indication next to it on the menu so I sort of assumed it was safe), and they give you an okay amount of everything -- for $6.50+tax, you don't really have too much room to complain. I found the bowl to be pretty filling (didn't finish all of it), but nothing about the flavors blew me away as being particular better than Chipotle or anything. I'd go back, if only because it's nearby and because it's cheaper than Chipotle as well (though only by a negligible amount).", "author": "Anna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "This place looked good from the outside. I see a lot of people coming in and out, so I figured I would give it a shot. I was not impressed. There was nothing bad about it. The food was fresh but I felt like it was lacking something.\n\nAssembly line style build your own burrito/soft taco. No crispy taco was bumber.\n\nThe line did move fast that is plus if you are in a hurry. Also the price is good for what you get especially for the area.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "Newly opened Cantina Verde is finally here!\n\nThe entire first week of March was their soft / grand opening and they gave away free breakfast and free lunch the whole week! Dont know how they do it, but a lot of people tried it.\n\nI'm happy to support a local business especially when their ingredients were very fresh and the bowls I've gotten have been really good. They give generous portions and they have a different variety of veggies. \n\nEven for chicken, they have two kinds! \n\nTheir service has been great so far... but I must suggest that their workers should pick up the pace especially if they expect to get busy.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-25", "description": "I went back for a regular burrito and was not very impressed.  The carnitas were completely devoid of flavor, and the girl behind the counter actually rolled her eyes at me when I couldn't decide in a split second what I wanted on the burrito.  Bitch, please!\n\nBy the time I got back to my desk, which is in an office building right across the street - it was stone cold.\n\nNo thanks.", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Best combination of food and cost of all the Mexican spots downtown.", "author": "Bertram W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-01", "description": "Such a rude person working!! Went for breakfast and their music was super loud where the guy couldn't hear me order so I spoke a little louder and he got angry and said he doesn't like it when people yell at him after just slapping the ingredients in the burrito. I wouldn't recommend this place to anyone. If you don't want your customers shouting at you turn the music down so am we don't have to!!", "author": "Jose G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "I got a little upset when I read the reviews for this place. This is my go-to spot in FiDi, I'm here 3-4 times a week. Their $6.95 salads are enormous and can add a huge heaping pile of avocado for a buck. The steak and avocado salad feels like it weighs a pound and its $7.95 cmon people that's insane for FiDi prices. Flavors are good, prices unbeatable, portions huge. And healthier than chipotle. It's not Mexican food but it's quality fresh healthy food for cheap. Exactly what I like. The people who gave it 2 stars I'm guessing also put their dogs in sweaters and are going to vote Hillary 2016. Good, the line is long enough, go enjoy your vegan chai lattes somewhere else", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-08", "description": "Don't get me wrong. I think Chipotle is a good chain. And frankly, emulating them is not a bad idea. But let's be honest-that's exactly what this place is. They have slightly more ingredients to choose from, but the ambience(really? ambience in a cafeteria style chain?) is a lot more boring. The all grey interior recalls the experience of  taking your lunch break in your cubicle. \n\nIf you brought me a burrito from both places, I'd be hard pressed to tell the difference. A bad thing? No, not at all. A great thing? No, not at all. It's just a thing. Sadly, there's not many other quality places in the immediate area to grab a stellar burrito, so I'm going to make them my default until further notice.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "I stumbled across this spot today and decided to check it out. Like everyone said, its very similar to Chipotle, but has a ton of more options. \n\nThe price was great, the food tasted fresh, and I will go back. The only serious con for me is that its VERY hard to order. I am about 5'2\" and could not hear/yell over the tall glass. The music was loud, the servers were quiet...it was just not a good experience for me. Consider turning the music down to make an easier ordering experience.", "author": "Anne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "I love this place for its breakfast bowls.  Fresh food at a very reasonable price, and the staff are super friendly.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-20", "description": "Yay for good burritos! Boo for not having tofu available! When they said they didn't have any tofu at the time, it reminded me 15 years ago when veggie burgers first started being introduced at fast food chains... they were so rarely requested, it would take 10 minutes to prepare it since they had to thaw the patty out. I don't know if they were genuinely out or like the veggie patties of yore, unprepared to have it requested that it wasn't available, but I was disappointed to not be able to try it.\n\nFortunately, they did have a grilled veggie mix for those who don't partake of the animal, so I ordered that, along with beans, rice and cheese. Similar to the Chipotle burrito line, you order at one end, go along the line and pick your toppings and pay at the end. Pricing was similar to other burrito shops in the FiDi area.\n\nService was good, not too busy when we went for lunch during the the work week, seating seems a bit tight, but overall it was a good burrito. Next time though, I'm bringing my own bottle of chipotle flavoured tabasco.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-18", "description": "In reviewing Cantina Verde, I can't help but compare it to Chipotle. Their basic menu mirrors Chipotle's, but they definitely have more unique ingredients including mushrooms and sautéed onions. The downfall is that they only let you add 1 \"special\" vegetable to your bowl before charging for extras. They do have a good selection of fresh vegetables, but I thought their carnitas lacked flavor and overall I just wasn't as satisfied with my burrito bowl as I am when I go to Chipotle.\n\nIt does feel healthier and lighter than Chipotle, which is great for SF and the Financial District lunch crowd. I will be back, but it's not my favorite burrito bowl.", "author": "Annaliese D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "This place just opened today and for their soft opening they were handing out free tacos and aguas frescas.\nThe concept is the same as Chipotle: stand in line, look at the simple menu, customize your taco, burrito or bowl, pay, and eat.\nThe food is good, and they get an extra star for the variations that Chipotle doesn't have: jalapeno pinto beans, cotija cheese (which is what should go on a Mexican street style taco), and two different kinds of chicken (spicy and cilantro lime). I tried a taco with each of the two kinds of chicken and the carne asada. All of the ingredients were fresh and delish. A welcome addition to this block.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "Essentially borrowed from the Chipotle model. I had a whole wheat cilantro lime chicken burrito with the brown rice and black beans (undercooked) with added mushrooms and avocado slices. It was okay, borderline bland. It's no Mission burrito, that's for sure.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-12", "description": "I realize this is nothing more than a poor man's Chipotle (which is a poor man's taqueria), but how can a burrito bar offer so many different ingredients and still be so one-dimensional?\n\nThey should consider renaming themselves Cantina Sal.", "author": "Annie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-25", "description": "Good burritos for a decent price. They have so many different add-ons to their burritos and salads my favorite are the grilled mushrooms.", "author": "Taylor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-17", "description": "Solid Chipotle knock-off but definitely lacking in the flavor department. \n\nIf you care more about price than flavors though, you've come to the right place. You'll probably save about $4-5 for a slightly larger portion size AND have fresher/healthier ingredients to boot. \n\nI got a salad with chipotle chicken, corn, sautéed onions, tomatoes, cilantro, chips, avocado, and chipotle dressing all for $7.50! Definitely a good deal in the Financial District. Just don't expect it to blow your taste buds away.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Another one of my typical lunch spots. Its very similar to chipotle but I actually like it better. Its similar in the sense that its make your own burrito or burrito bowl or salad type of place. I usually order to beef burrito bowl with brown rice, black beans, cheese, fresh tomatoes, corn and lettuce. The ingredients taste nice and fresh and I find there is more flavor than Chipotle. Also the beef was cooked perfectly, not overcooked like at other places. All in all a great grab and go place. There's also lots of seating in case you want to eat there.", "author": "Sami F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "A great Fi-Di Fresh-Mex lunch spot.Fresh, tasty, reasonably priced, fast, friendly & clean. A step up from Chipotle in taste & a slight step down in price.", "author": "Tad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Pretty good. As others have said it is very similar to Chipotle, although I do agree the ingredients seem fresher than Chipotle. I got a burrito and a Coke (they have the bottled ones with the real sugar available and they will even open it for you) for around $9 I believe. The burrito itself was $6.50. A lot of customization options available for your burrito. The burrito was good, but not outstanding, which I believe was probably just my poor customization. But, for the price I would definitely come back and maybe ask them for a recommendation to really get a great burrito. The burrito was huge, the people were friendly, and the line moved quickly at about 1:30pm. \n\nI took my burrito and Coke down to the waterfront to enjoy which was great on a particularly warm San Francisco day. I ended up spilling half of the Coke after being flustered by a car horn, but hey, that's my life.", "author": "Brian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "Definitely better and healthier than chipotle. Will try it again next time I come to SF", "author": "Ron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "This place is such a great Chipotle knockoff that I would choose it over Chipotle any day of the week. I usually opt for the create-your-own salad. For only $6.50, I can get a gigantic box of mixed greens with roasted vegetables and yummy chipotle chicken. It's pretty hard to beat that kind of value. Also, the tomatoes taste really fresh! The line gets super long during lunch time, but thankfully it moves quickly. \n\nI'm not sure how the burritos are, but when 75% of the customers are ordering salads/bowls, you know which is the better option.\n\nIt's hard to grab healthy and tasty food when you're squeezing lunch into a busy day. Cantina Verde does a good job of balancing the two at a low price.", "author": "Anna N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-03", "description": "This place is very similar to Chipotle.  You have the option to have a burrito, burrito bowl, or taco.  The good thing about this place is that all the meats are the same price unlike Chipotle, where each meat has a different price.  However, even if you get vegetarian and you want guacamole, they will charge you for the guac.  \n\nThe first time I tried this place out, they gave me the wrong meat.  I wanted steak, they gave me braised pork.  The pork was good and all, but I wanted steak still. I also asked for tortilla on the side and I never received it.  So when you go during the busy hours, speak a little louder because apparently they can't hear you over that window that separates us from them.  The bowl was very good though, it is definitely a bigger portion than Chipotle.  I added brown rice, black beans, pinto beans, mushrooms, zucchinis, salsa, cheese, lettuce, and bell pepper.  Flavors are definitely different from Chipotle, but it tasted pretty good if you want to avoid the typical long line at Chipotle.  \n\nIn conclusion, food is good, service could be better.", "author": "Ellen Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "I like this place!  I like to get the salads and tacos here.  The carne asada and both chickens are really good.  $6.50 for either burrito, taco, or salad. Avocado or guacamole is extra.  The verde salad is easy but I usually like to amend, so I pick my own toppings.  Fresh and delicious and FAST.  The sounds travels quite a bit, so hard to understand the staff and I don't think they can hear me either.  They keep the door open generally, which I don't like but not too bad on a warm day. Mostly good for takeaway. \n\nI do have to say that the amount of greens I get in the box in varied and today it didn't fill up the box, where is the week before it did.", "author": "Betty L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Great service, friendly management and staff, great food. Simple menu that absolutely hits the spot. \nDecor is clean, warm, and modern. \nI had the breakfast burrito and it was exactly what I was looking for.", "author": "L M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-12", "description": "Food is fairly decent. Similar concept as chipotle only they have different flavored protein. For the portion that I receive from the old guy behind the counter, not worth the price.  I would recommend chipotle over this place.", "author": "Andy N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-07", "description": "I got charged $8.16 for a cheese quesadilla. The cashier said they have to charge me like a full burrito. They could've told me that at the beginning rather than after the food is already made. Talk about a rip off.", "author": "Saumya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "I was quite impressed with the breakfast burrito I had here. The best I have found in the FiDi!  Very reasonably priced.", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "It's the same concept as chipotle but with a variety. You can pick what greens you want if you want a salad and they have different sauteed veggie options like mushrooms and squash. Also you have the option of getting sliced pieces of avocados or their guac. \n\nI ordered a chicken chipotle salad over spring mixed greens, added guac and also ordered a watermelon aguas fresca. Altogether it was about $10 and very filling for me. I liked the spicy jicama and sauteed mushrooms in my salad, it was refreshing.\n\nAlso, first time I wanted to try this place I was a little lost. Its a little off market, where the old sellers market used to be, around the corner from the starbucks so just a heads up.\n\nAlso, looks like it does get pretty busy here for lunch so be sure to come here a little before noon or after 1pm", "author": "Christine W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-12", "description": "I've eaten at this place twice now. Both times had a House Salad. Good salad, however the sign outside both soora advertise the salad price as .$6.50 but the real price is $8.50. The employees just say it is an old sign and the owner knows. Hmmm false advertisement.", "author": "S V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-06", "description": "When they first opened they were super nice, smiles, what can I get you's, etc. Now that they've been around for a while they couldn't be bothered. Their food is ok, and this place is convenient.  What drove me to Yelp them is that the older lady with glasses is exceptionally rude. They offered all veggies free when they first opened. Then, it was your pick of two of the four offered veggies.Today, it was only 1 item free and she dismissed me like I'm not even a customer. Their sign says you can have \"up to 3 of the following: bell peppers, red onions, mushrooms, zucchinni & squash. Obviously they don't care about updating their false advertising.\n\nShe was all smiles for the guy behind me, maybe because I'm female she can't turn on her feminine wiles on me and so it's not worth the extra effort? When I snagged her attention about the veggies, she tells me it's 1 item only and again dismissed me.  Ok, so you charge now - what if I wanted the extra veggies at the extra charge?  Doesn't matter, because I never got the chance to tell her I wanted the extra veggie since she again dismissed me and turned on that 1000 watt smile to again cater to the guy behind me.  Terrible service from her, ok service from the others, and ok food.  Just make sure you're a guy, and maybe you'll be ok.", "author": "kit p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "I agree with Matt, first it is awesome they are doing a soft open with FREE food. \n\nI got a breakfast burrito (eggs, beans, salsa, crema) and it was scrumptious. I came right at 930a when they were closing so they were 86 on a couple of proteins but hey - free soft open, no complaints. \n\nService seemed a little burnt out but food came out quick and clean. \n\nThe owner / manager was working the food line and appeared not to understand spoken Spanish, I don't know what that means. Worrisome to me. I asked for jalapenos and they had none but they had green salsa that contained jalapenos. I don't know if they ran out or just don't plan to offer them. \n\nBesides those minor observations, the place looks like it'll do well.", "author": "jim b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-03", "description": "Well, i am still trying to find a good burrito downtown.  I grabbed a carinitas burrito with peppers, cheese, pinto beans, white rice and salsa verde.   The good - i was surprised at the size of the protein portion.  The bad:  That was the most bland burrito I have had in a while.  Also, why are they so chintzy with salsa and cheese?  I asked twice for more than three shred's of cheese only to have in increased to nine.  I told the lady i was happy to pay more which did not help.  Even more baffling than the cheese was the salsa.  The lady filled the ladle up, then proceeded to pour 90% of it back into the container ending up with 10 small drips on the burrito.  I asked for more and once again filled it up and poured it back out.  It was almost comical.  I just quit trying at that point.  I am giving them two stars because i might have just hit them on a bad day but overall it was a very bad burrito.", "author": "Stuart B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-12", "description": "So disappointed with service here. I had a habit of swinging by for guac and chips and today I decided to get a salad bowl. The menu and layout here is parallel to Chipotle. Choose a bowl, burrito, salad, etc. then your meat then your toppings. There are more vegetable options here which is why I was excited to try the food. The best part about these bowls is you can load them up. Chipotle is generous with their veggies and salsas so you're never left craving more. I was so excited for Verde's options. I asked for chicken, peppers, onions, zucchini, mushrooms, mild salsa, shredded cheese, sour cream, cucumbers and vinaigrette. This woman PISSED me off. She didn't even use the full scoop when serving. I asked for more onions, and zuchini and cheese and she just stared at me. I asked twice more, then finally she put only TWO extra pieces of zucchini and a string of onion. Same with the salsas. I asked for cucumbers and vinaigrette. I got charged $1 extra for veggies (where's my FULL second scoop?!) and 50 cents for chips which by the way are the same charge as CUCUMBERS. really?! you're charging me extra for cucumbers and for veggies you barely put on there? and you have the audacity to roll your eyes? Very disappointing. Such a bad attitude, i'm surprised you didn't spit in my food. with all the charges, I paid just under $10 for everything, which i know isn't horrible for FiDi, but If i knew service would be so horrible, I would much rather have gone to Mixt Greens, The Plant or Chipotle itself. disappointing, and not very tasty in the end. Not coming back.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "It was aight.  Just your standard burrito eatery.  About as good as Chipotle.", "author": "Raj G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "I went to Cantina Verde for the first time today with a Co-worker. I ordered the chips,guacamole and one chicken taco. They now have a new customer. The customer service was very good!!!!!!!", "author": "Zina J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-14", "description": "Ugh, I wanted to like this place. I call it the \"poor man's Chipotle.\" I've tried the tacos, the burritos and the salad and the only thing that's good is the house salad. I would give this place 4 stars just on the salad, but lately I've noticed that they are increasingly stingy on any toppings. Smallest scoops possible of cheese and corn. Two slivers of avocado. Two HALVES of a cherry tomato.  An almost $9 salad should have double what they give on the toppings.  And then they look at you like you're crazy when you protest the TWO HALVES of a small CHERRY tomato.  I'm done. I'll pay three extra dollars and get a full salad at Foccacia.", "author": "Stephanie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "This place is similar to Chipotle, but it's got way more choices and tastier ingredients.  Adding guacamole only costs $1, not $2 as in Chipotle. I only wish they have restaurants in more locations.", "author": "Sienna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-28", "description": "It was ok, but I am not a fan of cold burritos. It reminds me of chipotle. I was in a hurry, and wanted something quick before I went to work. I ordered a burrito with carnitas, and it was alright. Not amazing, and also too salty. I may not go there again. I'll have to suck it up and go to the mission.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "Essentially a Chipotle replica, however I enjoyed their burrito more than a Chipotle burrito.\n\nThey also have a pretty good breakfast burrito.", "author": "Emre G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-28", "description": "The employees need big time training on customer service (specifically talking abt 2 young girls that are working today) smile when you see a customer please! From the service they provide me I felt like they were doing me a favor for making my burrito and charging me on that cashier machine. The food is alright.", "author": "Jazzy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-16", "description": "burritos were kind of sad, but cheap. Not the worst, definitely not the best. Carnitas tasted weird, like they included cinnamon. kind of an orangish color. veggies were fresh. Kind of a good choice for a late late lunch.", "author": "Dean N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "Cantina Verde is just like Chipotle and Qdoba - it's quick, convenient and pretty inexpensive. I love that they have wheat tortillas.", "author": "Melissa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-05", "description": "This place is very close to being a great spot, but management overhaul is needed!  Every time I leave I feel ripped off. The staff is not friendly, very pushy. It's like I'm not even allowed to think about what I want to put in my bowl.  When I do select an item I get a half ass scoop and they are very reluctant to add more.  By the time I was done my bowl was half empty and I had 6 different items thrown into it.  For now I'm sticking with chipotle...I feel better about my purchase when I'm done.  This place could be a home run...but I leave with a sour taste too many times.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "Line is always long but moves fast. Fresh ingredients. Prefer this spot over Chipotle. Always clean. Price is super reasonable considering we're downtown.", "author": "Chayla G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-18", "description": "Any place in the financial district where you can find a healthy lunch for under seven bucks is a score to me. Here, $6.50 gets you a nice sized custom built burrito.\n\nYou get a choice between white and wheat tortillas.\nTheir guacamole is divine, veggies seem fresh, there's a choice of beans...I might stay clear of the chipotle chicken next time. Not bad, but not completely stelar.\n\nPretty cool place. I'd go back.", "author": "Eva D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-13", "description": "They don't offer Spanish rice which is ridiculous. Our choices are plain white rice and brown rice. Their tortillas are just steamed and not grilled and the food is barely luke warm. By the time I get to my office (which isn't far) everything is cold. On the plus side, everything is fresh.", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Great breakfast burritos.  A lot more flavor than your standard breakfast burrito with fresh veggies and salsa.  Bacon is crispy and has a nice flavor as well.\n\nLunch has more variety than chipotle and ingredients seem fresher.  Great flavor on the chicken.\n\nClean environment and friendly service.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "Best Breakfast Burrito spot in Financial District, hands down (and I've tried them all).   Huge portions, only slightly over $5, all fresh ingredients, and very friendly staff.", "author": "Sondra O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-18", "description": "Cantina Verde!!!! Are you trying to kill someone? I built an insane appetite after waiting in your excessively long line. Then I had to tolerate being nickel and dimmed on the price to add veggies, not cool. I finally got to work hungry as a bear and ready to dig into my Carnitas bowl. About halfway through my meal I took a bite and dang near broke a molar and choked to death on this massive bone!!! I get it, I'm eating an animal and animals have bones, however, your Carnitas engineers need to do a better job of making sure your food is safe for people to consume. My colleagues are in disbelief that this is even a bone, they think its rock. They threw it against the wall and we even took a hammer to it and it still held its form! SOLID! After the embarrassing moment of almost choking to death passed and I cleaned the foam from the sides of my mouth, I called your phone number which doesn't work! I got a message about your subscribers mailbox being full and unable to except any more messages. I guess you're as thorough at cleaning up your mailbox as you are at inspecting your food before you serve it, BOOM! I'm taking my business to Chipotle where the line is even longer, but I don't have to fear for my life.", "author": "Izac C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Solid Healthy mexican food! I had the three tacos (single corn tortilla - aka street tacos) and choose three different meats since this was my first time here. The meats were the Chipotle Chicken, Lime Chicken and the Carnitas (Pork). The carnitas were hands down the best but enjoyed the other two as well. There are a lot of items to choose from when dressing your taco but I kept it authentic and simple with some onions, a sprinkle of cheese, and the salsa verde - the carnitas I left plain with just cheese and squirt of lime. I'm from Southern California so I have definitely been missing Mexican food and this satisfied the craving. The only downside is I felt a little rushed and one of the Taco masters seemed a little annoyed that I wanted to garnish each of my tacos a little differently. Why not!?", "author": "Noel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "I haven't written a review here yet? I love this place and I'm a regular. I love to build a salad here from their fresh ingredients but when I'm in a hurry, I'll order the House salad. It's not put up in advance so it's equally fresh but the server can put the ingredients together quickly by rote which saves me time. I really like their Chipotle sauce and usually request a double serving.", "author": "Paula H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-11", "description": "This place recently opened up across the street from my office. I just heard about it today and decided I'd try it at lunch. Got there about 1:30 and the line was pretty short. Maybe 5 people ahead of me in line. The concept is like Chipotle. I agree with a lot of the other reviews. The employees in the assembly line are behind a glass partition so you're struggling to hear what they're asking and you're screaming to tell them what you want. I am a 5'1 Shorty. So, it's a bit of a challenge for me. This place is great for the vegans as the veggie options are more extensive. I ordered a carnitas burrito with a bunch of stuff on it including guacamole and sour cream. A little stingy with both. Again, I agree with some of the other reviews that Chipotle, hands down has the best seasoned meat. CV is not bad, but Chipotle is better. The pros for me is that it's right outside my building and the line is 10 times shorter than Chipotle. I can deal with it. The cost of my burrito came to almost $9. I guess the extra cost for the guacamole. But definitely try it for yourself. I will continue to come back.", "author": "LyonQueen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-01", "description": "If I was basing this strictly on the food it would be 5 stars.  So much better than Chipotle since it gives you so many more veggie options and I like their dressing better than Chipotle too.  Their chicken is so much better too.  Chipotle's always is so fatty tasting.\n\nBut their service is what brings it down to a 2 star rating.  In fact if I were to be rating this strictly on service it would be a 0.  It is so hard to hear all of them behind the counter.  The music is way too loud, most of the people who work there don't speak English very well and they are all so soft spoken that it gets very frustrating trying to communicate with them.  The guy in front of me just now threw a hissyfit because it was so hard to communicate.\n\nWhich moves onto the next issue... When you first look at the menu you have a choice of burrito, bowl, salad or tacos and they are all listed as $6.50.  So I have always ordered the salad.  I always order the same toppings on the salad too.  Today when I got to the cash register they said it was $7.50 plus tax instead of $6.50.  I asked why and they said because it is a salad. I pointed out the sign at the far end and they said no a salad is $7.50.  I had this same thing happen to me one other time and it was explained that if I got the avocado/guac on the salad then it would be $7.50 but since I don't it should be $6.50.  I tried to explain this to the person at the register and she continued to argue with me that because I got veggies on top of the salad it was $7.50.  This just doesn't make sense and they should figure out how to make things more clear.", "author": "Raigan E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-13", "description": "I don't understand the other glowing reviews, what am I missing?  I went in at 1pm to avoid the lunch crowd.  Still a decent line since the assembly line was pretty ineffective.  Same thing as Chipotle, but little cheaper.  Most of the ingredients are pretty tasteless, salsa is super watery, they might as well just pour tomato juice all over my burrito.\n\nYet another disappointing MX place at FiDi.", "author": "CalBear H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "Tofu rice bowl is really good option for vegetarians, similar to chipotle with more options", "author": "Divy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "$6.50 for a burrito in the FiDi was to good to be true  - and it lived up to it too .. \nchipotle (3 blocks away) should have felt the heat already !", "author": "Fela K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Great place to eat salads for lunch. I recommend getting a verde house salad and it gets you really full.", "author": "Kaydee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "I LOVE this place.  I used to go to Chipotle at least once a week, now I go here.  They have a wider variety of veggies, and some of the stuff they serve actually has some spice to it.  The staff is really friendly (if you go a couple times, they will remember you and say it's nice to see you again!) and the price is very reasonable.  Plus the line is way shorter than Chipotle, most of the time, and it moves faster. :)  And they're open in the evenings if you need to grab dinner and work late - not too many options around here for that, so this is a welcome addition.", "author": "KT R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Another pretty great lunch spot found for me and my co-workers!  Good price for a healthier and more authentic version of Chipotle.  Little tables are outside so you can catch some sun while eating your food.  Would be 5-star but the food doesn't look extremely fresh and kind of reminds me of Q'doba.  Anyways, would be back again simply because it tasted healthy and was a great price for what you get.", "author": "Louise Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "This was a surprise and I was more than pleased. I was wanting a breakfast burrito and I found this place that has a setup like Chipotle where you can build your own burrito. It was huge and very reasonable considering it's in the Financial District.  Very impressed.  I ended up splitting it with a friend because it was more than enough for two. She thought it was pretty amazing as well. Thank you!", "author": "Venka A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-04", "description": "Went here with a couple coworkers.  Not only was the service subpar, but one of my coworkers found a caterpillar in her chicken salad.  Will not be returning.", "author": "Jayson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "Tastes very similar to chipotle but I felt verde salsa is better. They even have more variety of veggies to choose from. Chicken pieces are soft and juicy. I got a bowl which costed me $7.", "author": "Riya G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "I rounded up from 4.5 stars (the half star minus was because they don't have rice for the breakfast burritos).\n\nThis breakfast burrito is pretty f'n awesome! I usually only get one on Fridays, because it's pretty big and I'm not trying to work out my table muscle THAT hard.\n\nI think this is the best breakfast burrito I've had in FiDi. I get half chorizo, half bacon, regular eggs, roasted potatoes, medium salsa, and a healthy dose of jack cheese. Glorious.\n\nAlso, these guys are SUPER nice people. You go in there and you just want them to succeed. \n\nGreat quality, fresh ingredients a few bucks cheaper than Chipotle? Oh si si si!", "author": "S D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Let me start of by saying I agree with everyone. ..it is a knock-off of Chipotle. You select if you want a bowl, tacos, burrito or a salad then walk through the assembly line and pick your toppings.  The favors are different than Chipotle with a few extra options available.", "author": "Jessi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Great salads. Just went for the second time and really like this place. I've tried both types of chicken and have not been disappointed. A variety of options and a large portion for a decent price. I'll be back soon to try other meat options.", "author": "Rise G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "I know I've already written a review for their regular burritos, but I just had a breakfast burrito this morning, and I have found the new love of my life! This is HUGE!!!!! also comes with the option of egg whites, which finding at no extra charge is unheard of. You get fresh veggies, your choice of numerous kinds of meets, and salsas. I was so happy to find that their breakfast burritos are not only the same price as small terrible ones EVERYWHERE else in the FiDi, but also just so much better tasting (fresher!). I now work catercorner from Verde, this isn't going to end well for my hips!", "author": "Dawn O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "I would choose this over Plant, Chipotle, or Mixt Greens if I was feeling like a fresh mex/salad kind of day.   Chipotle is soooo bland.  This place is one step up on the bland chart. Everything tasted fresh, just not really spicy enough for me, but I keep hot sauce back at my office.   They give you generous portions of toppings, so much so that my salad greens were overwhelmed. Not enough lettuce provided. And next time I will get my dressing on the side as I had a large pool of it left after I finished my salad.  \n\nChicken was more tender/flavorful than all the aforementioned food venues.", "author": "Mya P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "Not worth it.  Yes they have a little more selection, but the portion sizes and all the \"extras\" are not worth it.  I'm a vegetarian and I ordered a burrito bowl with a tortilla on the side.  I'd never been to this restaurant before but I felt everything I wanted was considered \"extra\" and my salad was half the size of the bowl.  I'm sorry, but it wasn't worth it.  One of the workers was wonderful and interacted with customers...an older fellow.  The rest....no help. no direction. nothing.  I couldn't figure out how to order and the only one who helped was the older gentlemen.", "author": "Francesca C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-14", "description": "This is just like a Chipotle except they are doing more of an organic play. I did like their lime cilantro brown rice but that was about it. The chips needed some salt, quacamole was only so so, and the salsa isn't very flavorful. They include the option of fresh veggies but for \"Mexican Food\" it lacked flavor to call it Mexican Food. I don't think I'll be coming back.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "I'm a regular lunchee here, so I guess it's about time I wrote them a review. Cantina Verde is very Chipotle-esque with their walk-up service. I've been to Chipotle once in my life btw, so I don't know how I'm comparing CV to Chipotle. Lunch time anywhere in the FiDi is a crazy, happenin' place! Cantina Verde is one of those places. Every day during the lunch rush, the line is literally out the door. The employees handle their business professionally and very systematically! They're \"assembly line\" is accurate and they keep the line moving so quick that standing outside the door isn't a long wait at all. I remember standing at the foot of the door one day, and the line moved even before I was able to Check In to Yelp! The food is fresh, everything is prepared in front of you, and you get to pick any and everything you want to put in your bowl, burrito, taco, salad...whatever it is your stomach desires for the day. While the interior is modern and even somewhat has an industrial feel, the seating is very tight. I'm only 5'1\" but it's like sitting on a child's seat and your ass is hanging off! In addition, you're literally shoulder to shoulder to the person sitting next to you. Or in my case, shoulder to elbow :-/", "author": "Marie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "I used to be a big fan of chipotle until I found cantina verde. The options here are fresh and abundant compared to chipotle. I ordered wheat tortilla burrito with cilantro lime chicken and added everything including hickama and avacado. Best part is they don't charge extra for guac and it's the same, if not cheaper than chipotle. My buritto was 5 lbs with all the toppings I added all for $7 including tax. Where else can you get a cheap and quality food in FiDi? Good bye chipotle.", "author": "Jack S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "I don't know how people can compare this place to Chiplotle other than in the style in which the food is served. For one, the quality of the food is better. Secondly, the people are way less ghetto. You get more food for your money and you get whatever you want on it. Finally, I got violently ill the last time I went to Chiplotle. I have been here multiple times and all of the food is always cooked well and fresh. It's my new go-to.", "author": "Zoeboe D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-21", "description": "Debated between two and three stars, because, really, it is the same concept of Chipotle, but not as good, and the Chipotle is only two blocks away.  I went for the verde chicken burrito and got the verde sauce - thinking I might as well given them their best shot.  It was perfectly fine, but nothing special.  The husband got the salad and it was only half full in the container - come on, give him some more lettuce - its cheap.  Overall, will not return and instead wait in line at Chipotle.  On a side note, the staff were friendly and helpful, but the trashcans were overflowing even though it was not that busy?!", "author": "Alison T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "I've had both a breakfast burrito (bacon) and chicken salad that I chose the ingredients.  Both were very good and worth the cost.  They have healthy options like egg whites and tofu. Etc.", "author": "Dkac C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Love their tacos! Price is really reasonable esp since they are located in the financial district. Definitely will return again!", "author": "Juls W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-14", "description": "Cantina Verde is literally Chipotle but with a few more options. It certainly is priced better, but I don't see it as anything different or outstanding. The amount of add-ins you can get for your burrito / bowl / whatever is better than Chipotle, but the quality is your standard quick Mexican takeout. Great if you want to have a few more options to add to your meal (avocado slices, mushrooms, lime wedges, etc.) but nothing special.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "i love cantina verde! the line moves faster than chipotle and the employees are more friendly. they're all super friendly. they have great deals and their guac is $1 (vs $2 at chipotle).", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Great spot in FiDi for burritos/tacos. Owners are great and very friendly. The food is well priced for the area and I waited in line for the soft opening and was well worth it! Must get chipotle sauce on your burrito! Yumm!", "author": "Austin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "I\"M OBSESSED!! The House Verde Salad is bomb! The chicken has so much flavor! Lots of healthy options to choose from. The line goes fast and the price is right. Healthy meal for a good price in financial district is unheard of. I take this over Chipotle  for sure!", "author": "Sofia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "Great portions, friendly staff, great agua fresca selections. Boom town!! My only complaint is I wish there was one in Las Vegas. Will visit again when I'm back in town.", "author": "Juan Carlos R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-04", "description": "I have tried their salads a while back which were good (3 1/2 stars). Today I ordered a carnitas burrito. Tortilla is chewy and hard...like can't bite through the ends at all. The carnitas have zero flavor. This is the most disappointing burrito I have ever eaten. The service is lack luster... cashiers here always seem annoyed. Don't think I'll be returning here for a burrito ever, maybe a salad.", "author": "lenka l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-16", "description": "Breakfast burritos are I'm not a big fan of the lunch menu. Very chipotle like feel to this place.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-13", "description": "Chipotle wanna-be, mexican restaurant in fidi. I had heard some good things about this place so decided to give it a shot. At first glance, the prices look very reasonable but what you get in the end is not worth it. The burrito bowl has much less quantity than that at chipotle and the ingredients at chipotle still taste more fresh to me. You can choose from a variety of proteins or just grilled veggies. I really liked the idea that all their veggies were split up and you could decide for yourself which ones you wanted. On the other hand, you had to pick one dairy option - meaning you had to pick between sour cream or cheese. If you wanted both, like me, you would have to pay 50 cents extra. Is it that bad to want both sour cream and cheese in your burrito? It is very unclear on their menu what is included and what they would charge extra for. The verde salsa was nice and tangy but besides that, nothing was spectacular. I will probably not be back again.", "author": "Malika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "I have been to Catina Verde at least once per week since its grand opening.  There is a reason I keep going back - the food is awesome! \n\nI usually order a burrito.  My favorite is the carnitas, but I have tried the cilantro lime chicken and the steak, and I've even had them make me an all veggie burrito.  The proteins have great flavor.  Unlike a lot of burritos, the flavor of the meat doesn't get lost in all the other good stuff (rice, beans, etc.).  The ability to add all sorts of different vegetables into the burrito is a definite plus.  I haven't seen so many options at a taqueria-type spot before.  I really like all of the options - from the veggies, to salsas, to cheese - you can make a totally different burrito (or taco or salad) every time you go.  \n\nTo top it off, the staff are really friendly - a lot more than can be said for most of the FiDi lunch spots.  And, the price point is great, too.  I don't know too many places downtown where you can walk out with lunch for well under $10.  Overall a great experience.  Definitely recommend trying it!", "author": "F R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-09", "description": "The short version of this review is: there's way better choices for a burrito even in the FiDi (i.e. Rico Mex or Tlalak), and if you really are feeling for a Chipotle style burrito, go to Chipotle, not this poor imitation.\n\nFull version: I decided to give this place a go today and was there at about 1:30.  There was no line at that time which was nice, but after trying the food, I think I know why.  \n\nI went with a carnitas burrito on a wheat tortilla with brown rice, black beans, onions, bell peppers, sour cream, cheese, chipotle sauce, \"spicy\" red sauce, and fresh jalepenos.  I also got a side of chips and more of their red sauce.  \n\nI started with their chips and they were really bad, tasting like stale Mission brand tortilla chips.  Their red sauce which they claim to be spicy was incredibly bland, similar to mild Tostitos salsa.  The burrito itself was a little better, although it's not something to write home about.  The highlight was the fresh jalepenos however even those were fairly bland.  \n\nAs the place is clearly a Chipotle clone with a fresh/healthier focus, I'm going to compare them to Chipotle.  The burrito from CV seemed a little smaller, and it was way less flavorful.  The amount of meat they give you is about the same, but everything else is a bit less.  The chips & salsa from Chipotle are in a different league compared to CV, we're talking orders of magnitude better.  Even compared to other Chipotle clones like Freebird, CV doesn't compare well.\n\nIn terms of service, the folks working there were friendly and well meaning, and the turnaround time was fairly quick.  However given the lack of flavor, I don't plan to eat there again (at least not for lunch).", "author": "Nick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "I really like this place.\n\nThe food is fresh and the choices are great. I have been there three times so far, and have happily created something new each time.\n\nThe multiple veggie options are what really stand out for me. They are cooked perfectly and I can taste each one in the mix. I have had a breakfast burrito, tacos, and a burrito and have not been disappointed at all.\n\nMy kids also love it here!\n\nThe staff are very friendly and eager to make us customers happy. That is not as common as one would think these days, and it goes a long way.", "author": "CC K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "My second time at Cantina Verde today.  Ordered a breakfast burrito - half egg/whites, tofu, potatoes, salsa and it was HUGE!  For $5, I can eat this burrito for two meals.  I'll definitely be coming back!", "author": "Katniss B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "This review is for the breakfast burritos with chorizo. We ordered ahead for a group and were pleasantly surprised that the burritos would be ready in 10 to 15 minutes.  The burritos were made very well and it was evident that fresh ingredients were used.", "author": "pablo p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-26", "description": "way overpriced for filler veggies. i got a quinoa bowl. it was loaded with cheap filler veggies over quinoa. not worth it.", "author": "Shontai C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-10", "description": "I ordered a burrito.  The flavor was good, but the whole pinto beans were crunchy!  This is a critical, unforgivable mistake.  It spoiled an otherwise flavorful and affordable meal.  I've been eating Mexican food in SF for over 25 years and have never encountered improperly cooked beans before.  It just opened, so perhaps this is just a rookie mistake, but I'm unlikely to go again, even though it's right across the street.", "author": "Philip L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "This place is SO good! Everything was amazing. Fresh, delicious & super tasty!  So many options!!  The flavors are incredible!!!!  A definite recommend! Will be back!!!!", "author": "Nika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "It's the same concept as Chipotle as others mentioned, but this place is even more California-fied.  There's more veggie options to add like sauteed mushrooms.  Mushrooms are not in traditional mexican burritos but I love mushrooms.  Overall good value.", "author": "Nexia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Unfortunately wasn't able to get there for the free food, but it was still more than worth the price I paid today.  Carnitas burrito was way more flavorful than Chipotle and there are many more options available to \"build your own\".  They've done a nice job with the decor as well.  I took to go, but will try to eat there next time as the spacing of tables and atmosphere were really nice. The line was a bit long at noon, but I guess that is kind of a good sign too.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-11", "description": "I had one of their burritos for lunch yesterday, and it was amazing!  The whole wheat tortilla was the softest wheat tortilla I've had, and the chipotle chicken was tender and flavorful!  The guacamole and salsa was great, and brought together all of the flavors of the burrito!  I do regret not trying the Agua Fresca, I overheard a few people walking out with them, and they sounded pretty thrilled about them!", "author": "Aleks F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "This place just opened. The ingredients are extremely fresh and the food is delicious. The tacos and burritos take Chipotle out of the running. Chipotle is now like McDonalds to me after eating at this place. The staff is great and I highly recommend Cantina Verde.", "author": "Milo P."}
