{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Ordered from Uber Eats and my caramel iced latte was perfect! I asked for 1/4th less syrup (because I'm high-maintenance) and they got it spot on. Espresso tasted strong and delicious, but not super acidic. \n\nI also ordered the breakfast burrito, and since I couldn't find much info on it ahead of time, it was kind of a \"leap of faith\" situation. If anyone else is wondering about it: there's no potatoes in them, it has scrambled eggs, a little bit of cheese, seasoning, meat of your choice, and some grilled onions inside. Something about the eggs feel processed, and the tortilla is steamed. The salsa is of the \"Pace Chunky\" variety. So why, you ask, is this still a 5-star review? Because it filled me up, tasted pretty good, and cost me $5 bucks. If I'd paid $9.50 for it, then it'd be a different discussion.", "author": "Virginia J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-10", "description": "Sorry, but as a person with their fair share of boba milk tea in their life, this was the worst I have ever had. Most of the boba was hard, while a few were nice and chewy as it should be in my opinion. What I'm thinking is there was a really bad or old batch in there. Although this is not their fault, I forgot to mention to cut down on the sugar, so mine was a lot sweeter than I'd like. However, the sweetness had this candiness to it that I didn't like.\n\nI do want to say the drink came very quickly though and service was good.", "author": "Gabriel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-25", "description": "Why is the breakfast burrito not fresh and made in house? It's one of those boring microwave situations. Skip it. \n\nCoffee is pretty on point though not of the quality I expect. Shrug.", "author": "Priya S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "So let me start off by saying I've been here twice.  The 1st time was cool. \nHowever that was not the case when my friend and I stopped by to grab a couple of drinks.  \n\nI ordered a Mexican Hot chocolate (made vegan) . After it had been made I tried a couple sips and it was extremely bitter. My friend had ordered an iced soy latte, which was terrible (according to her, I don't drink coffee so I didn't try it). Bc we were both dissatisfied with our drinks, I went back and asked if they could remake the drinks.  When I shared how bitter the Mexican Hot chocolate was one of their responses was,  \"that's how it's supposed to taste. \"\n\nWTF,  I'm Mexican! I've had hundreds of Mexican hot chocolates,  they are NOT supposed to taste bitter. \n\nSo after they refused to remake our drinks, I asked for a refund, which they denied.  Then I asked for a manager. The same chick that said the drink was supposed to be bitter replied, \"I am the manager and we don't refund nor remake drinks. \"  Like you don't make mistakes? Gtfo. \n\nFuckkkkkkkkkkk both of them (especially the one wearing the USF sweater). Additionally, as I was walking out another customer had mentioned that they made the wrong drink.  The barista made a new drink bc she fucked up! What happened to \"we don't remake drinks?\" \n\nBoth chicks were regarded by many (including ourselves) as pretentious, get over yourselves.  You make coffee.  Make it right, it would help if you weren't so busy gossiping.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Just sort of an old school cafe with decent coffee and these pre-made breakfast burritos that are good enough, though nothing to write home about. Seems like people like gelato but I'm lactose intolerant so I wouldn't know.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Love this place, can't complain about anything. It's a little small but if your lucky enough to be in there, you're special! The employees are nice, care about there shop. Delish everything. Love their teas with boba, cookies, gelato is good. Today I ordered lychee tea w/ lychee boba my bestie had lavender tea which was AMAZING! I just love sitting and people watching with a great drink in hand..It's a must every time I'm in Haight.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-05", "description": "The girls who work here are super nice and it's a convenient place to get coffee, but the boba is way too sugary and the breakfast burritos are literally the same ones I get from Costco that they microwave and then charge $6 for. The outside patio is cute and seems like it would be a fun place to people watch.", "author": "Sydney K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-23", "description": "Nice people, cute store, good location- but coffee just tasted like bland warm milk  plus it's very overpriced", "author": "Terie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "This is for the 2 employees that worked on 8/18/18 around 6:45pm.  Literally rude and disrespectful.  The music was very loud and as a group we turned it down a bit to be able to hear our conversation.  Instead of letting know politely that we should not touch the stereo which was accessible to anyone.  The girl says we asked you not to touch the stereo we will have to ask you to leave.  We responded with no one asked said anything to us but we are sorry but we are unable to hear each other.  And they proceeded to continue to raise the volume higher and higher.  So you have a sign that states \"we don't have WiFi talk to each other\" and no sign saying do not turn stereo down? Rude and incompetent. There are many options to choose from don't waste your money here.  We go to coffee shops to enjoy coffee and a conversation this is not a club.", "author": "Ali A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "An awesome little coffee and boba shop. Needed a boost so I tried the Coffee Concussion and wow! I'd call it a must-try for coffee lovers. Plenty of options for everyone and good service. The place was super busy when I got there and they still had everyone served in 5 minutes or less of ordering.", "author": "Cara H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "Cantata? More like CRAPTATA... \n\nAsked for a cold soy latte and the baurista making drinks wasnt paying attention. She made my drink hot... and insread of remaking it, she pulls put a huge cup of ice and pours it over leaving half a hot latte in the cup. \n\nI asked to add another shot when i saw that because who wants 1/2 a watered down soy milk and espresso? \n\nIf i wanted waterdowned crap latte, i wouldve asked for extra ice, but when i ordered i even said less ice. \n\nThey refused my request and at that point i didnt even want the $6 crap soy latte. \n\nMy friend ordered a mexican hot chocolate... big mistake, from these coffee girls... they made a DIRT CHOCOLATE... never again \n\nWe went back and asked for a refund because we were not satisfied with the drinks or service and they refused so now im leaving this lovely review... assholes.", "author": "A T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "I was on haight on a nice day and was craving boba. Found this spot as it was probably the only place that serves it in the area. \n\nThe owners and employees are great and sweet. Price is decent, interior has character, can't complain.", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "We got coffees and water for 6 people there and they wouldn't let me use the restroom because I only had water. They wanted $4.95 extra just for me to use the bathroom.", "author": "Johannes B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Delightful coffee shop in the middle of the weirdness that is Haight Street. The staff were all pleasant, and my caramel latte was perfect. I also loved the seating outside. I definitely recommend this place!", "author": "C B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "The chocolate chip cookies and strawberry ice cream are to die for! The staff was friendly and energetic.", "author": "Mlissa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-05", "description": "Don't get bubble tea here. I should have known better since this is a coffee joint. \n\nI ordered the almond flavored bubble milk tea, and it tasted just like milk with more almond milk added in. No wonder it was so since my friend saw them adding lots of the almond milk in. \n\nThe tapioca pearls were okay, but it was in a half icy milk base concoction. It wasn't a frappe nor purely milk form, just randomly in-between the two forms like something half melted in a warm car. :/ \n\nI would have gone with a 2 star rating, but I'm giving them the benefit of the doubt that this is NOT a bubble tea joint. Sorry to say, but white people should stick with coffee. Oh. Added to this annoyance was the $4 plus change cost. Yay...", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "So glad we stopped by Coffee Cantata while checking out the Haight Ashbury area today!  What a cool little place with great drinks and decent prices.  The John Lennon iced coffee with mocha and English toffee was delish!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Just the best espresso on Haight Street, or in Cole Valley. It's a great shot with no bitterness - the way coffee should be. Staff is competent, professional and friendly.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "We walked around Haight Ashbury and saw this little coffee shop tucked away amongst the burner and glass shops, pretty un-assuming from the front, we walked in and decided to get a small coffee and the sweet barista recommended the Audrey Hepburn, it was excellent then we tried the alfajories (which I've never had before) but was a wonderful sweet little cookie that paired perfectly with the ice coffee\n\nWe drove an hour from East Bay just to get more alfajories and we met the owner who was a wonderful sweet lady and gave us a few free samples without asking, will definitely be back when I'm in the area :)", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Four stars for absolutely friendly, bubbly, smiling customer service that practically knocked me down with it's sugar and sunshine. But man, that Chai was bad, over spiced while still having a watered down texture somehow. And the avocado gelato tasted a bit like nothing. But those baristas made my day anyway.", "author": "Luci B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Super tiny little shop. But with a quaint charm. It seems like they try and do A LOT there. It also seems like they do it pretty well.  \n\nLots of things to choose from. Small space but easy to grab and go, or sit at a little table if there's space and you need a rest for a minute. \n\nI was in the mood for boba and it popped up on Yelp. Boba seems like just something they do to appeal to the crowd since there isn't another tea shop on the street (from my knowledge).\n\nI grabbed a coffee milk tea with pearls and it was really solid. Not too sweet but not too flat. \n\nThey also take card! Thank you!!!!", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Cute little divey coffee spot. I was in the area looking for a coffee spot worth trying. I ended up with gelato when i saw their selection, and i wasn't disappointed. Friendly employees", "author": "Strutted T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "We ordered two milk tea. Not good about that taste Thai milk tea.  Never again. Also. Price expensive too.", "author": "Huaguang S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "I've been here a few times as I live up the street and I really love it. Their coffee is great and the owners are so sweet. There is a minimum on the card charge ($5) but if you're close to it they don't usually mind. Haven't tasted their Boba but it looks ok.", "author": "Mira B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-25", "description": "Thai tea more like powdered tea smh. I will never waste my money at this place again.", "author": "CuzCuz 4."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Great coffee, and fresh bagels and cheese. Friendly and great conversation with owner. A neighborhood place, Loved it and opened at 7:30am", "author": "nashwa e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "Nice cafe i ran into while walking down Haight that serves coffee and boba, what else do you need? Friendly people and good customer service! \n\nThe place is very nicely decorated. Makes it feel \"homey\". Even if its cold and windy outside, once you step inside you'll feel right at home. Nice place to meet up with friends and even study. The boba is pretty good for a \"cafe\". Definitely will come again!", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-12", "description": "I had a Jasmine Milk Boba here and was very disappointed. The overall drink was chalky and warm, and the tapioca was warmer than the drink itself. I will not be back here for Boba ever! This is my worst Boba in the city. The lady behind the counter was nice, but she doesn't know how to make good Boba.", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-09", "description": "As the sole boba option in the Haight its enjoyable but not extraordinary. It is a expensive though around $5 though the service is good. \nThe boba balls are a bit hard and the Thai Tea & Chocolate (which on request they will make you a chocolate or vanilla non-caffeinated) are again good It's certainly worth stopping by if you are in the area but for their boba at least it isnt a destination.", "author": "Boba R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-07", "description": "Cantata is definitely a to-go sort of place for your coffee fix. There are fewer than five tables, and it feels so cramped in there that you wouldn't want to stay longer anyway. They tout themselves as not having Wi-Fi to encourage stimulating conversations, but it probably really is because they don't want customers staying longer.\n\nI had the Madonna, which was a latte with white chocolate and raspberry. This romantic drink was a good mix of milky creamy and sweet. But when my order was ready, the barista basically slammed my drink onto the counter. The latte didn't have a fully closed lid, and most of the milk foam landed on my hair and clothes. The barista apologized but looked more amused than sorry. She then told me that napkins were at the other end of the café and I had to walk all the way over to get it. Really?\n\nThey have boba options here, which makes no sense to me. Stick to the coffee, and serve it with care. My friend had the almond boba, which tasted more like a whole lot of almond syrup than tea.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-27", "description": "3 stars cuz they are really nice but their boba tea is not great. Get other things here but I wouldn't recommend the boba tea.", "author": "Victoria S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-31", "description": "I ordered Thai tea boba. It costed $4.95; too much for what you get. It was watered down and the boba was undercooked and rubbery. To top it off the drink was iced too much for a $5 boba. That's why it deserves 2 stars.", "author": "Sepand A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-15", "description": "I had the Madagascar vanilla gelato and it was underwhelming and chalkie (weird). The consistency was that of melting ice cream and I was surprised when she said it was $7. Overpriced and not tasty. They also don't have WiFi which ticks off a star.", "author": "Dana S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-16", "description": "Came here for milk tea boba.. which literally tasted like watered down milk. It had no flavor. The employee working at the register kept making annoyed/uninterested facial expressions at customers. Thought it was super unprofessional.. it was clear she did not want to be there.", "author": "S C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Lovely service, nice staff and the excellent coffee shop near me. I like the coffee mocha. Recommend to visit there to have the mocha and achieve high level of service.", "author": "Surendra K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-04", "description": "The girls behind the counter are absolutely terrible. \n\nI was charged $7 for a dirty chai that tasted like water. When she saw my face she asked me if anything was the matter, and I said I didn't like it. She proceeded to yell at me in front of other customers, telling me \"she knows their chai\" and I must drink too much Starbucks chai (I do not) and condescendingly offered to add simple syrup (I don't add sugar to my drinks). Then they laughed loudly as I left the store with my shit expensive drink. \n\nSeriously? Get a life. Why ask if you're just going to patronize me. I can afford another drink you can't afford that pathetic attitude.", "author": "Zooey G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-07", "description": "At $4 for a cappuccino, I expect a lot. This clocked in at \"Starbucks-good,\" which is to say it's good, but not $4 good. (Are you still following? haha).\n\nCantata has a very cool selection of gelato in-store, but we didn't get to try it as we were heading to dinner soon. If you can, save space - I'm sure it was good! They had flavours such as Cheese Cake, Avocado, and the classic Pistachio.\n\nMy friend got the Madonna latte, one of their specials, and said it was okay.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Feenin' for some caffeine while visiting this area that I'm extremely unfamiliar with, I did what I always do. Bust open the Yelp app. When I saw that former Yelp intern and all around bad ass, Rachel S had not only given it 5 enthusiastic stars, but also dropped knowledge on their dairy-free milk choices, I figured I'd give it a go. http://www.yelp.com/biz/cantata-coffee-company-san-francisco?hrid=yxvMdJTCvCL359PPMhqFvA&utm_campaign=www_review_share_popup&utm_medium=copy_link&utm_source=(direct)\n\nBeing in San Francisco, we are spoiled by fantastic roasters. Ritual, Four Barrel, Blue Bottle, Sightglass, all come to mind as high end coffee shops that I would normally choose when in town. I don't often go  for the no name places as they don't always treat their coffee with the most attention to detail. \n\nI could tell from the moment we stepped inside that this tiny coffee shop was something different. The lady at the register that I can only ASSume is the owner? greeted us warmly as the bubbly barista engaged us in conversation. You can tell they have fun doing what they do.\n\nEven if a place has five star service, that doesn't mean the end product will be any good. That's not the case here. Even after going to as many local (and not so local) roasters as I can, this ended up being one of the better lattes that I've EVER tasted. I'm not sure what exactly they do differently other than pulling the perfect shot, and steaming the soymilk to the perfect temp and texture. It was perfection in a cup. Whoever roasts these beans, deserves a ton of praise. Score one for the little guy!\n\nAnd can we talk for a second on how smooth their to-go cup lids are? Sounds like a trivial thing until you realize that your lips are gonna be pressed up against it as you sip away the coffee goodness. Taking good care of my lips is how I keep these PSLs kissably soft. Cantata Coffee respects that.\n\nThey seem to specialize in other drinks such as boba and matcha, that which while odd for a coffee shop, I'll defer to the opinion of Rachel S, as \"the best matcha drinks that I have ever tasted\". High praise for sure and I don't doubt it one bit.\n\nThey also stock the best Vegan prepackaged brownies from The Inspired Cookie Company. They just so happen to be gluten-free but you would never know it. It actually has flavor unlike most GF crap out there. \n\nI noticed a Ritual Coffee being built down the street. Even once that store is completed, I would probably still choose Cantata as my first option. It's that good! Now if only they could do something about that pesky soymilk surcharge...   \n\nNote: Do not attempt to park and wait for somebody at the red painted sidewalk just outside. The po po in this area would rather harass otherwise law abiding citizens than go after the junkies openly doing drugs in public among other crimes being committed in the area. Lesson learned the hard way...", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "The staff is so sweet and treats you like family. Delicious drinks and cookies, as well as gelato and Italian soda. Hope to come back soon!!", "author": "Danica N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-25", "description": "Had to pay $5 to use the restroom because the management \"prefers you order off the menu and not a bottled drink\" so I got a scoop of gelato and there was a fucking bug in it and when I showed who seemed to be the manager she tried to play it off as a coffee grind! I should have taken a picture but I work in food service so I wasn't even that mad about it but the fact that she made me think it was something else was just plain rude. Bugs get in food every now and then, just fucking own up to it, don't tell the customer their wrong when clearly they're right. Seriously mad I didn't take a picture. \n\nDon't give this business your money.", "author": "Alexandra E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "This is by far my favorite coffee shop ever!\n\nI've tried everything on their menu and everything is SO good!\n\nThey always make my day better with their smiles  and friendliness. \n\nNot surprised that they are also one of the cleanest restaurants as they just got on SFGate for scoring a perfect 100 on their yearly health inspection!", "author": "kevork d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Here you can buy a cup of boba with only $4.95. You can choose many flavors for a single cup, such as Thai, Taro, Almond, Honeydew, Mango, Coconut, Strawberries, Litchi, Jasmine, Chocolate, etc. which is surprising to me. I chose Thai, Coconut, Litchi and Chocolate for the boba, which complemented each other very well. \n\nThe old lady was very kind and apologized to me sincerely when I squeezed the cup and water dropped on my jacket. \n\nA bonus point for the store is the decoration. I love how they used colorful chairs and a tree branch on the counter. Overall, lovely design and good services.", "author": "Pemi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Must stop here any time we're in the Haight! The BEST gelato with the exception of Italy. We just had the espresso chocolate chunk with hazelnut-OMG so good! Five yums for sure!!", "author": "Dina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "LOVE, LOVE, LOVE this place! My new friends in Haight. I was visiting from L.A. last week and came upon this litle gem. The owners were so welcoming and friendly. The Coffee concoctions were so amazing I had to go back a second day. Definitely  try the \"Jimmy Hendrix\"; it's deliciously infused with lavender. I hope to be back soon. Thank you for the hospitality.", "author": "Laura V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "A great place to go for a nice quick cup of coffee and bagels. The bagels are soft and delicious, teas are great. Great service by Madison, a nice girl who was so gracious. They open at 7:30 in the morning so a good place to hang out and drink coffee before shopping on the Haight", "author": "DJ Nocturna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "I got the James Joyce served hot. \nThe bestie got the John Lennon Iced. \nMe split a dulce de leche cookie thing that was so delicate it immediately crumbled into a white powder pile and cloud upon us trying to break it in half, but whatever. Im sure it tasted just as good in snorting form as it would have as a solid. \n\nThe place is tiny but when we stopped in there was no one there except us and the incredibly lovely and helpful ladies manning the front counter. \n\nBased on the 784276489 signs displayed all over the windows and inside, they have milk tea that I'm 100% down to come back for given the tastiness of my irish creme coffee.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "Was in the area with my bf today doing some shopping and I was in the mood for a nice iced coffee drink while we were walking around and we stumbled upon this place.. saw that they had some interesting choices on their menu but wasnt sure what to get so I asked the worker for a reccommendation. She told me to get the Audrey Hepburn because it wasnt too sweet and that alot of people order it. Once I tried it I seriously fell in love!! It had hints of vanilla, cinnamon, and caramel.. it was so yummy! Will definitely come for it again!", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Excellent coffee and boba teas here. I also love their frosted lemon cake slices. The employees were cool and liked my dog. Definitely coming back next time I visit town!", "author": "Sunshine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Smoke a fat one and grab a Jimi Hendrix. Won't disappoint. And their coconut chip ice cream is heaven.", "author": "Geri Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-14", "description": "Customer service is great! The matcha milk tea and boba were horrible. The boba is flavorless and boiled for too long. The matcha is watered out and tastes like almond milk. Would not recommend for boba.", "author": "Nanxi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "For sure, Cantata takes coffee and customer service to a whole new level. This quaint family biz of course has all the hot and iced varieties you'd expect, but they throw in the most understated free ingredient in every cup--a heaping spoonful of love and happiness. It's not easy to make a first time customer feel like you've been there hundreds of times. I was greeted with the most beautiful smiles, not one but two well-needed hugs, and was even included in a few selfie's with the owner... All before I even ordered! Oh my. Needless to say the toffee coffee 'John Lennon'I ordered was truly terrific. I sat at the window counter and watched the pre and post hippie crowd stroll by on Haight Street a mere couple of blocks up from Golden Gate Park. So if you want to be inspired by a sheer good vibe glowing inside, while Sipping sweet coffee (made even sweeter b/c your drink is made to order, over-flowing with so much love and happiness) look no further. It's the summer of love inside Cantata's, all year round!", "author": "Lew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "I love getting a drink here I used to work in the haight and I have so many baristas I love like Sydney,Brandi and Layla much love y'all", "author": "Antonio G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Some of the best coffee I have ever had. My and my mom stopped in for a morning pick me up and it was great. I got an Aubrey Hepburn and my mom got a Madonna it was pleasant tasted great and. It too sweet. The decor and vibe was great. Will be coming back when we visit the city!", "author": "Andie U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "They said on the phone that they have popping boba but when we went there and asked for it, they said they never heard it. Also the boba tea that we got is not good and quite expensive", "author": "Dipanjan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-24", "description": "Love that they have homemade chai here. It's spicy and only sweetened with honey, so it's not over-the-top sweet. But it is $5 for 12 oz and comes with a good amount of ice. While it's delicious, it's definitely more of a once in a while treat. \n\nStaff is stellar! Love the people who work here.\n\nBoba is ok, I've gotten the taro flavor a few times, but again, pricey. Especially for standard boba.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-03", "description": "You know how sometimes you get a boba craving, and you desperately look around for the nearest fix? And you know you shouldn't be getting boba from a \"place like this\" but your body tells you otherwise? That's what happened here. It looks like a wonderful coffee/tea shop, but this review is strictly boba review.\n\nOrdered a thai iced tea boba. The thin layer of boba at the bottom was not sweet, very chewy, and more of a nuisance than an actual added edible delight. Strike one. The plastic cup was filled to the brim with giant ice chunks. Strike two. In the small cracks left between the giant blocks of ice was milk flavored milk with a hint of tea and colored orange. It didn't taste like Thai iced tea at all. Strike three.\n\nI really wanted to like you, but I think the only way we can make it work is if I don't order boba. The other reviews look good and the pastries and ice cream looked good!", "author": "Eleanor Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-30", "description": "The boba was decent, not honey boba but well done and chewy. Not bad for Haight, but you could definitely get better boba for $4.95.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Really cute coffee shop. I recommend having the Audrey Hepburn! Staff is also really nice and helpful. Will make sure to come back next time im in town!", "author": "S T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-21", "description": "Cantata is a great place for tasty huge croissants, good cinnamon rolls and great coffee drinks. They have prominent signs featuring their boba drinks and I had high hopes. I'm a true boba lover. I will always remember the great boba shortage of 2013(the Taiwanese toxic food starch scandal). Well the boba drinks at Cantata were a disappointment. Unsweetened tapioca balls is a total boba maker rookie move. You're chewing bland texture. Please sweeten your tapioca balls Cantata.", "author": "Caroline N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Super fast and friendly service. Ordered the original bubble milk tea with boba. Super good! Support your local mom & pop shop!", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Two legends, James Joyce & Madonna, two legendary coffees. The James Joyce, is strong yet sweet with some Irish cream kick to the espresso. The Madonna left me speechless and I think I have not stopped raving since.\nThe couple running the establishment are a charm! The lady made me a latte (Madonna), that was smooth white chocolate and just so amazingly raspberry-ey. I honestly never like latte's but this one, I went as far as telling her that it was the best latte I've had in my life. And I stand by it even hours later. The husband (is the cashier as well) was so happy, he took me behind the counter so that I could tell his wife in person and he gave a FREE cookie, which was super yummy as well. The charm of this little cafe tucked away in haight-ashbury is just so mesmerizing. \n\nI wish I could have you everyday 'Madonna'! Please come to Dallas! \n\nP.S. Their house speciality coffee list is so tempting and you wanna have them all. I hear the Audrey Hepburn is REAAALLY good.", "author": "Meghna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Love their chai tea! And they are always cool about adjusting the sweetness or spiciness for you", "author": "Elena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Thank you for making the BEST MOCHA! \nSyd, Rio and all the fantastic baristas at Cantata.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "This place is amazing. Super cute and the ice cream is absolutely delicious. It's super creamy, probably one of the best I've ever had. Highly recommend!!!", "author": "Dominique W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Cantata Coffee Company is beyond adorable! The cozy room feels like instant home, and lends itself to the formation of genuine community. Leila and Elana are kind, efficient, and lovely to their customers. I'm coming back for sure!", "author": "Michaela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "The Signature Coffees were delicious! Hubs tried the Sinatra and I had the Hepburn and just *sigh*... yummy. No add'tl cream or sugar needed. It was made perfectly. Stop in first, grab a drink, a pastry while you stroll and window shop.", "author": "Gina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "Great service , location , and price makes me wish in could give them seven stars \n\nGreat job! Family owned , right on Haight!", "author": "Tasos P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "The only thing I got was boba. I just wanted regular, original milk tea with boba. The milk tea didn't taste like the normal milk tea I'm used to (maybe that's coming from SoCal, or maybe it's simply not as good). I didn't like the taste of the tea, and the boba was really hard and chewy. Overall, the experience was like consuming gummy bears that had been partially liquified and served over ice. \n\n^^that sounds really terrible, but this boba was not for me. I'd say get your classic boba milk tea elsewhere.\n\n***note: I went back to this place and they made me a smoothie to order with their gelato. It was delicious, and the people were super friendly. I'm improving my rating. I think this place probably does most things right, just not boba.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Was visiting from San Diego for 4 days and staying in the Haight/Ashbury district 2 blocks from this little gem of a coffee shop. It was the first place my gf and I found on foot when we set out exploring our first day and SO glad we did. I ordered the James Joyce.. 4 days in a row! It was that good. My gf enjoyed the Pumpkin Latte and Frank Sinatra drinks. The best part of the coffee company was the service from Leighla.. She made it an experience and not just a coffee order. She was amazing at crafting the delicious drinks but her personality was even more amazing! No better start to a day than a friendly smile and entertaining conversation to accompany your caffeine fix. We will definitely be back during our next visit!", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Had the hot Thai tea and hot taro milk tea - killer cookies - pleasant lady behind the counter - nice place to watch humanity walk by...", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "We tried the Italian soda here today and it was so damn awesome! It was creamy, rich and amazing! I've had this drink a hundred times many places, but this one was amazing. I got mango+raspberry and my buddy did Blackberry and apple. Both of us loved it!\n\nThe mediterranean lady at the cash counter was uber friendly and super sweet! And  big call out to the lady with the piercing who made our drink...you make a helluva great drink!", "author": "Rocking V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Wow! What a wonderful mum & pop shop. Easily a 5 star experience. From the genuine welcoming down to the killer coffee- a very authentic coffee stop. I've gone twice in one weekend (lol). The Audrey Hepburn is phenomenal!!!", "author": "Juliana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "They carry almond milk here.\n\nThough sadly - I have developed an intolerance to almond milk - that they carry it - is way what's up.\n\nThe staff here are very sweet and very talkative. I came in here with my friend to pick up some matcha tea without milk - and they were so helpful with the making of it.\n\nThough their matcha is definitely not the traditional kind (ie - over-sweetened) that you would find at Samovar and the like - my cup was still made with a slew of time and care.\n\nI couldn't finish it - since I'm used to non-sweetened traditional matcha tea - but  - my friend really enjoyed it and I know from experience - that the personable staff here are perfectly capable of concocting a superb drink.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "Ordered a house coffee here which was awesome. Strong flavor, not watered down.\n\nThe lady at the front was really nice. There is a little condiment bar to the left of the cash register where you can add sugar, cinnamon, chocolate and other goodies which I thought was pretty cool.", "author": "Richard K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "A quaint coffee shop. \nSmall, but cute interior. \n\nI got the thai tea bubble tea... it was pretty good, but wasn't amazing. \nMy friend got a piece of banana bread, which was really moist and tasty. \n\nThe service was great though. The person was super friendly and kind. \n\n(if you use the bathroom though, it's a bit weird. the ceiling is open and there is a ladder right there. It was quite odd to look up after doing my business and see a gaping opening in the ceiling)", "author": "Yong K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "3.5 Stars.  Rounded to 4 for service and charm.\n\nThis little local gem is perfectly located at Haight and Cole... in a prime location to charge up while on an excursion there... Its hard for me to go nuts and give a coffee place 4-5 stars, but 4 of them here... The coffee drinks where what I expected- their mochas I will say were mind boggling wonderment (I had an iced coffee but tasted the previous), but the owner was the best.  She was so personable, welcoming, and generally great.  On her alone I move my rating higher.", "author": "Charlie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Stopped in after Bay to Breakers 2017 for just a cup of coffee.  Probably a contender for best cup of coffee I have ever had!  Really ..... it was incredible.  Way better than ST Bucks and much cheaper and the cup was bigger also - triple crown for coffee.  We don't live in SF, but every time we visit this is now on the list of mandatory to dos", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Best lattes on Haight!!! + it's cozy and the staff and owners are wonderful. Support local!", "author": "Tessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Neighborhood gem! Had the Audrey Hepburn and it was delicious. The owner was very helpful in giving us local suggestions since our group was from out of town. The vibe inside was eclectic and relaxed :)", "author": "Datevig T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Small coffee shop with great latte's & mocha's & cookies (loved the ginger spice). Sit at the window and watch the Haight go by.", "author": "W G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Cantata Coffee has the best gelato I have ever had in the United States. Creamy and delicious! The service was excellent and the staff were extremely kind and accommodating.", "author": "Karen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Delicious dairy free options! I had the passion fruit bubble tea with almond milk. So good! Wonderful owners, as well. They were very sweet and caring.", "author": "Jess B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "I got a Madonna, sooooo good. Cozy spot. A sweet girl named Tessa helped me out. Loved her. Loved the place. Good stuff.", "author": "Drew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "I ran into this place and suddenly I was craving something cool on a warm SF day.  They had a small, but eclectic, collection of flavors.  I got the jasmine gelato with the soy chocolate... and wow!  The jasmine really smelled like a jasmine flower! As for the taste, it was delicate.  And I think it was paired well with the soy chocolate, because the chocolate didn't overpower the jasmine.\n\nAnd the people there were nice.  I'd stop by again.\n\nhttp://sexydishes.blogspot.com/2011/08/time-for-love-time-for-haight.html", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "I just loved this little gem in the Haight!  I had the John Lennon and damn, was it earl grey good, with a nice nutella cookie.  The two ladies working were just so damn nice and friendly.   They had a  great selection of super tempting desserts.  As I was pondering my decision aloud two other customers (both regulars) chimed in with enthusiastic suggestions.  The only draw back is that there are only a few seats but still.......I LOVE this place.", "author": "Patti M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "I LOVE THIS PLACE! I will be making a trip back to Haight just for this wonderful coffee shop. We felt at home in their lovely atmosphere, and the owners are the most fantastic people I've met in SF thus far. I have never felt so loved by someone who made me coffee; which comes in creative, festive flavors like the John Lennon. They made more than great coffee, but great conversation. After singing, sharing family photos and stories-we would love to adopt them into our family. GO HERE AND SIP ON SOME HAPPINESS.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-07", "description": "The lady forgot my order after repeating it 3 times. Wish I could say something more positive but waiting 40 minutes for 2 things at a coffee shop is not fun", "author": "Kelly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Gabriela was my barista & was brilliant. She made me the best latte & was so kind to me that I am going to change my favorite cafe to Coffee Cantata!!! Thank you !", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Came here all the way from Southern CA and had the best boba of my life. So great for the price! Brandi the girl working was such a gem. I'll come back just to see her. Great place, can't say enough good things!", "author": "Rudy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Great atmosphere, kids were welcome with good gelato, good espresso and latte, not too pricy for this kind of location.", "author": "Farhad V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "It was my first time here and I ordered a Thai tea.. It was delicious, but the boba wasn't sweetened like I usually have it. The Thai tea is very good sweet abs creamy. I will be back to try more", "author": "A'Niya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Shout out to the vegans and dairy-free folks: you must try Cantata Coffee Company! Cantata has a plethora of non-dairy milk options, from almond to soy, they will make you a drink with whatever milk tickles your fancy. I highly recommend trying either the matcha latte or frappuccino. They make the best matcha drinks that I have ever tasted, take my word for it! \n\nThe owners of Cantata are also incredibly friendly. I urge you to take a break from your usual Starbucks or Peet's routine, and try Cantata when you're in the neighborhood. It's a true gem and one of my favorite shops in the 'hood.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Very polite, speedy, awesome customer service! I think the girl said her name was Stormy, she has a bright smile and was very nice.", "author": "Jack M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "I've had coffee all over the world and Cantana coffee shop served me the best cup of coffee I've EVER had. So good in fact, we returned the following day (during a short SF visit) and it was still just as delicious. A sweet little family owned business with romantic street side tables and a cozy dining area. We loved Cantana Coffee Shop!", "author": "Jim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Elaina and Sid are awesome and set me up with a so very delicious Thai Mocha! Thanks guys for the wonderful smiles and friendly environment!", "author": "Elese M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Love this place. Always playing great classic music, the lady who runs it is incredibly nice, great service, great boba... Definitely my go-to spot on Haight Street!", "author": "Angelina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "This petite cafe is a sweet spot in the Haight. If you're having a vintage or chic shopping spree in this area, be sure to stop in and order one of their celebrity styled lattes; we love the Madonna (raspberry and white chocolate latte)! It looks like your average cafe, but Cantata has great ambiance and definitely serves fun and quality coffee. The baristas and even other customers are always excited to chat. As most coffee runs, it can get a bit pricey, but you can get your your fix exactly as you like it!", "author": "Thom And Vicky H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "The boba that the girls make in this coffee is supreme. My favorite is Thai and passion fruit . You can also mix 2 flavors !! I'm a boba lover and I can say in this place really knows how to make it . Is sweet and is always on point !!", "author": "Rebeca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Two of my friends and I randomly found this place on our walk back to our house and I am so happy that we did! It was a typical SF evening - tons of cold fog - so a hot chocolate sounded absolutely wonderful.  \n\nA really sweet man greeted us right away and then his wife quickly welcomed us. The owners of this cafe are so incredibly sweet. I felt as though I entered their living room, instead of their cafe, based on how hospitable and welcoming they were. One of my friends has many allergies and both the husband and wife were very patient and explained each and every ingredient that was put into her boba milk tea. She really appreciated that, as not everyone is always as patient. My friend loved their homemade boba milk tea and I can't wait to come back and try it. As for me, I had their traditional hot chocolate. They also have different types of hot chocolate - Mexican hot chocolate and a couple of others. It was just what the doctor prescribed! Loved every last sip of it. \n\nIf you're in the area and want a great drink with amazing service, I highly recommend this cafe! I will definitely be back!", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "I came in desperate for some warmth while watching a game at Kezar and just made it ~5 minutes before close. The owners we SO nice and got me a hot coffee, offering to cool it down with ice, but none of that because....COLD. I also grabbed a macaroon on the way out and thought I didn't have enough change but the owner said she would give it to me anyway if I was short. I found the extra dollar but the gesture was so sweet and I will 100% come back when in the neighborhood. What a gem!", "author": "Raina D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-30", "description": "Asked to use the restroom and was told it would be a $5 purchase. Fair enough but the staff was rude and generally ignored me afterwards as I was trying to figure out what to buy. I'd find another coffee shop. Most other areas in the city have better service than the spots on this strip of the Haight.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Been to alot of different tea and coffee shops on haight but this one is the ONLY one which severs boba. Pretty small inside but perfect for a crowd. The ladies working today were super sweet and nice. A place i would enjoy coming back again and again.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-07", "description": "Was in the Haight and craving boba. This was the only place I saw that had boba drinks. Ordered a jasmine milk tea with boba of course. Was pretty good. Nothing amazing but satisfied my boba craving.", "author": "Samantha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "I have to give this place 5 stars. And it IS a Woohoo! As good as it gets. \n\nMy wonderful hubby took me to San Francisco for my birthday last week. And on our first day there, we made a stop in the Haight-Ashbury district. He wanted to shop at Amoeba Music, and I wanted to take in some site seeing and window shopping. After a while I was getting hungry, and hankered for something light to tide me over until we went to dinner, a few hours later.\n\nI wasn't sure where to go, and not certain what it was I exactly wanted. The decision was made for me as soon as I wandered into the Coffee Cantata, at 1708 Haight Street. (415) 221-5555.\n\nThe place is cozy and inviting, and there are enough major choices for an appetite desiring something sweet or to enjoy a delicious cup of coffee. It's a combination coffee and ice cream shop. \n\nAfter much deliberation and a nice-chat with the friendly help I settled on a generously sized chocolate-chip cookie, and a Strawberry French Macaroon. \nI had the chocolate-chip cookie later that night, and as soon as I walked out the door, I took a bite of the Strawberry macaroon. It stopped me dead in my tracks--oh soooooo good! Sweet yet tart.\n\nI went back inside to compliment them. I ended up buying some more! The owner, Vasken, (a hospitable man) convinced me to get something called a Peruvian Alfajores. A big seller at the Coffee Cantata. So I bought a couple! Mmmmm. I was not afraid of packing on the pounds, with all the hiking up and down the hills we do in The City, I knew we could burn off any calories from this tempting shop very quickly, and eat these treats without guilt! \n\nThe service at Coffee Cantata is Quick, Efficient, and Uber Friendly. I got to chatting with Vasken. He and his wife, Tamar, bought the place 4-years ago and did a major revamping of the place. I'm not sure my photo skills could really do this establishment justice, but I was so enamored of it and the helpful staff I wanted to give it a try.\n\nMy husband and I returned late next morning and before a walk across the Golden Gate Bridge, we stopped in Haight and I got some Pistachio macaroons. Which, gave us plenty of energy to stroll the span of the famous bridge. \n\nI'm glad on this journey to San Francisco, we discovered the Coffee Cantata! We will return again to this delightful city and to the Haight District, to make a cookie and coffee stop here. Or maybe we'll give their Gelatos a try. Hmmm?", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "During my last trip to SF, my friend raved about a mocha latte with blueberry flavour that she got from a random cafe on Haight st while I was shopping. So we researched online and figured out it might have been a place called Cantata (which is a style of music composition created by Bach - apparently). When I eventually made my way back to SF and Haight street, I am on a mission to look for Cantata. It is all the way past most of the shops of interest to me and a block after Wasteland...and viola!! At long last!! They serve a vast variety of drinks, including fun lattes that you don't find in other (boring) professional roasters coffee shops, frappes from different European countries and even boba and gelato. I got the Frank Sinatra which is essentially a mocha with blueberry flavour. The flavours are really well balanced and not too sweet. LOVED IT. \n\nThe two young girls who worked there were super friendly and enthusiastic. There was also a man who has what I thought was an Italian accent who was organizing things. I thought Cantata may be an Italian word, so I approached him inquiring if he is the owner. Turns out the man's name is Valken and he indeed is the owner (but he is not Italian) and I immediately had to tell him about my prigrimage to Cantata!!!! I was made aware that the ex-owner and staff of this cafe were mean and sucked balls and I wanted to help spread the word for the new owner and staff. If you are tired of the conventional lattes, make your way to Cantata and taste delicious lattes with a twist!!!", "author": "Beata H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "I have visited this cafe a couple times for their amazing gelato. My last visit, however, was extraordinarily amazing. I walked in and had a latte with a lemon cake. The owner, is one of the most amazing people I have met in San Francisco. His generosity is superb and Brandie, the barista was the best. I will forever come into this coffee shop, not only for their gelato and coffee, but for their wonderful hospitality and cafe dining ambient. Best coffee shop in town, definitely recommend!", "author": "Alexandra V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Great coffee... Great price!! Bought 2 frufru coffee drinks and a triple espresso over ice... All 3 were great and it was only $13..", "author": "Patti P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "I love coffee shops but don't frequent one because the coffee always is too bitter or burnt or the mochas are overly sweet. Not here. I ordered an iced mocha and it was so lovely. I actually could taste the coffee and not just chocolate. It was jut slightly sweet and perfect. I was especially happy to see that they had a healthy treat for my daughter: a date stuffed walnut.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-28", "description": "We popped into this place on our first visit to Haight Street. All of the girls behind the counter was very nice. The older lady (perhaps the owner) made me feel welcome. She has a personality that makes you feel like you have known her for years. She recommended a Marilyn Monroe (coffee with white chocolate) and it was delicious. \n\nWe wandered around Haight Street and found ourselves drawn back here again. The place is small but very tastefully decorated and has tons of little trinkets to check out while waiting for a yummy coffee. \n\nNext time I will have to try some boba. This place rocks!", "author": "Kristina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Adorable coffee shop, held by a sweet couple. Try the deplicious oriental sweets (korabias) and a frappe. Their gellatos are the best!", "author": "Joy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "If you're not paying attention, you could easily walk by this shop several times without even noticing it. That's my own story. I finally checked it out with my girlfriend, who's been there a few times.\n\nI was pretty impressed with the interior (looks a lot like tea shops I've been to back in Boston) and they have some cool selections of teas. I've heard the coffee is pretty good too, though I can't vouch for it as i'm not a coffee drinker myself.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "On hard hangover mornings, the breakfast burrito hits the spot.  I don't really get sloshed, I just...have hard mornings that feel like hangover mornings.  And each time it feels that way, that breakfast burrito just makes it all better.  Spicy Sausage is the way to the light.\n\nand BOBA. They got that on deck which totally saves my asian pacific islander life.  I'm always trying to resist their pastries which are decadent and rich and pairs well with the Americano.  Chocolate muffin with cream cheese top - just say yes to that.\n\nAnd the service is warm and fuzzy.  Helps when Haight Street is still fog drenched in the morning.", "author": "Isa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "I randomly came here to have some bubble milk tea and I was very pleased. I had honeydew almond milk tea and it was very, very tasty! There was a very sweet woman who made my drink and the gentleman who rang me up was also very kind. \n\nIt's a cute and cozy place with great service!", "author": "Allison R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "First time going in I was not sure what to expect. I wanted to buy a pound of coffee and the worker recommended a favorite amongst customers.  I also was provided a complimentary cup of coffee and I must say, it was damn good. \n\nThe interior is cozy and inviting.   Will need to back for the breakfast burrito.", "author": "Alexiz O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "I got the Double Expresso Frappe but I wanted to add some vanilla gelato. It just sounded delicious. So I asked the employee if I could do that and with enthusiasm, she exclaimed I could and that it was a delicious choice. She confidently added that I could give it back for something else if I didn't like it. After a couple delicious sips she asked how it tasted with an excited smile. I told her I wasn't giving it back! Haha! Then she gave me the rest that was in the blender. Awesome service. You don't get this kind of genuine service at a chain coffee shop like Starbucks.", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-07", "description": "Latte was super bitter, do yourself a favor and get some syrup flavors to mask the actual coffee. And they are apparently only open til 7:30 pm. The owner/manager turned out the lights on us as we were sitting there and told us we had two minutes. The other employees were very friendly and said sorry as we left, but the owner seemed like kind of a douche.", "author": "Cara R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "I didn't know what to get so the server recommended me to order the mocha freeze. The environment of the café was cozy and nice. Great people coming go and it's nice to see the staff being friendly amongst the customer. Very clean and nice for this coffee shop. The managers are sweet and Tamar will sometimes bring you treats to try. I love it.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-28", "description": "Around the haight a lot. Decided to try their \"Mexican mocha\", biggest mistake to make on Monday morning or in general. Mexican in their terms means add chili pepper? Why do I want my coffee with an over load of any kind of chili. Barista should warn people or it should be posted?  $5 on spicy coffee. For the record, no Mexican drinks chili pepper with their hot chocolate or mocha. Worst experience on their \"unique\" coffee selection. Where is a abuelas chocolate mix! This coffee shop just mixes random shit and calls it something famous.", "author": "Nadia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Much better than the Yuppie four barrel coffee or ritual roasters. Ss3 all day long with no pretentious", "author": "Tom P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "My day won't start without having the coffee here!!! Best coffee in the haight street ...Service is very good Laila and Gabriele are very kind !!!", "author": "Rafael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "Cantata is a great spot on Haight St. to grab a cup of coffee and a snack, or two or three . The shop is small but packs a punch( vast array of choices) . The service is prompt,fast and friendly. Gabriela is a star aka she always puts just the right amount of Almond Milk in my coffee. When I'm biking \"The Wiggle\" I will often detour to Cantata for a coffee and a smile.", "author": "C H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Came here today (Friday 9/25) and got a jasmine green tea boba milk tea. It tasted absolutely delicious! Percect blend of tea and milk. The lady who was working was very sweet and so was the gentleman! Quick and nice service!", "author": "Anjoleen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-10", "description": "If it isn't on the menu, it probably isn't going to be great.\n\nThat should be the slogan for Canata because as good as their focus on coffee is, there are some things that just shouldn't be ordered from them.\n\nWhile wandering down Haight me and a couple others found Canada because they advertised boba on the front door, something that my girlfriend and I had become very fond of within the last couple weeks. So we stopped in to grab some boba and while we were there we grabbed a butter almond cookie and two chocolate chip cookies, which they told us were oatmeal. \n\nI ordered strawberry boba tea and my girlfriend ordered almond boba tea. We both agreed that it was the worst boba we have ever had. The strawberry boba tea tasted like bad strawberry milk and the tapioca balls were all stuck together at the bottom making it almost impossible to suck them up and if I could they were bland. My girlfriend couldn't drink past 1/4 of hers as she began to feel sick from drinking it.", "author": "Kieffer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "what a wonderful coffee shop in the heart of the Haight district with lots of History.\nThe service was outstanding and the two owners Tamar and Vasken love greeting customers and getting to know them.\nThe vast menu of Coffee really gives you the the confidence that these people know wht they are serving.\nYou have to stop by and get your bolt of Caffeine at this shop.\nPastries incredible and european tradition unlike other Coffee shops.\n\nIl be back Gary", "author": "Gary D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "Ambiance: This cafe is adorable, with a slightly antique feel to it. There are many cute little antique decors in the shelves on the side that give it personality.\n\nFood: I ordered their Mexican hot chocolate, and I was pretty pleased with it.  It was hot but not so hot that I had to wait a long time for it to cool.  The spice was a bit strong for my preference but did not overpower the chocolate flavor.\n\nService: The owner is a sweet, conversational lady who makes you feel very welcomed, and the drinks are made really fast.", "author": "Kailin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Amazing customer service. Loved that they had a special menu that they came up with on their own. This is what a coffee shop should be like, separating yourself from the standards. Definitely will be back again.", "author": "Christie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "I lived in the Haight-Ashbury area of San Francisco for about a year, and this was one of my favorite haunts. The staff here are extremely personable and friendly, in particular Leila (Layla?) and the owners, and their children.\n\nThey have a small selection of pastries (if you're into baked goods, you'll probably have better luck at Cafe Cole) but offer a much bigger variety of specialty drinks, like Boba tea, and the celebrity-named creations of their own (my girlfriend was a big fan of the Audrey Hepburn and the James Joyce).\n\nThey're also very engaged with the local scene -- I don't know what the arrangement is, but many locals will advertise with sidewalk chalk, which is a good sign.\n\nWhile each coffee shop in the Upper Haight (Coffee to the People, Cafe Cole, Flywheel...) has their strengths, this was definitely the one I came back to most.", "author": "Pablo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-03", "description": "I ducked into this little cafe place to grab a quick drink in the middle of shopping on Haight. Convenient location.\n\nI decided to get adventurous and ordered a Audrey Hepburn. 1. I LOVE audrey hepburn 2. it sounded pretty good? vanilla latte with coffee and cinnamon? BAD. I thought it was waaaay too cinnamon-y. :( I think if it was just toned down a liiiiiiiitle bit I would've actually enjoyed it but all I tasted was cinnamon \n\nAnother note, they have boba here which my friend said was decent. But we're asian so we got some boba standards. lol. So she said it wasn't bad but we've had better. \n\nI also had one of their giant cookies hehehe I couldn't resist :3 \nIt was a gamble because I love soft cookies and hate the crumbly hard crunchy cookies and theirs were the soft kind! Yaay! win! \n\nOverall, might come back to try one of their normal coffees and not get all crazy but there are other places I would rather go if I was in the area. \n\nStaff was super nice though and they have some seating inside.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-03", "description": "I wish Cantata Coffee Company would place just a little more emphasis on a good cup of coffee.  That said, the majority of the menu is enjoyable.\n\nThe espresso drinks are good, but served a bit too hot to be enjoyed immediately. Cantata offers a number of other products, including gelato, bubble tea and a few pastries.  Those are also good.\n\nThe shop is in a prime location at Haight and Cole.  There are a couple of small cafe tables out front where you'll find regulars enjoying a beverage and some spectacular people watching.  Cantata keeps their doors propped open, welcoming both locals and tourists who find themselves wandering down Haight.  The inside has a cozy bohemian vibe.  There isn't much space--maybe one or two seats and a small standing space, but the shop always seems to be staffed appropriately to get you in, out and on your way quickly.\n\nIf you're just strolling by and enjoying the sights and sounds of our unique neighborhood, this is a good place to pop in for an easy on-the-go refreshment.", "author": "Helene O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Cool little takeout coffee and bobo drink place in the Haight, just a couple of blocks from Golden Gate Park. I'm writing this review because the owner is a really sweet man who was very helpful to us when we visited yesterday.", "author": "Kay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "Service is usually untrained but friendly none the less. I always ask for half and half in my Italian soda and it' seems to be a big procession each time I do.\n\nTheir macaroon's are good but the area for stirrers and coffee tops is small and hard to navigate.\n\nBasically a small community coffee house. Oh and it only accepts cash.", "author": "Meg T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Me and my boo just picked up some unique and delicious beverages! Love this place. Love the atmo", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "Wonderful barista: polite and understanding. Cozy atmosphere. Lots of special drinks I wish I would have tried. Gelato?! I didn't get it, but I bet it's grand.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "Came here for boba - was actually pretty good! The pearls were a good texture. We got almond and taro - both were yummy, but the taro was a little too creamy for my taste", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "Unfortunately, I feel obligated to give this establishment one star. When I first entered, the repulsive smell that haunted the store sent me right back out the door for some fresh air. My mother and sister assured me that it smelled like that before (gross!) but that the quality was still alright. However, the quality was no where near alright. All three of us ordered different drinks and cookies, and all three of us threw out our drinks and cookies. The horrible customer service and rude cashier led me to not request a new drink or complain about the flavor/consistency. My mom didn't have the energy to deal with the employee's either, so settled for the trash can. My sister refused to accept her awful beverage and requested a new drink, which she concluded was just as vile. Long story short Im never going back!!!", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "Was walking to McDonald's to get some breakfast because nothing on Haight opens till later except a handful of cafes including this one. I walked by and saw they made breakfast burrito for a fair price and thought, hey, it's Haight, I should try everything here to say I tried everything here.\n\nThe burrito was pretty good and didn't seem like it was as cheesy or greasy like a lot of unhealthy breakfast burritos. But what really made my morning was the coconut hot chocolate and the great service from the warm and welcoming server. I wished I got her name so I could mention it here on yelp, but uhhh, I dunno. Mid to late 20s Caucasian female with brunette hair? I dunno, but she sold me on the hot chocolate just by being nice to everyone, cuz I had actually walked out with my burrito and actually turned around to get the hot chocolate.", "author": "John N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-19", "description": "This place was so cutee and the girls working we're magnificent. It's a very small place but after a weekend of madness le boyfriend and I picked up some coffee and gelato just to relax. \n\nWe sat at the stools that faced the street and people watched. Something about San Francisco residents.. \n\nSo yes. Perfect little place to stop for coffee if you're on a date or simply out with friends. I highly recommend getting some gelato & hey mix and match the flavors, they allow it (; pumpkin & cheesecake combined = YUMMM!", "author": "Shelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Yep, good coffee, fun service, nice vibe. I have found my non chain coffee place folks! My favorite is the Madonna. Sweet and fruity, with that coffee taste.", "author": "Bahar A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-26", "description": "Fine, but not fantastic. I had the John Lennon which is a mocha with English toffee. Very sweet and not overly espresso-flavored. I'd skip this one and try something else on the menu or, if you're looking for something a bit more serious, check out Stanza, the place across the street. I didn't go in but it looked seriously trendy.", "author": "Scarlett C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Came here for the first time and was shocked by all the different options! I got an Iced Caramel Latte and my friend got the Boba and they both were delicious. We then bought a vegan banana chocolate chip cookie which matched perfectly with our sweet drinks. The manager and working baristas were all incredibly sweet and we enjoyed the calm atmosphere of the cafe. Definitely a 100% if you're down on Haight and want any type of drink.", "author": "Noah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "This place is home away from home. The owners are like family to me! The coffee is so tasty and wakes you right up. Great place to start your day. The spinach pastry is delectable! Oh, and the stuff is the greatest! Love everyone that works here! Best coffee in the Haight! A must if you are in the area!", "author": "Brandi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "I keep coming back all the way from Nob Hill (where I live) just because Gabriela and Elana, and all the other baristas who serve me are always so nice, and prepare an excellent extra hot cocoa just the way I love it.  Cantata is my favorite place in the Haight to stop for a hot drink during San Francisco's notoriously cold summers. Highly recommended.", "author": "Eli S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "I live in the neighborhood and had never seen this place until today. I ordered the Colombian Caramel frapuccino with almond milk and it was AMAZING! I couldn't drink it fast enough. The staff was very friendly and sweet. I read the reviews about the Audrey Hepburn and am desperate to come back to try it. I would recommend this place to anyone!", "author": "Laura L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-15", "description": "First of all, the iced coffee here is very tasty! It has a rich unique flavor that is definitely not low quality. The pastries here are always amazing, always doughy, and just overall quality.\n\nNot to mention I love the owner. She always asks how I am doing and what is new in life. Whenever I go there its a nice chat to catch up. I always feel welcomed and she always gives me gelato samples :)\n\nTry this place out, its way better than your starbucks routine", "author": "Gunter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Great service! Tasty drinks! What more can you ask for? Iced or hot, their cafe is one of my favorites in the city!", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Great coffee! Loved the Madonna! And awesome vibe! Shout out to Sid and Elaina for hooking me up with some good coffee!!", "author": "Tony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "This was my first time to Cantata coffee and I loved it. Awesome barista, Sky, who was very friendly and helped me decided on what to get. I met the owner who loves what he does and does an amazing job doing it. My iced tea was fantastic and the store has just a really cool atmosphere and I'll definitely be coming back soon!", "author": "Phoebe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Very nice people and they offered us free samples of gelato right off the bat.  The gelato is good and not overpriced and service was very speed.  Definitely a good place to for dessert.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "Delicious Audrey Hepburn latte. Great friendly staff!!!  Great spot!!!  Will definitely come back when I visit the city again. Love the lattes!!", "author": "LCG G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-12", "description": "Stopped in with my boyfriend for a cup of coffee. Thought the selections were interesting. We both had the Marilyn Monroe which was good. I liked the cute quaint feel of the place and there are a few tables outside to sit and enjoy your coffee under the cool fog.", "author": "Siv L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Kindest staff ever, prompt service, and quality products. I can't say enough good things about coffee cantata, they make me feel like they really care about my day :)", "author": "Kat A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "I don't usually write Yelp reviews, but I had to do one for Cantata since I literally go here all the time! The staff are amazingly nice & every drink I've gotten here has been perfect, from lattes to milk teas. Even their baked goods are great & I always pick one up. Will always be a loyal customer!", "author": "Chantel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "This is a must-visit destination in the Haight. It's not just the amazing Gelato or the great coffee, but the owner & staff are all engaging and enthusiastic on any given day. \nI've always gone back every time I've been in the area. I recommend you visit as well!", "author": "Bilal Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-11", "description": "I'd like to rate this café higher but just can't justify it!\nPro: Lovely artwork on the walls. Handy location on Haight.\nCon: Lousy staff customer service. The girl at the counter was deep in conversation with another male member of staff behind the counter. I waited a while, tried to catch her attention, ordered a coffee, she took my money, gave me change and not once did she look at me, smile, gesture.. anything! She just was not interested in my custom. I felt a little like I was interrupting her conversation by ordering a coffee. Even when the coffee was ready she left it on the counter called \"coffee!\" and went back to her conversation. I was the only one in the café at the time and I was standing at the other end of the counter.\nEven at that, the coffee wasn't great!\nAltogether a disappointing (and so, only) experience at Cantata.", "author": "Ash J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Came into the coffee shop because I saw that they sold boba milk tea. I was a little hesitant since it was $4.95 - which is on the pricier side. The first sip was a little off but as I kept drinking, it tasted pretty good. When I left, all 4 of them said bye to me. I really appreciated the kind hospitality!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "The Aubrey Hepburn might be the best latte I've ever had. Went 4 times during a 1-week stay; staff were always super friendly and noticeably nicer to the local homeless population than were the folks at surrounding eateries.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Great coconut boba while visiting the area! Would have preferred without the actual layer of boba since it was very chewy but the drink in itself was very good! Super friendly staff.", "author": "Edwin V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "The main reason why I wanted to write a review is because the owners and baristas here are so lovely. Layla, Tierney, Nanor- you are great ladies, warm, funny, friendly, even with difficult customers or a long line. In a city filled with asshole baristas y'all are rays of sunshine. \n\nMy favorite sweet drink is the blended mocha frappe with toasted coconut. It's not something I've seen offered anywhere else and it's delicious. \n\nI also love the dates stuffed with walnuts. Once the owner gave me one for free, for no reason, and I guess that was a good marketing tactic because now I love them! \n\nI work down the street and my coworkers and I send people here all the time just because they're so nice. I hope Cantata is around for a long, long time.", "author": "Laura K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Cantata is my neighborhood coffee shop and I wouldn't have it any other way. I have been coming here for over a year since I moved to the Haight and am always impressed by the high level of customer service and quality of coffee.\n\nI absolutely LOVE the owners - they are so welcoming and are always genuinely happy that I have stopped in. Further, they have hired some really cool baristas who are always smiling, even early in the morning when I head to work. \n\nCoffee wise, I usually only get hot drip or iced but it's always delicious and I am a snob when it comes to coffee. My friends have gotten espresso drinks from time to time and have always enjoyed them. \n\nIf you're walking around the Haight or are in need of a new local coffee shop, I wholeheartedly recommend that you stop in to Cantata, grab a treat and say hello. You'll be in good hands!", "author": "Allie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Great coffee!!! Cool and pleasant place.  I particularly love Gabriela's  great service and barista skills.", "author": "L G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "I adore this place for so many reasons. First off, service is always impeccable. The last time I stopped in, the girl behind the counter struck up conversations with her customers, myself included, and was so genuine and heartfelt. The atmosphere is great with the decor on the walls.. so much character. And also, you really can't beat the location of this place! Shopping on Haight is one of my favorite pastimes in the city, and the trip wouldn't be complete without stopping in here to get my caffeine fix!", "author": "Miranda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "I love stopping into Coffee Cantata on my way home from work. It feels like San Francisco used to feel and the people behind the counter there - Gabby and Brandy and all of them really, are great. The owners are lovely too. The coffee's good and if you're killing time, the street scene outside the window is endless entertainment.", "author": "scott w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Super friendly staff! I've been there a few times and the ladies behind the counter are always welcoming.", "author": "Anne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "The owner is super nice and you just get such a warm at home neighborhood feeling about this place. Delicious drinks and great food. And thank you for filling up my water bottle too! : )", "author": "Soledad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "ok so mrs.tamar the new owner i got to meet yesterday when i went in for a bubble tea!!\ni ususally get from quickly.... oh but never again this is one of the most amazing  subtle milk teas made old school.....its like merlin stepped behind the counter and magically whisped the drink together!!!! but no that tea is fab!!!!! a must have from and awesome, extremely nice person!!! both of the women had a quick smile and kind words and magical skills in the drinks department!!!!!", "author": "Richard F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-22", "description": "My cappucino tastes too burnt. The barista was super nice though.", "author": "Alan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-28", "description": "Lovely place with a great soul and nice art on the wall. Vasken and Tamara are great people, always friendly and talkative. Their cookies and ice cream is delicious and I always get my latte as I want it. These people rock!", "author": "Rebekka M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "A friend and I walked in here one day as tourists in need of some caffeine. What an adorable cafe! We happened to be lucky enough to meet the owner. What a doll! The specialty coffees we ordered were tasty but the owners bright personality would keep me coming back for more! Too bad I live in Canada however I will definitely be back here when I make my way back to San Francisco.", "author": "Brandi E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "Nice little coffee shop. Pleasant barista and good service. Coffee was good and warmed me up on a chilly afternoon. I will be back.", "author": "Nathan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-29", "description": "Came here a few weeks ago with some friends. I ordered a Thai tea, my friend ordered a taro latte, and my other friend got a scone. My tea tasted absolutely nothing like normal Thai tea and for the expensive price, most of what I got was ice. It tasted okay, but definitely not what I ordered. The taro latte was okay. The scone was dry and flavorless. Not to mention when we came in there were only two people working, one at the register and one making drinks, and the one making the drinks was talking to a friend who had stopped by so it took a while to receive my order. Overall, this place is nothing special. Good in a pinch, maybe, but nothing more.", "author": "Hanna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-17", "description": "I must admit I got more than I expected when I stumbled into Cantata on a fluke during a haphazard wander through the streets of San Francisco.  The hand written sign outside announcing the availability of breakfast tacos caught my eye and I stepped inside only to be greeted by both Vasken and Tamar who were warm and inviting.  The Turkish coffee was made with \"Love and patience\" while the breakfast burrito, although made off site and reheated was flavorful and filling.  I fully expected to pay double what I was asked.  \n\nI was treated like family and would recommend this little shop to anyone wandering down Haight street in search of a quick bite or a jolt of caffeine.", "author": "MF A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-13", "description": "The coffee was pretty good. I got a Frank Sinatra because the lady behind the counter recommended it, and my friends loved it, but coffee is pretty much just coffee to me. Service was great, barista was nice, and the food was good too. Loved the decor, and I would have totally tried to chat up the barista if he rung me up, but he didn't, soooooo...\n\nBut yah, it was fair priced in my opinion, and the place was super clean. I'll definitely come here again if I'm up in SF and roaming Haight.", "author": "Bret Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "Cantata has been under new management for 5 months now. Apparently, the old management was horrible. I was there for the first time a couple of weeks ago, so I can't say anything about the old staff, but the woman who runs the place now is SO kind and cares a lot about her business! She really made my sisters and I feel welcome and ready to serve us! She's working really hard to improve the reputation of this cafe, so GO GO GO! And then write about it on Yelp, of course! Haha.\n\nMy sisters and I ordered coffee drinks from their signature menu, which are all named after classic, famous celebrities. I got the Audrey Hepburn, which has coffee, cinnamon, and vanilla in it. It was my perfect cup of coffee! I loved it! All those flavors were blended perfectly. It tasted like Christmas in a cup! Haha. Very comforting and with just the right amount of sweetness. One of my sisters ordered the James Joyce, which is coffee, one shot of espresso and Irish cream. Yum! Our other sister got the Frank Sinatra, which is blueberry coffee. Really interesting flavor, subtle, so it's not overpowering. You still feel like you're drinking coffee haha.\n\nOne thing that should be mentioned is they only take cash! Kinda annoying for someone like myself who doesn't carry cash all the time, but a slight inconvenience when you consider the wonderful experience you get here.\n\nPlease make a stop here and try something! You won't be disappointed! The 3/5 average rating is unjustified.", "author": "Shani V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Nice little caffeine cove here. I got the Audrey Hepburn (I couldn't resist)   The owners are absolute sweethearts and Gabriella is a gem!", "author": "Bella B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "I have worked in the Haight for a few years now and I love going to Cantata because the owners and the staff are so friendly. It was their matcha frappes that drew me in originally, but the rest of their menu is fun to explore too. Try Tamar's homemade chai!", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Frank sinatra coffee and croisaants...really good! Place too tiny.Decorated with handicrafts giving ethnic touch.", "author": "Priyanka L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "I love to check out local coffee joints when I'm on vacation, so while wandering along Haight, I popped in here. The bf & I were greeted by the welcoming owner who didn't hesitate to recommend some of their specials. I ended up with the Dominican Chocolate Mocha. Holy cow. It puts Starbucks to shame! Wish we had a drink like this back home!", "author": "Katie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "Ewwww..... Not worth it. The milk tea is $5 and it doesn't taste good. They use powder to make the milk tea....yucky", "author": "Christina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-28", "description": "Having fun on Haight on Thanksgiving! Yummy almond Crossaint and well made cappuccino! Best part is the friendly staff!", "author": "julie h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "I give Coffee Cantata 5 stars for good coffee and GREAT service. Tamara is so friendly- you can tell she really knows how to run a coffee shop. \nThe coffee is really good, I'm hooked.\n\n**The previous owners were really awful, so note that if you read older reviews.", "author": "Russell Allen E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-15", "description": "Tried this place a few times over the years since it's right at the corner where I catch the bus once per week when I come to play kick-ball and I either have a wonderful experience or a less than satisfactory experience so I have never been able to make up my mind about Cantata Coffee Company. Last week was another so-so experience. I walked in and there were two girls working behind the counter. Both friendly and talkative with the regulars that were also in the shop. I ordered a bagel and a tea. I got the tea almost right away, but the bagel took a really long time which was weird since the girl not working the register took my bagel order while I was in line to expedite the process. I'll keep coming in whenever I can't wait to get to one of the coffee shops around, but I wish there was some consistency in service. I really want to love this place since it's so convenient.", "author": "Maggie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "There is no place quite like Cantata on Haight st.. From the moment you walk in you feel like you are at home. Tamar and Vasken (the owners) are the sweetest and friendliest people you will ever meet. The menu is full of delicious drinks and pastries. From Coffee to Espresso to Italian soda to Frappe's to the best Chai in San Francisco. Homemade by Tamar with fresh spices. Try it once and you will be hooked. They offer all their drinks hot or cold with regular milk, soy, or even almond. Cantata now also has delicious Boba Milk Tea in a variety of flavors. The pastries are fresh and tasty and the dark roasted coffee is the best in the Haight. This quaint little shop is a must see for yourself. I won't go anywhere else.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "SO, If you wan't to see the most beautiful barista in town, be welcomed by the enveloping and unparalleled warmth of the wonderful Tamar and Vasquin, cozy up with Marilyn Monroe, Audrey Hepburn or Frank Sinatra (reincarnated caffeinated clones of them) and indulge in SF's finest coffee-based concoctions, THIS is where you want to go!!!  Leave all your worries behind when you step through the doors of Cantata Coffee and discover yourself immersed in a magical Middle Eastern-influenced oasis where each cup truly is made with love.  I can't speak highly enough about this place, I'm salivating just thinking about it.  \n\nAlso, you can't miss it, just look for the psychedelic sidewalk chalk art in front of the store, produced by local Haight/Ashbury artist/legend who goes by the name of Spaz.  If you're really lucky, you just might catch a glimpse of him in action; unleashing his artistic advertisements on the ground right before your eyes. ;-)  \n\nKeep your eyes equally peeled for Juliet atop the interior balcony and watch out for Romeo behind the counter. ;-)\n\nShukran Cantata Coffee!", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "Great masala chai. I'm kind of a chai connoisseur. I've had the chai at many Indian restaurants, cafés, and at Raman's in half moon bay. I like it the best at Cantata. It's on the spicy side so if you like it sweet you should add a sweetener. The owner is very friendly, she always remembers me. The cookies are fresh. The powdered almond cookie is delish.", "author": "Kathy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "This coffee spot is such a gem - located right in the middle of busy Haight St. Both customer service and quality of coffee go above and beyond, and each trip into this cozy, yet beautiful spot create a great experience. I frequent Cantata for a cup of coffee (as I am often in the area) and am greeted each and every time with warmth, friendliness, and kindness. The staff and baristas have a special way of treating all customers with familiarity and make them feel at ease amidst all the craziness of the Haight. The couple who own the cafe are lovely, and genuinely take interest in their customers, making sure their experience is enjoyable and pleasant. They are such kind and gentle people, and create an environment very unique to Cantata.\n\nAlthough I normally order only a cup of coffee, it is difficult for me to even consider sampling any of the other cafes on Haight St. Their coffee is rich and delicious, and always brewed very hot. I often find my cup of coffee to be one of the biggest comforts in my day. I have also sampled their vanilla latte and famous \"Audrey Hepburn\" - both tasty treats that complement the wide variety of pastries sold at the register. I highly recommend any of the muffins, the banana nut bread, and especially the granola cookies. All three are equally dangerous and sooo good!\n\nIf you are looking for a cup of coffee in a uniquely comfortable environment, I highly suggest Cantata. Their creative, delicious drinks paired with their kind and genuine staff make it an ideal spot for a caffeine fix!", "author": "Hannah B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-27", "description": "meh nothing special coffee was ok and service was ok.\n\ncompared to some of the great coffee shops ive been to in san francisco this place just doesn't stack up.\n\nlike i said the coffee is basic, nothing special and the service was ok.\n\n\nnothing that would make me come back", "author": "Jaime D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-11", "description": "Bad bad bad. I ordered a small Earl gray which was supposed to be 1.75. I asked for whole milk in it, became 3.75. Gave cashier a 5. Got back 25 cents.\n\nFirst of all: REALLY? You're going to charge me 3.75 for a small cup of tea and milk?! Second of all: that was a TEABAG. Third of all: I just bought the entire box of teabags for you. And lastly, learn how to do math. \n\nDon't get me wrong, they are definitely friendly people. But probably because she just robbed me of 4.75.", "author": "Bianca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "I had a delicious cup of coffee.  Also had some lemon gelato that hit the spot on a hot day in San Francisco.   The place is a good place to go.  Overall a good place to be.   Next time is boba time.", "author": "Sosi K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-28", "description": "Very poor coffee. Ordered a soy latte, and it was 20 mins before it was cool enough to drink. Seriously way to hot which ruins the coffee. Super loud traffic outside with the door left open, had to shout my order at the poor ladies behind the counter. The staff seemed sweet enough, but the place has a poor layout with no real direction where to order or stand once you have. Not going again.", "author": "Kathryn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "This is one of the most pleasant little shops in a cute neighborhood filled with tons of annoying people.  The pot smokers will puff in your face, the wannabe hippies will say stupid things about \"Nirvana\" to me and the hipsters rant about occupying Wall Street as they pull out the latest iPhone from their Prada bags.  \n\nI'm relieved that I was able to escape to this tiny little coffee shop.  It didn't try to be fake trendy by having a Devanagari font/scripted sign.  All I wanted was a nice Italian soda without someone pretending to know about Indian culture or what occurred in the 1960's.  I know plenty enough about that already.  Luckily, the girl working there was focused on her job and made sure to ask me if I needed more syrup and less ice.  Tamara, who is super friendly, talked to me about where I'm from, and we exchanged life stories.  It's great that the place is under new management.  It has made a huge difference in the quality of service.  They have also added more spots to sit, as that was really needed the first time I visited.  \n\nIf you want a bakery with the highest quality items, you probably will not get them here.  It doesn't have the best almond croissant in town.  However, I wanted to escape all of the pretentious jerks who frequently congregate the Haight-Ashbury area.  I got exactly what I needed for next to nothing and have returned a few times just to pop in and say hello.  The young musician who works there is really friendly as well.  Lots of patrons become regular customers.  I'm glad that some of the control freaks who drink way too much coffee didn't like the place.  Don't come back.  Go home and boss your children around, soccer moms.  As for that girl who completely understands wanting to up sell items after being asked where the restroom is, yet bashes Tamara for saying \"Enjoy your walk\" as she leaves: I hope you feel better about yourself for giving Cantata one star.  I have serious doubts that you're important enough for Tamara to be intentionally rude to you.  She's so nice to everyone who walks in.  Regardless, I'm sick of people assuming that every place is a public restroom...", "author": "Jay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-14", "description": "The place is quaint, looked as though it served as an entry or mudroom in the Victorian it is built into.  Didn't meet the old guy, met a cute, helpful barista chick, who clued me in on the espresso milkshake ($4.75) after I was turned down at another coffee joint on the other side of the street.  Kinda small portion size, but chocked with caffeine goodness, it's the perfect beverage for those of us who still straddle the line between adulthood and childhood.\nExtra * for having Philippine Brand Guava and Mango juice!  Last place I'd think to see that stuff.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-22", "description": "Some people have a genuine interest in making other peoples' days better. Its the little things that count, like a friendly conversation with a new or recurring face. The few times I've been to this quaint little cafe, I've left not only with a yummy caffeine fix, but I've also left appreciating warmhearted folks like Tamara who go above and beyond. I highly recommend stopping in and checking it out!! Oh and try the gelato!", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "Looks like this place gets a lot of mixed reviews. I have only been there once, but my experience was nothing short of ideal. I was on my way to the bluegrass festival and stopped in for an espresso real quick. The girl at the counter was that informative, but she was cool and made good conversation. Luckily the man who I assume owns the place was there to talk to me about there espresso. Apparently the man's friend roasts there beans, and has been doing it for 45 years. The espresso was excellent, good flavor, good crema, and well extracted. They were even nice enough to show me the beans they use and talk a little bit about them. I had a great experience there, and if you love espresso I would highly recommend you check them out.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "This quaint little place feels like straight out of the movie chocolat.\n\nThe interior is warm and cozy with a cool selection of coffee, tea and pastries. I had a,marylin monroe, and it sure did live up to its name :)\n\nBut the best part was the barista (Tamar) herself, who makes it a point to make every customer feel special", "author": "Sebastian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-22", "description": "I usually don't review a place based on bad service, but I'm making an exception here. Without a doubt the rudest barista I've ever experienced - I don't ever remember someone telling me to \"come on, use your brain\" while trying to order coffee.\n\nI couldn't wait to get home to burn this place, but was rewarded to find the number of 1-star reviews and references to this woman's mental instability. Instead of being pissed, now I just feel bad for her. \n\nAvoid this place at all costs! Coffee to the People and People's Cafe are just down the street.", "author": "eliah g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-13", "description": "Good Coffee for a walk around historic Haight area.", "author": "R H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-05", "description": "Definitely decent coffee at a decent price.  The ladies are also very nice and friendly.  The guy- not so much.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "I was discharged from Davies Medical Center two days ago after being treated for chest pains. Since the cafés near DMC were packed, I decided to drive us to the Haight, where my partner had not been over 20 years. We discovered Cantata, a small Armenian café, as we strolled around looking for a quiet place.  No invasive background music. Patrons can have quiet conversations.  Good coffee, Middle Eastern pastries, and fabulous hospitality from  Tamar and husband,  Vasker. My partner and I are both old men with difficult health issues. We love celebrating life together, while we still can.Cantata provided  us  another reason to do it.   Prices are reasonable. We give it five stars, and hope  it never becomes  yuppiefied.", "author": "George W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "In all of my 12+ years in San Francisco, this is by far the best coffee I have ever had!", "author": "jen b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "The new owners are absolutely outstanding! They have changed that whole vibe to family and friendly!  Great coffee and great people.", "author": "sarah g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "I love Cantata. Such a cute, quaint respite from the bustle of Haight. I go there sometimes to kill time before work and the owners are always super sweet and nice to talk to. They have great espresso and it's usually warm inside with big windows that are just perfect for people watching on Haight St... which is always interesting of course since the neighborhood is littered with..uhhum.. characters shall we say. They even have yummy gelato! Which is why I give this place 5 stars!", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "I went in about a month after the new management started. They warmly greeted me, and were very happy in general, which is a nice change! I felt so welcomed, naturally I tried multiple pasties which were all quite nice and very inexpensive, and the coffee which was great also. They even let me use the staff restroom after I had stayed to chat for a little while!\n\nDefinitely worth going to regularly for some baklava and a coffee!!!!", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-10", "description": "Eh, the mocha I ordered was alright.  Nothing special.  Wasn't bad, but wasn't very good either.  Not good enough to make me want to go back.  But a bit cutesy inside.  They serve nice looking pastries, though I didn't taste any.  And whipped cream on your drink is 50 cents extra- boooooo", "author": "A T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "I was there for the first time the owner who runs the place is so friendly they have the best coffee and worth trying their pastries . THANK GOD FOR NEW OWNERSHIP !!!!!!!! VERY INVITING PLACE !!!! MUST STOP BY...", "author": "GS S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-14", "description": "New Management makes a huge difference!!! \n\nWife and I were walking the little guy on Haight street on Sunday when we decided to get a cup of coffee from this place.  The husband and wife team were friendly, attentive, and kind. My cappuccino and my wife's hot chocolate were both perfect, and the homemade baklava was off the hook. The place is clean and the location is nice (at the beginning of Cole). \n\nI read some of the other reviews about this place and was a little surprised by all the negativity but I guess they were in regards to the old owners/operators. The new management makes a huge difference and I would highly recommend this place to others.", "author": "Mike Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-09", "description": "Not that great of a coffee place and being next to Good Will doesn't help. The flavor is really lacking, but I just got a regular cup of joe. I do hope that their specialty stuff is much better.", "author": "M C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-26", "description": "Overpriced, dingy, disorganized staff (are three people behind the counter at any given time really necessary?) I didn't expect much; after all it is the Haight but I gave it a shot anyways. It is the kind of place where if you want half and half, they give it to you only when you ask and when you do they hand you a pint of Lucerne that they probably bought at Safeway on the way in and look eager to get it back lest you suddenly find an urge to over-milk your coffee. Aside from that - no debit cards taken and the coffee itself makes it all not worth the trouble. Hopefully their new management can help clean things up. I am fan of small businesses, but no one in any type of economy is happy giving up hard-earned money for low quality products.", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "I had the Audrey Hepburn, which was delicious. I also bought a pound of the house blend beans, which were not so delicious. The owner was very friendly and I will definitely return if I'm ever in SF again!", "author": "Mark L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-01", "description": "This coffee house has been in the neighborhood for ages but I've never stepped in there or even remotely had the urge to get a coffee from there. Why? Not sure exactly, but the shop itself isn't exactly inviting plus there are so many other coffee houses around the neighborhood itself. \n\nI was waiting the bus on Haight and Cole one morning and haven't got my coffee yet. It was the closest one so figured 'why the hell not?' I agree with Netty, the owner is very friendly and pleasant. His shop is neat and simply decorated. The coffee is well priced and the small size I found to be a perfect size! \n\nThe second time I went there, I was trying to branch out and tried the pastries. Boy, what was I thinking?! I got this Raspberry Croissant and it was stale! It was hard. Did I miss a sign saying it's a day old (or even 2!) pastries? I don't think so. I will stay away for sure from all pastries!!\n\nMaybe one of these days, I will try the ice cream.", "author": "Perry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "I like this place ... I find it clean, sweet, aesthetically pleasing and I absolutely adore the older gentleman behind the counter.  \n\nFor those that are up on my reviews know that I am seriously not a huge fan of haight street itself ... I'm not nor have I ever been into the hippie shit, I have little tolerance for slow (read: stoned) walkers, i find the smell of resale shops exceptionally nauseating, I am offended by teenagers that pose as homeless while their cellphones ring and of course, the dress over jeans look is about as common sense as ugg boots sans the snow ... you can see why I avoid the main drag of haight street since these repulsive visions make the usual stroll an exceptionally unpleasant one.  However, this little cafe is too sweet to ignore ... so when I crave the perfect nonfat, sugarfree vanilla latte, I force myself out the door to brave the brutal elements of haight street en route to this destination ... and those that know me know that this is truly extending high and mighty props.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-30", "description": "I ordered a soy mocha latte. She scooped some Nesquik powder into some hot soy milk with not-so-gourmet coffee. Oh, hell to the no!", "author": "Patricia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-26", "description": "Absolutely love this place!! Great coffee and great owner, Tamar, who reminds me of everyone's mom or favorite aunt. My brother and I are from Washington D.C. and every time we go to Haight, we are sure to visit her and her shop. She serves the Best cinnabuns ever! Also the best Audrey Hepburn I have ever had.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "Really good, unique coffee choices with star names like Audrey Hepburn and Frank Sinatra. my favorite is the green tea latte, uncommon and delicious. The staff is really nice & if you cuy 6 coffees the next one is free.", "author": "Genna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-27", "description": "Almost all the coffee in the upper haight stinks, except for this place. I  trolled the streets when I worked there looking for a good cup of strong, full bodied coffee. The coffee here is delicious, and comes in attractive plain white paper cups. The old man who owns the cantata is jovial and pleasant. He always brightened my early morning retail details. They roast all their own coffee, and there's never a line.", "author": "Netty L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-06", "description": "We spotted this place while waiting for a friend who was doing some shopping.  The coffee was not bad.  The service a little gruff.  For us, our experience was just blase.  Nothing to write home about and nothing to get really ticked about.  Would I come here again no!  \n\nOur issue with this place is not so much the place itself as the young lady working behind the counter.  She was a bit curt with us, but I can deal with that.  Just not visit again.  What she did to another customer blew me away.  Another out of towner who was waiting to head down to get her tattoo at one of the shops in the neighborhood had just set her stuff down at the adjoining table.  She even greeted us and before she could do anything else, the young lady came from behind the counter and demanded of us if the other woman was with our group.  Before we could answer she told the other woman that the tables out front were for customers only.  The woman asked her to give her a moment and held up her asthma inhaler.  The barista then went into the store and told her she only had 2 minutes or she would be calling the police.  The poor woman decided to go into the store to purchase something to keep the barista happy.  Our friend had joined us by then and followed her in the store and watched in amazement as the barista refused to serve her and told her too late she had called the police.  Needless to say we were amazed and prepared to defend this poor woman.\n\nNow I understand that yes there are those who loiter and create a scene but this was not the case.  This lady was also a tourist like us and was prepared to buy a drink and a pastry to keep the barista happy.  She refused to sell her anything and just told her she could deal with the police.  This whole incident happened in a matter of less than 10 minutes.  \n\nWe will not be visiting this establishment again.  Which is sad, because it is very likely that the owner of ths potentially (especially from reading the reviews) cool place may not realize what a problem they have on their hands.  This woman definitely should not be working in any capacity with the general public or customer service. \n\nFood decent.  Staff (from our experience) sucked!", "author": "Michele P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-09", "description": "One of the few good cups of coffee in the city.  \nNot only do you get a cup of coffee for a dollar and a half, you also get to talk to your own Italian Grandpa.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "It's not fair that this place has been tarnished with a low star rating from the previous management who sold the business a year ago. I usually skipped this place because it doesn't have the best seating, but now it has become my main coffee shop. The drinks are good and prices are extremely reasonable. A large iced coffee is only 2-3 dollars, depending on the barista ; ) Every single employee who works here is extremely nice and fun to talk to. The owners are very nice and all of their staff is really hip and friendly. Give it a try the next time you're in the neighborhood. Shoutout  to Alex, who knows to give me an orange straw to match my sunglasses", "author": "John N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-31", "description": "I really wish I had checked in with my fellow Yelpers before stopping by this place. I also wish I could give zero stars.\n\nOur unbelievable story goes like this: We were seduced by Cantata's outdoor tables, not because of their makeshift quality--the furniture is crowded, irregularly-sized and uncomfortably cheap--but because it was just a beautiful day to enjoy the fresh air. I left my colleague outside at an open table (there's only 2), and walked inside to order. Since it took both of the women behind the counter to help the 1 customer ahead of me, and since neither was willing to even acknowledge my presence, I decided to head back outside to check if this place even had the wifi that we needed. After 60 seconds of trying to figure it out (in which I never sat down, and instead stood facing the window so I could spot an available barista), one of the women came outside. INSTEAD OF APOLOGIZING FOR THE WAIT and taking our order, she immediately demanded that we leave--no, she actually shooed us off like we were animals, saying that the tables are for customer only. When my colleague explained that we were coming in to order (and even though we were reflexively gathering our belongings to comply with her wish), she actually used her short stout body like a broom to move us as quickly as possible out of the space. And then, get this: SHE FLIPPED US OFF.\n\nSeriously?! Why work in the service industry if you don't like people?! Friends, don't let Cantata take your money, time or good mood.\n\n(And, not that it should matter: We were nicely dressed. There was no reason to suspect hat we had no money, nor that we may be shady characters.)", "author": "Savannah L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-30", "description": "I am mad that I even have to give them a star. I walked in there yesterday before a meeting with my boss. As we walked to the counter we could hear one lady snapping at the last customer as she walked out. We pony up to the counter and Boss orders a Cafe ole I ordered a black tea to which she replied in a evil tone \"Which one\"  I said the darkest you have. she said what size? I said large please. Having worked in a coffee house usually you get 2 tea bags in a large that is why it is usually more expensive. Boss asked \"why is the large so much more?\" She said because it is a large. you pay for more everything. I said you are paying for an inch of water Half joking half not. She started in on me and snapped more and Boss said FINE WE DON\"T NEED YOUR F\"ING COFFEE. She stood there and said get out then.\nWe went across the street to get another coffee in a bit of disbelief and mentioned it to the other cashier to which she replied that she hears that often.\n\nI will not be going back there ever again.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-08", "description": "I'm a little surprised at the positive reviews here.  I've been here 3 or 4 times and it is hands down the worst coffee on Haight.  That's pretty damning.  I'm talking drip and espresso.  \n\nI'm tempted to give them a second star since they were the only coffee shop open on xmas, but they lose half of it because I couldn't finish the cup because it was so nasty.\n\nThey lose the other half because of the annoying tourists.  One star!", "author": "Dan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-14", "description": "This weekend my lovely, friendly, warm boyfriend sat down outside to wait for me to finish at the Wells Fargo atm.  I wanted that extra 45 seconds to decide what drink to order from Cantata.  Some how in that time span (I'm serious it was not more than one minute--I even used the fast cash option at the atm), the woman behind the counter at Cantata came outside, told him to leave, and placed what I assume is a fake call to the police.  I came back to find him pale as a ghost and saying, \"Ma'am I'm giving you nothing but love right now.  I wish you a peaceful day.\"  She kept her back to us.  \n\nNow, I'm sure she gets bothered a lot by people wanting to sit in those chairs.  But even if she has a problem with loiterers--he was wearing a tie and jacket and I was on my way to a United Way event so I had nice clothes on too.  We were clearly customers.  WTF.  Open your mind to the idea that not everyone is your enemy, lady.  What a horrible, scary place to buy a cup of coffee.", "author": "Meghan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-19", "description": "I live a minute up the street and I try to get my coffee here before school or work every morning. Vaskin, Hanada and everyone that works here make it such an enjoyable experience, they're the friendliest cafe on the block BY FAR, they're a great addition to the wonderful community feel of Haight. In addition to all of those warm fuzzies, their coffee is great. I've tried a ton of stuff over the year and it's all delicious. My favorite are the oat bars (fresher and chewier than most!) and blended green tea. Definitely stop in if you're looking for a place in the neighborhood, and take a seat to people watch through the window or chat up the wonderful staff!!!", "author": "Katy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-07", "description": "Caffeine addicts will find flavored coffees, lattes, mochas, and espresso drinks, while health fiends can indulge in freshly-squeezed juice choices like carrot, cantaloupe, and watermelon, or thick fruit smoothies.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-15", "description": "I went in here and got a scoop of Double Rainbow ice cream. Halfway through, the ice cream got gooey, like it does when ice cream is old and sits out too long. I went back in to ask for a partial replacement for the gooey ice cream and the woman in there got some serious attitude. She told me she wouldn't replace it so I asked for my money back, so she snatched it from me and gave me my money back. Don't go there: the ice cream was bad and the service was terrible.", "author": "Rachel K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-09-22", "description": "I agree with Netty L that \"almost all the coffee in the upper haight stinks,\" but I don't find Cantata to be an exception to the rule.   I've had the coffee here three times, and the last two just because I was trying to be fair and give it another chance.  The ice cream is ok, though, and I like that they exist.  But they really need to get some better coffee.  If you are down that end of Haight, I think I would go with Rockin Java.  Neither place has good tasting coffee, but at least Rockin Java's coffee is organic and fair trade.  Better yet, get a little exercise and walk down to Coffee to the People -- Organic, fair trade, and delicious.", "author": "John D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-25", "description": "I walked in the other morning. The barrista (generous) looked like she needed a shot of Prozac lumbered down the ladder from a loft and muttered something that just made me think twice about spending my $ here. So I turned around and walked out. The place looked dirty. So far, I am disappointed in the cuisine and cafes on Haight. Doesn't anybody take pride in their shops? The entire street could use a serious power washing. I guess I'll stick with People's Coffee for now. I am used to the quality of Java Beach across from the Zoo.", "author": "Eileen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-06", "description": "Not the best coffee, but it does the trick for late evenings at work, and mostly I just really love the sweet Iranian owner who asks how I am doing and actually means it...", "author": "Janine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-04", "description": "I got a decent Americano here. That's all for me. It was decent but nothing to write home about. My fiancé, on the other hand, had what he calls, \"the best coffee in the entire WORLD!\" He is a girly-man and loves the sweet stuff--and Cantata delivers. His cappuccino/latte thing-a-ma-jig was very delicious. I'd even order it for myself as a treat, given the right occasion. It was sweet, yummy delicious-ness, but not any more than it needed to be. Plus, the lady behind the counter was nice and completely shocked when fiancé offered to restock the cup lids. What can I say? I dig the humble people like myself.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-08-27", "description": "Rockin' Java (try the house blend) & Coffee To The People has much better coffee.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "Coffee wasn't anything exceptional, but loved the old guy behind the counter. Hard of hearing, but super friendly. Only time I've ever been offered to have the chocolate and cinnamon sprinkles put on my latte for me. And he refilled his nonfat Double Rainbow yogurt. Thanks man!", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-21", "description": "Coffee is a difficult thing to buy on Haight Street. Since I drink a lot of it, I end up at Coffee Cantata quite a bit. The ladies that run the place are always nice to socialize with, but the drinks aren't exactly the top quality. A size small is REALLY a small, comparable to a short cup over at Starbucks. Their espresso is pretty fair though. Seating is limited, but is spacious enough to sit and people watch for a while.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "so amazing sweetest people ever!!! and I had the best peach smoothie ever!!! oh & my best friend loved her iced coffee!!! :)", "author": "Lena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "This is a very small coffee shop right on Haight street.  They have a few chairs outside and some seats at a window bar, good for people watching on the weekend.  I love the older guy who works here, he's very sweet and makes a mean espresso.  Their smoothies and milkshakes are great as well, and I recommend trying some of the little chocolates under the glass dome if you get a coffee.", "author": "Simon B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-20", "description": "The sign says \"milkshake or malt, thick and dangerously creamy\". The shake was anything but. Watery and icy would be more accurate. It's unfortunate, because the ladies are pretty nice compared to the dickweeds at Cafe Cole. I strongly dislike the upper haight for food and beverage. Doesn't anyone realize that all the restaurants and cafes cater to tourists, and therefore don't have to worry about repeat business? That's why everything is sub par. Grrrr. Makes working here tough.", "author": "Hale B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-23", "description": "What a change the new management has made!!!!! As of the 1st of February, new management has blessed this coffee shop. The new owners are a nice family and the women on the counter (believe her name is Tamara) is super nice!!! She is very warm, welcoming and made me the best cappuccino. The previous owners destroyed this place (reason for all the other negative reviews) but I am so glad the new owners are picking up the pieces and making this coffee shop a happy place to walk into! I have found my new coffee joint and will continue going there, as long as the owners decide to stay put! I will highly recommend this place for all who need a quick coffee/pastry fix! I do admit, it is the best coffee on Haight street.  Thank you Cantata Coffee and to the new happy owners! :)", "author": "Nadia V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-24", "description": "Wow, worst coffee ever. Maybe one step up from 7-11. Complete waste of money.", "author": "Kristen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-25", "description": "i went here today and ordered an espresso shake, the description sounded great. so 10 or so minutes later she puts it on the counter for me and my girlfriend notices they forgot the whipped cream so she asks for some and the woman dissappears into the back and comes out with a can and says in a russian accent it will be 50 cents. i point at the description that clearly lists whipped cream as one of the ingredients on their sign and she won't turn to look she says it's extra. i said would you please look at your sign and she says it's not included. i said you know last time i was in here there was a guy giving you a hard time and i thought, oh poor girl, but now i'm pretty sure you deserved it. she just stared blankly and said her boss told her to charge for whipped cream. on top of it the $5 drink was filled to the top with chipped ice. it really sucked.", "author": "john b."}
