{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "I love that this place exists in the center of San Francisco. It's so convenient of a location to get work done when you need to. This is such a cool concept of a bank having a cafe and I love getting work done here. On their main level, they have a Peet's coffee if you want a snack or some coffee. \n\nThe wifi here is fast and reliable as well! There are 3 stories and so much seating. You can sit at high tables or couches and regular tables or bean bags. Whatever you want, they'll probably have. If you're ever in the area and want a nice place to get work done around a bunch of other people who are also getting work done, this is a great motivational place to be.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "I love this place so much. I moved here 2 weeks ago , live in the financial district and work from home so I thought it would be a breeze to find some cool little places to work was and boy was I wrong. I'd find a little cafe with nice lighting and.. no outlets. Or a fun outdoor location with no bathroom for blocks. .. or decent wifi and the coffee was $12. \nThis place is spacious, not ever too crowded, made for working (big strip outlets on the tables) quiet but still has a buzz of background noise/music to keep you grooving through work. Plus 50% off for capital one users. If I wasn't already one they'd have me sucked into being one! \n\nMy list of working needs: \n[x] Desks \n[x] Outlets \n[x] bathroom \n[x] Can hold a call\n[o] wifi \n[x] reasonably priced coffee \n\ntechnically they do have wifi, but it hardly works. I use my phone hotspot just fine, so it's not a killer.", "author": "Alaura J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "Pretty useless.\nI wanted to open savings account for $35000 and ask them to sign a document for dmv so I will be self insured. I was told it's not a branch blah blah blah and they don't have right to sign any document and I need a branch and nearest branch is in Texas and they cannot send this document by mail (why?).\nWe are living in 2018, post office not invented yet.", "author": "Vlad S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-29", "description": "So bummed because this is the closest place to get coffee near work. But it only takes one screw up and some attitude from a barista to get me to never come back here. Luckily there are 50 billion coffee places nearby, but to be fair I'll definitely keep coming here because any poorly run Peet's coffee is better than every Starbucks any day of the week. \n\nBut FYI - the difference between an iced drink and a hot drink are so substantial. And after literally waiting 15 min while I watched people behind me in line get similar drinks first I'm blown away that I could get attitude when asking that my drink be iced when that's how I ordered it.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "It's a really nice place ,plenty of seats and charging stations.Peets coffee and snacks for purchase.I loved being able to pay card and it posted same day.", "author": "Terance C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Super chill spot to hang out in the middle if FiDi. It's modern, there's free WiFi, places you can plug in, and there's a fully functioning Peet's inside where you can get 50% any drink if you pay with a Capital One card. The price is taken off as you pay. So, they will say \"your total comes to $3 please\" and when you hand them your Capital One card, they will then say \"ok, your new total is $1.50\"\n\nIt has high ceilings and multiple floors, so it doesn't get too loud like other coffee shops.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "The Capital One Cafe is such a cool concept. The space is inviting and fun and the people that work there are so nice.\n\nI also went through three sessions of the free money coaching with Janaki Bakshi and I can't say enough good things about her! She's is intelligent, caring and so thoughtful. We worked through alot of things I've been deliberating and she provided incredible support and guidance. I wish I could do 3 more sessions! I have recommended her to many friends. Thanks for such a great service, Capital One!", "author": "Maggie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "This place is awesome! I never knew a bank could be a cafe. It's clean and has lots of space to sit and relax. \nThey have free beverage days and 50% off when you use your capital one card. \nWe got a quiche here. It was so good! Super flavorful and fresh. Nice and warm. \nThey have a cool world map where you can put a pin where you are traveling next. \nThey need to have more of this type of stuff in the USA!", "author": "Betty H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "This is one of the hidden gems to study at in sf. It gets crowded sometimes but decent sitting area with solid WiFi and plug in ports. With three accessible floors, I have always found a spot pretty easily though. The ambience is good. It quiet place to get work done and get a coffee from the Peet's coffee shop located inside. Would definitely recommend and come again.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "I needed a place to study because studying at home...well, let's be honest: I netflixed 90% of the time I was supposed to be studying so that wasn't working. I was debating on studying at a library but ***yawn*** - boring. \n\nAnd then Capital One Cafe comes along! My coworker told me about this cafe, and I was already so excited simply listening to her describe the space. The cafe is very open and has a lot of space to study (individual tables, sharespaces, AND private rooms you can reserve say whaa), discounted coffee/tea, free wi-fi (it's *really* slow though but I shan't complain), free waffle Wednesday's (this is pretty dope), great location near the bart, beanbag area for you to chill in. All in all, pretttttty genius of Capital One to have spaces like these all over the country.\n\nIt does suck that the cafe closes at 6 PM on weekdays - here's hoping someone from the cafe will bring that up to management so we can stay just a little bit longer.", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-07", "description": "This used to be mine favourite hangout spot for coffee daily, it's spacious, comfortable with reasonable fast wifi, and right in the middle of FIDI, I'm surprised a place like this doesn't have a better security, I first noticed there were occasionally one or two interesting characters hanging around, but it wasn't enough to bother me, however these days there seems to be these mental patients permanent home. In fact, I've just witnessed as I'm writing this very review that a security guard who just walked pass these homeless people and did a sharp U turn out of here.", "author": "Skyler Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-08", "description": "I wish I could give less than a star. Not only do this banks ATMS (3 of them) never work, but the customer service here is appalling. I had my card and app hacked and it has been a total nightmare dealing with this joke of a bank. THEY GAVE MY ACCOUNT INFO TO MY HACKER AFTER KNOWING THAT THERE WAS FRAUDULENT ACTIVITY!!! This bank is the worst bank I've ever dealt with. Their catch is easy and simple bank, but it has been the most frustrating and horrible experience I've ever had. I think Capital One forgot that I AM THE CUSTOMER. If you value your hard earned money and your precious time, skip these thieves.", "author": "Becca J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "Customer service was great! They helped me with everything I needed and more. Very friendly people. They did try to swindle me with their special deals and offers though, which was a tad bit annoying, but it didn't bother me much.\n\nMy one big problem was that the rewards aren't as great as my usual go to, American Express. I didn't get as many airline miles, and reward points for each purchase. \n\nThe interest rates were also a little lower at Capital One, which seems great to others, but for my purposes, not so much. \n\nAll and all it's a great establishment, so long as you can suffer through all their promotional stuff when you call their support line.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Great place to work! Good overall noise level (you can focus on your own work but also could take a call and not be a disturbance). Three floors with couches, tables, and bean bag seating so you can find the right vibe for you. The baristas at the Peet's on the ground floor are super sweet and the Capital One advisors just sang someone happy birthday \n\nWifi can be a little spotty, but its free to anyone which is super nice.", "author": "Heather W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "This place is a a goddamn oasis in the middle of the Union Sq. concrete jungle! And by that, you can grab pretty decent coffee, take a piss and use their wifi ... potentially all at the same time!\n\nSeriously, it's a spacious and solid place to work and get some shit done. Did I mention it's a great place to pee while you are desperately looking for a restroom in the neighborhood?\n\nWell played, Capital one!", "author": "Ki C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "FunCheap reported that this cafe would be giving out free coffees and Smitten ice cream on Halloween during certain hours, so I decided to take a trip downtown and I brought Zane. The ice cream was no big deal and it ran out. But the free coffee was awesome! I got an iced coffee in the biggest size. Zane got a purple tea. No complaints. Thanks a lot!", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Pros: Great cafe, chill space, nice people.\n\nCons: Internet speed needs improvement! Monday to Friday and 9-6 only.", "author": "Saad Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "Located near Montgomery Bart station. \n\nSuper convenient cafe that you can get free wifi, a charge for your cell phone and some coffee and pastries at a decent price. \n\nI came in here to kill some time while waiting for an appointment that was about 45 minutes away from the time I walked into this cafe. I am a capital one card holder so there was definitely incentive to come in when I saw the sign outside stating if you use your capital one card, you get 50% off tea or coffee. \n\nIt's clean. It's spacious. There's bathrooms. It's bright and there's lots of amenities to be had if you're looking for a resting place or even just a place to surf the web and kill some time. \n\nI ordered their iced matcha green tea - delish! Not too thick or sweet. Much better than Starbucks in my honest opinion.  \n\nI will definitely be back again. \n\nP.S. All coffee and tea are provided by Peet's Coffee.", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Jennifer Aniston and Friends had their Central Perk Café. I have my Capital One Cafe.\n\nIt's like family--that's all I can say.\n\nIt wasn't too long ago when I returned to San Francisco looking for a cafe to settle back into life in the developed world. The transition wasn't easy--I still wasn't accustomed to seeing colorful lines of code splattered literally in front of every open computer and conversations of the next \"big thing\" from every corner, but I couldn't have found a better place to settle in. The staff here is amazing--it's what they do.\n\nFrom games to activities to Waffle Wednesdays, it's like you're part of a big, happy family. And I do mean \"big\" and \"happy.\" The brand ambassadors are always there waiting to greet you with a big, happy smile. It helps to start off the day right.\n\nWhile the staff may be the best part, there's also 50% off coffee if you swipe using your Capital One card. 3 floors of ample space...the perfect place to co-work or to meet someone for coffee...and you'll never get kicked out. \n\nI'd say the only negative would be the WIFI. It's slow. So if you need speed, try somewhere else. For any other purposes, it's the place to be. And...you can't beat that location!", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "So much love for this place. \n\nIn a pretentious yuppie city like SF (note: SF is where I was born and raised and I have more love for this place than anywhere in the world, but let's be real, it could not be more pretentious or yuppie), this place is a huge breath of fresh air. \n\nThe space is HUGE with lots of plugs and tables to work. Coffee and snacks available. No one bothering you. Good wifi. Not too loud. Literally the best place to work if you actually need to get work done (vs a cute trendy environment which this place lacks being a chain Peets).", "author": "Roxanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "I'm so happy that a place like this exists! It's a workspace with a Peet's coffee downstairs.\n\nMost coffee shops are built and centered around the ordering area, but Capital One Cafe is centered around being a good workspace. The atmosphere is absolutely wonderful. There are plugs everywhere, and a variety of ways to do your work! Tall desks if you want to stand, long desks for lots of people, solo desks if you need to be alone, corners to hide in with bean bags, etc. The possibilities are endless! I love the open layout of the place too with the tall ceilings. It's three whole floors too!\n\nEntrance is at the 2nd floor, bathroom is on the bottom floor.\n\nWi-Fi is free too! They also offer discounts for Capital One card users. You don't have to be one to work here, but the perks seem pretty good!\n\nIf I lived closer, I'm pretty sure I'd be a regular at this cafe. So awesome!", "author": "Tsyria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "Came here for an event by NAAAP (National Association of Asian American Professionals) San Francisco chapter. Peets coffee was closed but drinks were provided by the staff of Capital One (water, soda) and wine provided by Scholar Wine. Food, momos and somosas by NeWa. \n\nThe event was called WIN! (Women in NAAAP). WIN! is a dedicated program within NAAAP that provides a platform for Asian American women to share their experiences and connect and with the wider NAAAP community. The event was a gender inclusive event. Programming included a Q&A session and networking sessions at the end.\n\nBesides this event the Capitol One Care hosts other events through out the week.", "author": "Allen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-14", "description": "2 stars for half off discount for capital one customers.  Docked 3 stars because it took almost a half hour this morning.  When I asked how much longer I found out that my drink had been sitting there for quite some time.  I wish they would call your name and put names on cups like every other coffee place.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "The future of banking is here and gone are the long lines at Wells Fargo and their overpriced fees. I signed up with Capital One 360 Banking in February 2016 when I got tired of parking my savings at Wells Fargo and earning nothing but a petty 0.01%. It was insulting. I searched high and low for a bank or credit union that offered a minimum of 1%. For a bank to offer that in today's economy means no local branches and a completely online experience.\n\nSure, I was a little hesitant even at my age (30) to give all my money and send it \"online\" but I was reassured by it being Capital One and being FDIC insured. As a Capital One credit card customer for almost 15 years, I never had a bad experience with them and I was excited to move my banking with them. It wasn't until weeks after that I had my account that I noticed on their website that they had a Capital One Cafe in San Francisco, one of only 3 in California. \n\nCapital One Cafe is exactly what we need in 2017. Gone are the tellers and sleazy bankers and instead we have full-service ATMs, a fully functional Peet's Coffee, WIFI, and plenty of seating spread across three floors. It's welcoming as well as educational with financial workshops produced by Capital One. The bank does employ a few customer service reps to help anyone with Capital One financial products but I've never been bothered in any of my visits. It wasn't until today's visit that I explored the lower floor which has more seating and more importantly, restrooms, which I was unaware they had. \n\nIt's hard to complain about what Capital One is doing. It's what our generation needs and they are disrupting the business of banking by going online and I welcome it. My only complaint would be the ATMs seem to be a bit on the older side and not as fast as the competition but I think they will be upgraded in due time. Lastly, you can't complain about the 50% discount at Peet's by using any Capital One credit or debit card.\n\nWells who?\n\nAmbiance/Decor: 4/5\nFood: 4/5\nService: 4/5\nPrice: $\nOverall: 5/5\n\nPros:\n+ Full-service Capital One ATMs\n+ 50% off Peet's with Capital One credit or debit\n+ Plenty of seating spread across three levels\n+ Free WIFI\n+ Private conference rooms available for reservation\n+ Restrooms on lower floor\n\nCons:\n- ATMs are older technology \n- Closed on weekends", "author": "Alexander E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "I had a great experience last time I was in this cafe to get a help from a staff in order to transfer money. \n\nAlex who was one of the staffs was so helpful and professional. He kindly walked through the steps to transfer money via cashier check.", "author": "grace k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "Hmmm....what's the catch? This is GORGEOUS space with plenty of seating, plenty of outlets, free wifi and a Peets coffee shop as well.\n\nIt's like the poor man's coworking space, if you count plush couches or new furniture as the poor man's vibe.\n\nSeriously this place is great- the WiFi can be a bit clunky at times, but when it's free and you've got a great place to work for the day can you really complain? \n\nI'm sure if you're here long enough they'll approach you about a CapitalOne product but they definitely don't seem to be aggressive in any sort of way.", "author": "Elliott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Latte and gingerbread \nThe peet's latte is as good as always and the gingerbread is better than I expected.\nThe decorations are so good. It's a nice place to stay with books and food maybe works", "author": "Yantong Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "This is my favorite coworking space (free too!) in San Francisco. Truly it does not get any better in a City where coffee shops can get very crowded.\n\nPros:\n-Tons of plugs. Street level, upper level, lower level (w/bean bags too).\n-Plenty of space. Couches for those that want to be more comfortable.\n-It's a financial institution, but they're not pushy at all. In fact, I wouldn't know it is except for the 50% Peet's Coffee sign. On Fridays from 1-2pm, there is Happy Hour. Everyone an get 50% off one drink. Capital One card holders get it for free.\n-Various free financial related workshops. Special events during holidays with free cookies and ice cream.\n-Decent amount of bathroom stalls.\n-Peet's Coffee. You can check in w/the Peet's card.\n-Takes credit card.\n-Close to public transit. Montgomery Bart Station. MUNI 38, 8x, 45, 30, 2 and 3.\n-Good mix of techies, writers, office crowd having lunch, and folks catching up. Some students although not a lot.\n-Great place to work/remote for the day.\n-Next to one of my favorite yoga studios, Ritual Yoga and bubble tea at Asha Tea.\n-Friendly staff. All smiles.\n-Huge open space. \n\nCons:\n-Closed on the weekends. Open daily M-F, but closes promptly at 6pm. They even make announcements!\n-Wifi, at times, can be spotty. For the most part, it works fine although not super fast. \n-It's still an urban area so I would keep an eye out on your belongings or ask someone to watch it for you.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "I love the concept and layout of this place! But the baristas were slow, coffee wasn't great, and the WiFi wasn't strong. I was hoping to get some work done but had to leave because of it. Not saying I wouldn't be back if I come to town again, just that it would be better with more people working (late afternoon during the week, aka coffee time, and only two people working) and better WiFi (could've been my computer but tbd).", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "I almost don't want to write this review so that more people don't find out about this place. I just don't know what's not to like. Let's see:\n\n- Huge, modern, clean interior\n- Coffee line goes super fast (it's Peets so it's not necessarily amazing, but it's good)\n- 50% off coffee with capital one credit cards\n- A ton of open space (three floors), and it's never been crowded when I've been there\n- Free wifi and tons of outlets for charging your laptop\n\nThis place is just the absolute go to if you need to get work done during the week. The only disadvantage is that it's not open later or on the weekends (there's just no one around the area to come in and work, I guess). I suppose you also have to deal with Capital One's capitalism running rampant in here, but that's what's paying for the place and the people around ready to talk to you about applying for a credit card are never bothersome and actually give the cafe a friendly vibe.\n\nThe best time to come is the mornings, because that's when you get the odd, comforting sort of atmosphere where people come in and finish off their morning routine by getting coffee before heading into the office. It feels calm, productive, and for some reason I like how financial and businessy the mood is.\n\nI swear to God some people must be in here all day working on their startup, it's a really great work environment. I've been coming here on and off in the mornings for a long time and I don't see myself stopping any time soon.", "author": "Noah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Peet's Coffee in the cafe - I'm usually a Starbuck's gal but Peet's has vegan coconut whip cream (+35¢). \n\nIt can get quite loud. There are three levels. The 1st level, or the basement, is a tad quieter. They also have bean bags! The second level has the Peet's Coffee as well as tables and seating. The third level has a ton of seating and workspace but the noise tends to travel up so it can get really loud. \n\nThe bathrooms always smell like someone took a shit. Cause someone probably did. Coffee does that to ya!", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "Free location to hangout or do some work. The wifi is terrible but can't dock any stars since we are freeloading in sf. I suggest one to bring work that can be done offline or bring a personal  hotspot. Coffee is 50% off with capital once card but it doesn't seem like you are obligated to buy anything. Homeless was minimal when i visited. Free toilets downstairs too.", "author": "Spring J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "Great place to work with occasional special activities and promotions. Beverage discount if you have a capital one card.\n\nLattes and other drinks with froth tend to be poor. Tastes too diluted with milk, and the froth takes up half the cup! Was told it was controlled by their machine so they couldn't do much to fix it.", "author": "Bruce L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-02", "description": "I'm disappointed with the work atmosphere at the cafe. It's a great idea, but poorly implemented.\n\nThe aspect I have the biggest problem with is the noise. They don't have a set music station for calm background music to work to. They have an iPad, and whoever has the iPad gets to pick the music. Unfortunately, that means one person can pick party music to listen to and everybody has to listen to it. There is nowhere to hide from the music unless you have earphones and listen to your own.\nI also wish they had tables that were tall enough to use as standing desks. There are some that are almost tall enough, but not quite (I'm 5'8\").\n\nPros: free wifi, they don't make you buy a drink, relaxed atmosphere", "author": "Sara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Elinor A. is on the mark here. This is a fantastic, large, airy venue at which to work or hold meetings in the Financial District. There's 3 levels at which you can spread out, with tables and counters upstairs and at ground level, and a bean bag-filled loungey area in the basement.\n\nThere's a Peet's Coffee stand to serve all your caffeination needs, and there's enough music, background noise, and video screens to keep you engaged and productive (lest you look like a slacker for being on Facebook instead of, ahem, working). There are even clean bathrooms in the basement. \n\nMoreover, there's never any hard sell - or any sell, for that matter - from Capital One whatsoever. How much better can a free workspace get?!", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-16", "description": "My first time at a Capital One Cafe. It's conjoined with Peet's Coffee. And offers 50% off drinks if you use your Capital One Credit Card or Debit Card. Not Bad!\n\nBut you don't have to be a Capital One customer to walk in, nor....do you have to buy anything. There are plugs everywhere and people appear to walk in and just use the facility. And restroom! A number of tables and sofas are offered as people hang out. It's normal noise level, not that many people are talking however; they seem to be busy on their laptops.\n\nThe share space, open office kind of style is really neat.\n\nJust drop by and check it out yourself. (I just walked in, after roaming around the city....standing awkwardly as I walked the 2nd floor and back down. The bathroom in 'basement'.)", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "After reading Ramit Sethi's \"I'll Teach You To Be Rich,\" I immediately went and did research on ING's online savings accounts. I found out Capital One bought them a few years ago, so I just opened an account with Capital One! \n\nI've met up with my friend Peter H. at this coffee shop more than a handful of times to read or get work done, and I've always been impressed. With three floors (top: lots of tables and sofas, middle: Peet's coffee and lots of seating, lower: bean bags, more seat, and restrooms), you're sure to find a nice comfy place. If you need an outlet, sit at the communal tables! There is free WiFi, and even on a busy day, I didn't feel like it was slow at all.\n\nHalf off drinks if you use your Capital One debit or credit card. Score! \n\nSimply put, Capital One 360 Cafe is my all time favorite coffee shop to get work done. Cheers! :)", "author": "Christine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Been here several times now. In fact, just yesterday, half off all Peets drink when using Cap One card, either credit or debit, score!\n\nFree wifi, comfy, easily reached from the main artery that is Market, and easy comfortable banking accomplished too. \n\nNo brainer.", "author": "Jana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Great spot! Plenty of communal tables or private tables for a meeting. Not too loud music. Good coffee too! And if you talk to the CapitalOne folks they may even give you a free coffee card", "author": "Raj S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "The service here was great and the staff was very accommodating my needs. \n\nI love the fact that I can pay my bill right there straight through the ATM with no hassle.\n\nI am committed tho this cafe every time I come to San Francisco.", "author": "Erika L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "I wish places like this existed in Los Angeles. Was up in San Francisco for work and met a co-worker here for the day. What a great space. So many different types of seating options...from high tables, to couches, to bean bags. Everyone in there was busy focused on their own own work in front of them, which is great to be around as you try to focus on your own work. The space was very open and in a great location. \n\nA few negatives: The free wi-fi was a bit spotty for me so I was having to connect to my personal hot spot a number of times. The elevator only works with a key card and if you're carrying  bunch of work files like I was it was a pain to go up the stairs (tho there is a security desk at the entrance level that may have been able to get it working for me to use but I didn't ask). And got a bit hot in the afternoon sitting up in the third floor.\n\nHowever I was able to sit there all day and get a bunch of work completed and all in all it is a great setup.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "I love this place and use it very often when come to SF for meetings or just need to work in between. Wonderful atmosphere, Wi-Fi, outlets everywhere, casual style, super nice staff \nIt feels like the place from the future, need more of these in San Jose, Palo Alto etc.  ))", "author": "Alex F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "great place to go for coffee before/after work, super close to MUNI/BART station. security guard present, ton of space to sit and work, free public restroom available too.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Synopsis: Amazing customer service.\n\nDets.: Three words: Evyn, Nina, and Lutie.\n\nThese ladies are amazing. From remembering my somewhat complicated coffee order (yes, I'm one of THOSE people) to asking me about my day, they go above and beyond the call to make me and other customers feel valued.\n\nNot sure these reviews have any bearing on bonuses and raises, but maybe they should. These women are awesome, and I'll keep coming as long as they're here.\n\nPro tip: \n-Capital One card = 50% off beverages!\n-First Wednesday of every month = free waffles (avoid if you hate crowds like I do)", "author": "Cami A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Great three level, open space, many outlets, speedy free wifi. Couches for lounging are available. Only downside is many communal tables, limited in table space for your own. Pretty minimal noise level. This place is such a contrast from the dim lit coffee. I appreciate the lots of lighting which helps me see my work better.  I wish there is more work/study places like this around SF.", "author": "Carleen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-16", "description": "Many reviews here relate to coffee. And when you get here you'll see why.  This is a place to buy a discounted drink while you get some work done.  It's not a bank.  And if you come here to solve a Capital One banking problem, the kind you can't fix online or over the phone, you are fucked.  There is one kind and helpless employee standing at a kiosk to answer simple questions like, where's the ATM?  All other questions are met with \"Sorry, we can't do that here\".  So in the end, the people who are reviewing this place as a cafe have it right.  Come for coffee.  Come for the atm.  Don't come to bank.", "author": "Art R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "I love this cafe!\n\nIt is an open, modern-tech bank that meets a fused concept of a cafe lounge.\n\nThe layout is contemporary and welcoming.  You can smell the aroma of Peet's coffee and they give you a half off discount on your beverage if you use your CapitalOne debit card or credit card for the purchase.  Sweet deal!\n\nThere are plenty of seats available to do what you need to do here!  Free wi-fi!  Also, conference rooms are available upon reservations.  The bean bags on the bottom floor level, reminds me of dorm life.\n\nThis cafe is super convenient!  With CapitalOne online banking, friendly staff assistance on hand, coffee and tea to keep you running and a spacious seating area to do your work, it has everything you are looking for in a cafe that is located in central Downtown!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "I'm always looking for a good cafe to work in and this became one of my favorite finds. \n\nIt's simple here. It's easy to find, there's a Peet's which is generally good (I actually really like the Jasmine green tea), areas for doing work or lounge in, free wi-fi, and plenty of outlets. \n\nI think it's a solid place to sit and do work so I'll be back again sometime.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "It's Peet's coffee in a better atmosphere.  I like its open space, high ceiling, various table and chair sets. You can always find one you are comfortable with. Plenty of outlets. Great space for work or just taking a rest. I wish the wifi speed could be faster though, but hey, it's free wifi! \n\nI will definitely come back again.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Besides my office and home, I come here the most often. Central location from all the major Bart stations in downtown (Powell, Montgomery, Embarcadero), this cafe is so conveniently located. I've checked out many different cafes while living in SF but I keep coming back to this one. \n\n50% off all drinks if you pay with your Capital One card. Love love their gigantic space (3 floors with high ceilings) and their wifi connection has gotten stronger over the past few months (THANK YOU). I also like that they have a variety of tables and chairs with different heights-- sofas, standing tables, mid-level tables, etc. Plenty of plugs on the table too. \n\nThey make free waffles every first Wednesday of the month. It's part of the sf.funcheap event. Never been to one, but they make fresh waffles with a machine. Line starts at 9am. Capital One hosts a few tech/design events at this cafe. \n\nMy favorite drink is the matcha latte!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Part bank, part coffee shop is a very interesting and good use of the space. There are chairs and tables available, plus Free Wi-Fi is included. Props to this part!\n\nI decided to come here for a cup of coffee and a croissant right after coming out of the gym. Today is certainty my first time coming here. The team members at the coffee counter were very friendly. Bank staff members were also very friendly. They are located in Union Square and very easy to find.\n\nAlso, I found this facility to be very clean. With three levels here, there is a seat available somewhere. If you want to get caught up on reading and work, this is the spot. I liked how quiet it was here and not super loud either. Purchase pastry and coffee with a Capital One Debit or Credit Card. You'll get a 50% off your purchase. Bingo, that's a very nice treat! Overall, very good first experience here.\n\nThey proudly brew and serve Peet's Coffee here. If you are passing by and in need for coffee, you found the right spot.\n\nReasons for rating:\n1. Free Wi-Fi\n2. Clean facility\n3. Friendly staff members\n4. Three levels of seating\n5. Location is easy to find", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "Free waffles the first Wednesday of the month! Need I say more?? They have a guy from B Street Waffles making the waffles fresh in front of you. I stopped by in December for a warm gingerbread waffle with powdered sugar on my way to work. The waffle wasn't very gingerbread-y in my opinion, but no complaints!\n\nThe cafe itself is a great place to get some work done. Free wifi, outlets and very clean, open and comfortable :)", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Lots of space for working and outlets everywhere.  50% discount for Capital One card holders.", "author": "Anthony F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "I popped into Capital One 360 and had a nice chat with Bud.\nI've seen Bud often when I stop into the cafe. They probably recognize me as a neighborhood regular.\nWe can shot the breeze about traveling in the Pacific Northwest...he's so nice.\nI found out there'll be some March Madness events at the end of this week! Nice to get the skinny on what's going on at the Cafe!", "author": "Joanna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "half bank, half cafe. \nand half off if you use your Capital One credit card or debit card to pay for your Peet's coffee purchase.\nconveniently located at Union Square.\nwifi all around.\none of the great perk to be a Capital One Customer.", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Definitely my favorite place to get work done in the city. Capital One Cafe is located in the heart of the Financial District - so if you work downtown it's a great place to grab a coffee.\n\nThe place has three floors and the colorful and open layout makes for a wonderful working atmosphere. The bottom floor has bean bags and restrooms. The ground floor has a Peet's coffee and some desks and lounge chairs. The upper floor is entirely a working area - with group working tables and individual tables.\n\nPro-tip: the Peet's inside offers 50% off if you pay with a Capital One Card.", "author": "Ramon Miguel F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-13", "description": "I just asked a simple question and the guy making drinks with the long hair is soooooo rude!  The guy working the register is very pleasant and helpful. Andrew is nice.", "author": "Angel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Another super awesome visit to the Capital One Cafe today... Standing by my previous 5-star review!\n\nTop ten things you can do for free (or almost free) at the @capitalone @capitalone360 #my360sf cafe:\n1) Get FREE or half priced coffee drinks with any Capital One card\n2) Plug in (a zillion great work spaces and every type of seating from beanbag chairs to couches to high barstools at a community table - plus free wifi)\n2) Unplug! (See #2, beanbag chairs and comfy couches)\n3) Paint your nails (why not? Enough room here to spread out far enough that no one else has to smell nail polish). \n4) Break dance (like I said, plenty of room)!\n5) People watch. Oh SF, how you provide hours of free entertainment with this one...\n6) Hail an Uber (and oh btw, use your Capital One card for a 20% rebate on Uber purchases!).\n7) Use the free, and SQUEAKY CLEAN, restrooms - a rare gem in SF!!\n8) Learn about Capital One cardholder only perks like concert presales and special events (currently, the iHeartRadio Jingle Ball Oct. 6-9)\n9) Catch the news highlights on one of many TV's throughout the lounge, and last but not least,\n10) When you're done with all the fun stuff, you can take care of any of your Capital One business right here in the cafe! Deposit to your free Orange checking account? Done. Need a free ATM? They gotcha covered. Question about quicksilver? Your query quest ends here. \nWhat's NOT to love about this place?? #whatsinyourwallet - if not a Capital One credit or debit card, here's 10 good reasons to change that!", "author": "Angela Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "One of my go to cafe's for work. 3 floors of open seating areas with ample outlets and strong wifi.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-08", "description": "\"Quick and convenient\" is how I would best describe this place.  At least that's how it was at 11:30 before the afternoon rush.  I only wonder how long the coffee line is during the earlier am hours.  \n\n~ Picked up a couple of B Street Waffles.  I really really really wanted to try the maple bacon, only they didn't have any.  Booo!  I was left with choosing the lemon waffle and salted caramel waffle, $3 each.  And I gotta say, I went home, warmed them up in the microwave.  and WOW, buttery and sugary crystals!  Nice!  So good I ate both, and saved a tiny tiny piece of salted caramel for the gf to try.  j/k I gave half, but stared at her eating it, so she'd feel guilty, then she'd offer it back to me. \n\n~ Oh yeah, I also Checked-In on Yelp and received a free drink.  Sweet!  A large white chocolate mocha latte.  Surprisingly not too sweet, and tasted great with the waffles.  \n\nI really like this place.  Only I was really expecting more entree type of items, but that's my fault for not checking out the menu before coming here.  This place does have plenty of tables, and I had no issues with service.  While waiting for my coffee, I took pics of the Asian art on the walls.  Jackie notice me yelping and explained the upcoming Asian Week in the city.  How cool of her!    \n\nOther highlights:\n~ A convenient atm machine next to the stairs. \n~ They also have yogurt, chips, cookies, fruit cups, parfaits, pastries, sandwiches, wraps, salads, and juice.\n~ Prices between $1-3, how cool is that?\n\n\"Quick and convenient\" I tell ya!", "author": "Ron R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "This place welcomes all! If you're looking for a spot to do work or just surf the web, this place is very roomy and has many outlets. Free wi-fi too! There is a small Peet's Coffee & Tea and they make sure to ask if you have a capital one card because you get 50% off every item with it! Perfect place to kill some time or do work outside your hotel!", "author": "Kelsey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "This is a Peet's coffee shop but they have special deals for CapitalOne customers! I came here and found the latte beverages are half off! If you are their customer, make sure you take advantage of the specials!", "author": "Athena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "B Street Waffles..OMG!  I've had the Capital One 360 Cafe bookmarked for quite some time because I miss going to the Stonestown Farmer's Market & seeing the Belgian Waffle dude.  I stopped by yesterday on the way back to the office after 10:30.  The waffles weren't freshly made, but still quite tasty at room temperature.  The texture was chewy in the middle and still firm enough on the outside.  I got a maple bacon waffle and loved the sweet and savory combo.  It was so good.  \n\nPrices here are cheap too.  Next time I'll have to try their coffee when I'm around.  The cafe looks cute too and is a great alternative to Starbucks.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "Wow with check in I got a free mocha! Score!!!!!\n\nAces in my book. Great space to work remotely, and the staff here is friendly.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-10", "description": "Not the best experience on the banking side from one of the reps. She wasn't listening and only wanted to tell me what she wanted to tell me without listening.", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Excited to enjoy a creative open space in a most unlikely place!  Good wifi, good coffee, good seating, good location, good energy!", "author": "Wayne C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-09", "description": "One of only two available deposit atms in California and they don't have the common sense to make at least 1 ATM available afterhours or weekends?", "author": "Robert J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "No complaints!\nNeeded a place to read and have a coffee and pee.\nGreat choice as I Yelped from my cell using a location finder\nPeets coffee which is always great.  Great customer service even though I was a pain in the arse deciding what I wanted to get.\n\nTables single and community.  Plugs for electronics.  Free Wifi.  Bathrooms a plenty downstairs and beanbags to sleep or rest comfortably?  WHAT?\n\nGreat.  Will be back if I visit again!\n\nI wish they had more food options but there is a 7-11 nearby and a nice pho place!", "author": "Mimi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Clean, calm, great place to work or just enjoy your coffee.  Coffee is half price with a capital one card!", "author": "Sylvain F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Who would have thought a bank could be so cool!?\n\nThe cafe is awesome for studying and being productive. It conveniently has a Peets inside, so you can get your caffeine fix and get to work. I've been here to study (read: cram) for licensure exams I take nearby at Prometric on Kearny. The first time I went, I was scared I would get hassled by the Capital One reps to open an account or something, but not once in my visits have I been approached by them. \n\nI like the downstairs area, because it's quiet and even has a cool seating area with bean bags. They also have downstairs meeting rooms that I think you can reserve or rent out (I saw a large group meeting in there when I was there). They have pretty clean restrooms downstairs, too - it's so nice how much they provide for customers! \n\nI really appreciate that a bank would consider opening something like this, where the profits may not necessarily be that high given that many people stay for a lengthy amount of time and only buy a single cup of coffee. It's so rare to find a cafe with so much space, good ambiance, outlets, restrooms, and coffee!", "author": "Alyssa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Great open space with anything from large tables to quieter nooks to do your work in.  Plenty of outlets and of course an ever-necessary caffeine hub on the first floor to fuel your brain :)  The best thing is that you don't have to worry about seating.  Coffee...good but your typical good coffee.", "author": "Mon T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "It appears that my apple watch transaction was hacked here yesterday and the card was then used around SF with fraudulent transactions.  So be careful and perhaps just use cash here.  Anyone else have this problem?", "author": "lynn s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "I found this cafe by chance while walking around downtown looking for a coffee shop. The decor is modern and spacious, and very conducive to productivity! I was there around 10:30-11am and there was plenty of free space in the 3-story cafe. \n\nIt's furnished/decorated like a wealthy, young tech company. Seriously. I've visited the SF workspaces of Meraki, Heroku, etc. and this place is resoundingly similar. \n\nPeet's is located on the ground level to fulfill all your coffee and pastry desires. \n\nDownstairs, they have a great space with tables/chairs, and a terraced-style seating arrangement by the stairs with giant beanbags! \n\nAND FREE WIFI. If I ever find myself having to do some work or studying around the area again, I'll definitely be back!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "This is literally a caffe, nothing else! They have ATMs that pretty much don't do anything! No deposits, no payments. I asked 2 guys who were there to help people with banking how to make payments or deposits and they said \"that feature is definitely coming, if you want to do that now go to a Western Union\"!!\n\nI was so excited thinking this was the future of banking! Coffee and banking with a nice ambiance but no... just coffee! I'll stick to Starbucks and WF if that's the case.", "author": "M P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "This is where I would take my clients for coffee and and discuss stuff.\n\nThey have Peet's coffee in the lobby, Capital One employees ready to answer any questions you have with your account, and 3 floors of work space. Do you need a standing desk? They have it. Table for two? They have it. Lounge chairs? Got that too. \n\nThey have plenty of power outlets and a basement where you can conduct presentations with their double high bleacher seating with bean bag chairs. I believe you can also rent a private room for conference calls but I haven't had a chance to do that. I usually find a quite nook near...I'll let you figure that out because it's my spot! No, i will not tell you this secret quiet space!\n\nThe staff at Peet's are friendly and make your drinks quickly. I guess they have to since it's in the busy Financial District and their Capital One employees usually have something going on. The last time I was there, they were playing Mega Jenga. It sounds awesome because it is awesome.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Upbeat, fun, half price off if you have capital one card and great energy for creative types, professionals and people that work on the road. They are centrally located on the cornet of Post Street close to Montgomery Bart station.\n\nThey have conference rooms, workspaces and fun people that work there too. I love it!", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "I really like this place. I love the ambiance and it's super spacious. \n\nIt's close to where I work and would order my coffee during my break and would usually make it on time.\n\nThe people here are super nice and my drink is always on point... lots of caffeine just the way I like it sometimes. In addition, they have a variety of delicious pastries on the go and some chocolates. \n\nAgain, really spacious. If you have to work, this place is great to work on it whether it be from work or school. Also great to meet up with your coworkers or classmates for projects, etc\n\nI usually order their white chocolate mocha and it is yummy!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Awesome place to hang out and study/ do work for a few hours. It's central location is great for a few hour break. Love the matcha honey latte from Peets. Use your capital one card for half off coffee - a great perk!", "author": "Ranita G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "This cafe is awesome. Capital One 360 (formerly ING) is like the hip sister of Capital One. There are two ATMs inside and some nice sales reps, but other than that, it's pretty far from your normal bank environment. The rest of the space is full of comfortable tables and chairs/sofas and free WIFI. There are three floors of workspace to utilize. Also, the sales reps are there to talk if you want to, but they won't bother you to open accounts or anything.\n\nPlus, there are so many free perks! There's a Peet's Coffee inside, and they give 50% off drinks when you purchase with a Capital One credit card or debit card. They also do random freebies- be sure you subscribe to their facebook page for updates. For Lunar New Year, they did free lunch from the Chairman Truck (one of my favorites!). I've also gotten a few free drink coupons from some of the sales reps.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Huge fan of this place! \n\nI haven't actually stayed in the cafe and have only have ordered drinks to-go. Each time, the service has been amazing. I think there was only one time that I had to wait more than 5 minutes for my drink. It was a very busy day so I'm not complaining. \n\nThe staff is very efficient at getting your drinks out on a timely fashion. Especially during the morning rush. \n\nThe cafe is always clean and I love how spacious this place is. \n\nIf you're a Cap One card holder, you get 50% off your drink order! Unfortunately, I am not. :(", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "I've been a loyal customers for years. I really like this place and as a someone that works in the tech industry, this has become one of my constants in a crazy world :) really nice employees from bankers to baristas!", "author": "Thanh P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Spacious cafe, modern work spaces with ample room for impromptu meetings, free WiFi, and Peet's coffee. What's there not to like? I think you can rent out their downstairs meeting rooms too.\n\nWhile the cafe is staffed by Capital One reps who may inquire if you're interested in opening accounts, I've never found any of them to be pushy and they're really friendly. My first experience was during a Yelp Elite event where they had a pretty sweet sign up bonus. \n\nFor those financially minded, if you open up a 360 checking account and use the debit card for Peet's coffee purchases, you get 50% off each time.\n\nI just wish they opened a bit later so people could come by after the standard business hours.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "I still for the life of me have not figured out this business model: You probably pay 60-80k (probably more) per month for rent and you charge 2 bucks for a great cup of coffee...free wifi too.  \n\nNone the less this place is amazing...a great place to meet up and discuss biz over a cup. Chill and watch Cnn on the big screens. Bring a laptop and surf the web...tis all good.\n\nPlace is no longer top secret and gets pretty busy but thats life in the big city.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "Central location to get work done while sipping a cup of coffee. It's an interesting approach to Wi-Fi at a Coffee Shop: more like a small meeting/work space/Capital One bank that HAPPENS to have a Peet's Coffee inside, and SUPER-conveniently located. ;)\n\nOnly taking a star off because the Wi-Fi (at least in the basement level) is fairly slow.", "author": "Manny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-13", "description": "I mostly like to go here because I get 50% off. When I make an actual choice on coffee, Peet's is a pretty solid one because their beans don't seem to be extra extra bold, and earthy like Starbucks or other places. Plus, I'm a real sucker for an almond milk latte. I do have to say, that there seems to be a lot of space for those that work or need to go, get comfy, and take care of business. I could see myself going there to style or hangout for a few hours if I lived in SF.", "author": "Sierra R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-06", "description": "I had to make a large check deposit. I could not scan it via the mobile app, nor upload a scan on the website. My options were to drive to the city and go to the 360 Cafe, or mail the check to Capital One 360. Given the amount of the check, I decided to do the former as it would be faster to drive to the city and deposit the check, rather than to mail it and wait.\n\nI called C1360's support folks, made sure that this is the only bank that accepts check deposits in SFBA. They reassured me that this was so. Next, I inquired if I can make the deposit over the weekend. They said, yes, the lobby is open and you can access the ATM without a problem. Before heading out, I called one more time and made sure that there won't be anything limiting my access to the ATM and successful deposit. The rep said that I was good to go. \n\nI went up to the city, battled crazy traffic on the highway (thanks congestion!), then even crazier traffic around Union Square (thanks holiday shoppers and construction!!) only to find out that, no you cannot access the lobby on the weekend. Both doors were locked. There was no sign to buzz in, or scan your card to get in. Nothing. Sorry bud, you are SOL.\n\nGiven this terrible experience, I'm going to have to cancel my account. Two wasted hours plus traffic hell are not worth it. It has been nice banking with you C1306/ING Direct. I've been a loyal member since 2008. \n\nPS: Remember 3.0% APY. Those were the good times. \nPPS: San Mateo Credit Union is pretty dope.", "author": "Zlatko U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "My co-worker recommended to come here whenever I need a little breather from the office. I really like how spacious the cafe, it has three floors and the bottom floor is more of the quiet room. There is a Peet's Coffee inside which is great when you need that extra caffeine kick. Also there is free WiFi, definitely keeps you productive :) \n\nI would definitely come here again, it's a great little escape!", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "50% off Peet's coffee if you use your capital one card!\n\nI love coffee and I love discounts. Put them together and I have just found my second home. Plenty of seating and outlets and the bankers/baristas don't give you a guilt trip if you don't sign up for an account. You also don't get dirty looks when you bring in your own food or not purchase anything (I have seen others do this). Only gripe is that it has the standard business hours M-F 7am-6pm....which means I can't get discounted coffee over the weekend!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "5 stars as a work cafe.  Spacious, clean, with lots of tables and outlets. Coffee and snacks are good.", "author": "JJ M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Place is a good spot for catching up on work, start-up style! I wish the internet was a little bit faster, and the food was a little fresher.", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "As others have pointed out, this place is awesome. Stopped on by one day to catch up with a friend and get some work done in the afternoon. Was going to buy a pb cookie and tea, when the friendly person behind the counter highly recommended I try this one slightly cheaper mini cupcake instead (which they only have on Thursdays I'm told) instead of the pb cookie. I'm gonna spoil the surprise for you - this sucker was like eating a moist Reese's Pieces, as it has a dollop of a denser peanut butter cake in the center of a chocolate cake with frosting and nuts on top. Hooray for successfully down-selling a customer, almost like spotting a unicorn! I'm going to have to try more of the creations of the company that supplies this place with baked goodies.\n\nFear not, weary office-less traveler, there were plenty of other laptop-wielding road warriors busy staring at screens scattered throughout the 3 floors of space (one is below ground, which also happens to be where the washroom and a conference room is). I love the bright open atmosphere, with the ample and varied seating arrangements, plenty of outlets, and free wifi. The wifi is also my only quibble, as it disconnects you every 30-60 min it seems, forcing you to re-login periodically. But that is a small annoyance to pay for a cafe that actually seems to welcome people working in it; It's not like I'm just crashing on one of their beanbags streaming netflix all day.\n\nThe cafe must be a bit of a loss leader for ING, what with it being so huge and in Union Square. Who knows how long it will be around, but take advantage of it while you can!", "author": "Linus W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "What a neat spot in downtown SF! It's a bank and a coffee shop with the vibe of a Bay Area startup! Step indoors and you'll notice the open space, colorful interior, and the busy but quick moving line at Peet's coffee. \n\nGet your Capital one banking done on the main floor, grab a seat on one of the red couches downstairs, or opt for a table upstairs to get some work done. Free wifi + 50% off at Pete's Coffee with your Capital One card. It's definitely on my list of go-to cafe spots in the area!", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "91 cents for a cup of ice tea. What's not to like?! You get some drink bargains with the 50% off w/ Capital One card deal. Good strategy on Capital One's part to get people to sign up for accounts. \n\nBut I'll tell you what's not to like (for real)- during weekday afternoons this place is packed and it's hard to find seating. My friend and I had a hard time finding 2 spots by each other.\n\nLots of people come here and don't even get drinks- just use that free wifi, homie. Decor is sterile- very bank-like. Even though I prefer more intimate coffee shops, this is a place to actually work and get stuff done. With their 50% deal, I'll be sure to come back.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "I deducted 1 star because the blended freddo really isn't good - don't get that, just grab a tea or something. \n\nApart from that, I love this space! 3 floors of seating with a relatively open layout, free wifi, non-pestering staff and walls of windows? Awesome! This space is just the right amount of loud to keep you focused on your work but not feel like you're in a library or small cafe, akin to a coworking space. There are also plenty of outlets, which I'm thankful for.", "author": "Morgen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "I am so grateful for this place! I need a spot to work outside of my house once a week, and Capital One 360 Café is the best I've found. I feel uncomfortable squatting for long periods at many smaller cafes, where the manager is (rightfully) hoping to turn tables--there is only so much coffee I can drink. But this café is inviting for people who need to get serious work done for several hours; it's huge, welcoming, and I don't feel like I'm taking up too much space.\n\nThings I like:\n- Three levels of seating, and it's all attractive, airy, and open. There are couches, tables for groups, high tops, little nooks, and places to sprawl. \n- Outlets EVERYWHERE.\n- Free WiFi\n- Clean bathrooms\n- Reasonably priced coffee, treats, and salads--even a vegan one!\n- Friendly employees\n- Top 40 Music. Taylor Swift, \"Temperature\" by Sean Paul--yes, yes, bring it on! I'm tired of the hipster music on rotation at every other café.\n\nOne thing I'm very curious about is the P&L for this venture. They surely can't be raking in enough money from the food and new Capital One accounts to justify the crazy-expensive real estate costs?!\n\nI hope to see more spaces designed for people who need a good spot to work. I have tried Workshop Café, purpose-built for that scenario, but like Capital One Café even better.", "author": "Elinor A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Free wifi, banking without the fuss and half off coffee! Not sure what else you could possibly ask for. Modern banking that allows you to do transactions much more efficiently than traditional branches. Open, bright interior with free wifi and lots of seating makes it an ideal work space!", "author": "Mary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-02", "description": "Disclaimer: I've been an ING customer for a long time. So I like this online bank. In case u didn't know they have the best interest rates for savings and checking accounts, and free ATM access. Not sure if anything will change now that Capital One acquired them this year.\n\nNormally everything is handled online, no branches, no tellers. But just like Apple has their own stores, ING decided that having a physical presence would help connect with the community. This new bank-cafe-internet hybrid is one of only 8 locations in the country. http://s3-media2.ak.yelpcdn.com/bphoto/WMeAZw2JYfBfoo2BbBPy5w/l.jpg The iPads serve as self service teller machines.\n\nThe food counter inside sells Peet's coffee, soups, pre-packaged sandwiches (made by Eat Curbside truck) and some vegan pastries. http://s3-media2.ak.yelpcdn.com/bphoto/9jVIkguXowh_03JxoEVDYg/l.jpg\n\nThe 1st and 2nd floors space is filled with tables and comfy seats, http://s3-media1.ak.yelpcdn.com/bphoto/YY85aA4JAipG5zyEw56iWQ/l.jpg with FREE wifii, similar to a Starbucks. And downstairs has FREE meeting space with AV equipment that u can reserve for groups of up to 40-50 people. http://s3-media2.ak.yelpcdn.com/bphoto/X069PTd6js-oW1aLPhkvZw/l.jpg\n\n** Update: In 2013, name was revised to Capital One 360 Cafe.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "They have outlets, wifi, and relatively clean bathrooms. I've worked in the space for up to 5 hours and no one blinked. \n\nLove that they serve something other than Starbucks. You can also bring in your own food and they don't hassle you.\n\nThe security guards can be real jerks to teens and anyone looking homeless...which emotionally makes me happy so that my new work utopia remains in good shape but morally I'm a little conflicted.\n\n5 stars!!", "author": "Mechelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Regarding their banking customer service, each of my visits here the staff went above and beyond the industry standards and my expectations to achieve my objectives, which, in some instances, I honestly didn't think were possible. Furthermore, every encounter I've had here, regardless of my situation (i.e. showing up right at the last-minute before closing needing to make a quick ATM cash deposit), I have had the best possible (sometimes impossible) outcome that was entirely dependent upon the courtesy, discretion and diligence of the Capital One 360 staff.\n\nWhile seemingly redundant to mention the several amenities here (see other reviews), it'd also dilute the my rest of my perhaps understated review, especially when I consider my customer service experiences at other banking institutions. Succinctly put,- the staff here are SOLID...and although I've worked with many different staff members here on various occasions, all of whom I'd recommend, Jane is my favorite as she is the enchantress who magically precipitated my presumably impossible desideratum.\n\nThat said, I hope you, the reader, will have as delightful and satisfying experience here as I've had and am confident will continue to have. (fingers-crossed anyway)", "author": "Jason K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "So. Yes. Love this spot. \nIt's a bank and a cafe. You don't have to be the customer of the bank in order to hang out here. But then, being a customer is not a bad deal because with the card, you can get 50% off drinks at the cafe. \n\nMy favorite spot to work, doodling, hang out, or daydreaming. \n\nI would say I prefer this spot than Workshop Cafe just because you can hang around here without having to pay $2/hour. However, if you want a more dedicated internet connection, you may want to go to Workshop Cafe instead. Otherwise, this spot is perfect!", "author": "Haryati S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Great  for the professional on the go. \nNice space to work in groups or on your own at your laptop. Also great if you are a Capital One customer you get a discount an all Peet's Coffee.", "author": "Celestina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Great central location! Coffee isn't that strong, but customer service is superb", "author": "Olatayo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "I discovered this place because of weekly Toastmasters meetings that are held in the conference rooms downstairs. This cafe has a great vibe with plenty of seating and electrical outlets on all three floors. They even have a Peet's! Everyone who works for Capital One and approaches all the Peet's customers is super friendly, whether or not you are interested in opening up an account. Sometimes they will get you free drinks and trinkets from Peet's. It's a very warm and welcoming environment. \n\nThe whole space, including the conference rooms, is clean and comfortable. Oh and I almost forgot about the fast and free WiFi. Great place to spend a productive afternoon!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-09", "description": "Is your new year's resolution to spend less money? Is it to have more energy to work more productively or be friendlier with officemates? THIS PLACE WILL MAKE IT HAPPEN.\n\nThe drinks are already cheap. $1.50 for coffee, iced or hot. $2 americanos, iced or hot. $3 lattes. They brew Peet's, which ain't the fanciest or most hipster, but it's local and it isn't that terribly bitter stuff from Starbucks.\n\n*Infomercial voice*\n\nHere's where it gets better - if you open an account with them, you get HALF OFF all drinks! Catch them during a cool promo, and the deal gets even sweeter! I opened an account around Labor Day and got $150 FOR FREE just by using my debit card three times. (I obviously used it for half off espresso drinks at this cafe.) At $1 for an iced americano and $150 just for opening this account, I basically get 150 americanos FOR FREE. \n\n*Even more enthusiastic infomercial voice*\n\nBUT WAIT THAT'S NOT ALL! \n\nFollow them on twitter for weekly giveaways! They have Trivia Thursdays and if you know the answer your drink is on them! Or sometimes you'll just have to engage with them for a free drink, like telling them your new year's resolution, or bringing in a canned food for charity. Sometimes they'll even give out free lunch! You just have to know when to go. On the first Wednesday of every month, a nice man from b street waffles gives out fresh, warm, liege waffles FOR FREE! \n\nBut hurry, this offer won't last long. Try them today! (Just kidding.)", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Once you get past all the weird juxtapositions of this space, the marriage of bank and working cafe is actually kind of genius. \n\nStarting up a company and don't want to rent out space with WeWork or pay for time at The Workshop? You could totally mooch off the free (albeit sluggish) wifi and take a few meetings in the conference rooms downstairs. After you've decided that you need capital to help that business scale, you could walk two steps to any Capital One rep; they've been standing there all day and are eager for attention! \n\nStudying for an upcoming exam? The caffeine (Peet's) does its job and there are plenty of semi-private nooks if you don't want to hobnob with the aforementioned entrepreneurs. There are even beanbag chairs that evoke the feel of a dorm lounge/common room.\n\nNeed a neutral place to have a work meeting, but can't stand the office? I've had plenty of conversations over coffee at a two-top. Better yet, this place is super accessible via public transportation, so there's really no excuse for not being able to rendezvous here. The greyish carpet is of a generic corporate weave and makes everybody feel like they're still on the office treadmill.\n\nSomewhat soulless? Yes. But also practical, productive, and perfect. San Francisco, meet your new favorite corporate Stepford cafe.", "author": "Sherry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Completely stumbled upon this place one day. So random! I was so confused. Was it a bank? was it a cafe? I could not tell for the life of me! After a few minutes of digesting the situation, and what it was, it turned out it was one of the best coffee shops/cafes that I've come across ever! The prices were such a steal!!! $2 for a LARGE cup of coffee. Even if it was a LATTE. What! it was only $2 for pastries too, ANY KIND. \n\nThere were so many work spaces available: tables, chairs and outlets! Wow! I hope this place stays and more spring up throughout the city an d in other areas.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "OK, I know that there is a disappearing line between phones, television, and computers.\n\nBut 360 Café is a coffee shop/bank.  \n\nThe prices are very easy on your wallet.  Coffee is free with a Yelp check in. The coffee and service are very good. (Don't miss the shortbread.  About 30 minutes after I bought it, the barista announced that all pastry is half-price after 5:00 pm.)   Wifi is fast.\n\nThis \"coffee shop\" is three floors of free work space, talking space, meeting rooms, and places to hang out.\n\nAnd -- I am not making this up -- the barista can tell you all about banking services.  I'm still scratching my head but I liked it.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "It's actually a front for an online bank - but you can come in and have coffee (good coffee!!) too.  I came in for the coffee and opened a savings account for free coffee and higher interest on my savings than my credit union.  That was a year ago.  I thought it was \"just another bank\".  Since then, I've moved  my bill pay, direct deposits and checking.  They have competitive interest rates for savings and checking - and they have amazing customer service and the best online banking website that I have found!  I could not believe the phone experience when I called for help setting up a link to another bank.  The person on the line was intelligent, alert, cheerful and very helpful.  She sounded like those headhunters on the phone - you know, friendly, making that personal connection and drilling for information - only the Capital One help was only interested in helping me.  As she said when she answered the call: \"How can I help you to save money?\"  I love this bank.  I love their best ever website.  I love my Capital One credit card.  I love the Capital One 360 Cafe with the good coffee, fast and free WiFi.  I love all the friendly Capital One people scooting about to make sure I'm happy - especially the one who went in the back room to find a connector so I could charge my phone.\n\nOh... stock ticker: COF  http://www.nasdaq.com/symbol/cof/interactive-chart?timeframe=1y", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "I love this cafe.  Since I've started working my new job, M-F, I'm pretty much somewhere in the city with free wifi.  Mainly here, few selected starbucks, and a restaurant or two (girl gotta eat something sustainable sometime + i would feel embarrassed going here M-F hogging the outlets). \n\nBathrooms on the basement floor (which has a cool set up, colorful and fun if you just want to potato couch out).  1st/2nd floor = plenty of sittings and tons of outlets. \n\nI bank with capital one 360 because I was swept in, but little has changed.  Which is awesome. I mean, I have the account because I don't want to think about my savings.  Just put the money in, set it and forget it.  I don't want to have easy access so I've yet to use or even look at the ATMs here.  \n\nAlso TV ads that intro the baristas is a nice touch.", "author": "Whitne Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "The 4.5-5 star average for this location lives up to its rating! Not only because of the welcoming ambiance, but more importantly, the way they treat their guests with superior customer service.\n\nHaving a Capital One 360 account can be a struggle sometimes, especially when depositing checks or withdrawing cash. I had to come to this location to deposit a check that was over the mobile deposit limit, and so it was my first time here.\n\nI was greeted by Mason, who showed to have exemplary service while at the same time seeming like he loves and enjoys his job! He is the definition of outstanding customer service, and Capital One truly is lucky to have him as an employee of 5 years now.\n\nI needed help getting through into my account and he made the whole proccess quick, easy, and engaging! I felt compelled to leave a review because he gave me world class service with a smile!", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-10", "description": "From time to time I get .75 coffee here because I have a capital 360 card (and I suppose I can use the check in deal too), and sometimes even free coffee when they post on their twitter account. However, their coffee, although in a bigger cup than a Starbucks tall, is sour to me. the cafe is out of the way on my walk from BART to work, so I don't really stop by, especially since I don't find the coffee worth it.\n\nFollow them on twitter, though. From time to time they give out free food such as waffles for breakfast and food truck food at lunch.  (To those who already follow them, sorry to divulge the secret) :X", "author": "Annie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "A cafe that doubles as a place where you can do your capital one banking. \nThis cafe is encapsulated with large windows so there's lots of natural light and also you can people watch!\n\nAside from the main floor where there's high tables where you can sit at or even work on it as a standing desk, there's also a floor downstairs with more chairs and tables + bean bags! If those floors are full, they also have an upstairs that has lots of tables and outlets\n\nThe Wi-Fi can be a little slow in busy hours and it might take awhile to connect to (minor gripe).\n\nEveryone working here is always courteous and friendly to greet you. Sometimes they have deals for free coffee and such! \n\nOther than that, you have your usual Peet's coffee and tea selections, great place to work during the day. They do close at 6 tho!", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "This is my go-to meeting spot in SF. It's really close to BART, it has a beautifully modern design, and there's a ton of open space.\n\nThere are three floors, each with plenty of tables and couches. If I'm ever in the area and I need a place to sit down and get some work down, I'll definitely make a stop here. They have free wifi and Peet's coffee, perfect for spending an entire afternoon here.", "author": "Richie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "Nice place to have a cup of coffee and have client discussion or a chat with friends \n\nTHese guys even have plenty of place to have presentations and seating arrangements(chair and bean bags).\nThe staff are friends and ready to help you in each and every possible way.I am using this service quite sometime \nand very happy with these guys service.", "author": "Raja Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "What an amazing and completely unexpected cafe in the Financial District! \n\nI came here for the first time recently for a business meeting, and the setting couldn't have been better. Large, bright, clean, modern space with lots of tables spread out over 3 floors. There are plenty of places to work or sit and chat, and the free wifi worked great.\n\nI got a large cup of really great tasting coffee for a mere $1.50, and a cup of vegan carrot-tomato soup for only $2. The soup was absolutely delicious, and I was super impressed with the employees knowledge of their products and attention to detail. \n\nA variety of milks were readily available at the fixins station - didn't even have to ask for soy! \n\nYou're obviously doing something right, Capital One. Share the love with the Peninsula and set up shop in  Palo Alto or Mountain View! I promise I'll be your most loyal patron. Pretty please?", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "The good: spacious, free wi-fi, different set-ups (tables, benches, chairs, bean bags, high stools etc.)\n\nThe bad: crowded, Peet's coffee, people who set up their entire laptop, mouse, monitor, keyboard, notepad, charging station, plate of food, drink and bags to take up space.\n\nAt least they don't have a Starbucks, but please get some better coffee i.e. Stumptown!", "author": "E E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "It's a great atmosphere for getting work done, and there are a bunch of tables spread out throughout the 3 floors, so I can talk to my friends without feeling like I'm being disruptive to anyone next to me.\n\nMost importantly, there's a mystical power in this place that gets me to be productive. That's worth all the stars.", "author": "Teresa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Oh god I love this place. I wish this place is open on weekends too.\n\nPro:\n- Plenty of space\n- Shitload of outlets\n- Relatively stable wifi\n- Convenient location\n- Friendly staff\n- Clean restroom\n\nCon:\n- Closes early, and open only during weekdays", "author": "Sun K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "I wanted to take the time to write an update since Gabriel from this branch took the time to personally reply to my review and put her team on the task of figuring out what was going on with my car loan.\n\nWhile ultimately I did end up just paying my loan off early since HQ was so difficult to work with, the outreach Gabriel's team did helped me get things finalized more quickly, and the poor experience I had with HQ is not a reflection of her or her team.\n\nThanks for your help! It was greatly appreciated.", "author": "Sophie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "This is probably the best cafe to study at in the Financial District of San Francisco for these 10 reasons:\n\n1) Very spacious\n2) Clean (even the bathrooms)\n3) Cheap drinks\n4) Well-lit\n5) Relatively quiet\n6) Good for people watching\n7) Lots of plugs available on long tables\n8) 3 floors of places to study/work\n9) Conveniently located near lots of eateries (fidi and union square)\n10) Sometimes employees come around with a survey on an iPad and if completed you get a free drink ticket\n\nI doubt I'll ever open a Capital One account, but I very much appreciate their cafe establishment. However, maybe subconsciously I'll put on a suit advise someone to open an account with them.\n\nBottom line, ideal place to get some work done in a central area of a busy SF district. A BART station is close by so if you're from another part of the bay, you can make a nice study day in the city utilizing Capital One 360 Cafe.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-12", "description": "Love the open airy feel.  So many places and ways to relax.  Their coffee is good and fresh.  Very easy to get to.  What an awesome idea.", "author": "Jerrie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-19", "description": "Is it just me or does the internet take forever to connect to?! It took a good 5 minutes to get on the login page. Now it just took another 2 minutes to connect after I've entered the pw. This is my third attempt. First attempt, the log-in page would not show up (I use a Macbook), so I had to go in settings to \"forget\" this network, then I finally got to the page to enter in the pw. Connected and worked fine for 15 minutes but now it disconnected again.\n\nI just used my phone tethering for the last 30 mins because it was so unstable (you can tell too because the music in the cafe pauses and then starts again, as if it's buffering on a weak connection). Finally connected back to the internet now.\n\nB street waffles ($3) is really good. Their americano ($2) is not bad. The music is too loud for me, it's really hard to concentrate especially when the music is choppy. Guys at the counter are nice though.", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "Amazing space! Big, airy, and clean. Hopefully it stays like this after more people know about this place. I think it would be better if they have more seatings in the 1st floor. Seems that there are a lot of wasted space.\n\nI didn't check out the 2nd floor, but it looks super comfy with a ton of bean bags to sit on.\n\nTheir sandwiches/salads are from Eat curbside. The sandwich was just ok because it's cold, but I'll try their salad next time...", "author": "Novalina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-05", "description": "I wish I knew about this place sooner. \nLotta outlets, lotta space, lotta wi-fi. \nFeels more like working at a startup then a cafe. \nBest part is Waffle Wednesdays when B. Street Waffles give out freshly made liege waffles.", "author": "Augusto M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "Buy a drink and settle in! They offer free coworking space with free wifi! There's lots of different seating options from tall counters, to traditional table and chairs, to the modern giant steps with big cushions to lounge. There's ample outlets too.\n\nThe staff are incredibly friendly and make you feel very welcome! The drinks are very reasonably priced, and dare I say, downright cheap even? \n\nI really enjoyed working here with my coworkers one afternoon. The space is very large and there's three floors. It's well lit and has a very inviting atmosphere.\n\nWe were there on a Friday evening until closing, and they even offered some of the prepared food to customers to take home for free as they were leaving! This really left a lasting impression with me! This really goes above and beyond in customer service. \n\nAlso, every first Wednesday of the month, enjoy a free b.street Waffle at the cafe! It's offered in the morning. They offer a new unique flavor every month like Maple Bacon! \n\nI will definitely be back.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "Great place to get some work done or just get out of the sun and give your feet a break from walking. It seems like just a bank from the outside but actually has a Peet's coffee inside with plenty of couches and tables to sit at. FREE wifi is always a plus and they were giving away free Chapstick and sunscreen as well. Not too shabby.", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Slightly odd place for this review - which is really for the 360 Checking account. This was GREAT for me traveling on ATM fees and when I had some major, major, drama... they fixed it FAST. Thanks. Want to show appreciation somewhere so might as well be here.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "a star for the throwback and playing old school backstreet boys!\na star for being one of the only cap one atms around sf\na star for 50% off peets coffee and drinks when using a capone debt or cc card\na star for the spacious layout/ lounges/ and free wifi\nand another for being an awesome bank! \n\nwish they had more atms and branches around sf but hopefully that will be soon", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "This place is awesome. Very spacious, lots of outlets, places to lounge, lay out, munch and drink or work on a laptop.\n\nThe bathroom stalls are very roomy and well maintained. I'm kind of surprised, pleasantly. This is a good spot to catch up on work emails or plan out your San Francisco trip!", "author": "Maya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "This is basically a coffee shop + co-working space + bank all rolled up into one awesomely convenient package. The friendly baristas will take your order and make you tea or coffee, as baristas typically do. But they are also legit bankers that will help you with whatever questions you have with your Capital One 360 checking or savings accounts. Kind of confusing and mind-blowing at the same time. Plus, they give you their already cheap drinks for half off if you use their card to purchase. As if the discounts weren't enough, the barista banker guy still gave me a bunch of free drink cards during one of my first visits that I still continue to use now. SCORE. \n\nThere are three stories with plenty of comfortable and diverse seating that range from shared work tables to private meeting rooms to bean bag chairs. The atmosphere is really conducive to productivity as everybody here looks fairly professional(ish) and acts like they are all working on something extremely important, which makes me want to also do the same. So here I am...working on this very important Yelp review.", "author": "Michaela T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "What can beat half price coffee when you use your 360 card?  An ice latte for $1.82! This place is very spacious and the people working here are very friendly.  They have a lot of places - tables, couches and bean bag chairs to sit back and relax or get some work done with their free wifi.\nThey went through a remodel about two weeks ago and changed from just serving Peets coffee to actually having Peets baristas making the coffee.  They're still working something's out as I think many of the baristas are new, so give them a few weeks if you are in a rush for your caffeine fix.  I also did prefer the food offered before the change - more variety of food choices and more reasonable prices, rather than the Peets food.  I often just pick up some food from somewhere else before.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Great online bank offering ATMs with awesome LIVE customer service, specifically Pat. Come see him if your need help! Plus discounted Peet's... so happy.", "author": "YK P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "Spacious, with a hip and lively feel\nIt's a cafe, but more than that, here's the deal\nThey're owned by Capital One\nSo in terms of marketing..actually, there's not a ton\nBut they do have some people trying to engage but at least they don't call you \"hon\". \n\nI like the cafe. The coffee is eh, the salad was actually decent and the fact that they have so much space is great.  I really like the vibe as it's different but you can get work done here.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Large comfy sitting area ranging from large tables to isolated bean bags. Clean bathrooms and a great cup of joe. Spread over three floors,  great spot to meet or just kill time. I would recommend this spot instead of the other hundreds of coffee shops around the area.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "Coffee +free wifi+ power outlets+ Bank + comfy seats+ plenty of cozy space+ restroom. What else is there to say?Perfect place for me while waiting for the wife at the french consulate.", "author": "Gerick Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Great innovative benefit for those of us who have a Capital One account. Best little secret!", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Essentially repeating the words of some of my peers that have already reviewed, but the Capital One 360 Cafe is definitely a great spot to go to recharge on some coffee and snacks (and recharge your laptops and phones too), check out some e-mails, and even have a nice meeting with some people. Located on a very convenient area as well, it becomes a great pit stop for any shopping day!\n\nIt's definitely an interesting concept that a bank is also hosting a cafe, and also includes a nice incentive to own one of their products. If you check out at the register with a capital one card, your entire order is 50% off! Stop by whenever you get a chance, it's at least worth a drink and a nice break!", "author": "Andy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-18", "description": "This place is awesome if you want to spend a day computing. When I first moved to the city I was staying in a hostel while I looked for a place to live. I came here everyday and used it as my base of operations for apartment hunting.\n\nThis place is huge! Three floors all together. There's lots of space, lots of seating, lots of plugs, etc. It's a great space. Plus, on the top floor there is a corner just covered in these giant bean bags. It's my favorite nook. Come in, take my boots off, spread out and such; yeah it's as comfy as it gets for coffee shops.\n\nThe staff is nice too; not your typical pretentious too cool for school types you normally get from many coffee shops. Though heads up, when you order they may encourage you to open an ING account~shocking! In fact the staff is so easy going here that they don't get upset if you come everyday, all day, use their internet, bring your own food, not buy anything, etc. They do a wonderful job of being welcoming and harboring a good working environment. Lots of people use this as a free office.\n\nI haven't done a connection speed test there, but it's certainly faster than most coffee shops in the city (where less than 1Mb/s up and down is all too common). WiFi needs a password so just ask someone at the counter.\n\nDrinks are cheap too.", "author": "Vivian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "This is definitely the place where you want to go to study or work for a while. It's quiet, clean and big place to stay.", "author": "Lana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "The coffee is so cheap and awesome. Not to mention, there's tons of workspace and outlets so you don't have to worry about being cramped! If you wanted to, you could even hog a entire table to yourself. No big deal. (But don't, that's rude.)\n\nRandom little warning though, the basement is sort of stuffy. The air down there feels super gross and muggy.", "author": "Joey Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "the BEST place to get work done in the city that's not a library!  kind of reminds me of the google office.\n\nthere are a lot of tables / outlets, and everyone is doing work.  unlike most places in san francisco, ing direct cafe has high ceilings and lots of space!  it's relatively quiet compared to other cafes simply because it's not the kind of place where people come to chat with their friends.\n\ning direct cafe serves peets coffee, which isn't exactly blue bottle, but at least it gets the job done.  coffee is pretty cheap, and i think you get a discount if you have a ing direct card or something, but now that capital one has acquired ing, i'm not sure how it works!\n\nsince the baristas are pretty well versed in banking, it's a good place to get some light advice.  the only downside to this is that answering questions = holding up the line.  i waited longer in line when ordering my latte, than waiting for the latte itself.\n\nyou can reserve space online BTW!  so if you have a project to get done and don't have access to a room at work, it's perf.  \n\ni only wish that it was open on weekends, or past 6 pm.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "This is such a weird bank/cafe/marketing ploy, but when I worked in FiDi I found myself here quite often so I guess it's effective. There is a lot of cushy seating room which is good for casual business meetups. Again, the setup confuses me, as my encounter with a super friendly cashier further muddied the question of whether the baristas work for the bank, or the cafe: As I hand over a simple cup of OJ to pay, he says, \"Orange juice for $2. That's a great price. Well that's what we do here--save money!\" with a flashy smile. Nice dude, but it's amusing how the whole place seems to be caught in an eternal identity crisis. You may go in for a latte, but come out with a new bank account?", "author": "Amy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "The cafe is okay, their offerings aren't any different than Starbucks. Free wifi is great, but very slow which defeats the purpose of working on your laptop and paying to drink coffee and eat pastries. I can do that at Starbucks w/faster wifi.", "author": "M J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Pat was incredibly helpful! I've been a customer for 3 years through their online portal and it was my first time coming here. I have to say that my experience was super seamless--and he even hooked it up with free peets coffee! Thank you for disrupting the brick and mortar banking space :)", "author": "Nicu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "We all know that moving to a new city is not the easiest thing. You barely know your way around, you have to move all your stuff to a new place and you have no idea which are the cool spots in the city to unwind.\n\nWell let me tell you, finding this cafe made my move SO MUCH BETTER! (not trying to be cheesy, but it was great!)\n\nWalking in I immediately felt the energetic young office vibe - just what I need as a recent college graduate seeking to relocate! Then walking up to the counter and realizing the coffee is not overpriced... neither is the food... and it actually tastes great?! At that point you have to stop and think - is it too good to be true?\n\nFinally, the last requirements: \n- Plugs? So many and everywhere\n- Tables? Always space available even though it's crowded\n- Wifi? FAST!!!\n\nI'm sold. Welcome to my new \"home\" office.", "author": "Anna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "I'm moving away from the Bay this weekend, so I feel the need to write a farewell ode to ING Direct Cafe.\n\nI went back for a nostalgia visit this past week and I got exactly what I was looking for. The smells and sounds brought me back to the furious summer days of bar study, where this cafe saved me from insanity.\n\nLattes are still spot-on good.  Even the GF found it palatable (and she usually doesn't like coffee).\n\nI'll miss you. Stay awesome!\n\nGreat bank, too ;)", "author": "Eddy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "It's an interesting combination of a bank and coffee shop. You can also use their free WiFi to work, they have plenty of seating and tables with outlets to charge your laptop. I have not tried their coffee, but I would not try the new javivas they're too sugary to my taste buds.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "Wow this place is super friendly and a good concept . There is Peets coffee and credit cards go figure. Also checking accounts and more.", "author": "P C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "Hmmmm... what a curious spot!  I thought it was a giant bank but as I walked by, I saw there was a coffee bar.  The hubs needed an afternoon drip so in we went.  So...it is a bank and a coffee bar and a hang out spot.  I ended up talking to Steph who wears several hats.  Besides serving up great coffee, she is also a banker and heads up the social media for this location.  The space has a lot of room to spread out and work (the wifi might be free, I didn't check).  The coffee bar is cool and then there are iPads around with bankers who can help you set up and manage an ING account.  \nI liked the whole concept and Steph was great.  They obviuosly have a cool community thing going on in the company and I can appreciate that.", "author": "Cassie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "First of all, this place rocks!  I love the big open space, and how innovative ING bank is with a work-space-cafe like this.  Forget the $2.50 Peet's cup, and go here with your ING card for $0.75 cup and better working space.  Read on for details.  \n\nThis isn't really a legit cafe or coffee shop.  It's a bank.  What does this mean?  \n\nWhat makes it great (because it's a bank):\n- Awesome three-floored (including basement) working space, complete with conference rooms you can reserve and use for FREE.\n- Friendly and very professional staff.\n- Bargain Peet's coffee.  Great discounts if you use ING (details below)\n\nNot so great (because it's a bank):\n- Limited selection of food.\n- Food will be generic, since the 'kitchen' is also very limited to basic counter-top.\n- Not the same variety of coffee, latte, cappuccino, and all the embellishments that you may be used to.\n- No ma & pa intimate cafe feel.  It has a corporate feel.\n\nDetails on deals:\n- Ask barista about how to use conference rooms. It's free.\n- Brews Peet's. One medium size cup $1.50. Use your ING card and it's half.\n- Sign up for automatic transfers on site, and get 5 free drinks card - for any drinks.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-13", "description": "During our trip to San Francisco, my husband and I scoured the area near our hotel for some good coffee shops that was NOT a Starbucks chain (we wanted to try something different). Alas we came across this place. What an interesting idea: combining both coffee and a financial corporation into it's very own coffee shop! Offering current and potential clients a \"shot of savings\" in their latte and also proudly serving Peets coffee (which we learned has a strong presence in San Francisco), we knew we had to check this place out.\n\nThe coffee joint itself is very large with 2 stories and has sort of a lofty, urban, vibe to it. It holds plenty of tables and open workspaces (varying sizes for people flying solo or in large groups), and encourages their clients to have meetings in the shop or catch up on some e-mails during your breaks. The clientele ranges from suits to hipsters to dorky tourists (ahem) so I don't think anyone can really feel out of place in here.\n\nThe service was very quick and cashier was friendly. The barista was also quick - no artwork on the latte though - but made a good drink. I ordered a mocha which was very rich in chocolate with a hint of espresso. I thought it was quite delicious and for something categorized as a \"small\" it was pretty big in size - also a decent price.\n\nOverall, I had a good experience at this coffee shop. The service was quick and efficient and the product (review based solely on the mocha!) was very good. I would definitely pop in again for a coffee the next time I'm in town and recommend others visiting SF to do the same.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "Interesting concept... Cafe, working center, conference rooms... All under one roof.\nLove Peet's coffee", "author": "Sunny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "love this place, love the little beanie bags and staff are friendly. my to go to cafe to work and study.", "author": "Taryn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "This is an awesome cafe, not just for the coffee but also a comfortable place to rest and recharge while in the city. Any Capital One credit/debit card gets 50% off all coffee, which is a great deal. Staff are very friendly and there's plenty of place to sit, which is rare in the city.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "If you are a freelancer or a student like me, I don't think you can find anything better than this place it's like a treasure(not hidden). I have thanked my friend so many times who introduced me with Capital one cafe. Now I don't get to go there often, but there was a time when I used to work from this place four times in a week and if you are regular here, you start to feel like a family member as they celebrate different occasion n this place and you see familiar faces everyday and end up making friends. What can be a more delightful place to work in and guess what, its all free! They got peet's coffee, huge place, free wifi and plenty of charging ports. Although I mentioned free wifi, be ready to use your phones hotspot often as their wifi is very week usually. Not to forget, this place is located in the heart of Downtown!", "author": "Pratibha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-20", "description": "I'm incredibly dissapointed with my experience here. We came in for a quick snack and got lured into the $176 promotion if I signed up for a checking and savings account, and if my fiancé referred me he would get a $40 bonus. It was 5 when we walked in and we left at 6 pm (when they closed) and I was furious. Thinking this would be a quick sign up we said okay. Well, I was so very wrong.\n\nI started setting up my savings account, only to find out I had to call their number to verify I was who I said I am. Even though I was physically there, with my ID. What was supposed to be a quick phone call turned into waiting on hold for 20 minutes to speak with someone. Fine, they verified my account and now it was time to set up my checking account. Well, even though I just went through the verification process on the savings account I had to do the exact same thing for the checking account, even though we were linking them. Another 20 minutes but this time the lady working there called, which led me to believe she might have been able to get through to someone sooner but nope, she just called the same number and waited. \n\nI had been talking to this lady and mentioned I just moved down from Canada. When she was telling me about the checking account she said I could have the overdraft option and I requested not to have it. If she had been paying attention, or knew how it worked she would have realized I needed a credit score in the states to qualify for the checking account. When they verified my account and tried to set it up I got rejected for no credit score. I've never needed a credit check for a basic checking account before, and my fiancé says it's for the overdraft protection which I stated I did not want and she let me know it was optional. \n\nAfter that she just kind of brushed us off and it was time to close up, so I left. My savings account was opened and the $76 was in there but we realized she never put my fiancé's account number in so he didn't get a referral bonus. Then the withdrawal from my main banking account (you needed to connect it to capital one and have $500 in your new savings account to get the bonus) was rejected by my bank and that bonus was taken away from my Capitol one account without a chance to correct anything. \n\nSo overall an hour of my time was wasted, I left pissed off, the lady didn't do much or know much about how to help and I won't bother with Capitol one anymore.", "author": "Ayla W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "What a great place!  This is a multi-level cafe with lots of seating, electrical outlets, good natural lighting, free wifi, long wood tables, and good drinks.  And the prices are so cheap --  $2 for soup, $2 for a cafe au lait, $3 for a latte, $1.25 for a cookie.  And no surcharge for substituting soy milk.  My friends also told me that this cafe often does deals and free food events.  For example I didn't have to pay for my drink because I checked in on Yelp.\n\nI don't know what kind of deal this cafe has with Capital One (no rent? subsidies?) but I wish all banks did this.  Awesome.", "author": "C. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "Pros: Super friendly staff and huge space - even though there are so many people there, you can always find a spot for you since there are 3 floors!\n\nCons: It's closed during the weekends and the coffee is not the absolute best - although it's good enough for you to stay the whole day working there!", "author": "Mariana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "I love working from Capital One 360 Cafe for the following reasons:\n1.  Great sitting & standing options. You can sit, you can stand, you can sit on a bean bag or in a little cove..there are plenty of options depending on your favorite work style.\n2.  Good background music selection.  At least when I've been there I've enjoyed the music selection!\n3.  The location is convenient, downtown.\n4.  The staff is friendly.\n5.  They have several choices for coffee/tea drinks & aren't rigid about bringing in food from the surrounding area to enjoy with your beverage.\n6.  The wifi is strong & reliable.\n\nI'll definitely keep stopping by here to work as long as they keep this up!", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Peet's coffee and three levels of great work space make for a 5 star study spot.  Add in half price coffee when you use your Capital One card and this cafe is unbeatable!", "author": "Quin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Cool HUGE cafe! Three stories of space for you to lounge/work. Free wifi (no password required). My favorite place has got to be on the first level (go down the stairs after walking in the main entrance). They have a bunch of large bean bags or \"fat boys\" for you to lay around on to your heart's desire. :)", "author": "Ava S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "What a great find! Packed at lunch (subsidized food and drinks) and plenty of spaces to work in a comfortable, fun environment. Impressed by this move Capital One, would definitely consider opening an account with you guys.\n\nAppreciate the freebies as a newbie in SF. Another plus, conference rooms and clean bathrooms downstairs! \n\nNeed I say more?", "author": "Grace C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-12", "description": "The cafe is nice. Wifi is great, nice environment, music is too loud so I don't stay long. \n\nBut... Capital One needs to pay more attention to basic bank services than the coffee and the wifi. It does not function as a bank, at least, not on the day I visited. Spark and this cafe need a visit from a usability consultant. Being able to take deposits is one of the most basic things a bank is supposed to do, and having a resilient technology set-up to enable the basics is just as important. It freaks me out that bank systems are this tenuous. NOT reassuring.\n\nI am a Spark small business account customer. This cafe is all about supporting folks like us, right? I hoof it to this cafe, because it is my only means of depositing the first check my small business has received. Why? Because the Spark Business mobile app only supports i0S 8.0 or higher, and my phone only goes as high as 7.8. There is no mobile Web check deposit. I have to either buy a new phone, or hoof it. Since I like my $30/month iPhone plan very much, and didn't retire in my 30s by wasting money on stupid stuff, I'm not buying a new phone. So I go to the cafe, since I have this accidental business now, because taxes. Fine. \n\nI find all ATMs down. And there is no other way to deposit my check. There is no associate who can take my check, no other technology on-site to use to do it. One associate takes pity on me and offers me an employee iPad (set any security concerns with that aside for the moment). At least she tries. But oh, too bad, my check -- which is not even $7k, probably not unheard of for a month or so of work in San Francisco -- is too large to deposit, so I cannot use the employee iPad. \n\nSo I sit, and wait for the ATM repair to come, and who knows when that will actually happen. Really folks? Really? \n\nI'm so close to canceling my account. Basic things have just been way too hard, even though the brand implies easy easy. Nope.", "author": "Zoe F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "I love this place. It's everything capitalism in America should be.\n\nYesterday, I went it and got my coffees comped because my friend and I had a fun chat with the barista- he just said, \"hey, this one's on the house, for fun\". I love that the employees are given the power to do that- I so love a surprise! Even it it hadn't been free, the prices are SUPER reasonable, and a total steal if you pay with a capital one credit card (50% off). \n\nSo, the business model is to delight people with cheerful employees, cheap prices, and freebies- and then slide in a few lines about either getting a capital one card or upgrading your account. I think it makes perfect sense- if you make me happy, of course you can do your pitch. And I've never been pestered about saying \"no\", which is totally impressive. My confidence in capital one is rising day by day, because of their excellent service and people standards. Good work, San Francisco.", "author": "Betsy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "A great place if you need to kill some time in the financial area of the City. The place comes equipped with a built in Peets, ATM machines, and free WIFI. The area lets in a lot of natural light with all its windows, and fancy overhead lighting. You actually have three floors of space to hang out, so there should not be any problems in finding a comfortable place to park your behind. There's comfortable tables, chairs, and cushy sofas. If you need to do some heavy concentration, I would recommend the upstairs. Apparently nobody wants to take the hike one floor for peace and quite.  As for Peets, what can I say but that the servers are fast and cordial in getting your orders so the line moves at a steady pace.", "author": "Kurt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "This cafe/\"get shit done\" spot is even better than I thought it was. \n\n+ THREE FLOORS of tables, chairs, stools, bean bags, couches...!\n+ Free WiFi\n+ 50% off your drinks if you use your Capital One 360 debit card\n\nJust an overall, awesome place to work/study/meet up folks downtown.", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "This place is a gem nestled in the heart of Union Square.  Stoked to find Capital One 360 Cafe.  Reasonably priced coffee, copious amounts of plugs, and environment conducive to productivity.  Great concept, Capital One!\n\nDefinitely will be back...just need to find a safer bike route home!", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Great space in the middle of the action (Union Square).  Three floors of tables, power outlets, and free wifi.  Peets coffee is served here.\n\nPlenty of couches, tables, and long tables in the space.  All are within reach of a power outlet or strip so you can camp out and work for hours if needed.  But it is in downtown SF so you still need to get here early or you might have to wait for a spot to open up.  There is a lot of traffic so if you are looking for a nice quiet coffee spot this may not be it for you.  No problems with the wifi during my few hours here.\n\nCapital One card holders get a discount on purchases and a ATM is inside to do some quick banking (if needed).", "author": "Roy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "Always friendly baristas, plenty of places to sit and recharge devices. Always plan a stop here when I'm in San Francisco and need to recharge both myself and my gadgets. Bathrooms are downstairs and absolutely spotless. Conference room available on lower level. Convenient central location near Market St. In the heart of the Financial District. \n\nDelicious Americano for $2, too!", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "I went to get some help for a new credit card. I met Bud, he is a banker and is just so personable and knowledgeable and helped me a lot. I highly recommend him for all your questions about checking, savings, or credit card help! He's very trusting and great guy!", "author": "Kris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "I feel a little silly writing a 5 star review for a cafe sponsored by a credit card company but here goes nothing!\n\nFrom the moment you walk in, the 360 cafe is bright, clean, and welcoming. 3 floors of open and comfortable seating options, it seemed like there was a spot for everyone. Free wi-fi to boot makes this a dream WFC (work from cafe) spot. \n\nIf you head to the actual cafe portion, there are some food options you can order in addition to typical beverages (coffee, tea, hot choco, juice, etc.). The guy I ordered from was amazingly nice and by the end of our convo, I felt like we were practically friends.\n\nCapital One perks, your drink is half off if you purchase with your Capital One card. Nothing to hate about that. If Capital One wants to hook me up with a $1 hot choco that tastes like magic, party on credit card company, party on!", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "$2.50 for a large Pete's Coffee latte, need I say more?\n\nThis place is great. Aside from the half-price coffee for capital one customers the space is very nice. It's clean and wide open, with various types of seating including bean bags. You can imagine this place like a free, communal startup office with super cheap coffee.\n\nSometimes the Capital One employees will ask you for feedback on the company or something in the cafe. They are all super friendly and will even make an effort to remember your name if you go in often enough. The place definitely feels like it's primary goal is to increase goodwill toward CapOne and not to sign up new customers. I went into one of these before I was a member and they weren't pushy at all.\n\nThis is also a great spot for impromptu meetings of two or three people.\n\nFive stars. Now we just need more of these around the country.", "author": "Ian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-12", "description": "Staff at Peets Coffee was great except this place has the slowest wifi in the city. It takes 5 mins just for my web page to load. Definitely not coming back here to work.", "author": "Cindy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "A large cafe right in the middle of the Financial District. The lighting was great, it wasn't too crazy, and I enjoyed the myriad of seating options. Last but not least, there is a large Peet's offering up a variety of snacks and drinks. Overall - I'm a fan.", "author": "Andreas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "I'm almost tempted to give this a 5---how cool is it to have this total hang out cafe, without really buying anything, to recharge your laptop/phone, etc. PLUS use the washroom downstairs (clean too), right in the heart of DT?!\n\nEven saw a few ppl snooze on those bean bag-like chairs beneath the stairs...felt like a library at a university lol.  \n\nGood thing they have smoothies (bottled ones) too.\n\nKudos to Capital One, but they can afford it anyways with those high credit card interest rates...", "author": "Kenneth N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "'Whoa. '\n\nThat was my first word when I first stepped into this cafe. \nOn days where I have work in the morning and need to find a place to get some studying before class at night, I am SO glad I've found this place. It's not your typical 'starbucks' setting. The whole place is big, nicely lit with tons of space! The drinks are super affordable and apparently theyre half off if you have a checking account with capital one....which is very tempting. \n\nI also approve of their music playlist. \n\nAnyways I think I just found my perfect study spot in downtown. :)", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-12", "description": "The friend who told me about this three-story free power and wifi tower called it a coffice: coffee + office, and that that's a pretty good description. I'm unimpressed by cheap coffee and free lunches, but the diverse seating options visible from the street finally seduced me inside. In the hour I spent there, I reclined on bean bags and giant pillows, hung out at communal bar tables, and rearranged modular couches to suit myself. I found the art interesting enough to actually direct my seating choices, even enough to pull me from the cushion options to the standing counters. \n\nI did have to listen to a little speech about getting an account with Capital One, but the nice gal who delivered did so with no pressure and made me feel more welcome. One weird thing--when I paid for my drink, the barista just swiped my card. No pin. No signature. What's up with that? He didn't offer me a receipt either, and I didn't ask, so hypnotized by his super-friendly chitchat.\n\nCome to think of it, there was something vaguely cultish about the place. I'm talking about the friendliness, not the throw pillows. It's corporate cult, not hippie-California cult. It reminded me of the fabled employee lounges of the dot-com boom of the late '90s. The only thing missing was the ping pong table. \n\nWhen I made my security-and-receipt-free purchase, the barista did not offer me a wifi code. Since I changed seats so many times, it took my iPad and me a little while to figure out that I needed one. When I did realize it, I was very cozy in my perfectly arranged cuddly couch spot and really didn't want to get up and find a barista or a bank teller or whatever to help me with a code. Oh well, I was really there to write anyway.", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-30", "description": "This is my favorite chill spot when downtown/ FiDi.  What's not to like?  \n\n-  They serve Peet's Coffee CHEAPER than Peet's...$1.50 for what's comparable to a Medium...FRIENDLY service!\n\n-  The bankers/ baristas do not try to hard sell you at all but now that I am an ING customer, flashing my sexy ING card also means 50% OFF on all coffee drinks...HALLELUJAH for $1.50 lattes & mochas!\n\n-  There's tons of space to lounge...FREE wifi, tons of tables to do work, TV with the news on, couches to rest on...the place is huge so no one is fighting you for personal space!\n\n-  Only 1 star off because their pastry selection is a little lacking!  But with the new La Boulange just one block away...issue is insignificant!", "author": "Judy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-04", "description": "We ordered vanilla latte with almond milk, cafe au lait, caramel cinnamon latte and a matcha latte and they were all undrinkable.\nService was bad and orders got mixed up. I have never had such disappointing Peet's coffee.", "author": "Aishu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "Great place to work from! \n\nFree fast Wifi + Cheap (Peets) drinks + Lots of seating + Lots of outlets + Friendly staff\n\nBonus points:\nThey're pretty chill about letting you bring in food from outside \n\nOnly downer is that they close at 6pm :(", "author": "jenn t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Oh how I wish to work in the city again or just to be able to telecommute. This year, I volunteered for the 2014 Pistahan Parade and Expo and had their meet and greet at this location. This is a great space to work, have a impromptu meeting and also have a cafe that serves coffee and snacks.  I believe to my understanding, Capitol One 360 cafe offers their space after hours to non-profits to hold meetings which I thought I was pretty cool. I wouldn't mind visiting this place again if I'm ever in the city again.", "author": "Jocelyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "I go out of my way to come here every morning. Coffee shop, lounge, work space. I've used this place to change clothes for an interview.  The cafe is a full Peets coffee shop, and the coffee is half-price with a Capitalone card.", "author": "Neal W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Now that I've run my battery down from 100% to 20%, I'll leave a review.\n\nThis is a really nice place to sit down with a laptop and procrastinate. The atmosphere is like a cross between a cafe, a student union, and a hip modern startup office. Ample couches, cafe tables, and the lower level even has bean bag chairs!\n\nThe TV displaying a rotation of Capital One ads helps bolster the faceless white collar vibe. Literally only one hipster in the whole place! And he seems to be having a lunch meeting.\n\nThe only downside is their canned playlist of pop hits is really unconducive to productivity. Personally I find it hard to read and work when there's music playing that I know the words to. Literally every hit single of the past 50 years has played at least once. \n\nAll in all, I wish there were more cafes like this around the bay area!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "Fantastic place to work remotely. Incredibly cheerful staff. Lots of space, and strong, free internet. Props to Capital One, this is a fantastic concept. I work for a nonprofit and they have conference rooms nonprofits can reserve, and this is much appreciated.\n\nWaffle snacks are surprisingly good. Please add chais to the cafe menu!", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-16", "description": "Just got publicly shamed by someone behind the counter for taking a quarter out of the cup and putting a dollar tip in.  No good deed will go unpunished there so watch out!", "author": "Cassius D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "All the yelp reviews I read prior to my first visit made me expect the cafe to be a lot bigger than it turned out to be. There are plenty seating and outlets if you're looking to get down and serious on those 'things' you gotta get done electronically. \n\nThe espresso drinks are meh. The grab-to-go food looks kind of bland and shitty, to be honest, but this place wasn't made to serve gourmet food. It's a factory. It's where people go to produce great, wondrous ideas from their powerful human brains. \n\nSome innovate with fury, ferociously smacking their fingertips against their 21st century laptops and tablets. Some strike deals and have life-changing conversations yakking away on their savvy smartphones. Some watch and observe, chillaxin' in the midst of the hustle bustle.\n\nBeautiful. \n\nIt's a cafe nestled in the heart of the FiDi--\nAin't nothing like the rush of a city. \nGet inspired.", "author": "Colleen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "Spending a few hours here catching up on work is so pleasant it's easy to forget you're in the middle of the Financial District.  \n\nBig, bright communal spaces, coffee and tea, internet, and nice staff - this place had done a great job of creating a work friendly atmosphere.", "author": "Melanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Great place to come and complete some work! What made it even better is they were having happy hour when I was there (free drinks, any drink actually). I like how there's plugs everywhere and it's right in the heart of DTSF.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "This is my go-to place when I need to get some work done.  They have Peet's coffee and if you are a Capital One 360 account holder, you get 50% off beverages.  You will most likely find me here 2x a week.  Such a modern-tech looking cafe and very spacious.", "author": "Cynthia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "At first I wasn't sure what this was.  I saw \"Capital One\" and then I saw \"Cafe\".  I decided to try it out since I was wasting time.  \n\nThe barista/cashier filled me in where I was and I thought it was a pretty good idea. It had a very relaxing atmosphere, a ton of room to spread out and served as a great place to check email/read/study/chat.  \n\nThis is a great alternative to those big name coffee shops.  I recommend trying this \"hotspot\".", "author": "Nerick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "I came in to get a snack and sit down for a minute and ended up getting some very useful information about banking options (as in, Capital One has ATMs everywhere, they're just not branded like that--they're in a lot of places like 7-11s).  Anyway, it was nice because when I got the free banking advice, they gave me my drink and snack for free. How nice! :)", "author": "Cassidy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "If you're looking for a bright, cheerful coffee shop with wifi, this is the perfect spot. Always funny to grap a coffee in a bank branch!", "author": "Thibaut L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "This is long overdue-- \n\nI've enjoyed the 360 Cafe since their opening day! The entire team is AMAZING. Besides knowing banking inside and out, they are helpful, thoughtful and always have something friendly to say (genuinely). \n\nI have a special place in my heart for Samik Roy, who has helped me with my small business decisions and always given me his undivided attention and solid advice. Thank you Samik!\n\nIf you're looking for a place to grab a coffee, quick lunch, free WiFi, a spot to call your own while you work, a set of conference rooms at your disposal, local art (very cool art, I must say), a place to host an event and a supportive environment--this is THE place.\n\nI'm sure the big bank folks would love for me to mention the banking part--so...I am a Capital One card holder and I do my check/cash deposits and regularly talk with them about my accounts... However, I primarily go there for the people and the fun of it--they've created a unique community space where you can have it all - where business meets pleasure.", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "I actually bank with Capital One and have their debit card as they don't charge international ATM Fees. This cafe is spacious with 3 floors of work space right in the heart of union square and free wifi. If you pay with your capital one debit card you get 50% off coffee drinks. In celebration of the July 4th holiday, I got a free mango iced tea and yummy chocolate and cherry waffle. Not much more you can ask for a cafe! They serve Peets coffee here which is my least favorite coffee in the city but other than that I love this place!", "author": "Betty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-10", "description": "This place has free wifi, $2 coffee and lots of places to sit with plugs. The only downfalls could be the extremely mainstream radio music playing and the fact that you have to keep reconnecting to the wifi every so often.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Love the space, friendly staff and Peet's selection of pastry goodies and hot/cold drinks. It's my daily coffee spot. A few weeks back, I think one of their machines broke, so they gave out free drinks coupon for the delayed customers. Perfect example of great, responsive customer service.", "author": "cassy f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "DOPE CAFE. Lots of seating, outlets, and customer service is on point.  Came in on a Wednesday early afternoon & found a seat pretty quickly.  I was unable to check in with my phone & the cashier gave me my large iced tea on the house :D  I will definitely be back.  Perfect environment to GSD once you get in the zone.\n\nTried their salted caramel waffles - only downside - wish they were warm.  Alongside the pastries, they also had a variety of healthy pre-packed meals like kale salad and wraps.  Overall 5 stars (:", "author": "Alyssaaa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "The Capital One 360 cafe is built like a college workspace and I love it.\n\nThey have three floors of innovative, comfy seating areas, wickedly fast, FREE wi-fi, lots of spots to plug-in, hunker down, and get your work done...or just chat it up!  On any given weekday, I am sure you will meet some young go-getter, ready to pitch their start-up idea to you.  As for me, I just needed to a change of scenery from the old office.  I wound up spending the rest of my afternoon taking my meetings, answering emails, and working through my readings.\n\nThey have Peet's mango iced tea for $.75 for Capital One cardholders or $1.50 for non-cardholders.  Such a steal and a great way to fuel my day!\n\nThe fantastic and friendly staff will whip up a good drink as well as a decent sales pitch to open an account.  I did and even got a free mug. :)\n\nI am such a fan and will definitely be back whenever I need a workspace in FiDi.", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "A friend of mine took me here for the first time since it was right across the street from his office building, and I was completely blown away by how nice this place was. The architecture and design is amazing. Very modern decor with great lighting, free wifi, and lots of glass which made the place look very open. The entire place is very trendy and there are always a lot of young professionals who visit this place often.\n\nThere are three levels and there is seating and plugs everywhere. You see a lot of people working, hashing out deals, and generally coming up with great ideas. There is an area with really nice plushy seating if you really want to kick back and relax. \n\nI did not get a good look at their food menu, but the iced coffee I got was good and they gave me a pretty large cup of it considering the price I paid. I think they serve Peet's Coffee actually. \n\nGood place to come and get some work done (as all the current patrons seem to use this place as a second office). It might be a little difficult to find a place to sit down but if you hover around, a spot will usually open up relatively quickly.", "author": "Julie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "Big, spacious, clean, clean, clean. Seating isn't as plentiful as you would imagine, but location and space makes this place awesome!!", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Love your café. We would love to have you come to Napa. Napa has grown two fold just in the last five years with new hotels coming down town, it would be a great opportunity to expose Napa to Capital One!", "author": "Keely D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "Friendly staff. Prompt service. Good inexpensive coffee at 1.50.  Try the bStreet waffles. Free first Wed 9am.", "author": "Margaret W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "A great multi-level cafe, perfect for getting work done or meeting up with someone. My only critique is that they should serve warm food (i.e., bagels) and more perishable food, as I was a bit hungry when I went, but they only had a limited selection of perishable food.", "author": "Sofia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "Cheap Decent Coffee (Even Cheaper if you have a Capital One Debit Card)\n\n3 floors of seating areas.\n\nfree wifi.\n\n2 Conference Rooms on the bottom floor.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "I like to spend about an hour every morning before work working on side projects and taking care of personal business. I've tried other coffee shops in the area (I really liked the various Specialty's Coffees in the area), but nothing is as good as the Capital One 360 Cafe.\n\nThe space is really nice, the drinks are well-priced (and, bonus: they're 50% off if you have a Capital One 360 card), and the team at the counter is really friendly.\n\nAbout a year ago I was toying with closing my account at Capital One 360, just to simplify things, but this place is so fantastic, there's no way I'm closing my account now.", "author": "Charlie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-27", "description": "Pros: Great location, decent coffee, good atmosphere\n\nCons: The proxy for their wi-fi does not play nicely with Linux and I struggle each time I come. Booting OSX or Windows works fine, however their proxy service rarely works with Linux unless you do a lot of manual tweaking -- this for me is a deal breaker because I develop in Linux and can't do work here. Also use a VPN b/c their network isn't secure.", "author": "Vincent S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "I love this place. Free working space with great coffee. What more could you ask for!", "author": "Oscar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "This review is for about a year ago.  I received an e-mail invitation for a Roth IRA event.  Only having a standard 401(k) through work I was definitely interested!  I have two accounts through Capital One (one being through the former ING Sharebuilder) so I wanted to check it out.  \n\nThere were free appetizers that were actually really fancy!  You know, the kind where the person serving it to you tells you that you have to put the whole spoon in your mouth so you can enjoy all the explosions of flavor?  There were standard beverages and the food came throughout the presentation.  They even had raffles for electronics.  I think they gave away a few Kindle Fires.  The presenters answered questions from everyone in the crowd and it wasn't over crowded.  Something I was afraid would happen because of the \"Free Food\" announcement in the e-mail.  I actually learned a lot from the presentation and didn't feel any pressure to sign up for anything new.  If you ever get an invitation for one of these events I strongly suggest attending.  \n\nThe overall experience was great!  I've been wanting to go back just to enjoy the cafe amenities.  It's in a very convenient location in the Financial District  so stop by on your way home and grab a coffee or something small.  I hear the baristas are bankers, too!", "author": "Durty D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Genius marketing move. I've had CapitalOne cards for years, never thought one way or the other about the issuing vendor. This spacious, easy to use cafe changes that completely - I'll now choose CapitalOne cards whenever I have a choice.", "author": "Ceil T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Great place to work!  Much like a coworking space... only it is FREE!  Very good place to get things done. Great find. Many startups and entrepreneurs are here as they go between VC meetings. Interesting conversations.", "author": "Olin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "It's a cafe. No, a workplace. No, a bank!? It's all of these things, but my experience has been that it's a nice space no matter what you visit it for. I belong to a professional network, and we regularly host events in this space. \nThe drawback? No alcohol on the premises, but it's clean, spacious and we're always greeted by friendly staff. \nThe drinks aren't bad, either. I've dropped by for an ice tea on one of SF's more recent unseasonably warm afternoons, and it was refreshing as expected. Consider this your alternative to the stuffy, loud, crowded Starbucks that are splattered about the city.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-27", "description": "Get the mango iced tea :) it's refreshing and tastes great without sugar! I liked the cafe a tad more when it was called ING Direct. All the baristas here are very nice. Matt likes college ball, which makes for fun small talk.", "author": "Carina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "Really nice study place! I think this is my new escape spot when I don't want to be studying on campus/cafes near campus. There's just something motivating about a good work environment (LOTS OF OUTLETS+TABLES+SPACE), being in the fin district, and being surrounded by people talking business. \n\nThe guy @ the register was also very personable. Even gave me flavored syrup in my iced tea for free! :) It was also the weekend before cinco-de-mayo when I went, and they were giving out free virgin margaritas AKA slushies, which I thought was nice of them. \n\nVery close to an H&M and some other stores, and a walk away from the rest of Union Square ... which is a very nice treat after some serious studying heh. \n\nWill definitely be back again!", "author": "Ashley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-26", "description": "I don't know how they can do it - staff a full-service coffee bar with licensed financial services professionals, ready to help you open your online account.  It's brilliant, if it works!  A must for anyone seeking a FI-DI respite.\n\nThe \"Cafe\" is full of wi-fi connected literati, working away, meeting in corners, sippin' on caffeine.  The noise level is surprisingly low, but ear buds are still de rigueur. Despite this de-humanizing aspect, the vibe is good - focused and productive but amiable.\n\nStop in between meetings, catch up on email, fine-tune your presentation.  Then sign up for an online checking account.  This is the \"new bank\".", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "I love the friendliness of this cafe. When you walk into the door, people will greet you and smile. Also service is efficient too.\n\nTried the maple bacon waffle and its awesome. When you bite open the waffle, bits of bacon and sweetness of maple come out, pure enjoyment. Will definitely come back again!", "author": "Mau Kwong Marco C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-31", "description": "Agree with another reviewer - cool concept, really awesome space with great natural light, ample seating choices, nice furnishings, and a pleasant atmosphere.  But they are using some hokey wifi system that does not play nicely with Linux.  Since I, too, develop on Linux that is a deal-breaker if I want to do work at the cafe.  \n\nThree stars for now.  If they fix the wifi, five stars without reservation.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "Whenever I'm here, I feel like I might overhear a great tech idea or company being born. That's the way it is here--people who look like they're in the start up world working away, meeting other interesting folks, and hanging out in the conference rooms downstairs. \n\nWhether or not secret tech deals are being hashed out here, I'm just minding my own business on my laptop. While the food is not amazing, it's enough to get you by when you're working on a deadline. Coffee is relatively cheap, considering their location and the size of the cup, and even cheaper if you're a banking customer. The only slight gripe is that you have to re-enter the internet password every 45 minutes or so. But if I'm spending hours here, that's the least I can do.", "author": "Pauline S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Free wifi, plenty of seating, clean and spacious - and the coffee was free. What more could you want. Still trying to figure out where the actual banking was getting done in this establishment that all but looks like a cafe and not a bank branch!", "author": "Jason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "I've walked by the cafe so many times, but I never had a chance to stop in. I decided to make a pit stop for coffee one morning since I was curious what this place was. \n\nThis place used to be an ING cafe, but it changed to a Capital One cafe a few months back. There's a little cafe in the corner on the first floor with pastries, breakfast sandwiches, sandwiches boxed up to-go, a variety of bottled drinks, and of course coffee -- Peet's coffee! I got a latte for about $3.50. \n\nThe space is pretty big and there's an upstairs and downstairs. I didn't venture up or down, but there's free wifi in here along with tables and chairs. If I could, I would definitely grab my laptop and do work from here instead of at the office...must be nice to be able to work in a different atmosphere. I know that communal workspaces are more common in the LA area, but it's nice to see that Capital One has done this with their cafe here in SF!\n\n+Friendly staff\n+Fast service\n+Peet's coffee\n+free wifi\n+plenty of seating...great for getting some work done away from the office (definitely a bonus for folks who are in SF on business and need a workspace!)", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "Great place if you have a couple of hours in between errands. Clean restrooms, a lot of light and outlets so you can recharge your devices.", "author": "Mili S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "What a  great secret coffee/study/remote work spot in downtown SF! I love how random it is and the coffee is pretty high quality as well. Who doesn't enjoy working remotely from a long, sturdy farm table for a few hours?", "author": "Erin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "New favorite place in the Financial District when I need WiFi.  I haven't figured out the business model yet which is being able to offer three spacious floors of \"study/work\" space for people to enjoy while selling Peet's Coffee for less than a couple bucks.  There are even rooms in the lower level for larger groups of people to use for meetings and whatnot.  If you're looking for a wider variety of coffee options, you might want to look elsewhere at a conventional coffee shop but ING Direct Cafe will be my destination place when I'm in the FiDi for work!", "author": "Albie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Great workspace- the good acoustics help dim the sound of the person at the table next to you, making their very important skype call to their significant other who is in their towel in some foreign country.\n\nGood drinks- and seriously cheap.  Even cheaper if you pay for it using your capital one card- 50% off!\n\nNice people- although they're really not your typical baristas with big glasses and purple hair, they sure are nice.  Snobby is not a word to describe the employees behind the counter.", "author": "Betsy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "This cafe is awesome! They brew peets coffee and give pretty generous cups for a great price. If you're already an ING customer you also get a discount off their coffee. In addition they have a selection of pastries, yogurt, and salads and sandwiches during lunch time. \n\nThe space is really big and is open for the public to use. PLUS they often give away free food such as during their bbq bonanza last month where they gave out coffee in the morning, pulled pork sliders and cupcakes for lunch, and iced tea in the afternoon! Last week they gave out free waffles from a food truck. Definitely worth stopping by and there are plenty of staff members available if you need assistance with your account or want to become a customer.", "author": "Alice J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "This café is awesome - a great place to hang out.  Also, if you use your capital one card, all drinks are 50% off.  So, I only pay $1.50 for my soy latte.  Soy latte and the b waffle and never ending stream of people to stare at makes it a great café.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "This place is real neat.  Lots of space and free wi-fi.  I sat in a comfortable seat, had a great view of a busy street corner, enjoyed my coffee, and pumped out some work on my lap top (there were several outlets available too if you need to plug in).", "author": "Bret M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-15", "description": "If you bring in your own mug, your drink is 1/2 off. \nSo, I walked away with a Medium Peet's coffee for .75 cents.\n\nWinner!", "author": "Jon F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "Nice peeps, very cool interior setup but watery coffee! It did not taste like a true Peets brew. I'm gonna hit up the real Peets next time.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "This place is really awesome if you're looking for a place to get crap done. There are 3 floors, tons of seats, plenty of outlets, and 50% off drink discounts if you use your Capital One card. I didn't have to use a 360 card (since I don't have one), but it's good to know that there's that discount. The only food I've ordered from here was an Orange Vanilla waffle, but... they didn't heat it up or anything. So far this is my only gripe since cold, hard waffles aren't very fun to eat, but the pros outweigh the cons.\n\nThe staff doesn't come around to bug you, so you don't really need to feel obligated to buy anything. If you do, they won't even really bug you about opening an account, so another plus. This is my go-to spot when I visit SF and I needsta work!", "author": "Patrick K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Maybe the best coffee shop in the area. Appears to be run by Peets but still as spacious as ever and filled with the same friendly staff. The baked goods blow away that faux french (la boul) offered by a nearby competitor, as does the strong coffee. Prices are right.", "author": "Boris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "Great spot to do some work remotely. 3 floors of tables, tons of outlets, they even have bean bag chairs downstairs (reminds me of college). You're guaranteed to find a spot easily and the wifi connection is good. There's a Peetes coffee shop inside, and to top it off it's super centrally located in the heart of downtown. What it lacks 'character' (don't expect cozy and cute, it's opened by a bank after all) it makes up in convenience, functionality and efficiency. Big fan of this spot.", "author": "Denise W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-19", "description": "THIS REVIEW IS ABOUT THE FOOD/DRINKS OFFERED ONLY: So, they closed for a week for a remodel and to improve the café.  I specifically walked all the way over there to check out the new remodel and pickup my favorite salad.  What a huge huge disappointment to walk in there and basically see a \"Peets\" Coffee in it's place.  Gone are the delicious local food offered and $1.50 coffee.  Now you can get a lentil salad for $6.75 made in some anonymous place god knows when and where.  I went in there for the great and fast service.  I guess all the folks who want to just sit there for the wifi and have their meetings will continue to go....folks who like real, local food at normal prices will have to find somewhere else to go....no more great vegan food :(", "author": "Maria E. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "Great spot in SF to get work done on the weekday! It seems to cater more toward providing a work and meeting place for people rather than earning profit from their food, so drinks and snacks are super cheap, staff are extremely friendly and welcoming, interior is bright and open, and there are lots of outlets and couches! I wouldn't feel bad coming here regularly just to get a cup of coffee and studying.", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "Capitol one 360 coffee shop is cool.  Lots techies work from this place. Free wifi and great snacks and lattes.  I think more companies need to consider burning all their stupid cubicles and make their white collar workspaces look like this place.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Called in today to see if I can stop by and make a payment on a credit card and was told that I couldn't make it at this location but the guy named Pat on the phone was great! He immediately gave me all the alternatives and made sure I knew everything about how and where I can take care of my credit bill. Very happy with the customer service, great job definitely going to stop by and check this place out. Give Pat a \" Pat on the back\" .", "author": "Adam R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "So I found out that this ING does not have a branch, it's all online. But this location is just a Cafe. For people to go and either join ING banking or hangout.. I was early for a meeting and walked a few blocks around and could NOT find a place to sit, I walked into ING and just hung out to kill time. No one bothered me. I saw a few groups doing client meetings in there as well. Pretty cool!", "author": "Tam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "ING did a great job with this place!\nspacious, comfortable seating, outlets everywhere, wi-fi, TVs, food\ni love that the furniture is all sustainable\nit's a great place to work, chill for a few minutes while shopping, meet people, or just grab a coffee\nand the bankers/baristas are very friendly", "author": "Deka M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "What an AMAZING gift this is to people trying to start their own business. Free wifi, tons of outlets, tons of seating, and coffee. I'm so thankful for this space. I hope they make a video series someday about the startups that blossomed from this space. :)", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "Great place if you need a physical bank for your 360 account. I haven't received direct deposit yet from a new job, so I've been getting cash. I needed to pay mu credit card bill and the process was explained quickly and thoroughly. Definitely very friendly and helpful.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "It's a bank. It's a coffee/snack shop. It's a lounge. It's a wifi cafe. It's Superrr...\n\nA cool and modern take on banking. Imagine a Starbuck's where the coffee is half-priced, the baristas are moonlighting as banking associates, and the interior is huge & well-kept in a prime location! That's what 360 Cafe is.\n\nCapital One 360 (formerly ING Direct, RIP) is an online-only banking institution. They do not have the traditional branches you expect from Bank of America, JP Morgan Chase, etc. What they do have is a really awesome online experience and really cool cafe/banks to go with it. There's only a handful of these and they're all located in metropolitan areas.\n\nDrinks are also 50% off if you use your Capital One 360 debit card.\n\nI enjoy this place for what it provides, ample spacious areas to do work, friendly service and exceptionally priced coffee, and a clean environment in an envious downtown location.\n\n5-stars if you're looking for something different than Starbuck's but will still give you the caffeine and work space you've grown accustomed to.", "author": "D K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-02", "description": "Ok I'm sure the coffee holds its own but the banking is little to be seen. I have had Ing direct and when it transformed into CapitalOne 360 it wasn't too complicated just moving passwords and resetting a few common applications, in addition I have a Capital One Credit Card to boot and connect with. But just recently I have had multiple problems with this bank; They continue to freeze my account for normal transactions at what they say are questionable atms (Atms on their allpoint network), they don't have their own atms btw only at this 1 location. And after speaking on the phone with multiple representatives who would only deflect the blame to MasterCard or the Allpoint atm network that is \"supposed\" to be used, I decided to pop in and ask a person face to face. Let me warn you here I think these \"assistants\" might be less qualified then the Baristas. I almost question there existence in total! The most they could do is put me on the phone with another representative and hand me a pair of free sunglasses. Even when I was finished with the phone call I was given 3 free coffee cards for my trouble and lack of help/information. If I need coffee I'll use a bank that let's me access my funds properly and proceed with a debit purchase. If I need banking I'll use...to be determined...", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "Wifi was a bit trippy in the beginning but it worked fine after 10 minutes or so. It's conveniently located in the heart of downtown and it has THREE floors! The set-up is rather cute actually. There's bean chairs, swanky chairs, and yoooooo - $1.50 large iced coffee! You can't beat that price It doesn't taste watered down either. That's wassup.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Came here for the first time and like it so far. It's definitely easier to concentrate in here than a typical cafe with wifi, especially coming here at noon on a weekday. Coffee is $1.50 for a large. I wasn't able to find a table but found a really comfy chair in the lower level to camp out.  \n\nComplaints: not liking the 90's music at all. There's a time and a place for that, aka while dancing around my living room or hanging out at a dive bar, not while working! :)\n\nAlso, wish they were open later than 6 and/or on weekends.", "author": "Jade S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "They're doing a lot of things right at this not-too-little cafe.  I'll admit to being suspicious at first since cafes that are banks that are cafes that are banks tend not to get either part right (hello, Starbucks-Wells Fargo!).  \n\nBut I was wrong.  The space is bright and airy.  The staff is efficient and friendly.  I haven't hung out with my cuppa since my office is right across the street, but there's a lot of real estate to enjoy with a laptop.  \n\nBest reasons to visit:  Never a line, great prices, fast wi-fi.\nBest reasons not to visit:  Agoraphobia, caffeine intolerance.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "Good service, plenty of space, and half off if you have a capital one card.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "Bank on it.\n\nMy favorite bank is now one of my favorite cafes.\n\nThis clever marketing move means everyone has a new spot downtown to enjoy solid Thai chicken salads from Curbside, good Americanos made awesome with sugar free dark chocolate and one of the cheapest parfaits ($2) in the city.\n\nWiFi throughout. Plenty of open space, seating, outlets and friendly vibe.\n\nConsider it a good investment.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "Seriously, the best wifi here! As a traveller I have been looking for good internet for a few days now. I managed to download a whole season of Broad City in under 20 minutes! This really made me happy. Oh, and the water is good too.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-30", "description": "Surprisingly really quite nice. It was the closest coffee place open on a Saturday by my new office, so I tried it out.  SUPER friendly barista.  Decent prices (relatively speaking), super open space, good coffee.  I don't really write many yelp reviews anymore, but I felt compelled since it was such an unexpectedly pleasant experience. \n\nI guess I also get 50% off coffee there too if I pay with my ING debit card, which I happen to have already have.  Who knew!\n\nMostly the dude was just so excited and nice - it was very refreshing!", "author": "Kerry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Really nice place to use wifi and purchase many of their good eating options. The place can get VERY crowded as in everybody using the wifi and seating, just be on the look for when a space is available. I just wish they would extend their hours.  Perhaps my favourite place for wifi and a nice chilled coffee.", "author": "Nadav M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "what a great place to just sit down, enjoy a great cup of latte and just do work! Staff were great, ambiance is nice, and even get some tips on how to save money.  what a place. highly recommended.", "author": "Alan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "Great, we all love this coffee place.\nEasy, convenient, cheap, and great coffee.\nPerfect!", "author": "Oleg K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "I feel ashamed every time I come here because most of the time I just use their electricity and internet without even buying a coffee. Great place to study or do some work on your laptop and cheap cafe onsite. Also very centrally located next to all the restaurants nearby and the workers don't even give you dirty looks when you bring in outside food or drinks!", "author": "C W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "It's our lovely place! Good Peet's Coffee and there are a lot of sitting place including downstairs (with pufs), main floor and second floor! It's an ideal place for working, briefly casual meetings and just for sitting in the center of SF. Be sure that there are a good WiFi and a lot of people with laptops like this is the main office of Google :))", "author": "Ilia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-22", "description": "This is a great place to have a meeting with someone or do some work. They have free wifi if you buy a drink. It's very spacious and has a lot of tables. Sometimes, if you don't get there early enough, the larger tables (that fit 4-6 people) upstairs are already taken up.\n\nDrinks are 50% off with ING Debit card, can't beat it!\n\nAll the people who work there are also very friendly, and knowledgeable about ING products, if you need help with them.", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-06", "description": "Capital One took over ING, \nsame friendly people, new uniform....\nmaybe they can open longer hours,,,\n\nanyway, it's 99% perfect,\nif I worked next door,,,,I'll be \"DRUNK\" every day on hot chocolate!  yum", "author": "Sunny O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "Free drink if you check in! This place is the coolest work-from-home-but-not-really place. It is a strange concept and I don't really see the banking part of it (besides all the posters and commercials) but it's awesome! The people who work there are so nice. There's all these tables and outlets to work at with their free wifi and the coffee is cheap but good!", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "A spacious, fun place to work downtown.  The 50% discount for using your Capital One 360 card makes it almost too good to be true.", "author": "Krishan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "Finally! After weeks of searching for a cool quiet cafe to work or study, I came across this place. And it's almost perfect for someone who's looking for a quiet cafe with music on low volume and plenty of seating and numerous power charging slots. They have high bar chairs to work with your laptop and also couches to relax. High ceiling and plenty of sunlight. There's Peet's coffee outlet.", "author": "Mohit C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Like the environment easy to work good music but don't expect fast internet.", "author": "Cemal S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-15", "description": "The internet is fast. That's about what I can say about this space that's an unqualified positive. It's not bad, it's just absolutely average. Average coffee, average seating, average music.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "Interesting to see a bank aiming for the coffee crowd.  It makes some sense to me.  If people can spend upwards of $3 for a cup of coffee, you may as well exercise the \"Capital\" portion of the name and go after it.  It's actually a nice vibe.  Coffee is good, Pastry is what you might expect.  I'm all for anyone putting a little dent in the $tarbuck$ business.  Just sort of funny to see a bank in the java biz.  My prediction is that it won't last long. though I'm rooting for them.", "author": "Joe I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-18", "description": "This place was awesome. Nice place to get away during work and get some cheap espresso. Lately the network had been horrible. They need to limit what people can download or boost the capabilities. Torturously slow this week. Will need to find a new haunt. I'm a Capital One customer too so this especially ticks me off.", "author": "Aaron N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-07", "description": "Can't really complain when the place offers free wifi, but it lacks atmosphere and there isn't enough seating.", "author": "Kira G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Half off all PRISSY coffees because I have a capital one card. Carmel Mocha, yup. \n\nMason is the Banker that signed me up. He is the nice little Asian dude like me.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "like the coffee shop im a capitol one card holder and used to bank with them when i lived in Houston and New Orleans so im a fan, love the wifi and coffee here", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "This cafe feels super-Financial District with hipster-modern thrown in for comfort. Food and drinks are super cheap and the wifi is pretty consistent. It really does feel like an open-plan office, which is a nice change though usually I'm not into an office feel. :)", "author": "Allison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "This is such a cool place!  I work one block from here and I find myself here everyday.  My fav part about the spot is the space: It has a really hip interior and there are always people just lounging around and hanging out.  Much better space than any other coffee shop I have found in the city.  The only \"issue\" is that their coffee is mediocre at best.  However, I am not a big coffee person, and as I alluded to early, I come here because of the awesome atmosphere.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "A great place to sit and study and do work. This place has a great feeling. There are also cool art exhibitions all the time here.  The wifi is fast and free. You don't have to buy anything to use it. So chill. Love it.", "author": "Alanna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-20", "description": "Love this public coworking place with free wifi and reasonably priced coffee. I'm a freelance marketing consultant, so I like to mix it up which cafe I work from, and this place is by far one of the best places where I was able to work productively. If I want to take a break, I can go to the downstairs level and take a nap on one of the beanbags :) Coffee is ok, and hot tea (lemon rose and xiao blend are my favorites) are only $1.50. Great place to meet with clients or hold business meetings at too!", "author": "Eni R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "Came in today as I constantly walk by - and went up to the counter where Stephanie the friendly barista was able to help me sign up for a bank account and offered me a free beverage as well.\n\nAfter fiddling with the wifi for about 10 minutes - we got it to work. Overall, signing up for the account was a breeze; drinks are cheap; and i thought it was a great place with all of the power outlets.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-10", "description": "As someone below said, this is first and foremost a bank. Capital One bought ING and service has gone way downhill from there. They put FIVE BUSINESS DAY holds on deposited checks, even payroll checks (I know, I know; why does my employer even do paper checks?) And going to this cafe doesn't make the hold time any shorter. It's exactly the same hold they use for mobile banking. \n\nI'm not working just so that Capital One can use my money for a week before they give it to me. \n\nTime for a real brick-and-mortar bank for me.", "author": "C D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "It's like being in a huge office with young, trendy co-workers (think start-up folks) whom you never talk to ever. It's big and spacious with plenty of electrical outlets. Free wi-fi and very cheap coffee (Peet's!): $1.50 for what would usually be a medium at most places. The workers here don't guilt you into buying anything or even to join their bank. Such a chill place to work. \n\nThere are also conference rooms you can reserve for free (what, I know). Only drawback is, I wish they had better food.", "author": "Trish P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "What a great idea.  This will be my new \"go to\" place downtown when I need to get some work done.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-29", "description": "stunning facility but seems like I can't sit here for more than 45 minutes before the waiter kicks me out to make room for the Promotional Event of the Week. Also, is this a coffee shop, a daycare or a bank?", "author": "O. Reli-yah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "I love this place. I don't drink coffee but I'm a big tea fan and they have great a great chai latte. It's very strong but you can always ask for more milk (or non-dairy milk). The prices are fantastic and the people are really friendly. the ambiance is great because there are 3 floors you can use and there is plenty of spots to do your work or use your laptop.", "author": "Tayo O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "Friendly baristas, pretty inexpensive coffee and free (and fast wifi).  Love how they have check in specials too (yelp and foursquare) so make sure you do and get your coffee on!  If you open an account you get 50% off?!!!", "author": "Mari Dani B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Comfortable place to work with a Peet's Cafe inside.  Lots of tables with outlets to plug in your laptop.  Only downside is the Wi-Fi is very spotty, so be prepared for that (phone tethering is a life saver).", "author": "Cy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-26", "description": "Always friendly and fast. The cheapest iced coffee in town also the food (salads, sandwiches etc) is always fresh and tasty.", "author": "Kendra R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "Came here for \"Free salted caramel waffles\" last week and stayed to open a savings account because ALL the baristas are bankers (formerly known as ING). While I sipped on my free latte, I opened a savings account & will get my hubby to get one too. GREAT place, very chill environment and not to mention they were playing Snoop Dog & Biggie in the back round.", "author": "Yishra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-08", "description": "This is my absolute favorite place to study in the city. It's a huge open space and there's always a seat available. AND how can you beat a large cup of Peet's coffee or tea for $1.50 (and I believe $.75 if you are an ING customer). The soup changes daily and is pretty good, the wraps are delicious and fresh as well. I especially love the pesto chicken wrap with avocado and arugula. Thank you ING!!!", "author": "Peggy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "I don't know what kind of force field or black magic they're using, but these guys have the first clean, publicly accessible restroom I have ever seen in downtown San Francisco.", "author": "Coleman F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "ever notice when you enter a local coffee house, that it is:\n- dark\n- cramped\n- all of the above?\n\nnot ING Direct Cafe\nyou'll get many degress of \"whoa\" when you enter this place.\nthe confines are vast and chasm like.\nthe coffee is good, the side-eats are nice.\nthe staff is uber-friendly.\nthe feng-shui is perfect.\nfeels like I stepped in some modern-day euro coffee pad with banking on the side.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-13", "description": "Awesome idea; and it is well executed.\nI hope the idea works for them as well as it works for me. \nClean space\nFast internet\nNot noisy\nFast, friendly service\n... and yes you'll be pitched a Capital One product or two while you are here, but it is a bank after all. \nJust manage your expectations.  If you want Capital One to pick up the cost for your internet and most of your coffee ... well give them at least an opportunity to share their bank offerings with you as well. \nIf you don't want to be bothered with bank offers go to peet's or starbuck's do the road. Noisy, slow internet, and expensive coffee.", "author": "Hennie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-30", "description": "They play the absolute worst music. Most people are there working, not clubbing with teenagers.", "author": "Chris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "This is a great cafe for sitting down and doing some work.  Cheap food and drinks, super spacious, wifi, tables, sofas and even conference rooms.", "author": "Vincent V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "This cafe is a great spot to sit down and get some work done. Wifi works great, never got disconnected and was sitting there working remotely for about 4 hours. Coffee's nothing special, but it's good. The staff is awesome. At around closing time, I went to grab a bottle of water before leaving and the barista gave it to me for free! Well done capital one, well done.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "Pretty unique place. Very cheap coffee with a Capital One card, no serious lines to order, great setup (lighting, tables, sofas) for informal meetings and catchups, bustling atmosphere. My favorite spot for a coffee break", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "How does this place even exist?  It's like a free office in the heart of SF with tons of room, WiFi, power, coffee, and snacks.  The people are friendly and love to comp you stuff too.  This place saved me on a day that I need to get tons of work done out of my normal New York office.  Highly recommended.", "author": "Karim O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "can't beat a place where you can sit and use the wifi for hours and for free! decent bathrooms, fairly quiet, and if you're a capital one customer, major discounted coffee! good place to work in SF proper.", "author": "RayRay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "Lov this cafe! Spacious, super friendly Baristas, just one block away  rom my work. And I only paid $1.75 for a large cup of Mocha (with my Capital One card). Wow, I think I will be here several times a week if not daily. It would be great if I can tour the third and fourth floors, the decors look fantastic.  But I heard they are only for internal employees!", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-29", "description": "Pretty great place to grab some wifi, a spot to work for a few hours, or even a convenient meeting place.  Half off drinks when I use my Capital One credit card.  With Peets, the drinks are good.  Sure, it's no Blue Bottle, but $1 is not half bad for an espresso and spacious place to work for 3 hours.", "author": "Caricia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-18", "description": "Maybe they were having a bad day when I went in the morning. But damn the girl who took my order was pms'ing big time and had negative energy written all over her, she was very rude. I waited 20 minutes just to get a muffin and a regular coffee and there were 3 people behind the counter wtf. Looks like they cater more to tailor made corporate folks. Ive been coming to this place since it first opened and never really had an issue or complaint until now. Im pretty disapointed that the level of service was not up to par on the day I went. Normally I wouldnt make a big deal out of its since its just f@#$en coffee but they made me late for work and that pissed me off.", "author": "Flechazo I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "Interesting concept.. We were waking by it, and just had to peak in to see what exactly their offering was.  Cheap coffee and banking advice from the baristas.\n\nNice decor and plenty of seating space - not crowded.  Will be back if I ever pass by again.", "author": "Gary V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "Since last year had great improvement in making the space more suitable for working, cheap coffee and good environment. I'm glad that music is not too loud and Internet connection is a lot better now. Still I'm not a fan of their playlists when I want to work or have an appointment. But it's a great place in financial district to have a coffee, meet someone or get some work done.", "author": "Siavash F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Great place to get some work done or for a tasty drink. The location is prime as well, a block away from Union Square. Bonus: the prices are great, the check in makes it better (50% off). I even got a drink on the house after checking in a couple times (I think it's random). No complaints.", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "I've been considering joining a co-working space, as an alternative to working from home (I'm self-employed), and a friend tipped me off to this space. It is airy and spacious, and lots of light, tables and reliable Wi-fi. I feel more productive as there are lots of other self employed tech people plugging away at their laptops, which is motivating! There is Capital One marketing all over the place, and a bit of the push to try their banking but it isn't too bad. I guess it is their \"experiential marketing\" to the tech/start-up demographic. You also need to input the password to the Wi-fi every 45 mins, but it is easy. Agree with the other reviewer, that the food could be better. Overall, I am pretty stoked... the music isn't bad either!", "author": "Jungah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Things I love about this bank / cafe:\n\n- They have a sign that says \"We proudly serve cap & trade coffee.\"\n- You can order your latte with whole milk, skim, or 2.9%.\n- This place has an espresso machine with a panic button.\n- I hear they have an opening for a bean counter.\n- You can get your coffee free every month as long as you always keep 2 oz. in your thermos. \n- On their most recent menu, they dropped the Americano in favor of the Euro.\n- When customers refer to their portfolio, they don't mean a book of really ironic t-shirt designs.\n- ING Cafe doesn't have musical performances, but they do have a variety of instruments.\n- There's nothing like a nice cup of coffee to go with your pie chart.\n- They sponsored a \"coffee appreciation\" event, but all they did was raise the price.\n- When Starbucks started giving away a free mp3 with each purchase, ING Cafe did the same with CD's.\n- I can never decide what to order because they offer too many options.\n- When I dropped my $4 cappuccino, it bounced.", "author": "Sven E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "I love this place. Everybody is so attentive and super nice. Half off discount on coffee. I'm happy...", "author": "Nara E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-07", "description": "The space is awesome, I've been back 3 times in a week. the drinks are just okay, but then again, they're super cheap.", "author": "May G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-17", "description": "This must be the coolest marketing trick I have seen from a bank. This place is a nice spacious coffee shop with free wifi, local food, and the baristas are bankers! Go figure...", "author": "Greg S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "cheap coffee but the people who work here need to chill out with trying to get me to sign up for a checking/savings account. They literally ask every time i visit.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-10", "description": "I LOVE the ING Direct cafe!  Great cafe, great environment and great staff!  The atmosphere and location is perfect.  The coffee is amazing and at a great price. Can't wait to see what else they bring to San Francisco!", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "Great place to get some work done,\nit has a very businessy and sterile vibe to it though.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "This became my favorite \"coffee shop\" near work as soon as it opened. They always have ample space (and three levels), you can get a cup of tea for $1.50, and there's never a wait. I once asked if they had a tip jar and they responded \"no, we try to encourage you to save money.\" So corny, I love it!", "author": "Adam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "Yay cheap coffee and a nice place to get free wi-fi.  Bring your electric orange card and get half off!", "author": "Kris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "I use this space every day to meet with my team. Great alternative to working from home. Why would you pay to use a co-working space when there are options like this available?? Thanks, Capital One!", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "Huge open space with solid coffee and friendly service.  If you need a place to relax or get a bit of work done, I highly recommend this spot.  Really cool concept!", "author": "David A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "Great place to hang out and work. Cheap, friendly service and free wifi.", "author": "Zari Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-03", "description": "Union Square has a decided lack of clean coffeeshops with wifi. Although this whole place is a commercial for an internet bank it really meets my needs. I feel a little silly that I discovered it just today, but definitely will return.", "author": "Cameron K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "I love this place ever since they opened. Ventured my way in on the day it opened and found out that a large ice coffee was $1.50 and I was hooked. The cheapest Iced coffee the city and they use Peets. In addition the space is fantastic to use for networking, meetings, freelance work. And I'm not just using their space, I think the space works for them too. I opened up a Roth IRA account and reopened my previous savings account there. So it goes to show when a Bank does more than just own empty space in the city it's more effect than other places (how I feel every time I walk into Wells Fargo).", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "Whoever conceived this idea, I believe may be on to something! They have non-gimmicky fool-proof accounts, and they try to inform you of their services by luring you into a cool multitiered workspace with a coffeeshop, pastries, free wifi, plug points, varied seating with bean bags up to stools, segwaying to their clean bathrooms; even cute girls on occasion-a winning place to get some work done!", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "I finally made it to the ING Direct cafe. I heard about it a while back and could not find it.  The location is pretty large with plenty of seating and TVs. There is an ING ATM in the cafe - great concept. I will definitely plan to drop by when I am in the area.", "author": "Ana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "When you're an online bank, why have an offline presence? \n\nBecause you make that offline presence into a brilliant cafe, that's why! Cheap coffee & snacks, huge space, fast wi-fi & tons of plug points. What's *not* to love?\n\nEdit: speedtest tells me: 40 mbps down, 30 mbps up. And that's in the middle of the day, with probably 40-odd people logged on.", "author": "KS S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "Amazing staff and great space! Too bad the Peets baristas always get my orders wrong....", "author": "Evie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-20", "description": "This place is like hanging out at a venture funded startup with money to burn. The wifi is fast and unlimited (purchase to access). There are three floors with multiple environments to choose from (work standing up, sitting down, on a couch, at a work bench, at your own table). There are plugs everywhere. It's super spacious with high ceilings. This is great space to work or meet people for work. The food and coffee are just ok though, but it's so reasonably priced, you can't hold that against them. Also, be aware, the music is pretty random and the acoustics make for a constant din so bring your headphones if you can't work like that. Lastly, the staff here are super duper friendly, always. I don't know why ING has a cafe, but I really like the effort. As a one time ING Direct account holder, I'm kind of proud.", "author": "Ramon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "inexpensive drinks and goodies and awesome co working space, loving this spot!", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-25", "description": "I signed up for a capital one 360 account. They did not honor the promotion that was advertised and customer service was terrible. Don't recommend for banking.", "author": "Henry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "I like the spaciousness of the place, and the food is pretty good too! I just don't like the \"do you have an account with us\" talk from the staff, but hey what do you expect it is a cafe in a bank after all.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "I've been working here everyday for the past two months, and it's a life-saver. I don't know how they make any money off this cafe. My only guess is marketing and building brand equity. Coffee/tea for $0.75 for Capital One members, $75-$125 credit if you open an account, free wi-fi, tons of outlets, cool vibe, great energy. Lots of freelancers and start-ups work from here. The staff is friendly and the place is clean!", "author": "F S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Nice people at the front. Good music at the perfect volume. Open area with tables and couches. Basically a great place to get work done alone or in a group. Oh yeah, let's not forget the free wifi.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "Seriously, where else can you get a soy vanilla latte for $1.75?!  This is the best place for your coffee break without a huge dent in your wallet.  The staff is super friendly, although there is this one guy who seems way too caffeinated.  Food is also cheap - $2 fruit cup (although I wish they would cut the fruit into bigger pieces).", "author": "SJ W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "food/drink: very affordable. good coffee. super friendly baristas.\natmostpher: lots of natural light, free wifi, three floors of open seating (couches, tables, high-top tables), ample outlets. great place for studying/meetings!", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "okay people..... first and foremost.... this is a BANK.... not a cafe... the cafe part is an extra bonus and so is their free wi-fi.... amazing place to bank and end up hanging out at my bank b/c it also has a cafe and I can breakfast and lunch here as well... from time to time they will have promotions.... and I love that they promote a lot of the local business.... free hotdogs, free bbq lunch, free waffles for breakfast.... right now they r displaying work of a local artist... who uses a flat screen as a canvas... how awesome is that... you have to see it.... Now the banking part, these bankers are all about service... they are friendly, happy and very HELPFUL. They will go above and beyond  to help you sort out your accounts if you need. And they love telling about their promotions...i.e. $50 bonus for opening a checking account and I only needed $5.00 to do that.... I already made $50.00... how great is this.... Thanks Capital One (on Post) for such a fun way to bank!", "author": "Jay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "Perfect environment representing all thats good with SF", "author": "Nader S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "Pretty smart idea.  They advertise by opening a Starbucks-like coffee lounge while trying to get you exposed to their product.  The sales-person wasn't too pushy either.  Their latte was super strong!", "author": "Steven C."}
