{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Best Coffee company in the bay area. the owners are wonderful people. they treat their customers right. I would go there every day for good coffee. I always bout coffee for my home. I moved to Florida almost two years ago , and still have my coffee shipped from this wonderful coffee shop. Thank you Ken.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "I've never gotten coffee here. Unbelievable, I know. After all, I've bought the chocolate-dipped appendage on a stick that I lustfully yet respectfully dubbed Mandingo at Hot Cookie, wolfed down the overaccessorized wieners at Dapper Dog, and attended the most essential sing-alongs at the Castro Theater. Besides, I'm a Philz guy who becomes a creature of redundant habits. But I had never been here until I found myself in the Castro early on a weekday morning with a few minutes to spare before a medical appointment up the street.\n\nWhat deterred me is the claustrophobic space and the number of tourists and regulars who venture in but don't seem to come out. On this particular morning, it was almost empty which allowed me to get a pleasing 20-ounce cup of the Hawaiian Royal Kona coffee for just $2.15 (photo: http://bit.ly/2PJ1Nsg). It gave me a gulp of the tropics before my EKG and motivated me to come back to buy a bag of their beans. They spotlighted at least five different types that morning which I presume they rotate. I was just thinking how good a cup of the Geisha Esmeralda would go with a Mandingo.\n\nCOFFEE - 4 stars...smooth richness with a different flavor\nAMBIANCE - 3.5 stars...still feels tight in here but I can bear it now\nSERVICE - 4 stars...awfully nice considering how long they must be in there every day\nTOTAL - 4 stars...indie coffee that worked for me\n\nRELATED - Hanging around in the Castro? Here's a list of the places I've tried and visited: http://bit.ly/2MD7Kcw", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-02", "description": "I was just walking down Castro and WHAM! The aroma of coffee smacked me right in the face! I couldn't resist a hot cuppa joe on this chilly night. \n\nSo I popped into this cute tiny coffee shop jam packed with coffees and pastries. The guys that attended me were friendly and polite. \n\nI had a drip coffee ($1.62) and an apricot bar ($3.25). For drip coffee, it's self serve by the door with 8 to choose from. Refills are like a buck twenty five. \n\nUnfortunately, I didn't like anything I bought here. The coffee tasted artificial AF. (Bourbon Pecan is the one I chose). And the Apricot Bar was awful; too dense, not at all sweet...like whatsoever, tasted only of dried apricots and nothing else. \n\nCanned sodas are $1 ...so that's good cuz I was thirs tyy", "author": "Marilyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Every time I come to San Fran I always make sure to stop by here! I first came across this place a few years ago when I was having difficulty finding blended (frappe) coffee in San Fran. \n\nThe shop has a lot to offer, many different types of coffees, syrups, beans, and pastries. I love their blended drinks. Tried a hot mocha once and have tried their pastries a couple times, they were good. \n\nI like how they have a little bit of seating outside. It is good to able to sit down and eat your pastry quickly especially if it is sunny. On my last trip to San Fran the smoke was making me so sick it was a blessing to be able to sit down for a bit. \n\nThe people who work here are nice and are good at making sure the line doesn't back up.", "author": "Rose P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "I love this place. Limited. It sunny seating with San Francisco's best people watching potential. Plus petit fours!!!?????!!!!!\n\nThen there's the coffee. Where else do you get \"heavy cream\" as an option for creaming your coffee. So much more fun than lame old soy milk. Lactose tolerant thank you very much. \n\nI love that there's a huge selection of coffee pumps and that they change daily so you can really sample all the wonderful variety of roasts and blends this place carries. I personally prefer a medium or light roast so I get more caffeine to balance my heavy cream. There's always at least two choices, one Latin American and one usually African. I gravitate to Tanzanian and Costa Rican coffees and YES the coffee matters even though I drink it with heavy cream and brown sugar!", "author": "Tim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I'm not a coffee gourmet, but I'm always giving them as gifts.  I didn't want to buy stale old gourmet coffee for high prices at safeway, so I came here asking for strong but great tasting coffee and the owners were very helpful & knowledgeable- their coffee choice even impressed me along with their spinach cheese empanada!!! \n\nTheir shop is tiny with only 3 small tables outside so intend to buy your coffee and pastries to drink as TAKEOUT.  But once you know the coffee you like - mine was the Barbary Coast Reserve 1 pound ground for $12- then you can just go in and out and enjoy it at home or work!!  They also have their website you can google where you can order the coffee to be shipped to you if you already know what you want so no having to leave home!!\n\nI'd definitely come back!!", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "I buy most of my coffee grounds (yea, I don't grind them myself, so you have to take my coffee opinions with a grain of salt) here. It was a no-brainer until a couple of months ago because many types were I think $7.50/lb., which tends to be a lot cheaper than decent beans in a supermarket. Supporting a non-chain, local store is the icing on the cake. They've since raised prices a buck or so, but it's fine.\n\nI've only had their brewed coffee 1-2 times and it was really good, I'd choose here above the chains when I have the option. A pastry that I had, brownie/cherry, was solid as well. If I were in the area more at coffee-time I would definitely sit with a coffee and pastry.\n\nService is always nice and I rarely encounter a line, though I tend to be there in the evening or afternoon hours.", "author": "J.P. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "This is a super awesome coffee walk up right on the main drag of the Castro.\n\nParking is street only, which in the mornings and on weekends is very possible, however San Francisco overall has heavy traffic, limited parking and an excellent public transportation system. So if it's a weekday, or  weekend evening consider getting here some way that does not involve driving or be prepared for a quarter mile park and walk. If it helps there is both a muni station and the a street car stop not quite a block away.\n\nThere are three or so patio style metal table/chair combos outside if you feel like having your coffee on site, but there is no inside seating and overall this is more of a walk in/walk out kinda place.\n\nDecor is what I'd describe as San Francisco utilitarian. The building itself has been here forever (it used to be the Castro Cheesery-but even under that name it was till a coffee place.) and has that settled well used look. The counter is dominated by every kind of coffee the world has to offer in bulk glass displays. While there is also an extensive selection of teas to chose from there are more then a hundred different types of coffee bean in stock. That's all pretty awesome but there's more. The baristas on deck have some mad coffee skills. This is easily one of the best espresso spots anywhere. The manager (who may also be the owner) on scene is turkish and well, he's forgotten more about what makes a great pull then most mortals ever know. If espresso is not your thing this place also puts out godlike latte's  cappuccinos and the like. As you might expect there is nothing wrong with the basic coffee's either and at 2.50 for a meduim-ish it's the total bargain choice.\n\nBut wait there's yet more awesome goodness here-the pastry counter. When you get up to the cashier section to pay for your drink and some beans (Hey, you're in line anyway. Why not?) there is amazingly tempting treats in a display case. If you need something more breakfasty then the mouth pleasing petit fours/truffles/things covered with sugar and oozing cream/almond paste/marzipan/whatever the croissants are the way to go as the bagels and burritos are just ordinary. Not bad mind you, but not anything to come just for either. Avoid the malt balls though-nobody orders those really and the ones on display have been there a while.\n\nSo while this is not the best spot to break out the laptop and pretend to work while secretly checking everyone out, this is one of the best high quality, local, quirky coffee spots in a city filled with excellent quirky coffee spots.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "No over the top here fancy words here, just a great cup of joe that comes at a great price compared to other coffee shops in Castro.  The shop is so small, but they've got your standard drinks.  They also sell coffee beans too if you need some for home.  I ended up with a latte which tasted great, no sugar necessary and not too bitter.  Great stuff.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "We now order the beans directly from the cafe. Even with shipping, it still works out to be cheaper than buying in Starbucks or our local roasters. You also get to choose from an amazing array of beans. We usually order five pounds over the phone and receive them within a day or two in San Jose.", "author": "Philip C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "While I am not a coffee connoisseur by any definition, I know when I need caffeine and when I stumbled upon the Castro Coffee Company, I knew what I needed. Lo and behold I was pleasantly surprised to find a pretty incredible cup of coffee awaiting me, good service, and some pretty darn good pastries as well.\n\nThe shop is small, but the limited seating outside is pretty nice to catch up with a friend on a nice day (which it was). You come here for coffee and it is pretty evident once you set in. For some reason, a hand made cup of coffee caught my eye and unbeknownst to me, you have to pick the coffee to use. Say what!? I don't know where to begin with this...The gentleman behind the counter quickly sensed my confusion and shock and began to ask me what I liked and enjoyed and proceeded to make a recommendation which didn't fail. It was one of the best cups of coffee I ever had. No need for milk or sugar. Just one of the best cups.\n\nThere is a small selection of pastries and while they weren't the most amazing bites I ever had, but it doesn't disappoint.\n\nPrices are pretty reasonable and in my short time at the shop, it seems to be that quick grab and go spot that the locals hit up to grab their coffee before making their way on their daily routines.\n\nWould I go back? Sure. It was one of the best cups I ever had.", "author": "Chad Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "OMG.  I was in here recently and got the coconut coffee Frappe. It was unbelievably delicious.  \n\nSuch a plus to go to business where they are courteous and friendly.  They always have  a smile and are always so polite!", "author": "Rob O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Exceptionally good coffee, exceptional price. Many whole bean options (I grind fresh at home each day), and REAL authentic light roasts. If you are a real fan of light only, you know how medium is often passed off as light. These beans here are visible and on display when you choose. Most prices are in the low to mid teens per pound, for a real, actual 16 ounce pound. Whereas other high end roasts are 10-12 ounces, and are priced anywhere from $16 to over $20....\n\nIf you have a cup of brew from the store, it is not an individual pour over made for you, it's from a pump canister. THAT SAID (because you know this could be not so great, in all reality), yesterday I went in for the 1st time ever, at 3:30 pm, when you'd *expect* that to be less than fresh. I pumped out the VERY LAST cup and it absolutely tasted just minutes old. REALLY GREAT COFFEE. Meaning that, at that late hour, they obviously turn over the product too fast for it to sit long. Also, that cup of amazing coffee was only $1.65 for a small.\n\nEXTREME BONUS: among the cream options is heavy cream. I can't really do coffee with half and half-it's just not the same. So really, in a nutshell, I found here all of the things I've never ever managed to find anywhere. Can't imagine myself ever going anywhere else now.", "author": "Richard V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "I live in NY but whenever I'm in SFO this is one of my very first stops for beans to import back to the East Coast. These beans are amazing, when you handle them they are fresh and oily - absolutely heavenly when brewed. Favorites are Hawaiian Golden Kona, Guatemala Antigua and Tanzanian Peaberry.", "author": "Niousha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "I'm not a hot coffee beverage addict by any means, but I do enjoy a flavored, steamy cup of something every now and then.  We were on vacay and walking the Castro area in search of a jacket for me.  My spouse asked if I wanted something, and I said \"Sure, as long as it's not Starbucks.\"  Vacation rule #1 for me:  Don't eat/drink at a place you have back home.  Enter the Castro Coffee Company. \n\nATMOSPHERE:\nIt's the tiniest of shops, brimming with merchandise and the aroma of freshly brewed beans of the coffea plant.  There's absolutely no seats inside, just some outdoor ones on the unprotected sidewalk next to the Castro Theater. \n\nMENU:\nImpressive list of roasts and blends of all kinds, hot and cold beverages, baked goods, and online sales.\n\nBEVERAGE:\nCafe Mocha - Mmm, the perfect balance of cocoa, espresso, milk, and sugar that helped fight off the nip in the air.  Believe it or not, this simple drink can get screwed up, but not here!  Give it to me regular, no skinny this, shot of that, easy on the whatever... \n\nSERVICE:\nI didn't want to add to the crowd in the little shop if I didn't have to so I waited outside.  Spouse reported fast and friendly service. \n\nOVERALL:\nDelish mocha, competitive pricing, support local!", "author": "Vince N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "I love this coffee shop I've been coming here for over 15 years. Ken and his wife and family that run the coffee shop are very nice people and awesome coffee. Rico loves ken we go in almost every morning at \n7 a.m. for coffee and Rico's treats. I highly recommend to get your coffee beans here even if you like them grinded they will do that for you. Best coffee shop in the Castro.", "author": "Hector O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Great latte.  Live relaxing music. Not Trump country.", "author": "Eloy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Best coffee in San Francisco!! Best prices and the nicest people! I would drive out of my way to come here!", "author": "Kay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "It has been two years since my last visit and they are still the same great little coffee shop.  I bought three pounds this time: Fog Lifter, which really wakes you up in the morning, Ken's Natural French, another great coffee in the morning, and the Peru organic which is a great medium roast and I like drinking in the afternoon.\n\nIf I lived up here, this would be my go to place for coffee beans!  Until next time CCC!", "author": "Mikey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Really solid place, I dropped in before getting a haircut across the street. A medium coffee is just under 2 bucks, and they have 8 to choose from. I got the Hawaiian Kona blend and it was good coffee. I didn't try any food, but I will next time. Definitely a great local alternative to the big chains nearby.", "author": "Chip W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "I was drawn here by the smell of their coffee. The staff was super friendly and helpful. I decided on just a cup of coffee and it was memorable. They have a huge menu and i'm definitely coming back for more.", "author": "P M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-17", "description": "This place has such great reviews here on Yelp, but I was really disappointed. The service was super slow, taking over 10 minutes even though only one person was in front of us. And the staff ignored me to take orders of people they knew who entered behind me.\n\nThe icing on the cake was the subpar breakfast sandwich that tasted like one of those frozen Jimmy Dean sausage & cheese sandwiches that always ends up soggy. Which it did.\n\nHopefully this was all just an extreme outlier, but I don't have any need to find out with the joy of Philz just down the street.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "I visited here for the first time a few weekends ago. The cafe is very tiny, but is packed with things. The prices are good - better than Starbucks and the coffee is just as good. I ordered the biggest mocha and I thought it was a nice change from Starbucks-flavored mochas.", "author": "Tabitha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Great service and delicious Chai tea! Friendly owner and a variety of coffee and tea options. Worth the trip to the Castro.", "author": "Flora V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Great quick stop for latte in the AM. Friendly staff, and quick service. I'll be back.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-07", "description": "The older and   thin middle eastern man with thick mustache and eyebrow  I assume who is owner is a real homophobia closet case and can be a real savagely rude person when first time I came to purchase some coffee  ,I wonder if he felt threaten to his sexual insecurity  when he first saw a transgender person  without any provocation to him , his coffee taste like craps and  there is much better places to get coffee than his , I don't want to come back making someone rich and have to put up with an insulted and rude in a last place on earth I hope to find some peace and acceptance . Why don't he just move somewhere else if he can't be respect and tolerate someone who is different , wonder how he treat other customers but he obviously someone with the issue with his own sexuality .", "author": "Lady B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Small little coffee shop with great tasting coffee. The staff was very friendly and will customize your drink.   Only a few tables outside to sit. Will definitely come back for more.", "author": "Tammy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Here's your basic no nonsense good coffee place.  You want a good cup of coffee, come here.  Sofie had a cup of dark and I had a cappuccino and both were great.  They have lots of the good coffee gear.  Not the crap you find in Starbucks or Peets with their brand name on it.  It's all good.  Chemex glassware and those gold micro filters.  Get your coffee and drink outside at the tables on the sidewalk if there is one available.  If you are at Castro and Market, this is a fine place to pick up a cup.  I was not thrilled with the cookies they had - though I ate the whole thing.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-13", "description": "Mold.\n\nI cannot  believe this. I ordered a beef empanada to go. She put it in a bag for me, I got home, opened it up and it was COVERED in mold. That makes me think their pastries have been sitting there forever.\n\nI'm really disappointed based on the high number of reviews. Also, mold is a big deal. I shows they haven't switched out the pastries, and that maybe the case temperature isn't cold enough. \n\nI've included a photo.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "This place is amazing. The best coffee with the best price and the owners are always in there working greeting us all. Fabulous place!", "author": "Stacey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Have been buying coffee beans for over two years. This placed changed my life! The coffee beans are absolute delicious. Love the coffee!!!", "author": "Ramin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Wow, didn't realize I hadn't reviewed this wonderful, family owned and run coffee stop.  It's very, very small, but located right on the block with Hot Cookie and The Castro Theater, and you have a wonderful, fully stock, busy store.\n\nI started buying coffee from the Castro Coffee Co. when the other store they owned in SM lost their lease.  Both little places are run well, always have everything you want in stock and reasonable prices for both regular, hard-to-find and organic/free trade coffees.  I cannot recommend this place high enough for buying your coffee and sweets.  However, this is a very small place and unless the weather is nice, you cannot sit anywhere, be advised.", "author": "A W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "It was such a pleasure meeting the family (Husband, wife & daughter) of Castro Coffee Company during my visit. I was told they are the original \"one-cup-at-time\" coffee that goes way back twenty-six (26) years ago! Woof! That was way before Starbucks and definitely way before Philz here in the Castro!\n\nTheir coffee here is amazing and for $6.95 a pound (sale price), man that is a great deal. I bought the Espresso Roast and it is outstanding. I just brewed it this morning, delicious!\n\nThey also sell huge selections of teas as well as plenty of unique coffee accessories and assorted pastries and candies. It was beautiful to see a line up of coffee beans the minute you walk inside their place. From left to right it goes on and on. Certainly one of the largest coffee bean selections I have discovered in San Francisco.\n\nCastro Coffee Company - I can't believe it took me this long to come to you after more than 26 years of business in the Castro. You will be my new place for coffee beans and coffee savoring during my visits here.  I can't thank you enough.\n\nCheers!", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Whether you are looking for a quick cup of coffee or some beans to take home, this is the perfect one-stop shop! Conveniently located in the heart of Castro, this small store sells coffee that you can either dispense yourself through their multitude of airpots OR ask for a more complex brew listed on their menus above the cash register. \n\nPersonally, I like to order a half pound of grounds to take home. Their bean varieties are displayed in clear containers in the center of the store and along the back wall. Just tell one of the baristas which one you want, and they will measure out your coffee. You can either get the whole bean version or ask for them to turn that into grounds. They will ring you up right after. Even when their tiny store is packed with customers, service is super quick.\n\nI believe they also have some food or snacks, but I have not tried any of those. They have some chairs and tables out front if you just want to people-watch. Otherwise, you can just be on your merry way. I'm so glad this is conveniently located close to home!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "I am a recent convert to this place.  The family that owns it (and has owned it for decades) is very helpful and give great recommendations for coffee.  They let me sample an espresso and don't just recommend the most expensive, in fact the patriarch often promotes his ones that are on sale when I say I want to try something new.  Spot is a definitely cramped, but place is an institution and packs in a lot of goodness!\n\nPS - free coffee with purchase of a pound, just like at the big chains... but here you get 16 oz versus other places where they are selling by 12 oz for the same price.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Has the best espresso in San Francisco! Imported straight from Naples Italy! Also the owner is super nice and very personable. Loved this place so much I had to go back twice in one day.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "This place is small  but the coffee is a big deal!!!! My favorite is the  Africano triple shot. Customer service  is the best. This place is my all time favorite.", "author": "RL M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Cute little coffee spot! Many great options and coffee varieties. Baked goods, friendly staff.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "This is a neighborhood treasure!    Inexpensive but wonderful choices for drip coffee - 8-10 choices on every given morning, and they rotate out.   Lots of fun choices and flavors to explore.  I love supporting this small mom and pop business who has been there forever.   Easy to grab and go on the way into Muni, too.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "An old friend of mine turned me onto Ken's place. The coffee's are always terrific and the aroma's of the flavored coffee's are just outstanding. I order on line and I've never been disappointed with my selections. I'm amazed by all the different types of grindings they do there too. Great place if you love coffee !!", "author": "Dr. Val S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Such a great shop. so many great coffees to choose from. \n\nThe service is very good, and they can help you choose just the right morning brew for you, and they're glad to help. \n\nLots of teas, too, and coffee equipment as well.\n\nEnjoy", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "Nutella Soy Latte BEST EVER!!! \nAwesome service with a smile as well =)\nI swear by this coffee stop on my annual trips!", "author": "Malia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "You don't get better than this in either coffee or service.  Have been buying my coffee here for 25 years.   It's just the BEST.", "author": "Cynthia E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "Family owned coffee shop. I come here now to buy freshly ground coffee. No more of that commercialized stuff you buy from the grocery stores. Every time I come here, I'm welcomed by the fragrant aroma of coffee grinds. For $7.50-$8.50 a pound, you're getting a great deal, fresh coffee, and supporting a local business. You can also be adventurous and buy a half pound of a new coffee you would like to try. I recommend Sumatra dark for coffee lovers.\n\nThe owners are fabulous and always welcoming!", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "These people are so nice and they have excellent coffee at great prices.  I can get a pound of Ethipian decaf for $12, and Guatemala/Mexico/Colombia for $10 (compared to $16 at Cole).  They make excellent coffee drinks and have both soy AND almond milk for lattes!  They also have a nice assortment of baked goods and pastries, including vegan & gluten free (had an amazing vegan/gf brownie last night with my decaf almond latte).\n\nThey are always friendly and efficient - two people at Castro Coffee can handle a queue of customers more quickly than 10 people at any Starbucks or Peets!  Everyone is happy!", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "My favorites here include: \n-- white satin mocha w/ almond milk: true to its name, this drink is velvety smooth. Consistently sweet & well made. \n-- Jamaican blue mountain: half the price of philz & just as exquisite. \n-- Black Forest frappe: cherry, chocolate, icy, & sweet. \n-- Turkish: my go-to when I'm in the mood for a bolder, richer coffee flavor.\n\nSuper friendly family runs the joint. They keep the long lines moving quickly. \n\nIf I made coffee at home, I'd come here for my beans. There are always, always customers asking for a pound of Sumatra or a pound of Columbian to be grounded. Fascinating! Since I'm not a grown-up who makes coffee at home in a coffee maker, I'll keep lining up for a cup of this & a cup of that.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "There is a huge selection of drip coffee here, an even larger selection of coffee beans by the pound, and this place smells incredible. They also have lots of sweet and savory pastries to choose from, including vegan options and meat options.\n\nTheir empanadas are particularly hearty, & I was surprised and satisfied with the amount of meat they actually put in the chicken empanata --which, instead of being microwaved, could definitely be tossed in a toaster oven to get the outside texture crispy. Still good nonetheless for the price.\n\nThe people there were also very very nice. :-)", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "Why does this place smell so good? It has this rich, chocolatey aroma that you can smell outside. Not all coffee places smell like this. (Starbucks smells OK, but not \"I want to shove this up my nose\" good.) I'm a coffee neophyte; please tell me which coffee to order. My friend suggested that perhaps it's actual hot chocolate that smells like hot chocolate. But I don't want hot chocolate. I'm imagining a rich, dark, fragrant coffee with a touch of brightness (acidity?) Not sweet exactly. Not a flavored coffee. Help meh.", "author": "Rosie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "Family owned business. Just come in a couple of times and they'll remember your name just like that.\n\nA massive selection for morning coffee, ready for taking.\n\nI have yet to try their coffee beans just yet, but seemingly is a popular destinations for locals.", "author": "Jan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "It's time for me to call the store Castro coffee and order my Arabic coffee with extra cardamom cause I'm almost out, their coffee is the first thing I look for in the morning, it is just right, delicious and gourmet, the owners are very sweet, and employees are friendly.\nMerry Christmas and happy Holiday\nThanks for being in business", "author": "Concise I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "This place has a lot of flavors to try from, and the selection is very impressive. I, for one, am a Four Barrel type of gal, so I didn't appreciate the bold flavor of the coffee that I ordered (Tanzania). Tastes too burnt to me.\n\nGreat service, though. I really can't ask for any better from the guys behind the counter. This is just my personal preference for coffee. Sorry!", "author": "Dianna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "My hubby would differ and argue Philz around the corner is the best coffee, but I stick my grounds that Castro Coffee is as good if not equal.\n\nTheir North Beach Blend is just heavenly, but their very own \"Joe Black\" and take it black is \"orgasmic\" and organic!!  If you are looking for a coffee bean that they don't have, they will try to get it for you.  Isn't that great?  \n\nService here is phenomenal.  It is again small like most of the merchants here in the Castro, but there is an area in front of the Trolly where they've made permanent seating so you can savor your coffee and delicious sweets with a great view of passersby.", "author": "Nate L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Love this place.  I've worked with coffee for years, and theirs is always good.\n\nAwesome selection, and they'll even grind in chickory for you so you can make a New Orleans style brew at home.", "author": "Chase P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "I love the owners/managers/employees at this coffee shop! Super sweet people!! Coffee and pastries are always delish! Its all about the love and positive energy that makes a place special! And of course the quality of products.. They go hand in hand. Thanks for the coffee Mister!", "author": "Samira N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "I love this little coffee shop.  Fantastic bean selection, they are open late, and always have a great selection of pastry. The macarons are beautiful, petit fours, canelés - food choice has really become elegant.", "author": "Sandra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Last time I was here they also sold cheese. I used to love their drunken goat cheese. I grabbed a few bags of beans and now I'm wishing I had some because I've run out...boo :(", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Castro coffee... yummmm. Small family-owned business with that mom and pop feel. The owners are absolutely wonderful. Lots of tasty treats and tons of different specialty coffee flavors. I've never been disappointed trying new flavors. You can literally smell the fresh coffee grounds and pastries half way down the block. My absolute favorite in SF.", "author": "Shaina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "The staff is always friendly and engaging and fun, and the Turkish coffee here puts all other forms of caffeine to shame!", "author": "Etoile F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Came in this morning for some caffeine and something to munch on. Left with a peppermint latte and sausage burrito. \n\nLatte: amazing flavor, perfect temp. \n\nBurrito: not over the top, but it was satisfying and it kept me full. \n\nI recommend their coffee for sure!", "author": "Sophie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "Look no further: this is the best coffee & tea destination--end of story. The most knowledgable and the most friendly around. :)\n\nExcited for the outdoor seating coming soon!", "author": "Alana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-19", "description": "This is a review for the pre-made coffee.  It seems like various folks buy the roasted coffee beans to go, and they enjoy it - Maybe I should try that, but I haven't yet.\n\nThe pre-made coffee is generally watered down and uninteresting.  But for $1.75 for 16oz, it's cheaper than basically anything else in the Castro.  And it's alright.  But I'd rather go to Starbucks and get a full flavored coffee, for $2.10.", "author": "Jon E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "Best. Nutella. Latte. Ever!\nI had to get right into their highlight because seriously it's so good I couldn't wait. Yes it is damn near impossible to ruin Nutella but Castro Coffee Company does not rely just on the awesomeness of Nutella to deliver a good product. Their coffee is delicious as well and each drink is crafted with love. I love how the smell of coffee and flavored coffee is so enchanting and delicious. For a small business, they have an EXCELLENT selection of beans, snacks, and beverages. Conveniently located next to the Castro Theater and the Castro MUNI stop, you should definitely stop here and try a Nutella latte or whatever coffee beverage you like before you stroll or shop in the Castro.", "author": "Andrea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "This is one of my favorite places to get coffee anywhere. They have a fantastic selection of fresh flavored and unflavored coffees. Right next to the Castro Theatre, you can't miss this place the smell of Wonderful Coffee emanates onto the sidewalk.", "author": "scott h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Family owned, tiny and convenient but not a convenience store. You will be shocked at the selection, prices, and quality. Most Coffee's here are roasted by the owner and are available in any roast you want.  I've always felt at home here and almost feel like a family friend sometimes. \n\nIf you need a hand brewed coffee, or somehow think that every coffee is best when hand brewed with mint indiscriminately crammed into every cup, you know where to go, and enjoy paying 3x as much. This place is in the business of making good coffee, not just a buck.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "They take the fuss out of coffee! Sometimes you're not in the mood for this is the best thing to happen to coffee since like 37 seconds ago and the beans were roasted two hours ago by Alia from Dune and and and.......Sometimes you just want coffee. And they have frequent buyer cards buy 10 get one free which I love as long as I remember to bring it! $1 for BYO mug! It's less expensive for them to make my coffee than for me to make it! WHAT?!\n\nI can't wait to try their cookie butter.", "author": "Megan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "This new Chocolate Orange flavor is to die for! Please keep it!", "author": "Irina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Definitely the place to stop by if you want a great coffee in the area. I always order an espresso, so you get to know the real taste of the coffee, and this one was good. The cinnamon caramel roll was delicious.\nThey also have a huge selection of coffee blends, and the service is great.", "author": "Uri S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "This place has been around for well over 20+ years! Need I say more? Well, I will! Ken (the owner), and his employees are all about Customer Service! If something isn't right, they WILL fix it to the BEST of their abilities! I have ALWAYS been pleased with these folks and I recommend giving them a whirl, if you haven't already done so! :-)", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "So so so so friendly and helpful, they're willing to make anything you can come up with, and they have an amazing and flavorful selection! Will be back!", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "The only place we buy coffee. Even their takeout coffee is better than any of their competitions and it's 1/4 of the price. The owners are the nicest people ever and it really is a neighborhood establishment.", "author": "Anastasia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "\"Orgasmic coffee.\"\n\n\"I guess that's why it's in the Castro.\"", "author": "Meg T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "My daily morning coffee joint - I either order a dirty chai soy latte or a soy latte and they make it perfectly. Flavors aren't too overpowering with the espresso, making a great blended cafe drink. \n\nLove the family that work there as well - genuine, nice people whom I can easily make conversation with without it being forced - especially early in the morning before my commute to work. :))", "author": "Angel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "The \"Cheers\" of coffee shops - if you come here enough you will know the names and stories of the whole family...and all the other regulars who stand in line.\n\nReally awesome beans by the pound for reasonable prices and a great place to get breakfast and a coffee to go.  \n\nDinged a star for having inefficient lines in the AM...but this can be easily mitigated by having exact change and throwing it on the counter with a wink.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "Great coffee and great service. The quality of the coffee and the hands on owners make this place a real gem. I love walking by and smelling the delicious roasted beans. Staff is very friendly.", "author": "Caitlin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-25", "description": "Passion\n\nNo, not that type of passion. Pervs. Well I can't really blame you guys if you read most of my reviews.\n\nThe passion I'm talking about is when someone loves what they do. You can see it in the way they present themselves and speech. I've noticed recently people telling me that I must love my job, since I talk about it so much and learn more about my job than what is required.\n\nSame goes to Castro coffee company. The selection is huge! Price is cheap for the quality. And they can grind the coffee beans to your preference. Ken and Dalia knows their stuff. Got a question? Ask them and they answer with a smile! Keep up the great work!", "author": "Q L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-18", "description": "BEST COFFEE IN SF HANDS DOWN.\n\nWhoever said that Starbucks is just as good is brain dead or had their tongue removed or was born with no taste buds. \n\nSeriously, the best coffee I've ever had--from the beans I take home to the specialty coffees I order. I rave like a madwoman about this place. My first cup had me right then and there--perfect in every way, no kiddin'. I don't know why I haven't Yelp'd it before. \n\nSmall place, nice employees who were friendly and helpful, GREAT sale prices on whole beans (which they will grind for you if need be). Large selection of beans. Clean shop. They also have a small selection of teas. \n\nThe smell here is incredible!", "author": "Bianca U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "What is not to like about this place... without a doubt, this my favorite coffee shop in the city. \n\nLets start saying that this shop has the most variaties of coffee you could ever ask for, pretty much any type of coffee bean, from all the different regions you could imagine. If can't find it here (which I doubt), I'm sure you can put an special request and they will definitely get it for you!\n\nThat aside, let me tell you about the service. It doesn't get any better than this. The shop is ran by its owners (Ken and his wife), which by the way are some of the nicest people I know. I am regular at this place, so I've known these people for a while now and I have not stopped coming here since the time I got my first cup of coffee.", "author": "Jorge G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "The place is sexy. The sweet Italian roast is always so nice and warm in the bag after they grind it for me. The empanadas  chicken are delicious! The staff is funny and flirtatious. An all around winner for me! Thanks for doing what you do with passion!", "author": "Chas A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "Great quality coffee for a good price!   Bring your own regular size container and coffee is only a dollar.  The workers are nice too.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Great coffee drinks, the regular black coffee is a little pedestrian.\nGet the buy 10 get one free punch card.", "author": "Frank H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-04", "description": "Their French Roast is without a doubt one of the best I have ever tried. It is a dark coffee not bitter, and with a robust flavor that smells so great that prepares you for the unexpected every morning. It is heavenly !\nI love the Castro Coffee Company. I just wish I had one around the corner,\nI sometimes have to be without it until someone brings me some.", "author": "Dennisse B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "After a much needed break, I've decided to come clean and announce to the world that I'm done with the Man. Hidden under his corporate identity, that plastic smile, endless promises, gobbling up every sweet young thing that appears on the block, grinding every morsel in a calculated & ever-measured manor; he just doesn't get me. He may know my name, a little back story; but he doesn't appreciate me, or what I've done for him. He's always looking for what's next. I'm moving on. I hate to be so public, but Starbucks, I've found a new guy. He's stable, been a pillar in my neighborhood for years, and he deserves respect like I do. Ken, I'm all yours. #shoplocal #castropride #coffeemyway", "author": "Bradley R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "I like all the different varieties of coffee. I've triex seversl and cant figure out which I like the best. They also have pastries but I haven't tried them.\nI have had a breakfast burrito from there and its good.", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Local go to stop for morning coffee before work. I work a few doors down so this place is very convenient. The owners/workers there are always super nice and provide a very authentic mom-pop shop feel to it. The shop provides what you would expect in a cafe: hand-made and drip coffee, pastries/donuts, specialty drinks, etc. I typically go with the daily special drip coffees; there are always 8 options to pick from. They have a wide range of beans from Hawaiian, Ethiopian, French, Italian. It is an inexpensive alternative to nearby Philz ($1.25 for the drip, $1.75 for the pour over). I don't even know how many different types they have in house; I would probably guess about 30 different type of beans. If you're ever in the Castro and need a quick cup of coffee, this is your best bet!", "author": "Jimmy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Delicious coffee and breakfast sandwich for less than 6 bucks?! Best deal in the 'hood by far. To top it off, the staff is super friendly. I've only been in here twice and already feel like a regular!", "author": "Rhiann H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "The Castro Coffee Company is a small, storefront coffee bar that sells bulk coffee beans and a good variety of espresso drinks. The shop seems to be operated by a mature couple who are polite and enjoy the coffee business. Nowadays coffee shops seem to be run by young people as the standard, but the service by mature people isn't bad at all. And they seem more industrious than bored. The latte I ordered was flavorful and of quality, and was ready in probably less than a minute. They are located in the Castro section of San Francisco with a number of other cafes and bakeshops. Definitely worth a try if you are visiting the neighborhood, or if you've fallen asleep on the F Line, you can hop off here and have some coffee.", "author": "Blandie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Best coffee in the Castro!  Great family owned business for well over 20 years.  Even when my job location changed I took the longer route to work just to get my daily fix.  Now that I'll be leaving SF I'm going to truly miss Ken & Abeer and especially Dalia!   A great selection of to-go coffee.  Amazing selection of beans for home and great sandwiches and pastries.  See you guys again when I visit!", "author": "Jeffrey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-04", "description": "I came to San Fran with hopes of having an Anthony Bourdin sort of culinary adventure and it did not disappoint. Since I did not bring my daughter with me I was able to enjoy the amazingness that is caffeine and the Castro Coffee shop made it all worth while. Their nutella latte was the most delectable coffee I've ever had. Hey Castro Coffee, can you open a location down in San Diego? I think you would beyond kill it down here. I highly recommend this place to anyone who wants delicious coffee at a good price.", "author": "Ana N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-11", "description": "Cute little coffee place on Castro Street. Great location. The coffee was nothing special to me, truthfully. It was fine, don't get me wrong, but nothing about it made me want to rush back every time I'm in the Castro. I'd be just as happy at Starbucks or Coffee Bean, and I think I prefer Philz around the corner.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Great service, awesome options, super nice people work here. It was freezing outside and I wanted a hot cocoa. It was really good and decently priced.", "author": "Tacia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "This is my favorite coffee shop! I feel like I'm going to see family when I stop in even though I am pretty new to the shop/city. The coffee is delicious. And it's only $1 if you bring your own cup! But that always makes me leave a big tip so it all evens out :-) If there was space to sit and hang, this would definitely be the spot because they are so friendly and cool.", "author": "Kalina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-22", "description": "Can't say I've had the best coffee of my life here, but it's nice to see local shops still thriving in a horrible economy. The service could've been a little more upbeat and a smile never hurts.  The iced chai tastes like sweet milk (oregon flavoring) but other than that the coffee is strong and get's you through the day.  The selection is vast and I'm sure they know their stuff so ask away.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "This is my go-to place for coffee beans. The owners are really nice, the coffee is really good and well priced. Excellent all around.", "author": "Just R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "This is my favorite coffee shop in the city! It is now a crucial part of my daily routine, and I stop by every morning to get the perfect double cappuccino.\n\nThey have every type of coffee you can imagine, and they make great recommendations to help you discover new coffees that you will love. All their prices are extremely reasonable too.\n\nThe staff is super friendly and make it a pleasure to return time and time again. Overall, highly recommended, and beats your generic coffee franchise hands down.", "author": "Armon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "I just realized that I haven't posted a review for Castro Coffee Company (aka Castro Cheesery).  This is where I've been buying my beans for many years.  They have a big variety to choose from, their beans are consistently some of the freshest I've ever bought, and their prices are so low I don't know how they manage to stay in business.  I'm sure glad they do, though.  The folks who own the place are friendly, knowledgeable, and eager to help.  (My standard order is a pound of French Roast and a pound of mixed decaf Italian Roast and dark Moka Java.)  Peet's, Four Barrel, Ritual, Blue Bottle, Philz--y'all are nothing to sneeze at; I'll continue to hit you up for a cup of brewed, but when it comes to buying beans, my heart belongs to Castro Coffee Company.", "author": "Earline A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "Right when I walked in it smelt like heaven! Such a large variety. I got the dirty chai which was perfect to my liking's and the pastries are delish!", "author": "Hailee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "Pound for pound (excuse the crappy pun), the best coffee you can find in town.\n\nWhat they serve might not compare to Blue Bottle or Stumptown, but when you get to know the guy there, he really treats you well. I walk in and it's a buck for a 20oz of organic fresh brewed whatever you want. Much better than the $3 you'd spend at a boutique shop like Blue Bottle.\n\nThe selection of beans to buy by the pound is unreal. Whatever you want, light or dark, earthy or citrus'y, they can get it for you.\n\nI don't even remember his name (I'm so bad at that), but the older bald gentleman is one of the nicest people I've met, and that says a lot for a guy who has to deal with cranky people in the morning.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "I'm embarassed that I haven't written a review of this great Castro Coffee spot. One morning, I saw a line-up down Castro Street while I was breakfasting at the Cove.  Little bit later that day, I went by for some coffee. What I found was some tasty coffee, but also a friendly welcoming staff. I had someone join me during one of my trips and he had one of thier pastries and proclaimed it being one of the best he ever had ( this was in the evening , after I'm sure they've been out for a while)\n\nI've really gotten to enjoy the coffee from there. So much so that I now alternate my monthly coffee purchases ( between here and another Castro coffee location) and get to enjoy it now each morning.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "$6.50 for a pound of house French Roast beans. Good value! Good coffee! What more do you need to know?\n\nAlso a great place to pick up your coffee and tea making accessories-well priced replacement parts and supplies. A super nice family runs the Castro Cheesery. \n\nEven more useful info: Open Sundays 9am to 8pm, every other day 8am to 10pm.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Just updating. Love this coffee. I order every few months. I order one day and receive the order the next day. The fed-ex people are always jealous because they have to drive around smelling this wonderful coffee in their trucks.", "author": "POD P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Never seen so many coffee bean varieties ever in my life. Great aroma in the store and friendly family owned business atmosphere. Its a 'grab and go' ( not sit down' ) kind of place.", "author": "Zita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "Frankly, when one of the other reviewers here gets all orgasmic about the quality of the coffee beans, I'm, like, \"uh, yeah, sure.  I guess so.\"  I don't have the taste buds of a sommelier, so I'm not really aware of the difference between great coffee and to-die-for-coffee.  In a pinch, or on the road, I'll be quite satisfied with Starbucks, although I'd somewhat prefer Peet's.  What I really want is the stuff brewed by Philip over at Ma'velous in the Civic Center, but the apparently \"to-die-for\" Stumptown beans he uses would be wasted on my more primitive home coffee-making setup.\n\nWhat is wonderful about Castro Coffee Company *isn't* the beans (or the ambiance), but that it is a splendid example of a well-run small business that provides excellent value and service within its niche.  There aren't all that many places where you want wander in and ask questions about variations between roasts and beans, and still get a great deal on very good beans.\n\nFor the dozen or more years that I've been shopping here (yeah, I remember the cheese), the folks behind the counter have always been friendly and professional.  \n\nThis is an excellent business.", "author": "Richard W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Amazing ! Family owned and operated. They remember your name and your coffee!! Better than affordable .!! Support local .. Support no pretentious !! They are awesome!!", "author": "Jason P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-26", "description": "Store owner accepts homeless people into the tiny and cramped shop which makes it even that much more unacceptable. The homeless apparently are allowed free coffee, whenever they want, with their smelly and dirty hands pressing on all of the coffee carafes. One morning I tried to order an espresso and empanada and was verbally assaulted by a homeless man in this shop. Unfortunately after that I had to leave without getting what I had come in for. I don't want the homeless getting free goods and dirtying up the place in a coffee shop where I am expected to pay up and endure their unsanitary presence and loud verbal profanity. ESPECIALLY when he place is the size of a shoebox.", "author": "Haliegh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-04", "description": "This place is the new name for the Castro Cheesery. EVERYTHINNGGGGG is the same except for the name which I personally like more :P\n\nThis now the ONLY place i buy my coffee beans because only they have GREAT quality beans for a super low price. I usually get one pound of Arabic Coffee with extra Cardamom(turkish ground), one pound of Triple Dark(drip ground), and one pound of Red Sea(drip ground). They also have one of the BEST latte's i have ever had in my life. I put a tiny bit of brown sugar in a small latte and it was literally heavenly. It was smooth but ROBUST with flavour and the brown sugar adds a nice slight caramel taste to it! Their drip cofffee is seriously unrivaled. Also, if you walk in the right time, Ken will be there and his great service along with his unrivaled(i seriously mean it) Barista skills can make a cup of coffee that you will try so many times to recreate and it'll be good but not like his! i still to this day try to brew a cup of drip coffee with EVERYTHING the same he uses and i still cant make it taste the way he makes it.\n\nLONG STORY SHORT: Best beans in town for the best price. Look for a man named Ken and he will make you a unforgettable drink with a smile and great attitude + service!", "author": "Hubert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "The hubby and I strolled in here for a cup of coffee after eating a great meal at Catch. We were spending the day in SF although we reside in San Jose. I was very happy with the soy white mocha I ordered, but more importantly, the owner was very friendly and knowledgable about the different kinds of coffee. We purchased the Kona Golden at his suggestion, and we are soooo glad we did! It is amazing..no acidity, just very smooth. We are big time coffee drinkers who drink ALOT of coffee daily, so this was a nice surprise, and I think we are hooked. We now have an excuse to drive from San Jose to SF a little more often : ) The best part though, was the owner offered the hubby a free cup of coffee on the way out, which was very gracious and shows he has hospitality. We will definately be back!", "author": "Rowena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "Got off the 24 at Castro/Market and needed a little pick-me-up, thought I'd swing on over to Castro Coffee. \nGot myself a latte, and let me tell ya, it was pretty good. (TIP: put a scoop of brown sugar in it) \nI also got a pound of Black Joe Organic coffee for $9.95! What? Great price, GREAT coffee. \nThe place is tiny, but the variety of coffee they have is HUGE. \nHighly Recommended!", "author": "Ashlee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-09", "description": "5 stars for 5 reasons:\n\n1. Friendly staff who help you out when you tell them you're not a coffee drinker (more espresso)\n2. Makes my walk to the subway smell much better\n3. Sale of cheese\n4. I can support a local business\n5. Latte was delicious!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Love this place.  Great coffee, great location, and amazing petits fours!!", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "One of the most needed cups of coffee ever. One of the best cups of coffee ever, a smooth and potent americano.\n\nThat worked out nicely.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Excellent non-fat latte at an excellent price, with good sitting out in front.", "author": "Carl C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Been frequenting this local coffee store every 2 months for +15 years ... initially when I lived over the hill in Noe Valley, and still for the last 8 years, even though I have since moved to sleepy SanBruno. Just cannot find another shop with such a tremendous selection of beans, and fantastic prices to boot!! Plus it now gives me a reason to come into The City!  A very cool n true hole in the wall!\n\nA few months ago, I had the great pleasure to meet the owner, Ken. Had a wonderful chat with him. His courteous staff is just as great! They never have a problem when after buying my two 1/2 lb.bags of joe, I polititely ask for a small sample of whatever os brewing that5 day =D\n\nIf I can make one helpful suggestion though:\nFor the many blends they carry, if they can post on the labels what kinds of beans the blends are comprised of. After 15 years, it still escapes my mind what is in the JimaJoe and what makes up the FogLifter !!", "author": "Greg F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "I tried this place for the first time about two months ago, and I've never looked back. That was when they served me the most delicious white mocha I've had *in my entire life*. Seriously. Since that time, I've tried many different coffees there, including some of the ready-to-go/self-serve coffees by the front door. Not once have I been disappointed.\n\nI've also tried some of the pastry items and sandwiches, and they are top-notch as well. The breakfast burritos (which apparently come from Sonoma Muffin Works) are particularly good, and I would highly recommend the sausage or the black bean. The empanadas are fantastic, too. Whenever I'm in the Castro, I always make a stop here, whether I need a coffee fix or not.\n\nThe staff is always pleasant and helpful, and they seem genuinely appreciative of my patronage. They've stolen my business from Starbucks for good!", "author": "Shawn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Service is so nice here great coffee and reasonable prices plus they are really good at recommending coffee for you", "author": "lyn m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-24", "description": "Let me start by saying I've never had a cup of coffee from here.\n\nLet me move on to saying that they sell the best beans I've ever used for espresso at home, Aroma di Napoli.  I have tried beans from pretty much every retail source in the city.  The only beans that come close are the ones I get occasionally from Cafe Vita in Seattle.\n\nThe coffee I make with the beans rivals my favorite cup of espresso in the city, from Trouble.  I would probably love the coffee here too, maybe I should try it, since I think they use these beans for it.\n\nThey couldn't get the beans for a while and I thought I would die of coffee mourning.", "author": "Spike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "Try the White Chocolate Mocha.  And then come back and thank me.\n\nYou're welcome.", "author": "Lux P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "I walk by this place every morning when I walk to the Muni. It's a small and unassuming coffee shop, with no place to sit--an order-and-go type of place. It's some of the cheapest drip coffee in the Castro--$1.45 for a 12oz cup--but it holds its own against some of the more popular, \"third wave\" coffee places in the city. I can't vouch for the espresso-based drinks, but the drip is fantastic.\n\nOn top of having coffee with great flavor and body, they also have a great coffee+pastry special for $3.25--and they don't skimp. The whole top shelf of pastries--which includes large scones, muffins, and the like--are all fair game. I got a maple oat scone with my coffee and felt full for most of the day.\n\nThis just might become my go-to coffee shop--whenever I don't feel like paying the money for Philz.", "author": "h o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Great service. Delicious coffee. Highly recommended!", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-14", "description": "A great location -- next to both a movie theatre and a busy MUNI Metro stop. Unfortunately, the coffee isn't super amazing. Not bad, but not amazing. At this place, I'd definitely stay away from the espresso drinks. Otherwise, it's okay.", "author": "Douglas P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-13", "description": "I love this place - get a hazelnut coffee every morning on my way to work. Fantastic service, great price, excellent pastries, great place to go. They also have excellent coffee by the pound if you're so inclined. They have all the loyalty programs too so you can get free coffee without a problem.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-09", "description": "The only place I've been able to find where I can get loose leaf Darjeeling tea (for making Chai) without having to pay an arm and a leg for upscale gourmet stuff.  Surprisingly you cannot find this at any grocery store, including bi-rite and whole foods.  Believe me, I've looked.\n\nHave not yet tried the coffee but always get my tea fix here.\n\nBike Parking: plenty of designated bike racks along Castro St right next to the Castro Theatre.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "Awesome place to get coffee in the neighborhood, very friendly and even remember your name after seeing you there a few times.", "author": "Sasha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-21", "description": "Stopped in this place a couple weeks ago while in the city.  My girlfriend grabbed a bag of beans for home.  When I asked her if she knew it was good coffee the guy behind the counter have me his personal money back guarantee.  I will be going back, but not to get a refund.  This (organic Peruvian) is one of the two best coffees I've had.  Even when it's ice cold it tastes great with no bitterness.  I drink it black, so I can't handle shitty coffee.  The place has dozens of bean types all over the place, feels like a fine cigar joint.  If you're in the city, do yourself a favor.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Another small local business that knows how to appreciate their customers, neighborhood and life in general.\n\nExcellent quality coffees, teas and edibles. Always a smile and friendly conversation.", "author": "J.B. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "I am in love...... I bought beans (sweet Italian) from here on Saturday morning, soooooo good. I'm definitely without a doubt going back here again. Actually today I was on their website exploring my options for next time I drop into their store.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-19", "description": "Does not appeal to me. Looks dirty and out of date. I would never buy anything here. I really don't care if it's a local business. This is only a to go shop by the way.", "author": "L. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-20", "description": "So I used to live in San Fran and this was my neighborhood coffee shop.  Oh how I miss thee Castro Cheesery!   So much so I have them ship their coffee to me out here on the East coast.  \nLove their Jet Fuel, Kenya AA and Southern Pecan...  yum!!", "author": "Naomi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-25", "description": "I regularly grab a cup of organic Joe at this neighborhood coffee nook. Unfortunately, it is grab and go, but I do relish my neighborhood walk to grab a cup here most days when I don't have time to sit down to enjoy it anyway.\n\nThe staff are lovely and professional. There seem to be two couples who own the place and serve customers with beans and fresh coffee. Their snack, cookie, and homemade sweets selection is very well thought-out. \n\nThis is a special place in the Castro with a long tradition and pride of quality you can sense each time you come in from those serving you. Best of all, I feel a genuine feeling of diversity promotion, from what seem to be the heritage of the entrepreneurial owners, the neighborhood, and all the individuals who come in to buy the coffee. This is what America is supposed to be.", "author": "G F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "nice place. nice people. nice coffee. how is it only 6.95 or 7.95 a pound for the featured blends???? before I moved here i was on vacation and my first cup of coffee in Frisco was here. Still just as good 20 years later.", "author": "stephan k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "Organic coffee for seven bucks a pound? WHAT'S THE CATCH??\n\nSomeone better let me know, cos I can't figure it out. There's the possibility that there IS NO CATCH, and that these fine folks do dole out top notch java beans for petty cash -- in which case, I'm rediscovering my faith in humanity.\n\nSince I never drink anything but dark, rich, oily french roast, their ridiculous variety is lost on me, but oh boy do they have variety, as in like \"jesus h what are all these kinds of coffee, where's me french??\" they even have that special magic bean that some bean picker picked out of an animal's poopies. That one is expensive.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-04", "description": "A good place to buy quality Havarti cheese.  Yummy.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-12", "description": "Ok, as promised, when my Caffe Roma ran out I trekked back here, and when you're actually in the market for coffee, it's pretty mind-blowing.  I counted a good 75 different types of beans, and being no expert, I consulted with the good shopkeep on what I should get.  He directed me towards a very dark blend called \"Private Reserve\" something or other (doesn't seem to be on their website).  At only $8.50 a pound, it was far cheaper than the Roma, and yet the flavor was far more distinctive--the kind of signature taste that used to be the exclusive domain of wine.  Plus, it was strong enough to tame my liberal doses of cream and sugar, yet was in no way bitter.  Dang, I think I need to go brew some more right now...", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "It feels nice to support small locally owned shops like this one.\n\nStopping into the Castro Cheesery, at the very heart of Castro Street, is a great way to get a cup of coffee, pastry and/or bagel before you do the much required Castro stroll. \n\nAlso a great place to get quality coffee beans for home brewing.", "author": "Mickey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "I LOVE the Castro Cheesery!\nFantastic coffee, great cheese and wonderful staff!\nI live in the Sunset district and sometimes will go clear across town to have their coffee. \nI am on a first name basis with the people that work there now because I've been going to them for almost 10 years. \n\nI have a high tolerance for caffeine but their coffee will keep me up for the rest of the day. It's as if their coffee is nuclear powered. \nMy favorite is the Southern Pecan. \nSouthern Pecan coffee with some cream/half&half and a teaspoon of brown sugar will have me wired for at least 12 hours. \n\nI highly recommend this place.", "author": "Larry J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "The four stars is for their coffee beans, which are excellent, not overly roasted. \n\nAlthough it doesn't have the niceness of Spike's outdoor seating, the beans are substantially cheaper at the Cheesery.\n\nGood place to pick up a cup of coffee before a film at the Castro.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "Stopped in a couple of times during my last visit, each time for Mocha frozen blended beverage - still as good as ever.  Also learned they ship their roasts and the pricing is quite reasonable for some of the more hard to find roasts carried here.  Still same great service as always. Cheers.", "author": "G M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Best coffee in SF!  They make my breve Americano to order and it's always boiling hot, just the way I like it!  I also get my coffee beans here and they are the best priced, high quality beans, about $7/lb. for my house French Roast!  Delicious!  Also, family run and very friendly and helpful, try these guys!", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-25", "description": "Castro Cheesery You are the wind beneath my wings \r\n\r\nFLLLLLYYYYYY AWAY \r\n\r\nSO HIGH UP IN THE SKY \r\n\r\nSO HIGH I ALMOST TOUCHED THE SKY \r\n\r\nTHANK YOU THANK YOU THANK GOD FOR YOU \r\n\r\nTHE WIND BENEATH MY WINGS....\r\n\r\nAhem, the coffee here is off the hook.  Try the cinnemon frangelico around Xmas next year, and your house will be a big toasty yummy smelly haven to whomever is around.... \r\n\r\n:)", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-01", "description": "I love this place. \n\nHow good is the coffee? Well, i work at a competing coffee shop a few blocks away and still I walk over to the Castro Cheesery and grab a cup on my break. And they give you a few good options to choose from. \n\nNothing wrong with a chocolate orange coffee every now and then (why so stuck up PEETS?). The folks behind the counter are always sweet and the store, while small, is cozy and clean. \n\nEasily my favorite coffee shop in the city.", "author": "Hector M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "Funny, I have shopping here for YEARS, and I have always referred to this place as the Castro Cheesery, even though I usually just buy coffee.  Get the Castro Breakfast Blend.  End of discussion - you'll never go back to whatever you were drinking before!", "author": "Marcus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-11", "description": "GREAT selection of coffees, Castro Cheesery makes me feel like I live in a small town.  \nBuy ten get one free and it's right on my way to and from Castro Station.\nBuy my beans there, and my morning coffee treat, and occasionally a little brick of havarti.\nThis is not a sit-down place, it is in and out make it happen with a smile. PEFECTION.", "author": "kerry a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-11", "description": "a huge selection of coffee. hot cookie+a cup of sweet italian from this place is the perfect combo", "author": "Louis O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-12", "description": "On a good day, you can smell this place all the way from the MUNI station.\nFragrant, savory, CHEAP coffee in San Francisco.  Who knew?\nThis and a little something from Hot Cookie always makes your night complete.", "author": "Jody A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-28", "description": "the castro cheesery understands me when i ask for turkish coffee ground with cardamom. Now,depending on the server or what they are providing, they either tell me i should grind it myself or add it in, but the fact that they GET me is phenomenal in itself.\n\nPersonally, i find most of their grinds to be too sour, but i have also bought all the coffee accessories i could ever imagine needing from them.\n\nTheir pastry selection sucks.\ni like this because it shows where their priorities lie - it's the caffeine baby.... the caffeine\n\nsugar is for pussies.", "author": "Domini A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "Love the CCC..Great staff, I have them blend and grind my brew....they have a local coffee, fresh and tasty.  If I have to make one complaint ...loose the plastic bags....other than that LOVE EM", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "The coffee selection is very good, and the prices can't be beat.  Every single person who works here is SO nice.  They also offer 8 different drip coffees every day --med/light roast, dark roast, flavored and decafs.  Sick of paying $4 for a solid cup of joe?  Me too.  $1.50 can't be beat.", "author": "lucky o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "The coffee is fine - nothing super special - but it's the price that brings me back. Only $1 if I bring my own mug! Perfect for my morning commute, and a much more sustainable routine than Philz, Starbucks, or Peet's. I haven't tried anything but the pre-made drip coffee.", "author": "Caitlin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Really good coffee beans at amazingly reasonable prices. Half the price of Peets or Starbucks, and at least on a par with Peets....way superior to Starbucks. One of the real gems of this neighborhood.", "author": "Boogee Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-27", "description": "The Castro Cheesery was the first coffee shop to ever make me a regular customer.  I used to come here at least once a week to restock on my bean supply.   It was not until I found their other location \"Bean Street\" in San Mateo that I made a transition to my new supplier.  Bean Street:  http://www.yelp.com/biz/Yh5g-AVAC7seV_awdZN2gw\n\nThe Cheesery has some of the freshest beans that  I have found in the Bay Area and are very reasonably priced.  \n\nIf you like to drink fresh, great tasting coffee\\ you definitely must try the Castro Cheesery.", "author": "Steve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-11", "description": "Well..It's all true. Love the way the service was given to a new customer like me. Thanks for the nice  caramel macchiato.", "author": "kennedy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "every time I come in here I am greeted with a friendly smile and a vast knowledge of their coffee.  \n\nThank you for being such a great local business!", "author": "Matt V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-04", "description": "I've stopped in a few times but I have to say I have never liked my espresso drinks from this place and it often is a bit slow. But I stop by before/after Castro Theater shows.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-24", "description": "Family owned\nBest coffee - Morning Rush and French roast R-O-C-K-S\n\nThat place smells so good I drool just thinking about it - who needs Pavlov - I've got The Castro Cheesery\n\nPrice can't be beat and of course they always 'top off' the bag just a bit - \n\nAvoid tripping on the homeless youth or crack heads who are patiently waiting for you just our side the door -", "author": "Marc G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-05", "description": "mmmmm, you wake up and want coffee...a few scoops of whole beans into the grinder, fine grind, uncover the lid of the grinder, smell the aroma of fresh Antigua dark roast...you scoop it into your coffeemaker with sleepy eyes, press on, hear it brewing, wait, wait....wait....and then finally.....the delicious sound of that last bit of oily, bright, rich percolating coffee empytying itself into the carafe....the last drips, telling you it's ready.\n\nIf you like coffee this much, there is a world of flavor waiting for you....", "author": "regina k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "Delicious coffee, huge selection, fast & friendly service, local and family owned. Love this place", "author": "Tim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-20", "description": "This spot always has a great selection of brew coffees (usually 8) which generally includes a couple of sweet flavors (hazelnut, swiss mocha etc...) Excellent for people with out of control sweet tooths such as myself.  They are always friendly and there is never a line.\n\nExcellent alternative to corporate starbucks.........I do have to admit i love a frappacino on hot summers day......you know the 5 or 6 of that we get a year.", "author": "Gabriel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-14", "description": "Always friendly service, I've never bought beans here but it smells great ... and the best coffee and iced coffee around.", "author": "Dana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "Maybe my favorite coffee shop in the city.\n\nAmazing selection, great prices and the staff is friendly, helpful and not snobby.  Everyday they have a special coffee at a reduced price per pound.  Happy hour from 2-5 gets you coffee for $1.  \n\nI only wish I lived closer.", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-21", "description": "Excellent!!! Great place to get a great bag of coffee beans that's not overly priced. Oh, and no attitude like at Blue Bottle, where I actually live 2 blocks away from and won't bother going  to because I want to hurt people every time I go there. This place is worth the walk :)", "author": "Brooke A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-16", "description": "Best place in the city to buy beans and coffee. Their prices are 30% below others. I stock up every time I'm in the 'hood. \nOnly one small bitch...a coffee shop that opens at 9 AM? What's up with that!", "author": "Craig S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "This is my favorite place to buy coffee.  First of all, it's within walking distance. And secondly, at $6.50/lb. it has to be the cheapest place to buy really good coffee.  \n\nI usually stop by on a Wednesday or Friday morning to buy a pound of whole bean French Italian roast.  They always top it off with an extra bit just to make sure that it's more than a pound and never less...  \n\nI always bring in my little dog in with me since there is really nowhere to tie him out where I can see him.  Usually one of the sons of this family-run business has a dog treat waiting when he sees me walk in.  \n\nOverall, this business gives excellent service, has good quality products for sale, and takes good care of the regulars.  5 stars.", "author": "Paddy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-04", "description": "Convenient spot when you got a half hour or so before your show starts next door at the Castro Theater and you don't want to walk too far away just to get some caffeination and a snack. Nothing fancy really, just some coffee that's better than plain decent. I have yet to try some of the treats they have in the shop--didn't even notice much else besides the pastries. If you want to use a debit card (not sure if they do support credit card transactions, but I'm fairly certain they do), be prepared to dole out no less than $5, as that's the minimum for that transaction type.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-03", "description": "This is my most favorite place in the whole Castro - for 15 years now I've been getting my coffee here. They have the best selection of coffee beans, the best recommendations and really good prices! Buy here, you won't be disappointed.", "author": "matthias B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-28", "description": "Been going to this place for over 10 years and to my mind, it's a fantastic deal. As with everything else, I've watched their prices rise from $6.00/lb for French Roast to the $9.50/lb I pay for Moka Java and $12/lb for the Red Sea blend.  Oh well, c'est la prix . The people that work here at genuinely helpful and kind if you're looking for advice on switching up or onto another type of bean.", "author": "EE C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-27", "description": "I've been buying our coffee from the friendly Castro Coffee Co. for many years.  The coffee is rich and delicious, fresh roasted, and very reasonable.  The owner is a really helpful man, and since I buy about 10 pounds at a time, today he made me a delicious latte, complimentary.  The roaster is Peerless, and I would say that's a good adjective for the quality and taste of this coffee.  And there are many choices of blends from all over the world.  It's a tiny place, but while you're waiting they offer a free cup of coffee.  Also have some delicious pastries that are difficult to resist.  And it's nice to buy from a local merchant instead of a huge chain that one finds on almost every corner.", "author": "Lary S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-13", "description": "There is a lot of cheese to be found on Castro Street and in the Castro in general. This place, however, really doesn't carry THAT huge a selection of cheese. Which makes the name choice curious. Because what they DO carry a huge selection of is coffee.\nI'm not a huge coffee fan though I've been known to partake in a cuppa joe every now and then. Unfortunately their coffee didn't stand out to me at all. What DID stand out was the least item you would expect: their breakfast sandwich. Seriously y'all. It was bangin'! It was like the Sisters of Perpetual Indulgence had met up with the entire cast from the Rocky Horror Picture Show in my mouth for a tea party.  Everyone was happy and there was lots of singing and dancing. The egg, cheese and ham was perfectly prepared between the crispiest and butteriest croissant. I just wish the pumpkin spice latte had been as good as (here is where you shoot me dead...) Starbuck's version. I'm just calling it like I see it! Prices were reasonable and at least my tummy was happy.  I just wish those bitches had staged a benefit in my honor while they were busy partying in my mouth. Cuz I'm kinda broke.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-22", "description": "They really should consider a name change, since their dark roast is more appealing than their Gorgonzola. The caffeinated aroma that wafts out onto the street is alluring, and the coffee lives up to the promise of its scent. Excellent prices on beans by the bag. If I'm going to invest in a hunk of cheese, however, I'd sooner cross the street and go to AG Ferrari.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-15", "description": "i've managed, over the course of 3 weeks, to develop a *serious* caffeine addiction, and the boys at castro cheesery are my #1 dealers.  $1.50 for a M coffee (choice of 6 delicious brews) really can't be beat in this age of shitty starbucks clones on every street corner.  \r\n\r\nso far i've had the timor dark, the sumatra dark, the kenyan dark (yeah i like dark coffee), the hawaii kona, and then also a caramel macchiato.  each was excellent and unique, and my buy-10-get-1-free stamp card is filling up fast.  \r\n\r\ni haven't had the cheese but one of my co-workers swears by their bagels and cream cheese.  also, i'm sucker for personalized service, and now that the friendly baristas know me by name, i think i'll me hooked for life!!! :)", "author": "Roshni R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "It's more of a coffee and tea place, though they do have cheese and sandwiches.  No seating, it's all to go.  They have excellent coffee and great pastries and sweets.  The toasted marshmallow latte and peanut butter chip brownies are especially decadent.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-07", "description": "i like the castro cheesery.  \n\ni have occasionally purchased cheeses here but nothing too spectacular.  \n\nprevious yelpers have it right when they say this place is all about the coffee.  it is.\n\nenormous selection, friendly, quick service and decent prices are why i keep coming back.", "author": "Noah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-16", "description": "We get our coffee beans here.  They are always fresh, and cheap.  Only 6.95 for a pound of whole beans, with a large variety to choose from.  We've had French, Columbian, Vienna Dark, Guatamalan, and the Castro Breakfast Blend.  They have all been very good and fresh.  The staff is always helpful and friendly.  Never again will we buy beans at a grocery store (peets=11.95/lb and sbucks=8.95/lb)....this is much better and fresh!", "author": "Corey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-08", "description": "This place is TINY and AWESOME.   I go there every week to get my pound of coffee.  The place is family owned and they are really fast and really nice.  Plus, they have some nice selection of cheeses in the case (hence the name...).   If you live nearby or are in the hood, def. stop by to check it out.", "author": "Annabel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "We ordered the MOST amazing turkish blend coffee that came with its own spices in a separate bag in our delivery. After mixing them in, my friends were delighted and pleased with their coffee. Stunning.", "author": "Bill F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-18", "description": "I adore this shop. I like to 'do my marketing' on Castro street, smiling at the people I know and feeling like I'm a neighbor, scoffing at the tourists & meth-heads. 2 years ago my friend helped me move into the hobbit-hole, using her station wagon. Grateful for the help, I offered any comfort I could provide, she opted for a european breakfast, provided by me. So off to the cheese shoppe. upon ordering my cheese, the purveyor complimented my taste in cheese. He now has me in the palm of his hand, forever. Coffee? The Castro Double Feature!   mmmm buzzz", "author": "B.dot P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-10", "description": "It's called cheesery, yet this place is all about the coffee.  Yes, it's all about the coffee, but they also sell some pretty damn good little pastries.   This place is one surprise after another.", "author": "K W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-01", "description": "This used to be my neighborhood coffee shop and I absolutely love the coffee here. Sweet Italian blend is my favorite.  It's family owned and they are so friendly - it's a great way to start your day.  I still haven't found a place to top it.", "author": "Elizabeth P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-31", "description": "Best coffee actually on Castro if you avoid the flavored ones, ick. Much nicer than Rossi's across the street, both the coffee and the staff.", "author": "patrick g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "Walking around the Castro on a recent visit, I was passing by the Theater and smelled deliciousness emanating from the coffee shop next door.  I went in as I remembered a friend had recommended the place and was impressed immediately by the huge selection of whole bean coffee available.  Not only that, but the selection of fair trade and organic was one of the largest I've seen outside of Seattle.  I ordered a pound each of the Mexican Organic and the Moka Java and both tasted amazing.  At $8.50/lb for each of them, the price was great.  The place was staffed by a very friendly person who was great in explaining the difference between the dark and light roasts available for the Moka Java (dark being more flavorful but with less caffeine).  I didn't order coffee as that was the first day of my cold but someone in front of me was raving about their latte.  I tried to check-in on Yelp and was shocked they weren't on there so thought I'd add them.   Check this place out next time you're in San Francisco.", "author": "Tony R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-04", "description": "5 Stars because your coffee rocks and you are an independent coffee shop...support your local merchant PEOPLE.  Quick, friendly service and a great \"go to\" place when you need to buy cheese for a party.  It's really about the coffee though.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "Cheapest, most flavorful coffee in the Bay Area... with Peet's and Starburnt charging $12+ a pound, paying anywhere from $5 to $7 a pound is smart and delicious. My experience with the staff has always been sterling, even if they occasionally appear standoffish. Never gotten any cheese there,  but love the coffee.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-16", "description": "Best deal on good quality coffee beans.  Well worth the trip to the Castro.  Friendly and helpful people too.", "author": "Iris J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-09", "description": "This place isnt a cheese place anymore, it's a coffee place. I think even the sign says castro coffee or something such as that. Anyway, ive always seen that they have breakfast sandwiches, right near the muni stop, very convenient, but I never went inside till yesterday, when I was on my way to a museum. J and I went in to grab a quick bite.. I got the spinach empanada with a small soy chai latte, and he got a breakfast sandwich on a croissant with a small mocha latte with soy. Wow. We could have gone to the grocery store and baked everything ourselves in shorter time. Mine was already made, all she had to do was microwave it. I thought she was done with that and ordered my tea, but didn't realize she was still on that, and hadn't even started the sandwich. By the time these four items were done, there was a giant line behind us. This woman moved in super slow motion. I felt really frustrated. I realize it doesn't have to be a fast food pace, but I would seriously have to TRY to move as slow as she did. She also was not responsive to things like hi, good morning... I felt like I fell into a slowness time warp, but didn't know if it was just me. After we left (in which time as I was paying, another employee popped in and rung up a guy's coffee bean order during the time it took her to ring up mine..she was that slow), I asked j and he was just as incredulous about the slowness as I was. As was our friend a, who was waiting for us outside. Those four items were $16. My food was ok, not bad, not good. My tea was not the best ever but pretty good. J thought his coffee was very good, the sandwich was kinda bleh with runny eggs. There is a huge variety of coffee beans there, so if I was a coffee person, maybe I'd come in for that. But if you're looking to grab breakfast in the morning, go someplace else. You'll miss your train, be super late for work, age 50 years, and only get a mediocre bleh meal for it. Maybe she was having a bad day, who knows. :)", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-19", "description": "The best coffee in the castro, these boys know how to pull a shot. The cheese however is suspect, and is best avoided.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "If you love coffee you can't walk past this place and not step in for a cappuccino or a latte. The smell is irresistible and the coffee lives up to your expectations set by your nose. Although I had an excellent latte I was intrigued by their huge variety of coffee and cheese counter. This place is also very crowded and not for lingering.", "author": "R C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-27", "description": "Mmm for that coffee. Try the organic fair trade rocket espresso... it may convert the tea lovers to coffee fanatics in no time (it did me in!)", "author": "Anika K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-20", "description": "Fast and friendly.  Always a large selection of coffee, and many on special.  They also have a fair amount of teas, and associated paraphernalia.  I make it a point to come in here when I'm in the neighborhood to pick up my coffee supply.  It seems to me that while there are still some unique cheese offerings here, that the coffee portion of the store is dominant.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "Tasty blended coffee available here.  Still wonder about the odd nomenclature though as their cheese selection paled in comparison to the bean choices.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-03", "description": "Such good coffee. I didn't even think that they actually had cheese. It is super tiny so please do whatever you can to make more space, take off your backpack before you come in, or better yet don't walk in and just stand in the middle. These guys are really  good at what they do and it dosen't cost an outragous amount. It's my favorite coffee in the castro. If they ever have the pumpkin again, get it. I usually hate flavored coffees but this rocked my world.", "author": "Autumn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-16", "description": "Tiny place. Great array of coffees and cheeses, fairly priced and even for coffee-on-the go, for the busy busy busy it's fantastic, my usual stop most mornings. Def a yes.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "OMG what great coffee, what great proces. I am so in lust over that unwashed Costa Rican.", "author": "Razza M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-31", "description": "Great house coffee!!  I like this better than the burn't coffee at Starbucks!", "author": "Jay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "Been doing business here for almost 30 years. A family business and one of the oldest and most trusted and respected businesses in the Castro. Wonderful to do business with. Love the decaf French roast the European Royal is THE best brew I've ever tried.", "author": "Jon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "It's hard to find good, affordable bulk coffee. I don't much like the Trader Joe's options but I really like the selection of coffee at the Cheesery and usually try something new along with my very affordable staple, the Italian roast. I usually pick up some cheese and a biscotti, too. The owner is very nice, too.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "Great place to get coffee.  I get my own special blend of coffee done and it only costs $10.50 for a pound and a HALF.  Take that Starbucks.", "author": "Rick R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-07", "description": "This is the nearest coffee shop to my new place. I walked by figuring I could stock up on some coffee and get some cheese for a small dinner party I was attending. I asked the counter person which organic dark coffee he recommended. There were signs all over for organic coffee at $6.50 a pound. He recommended one that looked to be $8.50/ pound. After he ground it for my espresso maker I asked to get some Brie. Nope, they only had Havarti and 2 other cheeses. What!? Only that. Fine. I'm ready just the coffee thank you. That will be $11.99. Excuse me!? The sign says $8.50. Counter guy came around the counter and showed me no, that in fact that $8.50 sign was for another blend who's name was hidden behind some kind of choco bar box. Well, what can I do now, it's already ground, I want to leave. So I hand over my card. No apology, no offer for a free cup of coffee. No nothing. I had expected to pay about $7/lb for coffee, left $12 poorer and without any cheese. While the coffee was delicious this morning, it wasn't blue bottle.", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-09", "description": "The stench emanating from this place is so strong I can never get past the door.", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-09", "description": "How can you say anything bad about this place? It's tiny and cramped and usually there are lots of people in there - but don't be overwhelmed - the staff are so nice and patient, so take your time picking from the huge selection ask questions and browse the other goodies that are literally stacked to the ceiling. Despite the name, the thing to go for here is coffee. (The cheese is good too!) Cheap coffee, deluxe coffee, in-between coffee, standard coffee, custom blends, fair-trade coffee, organic coffee, and all combinations of such adjectives. I usually get a pound of fair-trade to ease my concience for the other pound of pure indulgence. My sister in-law lives in LA and orders by mail and it still works out reasonable. They have unusual imported cookies, snacks, pastries, espresso drinks, and hard to find coffee accessories (e.g. Chemex filters). Great place for gifts if you have a coffee fanatic in your life.", "author": "Kingpin X."}
