{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Great coffee and very cool people in there. We need more bespoke, authentic businesses like this in the Bay Area. Bypass Starbucks, people, and have a real experience at Cento.\n\nOh, and for all you whiners out there: NOT cash only any longer.", "author": "Nico v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "I'm always on the lookout for good coffee and cento is a great little hike in the wall spot for that. Service was a bit slow since there is only one barista and one cashier. They recently added some benches for outdoor seating and it is also next to the public parklet next to little skillet if you want to meet up with folks or need a place to sit.", "author": "Betty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Love this coffee!!!! The best ever and NEVER bitter. I like Philz too but, sadly (and $ wastefully) I've gotten bitter cups even there. I can honestly say in my 2 years of finding Cento I've never been disappointed. Super SMOOTH!!! \nOf course being in a little alley way off-the-beaten-path place you won't find bathrooms here... but in SF it's got to be hard for business owners to offer bathrooms and keep them clean. Most of the businesses in this area just simply can't offer restrooms because they get trashed. I've seen it over and over again. But if you eat lunch next door at Little Skillet it's delicious and you'll have a clean bathroom.", "author": "Sharon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Situation\n- Coffee and chocolate croissant on a Saturday morning\n- I was there to look at some old scooters before a classic scooter ride\n\nPros\n- The coffee and croissant were good\n- The staff was friendly\n- A nice little outside seating area\n- People are allowed to park their scooters in the small driveway\n- Great decor of old scooter stickers and small paraphernalia", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "CASH ONLY.\n\nBarista was friendly, entertaining, and full of knowledge of the little shop. It's a tiny shop for sure, but with a ton of raiders and motorcycle memorabilia. Basic coffees, no frills, and delicious pourovers. You can't really go wrong here because they also have their own roasts.\n\nI think this is a great spot for getting your quick caffeine fix before making your way over to ATT park.", "author": "Lorrie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "My mid-day coffee break go to!!! If only that was an adjective. Good coffee, pricier than usual Starbucks, like a brewed coffee is $3.50, Cappuccino is $4.", "author": "Tania C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I've been coming to Cento since they opened up in 2008, generally twice a day/everyday I'm in SF.  One bad habit is that I don't tend to yelp my everyday places so this review is long overdue.\n\nAfter Blue Bottle stopped selling beans to all other cafes including Cento, the owner John started doing his own roasting and I have to admit liking it better, so now I buy bags of Cento beans to take with me when leaving SF.  \n\nThe cafe is pretty straightforward, no Wi-Fi, a small bench or table is put outside sometimes or can sit on the dock across the street, modest pricing and cash only.  The baristas are all great and manage the drinks well when it gets busy.  \n\nGreat coffee and a great atmosphere is why Cento is basically the break room for the entire neighborhood to stop in for a drink and relax a bit.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-20", "description": "1) Still cash only (in the 21st century)\n2) rudest staff in town \n3) most ignorant (about the product and anything hanging on the wall, be it music or engine related)  staff\n1+2+3=perfect for hipsters who know very little about coffee, music, or engines.", "author": "Winter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "This is my favorite San Francisco coffee bar. The espresso is rich and beautiful. They make wonderfully textured milk drinks too. Great service, great coffee.", "author": "Luke R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "I asked for a flat white and I got a dismissive \"that's a cappuccino.\" Er, no it's not.\n\nCoffee itself was burnt, they need to learn their trade.", "author": "Mark N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-19", "description": "After all my Yelp searching for coffee places near the Caltrain station, I finally got a chance to try Cento. Previously I hadn't come here because I knew it was a tiny little shop, more of grab and go coffee. Fortunately that fit the occasion of waiting for a few friends and keeping myself occupied until then.\n\nCento serves Blue Bottle Coffee, which is always great. The baristas are curt but friendly. There are some pastries on display. And it's all cash only. This place is super simple. Get your coffee, and go to work or catch your Caltrain. Nothing too special about it.\n\nThere's also no seating inside, just space to wait around for your beverage, but there's a public parklet right outside, which is a recent addition in the past few years. Even there, it's more standing space than seats, I'm guessing to prevent homeless people (or even non-homeless people) from overstaying their welcome. Perfect for answering a few emails on my laptop and buying time. Yes I would come back here again for the purpose of grabbing coffee and continuing on my merry way, though I don't think it's anything to particularly get excited about!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "In an alleyway, cool tiny shop, few spots to sit outside.  Decent enough brew.  Staff seemed sort of unapproachable, not very friendly.  I feel no need to revisit.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "The barista here is so professional. His coffee tastes so deep and neat. The interior is FANTASTIC and area around here feels so calm and cozy. Guys, come and have some.", "author": "Changmin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "While occasionally you get some elitist coffee vibes, overall great spot in the hood and good coffee!", "author": "Jon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-01", "description": "I have loved everything on Ritch for years, and was excited by this addition for saving me from my office's nespress0 machine. But my second trip was a second barista making me feel like a jerk for justifying their Saturday afternoon hours. I'll be making the trek to blve b0ttle", "author": "Nathan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "Not having a bathroom at a cafe is a dealbreaker. I think it is unethical to sell beverages without access to a bathroom. To suggest Safeway or Caltrain for a bathroom is hella wack. Coffee is average. Service was kind.", "author": "Maxi R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "Came by for coffee the other day and was surprised that this coffee shop is located on an Alley! The coffee shop is tiny and has a handful of seats, if that inside and maybe 1-2 seats outside.\n\nOrdered an Iced Mocha and it was mediocre. As others have mentioned, their mocha was rather \"thin,\" although the espresso was good. \n\n...they only had paper cups for cold beverages...\n\nCash only. $4.5 for an iced mocha", "author": "Derek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "Best coffee in the area. Love the macchiato and the cappuccino. \nThe pour over takes a hot sec, so make sure you have time if that's what you're signing up for.", "author": "Rita K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "Very good, quirky little coffee spot on a San Francisco alley, Cento serves up excellent, strong espresso with more than a touch of attitude and perfection. \n\nHipsters, working digerati, mods and rockers alike will find this place appealing. \n\nI just like the coffee and the Brit and Euro-influenced decor.", "author": "Seth S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-04", "description": "Two employees were working this morning, a younger and older lady. The younger was helpful and pleasant (thanks!) but older one was horribly rude. \n\nIf she is the owner, she should definitely fire herself and sell the business today. No greeting, no eye contact, just took my cash and pretty much moved me along.\n\nWhen I tried to get a lid for my cappuccino she didn't even acknowledge I was standing right next to her waiting (she was restocking napkins or something) so I just walked out.\n\nTry to smile and serve the customers that support your establishment ma'am. Cool people open coffee shops to earn a living and serve their neighborhood because they love the culture. I wont be coming back if the curmudgeon is there.\n\nAlso they are a \"cash only\" place in SOMA but they have a rewards program on an iPad... really.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This place is a little hidden gem in SOMA. Great coffee, strong and creamy. I usually always have to put sugar in my coffee but not here because the lattes are so smooth as is. The only downside is that they are cash only and only open at 8 AM.", "author": "Antonia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Moved to SOMA/SB/Mission-Bay or whatever the latest realtor nametag is for this construction zone meets 60,000 Giants fans, with the newest \"Taqueria\" being a Taco Bell... \n\nAnyways, Where was I?  CENTO!  Best thing about living in this sledge-hammer neighborhood.  Quick in-and-out, great coffee, super nice peeps, and the place takes you back to the OLD SF (like 10 years ago!). \n\nThe only neg-neg is they don't take electro payments, hard cash only. The newest thing was the addition of a sidewalk sitting area, but whomever built that thing FUBAR'd it from the start! Just grab a great Almond Milk Latte and reminisce!", "author": "Mark K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Tucked in an alley. Bike racing stuff is stapled around in a tasteful and almost tacky way.  Like, ever go to a mock British pub in the USA and there's like the front end of a Triumph TR-3 hanging off the wall...it's like that. A bit much, but not too much. But hey, when it comes down to it, that was a great cup of pour over coffee.  Woohoo!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Super friendly, great coffee and croissant,  incredibly Tucked away but very handy for the train station. Hope they get enough for traffic to keep going", "author": "Jon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Once I get used to Cento, I just can't tolerate any other coffee shop in the city. They are the best. \n\nMy regular is Macchiato + Chocolate Croissant. Yam!", "author": "Albert W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Huge fan of coming here for coffee when I'm in town for work. It's a gem, tucked away on an unassuming street. \n\nThe coffee and baked goods are delicious. Nice staff and never too long a wait.", "author": "Kayla W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-08", "description": "I suspect the good reviews are for the Blue Bottle Coffee they serve, which is ubiquitous in SF and not really a big deal. but the attitude there will keep me from ever returning. I really don't understand the haughty vibe at some of the coffee shops in SF. you're making a cup of coffee not a chocolate souffle.\n\nI asked for a cappuccino, dry. and I was told they only serve their cappuccinos \"a little wet\" are you kidding me? I can't order a coffee the way I like to drink it because it offends THIER misguided sensibilities?!?!?!  there was no one else in the store, and they can't foam the milk for a few more seconds because of the way THEY think a cappuccino should be served? totally cool with me, there are literally a dozen other coffee shops within a few blocks of here that serve great coffee and are happy to make it the way I'd like it. \n\nI wonder if the owners even realize how many customers they lose due to their own attitudes. I'm sure they'll say they don't want customers like me, which is laughable. but I guess it doesn't take a ton of business sense to run a cappuccino machine.\n\noh and cash only which is also obnoxious.", "author": "Bob U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Good coffee! Location is bit like hole in the wall and hazard to find. But everything else is great. Remember they're cash only.", "author": "Anoop N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "It really pains me to write this review, but after being a regular customer I decided I have to share my experience and why I do not plan to come back. The initial visits started out well, and I love to try new things so I explored some options, and the coffee was always really good. The thing that is keeping me from ever wanting to go back is the service. \n\nUnfortunately this town is not known for stellar customer service (Bay Area native, and I've worked in SF for three years), but the service and attitude here is unheard of. I can honestly say I have never seen another place of business treat customers so poorly. I understand that it may not be a standard way you serve a drink, but I am the paying customer who would rather not be talked down to and told you can't accommodate. I get it, I've tried a few different ways of ordering to see how not to offend you while you offend me, but after this last experience I'm done. I'm pretty sure the main culprit of setting the terrible standard is the tall blonde-ish guy. The service has been semi ok when he's not there, but deplorable when he is. \n\nSeriously guys, I would come back in a heartbeat if I wasn't worried about being treated like crap.", "author": "Kelsi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-23", "description": "This is a hipster coffee snobs dream place. It's tucked away in an alley of a street, which i find quite charming. You'll notice immediately that it's cash only, so come prepared. I came at 8:15AM on a weekday and there were only a couple people in line - wait less than 5 minutes.\n\nI don't consider myself a coffee snob in the least, but I do know (and appreciate) that they use blue bottle coffee beans. I didn't want a fancy drink, so I just ordered a drip coffee. They use a pour over method, so your coffee is made to order. The flavor is quite good. I also ordered a granola bar which also tasted fresh. The 2 items set me back $5.25.\n\nThe space for customers is about 5ft x 5ft. No place to sit, and you'll probably end up standing outside to wait in line.\n\nReasons for the minus stars\n- Very quiet, serious atmosphere and staff. Stuffy almost.\n- Cash only (just keeping to my regular standards of star ratings)\n- No coffee sleeve, and it was definitely too hot to hold. BYOS (bring your own sleeve)\n\nBring your crazy mustache, plaid shirt, and bicycle- but leave the PBR at home.", "author": "Kailey O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "Imagine my surprise when I saw Zooey Deschanel behind the counter! Okay, just kidding. It wasn't really Zooey, but she might as well be.\n\nThat's the kinda place Cento is: the kinda place you'd expect to see characters like Zooey. You've got vintage decors covering the entire wall. Outside you'll find a girl in an oversized yellow sweater reading Steinbeck. On the other side of the road sits a red Vespa. \n\nThe vibe is perky, fun, and relaxing. I like it.\n\n\nPS. The coffee was also good.", "author": "Don L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-09", "description": "As other reviewers have mentioned, the good reviews here are probably for their Blue Bottle coffee, which is at tons of coffee shops all over SF and nothing special. I also want to point out that Cento is NOT a wholesaler of Blue Bottle.\n\nI could write paragraphs of commentary about the laughably pretentious and straight-up rude treatment of customers here. Or I could point out that a barista works in the service industry, despite ludicrous misgivings that a barista is an artist, or the authority on matters of subjective taste, or a generally terrible business person who turns away customers daily due to insecurity and self-importance. \n\nInstead, I'll just give an accurate and annotated transcript of the interaction I had here, and let the reader be the judge of whether this place is worthy of anyone's time. Since we're in the land of technology, I'll use // to signify commentary.\n\n\"Hi there. Could I have a cappuccino on ice, please?\"\n\"No. We don't do that.\" \n\n\"Okay. Then how about a cortado, to-go?\"\n\"No.\" // silence for at least 5-10 seconds\n\n// Surely this is one of those cheeky yet annoying jokes where a barista or waitress says \"No...\" laughs, and continues \"Of course! Just kidding.\" Alas, \"no.\" This was not one of those moments.\n\n\"Excuse me?\"\n\"No. We don't do those to-go.\"\n// At this point I'd like to point out that this place is basically a kiosk, with no seating room... not even a chair. \n\n\"Okay. Cappuccino.\"\n\"Yeah we could do that.\"\n\n//begin to pull out credit card\n\n\"Cash only.\"\n\n//I give up, leave, and buy coffee somewhere else. I also came here happy and left annoyed.\n\nSomeday, maybe the poor baristas here will make sense of their identity crisis. Maybe they'll learn that the goal of coffee sensibility is to make people good coffee. Or they'll learn that being in the service industry means providing a service to customers in a way that makes them happy, not angry and annoyed. Or perhaps they'll simply remember they're running a business, and get a hang of the whole \"provide a product... receive money\" thing. \n\nIn the meantime, go somewhere else. They need to figure it out on their own.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Really enjoyed my coffee here.  It's in a back alley but is clearly on the radar for many folks as the line was out the door.  Had a $4 latte that was quite tasty.  Baristas also were very friendly.  I'd come back again!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "This is a cute little coffee spot. Love their coffee here.. Good service and friendly baristas. They have a small standing tables outside. They're next to little skillet which is also a great place for food and beers on tap! Only thing with Cento is they don't accept credit cards but you just have to make sure you have cash if you want to have that cup of coffee. Their almond latte is really good! You will never know till you try.", "author": "Majell V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "Almost EIGHT years since my first review of Cento,  can't believe it.\n\nAnd it must be no coincidence, then, that today was also SUPER AWESOME DAY, like the day I had 8 years ago. In fact, it was one of the awesomest days I have had in quite some time.  But I digress....\n\nI still love this spot.  It's super convenient and they serve a mean latte.  They take their espresso and drip VERY seriously.  I like the little bar tables they have set up outside, and it's also nice to sit on the loading dock across the street on a sunny day.  Very SOMA, very SF, and very hipster. :D\n\nI had to dock them a star for no longer carrying soy, tho.  I'm not sure of the reasoning behind that.  I'm sensitive to dairy, and I don't like almond milk.  So be aware, soy lovers.", "author": "Josie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "Good coffee. Good service. But it's not spectacular, and it didn't blow me away with a special something. For the price they charge, I'd rather go to Sightglass or Philz.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Really excellent coffee and espresso. The cappuccino was one of the best I have had- the espresso had that sweetness that you get from a perfectly brewed shot. Not much other than coffee but they do have some pastries including croissants that I believe they make in house. Prices are pretty good- I think the cappuccino was under $4, which seems fairly standard; a shot of espresso is $2.50. I almost gave them 5 stars but for now leave it at 4 for these reasons: I wish they would stay open later, they are cash only (which I kind of get but still find annoying- at least have the option of letting people use debit cards or something if the purchase is over a certain price), and there is basically no seating options. Four and a half stars, which is the average rating they have is perfect. I would consider adding the final star if their pastries and regular coffee are as good as the espresso as well.", "author": "Seema U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Their almond milk latte is my very very favorite. It hits the spot 100% of the time I visit this place. I've also bought their beans for my espresso machine at home, highly recommend. It can be hard to find as it sits hidden in an alley, but if you're in the neighborhood, you have to stop here here. Make sure to bring cash because they don't accept credit cards. One nice story about their staff, we didn't have enough cash so they told us we could pay next time. How nice was that?! Of course we came back 10 minutes later once we got the cash we needed. :)", "author": "Samara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "SoMa gem hidden in an alley that most people speed by. Their macchiato is sublime, and, as a serious tea drinker my whole life, pulling me closer and closer to the dark side of coffee. I love it and I love they insist that you drink it there in a glass cup. All other drinks can be taken away though. Take the two-combo punch be combining a visit here with a bite next door at the Lil Skillet. Great staff too.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "The pour over coffee at this place is the best! The baristas are friendly, to the point that if you forget to bring cash (this place is CASH ONLY), they'll ask you if you live/work in the neighborhood, and then just tell you to pay them tomorrow without denying you your coffee.  Also, you get a small discount if you bring your own mug. \n\nThe decor inside is cute and fun to look at while you wait. There are no seats inside, as it is more of a tiny indoor coffee stand. But right outside, there are a couple of small bar tables, and an old loading dock, which gets sun in the afternoon, where you can sit. The shop is in a small alley, so you can just hang out on the sidewalk, and there's not too much car traffic. If you take your drink \"for here\" it comes in nice little porcelain mugs. The whole atmosphere is about as quaint as any you can find in this old warehouse district which can feel industrial.\n\nSo why 4 starts and not 4? Unfortunately, they don't carry soy milk and the almond milk tastes a bit like cardboard. Sad for us unfortunate lactase-deficient souls who can't enjoy the full range of espresso drinks - also fantastic here.\n\n5 glowing stars for the coffee, minus one for cardboard almond milk.", "author": "Cathy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-15", "description": "I went to this place while my boyfriend was at blue skillet. I ordered a non fat latte, and they ran out of nonfat milk. The only thing this place makes is coffee, so it was really annoying that they had a fridge full of whole milk and soy milk, no nonfat at 11am. The latte wasn't tasty either. The barista guy was rude and the service was poor. Won't be back. There are so many great places around.", "author": "Lyora Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "There's nothing more San Francisco than Blue Bottle Coffee served in an alleyway! Usually pretty crowded but these Baristas are pros, prepping 10 drinks at a time, so the line moves quickly. Seating is minimal to nonexistent at the cafe itself, but if you cross the street, the sidewalk provides all the multi-level seating you could want. Believe me, during peak hours on a nice sunny day, an open seat on the sidewalk is golden.", "author": "Clare B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "First cafe visit for SF and they really set the bar high. Milk texture was perfect and dosage was on point, great ratio. Staff were so friendly given they were under the pump, even took the time to write down a suggestion for me to visit. Do visit!", "author": "Chris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "I love Vega, the sister location of Cento, so I decided to try this place since I work close by.\n\nI heard that you can order anything you could order at Vega, which is definitely NOT the case. \n\nI tried ordering the Macau Iced (which is my beverage of choice at Vega), but they said they couldn't make it at this location. I was a little disappointed by that. \n\nThey made me an iced coffee instead, which is fine (still great coffee), but not what I was looking for.", "author": "Sasha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "Cento is awesome. It might take some getting used to if you normally drink sweeter coffee with syrups and flavors, but I can't imagine regularly drinking anything else.\n\nIt's actually not very expensive -- $3.75 (cash only!) gets you a delicious latte, and the baristas are more than happy to take requests for things like a half breve, etc. I appreciate the fact that the people working here are genuine and nice without being gushy. They all seem great and they know their stuff -- every cup I've had here has been excellently made.", "author": "Jaime S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "Small tiny place next to little skillet, but though thou is small, thou is nice and makes me happily caffinated.\n\nTheir menu for the most part is short and simple.  Lattes, espresso, Americanos, the sort. I tried the New Orleans iced coffee which they described as something cold brew, something chicory, something milk optional? It was good though and will definitely come back here again to try other items. Maybe for a coffee date with a friend. Yea, its that hip.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Solid place in the city for coffee. It's a hole in the wall but all it has to do is serve one thing well and it definitely does that! If you're in the area and need your daily fix or a quick picker uper then stop by this spot for that cup o joe that you've come to love!", "author": "Ander C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "Back alley coffee shop. I'm a fan :)\n\nI came here for a quick coffee run because the place closet to my office had a line out the door and I'm glad I did. The people behind the counter are super nice, and the Blue Bottle coffee is nicely done. My friend got a latte here and it was a nice touch that they made a design on top.\n\nI'm definitely coming here more often.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-20", "description": "Wake up and smell the coffee folks!  Get treated like crap and charged a fortune for super average coffee, and WAY below average mocha?  Go back twice and you deserve every drip!\n\nSnotty dufus employees, guess that explains the crowd they draw!", "author": "Skot M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "Great place to grab a quick cup of coffee in the area. The drip coffee is just right. Also love the fun coffee cup art they have hanging. Also, how can you go wrong with Little Skillet right next door?", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Good espresso. Cash only, but the staff are super nice. It's in a dumpy alley; they seem to have regulars. Only 2-3 spots to sit, but worth a stop if you need coffee. \n\nFriendly staff and good coffee!", "author": "Sneha P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-22", "description": "These guys are great. \nBut then again, I'm comparing them to coffeeshops @ home in Seattle.\nminus a star for only 12 oz drinks\nminus a star for cash only - my thinking is cash only drops the price...not here.\nAlmost no seating. \n\nConsistently pull good shots. Know how to correctly pour a drink.\nI can tell they care about the quality.\n\nBut I still don't get the only 12\" coffee drinks here in SF. \nI've inquired about this but I don't really get substantial answers.", "author": "Dan-O -."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Great coffee. The girls working were really polite and friendly. Definitely a little hipster type of spot, but it's very comfortable at the same time. Cash only so be prepared! Overall great place, right on my way to class. Love that it's in an alley", "author": "Jen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Tucked away in an alley, cool little coffee spot that makes a mean latte.", "author": "Kathryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "I'm originally from Portland, OR and I find this to be a similar experience. I like the coffee and the unique feeling. The place feels like its about the coffee and not much else - which to some may be a turnoff, but to me feels pure. Anyway, glad its in my work neighborhood.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Blue bottle coffee served here.  Breve cappuccino done right and there's a secret menu item for non coffee drinkers: hot chocolate.  Cash only but there's an atm within arm's reach.", "author": "Ronald L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-07", "description": "Nice staff, cool atmosphere, but a mediocre mocha.\n\nThe mocha was thin and watery; not a lot of flavor and it had that grainy feel that you get when using cocoa powder or an inferior syrup. I'm going to try their latte or cappuccino next time.\n\nThe staff and clientele were cool and friendly. I also liked the decor. The location is a little out of the way and the signage is not great so look for the pizzeria sign and it's right there to the left.", "author": "Donley P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "Caltrainers and SoMa-dwellers rejoice, this is your spot.\n\nYelp led me to Cento one day when I was trying to catch a pre-train coffee, now it's a commuting staple for me. \n\nThe coffee here is delicious, certainly on par with the true blue Blue Bottle locations. The baristas are friendly and great at their jobs. \n\nThe shop is in a quiet alley that somehow feels more homey than sketchy. The interior is tiny, so you take your coffee to go or sit outside. \n\nThe crowd is way-techie. Not sure what you were expecting in this part of the woods. \n\nI like that it's next to Farmerbrown's. Consider getting some chicken+waffles to wash down your coffee.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Cento and their team rock. I used to work super close and would go almost every day. Now I drive out of my way to come get a perfectly dripped cup of blue bottle.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "I've been to Little Skillet, but never to this cafe. It feels like a secret find when you approach it and step inside. The person working the cashier is really friendly.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "Pretty good coffee and espresso. Not unbelievably good, but decent quality tasty coffee. Cash only. I've been in the mornings around 8:30 and 9:30am and there's not too long to wait.", "author": "Jake N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "Love this coffee shop.\n\nYes it's a nook in the wall and sometimes there's a line but the coffee is great and the people who work there are great.", "author": "Mira K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-20", "description": "I crave Cento lattes in the mornings. They use Blue Bottle Coffee and it is SO full of flavor. Cento is on an alley street, Ritch, not too far from the Caltrain Station. It is the perfect stop for Caltrainers to and from work! When you walk in, you are greeted with hip music. It is SO Norcal here. They have a sign that says, \"HELLA CLOSED\" with a sad face for when they are closed for business. I normally think the use of \"hella\" is really stupid but it is so fitting for this place because it is SO Norcal so in this case I snickered a little and thought, that's awesome. If you take a look at the wholesale section o Blue Bottle's website you will see that Cento is the featured wholesale partner of the month! This place is LEGIT!", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "From the start, you can tell the coffee is going to be good by the way the barista take their time preparing your the coffee. Next indication is the latte art, typically  that means the coffee wasn't just thrown together they took the time to get it right. Next the taste.... ahhh. I always order just a cappuccino nothing more nothing less.... Unless it's a 2nd cup", "author": "Zon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "What better way to wash down my meal of fried chicken & waffles (and pulled pork & grits) at Little Skillet next door than with some Blue Bottle coffee?\n\nI like my coffee strong so I got a macchiato (http://www.yelp.com/biz_photos/vN62LU8SPRThy_Qr0WnR5A?select=GBKCz14wo8sUn-zZf41SVQ). (Straight espresso is a little too hardcore for me.) The espresso was complex, intense, and not too acidic. The splash of milk toned it down just enough and made it *almost* perfect. I say \"almost\" because it also cooled the drink down a little too much. Unless I'm planning to sneak it into a theatre in my pocket à la Kramer, coffee should be hot hot hot!", "author": "Steph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "Shamazing. That is all.", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-13", "description": "I am so sad to say Cento is now dead to me. Went there this morning with a co-worker (we work down the street, and visit here at least once a week) for a cappuccino and we both walked out totally appalled by the attitude of the guy at the register. He was openly rude when we asked for a large cappuccino (\"no, they are only available in the small size\"), so instead we both went with a quad latte. When we asked for a bit of extra foam, we were looked at like total idiots and informed that \"this isn't Starbucks, we have a different method of steaming milk and don't generate foam.\" Then, just given a blank stare until we passed over our cash. The barista was cool (and I think felt super awkward by how rude register man was) and the coffee was good, but I won't do them the disservice or bothering them with my business again.  I worked for Starbucks as a manager for years - I understand how the equipment works, I know the difference between milk steaming methods, and I don't need to be made to feel unwelcome more than once in a place like this, especially with all of the other amazing coffee options around.", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-21", "description": "It's a small spot, but the coffee is REALLY good. I got a latte that I can only describe as being masterfully crafted and satisfying. The salted peanut butter cookies are ridiculously tasty too.\n\nThe people who work there were cool and knowledgeable about their product. I work in the area and this is my new favorite coffee spot. \n\nCASH ONLY FYI", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "I love this place. I think it's the best coffee in the area. Hidden in a little street, you need to know that it's there. Then again, that's what Yelp is good for, right? \n\nThis is not a place to go to sit down. It's run out of a garage, more or less. There are no chairs or tables. It's a get-your-coffee-and-go kind of place.\n\nThese guys are quick and make great lattes with Blue Bottle Coffee. They are friendly and try to get your in and out quickly, while keeping you happy. Oh. And their croissants are great.\n\nMy only wish would be that they open earlier than 8am. Granted, this is SoMa, land of the startup, and so usually no one shows up in an office before 9 (more like 10). But me, personally, would love some early morning coffee.", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "The case: went to primo patio around the corner and dropped onto Ritch to eat. Decided to join the cento skillet crowd for an afternoon brew. \n\nThe score: macchiato, blue bottle $2.75\n\nHanging out in this little alley of the city reminds me of the vibe and chill nature and charm of this city. \n\nMacchiato served in a baby sip cup on a platter. Cute. \n\nNice relaxing hiphop/ lauryn hill playing on the speakers outside\n\nThe getaway: up and back to work a block away. Supercharged and ready, thanks cento", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "I love this place.  Almost every afternoon on week days there is a coffee train from work that heads to Cento.  The staff is the sweetest.  I know, this place is uber hipster BUT I don't care!!!!  They serve Blue Bottle Coffee and this coffee is always sure to please the palate.", "author": "Erika S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "High-end 3rd wave coffee shop. Best in the area.\nNot a lot of seating, closest thing to an Italian espresso bar around.\nCash only is a negative, although that is authentic...", "author": "Adam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "Cento is my local neighborhood daily caffeine provider. It's where I sneak off to when I need a break from work. It's a hole in the wall, it's sometimes crowded, and every so often they have a service fail. But what it lacks in refinement it makes up for in deliciousness.\n\nBlue Bottle coffee is prepared for you by (mostly) swift, knowledgable, and passionate baristas. Throw in a couple of \"secret\" menu items, a stack of deadly slash tasty sweet things (baked fresh daily by one of the baristas), and a great assortment of clientele standing around sipping and chatting and you have a solid little coffee joint. Order yourself an espresso and they'll offer some gratis sparkling water to go with it. Have something \"for here\" and sip on it outside while you people-watch. Or just grab your fix and run.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-19", "description": "Serving Blue Bottle is pretty much a guaranteed 3 or 4 stars.  I enjoy Cento as a hole-in-the-wall coffee spot, but I've been somewhat disappointed with the service.\n\nThere's usually a horde of people waiting for their coffee, but Cento doesn't do a very good job of letting people know whose order is whose when they're ready, and I've gotten unpleasant service a good chunk of the time I've been there.\n\nI rarely if ever base reviews on service, but here I've been more annoyed with it than usual.  Nowhere near enough of a reason to stop coming here, but something that knocks my review down a notch.", "author": "Will A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "\"cento\" is san franciscan for \"authentic\"\n\ntucked away in an alley, this modest coffee counter slangs the best brew I've had in SF. these baristas are armed with blue bottle beans, comprehensive caffeine knowledge, and sharp wits. they pull drinks with personality equal to those behind the counter - try the cold-pressed iced coffee or a mocha latte - genuine, not saccharin. \nthey recognize the (many) regulars and show them love.\n\npro-tip - there's a special off-menu drink that packs a punch. you'll have to ask for it by name. \n\nhaters:\nyes, they're cash only. they don't take your plastic money because it's not real, you capitalist pig. \nalso, they pull double shots, because they assume you can handle it. \nfinally, the artists might be curt with you. but, believe me, it's worth it. they've honed their espresso-slinging skills and mastered their coffee craft such that a little side glance is a small price to pay. besides, what is a coffee spot completely devoid of attitude? starbucks, that's what.", "author": "KC G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Cento rocks. Good coffee, and lots of cool things on the walls to look at and wonder about while you're waiting. Of course, like all cool coffee shops, the staff is well versed in Black Sabbath.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-25", "description": "Asked for an espresso to go and the man told me he \"can't\". Only an espresso for here or an americano to go. \"can I get an espresso for here and the paper cup then?\" \n\nHe says \"no\". I say one star.\n\n(By the way, I really like Vega, the other coffee place by the same owner. Service there is always better)", "author": "B C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "These guys use Blue Bottle beans, which is one of my favorites in the city. Their other location near me (at Chrome Industries) uses Four Barrel beans. Blue Bottle seems darker, richer while Four Barrell seems a bit lighter and smoother.\n\nThe staff is great, and the coffee is top-notch. They just get so busy at the peak times when I'm looking for coffee (morning, after lunch, etc.) that I can't wait through the line to be served & I end up going elsewhere.\n\nBut if you are in the neighborhood & have time, these guys have an excellent cap and coffee.", "author": "Tony K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "It is simple pure and perfect. That's what coffee experience should be. I liked the fact that they were so hidden and even reluctant to write a review (selfish I know). But now the secret is out they are crowded so might as well make my praise public :) I keep coming for more delish cups regardless of the line!", "author": "Viola B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-22", "description": "This is where I go to feel grown up...no seriously, I actually say \"I am going to get a grown up mocha\" and when I say that my friends know I must be going to cento.  \n\nCento has become a go to place for a few reasons...one I work in SOMA, two lately the smaller a place is the more I like it (and this place is sort of like a closet), the staff is friendly and they make pretty designs on the top of your latte, and finally because the mocha is not sweetened.  If I say I wasn't (sadly) surprised the first time I took a sip and the hershey syrup type taste i've come to expect did not register...I would be lying.  But after I stopped holding my nose as I drank it down (I mean its blue bottle prices, I was not going to let that go to waste) the taste actually got better.  An overwhelming sense of maturity came over me my body and I had an epiphany;  this must be what real coffee drinkers call coffee.  And by me being drinking it, I was suddenly in that group...\n\nAnd that is why I love cento.  (even if sometimes I have to add a little hershey syrup from the flask i keep in my purse)...", "author": "Kierstan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-13", "description": "Had a decent latte here after a bite at Little Skillet.  The mood was a little cranky, but since basically 92% of all baristas have a stick up their porta-filter, I didn't sweat it.  I was optimistic that a drinkable, non-corporate latte was available on my usual bike route to work.  \n\nTried a couple days later on the way to work.  It was 8:30 am, and they were \"open\". I was the only person in line.  As I walked up to order, the dude behind the counter looked at me, then lifted up his phone, and started typing.\n\nAnd typing...\n\nAnd typing...\n\nAnd typing...\n\nAnd typing...\n\nSo, I left.  I don't care if he was texting a antidote to rattlesnake venom to a rapidly dying friend.   Make eye-contact, and say \"one minute, please\".  Don't just ignore me, like I'm not even there.\n\nI'm sure Cento doesn't need my yuppie business.  But they obviously also don't need more of my yuppie stars.  I doubt I'll bother trying again, as I'm not planning on being cool enough to go there any time soon.  Sight Glass is just up the road a bit, which has 10x better coffee, anyway.", "author": "A B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "I met someone on the Caltrain who insisted on taking me here. The motorcycle decor was really cute as were the girls behind the counter. Very unfriendly though :(( I had the Cafe Au Lait which wasn't very strong in flavor and had too much milk. Perhaps the espresso is the way to go..and the cookies looked delicious too!", "author": "Aleena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "Phenomenal lattes at Cento. P-e-r-f-e-c-t five stars!", "author": "Ted R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "oh cento, you are super cute.  \ntucked away in a little alley and next to little skillet. \ni love that you serve blue bottle coffee just a hop and a skip away.  \nwhat i love even more are your homemade mint ice cream sandwiches.\nthose little fuckers are so delicious i made that my breakfast. \ni wanted to get a second but didn't want to look like a glutton.", "author": "Sally T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "Still perfect.\n\nLittle Skillet expanded into their original location. Now a door down and slightly bigger.\n\nIn the words of Markus Schulz: http://youtu.be/5JvwQM2_mos\n\nIn my own words: (Still) Small yet tastefully appointed space. Blue Bottle beans. Smooth and potent caffeine. Charming service. Unpretentious throughout.\n\nAnd still the ever so important nonfat milk.\n\nLocation might have changed. Perfection I yelped about three years ago has not.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Our schedules never matched, but I'd always rush here before closing when I could. My top preference to get caffeinated.", "author": "Monica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-04", "description": "Hipster, why you so sad? \n\nYou serve Blue Bottle, while also drinking in the aroma of fried chicken. \n\nI jest; this place is a quality establishment. Not \"service with a smile,\" but always caring, respectful, and committed to crafting a delicious cup of coffee that is outrageously clean on the palate.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-20", "description": "Oh.  My.  God.  One sip of their latte and I'm in heaven.  It's as good as it gets.  \n\nLatte, $3\nDrip Coffee, $2\nThe fact that it's not Starbucks?  Priceless.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-29", "description": "Cento is often mistaken for a Blue Bottle and it's not hard to tell why.  They serve Blue Bottle coffee, fly the logo prominently,  and generally stick to the same brew methods Blue Bottle employs.  One major difference, though, is that Cento typically only has BB's blends available for drip and espresso such as Three Africans or Bella Donovan.  That sorta bums me out because I'm more of a single origin guy, but I don't know if that's Cento's decision or whether BB doesn't offer those coffees wholesale.  Every now and then they have some Sidamo dripping and I try to take advantage of it when they do.\n\nI work nearby, so I often head to Cento either on my way to work or for an afternoon pick-me-up.  The espresso ranges considerably from very good to pretty poor.  I feel like sometimes the baristas there let the quality slide from time to time, perhaps by not dialing the espresso regularly or maybe even by not tasting what they're serving.  Similarly there was a stretch of several days where their water heater was either broken or misadjusted far too cold.  They served some seriously underextracted coffee as a result and I wondered if they noticed. I don't think they aren't capable of excellent coffee, it's just a very casual atmosphere that, apart from the attention to detail I otherwise quite enjoy.\n\nThe baristas are friendly and down-to-earth.  Atmospherically it's a kiosk caffe in a particularly cozy alley.  There's an area across from the kiosk quite well suited for sitting in the sun.  \n\nI like Cento.  I just wish it was a little bit more consistent.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "Excellent Blue Bottle coffee, good service, and a cool funky interior with awesome books to flip through while you wait. Me likey!", "author": "Niels J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "Definitely a hidden gem!  Super delish!  I ordered the Americano and a treat that was gluten free and tasted like a macaroon, coconut delicious treat", "author": "Richard N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "I was early for my appointment at the ThidaStyle Salon so I stopped in for an Americano... Super friendly staff and great coffee at a reasonable price. What more can you ask for? The only problem -- it's hard to resist the super tasty chocolate chip cookies they serve.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-28", "description": "I work across the street from here.  They are nice and let me take my coffee in a cup and saucer.  I love drinking out of proper glassware.\n\nI will have to try this New Orleans coffee everyone is raving about!", "author": "apple r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "A fast, early morning Blue Bottle stop on my way to work in SOMA. \n\nThey typically have good music playing while you wait (though you never wait more than one song). This morning I enjoyed a little Kanye West while waiting for my Americano.\n\nI've never had their food (do they make food?) or really anything else other than an Americano.\n\nThere's quite a mix of patrons. Some are hipsters heading to their job. Some are businessmen wondering why this place is different than Starbucks. Everyone tends to be in an early morning daze when I am here.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-06", "description": "Update: Ben + Kylie are officially the king and queen of Ritch St. Come pay your respects!\n\nCentro, meet Cento. While I'll always have love for South Park's Cafe Centro, the news that there's a new cafe SERVING BLUE BOTTLE COFFEE just off the loading dock of my building just made my month. I can handle anything May has to throw at me now that I can get BB again right outside of work. And in keeping with BB tradition of alley service (like the original location, or G'Vanni's), Ritch St. is ideal. You're welcome to sit on my loading dock and enjoy your java. Hallelujah.", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "This place is called \"Cento\"?! MIND. BLOWN.\n\nOh well, a Blue Bottle coffee by another name is just as effing delightful.\n\nI love their iced coffee... with whole milk and some raw sugar. Nom nom nom!! The coffee itself leaves a \"clean\" taste your mouth and you just feel so refreshed afterwards!\n\nIt's near my workplace, so it's perfect for a coffee break. The walk & the coffee make a fantastic duo for energy!!! Whoooooo!\n\nOh, and technically there is \"outdoor seating\"... on the sidewalk. But I think Yelp is asking for actual outdoor seating, so I said 'no.' (I think the sidewalk works... but I'm low-maintenance. Bwa ha ha.)", "author": "Jini L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "I liked the vibe and the people, but the latte was surprisingly not strong enough for me, and I generally don't think I need lattes to be particularly strong. I wouldn't go out of my way for it.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "blue bottle!   There's a secret menu ... anything you can order at the other two locations can be ordered here as well. \n\ngo iced macau!\n\n\njust don't get a coffee before eating at little skillet next door. No bathrooms around :(", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-05", "description": "Located right next to Little Skillet how can you say no?  I mean coffee AND chicken with waffles... I think I just died and went to heaven.  I'm a big iced latte/coffee fan so of course when John, the owner, offered me a Centino I couldn't pass it up.  A little bit of a macchiato with simple syrup... amazing.  It was smaller then expected but for $3.00 I couldn't complain about my experience. Keep it up Cento.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "Best cup of drip coffee in SOMA, tucked away on Ritch. Worth waiting for a minute or two if there's a line.", "author": "Julie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-17", "description": "This is my first experience with Blue Bottle Coffee and I have to say I am impressed. I ordered an espresso and the crema on it was fantastic. My friend got an iced latte and I thought it was okay, nothing too spectacular. This place is great to order something from when you're waiting for your order from Farmerbrown's Little Skillet, right next door.\n\nI think its a solid coffee place, but I would only be here when I was getting something from Farmerbrown's Little Skillet.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "While thiss place is a little disorganized from an ordering standpoint, they make a hell of a coffee and it's literally a hole in the wall.  Pretty rad if you ask me.  Now that I'm working near by, I'll def make this a usual haunt.  So far I've only had the drip coffee, but it was very very good.\n\nOverall pretty killer really.", "author": "Nicholas N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-13", "description": "Let's be honest and put aside all prejudices against people in vintage glasses and skinny jeans who take coffee seriously so we can just admit that Cento freakin' rules. They serve Blue Bottle coffee for fifty cents less than Blue Bottle does, they're right next door to Little Skillet, and they can't kick you out for loitering because the only place to loiter is the alley way.\n\nIf you want to sit down and check your eBay watch list while licking the whipped cream off of your mocha, Cento probably isn't for you. If you want someone to cup your privates and wipe your upper lip with a paper napkin while you take seventeen minutes to decide what to order and then get confused that there's no \"order here\" sign, maybe you should go across the street to Borders. However, if you want to enjoy properly roasted coffee that has been properly brewed for you in an individually prepared manner, please, go to Cento everyday. You will not be disappointed.", "author": "bo h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "2010 Update: I had to remove a star for poor service. Normally I don't care about service -- as long as I can order something, pay for it, then receive it. Order, Pay, Receive Goods. You would think my bar is set pretty low but the newest staff at Cento can't always pull that off. Coffee is still the best though.\n\nMore updates! One, a drip coffee is now $2.50 so that's a 25% increase but is apparently in line with what the Blue Bottle mother ship charges. Two, I have been successfully ordering and receiving my coffee lately! Three, this morning I also got coffee grounds in my cup. Cento is still a HOLD at four stars.", "author": "Ian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "They serve no bullsh*t Blue Bottle coffee here. They take a lot of care when making your coffee. I recommend the regular drip coffee ($2.50) and the New Orleans Ice Coffee. I've heard the lattes are good. \n\nLocation is just a window in an alley so there's no seating/wifi but hey, it's better than starbucks. Great for all you coffee snobs.", "author": "Brandon O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-02", "description": "Yummy, yummy, yummy coffee - and delicious cookies! Super cool spot, and friendly staff. Just make sure you know, cash only!", "author": "Mia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "NIce low key cafe in an alley - easy to miss - they must have moved into this space because some of the pictures for their store front look different - not much by way of tables and chairs - but friendly knowledgeable staff behind the counter - good coffee.", "author": "Ketan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-08", "description": "I'm a regular due to proximity, but the coffee is just average. It seems to be made weaker than other Blue Bottle coffee houses, losing most of the body along the way. The service is surprisingly gruff for a little joint that could be a lot of fun. A welcome and a smile once in a while would go a long way.", "author": "Jan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-17", "description": "This place is gold.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "I just love this place.  Yes, it's tiny (no seating), cash only and occasional lines.  But the line moves, and the store interior is entertaining as hell while you're waiting.  Above all, it's first rate brew pulled by an incredibly nice staff.  Friendly hipsters! I never thought I'd live to see the day!  And even the pastries are shockingly good.  Bravo, Cento!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-10", "description": "Someone recommended I have the coffee cento today.  Amazing.  Just a great cup of coffee.  They used Blue Bottle coffee but took it to another plane of caffeine existence........... Boosh!", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "This hipster coffee shop hidden in an alleyway is definitely a gem for all us web 2.0 geeks that work in the South Beach area. This is the perfect place for one to get a quick caffeine fix. Actually this is my favorite place to go in the South Beach for a great cappuccino. And one can't ask for more: amazing espressos, Blue Bottle, tasty cookies, and nice laid-back respectful service.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-17", "description": "How I've gone 4 1/2 years working across the street without ever knowing this place existed is a mystery. Nevertheless it is now my go to coffee shop. They're fast (as fast as freshly dripped coffee can be served), friendly and the coffee is like heaven for your taste buds. \n\nIf you've never experienced Blue Bottle Coffee do yourself a solid and try a cup today. Start off with a simple cup of drip coffee ($2) so you can really appreciate the complexity of their bean's and drip process then move on to their latte's or mocha's or the New Orleans iced coffee on a hot day. Simply delish!\n\nIf only they opened before 8am....", "author": "Kristy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "I love this place.  A perfect place to escape from the busy hipster spots on the weekend.  Killer espresso and drip.", "author": "Matthew W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-05", "description": "If I could give them 1/2 star I would give it just for breathing. I am a business owner in the neighborhood and a client wanted an espresso so  I thought hold on I'll go get you one ( this is after years of referring people  to this business).  Walk in- just a little attitude , but hey it's expected they have 4.5 stars so they have throw some \"tude\" or it would not be SF.\nOrdered a single espresso - response \" we only sell double \"espresso\" OK can I have a double espresso to go please? Response:\" we only serve our double espresso for here\" .  Can you please put the double espresso in the 8 oz cup sitting right there, response : \" we don't serve espresso in these cups\" Really people. Your a walk up window .  No sh*t!  For here, where?  No I am sorry I am not one of those idiots who thinks it cool to linger in a rat infested alley sipping my double espresso while standing or sitting on the curb.   Come on SF you can do better than this.  I remember once when this city had such a good food scene, not because it was cool , but because the people who supported these businesses had some sophistication and the business owners catered to their customers, not some pierced  coffee counter kid working for minimum wage who can't see past the BS.  \nFirst and last time I visit and never again will I  refer this business to my clients.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-23", "description": "I feel pretty lucky to work next door to Cento! I drink their coffee a lot, and it is consistently great. I used to always get their cappuccinos, which were creamy, rich and smooth. Now I'm a black drip coffee girl, which I've come to realize is much harder to get right since you don't have the fat of the milk to mask the acidity and bitterness. Cento always gets it right...I've never had a bad cup. The staff is also great, and they have a little bit of outdoor seating out front.", "author": "Shae T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-12", "description": "Blue Bottle Coffee extracted to perfection. \n\nThe ordering system is kind of strange. I'm used to paying right after i order. This place, however, takes their munniez after you pick up your drink. \n\nToday, I accidentally walked off with out paying. I'm so used to paying after ordering that I was kinda thrown off... Luckily I was next door picking up my food from Little Skillet when I realized that i did not pay. \n\nDon't look like an ass and learn from my mistake! OH, and these guys have the best macchiatos i've ever had!", "author": "chris s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "The best espresso drinks in South Beach. \n\nPro tip: get the Cento.", "author": "Lion G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-03", "description": "So, the first time I ordered a macchiato, I'll admit, I was expecting a frou frou drink.  Fortunately, when I ordered one at Cento (right next to Little Skillet -- a great pairing, and a hearty hangover cure), I knew what to expect.  \n\nThis place is teeny, with no seating, but perfect for a quick stop and quality coffee.  My macchiato was actually delicious.  I'm no coffee elitist, but I actually generally don't like the taste.  So this caught me off guard.  Throw in the warm service and good conversation at the cash register, and that's a coffee fix twice as good as Starbucks, for the same price (or a little less).", "author": "Naveen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-01", "description": "Wow, this place is a gem of a hole in the wall.\n\nThe coffee is rich, smooth and full-bodied - words that I usually only reserve for liquor. \n\nMy boss could tell that I was desperately in need of an energy boost, and promptly brought me over here. Ordered a soy latte, and got the perfect pick-me-up.\n\nThis place is definitely going to become my regular spot.", "author": "Lucia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-01", "description": "really good coffee, really great location, really horrible customer service. Unbelievably pretentious. Won't go back. I feel as though I should wear a sign saying \"I live in the Mission. I'm from the Mission....drop your attitude!!\"  Instead, I will go to Four Barrel where they're nice!", "author": "Coco F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "Nothing like a nice drip coffee in the afternoon, great staff. They also use perkville that basically gives you credit towards free stuff every time you go. You \"check in\" by using the ipad they have at the counter. 10 visits and you get a free coffee!", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-28", "description": "Five stars is about half as much as Centro deserves... Blue Bottle Coffee Co. automatically gets props for being smooth, having extremely low-acidity and tasting insanely delicious... but the other 5 come as a function of the baristas doing it with style, class and care every single time. I have never had anything less than an A+ cup of coffee from Centro, and I look forward to going there every chance I get. Thank you for doing what you do.", "author": "derk p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-01", "description": "Their latte is the best thing that happened in my life.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Nice hole in the wall coffee shop with great coffee. The only gripe I have is that they almost forgot to make me pay (I probably shouldn't complain, I should have just walked out with a free coffee instead).", "author": "Jonathon V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-05", "description": "Such a great little spot with terrific coffee! All I can say is the coffee is delicious and on a nice day it's just really nice to sit out in the alley drinking a cup of coffee. Good stuff!", "author": "Lindsay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "cento, you cute little nugget you... you went on and grew up and got yourself a real live store where people can actually go inside.\n\nyou are still delightful.  still provide delicious coffee.  and i still love you.\n\n... maybe even more now.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "Call me crazy, but I really want to quit my job and work here. There is something so Bohemian cool about working at a coffee shop; and while this coffee shop is lacking the shop portion of the criteria (would be described more accurately as a coffee hole-in-the-side-of-a-building) it makes up for it with Blue Bottle coffee and a staff that is incredibly friendly without being creepy like the Cheshires over at Starbucks.\n\nCento is cash only. However, the lovely staff will let you into their mother building, 330 Ritch, to use the ATM so long as they aren't too busy.\nLines before 9 AM are barely existent, however, to my dismay, they close at 3, right when I really need them for an afternoon pick me up. \n\nAlso, while their paninis are pretty hittin' (my favorite among them being the \"Flower Child\"), I really wish that they'd start stocking some more coffee friendly carbs behind the counter. \n\nWhile I've heard their espresso drinks are very good, I consider it blasphemous to come to a Blue Bottle establishment and not order a drip. They rotate roasts so things stay exciting! Add honey and cream for best results :)", "author": "Taylor E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "I really dig the new indoor location! I've gotten so used to pop-up coffee kiosks that the level of convenience is frankly disorienting. A place to stand out of the (nonexistent) rain? Surely you jest.", "author": "Connor Skye R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "Happy to have found this little gem and look forward to enjoying more delicious cappuccinos!", "author": "ron b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "This place has great coffee - only because they brew Blue Bottle.  BUT the customer service sucks!!!\n\nSo, although the coffee deserves a whopping 5 stars, the place itself deserves only 1....", "author": "ThaoLinh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-08", "description": "I was just next door for some fried chicken and the smell of coffee just drew me in. It seemed like a cute stand and I got my coffee in a few minutes after ordering it. They serve blue bottle coffee, but their latte was MUCH MUCH MUCH better than how Blue Bottle serves it. Rather than being diluted with milk, I could taste the roasted coffee beans. Definitely a must get if you're right there already!!", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-07", "description": "Good latte, nothing special. Beware, they don't have any flavored syrups. Other than that, I probably won't go back unless I'm in the area and other places are closed.", "author": "Allison J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "I work across the street, so this is just my average hole-in-the-wall (no, literally), coffee stand, and for the longest time I couldn't understand why it was so praised on Yelp.\n\nI'll tell you why - their lattes pack a punch that kept me wired for a solid 4 hours.  Effing great, man.  Bonus: on warmer days packs of cute hipsters (usually at least two bike couriers among their ranks) flock about the place.  Strong coffee AND eye candy?  Even if you weren't 15 feet from my building, I'd come back.", "author": "Emily P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "Man this place is one of those great finds in the morning. Like I was going to the Creamery before and well it takes forever and it's not that great. If you just walk up a block Cento exists and wakes me up in the morning with it's Blue Bottle coffee, it's friendly baristas and whitty decor (BTW their hearts are platonic). I don't know it just seems like a down to earth coffee place. It's right next door to the little skillet so I actually want to grab the full breakfast run of a coffee and a little skillet breakfast sandwich. Until that day I will just drink my cup and be on my way. Also they serve affogatos here too. I haven't had them here but I am intrigued... especially if I can  order it to go.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "Something about buying coffee so strong it will make you fail your drug test, out of a loading dock, in a back alley, that makes me love it even more.\n\nSOMA alley dwellers step right up.", "author": "Madame X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-13", "description": "New Orleans Ice Coffee?  I'm jumping out of my skin right now, it's awesome.  The $3.50 price tag was a little ridiculous.  Ok, you \"slow roast it for 24 hours.\"  Ok it's Blue Bottle and it's \"Trendy.\"  But is that any reason for it to cost twice as much as your hot drip coffee? \n\nJust had Blue bottle coffee for the second time ever.  It's perty damn good. Unlike the Hayes Valley location the line was extremely short , but I'm sure this wont last for long. \n\nI'm just glad there's a new place to take more and more business from Starbucks. \n\nDamn the man!", "author": "Adam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-14", "description": "Whoever that handsome young fellow with the dirty, raunchy-looking moustache is.... oooh-wee!  Such a coffee slingin' stud! \n\nCento serves the highly-acclaimed Blue Bottle Coffee with each cup individually prepared to perfection. With that, comes a wait-time (usually less than 3 minutes) which might turn people off. However, it's hard to get mad at the friendly, warm-loving, hard-working staff. Each employee, yes including John Q., the manager, satisfies the customers' needs with an excellent level of product knowledge, presentation, quality, and speed of service.", "author": "Lea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-20", "description": "Conveniently near to where I work.. Cento makes v good Blue Bottle coffee.\nBeing next door to little skillet is a bonus, especially if you are hungover so you can go for the Breakfast Po Boy sandwich with your coffee.\nOnly downsides are the slightly vacant aloof hipster staff serving your coffee and the fact that they don't get the milk hot enough.. by the time you get back to the office the coffee is luke warm.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "If I'm within the 10 block range, I will wind up here ordering a cappuccino. \nSurprisingly I have nothing bad to say about this place... wait. No. I know!\nI liked them better as 'Lambretta', and located 4 blocks from my apartment.\nI knew I could find something wrong! \nI rock! \nAnd Cento rocks too.", "author": "Max R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "Best coffee I've had in San Francisco -- including the Blue Bottle on Mint Plaza and Sightglass on 7th. Vastly better than Epicenter or the Creamery.  I wish they took cards & were open later, but five stars anyway.", "author": "Susan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "Is there some remedy for a latte addition?  I can't boot my computer in the morning without sipping the first few foams of your soy latte!    mmmmmmahhhhhhhh", "author": "Minna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "Cento rocks! John and the entire gang are great. Can't recommend their drinks, snacks and staff highly enough!!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-02", "description": "Outstanding coffee.  Not the quickest service in the world, but the staff is very friendly. Reasonably priced for the quality of coffee and milk. Highly recommended.", "author": "Justin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-01", "description": "Awesome coffee, well considering they do use blue bottle. \nCute little downtown alley spot.\n\nThe only complaint was there was absolutely NO line and we still sat there for 5+ minutes and got a little attitude when we confirmed that this was where we were supoose to order. (come on, there was a window right next to it for phone orders....)\n\nWould definitely return, but with keeping the wait and slight attitude in mind.....", "author": "Susanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "The baristas at Cento serve amazing latte and cappuccino. Their forte is their milk. Its perfectly steamed, creamy and the perfect drinking temperature.\n\nThe espresso is a little thin and bright for my taste. A macchiato is a nice compromise if you just want a small pick me up in the afternoon.\n\nYour wait will be somewhat long, the staff is somewhat disorganized, and you will be bandied about by skinny-jeaned dot-com hipsters while you wait, but they get the coffee right and that is what matters most to me.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "I'm so not a morning person and I need some good stuff to wakey wakey this sleepy baby. What better way to awaken the senses than some Blue Bottle Coffee.  Soy Cap and I'm on my way! Hands down my fav coffee!", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-16", "description": "To call this a coffee shop would be an overstatement. It's more like a coffee stand. But what it lacks in size (or seating), it more than makes for in the quality of its coffee and friendliness of the staff. They brew with Blue Bottle coffee and I've never had a bad cup here. I used to work in the building across the alley from Cento, and it was really nice to come down on a sunny day, get the regular drip (brewed by hand, by the way) or the New Orleans-style ice coffee, and chill out outside. The place is popular in the neighborhood, especially with moped- and scooter-riding hipsters. I miss having this so close to work.\n\nOh, they also serve decent panini sandwiches during lunchtime.", "author": "Andrei Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-19", "description": "wow blue bottle coffee and the best fresh croissants ever, I could not live with out this place . John and the ladys that work there are great. Blue Bottle coffee is like a cult following, as it is brewed one cup at a time, how could you get it any fresher. Its not like a Starbucks or Peets coffee. When you recieve a latte it is absolutely beautiful it has a beautifull leaf design or some sort of art work withthe color of coffee and the froth of the milk, yummyyyyy\n\nBlue bottle is like Saks Fifth Avenue\nPeets is like Nordstroms\nStarbucks is Macys\n\nBlue Bottle Coffee and saks all the way....\n\nLive life right", "author": "P C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-09", "description": "I'M A FAN!\n\nIt's right next to where I work and I enjoy my morning walk there to get my cup of coffee. I really don't mind the wait since I invariably end up talking to another patron or get the low down on what's going on in the work world around me... and hey! life need not always be about instant gratification.\n\nThere is something to be said about waiting for your coffee to brew and really enjoying it when you get it... you know? like the good old days?\n\nThe folks behind the counter are friendly and quick as they can be.\n\nNice, nice, very nice!", "author": "Amit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-10", "description": "Love having this place next to my art studio for the afternoon coffee.  \n\nIt's great to have quality places like this embedded in the neighborhood.  Turns the impersonal urban landscape into more of a community.  \n\nCombination of great coffee, friendly people, fresh air and sunshine is unbeatable!", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "Best coffee ever.  Seriously.  And I've drank a lot of coffee in my life.", "author": "Alden F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-05", "description": "THIS...IS...as good as it gets.  Their coffee (Blue Bottle Co.) is like crack.  Wait, it's BETTER than crack. Not that I've ever DONE crack, but as the saying goes.\n\nHaley...this coffee...omg...Haley...this coffee.\n\nI've only had their espresso, machiatto (way too much milk, but pretty designs), cappuchino (alas, they refuse to make it BONE DRY) and their Iced Coffee.\n\nBut, damn... is it ever good coffee.", "author": "Herman P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-20", "description": "A cafe's a cafe, right?  Turns out, no.\nI popped in here yesterday morning and I had the best mocha of my life.  They do the bittersweet (read: not very sweet) kind of mocha similar to the ones Terrafazione used to make before Starbucks murdered them.\nAnyway.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-17", "description": "It's amazing that for essentially the same price as Starbucks ($2-3), you can enjoy coffee that was thoughtfully produced from the Blue-Bottle roasted beans to the cup-at-a-time brewing.  The lattes are wonderful and they do that cool leaf thing in the foam. The foam is perfect and the milk is sweet (not too hot) and light all the way through.  A cup of pure joy! \n\nOh--- and if you're in an \"I don't care about calories\" mood, the croissants are to-die-for.", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "Hopped over from Little Skillet, literally for some coffee! We tried some New Orleans Iced Coffee and I have to say this is one of my favorite coffee joints in the area. They make some great quality coffee!", "author": "Angie Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-14", "description": "This place just opened up around the corner from my office (literally) and their timing could not have been any better. \n\nTrendy Blue Bottle Coffee? Check!\nProper New Orleans iced coffee like at CC's and PJ's? CHECK!\nTiny little place that will confuse hipsters since they can't sit around posing angrily? CHECK!\nSimple syrup readily available? Check!\nBlazing hot weather that reminds me of Nawlins down in my cockles? Mother nature check!\nCoffee with chicory? Check!\n\nThese guys really lucked out with this hot weather and their rather expensive iced coffee product. It's a small serving and they're selling it for tree-fiddy! Monstah, I aint givin you no tree-fiddy! Well, I did give it to the owner of Cento.....I just wish it were larger. For $3.50 back in NOLA we'd get something 3x the size. Still, you pay for convenience, and Cento affords the me convenience of living in SF while still dreaming of NOLA.\n\nI used to live around the corner from the owner's old coffee shop on Polk and missed him when they have to leave. I'm glad he landed on his feet and opened up Cento -- the nabe definitely needs it.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "If you're going to sell anything out of a window or a truck it needs to be 25% cheaper or 50% more delicious or both.  Cento serves Blue Bottle coffee which is indeed better than most at $2.00 a cup (about the same price as other coffee).  I wish they were a bit cheaper like the place in the caltrain station ($1.50 a cup).  \n\nThey've got a cool vibe going and serving coffee from a window makes them inherently dog friendly.  They also have a little bench if you want to sit down and relax with your coffee.  Cento is located in a low traffic alley so it is a bit of a break from all the noise of the neighborhood.", "author": "Garrett D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "It's a tiny coffee room set back from Ritch street.  Usually long waits, and no tables or WiFi or any of that garbage.   Don't expect mobile office space or couches.  You only get super tasty coffee.", "author": "Arlo J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-18", "description": "Excellent work by the baristas.  Nice to be reminded just what a mocha can be about: ecstasy.\n\nEnjoyed the cuban sandwich today.  Served on focaccia bread, yet it worked.  Delicious.  Upcoming daily specials sound yummy.  I may be permanently adding Cento to the lunch rotation.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-10", "description": "the best marriage of two businesses since Casady&Greene and Apple Computer.  New Orleans Iced Coffee is like non-other, and the Hump Day burgers make me happy.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-19", "description": "I just bought a mocha this morning and the barista forgot the espresso. I tried to find their phone number to call and let them know but there is no phone number listed anywhere online. I paid $4.25 for milk and a little chocolate :/ I would really like a new cup of coffee.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-14", "description": "Today was such a scorcher already at 8am that I decided to try the New Orleans iced coffee, a slow-roasted beast with chicory and milk, leaving it to the discretion of the coffeephile to add as much sweetener as they want.  Kudos to places with simple syrup for cold drinks!\n\nThis place is in an alley, so I don't think it's going to be a hang-out for anybody, but the staff is really friendly.  In fact, I was \"warned\" by the gentleman behind the counter that the iced coffee has more caffeine in it.  Since I am immune to the powers of caffeine, I laughed; I'm just in it for the flava.\n\nSince it's close to work, I will be back.", "author": "Aimee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "Just moved my office from downtown Oakland to the tail end of the SF media gulch -- and the first day here, I went on a serious coffee hunt.  No longer would I have the safe haven of Awaken Café, my daily to often twice-daily Americano hookup.\n\nThings were looking dire (read: all shitty delis and Starbucks) until I found this small beacon of caffeinated hope on Ritch Street. $2 for Blue Bottle?  Done deal.  Their espresso isn't the best, but with a high-quality and cheap cup of fresh drip coffee, I don't really care.  To boot, looks like a window is opening next door with chicken and waffles?  Are they reading my mind???", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "It's Blue Bottle coffee, but near my work! Hooray!", "author": "Klevin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "Convenient, fast and Blue Bottle- what more could you want on an early morning on your way to work? The stand reminds me of a lot of coffee shops in Montreal that are no fringe/just about the coffee, which I love.", "author": "Seema M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-16", "description": "Blue Bottle Coffee in south-SoMa, need I say more?\n\nThe baristas know their stuff - esp how to foam up Soy, which is an art in itself (I hear you have to be trained by Blue Bottle in order to buy their beans wholesale for cafe retailing).\n\nMy only negative (and thus not 5/5) is that once again it's a Blue Bottle establishment (albeit franchise in this instace) that has elected for the kiosk approach rather than full cafe.  I find it slightly pretentious given that  that get away with charging full cafe prices without having to deal with the overhead that comes with running a full cafe setup.\n\nCoffee is a drink that should be enjoyed in a relaxed (seated) environment, plus the lack of 'proper' cafe prevents them from incorporating up the vespa/lambretta/scooter/mod concept more deeply into their business.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-31", "description": "This place is the opposite of Starbucks; thats why I love it.\n\nGreat coffee, and beautiful cappuccinos.  Hint, the ice coffee is actually cold brewed = extra caffeine.\n\nBeware of hipsters looming in the alley...", "author": "Adam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-13", "description": "Five stars for the super friendly baristas who were full of energy, smiled often, and asked me how my day was. They even asked me what type of milk I like. The Blue Bottle iced latte that I ordered was good, not as amazing as at their Linden location, but definitely a great caffeine fix before getting back to work.", "author": "Erin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "My favorite morning ritual! Truly the best coffee around (Blue Bottle). It is very small so you have to keep an eye out for it. Everyone that works there is very sweet.  They do sometimes have croissants which are to die for... especially the chocolate ones.", "author": "Kelly J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "Great coffee and good service. I come here often.  Their cookies are from Goody Goodie which are great although I do wish they had a bit more variety.", "author": "Daniel Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-29", "description": "Now with pastries! Freshly baked chocolate and regular croissants were out this morning.  I splurged and cheated on the greek yogurt in my bag and it was worth it! I'm still obsessed with the soy lattes which never fail to come out perfect and, now I have a girl crush on the baristas - they are très chic and oh so nice!", "author": "Allison B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-06", "description": "Cento barristas give blue bottle a bad name. nuff said. \n\nsigh... i'll just have to get my coffee on linden and jesse", "author": "jason y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "Order the \"Cento\" -- holy crap, it's good -- the perfect combination of espresso and latte.", "author": "Marlo F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-12", "description": "I haven't even been there yet, but am certain it will be fabulous. the owner had a great little cafe on Polk St...Lambrettas, which he was forced to close. so pleased he is about to open up again with the same crew....GOOD LUCK!!", "author": "Janet W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-06", "description": "Pick it  up team.  You're slacking.  I know you can put more effort into every cup you pour, and I want to support you, but you continue to let me down.\n\nNo one asked, but $2 cups and two-stroke Italian mopeds are not why I like Blue Bottle.", "author": "adam t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-25", "description": "best coffee shop outside of the hayes valley blue bottle.  Perfect for a curb life.", "author": "Katie Sue A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "Great cup of coffee. It's great that they are downstairs from my office. So I can go down when there is a minimal line. Lots of SOMA hipster like to mill around Ritch street. The staff at Cento are really sweet and friendly.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-16", "description": "i don't have a scooter, but i did used to want one. oh, and my gf used to have one and i'd ride it around the squares of savannah, georgia trying (usually in vain) to get it to do wheelies at every stoplight. all this practice, though, does not a scooter aficionado make.\n\nthat was until i went to cento for some coffee as it's scooter-themed. it's located right around the corner from my office, so it's convenient. they carry oakland, ca-based blue bottle coffee (the only other place i knew to get it was off of gough in hayes valley), which is probably some of the best coffee i've ever had.\n\nlocation = great. in an alley, next to popscene. i'll be frequenting cento often.", "author": "Jeremiah W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-24", "description": "Happily convenient to my apartment, but the hipster vibe is a bit too hard to swallow. It doesn't outweigh the height, but is convenient after a lunch in South Park or at Little Skillet.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-27", "description": "I discovered this place through a friend.  I study coffee, have a $2'000 Machine at home, and roast my own beans! This place rocks! I ordered a Cento (not even on the menu) and it was delicious. You need to close your eyes when you sip it! Need I say more!", "author": "Dale R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-29", "description": "You guys have brought me out of review retirement.  Well done...perfect coffee, great latte and New Orleans iced coffee, next to the office.  I already love BB coffee, now I am spreading the gospel, one co-worker at a time.", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-28", "description": "i'm really not hip enough to be hanging out at cento.\n\ntheir patrons have crazy body art.\ni have sun/age related freckles.\n\ntheir patrons have cool rocker skinny black jeans.\ni still wear sweaters from banana republic.\n\ntheir patrons ride charming scooters or performance bikes.\ni drive a yuppie scum BMW from BMW of san francisco.\n\nbut regardless of hipster or yuppie scum, we're all brought together by a love of excellent coffee.  and that's enough to overcome my lack of hipness.", "author": "brian w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "Glad to see there's a place to get Blue Bottle around South Park. My addiction will not abate. It's very similar to the Blue Bottle kiosk in Hayes Valley. The cookies are good too.", "author": "bill l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-16", "description": "This place is great. Recently had their \"Cento\" filled with smooth caffeinated goodness, highly recommended. The best is that I sipped it in the warmth and sunshine. How much better does life get?  With great drinks and super-friendly staff, Cento is highly recommended!", "author": "Kat D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-18", "description": "one star for using good coffee beans. \n\nthis place is ridiculous. it takes at least 5 minutes for them to make your coffee because they do it the prehistoric way with a bonfire and a strainer woven out of grass. its served scorching with major spillage, make sure you get napkins and a lawyer. \n\nyeah yeah yeah, everyone else loves this stuff just because of it's strange hipster cult following but i drink my coffee black and this crap is overrated.", "author": "Al I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-14", "description": "Awesome coffee. No decaf drip, but they do have decaf espresso drinks or americanos.  Great foam also.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-19", "description": "So  I went back and tried the regular coffee which I guess is Blue Bottle? And I still don't get the hype.", "author": "Holly E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "If you're looking for quick, affordable, consistent drip coffee, this place is good.  Food is no where to be found  early in the morning, but they definitely scratch your caffine itch.  They play music as  you wait.  There's something cool about a no frills coffee joint located in an industrial alley that is appealing.  They have a full menu for lunch that I yet to try, but judging by the crowd it attracts, I've got to assume they're doing something right.", "author": "R B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "It's like I discovered a secret alley passage way to get my coffee fix. It's a cute and friendly kiosk which seems to share a kitchen with 330 Ritch. At $2 for drip coffee with blue bottle roasted beans, skip Borders across the street. Lattes are also very good. Looks like they serve lunch takeout food as well. Too bad they aren't open during the weekends!", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-02", "description": "Best place in the city to get Blue Bottle coffee. Staff is cute and sweet. I love these ladies . . . and few gentlemen.  If I've got a few minutes to spare before going into the office, I'll do everything I can to swing by. After one double Americano I'm ready to put out any number of fires and power through the 200 emails waiting in my inbox.", "author": "Courtney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-16", "description": "John's \"American-style\" macchiato is unassailably perfect.", "author": "Abie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-12", "description": "You can't go wrong with Cento. I recommend the New Orleans iced coffee on a hot day.", "author": "Johnnie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-08", "description": "I am so through with the pretentiousness of the whole Blue Bottle thing.  My 2nd visit to a Blue Bottle place and the staff were just as snooty and the space was just as uninviting.  I ordered a cappuccino and asked for it \"on the dry side\" because I'm sick of baristas ruining caps by making them lattes with a little extra foam.  Its 1/3 espresso, 1/3 steamed milk, 1/3 foam, pretty much has been since they were invented in the 1900s.  Anyway, the uppity hipster who served me looked at me through her thick black hipster glasses and said in a tone you might use when talking with the mentally challenged \"oh no, I don't think I can do that\" and then proceeded to give me a lecture on how to make caps.  I haven't been a barista, but have made probably 3-400 caps at my last place of work, so I kinda know what is and isn't possible.  She convinced me to try it her way, which was 1/3 espresso and the rest foamed milk.  It was good, as a latte, which was on the menu and which wasn't what I wanted.  Long story short, Blue Bottle get over yourself (and learn to give the customer what they want).  Philz gives better service, better coffee and a nice space to enjoy it in instead of huddled on some stupid alley.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "Cento started making pressed sandwiches.  We got the ham and cheese and the one with the pickled peppers.  They were both cold in the middle.  I make a saddy face.  At least the coffee is still awesome.", "author": "Lorin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "I love this place. It's one of those unexpected finds in SF. I'm from New Orleans, and while the thought of paying $3.50 for an iced coffee makes me in my coffee pot, the drip is a steal. Doesn't hurt that there's a severe cutie working there =)", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "I can't believe it's taken me this long to write a review about this place. It's definitely my first stop in the morning before work, and it's only a block away, tucked in Ritch alley. I wouldn't call this a cafe or coffee shop so much as a hole in the wall that serves coffee and espresso drinks, but appearances can be deceiving. I've never been to such an unassuming, friendly coffee joint that serves such awesome coffee. Seriously, this coffee IS awesome. Although I have my Blue Bottle bean preferences (thanks to this place), you can never get a bad cup of joe here, and I hear the lattes are excellent too; I know for a fact that at least the latte art is!", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-02", "description": "Yay! Blue Bottle Coffee in the hood - so 'cited. You will now see me here spending too much money for coffee several times each day. Totally worth it. Baristas are totally cool too...welcome to the block Cento...", "author": "Kate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-16", "description": "The new cafe space downtown behind the old Mint building is clean, simple, effectively designed.  It encourages conversation because of it.   Great place to catch up with complete strangers brought together by arguably the best espresso machine coffees in San Francisco.  I haven't tried the ultra modern coffees boiled by beams of light yet, but will someday.    Their espressos are in the same league as Europe, and there lattes are wonderful.  The way they whip/steam the milk is their secret, it's always very well done.", "author": "Roland C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-18", "description": "Fast and tasty! Very solid paninis.  Who doesn't love bean juice and/or cheese.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-15", "description": "These guys are awesome! the 9 people that ordered after me got their coffee before i did, and they got my order wrong. if it wasn't for their holier than thou attitudes then maybe i would consider giving them a new nickname. Scooter H03$!", "author": "tony p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "cute cafe with no seats. i am not a big fan of blue bottle so i won't comment on their lattes.  mew.", "author": "Moko R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "tl;dr: Espresso drinks here are to die for.\n\nJun 08:\nThe New Orleans iced coffee I just got here wasn't anything like the other ones I've gotten from other Blue Bottle places...sigh. The New Orleans from the Temescal farmers' market last weekend was thick and creamy like chocolate milk, this one from Ritch St tasted like I put some Folgers in the fridge.\n\nHopefully it's a fluke. I'll go back and try a latte when it's not so hot out. \n\nSep 08:\nBumped from 3 to 4 stars after having a couple espresso drinks...maybe my NOLA coffee really was a fluke? The owner of the space is great at pulling a shot, and is can almost draw the Prince symbol in your latte. Whoa.\n\nOct 08:\nHad second NOLA coffee, and it was disappointing. 4 stars, but get drip or an espresso drink...there is always someone working there who can pull you a good shot.\n\nDec 08:\nBeen my morning stop for months at this point, and I have yet to be disappointed by a latte. Ella has crafted the best latte I've ever had. Still scared off the NOLA iced coffee, but it's too cold for that anyway. It's fun to talk about things on two wheels with the owner, John. I love that there's almost never a wait (used to go to Mint Plaza but got tired of waiting for 20 minutes).", "author": "Alexander Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "Better Blue Bottle coffee than Blue Bottle.", "author": "Jay V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-30", "description": "Great coffee, strange hole in the wall location", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-04", "description": "Blue Bottle coffee in my 'hood.  'Nuff said, 5 Stars!", "author": "Johnny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-21", "description": "good times had by all hanging in the alley sipping blue bottle here.  stop by and find a bench or curb to just relax on.  even when the entire block lost its electricity, hot coffee was served.  john q knows how to do it right.", "author": "Olis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-24", "description": "i love them and they love me, or rather, my moped crew loves them and they love us! i'll be john's forever loyal customer, whether it cafe lambretta or cafe cento!", "author": "Jaei P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "The future of coffee bars.  Simple menu, excellent roaster, up to date baristas that know the science of pulling shots and preparing \"specialty coffee\".  It's amazing how Starbucks or Philz is still mentioned in the same sentence as these mini bars.  Starbucks is fully automatic, meaning there is no barista talent needed.  Their machines are pre-programmed to pull a shot (espresso) in a specific time.  But the time factor is only one of many variables that go into making a great espresso.  They are in business for sheer volume = money, sorta like McDonald's.   Philz is... well, it's Philz.  It's one man's creativity on coffee.  Not bad for sure.  But then again you eat California Rolls and there is no such thing in Japan.  Bars like Cento and the other 2 in the City are following a growing trend to revert back to true Italian style coffee.  Not the California Roll coffee 95% of all coffee houses and restaurants serve.  More than likely the reason you don't prefer it is because your brainwashed into thinking California Roll coffee is the ONLY coffee, over sweet, over foamed, over sized.  I read about a 1/3 1/3 1/3 ratio of espresso, steamed milk and foam making a cappuccino???  That ratio has been slowly dying and deserves to die.  Soon you'll be outta luck finding that ratio because the double shot with a light airy foam is what \"specialty\" coffee bars are serving now, and a latte has no foam! tsk tsk! but then again almost all reviews by this rater were negative so head to Cento and upgrade your palate to real espresso drinks using some of the best beans in town.  Oh and I'd rather have a consistently excellent espresso drink from someone that doesn't greet me like a car salesman then a fake american-style espresso drink that I'm regretting and just drinking for the caffeine...", "author": "No I Don't Have Time F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-15", "description": "Blue Bottle beans, Blue Bottle prices, bleh coffee.  Don't know how they're screwing it up, but the product is not up to Blue Bottle standards.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-05", "description": "I've been going to 4 barrels and ritual for my coffee even though I live in SOMA.  Then I found out about Cento.  The coffee here is excellent.  Up to par with the best in SF.  The only problem I have with this place is they close at 3pm, which means I almost never get a chance to have their coffee.  Personally, I think this is the best coffee in SOMA.  Definitely better than Epicenter and Blue Bottle in Mint Plaza (which I'm told is not their best representative).", "author": "Loc N."}
