{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "This place was literally off the charts. I kept wondering what all the fuss was about and then actually ate there.\n\nEverything was perfect, and it's one of my favorite SF restaurants. The menu is mostly seasonal so I won't write specifics you won't be able to order, just ask the staff, they know their stuff.", "author": "Amir M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Met expectations! I discovered this place because I walk by it from the bus stop almost every day and I see these insane lines so I figure we should try it. The plan was just to wait in line but my friend snagged us a reservation which was way better because when we arrived 15 minutes after it opened the place was already slammed. \n\nBeautiful, open, airy restaurant, not crammed together. I also discovered the chef is of Jewish heritage and a lot of his dishes are Jewish cooking inspired.\n\nWe ordered a salumi plate (incidentally they have a massive curing chamber in the middle of the restaurant), which was very tasty.\nTHis was followed by the Chicken liver pate which was incredibly tasty and paired well with sliced radishes.\nFor our mains we shared the seafood pasta with squid ink and sea urchin. Very fresh tasting and a nice lemony finish. We also shared the Pinepple pizza which is very spicey with a sweet aspect.\n\nService and cocktails were excellent, would recommend.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-01", "description": "I am amazed that it is still difficult to get a decent reservation time. Yes the ambiance is great. Yes the place is cute. Yes I can see the salumi curing against the wall. Yes they have some special pizza oven from Italy. But the food is good not great, and the portions are pretty small.\n\nHad a nice catch up with a friend and ordered a bottle of wine. We started off with the selection of salumi, which did not come with any bread or anything. It was good, but doesn't really compare to what you get in Italy or Spain. Next was the pappardelle al ragu. The pasta was nicely al dente, but the bolognese fell flat. The meat was congealed and uninspired, and there was not enough sauce. The much hyped pineapple pizza was decent, but the portions were like 50% crust 50% toppings. And even with the warning from the server that the crust is supposed to be charred, I still found it too burnt for my liking. I would definitely avoid the side of escarole. The menu made it seem like it was mostly escarole, but it was like 75% black eyed peas, and it was way too salty.\n\nA decent meal, but over-hyped and overpriced.", "author": "Eva W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-17", "description": "This was one of the hottest restaurant openings a couple of months ago. I tried my hardest to nab a reservation but to no avail. Open Table only offered a few weekday times at very inconvenient times. (Dude I like to eat at normal hours so I can go to sleep at a reasonable time. Yes I realize I sound like an old lady. : )) The only way to be able to dine there was to go line up like everyone else; so we did. We got there half an hour before it opened and there were already 15 people ahead of us. Fortunately, when they finally opened, the line moved fast and we got to sit at the bar area. It wasn't our first choice, but it was tolerable since we were hungry. \n\nChe Fico is located on Divisadero Street in the Nopa area of San Francisco. I got dropped off to wait in line first while my guy went to find parking. Luckily he found a space a few blocks away. It's mostly street parking and there are some streets which don't have meters. \n\nDid our dinner meet our expectations? Ummm...not really. I would say the food was good but not as fantastic and memorable as I hoped. The environment and ambience is better than the food. The pretty and modern interior makes this place a hip place to have drinks with some friends or co-workers. Other than that, I would say I'm glad I tried it at least once. If I were to go again, I would just go for drinks after I had already eaten somewhere else. I must say I did like the wallpaper by the stairs leading up to the dining room. All those figs! So pretty! \n\nSuccotash : This was sweet corn with strands of shishito peppers and a small piece of eggplant on top. The flavors were good but only because I really like corn. The eggplant was just ok. \n\nPappardelle al Ragu : The pappardelle was good, but it's just as good at other Italian restaurants in the city. The portion is what somewhat irked me. For the price I thought there was going to be another few more pieces? I believe there were only about 5 or 6 pieces on the plate. (I'm definitely not eating like I'm on a diet.) It looked like a lunch portion instead of dinner. I suggest ordering more than one if you want to be sufficiently full. \n\nPineapple Pizza : This pizza was the one I was looking forward too the most because of all the photos others have posted. The pizza is baked in their wood-fired ovens in the kitchens. The crust is cooked to almost burnt hence the dark color. If you don't like the burnt flavor, I wouldn't suggest ordering it. The pizza is a bit sweet from the pineapple, but I thought it was tasty and an interesting mix of ingredients on a pizza. If I had to order a pizza, I would probably order another kind the next time. \n\nPluot : This was a complimentary dessert. It was the first time I had one. It's like a cross between a plum and a peach.", "author": "Julie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Honestly, I have to say that this may be the best meal I've had in San Francisco thus far. Though I should premise that with, I do love Italian food more than most types of food, so there may be a bias there. \nFirst off, I definitely recommend getting a reservation unless you're cool waiting 2-3 hours for dinner. We made one and were seated within 10 minutes of our reservation time. We then were told that some of their items had run out, which was a little disappointing, but since they get all their produce fresh each day, I guess it was understandable. We ended up ordering the suppli to start, which the waiter highly recommended, and it was great! We then did the linguini with clams, the wood fired chicken, creamy polenta and the seasonal vegetable they were offering! It was all amazing, and I especially loved the pasta. Hands down the greatest plate of pasta I've eaten in the city. \n\nCan't wait until I get to eat here again!", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Made a reservation a month in advance, and it finally came time to try Che Fico last night. We had a lovely dining experience, and I don't think the restaurant is \"over-hyped\" as many of these reviews seem to suggest. Yes, it's hard to get a table. Yes, it's pricey. But it delivers! To me, all of this was worth it for the delicious flavors and great service.\n\nCustomer service was the star from the beginning as we had requested seating with a booth or banquette seat for me. I am hugely pregnant and no longer comfortable sitting on small wooden chairs for long periods of time. They obliged and seated us at a nice table where one side was banquette seating for me. Very comfortable.\n\nMy fiancé tried some salami and the quince cocktail, neither of which I could indulge in while pregnant. He said they were both great. The cocktail smelled like fall and warm apple pie. I was jealous!\n\nWe ordered the suppli to start, which was delicious! I've had arancini type fried risotto at many places, but this was the best I have tried. It had delicious tomato and herb flavor, and the cheese was gooey and had a nice nutty flavor.\n\nFor the pasta dish we shared a squash ravioli. It was very seasonally appropriate, with gorgonzola, chestnuts, fried sage, and brown butter. More tastes of fall! Small portion for $28, but very tasty.\n\nAs a main dish we split the porchetta, and it was a revelation! Honestly this pork had some of the best flavors I have tasted in a long time. We were treated to a huge round of perfectly roasted pork loin coated in yummy seasoning, with a layer of melty fat in between that and the crispy skin. Oh my god the crispy skin! Positively sinful! It was a HUGE portion, and we couldn't finish it between the two of us.\n\nFor dessert we shared the warm chocolate cake with limoncello gelato. The cake was like a brownie outside, with a steamy, gooey inside. So decadent! Topped with limoncello gelato and a sprinkling of sea salt, it was a strange combination but it totally worked! \n\nOur server was excellent, and the pacing of the meal was perfect. Dishes came out quickly, with just the right amount of time between courses. The space is beautiful and interesting, and the soundtrack was fun and upbeat. I would definitely come back here.", "author": "Traci R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "I know what you're thinking... pineapple on pizza?! But that's a cardinal sin! Sorry haters, but I the hype for Che Fico's pineapple pizza is 10000% real. It's so much better than a lot of pizzas I had in Italy. You've already gone through the immense pain of getting a reservation here anyway. Now go do yourself a favor and make the most of it!\n\nOther memorable bites of the evening include the side of polenta that comes with the chicken (lol so random) and both desserts.", "author": "Miko B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "What a fig?...\n\nWhat a restaurant!!!\n\nChe Fico is worth your time and money: It is both entertaining and delicious. with caveats!\n\nI do get the mixed reviews as there are hit and misses on the menu. \n\nWhere I think this place really shines is its meats and cured meats, ...heck they have a meat mausoleum right smack dab in the middle of the restaurant https://www.yelp.com/user_local_photos?select=obT5-9wjCku2eL7eMhmZOQ&userid=kroQYWSj-BhIEXT4VwLRHA\n\nThe pizzas are great ( you've probably heard of Anderson Copper raving about the pineapple and chili pie!) but are very dense and bready as the crust is  made with sourdough. One of our dinning partners doesn't do cheese so we did ours without cheese....big mistake. The ingredients were great though.\n\nHits:\nOur chopped salad was Fantastic!! Great ingredients, super fresh, with touches of salty Finocchiona and cubed smoked provolone. Great salad and highly recommended.\n\nThe Smoked Paprika Strascinati was amazing. Every savory bite begged for more. Perfect Al dente pasta, an amazing Lamb Sugo...I would get this again without hesitation as it was unique but super tasty!\n\nIf you come order a meat dish!!! Period end of Story. These guys do meat amazingly. We ordered both the Lamb, which I must say was the best and most unique I have ever tasted...simply magnificent, and the Porchetta...which was pork heaven. The crispy skin ( think Cracklins) and rich juices are what pig dreams are made of.\n What is funny is this is a Jewish Italian restaurant that highlights Kosher dishes on the menu....oops!\n\nMezzo  Mezzo:\n\nThe corn succotash was fine but there are many other dishes that proved better. The meat dishes come with veggies so I would pass if you order one.\n\nBoth the desserts were fine but something you could pass on. I did enjoy the Nuvola Di Riso but it is not your traditional rice pudding. The deep dish crostata was warm and filled with lovely fruit and once again enjoyed it but unremarkable\n\nMisses:\n\nThe Duck liver was great and pretty to look at, it reminded me of how my mother used to make it, however it was a minuscule portion and not worth ordering again.\n\nThe Cod in Pasta shells was fishy and not a plentiful serving. No one at the table enjoyed it....definitely pass on it.\n\nThe wine list is good but a tad bit spendy. Corkage is a bit high at $30 but they will decant and did offer so.\n\nAmbiance is fantastic as the space is just gorgeous. You can tell they spent a lot of money re-purposing an old stable into a stunning restaurant and bar. Music was great, albeit Loud, from the 80's ( Talking Heads, Stones, Blondie et al). And the music reflected much of the patrons...uh hum like in their 50s and 60s. Sure the bar was the youngings scene.\n\nI will definitely go back again but order more with a focus.\n\nBuon Pasto!!!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "One thing that really is a challenge when you get old is staying up late.  I mean, I loved staying up late in college, and generally still do.  But these days, staying up late means switching back and forth between IG and twitter on my phone while lying in bed.  I really got caught up in FOMO when Che Fico opened, so I went for one of the late night reservations.  I really wanted to enjoy it, but I was so sleepy that I couldn't appreciate the food as much as I should have.  I mean it was good, but I didn't know at the time if it was outstanding.  \n\nIt took a long time for me to come back after that first late night visit, but boy was it worth it.  This time I had a reservation close to opening with my significant other and we absolutely loved every part of the experience.  Upon arrival, we stood in the long line of walk-ins, but the hostess asked if anyone had a reservation and invited us to come to the front.  After checking in, we were brought to our table near the kitchen which was great for viewing not only all the action of food prep, but also had a view of the bar and could see all the activity.  This is a really loud place, but I love the music they play so it wasn't a big deal to me.\n\nThere are so many things on the menu I wanted to try and our server was so helpful with giving us recommendations, especially with the pizza and the special that night, roasted veal chop.  Now the suppli and prosciutto cotto wrapped grissini were good as small starters.  The honey on the prosciutto was a nice touch, giving just enough of a sweet/savory balance.  They must have suppli on deck in the kitchen because those came out so quickly and I could see them being placed on almost every table.  Cheese was nicely melted inside, but not so much that they burned your tongue or anything.  Again, great flavor.\n\nThe saffron spaghetti was perfect.  The pasta had a nice bite to it and the sauce was just the right amount that clung to the pasta evenly.  Lobster was cooked well and was sweet.  I could eat this everyday.\n\nThe squash blossom pizza was amazing.  I was so glad the server recommended this one because I wouldn't normally go in this direction, probably leaning more towards the meat heavy ones.  But the combination of the squash blossom with the bagna cauda was so delicious, and that crust!  Wow, what a great bite!\n\nOur final course was the roasted veal chop, the special of the night.  If they mention they have the veal chop available, GET THIS!  I could not believe how perfect this veal tasted.  I'm not one to get veal, but the meat was perfectly cooked with a tenderness and juiciness that was delicious.  I had to cut every piece off of that bone and was tempted to knaw every last piece off.  Even the staff were coming up to us mentioning how jealous they were that we had it because it sounded amazing to them when they found out it was going to be available.  I felt bad that they didn't have a taste before opening, but I think they mentioned they only had 7 or 8 available for the night.  Yay me!\n\nDessert looked ok on the menu, but we passed as we decided to go to their new sister restaurant downstairs to try some pie (another review coming shortly).  That didn't stop them from bringing us some peaches and some cookies from said downstairs restaurant with the check.  Nothing better than having snacks to go after such a delicious meal.\n\nService was good with no mishaps.  The chef went around to a few tables to check if people were enjoying their meals.  I wish he came to our table to I could thank him for the veal.  Maybe next time.  And yes, there will be a next time!  Make sure to get a reservation and come with friends so you can try more items together.  This place has a lot going for it and I can't wait to see how their menu changes with the seasons.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "Got an 8pm res last night randomly and jumped on it!\n\nWe waited at the bar for a bit but never ended up getting service, they were too busy making other cocktails so we just sat down at our table.\n\nThe menu had lots of great choices.\n\nWe heard that the squash blossoms were good and pizza.  As quoted by my girlfriend \"the pizza has crazy cheese\"... Yes it does.\n\nThe squash blossoms were yummy, I wish the portion was bigger, we got 3.\n\nThe mushroom and sausage pizza was great, you could really taste the spice of the chili and the slices of mushroom and cheese added to it.\n\nWe were all a bit underwhelmed by the papparadelle.  I think it was a tiny bit dry. Bb\n\nThe porchetta was sold out : ( but the lamb was delicious.  Solid backup.\n\nThe squash blossom pizza was the winner of the evening.  I wanted to just eat it... All of it.\n\nGo there and order that.\n\nI'd love to go back for that porchetta though.", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "I had heard little things here and there about how Che Fico was a must try, hot new restaurant. So, as I was planning a trip to San Francisco, I knew I had to make a stop here. I was especially excited because Bon Appetit magazine had named it one of the best new restaurants in America. So, I woke up at 3am (midnight Cali time), to make my reservation the second they opened up. The restaurant take reservations 30 days out. \n\nWhen you walk in the door, you immediately go up a flight of stairs to get to the hostess stand. The tiled floor was gorgeous. The walls were lined with a loud, fig printed wallpaper. Cured meats were on full display. The restaurant was buzzing, and all the seats were full. I loved the fresh ambiance, especially the old school hip hop that was playing. I thought the restaurant was Italian, but the menu actually describes it as Jewish-italian. \n\nI was seated shortly after my reservation time of 8:30. When I made the reservation on open table, I had requested \"counter seating\", which was right up against their open kitchen. It was fun because we got a front row seat to the chefs in action. I would definitely suggest trying that out. The rest of the restaurant had some some tables and then some larger tables for communal seating. \n\nWe were immediately greeted and asked to please put in our complete order. \n\nWe started with the small chopped salad, which was a large enough portion to share between two people. It was a sort of classic italian salad with mixed greens, olives, chick peas and cheese. This was delicious. It had a nice zest to it.\n\nI kept seeing the fried risotto at everyone's table, so we tried an order of that. It was only $5, so why not? It came out, and it was barely hot, and honestly not that great. We shared one order (one fried ball), and didn't even finish it. \n\nWe opted for pasta, as we were craving a nice hearty sauce. They just weren't that good. The presentation was gorgeous, but unfortunately it looked way better than it tasted. The portion sizes are small, so this is definitely the type of restaurant where you can order a few items and try a bunch of things, but we just weren't impressed, so we decided against trying anything else. \n\nThe restaurant staff was really nice, and they brought out some free cookies/ dessert for us because we were celebrating. \n\nOverall, the service was good, the restaurant itself has a great vibe and is really beautiful, but the food just didn't measure up to my high expectations. Perhaps we ordered wrong?  Sadly, this was a miss for me.", "author": "Mai E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Che Fico is fine. I would go back for a few of the dishes I tried. But would I wait a month for another chance to dine there? Probably not. \n\nFour of us patiently waited for our Che Fico Day and when we arrived we were seated by the friendly staff. We ordered the papparadelle al ragu, an octopus salad, and two pizzas to share. The papparadelle and salad were both quite tasty, but the pizzas left a little *something* to be desired. It wasn't that they were bad .. they're just weren't mind blowing. The crust was delicious; I think the toppings were what we didn't love. \n\nI'd gladly return and nosh on more pasta and try a different pizza, but I'll probably wait until some of the hype dies down.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-21", "description": "I'm not exactly sure what the hype is around this restaurant. I might have to go back a second time to see if my first impression holds. I had to make a reservation a month in advance and even then, I only managed to book bar seating. \nWhen we were waiting to be seated, the couple behind us didn't have a reservation and were told it's a 4 hour wait or were welcome to try their luck at the bar. The bar was about 5 people deep so we didn't even try to order a drink before being seated. \nOur server was lovely and the food was fine, just nothing really blew me away that I needed to come back and have again. And then I ordered coffee that they delivered about 5 minutes later and I had to wait for them to come by again to ask if there was any milk or sugar coming. Such a small thing but indicative of my experience there.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "When you first arrive, you're going to be confused, but it's right next to BOBA GUYS! Go up the stairs, it's tricky, they do have an elevator, but I haven't found the entrance for that yet. Go up the stairs with their fancy wallpaper. And there's also a mirror to the right of you before you reach to the top. I swear, many people leaving are just doing selfies before they leave! \n\nIt's a pretty fancy restaurant with a bar and cafeteria seating with large groups of people, but they do have cozy intimate seating for the 1 or 2 tables. \n\nAnyway, we walked in and checked in as our group wasn't there yet. The host suggested we wait at the bar, but it was packed! We decided to just stand along the fig and fig tree wallpaper with a hidden door for coat and bag check in. \n\nI think the hostess felt sorry for me because she sat me at our table for 6 because the rest of the party was late, shame on them!!! \n\nOK, I have to be honest, it was REALLY hard to get a reservation for this restaurant, book early if you have to, we were celebrating a lot of birthdays at the table!!!\n\nI think we had 3-4 bottles of wine... but the food, we had the grilled duck liver, pineapple pizza, spaghetti with truffle, sausage pizza, slow roasted half lamb loin, 2 octopus and pork belly appetizers, cappelletti, and 3 kinds of desserts, Coffee Pavlova, Crostata, and 2 kinds of gelato... \n\nWas it good? Hell yes! It was so delicious.. if you like the seafood/liver/pizza/stuff like that.. I felt the food was fresh!!! The Lamb Loin is soooo tender.. and it just melts in your mouth... like wow... I don't think I have ever ate something so tender before. \n\nOh yeah, if you decide to get their pizza..... and see that the crust is black? It's normal, and i was hesitant at first, but... omg! it's very delicious!! it doesn't taste like that nasty black burnt taste at all!! \n\nYou do pay for what you get, if you think it was a bit pricey, you're right... because the food and the service is really good. \n\nThey do get packed, so make reservations if you can!! The waiters and waitresses were very attentive, I didn't have to flag anyone down to get me more water, I didn't have to wave them to get their attention. They were always there. \n\nMust eat - pineapple pizza, octopus and pork belly, lamb loin, their ravioli dish, OK, just order them all!! \n\nI will def come back... !!", "author": "Eugenia W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "We dined at Che Fico tonight and as much we would like to be back to try the rest of the menu, we will simply stay away due to bad service. \n\nOur reservation was at 5:45. We were seated immediately and since we knew what to order, we order the appetizer( octopus and pork belly) right away. We got our drinks around 6 p.m however our appetizer didn't show up to our table until 6:30!  Our server was assisting other tables and didn't check on us at all. \n\nBy 7:15 we received our main course, chicken and pasta with fava beans. They were both delicious. \nThe chicken is a very large order and can be shared for sure. My husband wasn't able to finish the entire meal so we asked for it to be wrapped to go. \nWe waited for about 15 minutes for our check to arrive and had to wait another 15 minutes to request for the credit card to be picked up as we were tired and ready to go. It was 8:30 at that time. \nBy the time we got home, we realized that they forgot to give us the leftover. \n\nFor such a poor service, I'd go back to much better places for Italian food such as Cotogna by Michael Tusk or A mano for a much reasonable price.", "author": "Ghazal P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-30", "description": "My two friends and I made reservations nearly a month in advance and we could still only get seats at 10pm on a Friday night. The day of, we wistfully tried to walk in multiple times starting from when they open at 5:30pm and were repeatedly told that the wait would be four hours. The most amusing part is that the staff say this as if it's a normal thing to wait four hours for a meal. It wasn't entirely devastating since we already had reservations, but the strangest part is that some guests who were told this appeared to be nonplussed and calmly headed over to the bar to kill time. For four hours?! Still confused. In any case, definitely make reservations if you plan to go. \n\nFor all the hullabaloo, I would sum Che Fico up as average delicious fancy food but in a stellar physical environment. I absolutely adored the ambiance and aesthetics. The first thing one notices when one enters the staircase leading up to the restaurant is the colorful fig wallpaper. Once in the dining area, everything is transparent and hence one feels immersed in the cooking experience: there is a smoker filled with meats against one wall, and one can watch the numerous staff assembling every dish in the well-lit kitchen area. The standout element to me were the staff's tasteful coordinated floral dress code and bandanas, cohesive but not the typical matchy-matchy. \n\nMy friends and I shared the gazpacho, pasta with bolognese sauce, squash flower pizza, and potatoes with lamb drippings. Everything was good, but not nearly as mind-blowing as the price would suggest. The gazpacho was probably the most notable dish, a cool smooth tomato-y puree with fresh vegetables and fruit pieces at their peak ripeness. The pasta was delicious but the portion of maybe six to seven noodles total was painfully small. I liked the sharpness of the cheese on the pizza. The potatoes were completely unremarkable, literally a large goblet of baked potatoes. At the end of the meal, they gave us wedges of a special hybrid peach and plum, which tasted exactly like what one imagine given the description, and yummy. The waiters did their job but weren't particularly hospitable, for being at a fancy restaurant. Definitely an impressive date spot, but the food itself is not extraordinary so don't get unduly swayed by the hype.", "author": "Amy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-29", "description": "I was super excited when my friend told me that a new Italian place opened in Nopa. I tried to get a reservation, but it took me a few months to do so. My dad and I ended up going on 10/26 at 9:30 because it was the only time we could get, but I completely regret it. \n\nWe got seated immediately and the waiter was pretty nice. She came over and with her help, we ordered the Indian Summer Insalata, the Pear and Lonza, Papparadelle, and the Zuckerman pizza. My dad also got a glass of wine. \n\nThe lady gave my dad a glass of wine that was 18$ and barely filled at all. It was probably 3.5 ounces and this was just aggravating, unnecessary, and not a good way to start off the meal. \n\nOur first course was the pear and lonza. It was very average, expensive, and the portions were TINY. The pear was very hard and the prosciutto was flavorless. My dad and I were convincing ourselves that it was worth the $12 and the months of waiting. This was not easy.\n\nThe waitress finally came over with the tomato salad, and we were hopeful about this one, considering that the restaurant dedicated a whole paragraph talking about how the \"Dirty Girl tomatoes\" are still in season and very flavorful. \n\nThe tomatoes were not fresh at all and the cheese tasted cheap and not high quality. The peppers and the beets were super hard and tasteless. Again, the portions were small once again and the salad was $18! \n\nAt this point, we were really regretting our decision to come to the restaurant, and we asked the waitress if she put the rest of the dishes that we ordered in and she said she did.  \n\nNext, the pasta came. It was TINY and it was $28!! The pasta was overcooked and the meat sauce was mediocre. We decided at this point that it was not worth waiting for the last dish, and we decided to pay and leave.\n\nThe waitress came over and we informed her of our decision. Within a few minutes, a manager came over and asked us why we decided to leave. She defended the portions, and claimed that they \"measure the wine to be exactly 5.5 ounces\" and that the \"portions are small because they are meant to share\" which doesn't even make any sense. The restaurant was unapologetic and the bill was still 70$ for barely any food,  food that wasn't even good!\n\nI really don't like overrated places and this place definitely fits into that category. People will soon realize that the food isn't even good and it is insanely expensive.", "author": "Conor H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "All. Hype.\n\nI was wondering why this place only had a 3.5 star review from Yelp, but after tonight, I understand.  \n\nThe service, while the servers are nice, they are very, very, very slow.  Our reservation was at 5:45PM.  We arrived at the restaurant at 5:47PM and was seated right away.  It took until 6:04PM for a server to finally greet us and she thought we already had our drink orders (no, false... no one said anything to us for a while).  That's usually recoverable since the servers did seem to be in the weeds.  And honestly, this is really all about the kitchen because between our appetizer and our entree, it took almost an hour to get our food.  We had a manager-like lady swing by asking if we liked our food, but the food came out soooo slow that it wasn't enjoyable.  She later came by to say \"oh, I told the kitchen you'd like your food paced faster,\" but she failed to recognized that we've waited an hour between our super fast appetizer and our next course. Of course, after we've mentioned the timing, all of the sudden the rest of our food came out.\n\nFor appetizer, we tried their Salmon Crudo, which was good and it came out fast.\n\nOur entrees were:\n* Spaghetti Arrabbiata - the pasta was undercooked (and no, it was not al dente, a bit harder than that), the sauce was spicy so they were not kidding with the chili.\n* Garganelle - this was recommended by our server because the pasta is made in-house and allegedly takes a long time to make.  It was okay.  Not memorable, but this one was filling.\n*  House-made Mortadella, Ricotta Cheese, Pistachio, Avocado Blossom Honey pizza - this was the second best thing I had.  The pizza is legit there and the mortadella was very flavorful.\n* Polenta - this was solid, but if they failed this... I have no words.\n\nDessert:\n* Pistachio gelato - the only thing they did correctly here.  The gelato is solid and the pistachio was very flavorful.  \n\nOverall, I do not recommend this place.  I came here because a friend said they have \"life-changing pasta\" and honestly the only thing that changed for me was my appetite for this place.  The reservation was difficult to come by (we asked Amex to secure it for us) and I just don't see the hype.  Yes, it's a trendy place for now, but if you're going to be trendy, let's cook the pasta correctly and learn how to pace the food at a more reasonable time.", "author": "Sandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "I really enjoyed my experience coming to Che Fico, the ambiance is just fantastic, welcoming and exceptionally chic. The cocktails were on point, mouthwatering really with amazing flavors.  To start, we got the chopped salad, which I really enjoyed and loved the big chunks of cheese and salami and much more! The Sardines with the beautiful tomatoes and balsamic were delectable.  \n\nWe then shared a pizza with yummy toppings, including my favorite *Pineapple* haha so naturally I enjoyed it.  I do have to mention that crust is usually my favorite part of a pizza (not really, but I do LOVE the crust) and this pizza's crust was extremely burnt and so large that you lost about half of the pizza.  We also shared the chicken and it was pretty good but definitely nothing spectacular. \n\nI do have to mention that I was pretty disturbed by the $65 Gnocchi on the menu, which was super disappointing to me because I really love Gnocchi, it is actually my favorite pasta but I felt bad ordering it because it was so expensive and didn't make sense. The waiter mentioned that it was small and he had complaints that the dish only had 8 pieces (which I believe to be accurate although I would be extremely disappointed if so).  He also said that it contains 8 grams of Black Truffle, which is about a gram per gnocchi. IDK about all of this. HAA\n\n\nRegardless, our waitor was amazing and so fun with the best personality. he definitely made sure we had a great experience and was a large part in my phenominal experience! Definitely worth a try :)", "author": "Ellie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Best meal, in every respect that I've had in a long time.\nWithout too many details every course was memorable and ( dare I say it)? Exquisite!  Textures, flavors, combinations all were unexpected and worked amazingly well. \nThe place was casual and pleasant. Whitney, our server, was great with suggestions and was dead on.\nA little pricey but worth every penny!\nOh, I can't forget the great cocktails!", "author": "Merideth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Worth the wait? Maybe. Be prepared to spend an arm and leg too.\n\nDelicious and a little more special? Yes. The squash blossom pizza was amazing.", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-17", "description": "My girlfriends wanted to check out Che Fico. Since getting a reservation for a normal dinner time is near impossible, they went in first on Friday, August 10th before 6pm to put our names down. Our party of four ended up seated around 7:45pm at a communal table. While waiting, we went down the street to a bar for a few drinks. I believe they texted us when the table was ready.\n\n*WOOD FIRED OCTOPUS SALAD: Fiddler's Green Farm marbled potatoes, fennel, parsley & chili flake ($24)\n*GRILLED CHOPPED DUCK LIVER: onion marmalatta, purple daikon, pickled onions, roman matzo ($13)\n*SPAGHETTI ALLA CHITARRA: Australian black truffle, pecorino romano ($45)\n*PAPPARADELLE AL RAGU: bolognese, 48 month parmigiano reggiano ($28)\n*PIZZE: SUNGOLD TOMATO, DOUBLE 8 DAIRY MOZZARELLA, BASIL, CACIOCAVALLO ($20)\n*OLIVE OIL CAKE - ELDERFLOWER GELATO, STRAWBERRIES, LIME ($13)\n*DEEP DISH BERRY CROSTATA - WOOD FIRED, BROWN BUTTER CRUMBLE, FIOR DI LATTE GELATO, SEMOLINA, SALT ($14)\n*BERRIES: mint, smoked maple, ver jus rouge, chocolate bitters, gran classico, gin ($16)\n*KUMQUAT: cappelletti, dry vermouth, prosecco ($10) x2 \n*CAFE: cold brewed coffee, montenegro, sweet vermouth, absinthe, rum ($14)\n*Guido Porro Dolcetto d'Alba 'Vigna Pari', 2016 Piedmonte ($53 bottle)\n*Caravaglio Malvasia delle Lipari Passito ($20 glass)\n\nMy favorite dish ended up being the pizza. The crust had this wonderful soft chew. And I loved that there was cheese on the crust as well. The octopus salad was also tasty. Tender and chewy. I love liver, but this dish was a little too sweet for me. And the liver itself was a little irony. The truffle pasta was really disappointing. It had a strong bleach-like smell which was off putting. I don't know if it was coming from the actual plate or the pasta, but it ruined the experience of a truffle pasta as I love the smell of truffles. The papperadelle was better. Though I wanted more meat and sauce. Both pastas were a good al dente. I'm not big on desserts, so I thought both were okay. My cocktail was light and fruity which I was in the mood for, so it worked in this instance. They gave us Salted Fruit at the end of the meal. I can;t do sweet and savory, but everyone else seemed to like it.\n\nOverall, I think the food was okay. I know this is one of the new hot spots, so I'm glad I checked it out. But I'd only come back for that pizza. The pastas definitely fell short.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Che Fico is one of the better \"new\" restaurants I've been to this year. It seems like there is consensus on this based on the long lines to score walk-in seating. If you're able to secure reservations ahead of time, that is highly recommended. Otherwise, you'll need really nice friends like mine, who work in the city and can haul a$$ to wait in line before the restaurant opens at 5:30pm. Unfortunately, your entire party needs to be present before they will actually seat you. We JUST made it in the nick of time to score the last table. We tried:\n\n-Wood Fired Octopus Salad (Marbled Potatoes, Fennel, Parsley, Chili Flake, $24, https://www.yelp.com/user_local_photos?select=uSzGrvfsuVIaqf3j0d4fTA&userid=76vIFZcC7owykCBjMfGVXg): Delicious- the octopus was super tender and cooked perfectly. I loved the pairing of ingredients in this dish- highly recommended!\n-Melon & Lonza (Bergamont Mint, Avocado Blossom Honey, $15, https://www.yelp.com/user_local_photos?select=rCOrJKyikZuvCTMLgoE-wg&userid=76vIFZcC7owykCBjMfGVXg): The melon was super ripe and juicy, but the house cured lonza wasn't quite fatty enough to hold it's own against the melon. I would have preferred Lardo instead, but my tastes skew towards the fattier foods. Still recommended.\n-Suppli (Fried Risotto, Tomato, Fontina, $5/each, https://www.yelp.com/user_local_photos?select=qsvMmVrOQKNA9idzhB-dLQ&userid=76vIFZcC7owykCBjMfGVXg): Just ok, but worth trying once. I thought this was basically an oblong shaped aracini- rich and creamy on the inside and very crunchy on the outside. It was a little overfried for my liking though- skip!\n-Warm Beef Tongue (Salsa Verde, Crispy Capers, Celery, Pickled Mustard Seeds, $14, https://www.yelp.com/user_local_photos?select=hZDuK88P3qJNKC1C0a9qMg&userid=76vIFZcC7owykCBjMfGVXg): The beef tongue was cooked really well, and super tender. I loved the salsa verde, but the capers and pickled mustard seeds made this dish a little too acidic overall. I would have preferred the mustard flavor in a different format. This dish is worth trying once though.\n-Spaghetti alla Chitarra (Australian Black Truffle, Pecorino Romano, $45. https://www.yelp.com/user_local_photos?select=IzF8bluYT_L8v29JGdloFg&userid=76vIFZcC7owykCBjMfGVXg): Yes, this dish costs $45, but they give you a heap of shaved black truffle on your pasta. The pasta is also freshly made, and cooked al dente, so it has that great chew. This was one of my favorite dishes- highly recommended!\n-Pineapple, Red Onion, Fermented Chili Pizza ($20, https://www.yelp.com/user_local_photos?select=5I7jFq39nTj-Kq0OBOTCrg&userid=76vIFZcC7owykCBjMfGVXg): I loved the toppings on this pizza, and that it had some spice to it. However, the crust was way too thick, and there wasn't enough topping to crust ratio. This pizza is still worth trying once though. \n-Che Fico Wood Fired Chicken (Agrodolce, Chilies, Onions, Creamy Polenta, For 2/$29, https://www.yelp.com/user_local_photos?select=CXo7f4xT--3hBRnkm-_56g&userid=76vIFZcC7owykCBjMfGVXg): The chicken was roasted perfectly, and juicy and moist. However, the agrodolce was leaning too acidic for me, and I wish they paired the chicken with another sauce. The polenta was really good, and very creamy and rich. \n-Side of Succotash ($8, https://www.yelp.com/user_local_photos?select=7ENqZLrkzPBVxtgQ7rK9tw&userid=76vIFZcC7owykCBjMfGVXg): Just ok, and again, there was a lot of acid in this succotash. They only give you one small slice of grilled eggplant, so this dish is mostly corn- skip!\n-Complimentary Dessert: Pluots w/Sea Salt & Chili Powder (https://www.yelp.com/user_local_photos?select=q-jsxVQNxNY10BZTIui04A&userid=76vIFZcC7owykCBjMfGVXg): Yum- who knew such a simple combination would be so delicious? The crunch of the pluots went well with the salt and chili.\n\nService was solid, but not very warm. I'm not sure if our server smiled at all during our meal, but he was efficient. However, he disappeared towards the end of our meal, and we had to flag him down a few times to ask for the check, etc. We decided to skip dessert since none of their options looked that great. \n\nOverall, this was a very good dining experience, and Che Fico has an extensive menu, so I'll have to be back to try more pasta and pizza dishes. Parking in this area is really tough, but there is free street parking after 6pm.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-06", "description": "I don't really understand the hype of this restaurant. When I went, I had a reservation at 10:00 pm, which was already late and they did not serve our food until 11 pm!! The service was terrible. We got a pizza and a pasta dish, which were both not very noteworthy. It is so expensive as well. I do not think this place is worth it unless you scored a reservation at a decent dinner hour.", "author": "Gracie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-20", "description": "The service was terrible. First, we waited 30 minutes past our reservation time. We ordered drinks at the bar while we waited. The cocktail server demanded a credit card when we ordered the drinks. We were then seated at our table, but my credit card was not returned. When our drinks were brought out, the hostess asked for the last name on the card. I thought she was going to run it for the drinks and bring it to me. Nope. After 45 minutes I asked our server to rescue my card. He acted like this was an obscene request, and shoved my card at me when he returned. When I enthusiastically thanked him and said I had been worried I would forget the card, he flatly said, \"I see.\" and walked away.\n\nIn general, our main server was surly and rude. He cut me off when I was trying to order. He continually walked away while people at the table were mid-sentence ordering beverages. A second server was clearly sick and coughing into her hands all night and chugging from a water bottle she kept on the counter where dishes were placed by the kitchen for service. She kept touching her face and hair while running dishes to tables.\n\nTwo appetizers came out, and then we waited nearly an hour for the pasta dishes and the rest of the meal. One of the dishes we ordered never arrived. No explanation whatsoever. Due to the massive gap between courses, we were the last table at the restaurant. We were not offered desert, and a second server tried grabbing the plates away while we were still eating--TWICE!\n\nThe food itself was nothing special and definitely overpriced. I also bit into a bone chip in the pizza which was incredibly unappetizing.", "author": "Gianna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "I am such a fan of Che Fico!\n\nWe somehow scored a last second reservation at 6pm and we're super stoked to check this place out.  They do have seats at the bar if you want to go the first come first serve route.\n\nI imagine that if I ever opened a restaurant...it would be something like this.  I loved the feeling, the ambiance, open kitchen, and cured meats within view.  What really brought everything together was the service.  I absolutely loved our servers.  Both were super attentive, friendly, informative, and just made our evening special.  \n\nWe started off with the chopped salad.  I loved the fresh ingredients, cubes of cheese, and cured meat.  I thought everything came together really well and I'd definitely order it again.\n\nWe also went with the octopus and pork belly antipasti.  I was really impressed with how the octopus was cooked.  I'm normally not a fan of cooked octopus but in this rare moment, I thought the octopus outdid the pork belly.  I can't believe I just said that!\n\nNext was the pineapple pizza.  So the pizza was definitely different.  They focus on their wood fired crust which may come across as burnt but really went well as far as flavor with the rest of the ingredients.  Every ingredient appeared to be ridiculously fresh and appreciated that.  It does have a kick so beware if you can't handle spice. \n\nWe also ordered the handmade orecchiette which was delish.  Again, every ingredient stood out and it was a highlight of the evening. \n\nFor dessert, we opted for the chocolate budino and olive oil cake.  Out of the two, I liked the olive oil cake better.  Once again, I was never a fan of olive oil cake but it was delicious here.  \n\nThey don't have their salume plates yet as they are trying to perfect the process.  From what I was told, they are going to hire someone who is completely focused on the cure meats to ensure that every plate comes out to a high standard.  I can appreciate that.\n\nI can see why reservations are so difficult to get here.  I am in love with this spot and can't wait to come back.  Hopefully, I can score another reservation at some point!", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "Hot ticket.\n\nYes, make a reservation.\n\nI was so eager to get in here that I booked 11:30.  PM.  That was the only time slot that was available for Friday night.  I hate eating so late, but I had to do it.  Hype.\n\nWe showed up around 10:30, & the hostesses were sweet & accommodating.  We were told that they might be able to seat us before 11:30.  Cool.\n\nThis joint rocks.  Literally.  I LOVED the music.  Spacehog came on.  SPACEHOG!  (Song: In The Meantime).  That just added to the whole thing.  \n\nThe whole hip/cool thing I guess.\n\nFood & service were fast.  Our courses were carefully timed.  The chopped salad had been previously raved about, but honestly it did not come close to blowing my mind.  Same & same for the caciocavallo.  I'm a long time Josey Baker fan, & who doesn't love fried cheese?  But it was heavy handed, w the cheese overpowering everything; not to mention being difficult to cut through.  Pass.\n\nThe tagliatelle ragu pasta, on the other hand, was just superb.\n\nAnd the chopped duck liver?  Fantastic!  The best preparation of duck liver that I've EVER had.  \n\nThe olive oil cake was a perfect finishing touch.  Moist & light, w strawberries & gelato...a refined sweetness that was pure delicious.  \n\nUnfortunately this was not a pizza night for us.  But we will obviously have to return for the pineapple chili pizza soon.  \n\nIt was packed.  Standing room only.  Wait list for tables & the bar if you don't have a reservation.  MAKE A RESERVATION!\n\nSuper cool.  Super fun.  Rustic Jewish Italian.\n\n4 & 1/2 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "dinner review. \n\n4 - supplí (fried rice ball, tomato, provolone)\n\n3 - grilled chopped duck liver (onion marmalatta, purple daikon, pickled onions, roman matzo)\n\n4 - paccheri carbonara (house-made guanciale, pecorino romano, black pepper)\n\n4 - papparadelle al ragu (bolognese, 48 month parmigiano reggiano)\n\n5 - mushroom, sausage, mozzarella, calabrian chili\n\n3 - pineapple, red onion, fermented chili\n\n3 - house-made mortadella, ricotta cheese, pistachio, avocado blossom honey\n\noverall, \"i'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "...a two hour wait ensued. WHO ARE THESE PEOPLE WHO HAVE THEIR LIVES TOGETHER AND CAN BOOK RESERVATIONS WEEKS IN ADVANCE?! \n\nI don't even know what I'm doing for lunch the same day, let alone dinner three weeks from now. Will I even be alive?!\n\nAnyways--Che Fico. \n\nIt was delicious. We put our party of two on the regular wait list and bar wait list (there are two) at 7:30pm Friyay and two hours later were seated.\n\nDrinks:\n-bergamot: couldn't taste the alcohol, was delicious nonetheless \n-rosemary: smoky and strong\n-some California pinot from 2016: I'll drink anything in a bottle\n\nFood:\n-suppli: TO DIE FOR. ORDER THIS! fontina, tomatoes, rice.. WHAT MORE IS THERE TO LIFE?\n-polenta: great execution, generous portion, smooth as butter\n-rack of lamb: says it serves 4, but maybe only really 3. Good thing we were only 2. Have a lot of leftovers. Really tender and delicious.\n\nGreat service and ambience, would come back to try the grilled liver and kidney. Also, great wallpaper.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Welp, we have a new favorite restaurant in San Francisco for yours truly! Che Fico, welcome to the city and I'm so glad you're here. After many years of this place trying to get open, it finally opened it's doors a few weeks ago and seems to be the talk of the town. Long waits to get a table, reservations booked out for months and deservedly so...\n\nI was able to get a table last Thursday with a friend of mine and we tried a little bit of everything on the menu and really took in the atmosphere. Before I get into the food, let's chat ascetics. This place is beautifully designed and with the open kitchen and radical bar set up, it's sure to be a busy place for years to come. The highlights for me were the wallpaper accents and vaulted ceiling, just nails. \n\nAs far as the food goes, everything was thoughtfully done and beautifully presented. Default to my photos for this review because I can't remember the names of all the pastas we consumed but, they were elegant and so well done. The chopped salad was super tasty and reminded me of Nancy Silvertons in Los Angeles at Mozza. Boo ya. Lastly, the pizza crust was heavenly. Wood fired and almost burnt...just the way I like it! \n\nWelcome to San Francisco Che Fico, you're an awesome addition and I wish you all the success in the world.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "It has been a long while since I felt the need to review a place immediately.\n\nOne of the best dining experiences all around.\n\nFood was 10/10. Everything. Our server was very enthusiastic in his recommendations which is always a huge bonus!\n\nAll elements were so thoughtful and BALANCED - textures, flavors, heaviness and lightness.\n\nSummer salad. Our favorite dish of the evening in fact. Just as our server had warned :P Various summer fruits and veggies tossed with croutons in this incredible light and savory cold soup.\n\nOctopus salad. I've had a lot of octopus lately but this was the best thus far. Nice char, perfectly sized portions, again a lovely light citrusy overtone with fennel, gorgeous. \n\nRicotta stuffed squash blossoms in light tomato sauce. Even this was surprisingly light, somehow distinctly set apart from the numerous samey iterations you will find everywhere else. \n\nCharred eggplant with stuffed pasta of some sort. Tons of beautiful sweet corn, nutty and sharp cheese [what is that cheese...I know it but can't recall at the moment] - the incredible surprise is again, the bright citrus acidity that balances this pasta dish.\n\nOrecchiette in a pesto walnut sauce. I got reeeally full right about here so this one felt a little heavier. Even so, a different and memorable variation of a familiar pasta.\n\nBitter chocolate budino. AMAZING. Texture, sweet, savory, bitter, balanced, perfect. \n\nCocktails were FABULOUS. We got two of the Classico because it was just heaven. \n\nTruly, well done, Che Fico. WELL DONE.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "4.5 STARS\n\nHype.\n\nIt always causes a big frenzy with long lines and hard to get reservations at restaurants.\n\nThen, after waiting and waiting, and finally getting a taste of that much hyped about item, it often leads to disappointment of \"That's it?\"\n\nHow many of us have been there?\n\nIt's like taking Patty Stanger's advice of \"no sex before monogamy\" and when you finally let the cookie out of the cookie jar, it lasts a whole 10 seconds.\n\nThat's it?!\n\nLadies, you know what I'm taking about. So...\n\nHooray for foodgasms! And, it can be found here at Che Fico because the hype is real.\n\nChe Fico is the current SF hot spot from a Flour + Water, Eleven Park Madison, and Craftman & Wolves alums so you know it IS going to be good.\n\nAlthough they accept walk-ins, reservations are a must on the weekends. Plan ahead, because it's currently hard to get (I made reservations 3 weeks in advance).\n\nThe Cal-Italian menu is divided up to antipasti, pizzas, housemade pastas, entrees, and peasant comfort food (yas to gizzards and beef tongue!). Prices are fair for SF standards, expect to spend around $60-$70 pp (pre-tip w/ 1 cocktail).\n\nWhile perusing the menu, I ordered the Concord Grape w/ black pepper, cucumber, lime, soda ($8) and asked our server if they can make it with booze (+ $4 grey goose): https://bit.ly/2JP1x8h. It was like sparkling grape juice with a spicy finish but you couldn't taste the alkie. \n\nSince it was our second dinner, we only ordered several items to sample:\n\n*Corned Beef Tongue w/ pickled mustard seeds, salsa verde, crispy capers, shaved celery ($14): https://bit.ly/2EP1C8n\nBeef tongue is so underrated and I always order it at taquerias and Asian eateries. For \"peasant comfort food\", Che Fico's rendition is the most refined take I've seen. It was tender with a nice, acidic bite from the mustard seeds and a nice crispness from the shaved celery. This would be awesome as a cold cut in a sandwich. \n \n*Caciocavallo: Fried cheese, wsr meyer lemon preserves, espelette, josey baker molasses rye ($12): https://bit.ly/2HqNKX2\nHello, cheesey wet dreams! The thick layer of caciocavallo was crisp and nutty around the edges and deliciously melty in the center. However, someone was heavy handed with the lemon preserves so it was overwhelming tart and perfume-y.\n\n*Goats Milk Ricotta Gnudi w/ ramps, spring garlic, leeks ($21): https://bit.ly/2qwrHoj\nThe gnocchi-like ricotta dumplings were pillowy soft and the fried shoestring leeks provided a fantastic textural contrast. It reminded me of a dish I had at Protégé in PA that I loved but I like this a touch more because of the fried leeks. \n\n*Pineapple Pizza w/ fermented chili, red onion ($20): https://bit.ly/2qB8BfT\nOK, I know what you're thinking: pineapple on a pizza? WTF, it's a cardinal sin but you MUST try this one! The hype is real...\n\nThe charred leopard spotted crust is bubbly and aerated, and the bottom crust STAYS crisp unlike neapolitan pizza. And, whoever thought to shave parmigiano on the crust? F*ckin' genius! It elevates it to a whole new level. The paper thin slices of pineapple along with the fermented chili and melty cheese produced a mouthwatering salty-sweet-spicy combo that makes me salivate when I think about it. Yea, it's not traditional but it's the most delicious and unique pizza in SF! GET IT! \n\n*Olive Oil Cake w/ malted yogurt gelato, roasted strawberry vinaigrette ($12) & Fior de latte & Salted caramel gelato ($8): https://bit.ly/2qzyOeE\nA perfect ending to a great meal, the house-made gelatos were excellent. The fior de latte's milky creaminess was our favorite, then the salted caramel, and malted yogurt. The olive oil cake was good too but the gelatos took that cake!\n\nAs for service, I read mixed reviews with some saying, it's terrible and rude. Depending on who you may encounter, it's true...\n\nWe arrived early for our reservations and took a chance by asking if we could be seated early. The hostesses said, our table wouldn't be ready until our reservation time. No problem, we'll grab a drink at the bar. There was no room in the bar but there were seats in the waiting area several feet away (nowhere near the entrance which is downstairs). I told the hostess that we were going to grab drinks and wait in the waiting area. \"Umm, you'll probably get kicked out\", she said. WTF?! We left and went across the street to Mini Bar for drinks. \n\nThankfully, once we returned and were seated, Aimee, our server was fantastic. She was warm, knowledgeable, and made great recommendations. Food service was prompt and properly coursed out. \n\nThe owners and designers of Che Fico have done an excellent job transforming the former autobody shop. It's rustic, yet hip with the beautiful floor tiles and fig wallpaper motif and an open kitchen. Bad acoustics though as it's loud AF but they play awesome 90s hip hop - 112, Tupac, Notorious B.I.G, and TLC. Heeeeeyyyy! \n\nChe Fico has completely ruined pizza for me. Ahhh, I can't wait to return....", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "Super delicious food. Love the atmosphere resembling a true New York late night dining setting. Great drinks and friendly staff. We had a group dinner (10+) and was the perfect setting for the celebration, food coming and going smoothly and timely.", "author": "Jordan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Pizza on fleek, wall paper on fleek, dessert on fleek, waiter on fleek. Really this place is fleek-y A.F. ya know?\n\nHard to get a rez, but next time you're awake at 12am contemplating mortality you can pop open your opentable app and make a reservation 30 days in advance before all the yahoos wake up the next day to snatch yo weave. At least, that's what I did.\n\nShout out to their silverware. Not something I usually notice at a place, but theirs was nice and weighty. Appropriate for the venue.\n\nCusine is basically califonian/italian (i.e. arugula on yo pizza - don't skimp!) I'll be coming back for you, Che Fico.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-17", "description": "For a 'one month' wait for our reservation, we were a bit underwhelmed. The dishes were good, but this probably won't be added to our restaurant rotation. We started out with the house cured anchovies, bigoli nero, lamb loin, and a berry dessert that I can't remember the name of. Of the four dishes, the part that stood out were the potatoes that came with the lamb (they were mini potatoes fried to perfection). The restaurant itself if super cute and lively. Wouldn't mind coming back for drinks and light appetizers maybe..", "author": "Kim I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "I live around the corner and have been following the progress here for the last 2.5 years. Obviously a lot of anticipation built into that and they hands down, absolutely, incredibly deliver.\n\nI've eaten here 5+ times in just the couple months they've been open. \n\nThe space is beautiful and fully realized. It's not the typical overcrowded \"industrial\" (ie unfinished) design of many SF restaurants. Cohesive decor, top quality fixtures and finishes, great view into the kitchen, great views of the neighborhood, great music, little details like amazing fresh flower arrangements.\n\nThe service is impeccable. All levels - check-in, servers, waiters, managers, etc etc etc. Everyone is friendly - it feels like they have tons of time for you even in the middle of a very busy restaurant. A huge treat to sit at the chef's counter and watch up close at the skill that goes into cooking and preparing each dish; plus being able to ask questions about technique and ingredients.\n\nThe food - dang. Try it all! There is always something new. It's awesome to see them continually exploring and changing. I now have absolute favorites I have a hard time not getting, but also every time see new things that are must try. Have not been disappointed with anything.\n\nThe chopped salad - what. Who recommends a chopped salad? This is like the most perfect version of a chopped salad I've ever had. \n\nThe pasta - its own call out because it's so dang good. Try a few.\n\nPizza - another dang good.\n\nEverything else - the appetizers, sides, eastern-European Jewish mini menu - all so good. I love that they have several non-alcoholic drinks - the Concord cocktail is absolutely amazing; they could expand the selection even further and I would try them all.\n\nDESSERT!!!! O M G - all impeccable; I want them all every time I go. Their ice cream might secretly be the absolute best in the city (certainly able to hold its own alongside Bi-Rite and Humphry Slocombe).\n\nWhoa - ok - effusive review much? You bet. This isn't just a neighborhood gem (it is) but it is also now hands down one of the best restaurants in the city.\n\nGet on the reservation list and/or just pop in and try your luck. Then go back again and again and again.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Don't walk, run.  Went here for dinner last night, I would recommend going early to avoid the wait.  Service was impeccable, everyone was super knowledgeable and friendly.  Our waitress Whitney was lovely and spot on with her recommendations.  We started with the melon and lonza, house cured anchovies and squash blossoms.  The anchovies were awesome!!  So yummy and amazing flavors.  The sauce on the squash blossoms was wonderful.  Highly recommend both of those.  We then tried the suppli which is basically an arancini.  Good but nothing special.  The ragu was really good, pasta was cooked perfectly and sauce was really tender and wonderful.  The mushroom and sausage pizza was also great, crust was perfectly doughy and crisp.  The crostata was also amazing.  \n\nCan't wait to go back and try more things.", "author": "Erin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Date & Time:  Thursday March 29, 2018 @ 7pm\nRating:  4.5 Stars\nDining Companions:  Mommy & Husband\nScene:  Couples & Groups in White or Pastel Spring Dresses w/ Strappy Flat Sandals Decked Out for the Perfect Spring Evening\nMusic:  Fun Mix of Hall & Oats, Incubus, Outkast & 90's Hip Hop\nDecor:  Industrial Chic; Flight of Stairs Leads Up to An Open Loft-Like Space. Designer Fig WallPaper, Lively Bar, Open-Wood Fire Burning Oven, Sky-Light, Communal Tables, Banquette Seating & Red Leather Booths w/ Wood Tables.  The Quintessential Spot for Good Food, Good Wine, Good Friends & Good Times\nService:  Warm, Friendly, Welcoming.  A Real Neighborhood Feel\nImbibe:  Milk Punch\nDevour:  Heart & Gizzard, SF Margherita Pizza + Arugula Salad, Rigatoni, Tagliatelle, Wood Fired Chicken w/ Polenta on The Side.  For Dessert:  Piccoli Dolci, Olive Oil Cake & Citrus Crostata for Two\nTotal:  $162.92", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I lined up just over a half hour before they opened to make first round seating and snagged the last bar seats! Come early or spend $$$$ on drinks waiting for a seat to open.\n\nA few stand out plates...\n\nI've always been anti pineapple on pizza. Che Fico has changed my mind! Their magic combination of red onion, fermented chili, pineapple and plenty of fresh cheese is so good and even better on that sourdough pizza crust. It's light, it's crispy, it's a must order. Save room though for some homemade pasta.Their tagliatelle al ragu is delicious with just a light meat sauce over ribbons of long, flat noodles.\n\nI loved the pizza so much i've booked a reservation a few weeks out. I've got my eyes on the Ode to Judy Rogers and classic Margherita.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-28", "description": "Scored a reservation on a Friday night. This place was packed! First impression: cool vibes. Almost too cool for SF. Love the staircase situation leading up to the host. The wallpaper is so fun! \n\nThe food was just ok - though we did not try the pizza with the Parmesan crust which seemed to be a hot item. We saw more than a several of those being walked by our table on the way to other tables. \n\nFavorite thing was the charcuterie plate! \n\nLeast favorite thing was the olive oil cake. Was too dense and the fruit compote was super tarts. \n\nI would recommend this place more for a fun date place or birthday celebration.", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-10", "description": "Service was excellent but the food was disappointing. The potatoes in the octopus salad soaked up too much of the vinegar dressing and overpowered the other flavors. The ragu was delicious, but the carbonara was a hot mess -- the pasta was thick and rubbery,  and the sauce reminded me of a creamy mac and cheese sauce with something fishy going on.\n\nWould rate 2 stars but veered to 3 given the great service. Our server was attentive and kept our water glasses full through the meal.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-17", "description": "Cool and hip new place - we made reservations (seems like you'll need one) and got a table. I believe the large communal table in the center is set aside for walk-ins, and the waiter told us that a line does start forming before their 5:30 open so keep that in mind. There is a bar area where you can hang out as you wait. \n\nWe started with the supplí (fried rice balls) which were pretty good. Cocktails were good and pretty strong. Broccoli di ciccio (broccolini?) came with some edible flowers and were charred with some lemon and mustard flavors. It was pretty good but I am sensitive to mustardy flavors so my nose cleared up pretty violently a couple times, heh.\n\nWe got the pineapple and fermented chili pizza (seems like the popular choice when we did our research) - which was spicier than we thought. I dug it but it was a tad spicy for my friend. Otherwise it was a really good pizza with amazing crust. Will have to try some of their other pizzas. The biggoli nero (squid ink pasta?) was interesting. It was super oily but I guess by design? The pasta basically sits in a large pool of olive oil - I found it too oily tho. Flavors were different. Not bad, but I kinda got sick of it after awhile, maybe it was too strong of a flavor? There were some Dungeness crab and clam pieces scattered throughout the pasta, not a tonnnn but the dish overall was a bit small.\n\nWe ended with a bittersweet chocolate budino which came with a scoop of gelato. The chocolate was amazinggggg .. but there was a pretty substantial dollop of olive oil poured on top which was weird for me. Not sure how I feel about olive oil on my dessert.\n\nOverall food was decent but a little under my expectations. Thhe pizza definitely shines here.", "author": "Grace D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-28", "description": "I have a friend who had been waiting for this restaurant to open so we decided to come here on the Grand Opening night - Wednesday, 3/28. Arrived around 6:15pm with no reservations. The hostess said it would be about a hour and a half wait but that the bar was first come, first serve. \n\nTip: they take down your number and will text you so if the wait ends up being long - you can head to the bars down the street. \n\nWe ended up waiting about 15 mins and grabbed a seat at the bar. We ordered the rice balls, a pasta dish and a pizza. The pizza and pasta arrived at the same time as we later found out there was a kitchen error with the rice balls. The pizza and pasta dish were delicious. The pizzas have 4 slices and the pasta dish is kinda small but flavorful. As I mentioned earlier there was a delay with the rice balls which was no biggie - understanding it was their grand opening. The bar staff were apologetic about it. Hey! I get it. They arrived and I wish I had them first. I think because we waited, we were underwhelmed. Though the shell of the rice ball was pretty crispy. \n\nOrdered the fruit tart dessert and it was delicious. The food is good and the atmosphere is fun. There's so much natural light and it's really cool to see how they turned this old auto shop into a restaurant. As the night wore on, the place got busier and louder. If you're looking for a restaurant with good eats this is a must try.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "My wife read about this place and wanted to go- then I saw it was from a fellow Alameda High alum and knew I had to go. When we looked online, we saw reservations available... for 10:30pm! To go here, you definitely have to plan ahead of time. We were able to snag 9:30 on 7/3, so my wife had the day off the next day. When we got there, it was still packed! And it stayed packed the entire night, wow! \nWe had the crispy artichoke, the fried cheese, the triangoli, and the lamb sugo. The artichoke was perfectly crisp- each little flake was cooked to perfection. The fried cheese was a little disappointing. It started out good but got kind of soggy. Still though, fried cheese. My wife's triangoli (one of the few vegetarian items on the menu) was good, but portions were a little slim compared to my lamb sugo, and it had a very lemony flavor. Finally, we had pistachio gelato which was absolutely delicious. \n\nThe interior was super warm and welcoming. It was a little loud, but I think that's kind of the vibe they're going for. I definitely recommend planning a date night here (though you'll have to do it well in advance!)", "author": "Samir K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "I certainty stalked the reservation availability for Che fico until I got a reasonable time 945 hahahha. Chefico did not burst my bubble of expectation in fact they exceeded my expectations . The porchetta ( for which we got the last slice ) was simply Devine ... succulent , crispy skin and the seasoning and spices was on point ! The pasta ( sadly they ran out of the pardapdelle ) was chewy , bouncy and a perfect vehicle for their very perfectly rustic tomato sauce . The tomato sauce boast quite the flavor profile ... taste like the sauce has been cooking the whole day ! I can taste the sunshine ! The squash blossoms where met in your mouth treats ! I could easily eat 10 plates of them ! \nSharing is the way to go as we go to sample a bunch on the menu minus the pizza this round ! We wants to see the dessert round lol .", "author": "Gretchen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "Che Fico is a new fine-dining experience where a casual ambience over mainstream music come to meet excellent food. From the moment you are in the dining room, one can notice the immense open space. Although only 2 floors up, you feel like the city is beneath you. To the left you can see the open kitchen at work, quite an exciting view actually. \n\nService was great here. The employees seemed passionate and excited to be working here (Disclaimer: This is very early to the opening of the restaurant). What is even more impressive is that the place was completely packed at 10PM (when we dined) yet service did not seem slow at all.\nFor a drink, I got the Milk Punch. I'm not a big drinker, but this was pretty tasty, my friend told me it tasted similar to a whiskey sour.\n\nThe first food ordered were the rice balls/supplí. These were divine. They didn't taste greasy/oily, yet they were full of flavor. They had a great crunch to them as well. I really recommend it.\n\nFor a second appetizer, I got the duck liver. Presentation wise, it was beautiful. I was a bit scared when I saw the abundance of onions; but the flavor actually impressed me and I was asking myself for even more. These were served with a side of crackers. The duck liver was also really good in this dish; I was worried the dressing would hide the flavor; but it complimented it very well.\n\nMy entree was the tagliatelle al ragu, which has very good color to it. Sometimes I worry about meat in pasta dishes because the flavor is hidden - but here you will definitely taste the fine tasting meat.\n\nTo finish the dinner, we had a dessert of olive oil cake. No, you won't taste the olive oil, but there is a very strong abundance of sweet; maybe almost too sweet for some? As someone with a sweet tooth, I thoroughly enjoyed how simple and tasteful this dish was.\n\nI can't wait to come back to try more.", "author": "Vinh T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-11", "description": "Cocktails and decor was nice, but overall disappointing experience. Service was very slow, we arrived for our 8 p.m. reservation promptly but our table was not ready, and we then spent the next 30 minutes in the bar. Our waitress was friendly but not attentive. \n\nFood was mediocre, I ordered the Pumpkin ravioli and the wife got a margarita pizza. The pizza came out burned, and overloaded with parmesan cheese to cover the burned crust. The pasta was dry, and was rather disappointing to the point I didn't want to finish it. Skip this restaurant, and go to the many other great Italian options the city has to offer.", "author": "Ari M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "YES!!!!! I waited months to being able to make a reservation at Che Fico after seeing Gwyneth Patrol's post on Instagram about the place. Totally worth the wait. Place is super cool - beautiful wall paper and I love the wall mirrors, they also have both private and communal tables so it makes it a bit easier to get a seat if you don't have a reservation... music was great - a detail that I don't usually pay attention to but at Che Fico was so good! And most importantly - FOOD!!! Appetizers, pizza, pasta, fried cheese and dessert, all of it - simply impeccable. I can't wait to go back there!", "author": "Daffny V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "Che Fico, Che Fico, Che Fico......$&@?!.....Che Fico. It was great to finally get in and have dinner at this spot that has such a buzz right now, before 11:30 PM. The atmosphere is great. The food is good. Diviis is coming up with the haute spots. My friend and I ordered the half chicken with the polenta and the chopped salad. All items were tasty but I favored the chopped salad more. The bar is A-Mazing. The service was awesome. However we looked over and saw that our neighbors ordered a pizza of some sort...it did not look that great. The surrounding crust was burnt and it was smothered with white cheese that looked like snow with 4 anchovy slivers...yea...gonna stick to Golden Boy for the pizza.....tank tchu. All it takes is the hype to put you on the map...the hype is the hype... glad that I checked it out though and I like saying Che Fico...Oh Gawd.", "author": "Stacie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "Came here for their grand opening and thoroughly enjoyed myself. Why? Because of their fig wallpaper obviously. I don't care how nasty your food is, if you have figs on you're wall, I'll like it. Kidding, but DIZZAM what great taste.\n\nNow, on to less important things, the food ;)\n\n* Caciocavalo- we got this to start, and it was tasty. The meyer lemon gave the dish so much flavor. Also, anything labeled with \"WSR\" on the menu comes from their ranch not too far from here..kinda cool!\n\n* Cavatelli- this was my least favorite dish. The pasta itself was good, but the vegetables in it were overcooked and kind of bleh. Wish they were more crispy! Wouldn't get again.\n\n* Pineapple, red onion, and fermented chili, can I get a HALLELUJAH for the pineapple?! All you pineapple pizza haters keep hating, because that means there's more for me. But seriously, I am so happy there is finally a restaurant that appreciates the most valuable topping on pizza. Also, the fermented chili makes for the perfect amount of spice every bite you take (if you can't handle a little spice, this probably isn't for you). Now can we talk about the crust?! Arguably the best part. The crust was perfectly crisp, and the thinly shredded parmesan melted in your mouth with every bite. I will be getting this every time I come back.\n\nIt was super busy for their grand opening, and I'd expect it to stay that way for some time, but we got there at 5:30 and walked right up to the full service bar. I'm sure some people have had not-so great experiences, but it was opening day, and you have to imagine they're still working out some kinks.", "author": "Morgyn T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-05", "description": "Experience:\nWhen I first walked in I was greeted by a very overwhelmed hostess who in-between telling every person that had just climbed the staircase up to the second-floor restaurant that the wait time was between 2.5 to 3 hours, told me that our table would be ready soon. (We made a reservation many weeks ahead) \n\nI then awkwardly looked around for where I should wait. My options consisted of a narrow hallway that everyone from the waitstaff, the cook with an entire cart of pasta, about 20 people waiting for their reservation and the hostess running coat check out of a cleaning closet were occupying.\n\nWhen we were seated, the decor was charming but the restaurant was LOUD. \n\nWhen the waiter came back to get our drink orders, he told us he couldn't hear us. We joked that the music was a little loud. He said, \"Yes. It is very loud. Makes it difficult for conversations in here. But, it makes it a fun environment to work in.\" We proceeded to yell our orders at him about 3 times so he could hear them.\n\nWine:\nWhen the wine arrived, the waiter placed the drinks down without saying what they were and walked away. In doing so, he had switched our orders around. Since my friend had ordered the rosé and I had the white, it was clearly easy to figure out. We switched back and took a sip. Upon trying it, the rosé tasted wrong. When he came back we asked what the wines were to make sure. He acted as if we had just asked him to recite the Germanic alphabet backwards.\n\nFood:\nHaving made Bon Appétit Top 10 best new restaurants in the US list, we had very high expectations for our meals. We also initially attributed the obnoxious environment to the chef's alleged ability to wow us enough to not care. This was not the case. Our appetizers were quite delicious, but each of the entrees we ordered were extremely underwhelming. By no means bad, but definitely not superb. Especially not for the hefty price. Also pay no attention to their portion recommendations. \"Serves 2\" really means \"Serves 1.\" \"Serves 4\" really means \"Serves 1.5\". So, that $55 piece of pork that was supposed to serve 4, is now the most expensive appetizer you've ever ordered.\n\nOverall: \nThis place is Che F***ING loud and a bit overpriced for what it raves to be. I guess this has become the new standard for San Francisco dining. *Sigh* (which nobody heard because it was so loud.)", "author": "Hannah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "We got there at 5:20 and a small line had formed. The restaurant is on the 2nd floor, but there is an elevator. You get the option of the communal table or bar seating when you're a walk-in. We chose communal.\n\nI got the Kumquat drink which was really refreshing and in the prettiest glass.\n\nWe got the octopus, which was over-cooked and chewy. I love octopus, so was pretty disappointed. We mentioned this to our server, but they didn't do anything about it. The summer vegetable salad was very nice. It's a small portion, so not good for sharing. We had to ask for bread. They give you oil, but do not have balsamic vinegar.\n\nThe cappelletti was very undercooked. Not al dente. The flavors were really nice though.\n\nThe pepperoni olive pizza was nice and had fluffy shaved cheese on the crust, which was perfect.\n\nThe Bolognese wasn't great. I like A Mano's better.\n\nThe staff were all very nice and there's always someone around if you need anything.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "It's simple.\nIn order for a restaurant to achieve greatness it needs to accomplish the trifecta.\n\nA. Food\nB. Ambiance \nC. Service\n\nThe food was 4 Stars\nThe ambiance was 5 Stars\nThe service was 1 Star\n\nOur server was not friendly or hospitable but frankly, all she was was an \"order taker\".  Additionally she clearly did a poor job at pacing our courses. We canceled our pizza (our last course) after waiting for it for nearly 45 minutes. (We had already had an appetizer, a salad, and a pasta). The final issue was how she handled it; extremely annoyed and condescending when we canceled the pizza.\n\nIt seems as though a lot of the 1 and 2 star reviews are due to high expectations not being met. For me, I wasn't looking for something life changing but I did expect that they would have the basics down.", "author": "Krissy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "Have been waiting quite sometime.\n\nGot a reservation late and due to being my birthday, they switched to a more normal time for us old folks :)  Very much appreciated.\n\nEnvironment from up the stairs to turning around the corner into the dining room with a straight view of the open kitchen = fantastic.\n\nService from drink at bar to delivery of check = fun, engaging and professional.\n\nFood was just OK IMO.  I'm sure if we had selected maybe a few other things it could of upped the delish factor, yet what we got it was always lingering in the back of my mind, really??\n\nThe risotto cake - not hot on the inside. Nice flavor but ours was served lukewarm.\n\nChopped salad - too much dressing.  Smoked provolone too big of chunks that did not balance the thinly sliced salami.  My tastebuds would of liked some grilled radicchio thrown in to offset the too much dressing and add a deeper layer to an overall good salad.\n\nSquash pasta - not sure what was on top since my husband ordered it and I didn't even read about it.  I'm thinking chestnuts but no.  Did not work.  The pasta was a tiny bit al dente to my taste (same thing so many places do and IMO no cook the pasta just a tiny tiny bit more so there is not a feeling of dent when you bit) yet the contrast of these things on top that were hard and a texture that made you think, what? yet you ate it since the buttery cheese flavor kept you going on.  IMO I would of put a salty olive oil broccolini or other wilted green on top so that you could take a bite of that with the chestnut (?) to match those flavors because IMO it did not go with the ravioli since it felt in the mouth and on the tastebuds like two distinctly different items.\n\nFried chicken - Wrong.  There was nothing \"fried\" about this.  It was like something you would get in an Asian restaurant with the diced vegetables on top, and it most definitely was baked with moist and greasy and yummy skin but not fried.   Not what I expected and had we known how this was prepared and would taste we would of most definitely gotten another item on the menu.\n\nWill we come back.  Probably due to the atmosphere, energy, location and waitstaff.\n\nIMO it is hard to produce stellar products at that pace in that large of a space so I hope they continue to succeed and improve.\n\nWe'll come back to try the pizza and dessert.  I'm a duck liver/pate connoisseur so in some regard I'm glad I didn't try that on my first take with the other disappointments since that really would of been a deal breaker if that too was just mediocre.\n\nWill report back.", "author": "Paula S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "Hottest most popular place in town but for some reason I didn't leave very satisfied.  Che Fico probably lives somewhere in between the 3 and 4 range for the overall experience.\n\nFor apps we got the fried cheese and cheaper tartar.  Both were good but could be better.  The bread under the cheese a bit soggy and I prefer my tartar less wet.  \n\nOrdered 4 pastas, the lamb, lemon goat cheese, squid ink spaghetti, and ragu.  Ragu and lemon defintely tasted smooth and fresh AF but the portion size was so small it leaves you angry cause you can't have more.  The spaghetti was JUUUUUST almost perfectly al dente but was a bit hard.  The lamb was good but you have to really like lamb or cause it was thick, creamy, and gamey as hell.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "We finally got to Che Fico after some time because of the hard reservations to get. It's a cool vibe on an early Friday night with the place full and old wooden roof with drying chilies and herbs hanging over the meat aging and curing room in the middle of the dining room and open kitchen bustling with activity. After eating here we feel it might be one of the top modern Italian restaurants in our city. \n\nWe were there for the debut of the best dish of the evening (first day on the menu) which was potato gnocchi and white truffles ($65). Omg that was the best gnocchi of my life only made better by one of the chefs shaving fresh truffles on top right in front of us and they didn't skimp on it. The house-made and cured salumi was excellent and the chopped salad was peppery and fresh with cheese, olives, and salami. We also had the divine sweet fried ricotta stuffed squash blossoms. For entree we tried the porchetta which was intense and crispy but slightly over cooked and dry in the center. \n\nWe don't usually drink Italian wines except at Italian restaurants so we asked Francesca the wine director to choose our pairings and all the glasses she picked were perfectly delicious and complemented each course. \n\nWe're already looking forward to our next visit and will be up at midnight to grab a reservation when the date we want becomes available.", "author": "Kira B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-08", "description": "I thought it was okay.  We had 9:30pm reservations, so maybe my review is because I was hangry, sleepy cuz I am old, or a combination of both.  First off, the space is awesome and the service didn't miss a beat.  Prefect.\n\nWhen it comes to the food, thought it was okay and nothing really wowed me.  There were 2 to 3 dishes that were a bit salty and maybe cuz I am old..lol..seriously, maybe. The pasta we had was too a la dente, I thought.  \n\nI may try here again and maybe order some other dishes?  Just not too late next time.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Beautiful restaurant with great service and sensation food. I am visiting SF for work so dined alone at the bar. The bartenders provide great service. I ate the chopped salad and the sun gold tomato and mozzarella pizza, both were incredible.", "author": "Xand V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-23", "description": "Let's talk about the pizza.\n\nI appreciate the Chef's intent to char the crust. Char and smoke are wonderful flavors. Unfortunately, the pie I had, as well as others coming out of the oven, were past the point of char. \nThe pizzas are burnt. \n\nWhen I think about char, I think about beautiful leoparding of pies like those at L'Antica Pizzeria da Michele, Di Fara, Lucali, Roberta's, and Young Joni. There is no leoparding here. More like black panther. \n\nThe otherwise perfect consistency and flavor of the sourdough crust (and wonderful toppings- I got the pineapple and fermented chili) was overshadowed by bitterness and an acrid aftertaste of the crust. Not a pleasant punctuation. \n\nPerhaps if you are sharing plates, trying several items, and only have one slice, you may not notice the crust, as it is covered in freshly shaved Parmigiano-Reggiano. But if you come here to devour pizzas, it may be hard not to commit the cardinal sin of eating the pie but leaving the crust behind on the plate. \n\nSupplí was nice. Chopped salad was fresh and authentic. I expected to actually see some pieces of octopus in the Bigoli Nero, but unfortunately did not. The octopus flavor was less prominent than the lemon used in the dish.\n\n5 stars to the pastry chef. The budino is everything one could hope for; the olive oil and salt and pepper walnuts were delightful pairings for the chocolate and caramel. I hope to return for the olive oil cake.", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "This place has amazing food! Our favorite bite of the night was the Suppli's which are friend risotto balls stuffed with cheese and garnished with fresh dill! I could have eaten 10 of them! I highly recommend ordering them! The pastas were fabulous as well! We ordered half sizes of two different pastas but the portions where extremely small, I would have ordered full sizes if I knew they were going to be that small. Our favorite pasta of the two that we ordered was the spaghetti arrabbiata. We ordered the pineapple, red onion, and fermented chili pizza and it was great! The cheesy crust is so delicious! The service was a bit slow, the kitchen must have been backed up because we waited a while for our pizza to come. Overall, I highly recommend this place to anyone looking for a unique spot in the city with outstanding food and ambiance!", "author": "Madi V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-19", "description": "Che Fico feels like the not-so-blind-date-that-you-have-read-about where you awkwardly end the night even though multiple friends with good taste had recommended it. The night leaves you wondering, \"is it me?\"\n\nThe tough thing when people you really really like, like something, is that you want to like it too. However, it is particularly difficult to have a good date when you start out on the wrong foot. From the moment we arrived, after meeting the very gracious hostess staff, we had the unfortunate experience of dealing with a brusque mustachioed bartender, whom said hostess staff had to apologize for his rude behavior.\n\nWe eventually ordered the Classico at the bar from said mustachioed bartender. One of the hostesses sat us in the corner. Waiting for the cocktail or some form of attention, eventually a half an hour passed by. After flagging down the third person who was supposed to find out what was happening with our drink, I got the first thing that I could review - the Classico is a good, spirit-forward cocktail with some herbal notes. If you come here and like boozy drinks, you should order it. Once the cocktail arrived, I finally had the opportunity to order the very uninspiring food.\n\nFor dinner, I ordered the suppli, polenta, eggplant mezzaluna, pappardelle ragu, and the pineapple, red onion, & fermented chili pizza. I would write a detailed review of each of these items but it mostly would be a waste of space. The polenta was the best of the mediocre bunch; the flavors were extremely interesting but the gruel-like texture limited this from becoming anything beyond a \"good\" dish. I wish I could comment on the suppli because it never arrived.\n\nThe pastas were also extraordinarily underwhelming - the mezzaluna was over-citrused but somehow still bland, and for a \"top Italian restaurant\", I couldn't imagine a more uninspired bolognese for the pappardelle. \n\nThe pizza was interesting but not great. The idea of pineapple pizza is heretical to me, but the waitress sold me on it. On the basis of toppings, I was completely wrong; the toppings were fantastic - the pineapple paired with the high-quality tomato sauce, red onion, and fermented chili were an unexpectedly delicious flavor combo, but the purposely hyper-charred crust added nothing, even though I could see how it could potentially work paired with the right toppings. \n\nTo Che's credit, their wine recommendation was on point - the Campania by the glass was fantastic.\n\nSimilar to a first date gone awry set up by a best friend, I would consider giving it another try if I didn't have to go out of my way to do it. However, I wouldn't be incredibly excited to try again despite seeing glimpses of how everything theoretically might be salvageable. At the very least, I would hope my date just had a bad day and wouldn't be as rude the second time around.", "author": "Keith R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "We recently moved to San Diego and treated ourselves to one last celebratory meal at Che Fico. I made the reservations a month in advance, so the anticipation was very real. We arrived at the restaurant promptly and were greeted by a very long line of folks attempting to dine without reservations. We were able to jump the line since we had a reservation and were greeted by a very wonderful host. The ambiance of the place is very funky and retro. It's a very cool experience to observe little details while enjoying your meal. We ordered a wide spread of appetizers, entrees, sides, and dessert and were not disappointed at all. The food was delicious and very well prepared. The corn with eggplant and the chicken were my absolute favorite! Definitely recommended to anyone looking for good food and ambiance for a special occasion!", "author": "Neda P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "We tried to give Che Fico the benefit of the doubt to at least respond to this privately and directly but 7 days after emailing them no dice.\n\nWe had dinner at the counter on Saturday 5/12.. One of the men working on the salads had extremely poor hygiene. He was wearing a white shirt with a print of red and blue popsicles and the Statue of Liberty on it. We noticed the following behavior of his while sitting there:\n\n-Rubbed his hands though his hair numerous times \n\n-Put a spoon that he used for plating into his mouth and then back into the container with other plating utensils that were in use. \n\n-Picked up small pieces of food and put them in his mouth/touching his mouth and lips with his fingers.  \n\nHe touched food for guests with his fingers after doing all of things - it was appalling to watch - luckily we had had eaten most of our food before noticing these things because it made me feel nauseated watching it all. \n\nWe were also surprised by the overall lack of urgency in the service. We sat there for over 20 minutes before water was poured for us. Our first drinks, which we ordered at the same time as our food, came after the salad. When our third course (pizza) came there were 4 empty dirty plates still sitting in front us that had sat there for a while.  \n\nWhen the server asked us if we wanted dessert we said we would like to see the menu. She brought it but with the final bill clipped on top of  it  - something I have never seen before. given that and the fact what we had seen had really made us lose our appetites we did not order dessert. \n\nOverall we were pretty appalled by the experience. I would like to chalk some of the behavior up to a working out the kinks of a new restaurants but years in the making, 6+ weeks of being open and more than 1 week with no response via email, I could not put off this review any longer.\n\nIf you want to be oblivious to this behavior do not sit at the tall seats by the counter. \n\nThe only redeeming thing about the evening was my Boulevardier cocktail but since I was not at the bar at the time it was made I don't know if I would feel the same about it.", "author": "E E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-23", "description": "$65 for one \"small\" dish of potato gnocchi - it's peasant food for flip sake. The food in general was ok, not great. The portions billed as family style are too small for proper sharing. If you don't have a reservation be prepared for a long wait... even though their voice message indicated plenty of seating for walk-ins. I think Bon Appétit got this one wrong. There's got to be plenty of better options in SF or just come to my kitchen.", "author": "Bob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "The restaurant is beautiful, the service was incredible, and I loved every bite of food. The cocktails were also amazing. Can't wait to go back!", "author": "Christine D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "This placed has been hyped up as the best new restaurant in all the City. Unfortunately, don't always believe the hype. Don't get me wrong. They did an amazing job with the space. The cocktails were on point and the food was for the most part flavorful and well presented. But there were parts of our meal that I just didn't feel lived up to the buzz about this place and didn't feel worth the money. The service was adequate but not friendly. It was almost as if the waiter took himself too seriously to actually be helpful. He didn't really give guidance about the menu or how many plates would be enough to share. Instead he upsold us on a focaccia appetizer which was very good but unnecessary. I would have appreciated him letting my party know that perhaps the pasta AND the pizza would be overkill with the focaccia. Speaking of the pasta--ordered the carbonara and it was gummy. Octopus salad was flavorful but a bit chewy. We also ordered the summer salad with gazpacho. For a place that is shared plates, the gazpacho came in one large bowl and was awkward to share. Though this was by far my favorite dish, I think I would have enjoyed it more if they served it in little individual bowls or at least gave us bowls as an option. Porchetta was good but not special. Olive oil cake seemed dry though the elderberry gelato was a winner.  \n\nAlso the noise in the restaurant was off the hook. I couldn't hear my friend sitting next to me. But due to odd acoustics and placement, I could very clearly hear people standing by the bar partition which was right next to our booth. I felt like I wanted to tell the woman chatting with her friends that the dude wasn't worth her time! Overall it was an okay experience. I expected so much more given the hype and given the competition for quality food and dining experiences in the City.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "This place is the BOMN I mean there are no words to explain unless you try then u will know what I mean. The bartenders Are OMG  u must see and test FOR ur self. It's  simply like WOW", "author": "Ely Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Great restaurant. \nSecond floor operations can be a challenge but the signage and entry experience to Che Fico express not just the style and mood but the design team and operators capacity to be adaptive. Design appointments and usage of the space speak to a confident and knowledgeable team. High ceilings and gracious table spacing are a strength of the room, music uniforms and menu all speak to the convivial experience your about to enjoy.\nBeverage program is a great size, approximately 50 bottle approach-ably priced wine list of primarily Cali and Italian labels with some unique varietals. Great selections of quality spirits behind the bar and knowledgeable team members. \nMenu is engineered for sharing and great for small groups or dates. Offering are uniformly delicious, high level of execution and consistency. \nHighlights were the tuna conserva, Caciocavallo (fried cheese), Chopped Duck liver- this was an elegant presentation and delightful flavor profile really speaking to the culinary teams prowess. \nWe tried all six of the handmade pastas and my personal favorite was the land and green garlic agnolotti with peas and artichokes but they were all worthy of the spend, delicate and sauced just right. \nTo full for any of the main courses these will need to be addressed next trip. Try the broccolini, anchovy, Mustard and citrus, super tasty and texturally perfect. \nDesserts were tasty but stylistically reaching in a direction not quite inline with the savory offerings, but again my affinity for Italian desserts makes me a bit biased. Quality of products and execution very high. \nLooking forward to a return visit.", "author": "Gary FX L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-11", "description": "Very cool, hip space..unfortunately the rest was painfully disappointing.\n\nHad a 1030pm reservation on a Friday night. Our table wasn't ready when we arrived so we had a drink at the bar. Drinks were good so no complaints there. \n\nWhen we were finally seated our server took forever to greet us and was so awkward. I think she may have been super stoned.\n\nIt was late and it wasn't very busy but our food took literally forever. We ordered appetizer salads, a pizza and entrees. The salads came at the same time as our entrees (over an hour after ordering). As we were eating our appetizer pizza our server asked how it was and if she could box the rest for us..but we were in the midst of eating it when she asked if she could box it..it was so bizarre. \n\nOur entrees were finally brought out around 12:30. Our reservation was at 10:30! The food was mediocre at best. We were so over it at this point that we ended up taking the majority of our entrees to go. \n\nThis restaurant is pretty new and is clearly going through some tough growing pains hopefully they'll figure it out.", "author": "Marie-Eve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Enjoyed an amazing late night meal. They had plenty of vegetarian options which made an impromptu dinner turn special for me and my husband. You can't go wrong with anything on the menu! We also love the bakery downstairs!", "author": "Gopika P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Excellent food and energy in this place. Cocktails were fantastic, remember the octopus being great as well.\n\nWe didn't try any of the pizzas but might be nice to get in a larger group.\n\nService was excellent and friendly. Tough to snag a reservation we got one at 10pm. Saw people coming in all the way till 11:30pm!", "author": "Sumit C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Hottest new restaurant in SF and deserves the accolades it gets! Went with a friend with no reservations and only waited about 25min on a Friday evening. Although we did go a little earlier (6ish) than primetime so maybe that's why. \n\nUpon entering upstairs you'll notice the awesome floor tiles and wallpaper! The whole restaurant is decorated very well and it has a very fun vibe to it. I can't put my finger on it but it reminds me of NY restaurants and the vibe it gives off. My friend mentioned that and completely agree!  I really HOPE SF catches on to this style, we need more of that! Side note: the bathrooms are decorated just as well! \n\nSo you can put your name down with the host/hostess or head to the bar and put your name down for a seat there. We opted for the bar and it was a short wait. The bartender was great at recommending drinks and we opted to go off menu and have him create his own based on what we liked! He adapted well and created some nice refreshing cocktails! \n\nNot going to get to the details of the food but will say that everything we had was delicious and down very very well. The appetizers, pineapple pizza and pasta were bomb! Dessert we went with the rhubarb tart we killed it in 5 min! \n\nOverall it lived up to the hype and it's a fun spot to check out with friends or a date. I love how NOPA is opening all these new spots the last few years.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "So incredibly great! High end comfort food.  Delicious yet reasonably priced for the quality.  Great \"buzzy\" energy to the room - a fabulous \"see and be seen\" kind of place!  I cant wait to get back! A true destination spot!", "author": "Theo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Great food, just make sure to get here early if you don't have a reservation! We came about 10-15 minutes before they open and there was already a line of about 20 people. \n\nPrices here are certainly up there, but the portions are great and the food is delicious. Had the pineapple pizza which was fantastic, and the half chicken was pretty good, though a bit under seasoned for my tastes. Also had a suppli and immediately regretted not ordering more than one", "author": "Vladi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "Food here was pretty salty, and that means something coming from someone who really likes salty food. The caciocavallo was so salty that I couldn't finish my half of it. Suppli was also pretty salty, but not as salty as the fried cheese. We also got the $45 spaghetti alla chitarra (expensive because of the truffle) which I probably won't get again because it doesn't taste as good as saving $45. The ragu ($28) was also just okay... The complimentary salad was probably my favorite dish here. I regret not getting any pizza because the pizzas at other tables looked delicious, so I'm willing to try again once it's not as impossible to get a reservation/seat here.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Wow. Awesome addition to the top notch food scene in SF. \n\nGazpacho summer fruit salad - favorite course. All the elements melded perfectly together, and each bite was a burst of flavor. Watermelon, feta, tomatoes, cucumber, melon, all on a bed of a unique gazpacho soup.\n\nStuffed squash blossoms - least favorite dish. There wasn't a lot of flavor to these but the fried outside was nice and crispy. And the marinara dipping sauce was yummy.\n\nSaffron lobster pasta - amazing. So flavorful and the pasta was perfectly cooked.\n\nSausage pizza - unique shaved cheese dusted onto the crust! Very good pizza. Not as good as A16, but very tasty.\n\nRice pudding - what a unique dessert. A lot of the nice restaurants in SF fall short but not this place. (To be expected I suppose from a James Beard award winning pastry chef!) The rice pudding was thick and set on top of a bed of puffed rice and nectarine syrup and topped with fresh raspberries. So good!\n\nThe head chef came by our table (and all tables) at the end of the meal to ask how everything was. I really appreciate this personal touch. We will be back for sure.", "author": "Mithra H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-26", "description": "I think mehhhh sums this review up pretty well. Overall, the food was fine but for the price point, I've had better, and service they're definitely working out some kinks. To start, we arrived for 5:30 pm reservation, seated immediately greeted by waiter pretty shortly after, drink orders were taken... and then we waited about 15 minutes for our drinks. The first set of diners cannot wait that long for drinks (no one is ahead of us?).   We all ordered The Dill and honestly, none of us enjoyed it. I think a lot of bars in the city do a great mezcal cocktail and this had to pungent of alcohol flavor and nothing else going on. For food, we had the following:\n\n- Small chop salad: 4/5, needed something green, the small portion actually worked well for the 4 of us and it was tasty \n- Anchovies: 3/5, sauce the anchovies were in was tasty, but I'm not even sure we all even got an anchovy to taste \n- Zucchini blossoms: 3/5, stuffed with ricotta, lightly fried in a tomato sauce. Hit the spot, but didn't really wow me \n- Artichoke hearts: 5/5, lightly fried, the outside leaves were like chips while the insides were tender and juicy. Delicious and there were 4 so it split well. \n- Pineapple pizza: 3/5, The pizza itself is a 2/5 but the crust OMG 5/5. The pizza is verryyy thin to the point it's just flopping around and I thought it was overly salty. The crust though is puffed up beautifully and sprinked with a small amount of shredded cheese. I'd try a pizza of some sort. \n- Ragu: 3/5, Very light, actually not your typical ragu with a heavy sauce. Think noodles cooked well, but again it was good but nothing special we thought. \n- Donut sandwich for dessert: 2/5, Wanted to like this wayyyy more but the donut was almost tasteless but the gelato inside was yummy. \n\nOur waiter was a nice guy, but he took a while to come back to us and overall we thought the service needed work, but this is probably some growing pains. Probably wouldn't come back and honestly I think their are plenty of other places in the city at a better price point.", "author": "Aryn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-12", "description": "Underwhelmed. Given the hype, I was expecting this place to be comparable to Lilia in Brooklyn or Felix in LA... SPOILER ALERT: It's not. Is it good? Yeah, it's good. It's fine. But it's definitely not great.\n\nFour of us ordered a few appetizers, three pastas, and a pizza. Our favorite thing was the chopped salad, which I think says more about the rest of the food than it says about the salad. The salad was basically a vehicle for chopped cured meats and cheese, so OF COURSE it was delicious. \n\nThe pastas were all freshly made, so of course they tasted like good fresh pasta, but you know what else is good? The fresh pasta you can buy at Lucca and make at home or even the fresh pasta you can get at Whole Foods! I was really hoping that this place could be my Lilia of SF as Lilia also doesn't try to reinvent the wheel and makes amazing fresh, simple pasta, but this was just so blah. The octopus pasta was overly fishy, and speaking as someone who usually loves anything octopus-related, the texture of the chopped up octopus in the sauce was really awful. The pappardelle was good, but I prefer the papparadelle/tagliatelle that's a mainstay on Nopa's menu down the road. The squash ravioli was also just fine. Portions were incredibly small, which is strange considering they encourage doing dinner family style. Our server even recommended getting half orders in order to be able to try more... If we'd done that, we would have gotten a noodle each in some cases, so I'm glad we went with full orders.\n\nThe pizza was good. I was into the charred crust, but again I didn't understand the hype around the pineapple pizza. It tasted like a pineapple pizza, which, yes, I do like, but I don't know the last time Anderson Cooper or Gwyneth tweeted about the Hawaiian pizza at Round Table (which, yes, I like as well) the way they did about this one.\n\nTo top it off, service was subpar. This felt like our waitress's first restaurant job, and usually at restaurants of this alleged caliber, you get the awesome career servers who have already worked at all of the best restaurants in the city. Her food recommendations were long-winded and meandering (JUST TELL US WHAT TO EAT), and her wine recommendations ended up being far from what we had asked for. She also walked past our table multiple times while we had empty cocktail glasses, and I had to literally wave to her to finally get her to come over so that we could spend more money. \n\nAnd is the space cool? Yes, it's cool. But it's loud. I'm usually fine with loud places, but our server couldn't even hear what we were saying when we were already raising our voices. She had to lean over our table in order to hear us. Really awkward, and I don't know why they keep the music so loud. This isn't SoulCycle, people.\n\nIf this were a place where you could just walk in and grab a drink and a bowl of pasta, I'd definitely go back, but for the effort it takes to go there, it's not worth it.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-10", "description": "After four years of wrangling, chef David Nayfeld and pastry chef Angela Pinkerton have finally managed to open Che Fico.\n\nLocated on the second floor of a two-story building that formerly housed an auto body shop, Che Fico has an open kitchen with a pizza oven juxtaposed against a bright dining area with the ever-present exposed wood and (by now all too common it makes me wretch) oversized communal table. The dining space is broken up by a haphazardly placed room dedicated to aging charcuterie that seems like an afterthought, while an L-shaped bar caps the end nearest the door.\n\nThe restaurant scene in San Francisco is all about the buzz. And right now Che Fico (BTW, \"Che Fico\" means \"Oh that's cool\" in colloquial Italian. How precious!) has the buzz. Reservations less than two months away are hard to come by, and don't even think of \"just showing up\" or your wait will be interminable. \n\nThe menu at Che Fico centers on rustic Italian fare influenced by California sensibilities and includes pastas, pizzas, secondi (second courses for two or four) and dolci (dessert). \n\nThe pastas are marked fatto a mano (handmade), fatto a macchina en casa (machine-made in-house), or secco (dried), and range from tagliatelle al ragu Bolognese ($24), a rather greasy ensemble that didn't include any tomatoes, to bigoli nero with only microscopic bits of Dungeness crab ($28). \n\nA selection of \"Cucina Ebraica\" includes small plates that are reflective of the Jewish-Italian tradition, like beef tongue with crispy capers ($14, a dish that licks you back) and grilled chopped duck liver ($14).\n\nThe stars of the show are the wood-fired pizzas with an \"intentionally blackened\" sourdough crust that is toothsome and light. Neither too crispy, nor too chewy, the foundation of the pizzas is delicious: this pizzaiolo knows his stuff. With exactly four pieces of sausage, the mushroom, sausage, mozzarella and Calabrian chili version ($22) disappeared all too quickly. However, give the pineapple, red onion and fermented chili one ($20) a miss as the pineapple makes the crust too soggy. \n\nWith all the hoopla around Che Fico, expect to wait beyond your appointed reservation time. The dining room is noisy, but not over the top. Service was polite, if slow. While according to the server, \"The kitchen paces the dishes,\" the kitchen needs to pick up its pace: time from order to delivery for a quick-to-fire selection of pasta, pizza and contorni (side dishes) was over 30 minutes.\n\nThe wine list is OK, but bartenders measure pours with an eye dropper. With all the craft beers available in San Francisco, surely Che Fico could find more than just one, the delicious Fort Point KSA.\n\nAll in all, this time Che Fico was good, not great. A seeming re-hash of Flour + Water, was Che Fico worth the wait? Only time will tell.", "author": "CJ G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-12", "description": "Great food! Subpar service. \nI like this place and have recommended it to several people but tonight I really left disappointed in the service. I'm only reviewing because I hope they improve upon this very important part of the restaurant experience.\nI ordered an additional pizza \"togo\" AFTER we had ordered our entire meal. The waitress informed me that they don't do \"to go\" but that she would bring it and would box it for takeaway. Said pizza arrived BEFORE our entrees (even though she knew I planned to take it away)so as advised she took it and boxed it. I was disappointed because we finished our meal about 40 minutes later and when we asked for the check she brought back the same boxed pizza, cold from 40 minutes before. I thought a place of this caliber would have brought out a new hot pizza to take to my son, but that assumption was incorrect, therefore leaving me bummed out ..", "author": "Lori C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Will keep this short and sweet.\n\nOnce you walk up the stairs and into the restaurant, you know it is something special.  Beautiful, beautiful, beautiful.  The details in the place are wonderful.  The cured meat.  The ceilings, the flowers.  Peppers drying above our heads.  Open kitchen, so you can see all the magic happen.\n\nThe food came out dish by dish and it allowed our table of three to talk, eat, talk, eat, drink.  Each dish was delightful and had something special about it.\n\nThis place is a true dining experience.  You feel like you are in a really big kitchen with lots of tables, and to me, that is a great place to break bread and enjoy a locally sourced meal.\n\nProps to Che Fico!  Keep it up.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Excellent, excellent food. A little on the pricey side, but hey, welcome to SF. Service was friendly and helpful, giving much needed guidance around portion size, but also with explanations of why certain things with food were the way they were - the guy clearly knew his stuff.\n\nDrinks were a little sub-par for the price, but that might also be my dislike of several of the bases for the cocktails . Grasping for objectivity, I'd still see it as a good idea to pre-game a bit before coming. \n\nThe Mushroom/Sausage/Calibrian Chili pizza was fantastic. Ragu was on point but a tiny, tiny serving size. The Suppli(I think it was called that) was amazing, whatever they're putting inside those I want in my mouth for the rest of my life.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "The space this restaurant is in is fabulous. Heard it took threeish years to convert it from a parking garage to this restaurant. Food Octopus salad is rock solid and refreshing. Chicken is amazing - ravioli really solid. Parpadelle ragu was hearty but too salty unfort. Cocktails playlist and and service are tops. Go Here - it's a rock solid experience", "author": "Matt T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Nice dinner date but plan ahead for reservations. Luckily we had some. Restaurant ambiance was hip and music select was great! Stater and main dishes shared and wow we both enjoyed! \nWood fired Octopus Salad\nFried Risotto\nEGGPLANT MEZZALUNA \nSAFFRON SPAGHETTI", "author": "M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Sooooo....where so I start? We flew in from Seattle to eat here. I waited and waited to make a reservation and the date I needed open table wouldn't let me make one. So I called and they were so nice! I got my reservation and everything was good. Then the day we were supposed to fly here our plane was delayed and we were going to miss our reservation time. So I called and left a message before we boarded. They called me back while we were in the air and said they would put us at the top of there list and we call when we landed. Everyone we spoke to was so so so nice! And they got us a table! All was not lost! \nThe restaurant is loud as everyone says... it so what? That's because people are eating and talking and laughing!\nThe fig wallpaper is amazing...the food was really good! The drinks very creative and delicious. We had the chop salad(so yummy) and I had the squash ravioli (divine) and the rice pudding (heaven in a bowl) thank you everyone at Che Fico for ensuring we were able to get a table!", "author": "Julia B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-11", "description": "The service was good, but everything else about the place was mediocre. Now I understand why Che Fico needs to build up hype with limited hours and long waits.\n\nThe space is cavernous and very loud, which doesn't lend itself to intimate conversation. This would have been fine if the food had made it a worthwhile experience.\n\nWe ordered the following:\n\n* Suppli : Tasted fine but were heavy. Also ridiculously priced per rice ball, not per plate.\n\n* Squash with breadcrumbs: Just tasted like...  squash, but greasy and slightly undercooked. No seasoning or herbs to make it special. \n\n* Triangoli: Not a well-balanced plate. Just tasted like lemon. That's it. Lemon pasta.\n\n* Margherita Pizza: Cheese was good, but charred crust tastes like burnt crust, sauce was nothing special and there was no fresh tomato. Come on, it's tomato season! We had bought some nice ones across the street at the Farmers Market on Sunday.\n\n* Wood Fired Mt. Shasta Porcini: Heavy and greasy. No flavor.\n\nI honestly didn't expect much from Che Fico, and it still managed to disappoint me. I had hoped for fresh, bright, seasonal flavors. While our cocktails were nice, there is NO way I'll return here.  I'll leave it to the sort of people who confuse new trends with quality dining.", "author": "Kay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Beautiful construction. Dining room is A+++\nCould be a bit on the loud side but awesome ambiance, nice bar with dining available. \nSmall but interesting wine list, fun selection of Italian wines. Food was very good, particularly the cucina ebraica items and the porchetta.", "author": "Kummi K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-19", "description": "TL;DR summary - While the space and service are delightful, the food doesn't live up to the hype. I live in the neighborhood.\n\nWe arrived at 5:20 to a line with about 8 groups in front of us. They save a certain amount of seats each day for walk-ins at opening at 5:30.\n\nThe space is lovely and lively, filled with light, adorned with arty tiles and vaulted ceilings. Waitstaff and menu were inviting and cheery, and everyone looked happy to be there.\n\nWe ordered the pepperoni pizza, chopped liver, arancini, and anchovy salad.\n\nPizza: good size, but the crust was burnt and the sauce/cheese situation was fine, not too flavorful, and not better than the other options on Divisadero.\n\nLiver: gorgeous looking (truly) but just not tasty. I really love liver and pâté but I surprisingly did not like this. Texture and flavor were off and it was under seasoned.\n\nAnchovy salad: meh. Greens should have been dressed better and the cheese olive oil centerpiece needed salt. The ingredients didn't taste mind blowing which is what great Italian food is all about.\n\nThe arancini was fine - also under salted and too large which led to much mushiness compared to external crispness. I think they should do two per order, just smaller sized.\n\nOur server noticed that we did not finish the liver and she kindly removed it from the bill, which saved us $22. This also makes me feel bad for writing this review. But unfortunately the truth wins and my son has forced me to wield it with honor.\n\nWe were sad that the food wasn't better and I will definitely be checking out the pasta next time hoping Che Fico redeems hypey itself. \n\nUntil then, I'm still rooting for ya!  Margot", "author": "Margot L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Yummm! I've been passing this place waiting for it to open and heard from my partner that it is! I'm so tired from work and feel over dressed, but we walk up thinking it's on first floor like Little Star (and I love that they dared to go up next to Little Star a neighborhood favorite) and wow how awesome it's on the second level and some old school OutKast is playing as we ascend the beautiful geometric tiles to a gorgeous room with what seemed like two bars and lots of people and great views. I'm thinking, NOPA step aside, I'm all Che now yaas!!\n\nSo we get seated right away along the community table and we get greeted by three separate staff with smiles. Everyone seated looks like they are enjoying themselves. I anticipate that they will be out of something and sure enough they are out of pizza and out of supli (fried rice balls an ode to the owners Jewish-Italian heritage). So we order the Mafaldini pesto and basically the fried cheese, both light and tasty. Surprisingly not oily. The best thing hands down besides the music (they played Rich Girl by Hall and Oates after some Smashing Pumpkins and I about lost it) and the service was this drink, the Milk Punch. *closes eyes in pure pleasure* I rarely agree with my partner on their choice of drinks, but wowz I will be coming back for just that. So dangerously smooth! Like a marg from LSC!! Wow a dude just offered us some oranges how sweet ! \n\nPlease try the place there is so much to enjoy about it and I'm absolutely thrilled they are here :) see me in my glory with the itty biorange slice to end my now fab night! \n\n\nUpdate 5/3/2018-\nFood delicious! We had burratta and lumache pasta and cauliflower. Same great soundtrack and service. Also, cute new addition - little take home chocolates wrapped in their fig wall paper design!!", "author": "Yvonna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-02", "description": "Awful Experience. We had a 7.45pm reservation on a weekend night and arrived 30 minutes early for a drink at the bar. At most places, this would be a nice start to the evening, but not at Che Fico. The bar is for reservations only, so we stood while having a glass of wine. This would have been ok, except that by 8.15 our table was still not ready, and we had been standing for an hour. It was not possible to order an appetizer as there was no place to put it. There were at least 8 empty seats at the bar, but in spite of our 7.45pm reservation, we were repeatedly told that those seats were being held for 8.15pm bar reservations - does this make any sense ?! \n\nWhen we were finally seated at 8.15, we were told the restaurant was out of the pasta bolognese - at 8.15 on a Saturday night. Clearly this team is not skilled in booking reservations, seating customers or planning to have enough dishes.\n\nWe left and walked a few blocks to Nopa, where we sat immediately at the communal table and had a delicious meal. Next time we'll go first to Nopa!", "author": "Brad D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-04", "description": "Would really like to give this place a higher rating because the staff was friendly and the space is vibrant but the food and cocktails overall fell short.\n\nTwo pastas (pappardelle and carbonara) were more than al dente -- they were undercooked which made the texture hard and dense. The sauce on the carbonara was more like an adult version of boxed macaroni and cheese. Fortunately the flavor of the ragu sauce was better. But again because the pasta was undercooked, both pasta dishes overall were disappointing.\n\nThe Coriander cocktail tasted watered-down despite our server advising us that it was more spirit forward.  \n\nSeems like pasta and cocktails would be solid since they're showcased on the menu. But again they were underwhelming. \n\nThat said, the side order of succotash and appetizer insalata each had a nice combo of flavors.  And the pizza was ok. \n\nLots of options in SF at a similar price point. And disappointing to had spend the time and money there.  \n\nNote: added a star because the service was friendly.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Chef David Nayfeld and his partner Angela Pinkerton have nailed it. \n\nChe Fico has it all: a creative and delicious menu, killer drinks, a vibrant and beautiful dining room, a youthful and energetic vibe, and personal touches like a selection of Jewish Italian food (who knew?), random record album bathroom decor, and my high school soundtrack bumpin' throughout a light, open and airy space.\n\nChe Fico brought in (stole? poached?) the bar staff from San Francisco staple, 1760, and they are slanging inventive cocktails all night. And the staff is attentive and genuinely wants to be there.  \n\nIt's worth taking advantage of California's new laws to make yourself a bit hungrier, just  so you have the intestinal fortitude to order at least one of the amazing crostatas or cakes for dessert. \n\n\n- And Angela Pinkerton's casual dinette, Theorita, coming soon promises amazing desserts a legendary fried chicken sandwich, and the best burger in the city (I've had it. It's incredible).", "author": "Peter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Hands down one of the best meals I've had in SF. We tried the chopped salad, chickpea stew, suppli, chicken hearts & gizzards, biggoli, and broccolini. I had a hard time pinpointing my favorite dish because they all tasted unique and amazing. The suppli was like an amped up version of arancini and the chicken hearts and gizzard salads was out of this world. I had never tried chicken hearts before and don't think I'll be able to eat them anywhere else after this dish. Seriously can't go wrong with anything on the meaning! \n\nOh and the chocolate budino is incredible. Not very sweet, fairly light and a nice complex flavor.", "author": "Hadley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Get here early ... 5pm unless you have a Rez.., amazing space and a bit over hyped but the lamb is outstanding and the cheese sandwich is a worthy starter", "author": "David B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-23", "description": "After a month long wait we got a reservation for 9:30pm. The cocktails were great and the starter, the Caciocavallo, was wonderful and had so many different ingredients that went together perfectly. \nI was with 3 others and we ordered 2 pizzas and 2 half-pasta orders. The pizza was good, not blown away. The pasta was great but we only got 2 bites each. I would suggest splitting a pizza or 2 and everyone getting their own pasta. \n\nThe service was bad. We were brought the wrong pizza and instead of apologizing or comping the pizza they said \"oh\" and walked away. We then had to wait for an entire new pizza made. We wanted to order something else since we were all still hungry and had to wait over 10 minutes before someone made eye contact and we asked them to bring our waiter over. The waiter switched with another waiter mid-shift without mentioning to us. We had to flag down someone for a drink re-order. It seemed like there was plenty of staff there and they were all mingling with eachother. \n\nIf the wait for a reservation weren't so long I would try to go again and order better depending on the group size. The service was not good for the cost/hype of the restaurant. No one was personable and there are so many other fun/friendly places were you get water refilled without having to ask and someone says \"how is everything tasting\". Overall just OK for our experience.", "author": "Emily V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-20", "description": "It seems people will line up and suffer through just about anything due to FOMO. That was the case with me. The line I could live with, only because I was staying a couple of blocks away and it was no big deal to line up before opening (5:30), put my name on the list, go home, and get texted to come back hours later. Chatting with people in line was sadly the most pleasurable part of this dining experience. If your idea of a good time is waiting for hours, sitting under bright lights at a communal table rubbing elbows with strangers and SCREAMING across the table  to your companion, eating pretty good food, paying too much for it, and leaving with a migraine, then this is the place for you! \n\nCocktails, very good. Salad, nothing to write home about. Pasta- tried two: ragu very good, carbonara was a large tube pasta that was so undercooked that it sucked up every bit of the sauce and left a dried yellow finish on the noodles, extremely disappointing. (Btw, both pastas were portioned for ONE.) I don't even remember what else we ordered, except for the sorbetto, which was delicious. The service was ok, but waiter literally could not hear. The space itself was lovely in a rustic way. The communal table is long and wide. There is suspended lighting over it every few feet. If you are unlucky enough to be sitting directly under one of the fixtures, you could perform surgery. (The couple next to us, young enough to be more tolerant of noise, one would assume) asked to be moved to the bar or anywhere else. \n\nMaybe you have a small corner table (reserve months in advance), go very late when it's not at maximum capacity, order the right thing, have a HIGH tolerance for noise, and place a high value on bragging rights for eating at the place of the moment, you will see value in dining at Che Fico. I would not repeat this particular experience if the meal were free, there are just too many places in this city with great food that don't leave you with a pounding headache and neighboring diners' crumbs in your plate.", "author": "Giovanna L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-27", "description": "Not sure I understand the hype here.\n\nAmbiance is great, but the food leaves a lot to be desired.\n\nDuck Liver (4/5) - By far, the highlight of the meal. Would definitely recommend.\n\nPepperoni and Olive Pizza (2/5) - Crust was burnt. Waitress said it's because the chef thinks it makes it \"dynamic.\" It doesn't...it just completely overpowers the rest of the flavor. Worse than a frozen pizza.\n\nSpaghetti Nero (2/5) - The octopus is ground up, and the entire dish just tasted fishy. Wouldn't recommend.\n\nCaciocavallo (3/5): Essentially a savory, cheesy version of french toast. Hard to mess up covering carbs in a bunch of cheese, so we enjoyed it but don't need to eat it again.\n\nIn the battle of hip new Italian spots, I would take a Mano over Che Fico any day, everyday.", "author": "Alex N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-25", "description": "Too crowded, service lacked, dismissed a couple of times, just didn't feel welcomed. \nHigh prices for food portions.", "author": "Jeremy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "Great pizza, pasta and apps. Fun vibe. Spotty service at the bar, but great attention regarding the menu for my gluten-free friend.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Believe the hype, and don't believe in the bad reviews! I had one of my best meals in the city at Che Fico. My girlfriends and I came here to celebrate a birthday and pretty much sampled more than half the menu, and I honestly cannot name one thing that didn't blow me away. Everything was innovative yet well-balanced. \n\nI can see however why people would be let down by the service though. Our waiter was very nice and attentive throughout the night but the hostess was confusing / basically didn't speak English.", "author": "Chang L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Get the Suppli!! The pizza was amazing. I would go back just for the pizza. Was not a huge fan of the dessert, this one was some kind of tart but the grapefruit had a strong bitter taste and the ice cream didn't sweeten the bitterness enough. \n\nService was ok, took a long time but it's because we went the second week it opened. We ordered a bottle of wine and had them decant it. They had the decanter behind the bar on the back wall so we didn't have personal access to it which was odd but I'm sure the flow of the restaurant wasn't there just yet. I definitely will go back and I Can't wait for the salamis to be ready!", "author": "Christina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "What a fun and super cool spot! We had a Tuesday reservation at 9:15 and it was great! The place was packed. Everything we ordered was delicious... from the squash blossoms and charcuterie and octopus to the cocktails and pizza. Because we were eating on the late side and were a bit hungry and excited, I think we over ordered and decided to take the pizza to go,(which was no problem at all. The mushroom and sausage pizza was divine for breakfast! Until we meet again Che Fico....", "author": "Hillary E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "I think it was really good. The food is good. We had a lot of different items the Suppli, Duck Liver, Pineapple Pizza, the Tagliatelle and the Lamb Loin. The lamb loin is really incredible. \n\nI think this place is cute well put together but striving to eat there so bad that you go on a Thursday at 10:30 pm seems a little much to me. We sat down at 5:30 at the counter and those people are amazing to talk to. Chance specifically is really knowledgable. \n\nMy one problem is the service is bizarre. You have multiple people helping you which can be incredible but we had so many different people ask us about filling our drinks and grabbing us new drinks (great amazing thing to have happen) but there wasn't a specific server who knew where we were in our meal so we waited so long between things and no one knew that because so many people were helping us. I think it makes sense (cool vibe pooled house we all love each other) but don't be impressed with their service standards as you would at some other SF faves.", "author": "Jazlyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "What a fantastic meal. Totally worth the wait and the hype. I ordered the fried cheese appetizer, the broccolini, tasted the lamb chops (the folks next to me were in a sharing mood), and has the pork chop/belly for my main course. It was all fantastic. Cocktail menu is cool. I ordered the Rosemary, and while I may not order it again, it was as billed. All in all, highly recommended.", "author": "Jordan I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-27", "description": "Honestly shocked at how disappointed I was with Che Fico. Had been looking forward to trying this place out for awhile since it looked so chic and the menu looked amazing, but left the restaurant incredibly disheartened.\n\nMy partner and I came in a little after 10pm and had paid our bill by 10:40pm. We ordered the suppli (fried risotto), the fried squash blossoms, eggplant mezzaluna, and the squash blossom pizza. About 10 minutes after ordering, the server let us know they were out of the pizza we ordered. We decided to take another look at the menu, but after tasting our first three dishes decided we wouldn't be wanting a fourth.\n\nSuppli: these came out lukewarm and seemed like they had been made awhile earlier and sat under a heat lamp. They reminded us of fried pizza rolls...nothing to write home about and no interesting flavors here.\n\nSquash Blossoms: probably my favorite item we had. They had a nice subtle mint flavor to them which we enjoyed! \n\nEggplant Mezzaluna: one of the least exciting pasta dishes I've had in a long time. It was very acidic, the pasta also seemed lukewarm, and I honestly can't even remember what the filling tasted like.\n\nWhen the waiter came back and asked us if we had decided what else we wanted, it was an easy decision. We paid our bill, left, and went down the street to get slices of pizza at another restaurant.", "author": "Connor B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "My second trip back to Che Fico last night made me realize:  Che Fico not for the faint of heart.  Dishes that were bold and adventurous on my first visit seemed really aggressive this time.  For example, the chopped salad, which had previously been the platonic ideal of an Italian chopped salad, was wildly overdressed last night, and super salty.  We ate it, but were both flattened by it, completely overloaded by the oil and salt. \n\nThe eggplant pasta was also very salty, and quite tart with lemon and sheep's milk cheese.  My dining partner described it as \"weird.\" \n\nThe pizza was again excellent (the pineapple pizza is the best of the bunch), and the drinks were good (not great because they didn't have a selection that featured vodka), but the star of the show is the dessert chef.  The rice-crispy rice pudding with fantasy fruit compote is one of the best things you have ever put in your mouth, and both the salted-caramel and watermelon-buttermilk ice creams are friggen SICK.  The service was also (again) impeccable.\n\nBut yeah:  too bad about the greasy, salty salad, that lemon-goatcheese mouth bomb, and a couple of other dishes (the anchovies, in particular) that were really salt-forward.  I felt like I was going to have a heart-attack by the end.", "author": "Cody V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-07", "description": "Someone got their feelers hurt by my review below - because Yelp took it down - so I will repost -- with MORE INFO as to ??? what prove I am not a bot or fake reviewer sure - ok \n**original post**\nI guess I am hydrated bc my thirst is non-existent\nI dont care who backed this place or who has eaten here (you how what I am talking about) \n\nthe hype will wear off the investors will want a ROI \nthen it will close like all the others \n\nthe food was ok \nok \n\nI dont need this kind of mayhem and nonsense for ok food \n\nAdditional Info so even if feelings get hurt (boo hoo) maybe it wont get removed --- \n\nWas their 4 weekends ago on a Saturday \nWe drank - 2 basil cocktails and water\nAte - tuna a pizza and some cake thing I did not like too much \n\nAgain it was ok ???\nNot great not bad \nOK \n\nSORRY (not sorry) if this hurts CHE FICO or YELPS little feelers", "author": "jennifer t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-25", "description": "With all of the extraordinarily positive buzz and reviews, we couldn't wait to go to Che Fico.  We snagged a prime time reservation a month ahead of time and quite literally counted the days until we could go.  You enter at street level and walk up a set of stairs to the host stand.  I'll start with the good news.  Once you enter the restaurant, the \"reveal\" is a massive, gorgeous space that is stuffed with bustling people.  It has a fantastic \"vibe,\" and you feel really cool being a part of it.  We could not have been more pleased as we sat down at our table.  The \"Indian Summer Insulate\" (Tomatero Farm early girl tomatoes, sweet peppers, beets, hazelnut, Rogue Creamery smokey blue) was simply out of this world.  A perfect combination of flavors and textures, and the tomatoes felt like they had been picked just hours before.  The blue cheese was a perfect foil to the tomatoes, and the hazelnut added wonderful texture.  This was an A+++++++++.  The bread and olive oil were fantastic.  Now the bad news.  The gorgeous space with concrete floors and walls is so loud that holding a conversation, even just 2 people at a very small table, is pretty much impossible.  The \"Suppli\" (fried risotto, tomato, fontina) were cold, dry, and without much flavor.  I can't remember having had such unremarkable arancini.  After the salad, we waited 50 minutes for the \"San Francisco Margherita Doc\" pizza to arrive.  I know that it was 50 minutes because I was very hungry and watching the clock.  50 minutes between courses is not ok.  The pizzas at Che Fico are very different from what you get elsewhere.  They are about 75% crust with the filling in the middle.  The crust is big and bold and dry (and kinda burnt  --  but not burnt in a \"good-kind-of-charred-napoletana-way\"  --  I'm talking simply burnt, in the oven too long).  The pizza was so utterly salty that we couldn't eat it.  And this is from two foodies who LOVE salt.  It was inexplicably over-the-top salty.  Then we had the \"Spaghetti Arrabbiata\" (pomodoro, chili, parmigiana region).  We love \"al dente\" pasta, but this was undercooked to the point of being, once again, inedible.  To their credit, when they saw that we weren't eating anything, they asked for feedback, and we gave it to them.  Again to their credit, they took the pizza and spaghetti off the bill.  We left hungry and scratching our heads.  A day later, we are still talking about it and wondering if the chef ever eats what's being served -- because they would certainly realize that they have somehow veered off course.  This place is obviously a massive success already, and good for them.  The fact that they are willing to genuinely listen to input is great.  I hope they can do some fine-tuning in order that their food and service experience can rise to the occasion of all of the massive hype.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "I had been wanting to try this place for a few months but I didn't feel like making the trek out to wait in line. They have limited reservations on open table, so I got a reservation about a month out. The only spots I could find online were for 9:30pm or later, and they save a lot of seats for walk ins. \n\nWe got there a little early hoping to get seated early, so we went to the bar area to wait. As we put in our drink order, they had seats for us about 30 min early, which was nice. The restaurant is actually quite large, and they have a private room on the side.\n\nDRINKS:\nCocktails: they have a full bar with craft cocktails. All the cocktails have a focus on a particular ingredient such as strawberries or pepper. The bar area was crowded, but there is a server who comes to you to gets you drink order, which is nice. \n- Strawberry: intense in a really good way. I really liked this, and it was great to start off the dinner\n- Milk punch: interesting, but if you like fruit, the strawberry is better \n\nWines: they have a lot of Italian wines. By the glass... \n- Barbaresco: lighter, a bit acidic, still has some tanins\n- Anglianico from Campania: I really liked this - full bodied, lots of tanins, earthy. \n\nFOOD: \nThey have an interesting menu with Italian food but some Jewish and local California touches. It's also awesome that the chefs have spent time at EMP and also flour + water. \n\nThe menu is actually quite big, but we wanted to focus on carbs.\n\nTo start: salami plate - much smaller than we expected with only 8 pieces for $12. I liked the Toscano one, but it was a surprisingly small amount. \n\nOur server recommended half portions of some pastas since we wanted to order so many, but the portions really aren't that big. We did half portions of 3 of them and full of the other 2 and had no problem finishing them (along with a pizza) between 2 of us.\n\nPastas:\n- Tomato leaf cappalleci: filled with salt cod, shaped like wontons, with braised fennel, super intense tomatoes, and olives . This was the most complex dish in flavors, and we both liked this the best. I'm glad we got a whole portion of this. \n- Garganelle: with pancetta and with pole beans  \n- Bigoli nero with octopus sugo, salsa verde: I wish we had gotten a whole portion. The pasta texture was great, and between the salsa verde and octopus, plus crunch from breadcrumbs, it was a very balanced dish \n- Smoked paprika strascinati with lamb sugo. The pasta was like cavatelli, which I love. It was a hearty sugo , so flavor wise, it was as you would expect - like comfort food. It wasn't too gamey, and I loved the pasta texture.  \n- Paccheri carbonara: rich, more egg yolk focused than Parmesan focused, and with slices of pancetta. It was an interesting take on carbonara, but it was a little too much yolk and chives for me. I did save the yolk to dip my pizza crust...\n\nPizza: sourdough crust. \n- Squash blossoms, bagna cauda, mozzarella: I wish there were more of the topping part because I loved that part. The crust took up a large part of the pizza. If you think of it as crusty bread, then it's great warm. However, it didn't seem to match the other part of the pizza that was very thin with the local / seasonal toppings\n\nService started off a bit slow as they were busy but got better. \n\nI know the pizza is a different style, but pastas were the highlight for me. The tomato leaf cappalleci and bigoli were awesome, but I think all are worth trying, and it's nice to have the option of half portions. \n\nWith a reservation, I would come back to try the meats and get the pastas.", "author": "Marilyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "I had a fantastic birthday experience here! My husband and our two children had the bolognese; suppli; spaghetti; pineapple pizza and the chicken with polenta. I enjoyed everything I tried; however, hubby said he wasn't too impressed. I thought the service was excellent, but some of that was also prepped by my husband, as he went by early to drop off my cake and gifts. I plan on returning to try new things on their seasonal menu. I love Italian food and I felt like it went above and beyond any other Italian place I've been to, in terms of the flavor and creativity.", "author": "L. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Fantastic overall experience at this new Italian spot in NOPA. The whole staff was warm, attentive, and our server made excellent recommendations as it was our first time dining here.\nRecommended items:\n- Wood fired octopus salad\n- Glazed lamb belly\n- 'Nduja\n- Spaghetti\n- Papardelle al Ragu\n- Strawberry cocktail", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "We had to try Che Fico. The hype was insane. But for the price and the service it just did not live up. We didn't have a reservation so sat at the bar-- I get the place is super popular so I think they rely on that for customers. A tiny new mom and pop has to bend over backwards to win your loyalty. I think this place was sitting back because they didn't need to try. Our bartenders were not kind or attentive. I love to ask about the menu and hear the passion behind the server or managers descriptions. I received very terse answers. Especially sitting at the bar you expect more engagement. \n\nWe got the eggplant mezzaluna and the squash blossoms. Good but there is some great pasta in this town and at places where you don't have to wait an hour.\n\nCocktails could have been better balanced. Was not compelled to have another. \n\nUltimately would not go back.", "author": "Megan N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "Ambiance: 5/5.\nDrinks: 4/5.\nFood: 2/5.\nNot doing an average because I don't care about the ambiance if food is bad.\n\nforget the name of the cocktails: both were great, well above average and I'd love to have them again. and the only reason I have them a 3 instead of a 2.\n\ntriangoli: way too much lemon for a pasta sauce, also the pasta was too thick and tasted gummy. A real disappointment because I've had better pasta in SF. The only saving grace was that the sauce did work as a good dip for bread.\n\npizza: crafted for Instagram, not taste. The charred crust and the dusting of white cheese are ineffectual and don't add anything to the pizza. It's limp as most pizzas are in this city, so I wasn't disappointed but I wasn't impressed.\n\nolive oil cake: actually tasted (and looked) like a day old piece of wonder bread soaked in olive oil. The gelato was good, but it didn't matter when the \"cake\" was so bad.\n\nI will never come back, I'm sure many others will, and writers will continue to gush over this well known SF chef, but the fact is the food is average (and bad relative to the price).\n\nAdvice for people who like the food at Che Fico: take a trip to Italy, LA, or NYC please. You will not pay for this pasta after you get back.\n\nSorry but I wasn't put under a spell by your stunning decor.", "author": "Kartik S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "i was really excited to try che fico and waited forever to score a reservation at a normal time on a saturday night. we arrived just a few minutes later than our time slot, and were immediately seated. the restaurant is surprisingly huge! we learned from our waiter later that it is a converted auto shop - pretty cool!  it was also packed - almost every table was taken, and there was a huge crowd at the bar, presumably waiting to be seated. i did notice a few options for walk-in's maybe if you are a small party, but otherwise i would be prepared to wait a while. i had seen the menu a few times already, so was prepared to order. we shared the pineapple pizza, the mushroom pizza, and an order of the carbonara. also tried 3 cocktails - milk punch (good), the cafe (very medicinal), and a more traditional spirit-forward selection. because the pasta was taking a bit longer, our waiter brought us complimentary pickled veggies, which were a nice touch, but not super enjoyable. overall, i was really disappointed in the food. the pasta was cooked well, but way too salty (and i enjoy salt quite a bit). the pizzas, while beautifully presented, lacked depth of flavor. i thought the mushroom (with sausage) was superior to the pineapple for sure, and had more interesting texture from the shaved raw mushrooms. perhaps i was too excited for trying this top 10 new restaurant that my expectations were skewed. would come back and give it another shot; in the meantime i will try the burger downstairs.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Exceptional. Tasty, price is right. Ambiance is NoPa meets Zuni. Service is excellent. Always someone checking on you. The bar and counter are at opposites. And they are opening another restaurant downstairs soon. The food had no flaws. Simple flavors, seasonal. Quantities not overwhelming. The alcohols we chose were excellent. The Barbaresco was excellent with veal farfalle. The pizza was also excellent and the amaro to die for with the cake. We should be back tomorrow.", "author": "Xavier O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "BELIEVE THE HYPE. Yes, the fig wallpaper is cute and the interior design is adorable for days, but the main attraction here is the FOOD. My god, the food. If I could come here every week, I would. The pizza is killer - not just the famed pineapple pizza but also the white pizza and I'm guessing every other pizza they make. Flaky crispy crust, amazing cheese and sauce. Must be tasted to be believed.\n\nBUT. PEOPLE. This is important - do NOT miss the fried cheese! There is Meyer lemon in it. It may be the best appetizer I have had anywhere in SF or NY. It's out of this world. \n\nThe drinks are also outstanding and they age their own meats to perfection in-house.\n\nThis place is more than just the latest instagrammable fad. It has truly unique and outstanding, non-pretentious but complex food. It's here to stay.\n\nPS: we also got the chance to preview some of the chocolate they will be serving downstairs. It did not disappoint.", "author": "Christina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "Wait is super long without reservations, I get it it's hard to manage with the space. Quoted abt 2-2:30 HRs for a Friday night at 7:20pm for a table and bar was not quoted thought it might be an hr and it took 1:30 to get two seats. The thing was they said we were up next and it still took 30mins. Not too upset because the standing room was cool but I was expecting less time o", "author": "K T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "We had planned a dinner a month ago for an anniversary. We had previously eaten here, as we live in the neighborhood, and were impressed enough with the food and thought the kinks in service would have been worked out by now. We requested to sit at a table that comfortably sat 5, they put us on a 4 top with an added chair. No big deal, I let it slide. Service took a while once we were seated and was a bit lacking, but the server was pleasant, albeit aloof and not on top of things, like filling our water and wine glasses. \n\n\nFood is pretty tasty, but the front of house fails to bring out food in timely manner, resulting in luke-warm food and main course entrees coming out 15 minutes apart from each other. They fail to provide top notch service and the front of house manager we spoke to (an overweight bearded man wearing a blue button up shirt with very rosy cheeks and slurred voice) was noticably drunk and didn't know the first thing about customer service. He outright dismissed our feedback and just said \"sorry, have a good night.\" Not professional at all, not to mention we could hear servers bad mouthing patrons at the station that was conveniently located right behind us. I worked at Trader Joe's for 6 years, so I know what a reasonable person expects good service to be, and this was not it. \n\nGo to Nopa if you're on Divis or Rich Table if you're in Hayes Valley, the food is hotter, better, and tastier and the service is so so so much better than this place. If you want tasty sour dough pizza, go to del popolo or pizza hacker. There is a major disconnect between the front of house and the kitchen, not to mention we got the servers hair in our food twice during our meal. Gross. Hair in food for a restaurant like this, or any restaurant for that matter, is unacceptable. \n\nI wish you guys the best, as the food is good. But the hype has ended and if you want longevity your service and management needs to vastly improve. \n\nI'm not sure if I'll come back, but good luck, Che Fico.", "author": "Zo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-31", "description": "This place is not good. Extremely slow service and several mistakes. Not worth the wait. Sat squeezed between two large couples who were having pretentious conversations. Dessert was sub par. Had high expectations that were not met. Will not go back.", "author": "Monica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "Food was very mediocre, borderline terrible. Food took forever to come out though the service was excellent. This place is overrated and trendy, don't bother", "author": "Derrick W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "We got in line at 5 and made it into the restaurant at the communal table quite promptly at 5:30 pm with my wife and son.\n\nAfter a glass of wine, our party of three ordered our food comprising the small salumi plate, the chopped salad, the sausage-mushroom pizza and three different pastas.\n\nBest dish or the night was the salad!  The salumi plate was OK but unlike most we've had--with a warm meatloaf thing and very little sliced, cured meats. And no explanation of what anything was.\n\nThen the problems began.  Unbeknownst to us, the owner/chefs do things THEIR WAY.  They don't say on the menu, but everything is served family-style, shared-plate style.  No matter what.  That means it is very unlikely that you will be eating anything in any logical order.\n\nAfter a long wait, my pasta, cacio e pepe, arrives.  A small portion but not just cheese and pepper, but drenched with butter.  That is not a part of this dish.  But that was the least of our problems.  When they serve anything, they give you a big spoon and fork for sharing.  But we weren't sharing.  This was my pasta.  I waited for a while assuming more would come.  But no. So I dug in and ate it all before it got cold.\n\nTen minutes later the pizza arrives.  Good but not great.  Copious amounts of raw sliced mushrooms over a spicy sausage melange.  About 10 minutes later my wife's pasta carbonara arrived, and it was skimpy and not very good, with a weird fish taste.\n\nI asked about my son's papparadelle pasta?  \"Coming,\" the snooty waiter replied.  My wife finished her pasta, and then we waited another half hour.  My son's pasta never came.\n\nWe asked for the check and said how disappointed we were.  I asked, \"If my wife and I came in and each ordered just a pasta dish, would we get them at about the same time?\"  No, the manager said.  The chef wants things to be cooked as they come in.  That makes no sense, since I assume all our parties orders went in at the same time.\n\nWorst of all, no amends for their error.  No free dessert, nothing.\n\nAnyway Che Fico is not worth the hype.  And too trendy for its own good.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "We had dinner here last night for my husband and our little 8 month in tow. I couldn't tell you how much we loved loved loved the food. We ordered the squid ink pasta and the pappardelle, perfectly al dente and full of flavor. The entire staff was just so friendly and happy. They made our dinner absolutely pleasant. My new favorite spot for Italian!!", "author": "Buttercup N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "The hostesses were very nice and welcoming. We didn't have a reservation and got there at 6pm on a Saturday. We knew we might have to find a back-up plan since the wait would be very long for their communal table or the bar area. The bar has its own waitlist which I think is very smart and seamless. The bartender who greeted us and took down our name was awesome. We ordered two rounds of drinks. He quoted us about 1.5 hours of wait. The bar does turn over quickly because the food is mostly quick to make and eat. We ended up waiting for less than an hour which was a nice surprise. The ambience and decor are excellent. They're a good mix of east and west coast. \n\nThe food was excellent. Every dish has its own uniqueness. I would have given this a five stars review if it wasn't for our bartender/waiter. The bartender we got after sitting down was not the one who greeted us. This dude was grumpy. Didn't really smile or interact with us. As three women out on the town on Saturday night, we were certainly in a playful and fun mood. He totally dampened our mood. Also, my friend really likes her drinks spicy and she asked him to make them so. When we got the bill, one of her drinks had an extra charge on it. He didn't disclose with us this would happen. We don't care about the cost but the fact that he made the same size drink and charged for more without letting us know why is shady. Also, when we first sat down and wanted to order the duck liver, he said \"you can't just order appetizers, you have to order an entree too\". I was very annoyed because we already planned on ordering an entire meal. There is definitely a more tactful way to tell your customers that. \n\nAnyhow, he sucks but Che Fico is awesome!", "author": "T D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Wow, just wow. Everything about this place is fantastic. Funky wallpaper, great music, friendly staff, amazing food and drinks.\n- Kumquat apertif- light and refreshing, perfect pre-dinner cocktail\n- Fried cheese- omg, this was insane. So good, love how the lemon cut the richness of the cheese\n- Spring veg with mozzarella- the cheese was not like any other moz I've had- really creamy. Veggies were colorful and crisp, and the fruit perfectly ripe. This is a gorgeous plate of springtime\n- Margherita pizza- light, perfectly cooked crust with really yummy sauce. Just enough cheese, just enough salt. \n- Triangoli- handmade, stuffed pasta- a party in your mouth with creamy ricotta, sweet honey, tart lemon, fresh mint, crunchy walnuts. It sounds crazy, but it works.\n- Roasted cauliflower- generous serving perfectly cooked, just the right amount of heat\n- Olive oil cake- loved the sweet, salty, creamy gelato and the tart strawberry sauce\n- Chocolate bundino- creamy pudding, not-too-sweet salted caramel gelato, crunchy walnuts\n\nEvery dish was gorgeous. Every bite filled with multiple flavors and textures that all somehow played nice together. Love, love, love. Def recommend!", "author": "Ryen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-30", "description": "Perhaps this is the overhyped new restaurant phenomenon. \n\n(Granted this is based on just one visit, but my opinion is pretty meh relative to the expectation.)\n\nFirst things first. The dining room is fantastic. Vibe is energetic and the interior is super cool. The bar is also fantastic, with great cocktails and amazing bartenders.\n\nBut on to the food... \n\nSuppli are a staple street food in Rome. The are supposed to be crisp, moist within, and have a molten core of cheese. \n\nAt 5 bucks for 1 piece I'd expect a great rendition of this 1 euro snack. But the cheese in the middle was firm. Sorry guys, a poor execution.\n\nThe anchovy appetizer was tasty, but the actual anchovy content was less than 10% of the plate. Less burratta, less eggplant, more fish please. Or else call it a burratta dish .\n\nCappelacci pasta with bacalao was delicious. But the serving size was unforgivably small.\n\nSalad of tomatoes, watermelon, and feta was the nights winner. The gazpacho on the bottom of the plate was perfect and the whole dish was delicious, balanced, and generously sized.\n\nPizza was nice, but there is so much good pizza in this town I don't think it stood out. \n\nDessert was a big miss. The crostata with fig and blackberry was dry and resembled a poor home cook's rendition. I've had better examples of this dessert a thousand times. Why did our server recommend it so highly?\n\nThe rice pudding wasn't really a rice pudding, but rather a pudding with some crispy rice. The dominant flavor was raspberries and it was tasty, just not what the menu description evoked.\n\nSo overall it wasn't a bad meal, just not the experience I'd anticipated given the incredible reviews and the serious prices.", "author": "Al M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "Overpriced Italian food.\nThe restaurant is very nice but that's pretty much it.\n\nFront desk was very friendly but service wasn't great, I've experienced much better elsewhere:\n- They try to get your drink off the table while there is some left, can I finish first? Thank you.\n- When you place your order they let you know entrées won't come at the same time. Ask why and they'll tell you \"because it comes out as soon as it's ready\". Well, isn't it part of a chef's job to plan for this? If you know that pasta will take 10min to make and a pizza 20min, start making pasta 10min in. Our entrées did come out one at a time (pasta first and pizza 10min later -- no need to say that we had cold pasta for dinner that night).\n\nWe didn't have a reservation so we waited by the bar (our cocktails were just ok) and sat at the communal table which was fine but very cosy (if they could fit a couple extra chairs in there I'm sure they would), you sit very very close from your neighbors (like elbow to elbow close -- so don't move too much) and in the end you can hear their entire conversation but the one you're having with your friend sitting across from you. This place is super super loud (don't even ask for recommendations if the waiter/waitress is standing on the opposite side of the table, who won't hear a word).\n\nWe ordered 2 things from the menu:\n- Green Garlic Agnolotti Pasta: they tasted fine but for $26 the portion was tiny, so all I remember is having overpriced pasta that tasted good but nothing mind blowing (and had them cold because of their terrible kitchen planning I described earlier).\n- Mushroom, Sausage, Mozzarella, Calabrian Chili Pizza ($22): they put grated parmesan on the crust, that sounds like a nice touch and a good idea at first... until you figure out it must be to hide the burnt crust (looking at other peoples pizza they looked burnt too so it wasn't just ours). Too bad because the pizza itself was good.\n\nI would not recommend Che Fico, there are much better Italian restaurants in the city, don't waste your money.", "author": "Morgan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "I get that this is a hot place to check out but they should really fix their service because it's terrible/non existent. The hostesses seem like they don't know what they're doing. Bartenders are too cool to serve you drinks and servers disappear when you need them. \nThe food isn't better, unfortunately. The pizza is tasty but the crust to pizza ratio is bad. You get 3/4 burnt crust and the rest pizza. The grated cheese is a nice touch but since the crust is burnt, it's not that appetizing. Pastas are a joke. Yes, it's good but for $25, it better be amazing and substantial, unfortunately it's neither. One of those restaurants that don't care about their guests and lack hospitality. Was there even a manager around?\nToo bad.", "author": "Bobby S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-18", "description": "The restaurant is gorgeous and the food is pretty good, but I left this dinner feeling a little disappointed.\n\nWith all the hype and having had to make a reservation at midnight exactly 30 days in advance, I assumed this was going to be an incredible experience. While nothing was terrible, it certainly wasn't perfect.\n\nWe arrived a few minutes early, but had to wait 20 minutes beyond the reservation time. This was the first ding on an evening of less than stellar service. There were no disastrous mistakes, but at most nice restaurants in the city, I'm used to staff going out of their way to make the experience wonderful. \n\nThe food was terribly overpriced, even for SF. I thought the pizza and pasta was normal expensive, but the small dishes were ridiculous. Our salad, which didn't have any meat, was $18. The fried artichoke was priced similarly. It came off very pretentious. \n\nThe food was good. The pizza was probably the best, but IMO pizza is always very good. I liked the pasta a lot, but it wasn't even in the same league as other favorites like Flour + Water. Everything else was fine but very small for the high price. Not really shareable because there were just a few bites. This is not food for which I'd line up outside 20 minutes before opening.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "4.5 stars. Hardest reservation to get in SF nowadays (thanks a lot, Anderson Cooper). Great pizza with a purposely-charred, crispy-bottomed sourdough crust with excellent flavor combinations. Solid pasta with fresh seasonal ingredients (though Flour + Water probably has better pasta). Grilled octopus and pork belly had perfectly cooked, tender octopus, though a bit expensive at $26 for the appetizer dish. Supplis were amazing and well worth the $5/piece. Dessert, apparently made by the former EMP pastry chef, was pretty good as well. There weren't things that were unique and mind-blowing, but there were no weak points. Does it live up to all the hype? Go judge for yourself.", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Came to see what the hype was all about. Inside the place looks great, loved the layout and the vibe. Food was delicious, can't really say anything negative about it, well maybe just that it might be a bit over priced. Unfortunately service was not satisfactory, took the waiter forever to come around to take our order and was just not present, the manager had to step up and take care of us majority of the time. Overall I would say this is a one time deal, doubt we would be rushing back for more.", "author": "Roman L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "The fire roasted chicken is delicious and I'm glad I went. But it is deafening and I will never go again.", "author": "Polly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "We managed to make same-day reservations, so we didn't have too much time to get over-hyped about this place. Even then, it failed to deliver.\n\nBottom line is that this is a pretty large restaurant (about a 100 customers at a time), and it's extremely difficult to deliver the quality of food that early reviews implied in such a large place.\n\nThe high marks of the space/ambiance I just don't get. It feels kind of  LA/industrial.\n\nWe had an octopus/pork belly appetizer, the cappelletti pasta, and the dry-aged lamb for two. In the same price range for Italian, I've had much better meals at SPQR and Cotogna.\n\nThe one thing I would consider going back for is their pizza, which I didn't try but looked intriguing.", "author": "Keith P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "This was for my love's birthday, so we went all out. We shared everything we got.\n\nShe had the Thyme cocktail w/ cocchi rosa, aquavite, thyme, oloroso, and genever. She's says that it wasn't quite sweet, very savory. A full-bodied drink with a slightly bitter aftertaste that blends very well.\n\nI had the Berries cocktail w/ mint, smoked maple, ver jus rouge, chocolate bitters, gran classico, and gin. This was a wonderfully light and refreshing drink, perfectly balanced to not be too sweet.\n\n- Grilled chopped duck liver w/ onion marmallatta, scarlet turnips, pickled onions, and Roman matzo; this was rich and creamy, with a perfect blend of salty-sour to balance it out. Essential.\n\n- Wood fired octopus and crispy skin pork belly w/ marbled potatoes, wild watercress, lemon, and chili flake; the potatoes weren't completely softened and served as good complement to the balance of chewy octopus and crispy-tender pork belly. The pork belly was a baffling mix of being crispy and chewy while still being tender and melty.\n\n- Rossotti ranch veal tartare w/ Australian black truffle, lemon, and grilled sourdough bread; oddly the flavor profile of this reminded me a bit of ceviche. The lemon and raw meat were good, though unseasoned. This one was about the flavor of the ingredients.\n\n- Warm beef tongue w/ salsa verde, crispy capers, celery, and pickled mustard seeds; this was fantastic and one of our favorite parts of the meal. I used to have beef tongue in stew when I was a child, and she had never had tongue before. It was slightly crispy on the bottom and the fat was perfectly melty, making a perfect addition to the savory chewiness of the rest of the tongue. The pickled seasonings were perfect, making for a version of tongue that I'd never even considered. Absolutely incredible.\n\n- Triangoli w/ sheep's milk ricotta, lemon, avocado blossom honey, mint, walnuts; a deceptively simple dish, the way the flavors of this dish play off of each other is sublime. Get as many bites as you can with a bit of everything, including the walnuts and the mint. The lemon sauce and subtle sweet tinge of the light honey is a surprisingly fitting pairing for the rich and salty ricotta, but mix in the nutty body of the walnuts and the fresh bite of the mint and you have a brilliant combination of notes in each bite. \n\n- San Francisco margherita DOC pizza; DOC means locally sourced within a couple of miles, and you can taste the freshness. Unfortunately, while still delicious, this was one of the less impressive dishes. For some reason Che Fico chars the crusts of their pizzas, and after the rest of the dishes it felt underwhelming to have just a few bites of margherita pizza. You can taste the quality of the ingredients, but this just didn't pop as much as the rest.\n\n- Slow toasted 21 day dry aged lamb loin w/ wood roasted potatoes, watercress salad, lamb drippings; this was, simply put, perfectly cooked lamb. If you like a good slice of meat, this is an excellent choice and well worth the cost. By this point the meal had defeated us, so we had to box most of it to go, but definitely excellent meat prepared excellently.\n\nThen came dessert. Oh my.\nI had a cup of their coffee. Even their coffee was excellent. I was almost upset at how good even their coffee was. Can these people do no wrong?\n\nShe had the mini cannolis, made with house made ricotta, candied kumquat, and cocoa nibs. These bite-sized delights had cream filling that was rich without being too heavy, and their candied shells was crispy and cracked apart in a very pleasing way. The candied kumquat and cocoa nibs played into the flavor so well that I would even call it clever. She was very pleased.\n\nMy dessert was the triple delight blueberry pavlova w/ crisp coffee meringue, crema, blueberry sorbetto, logan berries, and mint. I disappeared into this. The different flavors and textures of this dish were incredible. The sorbet and the berry sauce and the berries themselves are different textures and styles of that lovely berry sweetness and tangibles, while the crema and coffee meringue gave it a smooth, creamy, rich body. As a fan of all of these things, I was in heaven. I can't complement this dish enough. Mind-blowing.\n\nThe service was prompt and the waiters were wonderful. They were attentive without being overbearing and had a fantastic attitude.\n\nI was prepared to spend far more than I did; after tax, all of this came out to around $250. Absolutely worth the price. I can't recommend this restaurant enough. This birthday meal ended up being exactly what we had hoped for and more. Make the reservation and come prepared to have an experience with your food. Thank you so much to Che Fico and its staff.", "author": "Mahan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "What is going on with all this hype?  Top ten new restaurant in Bon Appetite.\nTop 50 some other publication. It's ok folks. \nPasta was cold, sauce was lukewarm. Duck liver ok.Chopped salad meh.\nHowever the Roast Chicken was excellent.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "We were really excited about going to Che Fico after all the press we read so I had high expectations.  And we got some real highs.  Service was great, the Papparadelle Al Ragu was amazing and we loved the sausage and mushroom pizza.  I thought the chopped duck liver was ok - my husband loved that dish. It reminded him of an elevated version of the duck liver he had growing up (I can't imagine eating duck liver as a child!).  We also had the fried artichokes which I thought was a low.  It is actually the bottom of the artichoke but they leave the outer skin on and fry it so it is super crispy. But the result was very stringy and tough.  The aioli that came with it was great.  \n\nI just loved the fact that Che Fico has a totally different style of pizza than I have ever had.  Not often you discover something new and delicious!", "author": "Deb R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "I heard that it's difficult to get reservation at Che Fico. Since a friend was able to make reservation for a party of four on a Friday night, I was happy to join in.  Food and service were really good. I liked the atmosphere there.  Because it's on a Friday night, it was very busy and noisy. Would like to try it on a weekday in the future.", "author": "Norman Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-18", "description": "Che Fico is the hot, new place in town.  So exactly how I scored a reservation for a single on Open Table is a wonder.   And seating at the counter overlooking some of the chefs as they work provides a free floor show.  One might add that the venue is beautiful, the service very good and helpful, the restrooms clean, and the music a bit too loud.  As for the food, it can be really good or not quite so good.\n\nIn the really good category was a half order of cappelletti which came filled with cheese and topped with morel mushroom and fava beans.  At first taste the sauce seemed a bit too astringent but as I tasted more its depth of flavor shown through.  Great stuff.\n\nA half chicken came with a sweet and sour sauce and a side of polenta. The bird wasn't one of those tiny things so often placed before you. It was large, meaty, and undercooked.  So while the breast was moist, the skin was not at all crisped and as one cut closer to the bone of the thigh or leg the pink became obvious. The undercooking wasn't egregious but sufficient for me to leave parts of the meat alone.  The polenta was perfect.\n\nOne of the chefs asked my opinion of the chicken and I let him know that to me it was undercooked.  He looked and walked over to the expediter, said a few words and returned to his tasks.  Nothing was said to me but my assumption is that the message was received.\n\nOne other thing about the chicken.  It is obviously made to be shared but it was cut in such a way as to make this difficult.   Che Fico might consider cutting the chicken into sections in which the leg, wing, and thigh are separated and thus easier to pass around a table for sharing.\n\nOverall, I liked this up-tempo place.", "author": "David D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "cool and hip.... not to mention RUDE!\n\nI had a reservation but the hostess was running late so she said I should go to the bar. I found a few seats and then I get yelled at by a bartender that there was a waitlist. I said, \"No, I have a reservation, I am waiting for my table.\" He responds with \"You still need to be on my waitlist for a seat here\" ???? \n\nFast forward, we are seated 30 minutes late.  We ordered a nice bottle of red wine and we received 2 glasses of wine - I reminded my server that we ordered a bottle and she said \"No you didn't\" Um. Yes, we did. When our food came most of it was ok but my pizza crust was burned and had an odd sprinkling of cheese to mask the burn! I was interested in dessert but the server just dropped the check so I figured they just didn't care. I had it so I asked to speak to a manager, but he was the biggest jerk of them all so I wished them good luck with their restaurant with their weird rules and argumentative staff, paid and left.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Gorgeous interior...five stars for the wallpaper and ceramic tiles alone. The community style tables, open kitchen, flashes of wood, steel and manufacture meets   cozy pizza loft were all appreciated. Everyone raves about the spicy pineapple pizza but I almost favored the watermelon gazpacho and tomato and veal farfalle more. \nNo deductions here but at a trendy/hyped place like this you are going to get a lot of young tech (fire)starters. And unfortunately our entire night we were seated next to a young dude trying to convince his date on their date that they were meant to be based on their academic backgrounds, high tech network, starting two startups but also possessing modest do-gooder values *felt pukish having to hear that pressed upon the poor date over and over again. The tables are super close by so that's the only caveat.", "author": "A K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Che Fico absolutely lived up to the hype! I made a reservation about a month and a half ago for a Thursday night and then was SO upset when a conflict arose that prevented me and my husband from coming. We called to see if there was any chance they could squeeze us in at another time. The hostess was amazing and found a spot to squeeze us in at 530. First of all, the interior is stunning. There are so many intricate details that I loved. Our waitress recommended an amazing Cabernet-esqe wine, and we ordered (let's be honest, I had preordered in my head) the suppli, octopus & pork belly, pepperoni pizza, and half orders of the tagliatelle and orecchiette pastas. \n\nEverything was great, but OMG that pizza. It was incredible. Both pastas featured homemade noodles and were fantastic. The tagliatelle with ragu was much lighter than some others I've had, but not in a bad way! When we come back, we agreed we would pass on the octopus. We will definitely be back, and will have to save room for their incredible desserts!", "author": "Stefani S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-10", "description": "I'm giving it an extra star because the Old Fashion was pretty legit and not too sweet but still boozy.  Service was terrible.  I read the reviews before we decided to get here and I thought \"oh it's been open for a few months now. They got their shit together\".  NOPE. Every review was right.  Service was terrible. Took three hours for all of our food ( literally took an hour between appetizer and entree ), and the best part was that there were tons of waiters but they pretty much just hung out and didn't do much.  \n\nAs for the food, the octopus and pork belly was good but the sauce didn't go well with the belly.  The mushroom pizza was no bueno (they didn't even cook the mushrooms, it looked like it was an after thought they threw on), the pasta wasn't was over sauced and just not flavorable.    \n\nWould not go back.  The place was nice looking but the fact that you need to put your name on a waitlist just to sit at the bar is just too fancy for me (when it totally isn't)", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "Everything was great. Fried pasta was odd but tasty. Charcuterie board was amazing. Drinks were good and cold. \nOnly complaint is how hot the restaurant was. Oh my. I had to go to the bathroom to get some cooler air. They have the ability to open windows but I assume because they're next to tables they don't want to bother those guest. But if you're gonna have a open pizza oven you need to get some ventilation.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "If I could do 10 stars, I would. I'm not even sure where to begin with this review, but the hype is REAL you guys.\n\nDecor and Ambiance: beautiful, chic, and just dope. You walk in and you instantly feel like you're in a place where you'll be taken care of. Everyone is SO NICE here to the core. \n\nThe bar and drinks are legit. Big enough space to wait while the heaps of people who are waiting in line roll in. \n\nService: Omg can I bring these people home with me and give them all the love in the world?! Just again, genuinely so nice. \n\nFood: I live in New York where I have a plethora of food. Che Fico left me wanting more, more, more, and dare I say: more. There were a few of us and we all agreed, I promise. My favorites were: suppli, grilled chopped liver (this one also looks like art), chopped salad with the most delicious smoked provolone, san francisco margarita pizza, the pineapple pizza, tagliatelle al ragu, triangoli, and the olive oil cake. \n\nI'm sitting here half drooling half crying. Just go. The wait is worth it.\n\nLOVE YOU CHE FICO, PLZ DON'T CHANGE.", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "The food was delicious - highly recommend:\n\nCocktails - super yummy\nSummer Vegetable Insalata\nHouse Cured anchovies\nChopped duck liver\nOde to Judy Rodgers pizza\nSpaghetti alla chitarra\nWild fennel campanelle\nBittersweet chocolate budino\nNectarine crostata\n\nTook off a star because the service was a bit slow - had to wait about an hour and a half before we got our main dishes after apps. The kitchen did bring out a pasta dish that was on the house which we appreciated!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "This place is what San Francisco really needed New Age fun Italian restaurant great ambiance amazing music superb service and most importantly the food is outrageously good!!! Best pizza and pasta that you will ever have in your life!!!!! Also delicious cocktails", "author": "amy h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Awesome customer service and great atmosphere; you can taste the hard work and effort that goes into each dish. Add this restaurant onto your bucket list if you haven't eaten here yet. You will not regret! Bring your family, your date, or even come alone, Che Fico will not disappoint!", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Ive been waiting to try this restaurant for a while! The pineapple pizza is definitely worth the hype. The suppli was amazing and the chopped salad was great. I also loved the olive oil cake.", "author": "Fares A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Long wait for amazing food and service. Everything we had tasted amazing. The wine was great. The atmosphere is great for groups w the shared tables. We got a table for two and had a nice date, though. Nice servers and hosts too.", "author": "yasmine k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-05", "description": "A 4-hour wait generally signals a trendy restaurant backed by solid bites (and drinks) and staffed by an all-star team. While we were glad to skip the wait with a reservation, we were sorely disappointed by the quality of food and service we encountered here. \n\nThe night started on a weird note when we were told no less than 3 times that we had to put our entire order in at once - no adding on orders after the waiter took the initial order. Ok, that's fine - but why stress it so much?\n\nWe ordered 2 'half' pastas which here means 2 strands of pasta each with some sauce on top. It wasn't bad - but nothing to write home about either. The pasta also took over an hour to arrive, which means they still have some logistical hiccups to solve. Don't plan to grab a quick bite here, that's for sure. \n\nWe also got a mortadella honey blossom pizza which apparently means throwing a couple pieces of cold lunch deli meat on top of a pizza after it comes out of the oven. Yes the meat was cold and slimy, and the manager told us it was supposed to be like that. They would not even heat it up when we asked. We sincerely hope no one else has to go through this experience as we would not wish it on our worst enemy. \n\nOverall our order of 3 fairly easy dishes took over 2 hours with little to no service or explanation in between, outside of the occasional water refill. \n\nThe kicker - the restaurant charges a 6% SF mandates fee which is the highest I've seen yet in the city. While I support the premise of the mandate, the %s are getting out of control, the growth being spurred by restaurants such as this one. \n\nI am really excited whenever a new buzzy restaurant opens up in my neighborhood. I just hate it when reality so poorly measures up to the hype.", "author": "Josh Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Wow just wow. Make a reservation. Everything was done with care from start to finish. Handcrafted just about everything. You can ask for an opinion and you'll actually get one which is nice. Also, explanations on the wine were on point. We can't wait to come back. The pizza crust is purposely blackened. The desserts and coffee were a perfect compliment. Got the Budino and the olive oil cake. They also offer sparkling water which is wonderful also. Everything was really thought out and cared for. The basil can cocktail killed me lol...I'm not a martini drinker but it was good nonetheless. Come here for a special occasion or for no reason at all!", "author": "Guisela L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-11", "description": "Pluses:\n* Very high quality ingredients:  Polenta had deep corn flavor.  Beef tongue was exceptionally tender.\n* Creative preparations, unlike most Italian restaurants.\n* Cappellaci (ravioli) with baccalá had a very nice, light tomato emulsion as its sauce.\n* Servers were eager to help and unpretentious.\n\nMinuses:\n* Outrageously loud music with pounding bass.  Louder than even today's hip restaurants.  I will never return because of this.\n* I love strongly flavored food, but many dishes were imbalanced by an excess of a single strong spice that overwhelmed the other seasonings in the dish:  Carbonara had too much black pepper.  Worst of all, excessive vinegar in octopus salad completely wiped out the flavor of the octopus.", "author": "Bob S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "For the prices and the wait, the food was just okay. Same with the cocktails. My friend and I ordered the duck liver pâté which was delicious, but by the end of us each eating half, we were sick of the onion flavor. Just too rich. It took around 45 minutes for our pizzas to cook, and they came out 10 minutes between each other. I ordered the Margherita pizza, which was super tasty. We didn't like that the crust was so big compared to the rest of the pizza, and the crust is also a bit burnt. Usually I like to eat my crust, but I didn't like the charred flavor. We each ordered a drink off the cocktail list. Both were $14 each and her's tasted like pure gin, while mine tasted like lemon soda. They just weren't that great for being craft cocktails. This place was fine, but 100% over hyped. The one thing we both loved and had no problem with was THE DESSERT. Wow. The cannolis and the ice cream. I have never had such creamy delicious ice cream before. The mint tasted like fresh mint leaves and basil. Wow! The salted caramel actually tasted somewhat salty and wasn't too sweet like salted caramel ice cream usually is. I loved it. Definitely a good spot for dessert if you don't mind the wait. Maybe in a few months the rush will slow down.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-23", "description": "i was SO looking forward to coming here. so, when i finally saved up and took myself on a date... i was PUMPED! yes, long line, long wait, but i expected it.\nthe ambiance is great - cool, fun, hip interior.\noctopus salad - chewy, flavorless\nthe \"ode to judy rogers\" pizza - uneven heat, cold spots, NO flavor. i can't imagine judy would approve of this exploitation.\nso underwhelming, way overpriced, incredibly overhyped.\nthe waitstaff was wonderful and they earned che fico one extra star for comping my pizza.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Been here twice now. Both times off the chart crowded. And I'll be honest , for the wait-- the food isn't that spectacular. Crazy loud. Crazy busy. But just not that great. Not bad by any means. Just a solid meh. Bar staff is quite friendly and attentive.  But there's better Italian in the city for half the price and half the wait time.", "author": "Colby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "Standouts: porchetta, the coconut rice pudding, olive oil cake, chocolate budino, squid ink pasta, paparedelle. In order.", "author": "Julia Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-17", "description": "I was so torn between 3 and 4 stars for this place. Ultimately I decided that we could have made some better ordering decisions and the cocktails were a huge let down. HOWEVER, I'm excited to go back and try again and definitely won't let my first experience hinder my next!\n\nWhat we loved: \nFirst of all, the atmosphere at Che Fico is unlike anywhere else in SF. It's like being in a trendy Italian farm house with sky lights. I love the open kitchen, the wall paper, the decor. It's beautiful and a great spot for a girls night out or a date night. I also loved our waiter Nathan who was hilarious and very energetic and enthusiastic. \nAs far as the food, the standouts were the pizza--we got the pineapple with fermented onion and while I'm normally very anti pineapple on pizza, this was out of control. The crust was exceptional and it may be the best pizza I've had in SF and I'm usually very loyal to Tony's so that's a big deal. The other standout was the rice ball arancini which was perfectly fried and filled with tomato sauce covered rice and tons of gooey cheese. \n\nWhat we can improve on: \nWe started with the caponata which was good, but I don't need to have it again. We also ordered two pastas--the malfadini and the gnudi. \nThe malfadini totally fell flat for us. It was just lacking a pop of flavor and the pasta was perhaps too al dente. It needed some lemon or garlic or spice to wake it up. I wouldn't order this again. The gnudi itself was good, but again felt like it was missing something and the sauce didn't do much to elevate the dumplings. I think next time I'd try the tagliatelle or the rigatoni which we saw on the table next to us. The cocktails were also disappointing. We each got a different one, the rosemary, basil and coriander. The basil and coriander were not good....at all and at $14 each I had high hopes. I tried all three and would not do any of them again. We switched to a bottle of wine after that (they do have an impressive Italian wine list!) \n\nAt the end, we each spent around $90 for the food and drinks. I think this is why I had a hard time coming up with my rating because I am all for balling out for a great meal, but because we weren't psyched about more than half the meal, it felt really expensive. \n\nI am very excited to come back again and feel that I can do a lot better ordering the next time around! I know it'll be worth it, this restaurant is a gem and I am very excited to give it another try! I hope you take my advice about the pastas in particular--there are definitely standouts to be found on this menu :)", "author": "Sophie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "THE hip spot in SF at the moment. Unfortunately, a lot of show without much substance is what I took away from our dinner.\n\nDecor is fantastic 5/5.\nFood is barely above average 3/5.\nService is okay. However hosts are incompetent(more on this later). \n\nWe got the pineapple pizza everyone raves about. It was good but nothing ground breaking. A solid 3.5/5\n\nThe papardelle ragu(IIRC) was again good and earthy(small serving size btw) but nothing you can't get for half the price at spots across SF. 3/5 \n\nWe had an avg eggplant spread app too, which for some odd reason is not served with any bread. Just imagine serving babaghanoush with no bread, what the hell!?  We asked the waiter for bread, she offered foccacia and didn't mention it would cost extra till we got our check. This came across as petty and cheap from the restaurant. \n\nBack to the hosts. This was a wednesday btw. Was crowded but nothing crazy. Their mangement of the two separate walk-in wait lists, one for bar area other for rest, is horrible and uncoordinated. There were 4 parties before us for the bar area and were told our bar spot will be open \"soon\". We also put name on the other wait list and were told that would be at least 2 hrs. After waiting more than 1 hr, right in front of the host mind you, and also checking multiple times with the bar wait-list manager(who was doubling as a bus-boy) we realized they had no coordination between the lists. \n\nThe host with the non-bar area wait list had spots open in less than an hour and didn't bother notifying us whereas the bar area wait-list  guy kept on saying \"soon\" since minute 1, and now it was 1.15 hrs. Eventually we got offered to sit in the non-bar area communal table, which had been open for past 30 mins. So goes without saying this left a bad taste in our mouth. \nDO one list, and offer seats based on availability. Its super basic. \n\nSo to summarize, wait extra 1 hr due to uncordinated hosts, get seated at communal table while shelling out $150 for food and drinks, where the food is barely above average. No bueno. They have had some good press due to contacts, but will most likely fizzle out, like many others have in SF, unless they step up. \n\nP. S-they have some decent cocktails(get the pineapple one), and we also got to see a Hollywood A-lister, which bumps the score by 0.5 :p", "author": "DJ R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-12", "description": "Not good enough service or food to warrant the hype. Fun scene. Lively. Staff is roped. Food is basic.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-31", "description": "After hunting for reservation for several weeks, we finally scored a reservation for a Friday evening. We were quite excited since we heard a lot of good things about this place. We got a couple of appetizers (beef tongue, duck liver), a tagliatelle pasta, a pizza, and a couple desserts (they rotate their menu items so some items may no longer be available). The appetizers were good but was very heavy on either lime or vinegar sauces, as they were all quite sour. The pasta was probably the best dish  (a tagliatelle with ragu sauce). The pasta was pretty perfectly cooked. The pizza, which they're most well-known for, was probably the worst part of the meal. I know they're known for the \"charred\" crust, but I personally do not enjoy the char taste, which was pretty prominent. The pizza itself was way too salty, and I wasn't able to eat more than one slice. I had the peach cobbler type dessert that came with ice cream, which was quite sour for a dessert. Overall, the meal was quite underwhelming, and the dishes overpriced. Not sure if we would visit again.", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "An All Star team of chefs comes together in one megaopolis of a restaurant claiming to take Italian food in San Francisco to the next level. What could possibly go wrong? In this case not much if anything. I compare this restaurant to the current trend in the NBA of putting super teams together.  Typically in the history of this happening it takes about a season or two before they can come together.  Or you can be the Warriors and just add a head coach that lets his team do what they're best at and watch them waltz into the finals.  This is essentially what David Nayfeld have done.  As great as their food is here both in flavors, beauty, and texture the restaurant itself has a personality all on it's own and if we're going to use basketball references here they have truly built their Chase Center.  Aside from the fun and giant lit ups Che Fico sign the outside telling you that you've arrived the look is that of an insurance agents office from the 80's.  Till you open the door and look up the staircase and realize you're in for so much more.  I compared the experience of entering very similar to how I felt when I entered Smuggler's Cove the first time (if you haven't been there you should). Immediate surprise and delight as  you get to the top of the stairs and are greeted warmly by their hosts. The moment you glance into the dining room you know that you're in for more than just spaghetti and meatballs. You've arrived at an oasis of food in the middle of San Francisco. \n\nI've vowed to myself as a reviewer that it's not fair to tell you how much I love the taste of the food I've eaten because the truth is as diners we all have different palettes but what I can tell you is if you can't find something you love (and you will) on this menu I'd be hard pressed to believe you have taste buds anymore. The food here is some of the best you can find and the attention to every detail is proven with every bite. If you don't believe me scroll through their Instagram and you'll see the care that is put into every dish.  \n\nIf ambiance and food weren't enough the service will drive you over the top. In my first visit here I was tucked in the back corner near the bar because I was silly and didn't make reservations. The difficulty in getting to us on a busy night was tricky to say the least but our server never missed a beat the entire evening. I've had far less service with far less for a server to deal with in my dining years so needless to say my friend and I were impressed. In another outing we sat right at the bar and the staff was as sharp as they could be having to balance making drinks and serving guests. Oh which reminds me the cocktail menu is fantastic here. Great balance of flavors and assorted enough so you can find that cocktail to pair well with anything you might order. \n\nI've been pretty strict about adding anything to my regular dining rotation because frankly I hate thinking what I could be missing at one of them but it was not a difficult decision to have added Che Fico as one of my favorite dining destinations in San Francisco and look forward to many many more returns.", "author": "Joco F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "Mixed emotions on this one but the negatives outweigh the positives.  Things started off great as we were seated upon arrival (we had reservations), those without were being told it was a 2 hour wait.  Our table was a two top but separated by a 2 inch gap from our neighboring table.  I joked with those seated next to us that we are now a table of 4.  We scooted the table over an inch or two so conversation was a bit more private and elbows weren't bumped.\n\nThe server came by to warn us there is a $30 corkage fee as we brought our own wine.  I use the word warn because it was unfriendly and nearly challenging us to change our mind about opening our wine.  The bottle was whisked away and 15 minutes later the sommelier came back with the bottle, not a word was spoken aside from \"Who will try?\"  Honestly, not another word.  By the way, it is common courtesy to respond when someone says Thank You.  Maybe the somm was having a bad day???\n\nNext we order and that will be the LAST time we see our server.  She never returned to check on our food, replace silverware, refill wine/water.  Service was a complete failure!!!  \n\nCoursing and timing of dishes is a basic skill for a full-service restaurant.  Our appetizer (chopped liver) arrived quickly and it was delicious.  Dish cleared and my wife's pasta arrives and I await the arrival of my pasta dish.  And wait, and wait.  My wife eats her entire pasta course and our server is never within view to ask about my portion of this course.  Pasta dish cleared and I'm certain they have forgotten my pasta dish but then it arrives...30 minutes after my wife's.  Within seconds 2 pizzas are delivered and there isn't enough room on the table so I'm holding my pasta dish while trying to finish it off to make room.\n\nOh wait, there she is...our server.  \"Do you want dessert?\"  That was it!  Never asked how our meal was, no apology for sorry I haven't returned in over an hour.  No thanks, we'll take the check.\n\nI say mixed emotions because the food was excellent but the service was negative 5 stars which ruined our first and likely last Che Fico experience.  I truly hope they can solve their service issues because the food is worthy of the hype.", "author": "Brendan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "My son pulled some strings with friends to get us a reservation for my birthday.  We did have to wait sometime for a table, but otherwise it was a delightful evening.  We started with the non--alcoholic grape juice/ cucumber cocktail.  It was very refreshing and not sweet.   Three of us shared the chopped salad, and the bread with lemon and cheese, The Ode to Judy Rogers pizza, and the cavatelli pasta with broccoli rabe and sausage.  Everything was very tasteful and fresh, and the servers were very attentive.", "author": "Becca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "I had the pleasure of dinning at Che Fico with my husband on our babymoon and it was the highlight of our trip up the coast.  I had the most delicious mocktail, it was a celery drink and I have no idea how but it was the best mocktail I have ever had.  The Squash Blossoms were heavenly and had just the right amount of crunch paired with the creamy ricotta.  The Eggplant Mezaluna was the perfect pasta dish.  It was sweet, full of vegetables and did not feel heavy.  The Judy Rodgers pizza was so unique and the pairing of the sourdough bread with the fresh ricotta and toasted crust was divine. I loved how all the food felt clean, fresh off the farm, full of flavor and not heavy.  I can't wait to dine here again.", "author": "Tamra W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-26", "description": "Service was unaccommodating and rushed - they wanted to seat other parties and were in a hurry to clear plates. The food wasn't great and was basically soaked in oil and salt.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "Came opening weekend after months of waiting - waited in line for 30 mins (came at 5p on Friday) and got seated right away with no reservation. The space is lovely and there is lots of seating for large parties which is a great find in SF. The food however didn't really impress us. We ordered BIG since we didn't know if we'd be coming back - we started with the CACIOCAVALO (the only really good dish of the night), the cheese pie (lacking seasoning and just nothing to write home about), the RIGATONI AMATRICIANA (definitely not traditional, more fusion), the TAGLIATELLE AL RAGU (v greasy) and finished it all off with the WOOD FIRED CITRUS CROSTATA (fruit was super tart, the gelato was the best part). All in all, it's a new place with some kinks to work out but based on the food alone, I'd rather spend my money on really good italian at  Cotogna or Nob Hill Cafe. I urge others to go and try for themselves, after all this is just one woman's opinion.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "This place is dynamite! I don't often write reviews but I woke up this morning thinking about my dinner last night so I guess I owe it to them to write a review. I almost don't want to in order not to facilitate spreading the word about this place... but it's too late.\n\nThis is some of the most interesting and delicious food I've had anywhere. Well worth planning ahead for. Also, nice to see more places in SF that are lively late at night (was packed from 10-midnight).\n\nService was comically bad: I think our server was high, but it added an element of entertainment to the meal. \n\nThe menu is also confusingly/poorly written. Eg, all the pizzas have marinara sauce (or so we were told the aforementioned stoned server) but marinara sauce is explicitly listed as an ingredient on only one pie... why? There is also an asterisk indicating which dishes use locally sourced ingredients, and that asterisk was only used to highlight one dish, which our (again, maybe stoned) server told us used ingredients sourced from Italy. Hmmm.\n\nBut on the important stuff (food, atmosphere): A+", "author": "Anish V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "I feel like their pizzas may be the best pizzas in San Francisco with their super crunch crust and perfectly done toppings. Typically not a fan of pineapple on my pizza but we tried it here and it was absolutely amazing. We also did their suupli which is essentially arancini (Roman Jewish style), their pasta with the ragu. While the pasta was done well and it was flavorful I felt it's far too pricy for $24 with the amount of meat on it. \n\nTheir cocktail list is not super exciting but it's not bad. Their wine list is decent. I would go back again for their food over everything else.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Came here with a couple of my friendsa few weeks ago. We had a reservation on a Friday night. They sat us down on time and the service throughout the night was awesome! Very attentive and swift. We ordered 4-5 apps and 4 entrees (1 each so we could all share our food) and 1 desert. It was so amazing and yummy. HIGHLY RECOMMEND. Just make sure you get a ressie. :) not sure how the wait would be otherwise", "author": "McKenzie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Great place a great atmosphere.  Music can create such a great environment (most restaurants dont realize it)  This restaurant is the hippest new place to dine at in SF.  It was loud inside but that's because the place was jam packed with patrons.\n\nFood was fantastic.  I ordered the Tagliatelle (house made).  It was delicious.  I will go back and have it again and again.  I will say that the pizza that my neighbors ordered looked and smelled great.  That will be next on my list when I go back.  The chefs at Che Fico (David Nayfeld, Angela Pinkerton, and Matt Brewer)  nailed the menu.  Whatever the chicken my neighbor ordered looked like something from a magazine....\n\nChris Longoria has done it again in my opinion creating a cocktail menu that ups the game in mixology.  Just watching him create the beverages I ordered was like watching a chef in a kitchen.  I drank the Rosemary and the Tyhme cocktails.  Masterpieces  in my opinion.  I will be back for more and cant wait to see what's on the horizon for \"Che Fico\"\n\nI dont post much ever but felt like this place deserved it.  I never liked Yelp by the way...", "author": "Osamah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I went to Che Fico with a friend. She had been before and loved it and it was my first time. We didn't have reservations and knew it would be a bit of a wait so we put our name down and got a drink at the bar. The bar has a great vibe and was really busy the entire time we were there. We were seated at the communal table which was great because we could see what dishes other people were ordering. We started with the Supplì which is a rice ball. Delicious! We also had the octopus salad, which was also tasty. We had a pasta and pizza as our main dish and saved room for dessert, olive oil cake and blueberry pavlova. The food is flavorful and presented well. What I really liked was the service. Every person we came across was friendly and helpful. I loved everything about this restaurant and can't wait to go back.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-27", "description": "Given all the rave reviews and celebrity coverage, we were SO excited to have dinner at Che Fico. Perhaps our expectations were outsized, but we were pretty disappointed. \n\nFirst the good news. The vibe in the restaurant is great and all the servers were fantastic. The drinks beforehand were very good, especially the \"Pepper\". The duck liver appetizer was to die for, as were the two desserts we had, the Olive Cake and the Pistachio gelato.\n\nRE: the main course, a few things. It was off putting to have the appetizer, pizza and pasta dish all delivered at the same time...it would have made so much more sense to deliver one plate at a time. The pineapple, fermented chili pizza sounded good but was meh at best...have had so many better pizzas elsewhere. And the much raved burned crust wasn't anything special. The green garlic agnolloti was both under cooked and had no taste to it. A huge disappointment.\n\nAn OK experience, but no plans to return.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-24", "description": "Ho hum. The food was tasty but the inattentive service and generally poor attitude of the three people I interacted with left a bitter aftertaste. I crossed referenced this experience with two other recent diners and confirm it's a trend.", "author": "Jan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "This restaurant is absolutely hands down one of the best culinary experiences that I've ever had in my life!!! It's a must try for anyone! Some of our favorites were the pizza, the chicken, gazpacho, and the cold cuts were so good!  The restaurant itself has a super cool vibe and is super modern. We've been here 4 times now and we will keep going back because every time we come we are amazed!  Check it out, your taste buds will thank\nthank you!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Simply the best experience overall. We will keep coming back to this gem of a restaurant for the years to come. Everything from Service to the food was just the best. Make sure to make a reservation as this place gets very packed, and understandably so.", "author": "Sinisha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-03", "description": "If I could give half stars, this place would rate a 2.5 because it's in between \"Meh. I've experienced better\" and \"A-OK.\" How that translates is that while I wouldn't choose to come back here if I were picking restaurants, I wouldn't be entirely opposed if someone else wants to come. None of the dishes were bad but they also weren't memorable. Considering the price of $$$, I expect at least couple of dishes to be \"wows.\" Yes they are novel to our palate but novel does not equal delicious. I appreciated our server's attentiveness throughout the meal. She noticed I was the only one not drinking wine and so asked if I wanted a non-alcoholic grape drink. When she saw that I didn't touch most of it because I didn't like the taste, she took it off our tab. Make sure to give yourself at least 15 minutes to find parking; it's hit-or-miss.", "author": "Gwen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "High points- beautiful space, very lively, beautiful crowd, amazing list of Italian wines at a variety of price points, fun 80s soundtrack. yummy nectarines sprinkled with pepper with the check.   Yummy pizza tribute to Judy Rodgers, pasta with mushrooms and Fava beans, amazing pistachio gelato. \n\nSo so points - family style service supposedly. But not a serving utensil to be seen. Pizza cut into huge quarters with no knife or spatula - impossible to cut with dinner knife. Pasta to share with no spoon. Gamey $14 Beef tongue on a slab in a Heath bowl, not the thinly sliced meat per the SF Chronicle review photo. Should have been on a wooden cutting board. - you can't cut with a steak knife into a bowl!  Half went uneaten but no questions asked by server. Skip it. Summer salad with watermelon and avocado in a gazpacho sauce in a bowl. Delicious but poor delivery.  Served with salad plates, no spoons. Should have been served in separate bowls with spoons and bread to lap up the yummy gazpacho.  Staff didn't  change the plates between courses until we asked. \n\nLow points - extremely loud. $14 for berry pavlova heavy on crust, low on berries. Basically a small piece of pie - we felt ripped off. Almost $200 for 2. Wont be back until someone tells us the service has improved.", "author": "Hayley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "David Nayfeld hits it out of the park with his new restaurant Che Fico. Rustic Italian fare with Jewish influences shines with every plate. Restaurant space is bright and airy with multiple seating arrangements from communal tables to booths. The bar area has plenty of seating allowing diners to have a quick casual meal with their drink. The pizza is a true standout. It is truly a unique signature dish with its sourdough blackened crust topped with a heavy dose of Parmesan cheese. You can't miss the walk-in glass fridge in the center of the restaurant proudly displaying all the charcuterie goodies slowly waiting their perfect time to be served at your table. \nAfter working in one of world's best restaurants Eleven Madison Park in New York, David Nayfeld's touch of perfection is evident with every plate. You simply can't go wrong with any dish. Some of the menu items change with season and availability of freshest ingredients. On our first visit the veal tartar was a star appetizer, but it was not available on our next trip to the restaurant. Hopefully we'll get to try it again on our next visit. The bar service was also top notch with servers being able to take your order in the bar area. This allowed our bartender to focus on perfecting our next cocktail.     \nClearly San Francisco diners who are always hungry for the next best restaurant are keeping them busy. The place was packed on both Fridays when we were there up until Midnight. Che Fico is certainly a great addition to the neighborhood. All the neighbors definitely appreciate a great local place you can come by and count on consistently having a great meal. David Nayfeld, welcome back to San Francisco and thank you to Che Fico Team for a great dining experience. We look forward to our next time.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "Loved the supplí, ceci + pomodoro stew, gnudi, and pizza (for whatever reason the pizza tastes better after you let it sit).  Pepper was the best on the cocktail list.  The olive oil cake is divine.  Bright skylights provide great lighting.  Excellent service.  Wish there was bread to help savor the remaining sauce in our dishes.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "Wow - this has by far been the most disappointing meal that I've had in San Francisco - partly because of the hype that this place has created across the city. Additionally, the earlier review about the extremely poor hygiene is clearly accurate because I had a severe tummy upset after eating here. We got the goat cheese triangolinis (8 pieces of pasta for $23 in an overly lemony cream sauce with pine nuts), the fried cheese (this was so gross - extremely oily and had no flavor whatsoever except for oil), and the pineapple pizza (best thing we got but it was still pretty average... definitely had better pizza elsewhere). The presentation was incredible though - as was the space (it's huge with high ceilings and lots of natural light). An antipasti, pasta, pizza and 3 cocktails later the bill was a whopping $170 (after an 18% tip). Overall, extremely disappointed in the quality of food, lazy service and the apparent poor hygiene of this place. Do yourself a favor and don't stand in this particular line....", "author": "Sam M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-16", "description": "Overpriced for mediocre food. It's the hot spot and fell short by a lot. The manager of the establishment unfortunately was pretentious with no value for money -- so many people starve and yet he was flippant saying \"most parties don't make a big deal of $75\" -- they overcharged us and were snobby about us asking to have the billed corrected... not cool. Fix your attitude Michael.", "author": "Shivani S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-28", "description": "Wanted to love this place but unfortunately it fell short. The service was sooo slow. It took us 2.5 hours to eat dinner which consisted of a pretty good salad, good pizza, and decent pastas. Over all I don't think we will be back. Everything was mediocre and the service was no where near where it should be. Save yourself the time and go to Mano.", "author": "Brittney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "Wow this place was delicious. We got there a few minutes before opening and there was a line, but once they opened we were able to get in. \n\nCocktails: the cocktails were amazing. Really interesting combinations. Not to sweet. I really didn't know what half the ingredients were in the drinks but both I tried were amazing. \n\nWine: the wine list is great. Really reasonably priced good Italian wines. \n\nFood: the food was really really good. Very unique combinations of foods. The duck chopped liver and the seafood black pasta were incredible. Also, do yourself a favor and get the focaccia. The crostata for two was an amazing desert. The perfect amount of flaky and sweet with a creamy salty ice cream on top. Perfect way to end the meal.\n\nWill definitely be back.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "I've never felt so disrespected in my life. I come to the bar area and one of the bus boys/servers gives me attitude to move out of his way, and tells me to do so, because he has his hands full with dirty plates - which is OK - but everyone is around the bar - so is that how you treat your customers? Then, I'm standing over an empty area where there are two empty seats, and the bartender tells me to go to the other side because we can only order drinks from one area - it's a BAR top!!! You should be able to order drinks from anywhere!! First time I came here I had a nice experience because of the food, but both times the service has been straight trash. I cannot believe the way I got treated. I'm truly stunned. It's a Thursday night, busy, but no excuse to be treated this way. You go to a restaurant not just for the food but for the service, and I am speechless in the most negative way possible.", "author": "Sahra A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "This place is outstanding! Been there a few times now. Amazing service and food. Pro tip: come at 5:15pm and only wait 15 minutes for a table. Also they have tables almost every night after 9:30pm. I will be back a lot.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "You know that feeling when something's been hyped so much that when you start to experience something short of what you imagined, you start to question yourself?  That's what happened to me when I dined at Che Fico last night.  My overall opinion was ... really?  Sometimes I think we can continue supporting a restaurant not necessarily because of what we experience there, but more so because of what we've imagined we SHOULD be experiencing.\n\nOur observation was that even though all of the staff was working incredibly hard, the service was very slow. Too add, some of the prices are way out of whack.  I'm not afraid to pay for high quality ingredients and excellent service, but I'm not sure we had either.  $15 starter for a piece of bread with (good) melted cheese and olive oil -- decent, but should have been 2 slices for the price.  The $24 portion of pasta bolognese was SMALL and the amount of sauce LACKING.  Rotisserie chicken was good and that was probably the best value of what we ordered $29.  Desserts were ok, but dainty and overpriced. \n\nI think this place has potential, but it hasn't been realized yet.  I won't be back, nothing wowed me enough to return.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "Very cool space and beautiful decor. Service was attentive and fast and we enjoyed the wine list. We had a mushroom/sausage/ Calabrian chili pizza and added arugula. It was AMAZING in every sense of the word. The deep fried arborrio rice left something to be desired. Was hoping for more cheese than tomato sauce on the inside.", "author": "Krystyna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "This place was great! Two of our friends had a reservation here, and the four of us decided to get a table there as well. The staff was fantastic and merged the two tables together when the four of us arrived. The food was amazing, the staff was attentive and enthusiastic. The staff even put a name tag on my jacket when they hung it up. The ambiance and the decor are wonderful too! I think I am still full from my meal last night!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-26", "description": "Had high hopes after reading the reviews.  Sadly the food, service, and ambiance was lacking.  We had 9pm reservations and waited for 25 min for our table.  No updates while we waited, no offer for a beverage (paid or complimentary).  \n\nThe music was way too loud and over the course of a 2hr meal fluctuated between gangster rap, new age, classic rock, and punk.  Huh?  I like a variety of music but Queen Bohemian Rhapsody nor Outkast fit the mood of the place.  \n\nThe food itself was OK.  Chopped salad and octopus appetizers were good, pizza with sausage and mushroom  and the orecchiette and agnolotti were under seasoned and needed salt.  The pork was a bit over cooked and took more than 30 min after our previous course.   \n\nLastly the service was mediocre and inattentive.\nAfter the pork they cleared our plates and we were waiting for our last dish for another 20min before we finally asked, only to learn the server never placed the order.  Not sure what they were waiting for since no one bothered to come and ask if we wanted dessert.  \n\nLots of promise poor execution.", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Amazing service and food. If I were going to say anything negative, it's very loud and we were shouting at each other. \nThe waiter- exemplary! Jerry (Gerry?) explained that it was family style so we each ordered something. He was attentive, and knowledgeable, and very nice. \nThe pepper- amazing! Served up with a pretty pink pepper sprig.\nThe octopus with pork belly- OMG. I love octopus, but it's difficult to find it done well. I loved the texture, soft but still with a little attitude. I hate it when it's mush. The textures and blend of flavors worked so well.\nThe lamb dumpling thing with peas- peas right out of the pod! They tasted wonderful like when you're digging into your bag at the farmer's market wonderful. The white sauce was light, the greens were pretty- a great combination of colors, textures and tastes.\nThe sausage pizza- terrific. I guess people complain that it's burnt, but I liked the sausage with a kick. \nThe asparagus- terrific\nThe olive oil cake- yummy\n\nI can't wait to go back.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Every dish was fantastic.  We were the last seating of the night and the food was still perfect and fresh.\n\nThe entire staff has a passion for food and will happily help you decide what suits your tastes.\n\nHighly recommend reserving the high top seating as you will get to sit right in front of the open kitchen and talk to the chefs.  This was one of the best parts of the meal for me as the chef made suggestions on dishes I would have never thought of ordering otherwise.\n\nThe price is also a pleasant surprise.  I would have expected to pay much more (and would have happily paid more given how great the food is).\n\n\nChe Fico is the best addition to Divisadero.  Will be coming back here often.", "author": "Cody C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "So I'm torn - I love the environment, the beautiful decor with high ceilings and skylights, the massive gorgeous florals, and upbeat music. The food left something to be desired however. My favorites were the pineapple pizza and olive oil cake. Both were superbly unique and delicious. The deep fried artichokes, chopped salad, and lamb pasta of the day were just ok. Wouldn't order them again and frankly didn't finish the artichokes because they were so super crunchy from the fryer. My husband, who loves a good cocktail, ordered two drinks and didn't like either one. I'd give Che Fico another try mainly because the space was cool.", "author": "Inna T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-13", "description": "Sorry to give them 2 stars, really was excited to try Che Feco again. \nFood is pretty good, loved the lamb roast and great pizzas. Hair in our lamb pasta, turned us off. Hair on 2nd plate turned us off even more. Service needs much attention, staff bad mouthing customers in the kitchen. You hear everything as you walk to the restroom. So incredibly unprofessional. The managers really need to get their act together if they want this restaurant to succeed. The potential is there but they appear as though they don't really care, no passion. Not once did we observe managers checking in with their diners.", "author": "Mila M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Passionate staff bring delicious contemporary California/Italian food to Divisadero. The food was ridiculously good! Hand made pasta, pizza & so many appetizers! Inventive, flavorful creations like rice balls, fried cheese with toast, roasted meats... all the things! The wine list is predominately Italian wines, and the super knowledgeable wait staff & sommelier helped us pick a winner. Pro tip- save room for dessert! The kitchen is super strong & the desserts are worth a trip on their own! Seasonal, creative, absolutely delightful! The design is fabulous- beautiful, open, & comfortable. Can't wait to go back!", "author": "Carly V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Food is so hyped in SF these days and this was the hottest opening in at  least the last couple years. Hype heaped on top of hype made expectations for the place sky high. So yes, Che Fico was tailor made to disappoint. Except it does not. Not on decor. Not on ambience. And certainly not on the food.\n\nThe food is Italian, with Cal influences. This may sound run of the mill but  there's a bunch of things incorporated into the menu that distinguish it from what you'd find elsewhere. The pizza is \"sf style\" and it's got a beautiful sourdough flavor and just enough volume to give it some heft. \n\nThen there's the Ebraica part of the dinner menu inspired by Chef David's Jewish heritage.. Even for folks who are well-educated in eating regional Italian, this will probably be unlike anything they've encountered. The gizzard dish is one I'm nostalgic about already.\n\nFor dessert, choose anything and be wowed. Angela Pinkerton is the apex when it comes to the last course of a meal. It was true when she helped revive Eleven Madison Park. And it's still true. James Beard's known since 2011.", "author": "hubert h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "One of the best meals I've ever had in SF. Welcoming atmosphere with good customer service (even considering they opened recently). We had the chopped salad, fried rice balls, mushroom sausage pizza, goat cheese gnudi, tagliatelle ragu, and fried lemon preserves with espelette. Fresh seasonal ingredients, out of this world flavors and unique craft cocktails. Definitely check it out the next time you're in SF.", "author": "Sareen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-22", "description": "Been dying to go here because of their much anticipated \"sourdough\" pizza. Which by the way, is common but their marketing it as a new thing.\nAnyway, we checked in at the host stand without a reservation on a Friday night, and we were willing to hang out and wait. The host informed us that the wait will be around 2-3 hours. Ok fine, no big deal, that's the price we pay for coming in on a Friday night without a reservations. \nSo we put our names down and head over to the bar, which is not open seating. We both get 2 really nice glasses of white wine (Arneis and Kerner) Delish! and stand around the bar area as we wait for our table\nAfter an hour, I checked in at the host stand to see where we were on the list. The host informs me that it will be another hour or so but the bar is much quicker. Why were we not informed of this in the first place?! So I put my name down for the BAR Waitlist and waited more. After another 1.5 hours, the Dining Room host (there were 4 hostesses manning the host stand that night) came by to tell us that our table was ready and she then proceeded to seat us at a bar table. Their system does not make sense! Why did I need to put my name down on two waitlist if they were going to seat me in the bar area anyway?! \n\nWe ordered 3 things from the menu \n-Margherita Pizza : the server tells us that the chef cooks the pizza well done/burnt. The pizza did come out burnt! (I understand toasty pizza but this crust was burnt, hard and difficult to eat). The pizza was also mostly crust. Can we get more pizza?!?!\n-Tagliatelle al Ragu: good but for $24, can we get more pasta? it was tiny, I'm not exaggerating. \n-Roasted Cauliflower: needed to be cooked a bit more. I personally enjoy vegetables with a bit of a crunch but this vegetable was not cooked properly. \n\nService was non existent since we were tucked away in the window corner area. We had to ask the bartender to get us more wine since our server disappeared. We didn't get the after dinner fruit because again, we didn't see our server. \nI had high hopes for this place. Restaurant is beautiful but I hope they fix service and their pizza, especially because there are so many restaurants with excellent service and pizza (del Popolo anyone?!?)", "author": "Nikki C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Had an amazing experience. Sat at the bar, ate the octopus salad, fried cheese (BEST), pizza, risotto balls, and doughnut ice cream sandwich. Great service. Delicious food. Amazing drinks. Happy times. Would definitely return.", "author": "Kim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Great bar program, very different tasting and menuvstylr, something unique about this place, kind mix of Italian and Jeweshi good.\nDefinitely will be back for amazing cocktails we other Christopher.", "author": "Paulo F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Came in with my wife on the third day after the restaurant opened. It was crowded and a bit hectic, service was slow, I began to wonder whether we shouldn't have waited until the restaurant had been up and running a bit longer. But then our food started to arrive. Literally every dish was outstanding. Innovative. Delicious. Generous. If this is only the restaurant getting warmed up, I can't imagine where it will go as it gets into gear. Highly recommend. Servers were kind and helpful. The design was perfect and the vibe great. I can't recall the names of the dishes but see pics below. Each course was original, distinctive, and came together perfectly with the whole ensemble.", "author": "Itai D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "The food is excellent, the space is beautiful and the atmosphere is a lot of fun. The suppli is one of my favorite dishes anywhere and the same can be said about the pineapple, red onion and fermented chili pie. Everything I had was top notch and I look forward to exploring the menu further.\n\nThe bar offers an excellent selection of creative cocktails but they also do the classics really, really well. Make sure to save room for desert because the offerings are well worth it.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "The Che Fico serves huge portions and I can't believe how much food people are consuming at one time. No wonder most Americans are overweight. I try to eat healthy, so I always order the Che Fico Chopped Salad. It's delicious and healthy too! It consists of A Delicious Blend of Julienne Romaine, Grilled Chicken, Tomato, Avocado, Corn, Bacon, Blue Cheese and Apple with their Vinaigrette. You can order any type of dressing you like..... I get the balsamic vinaigrette and extra virgin olive oil.", "author": "Macleod R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Had dinner here last night after hearing a lot about this place.  We called and got a last minute 5:30 reservation at the counter. Very lucky because this place is packed every night.  Sitting at the counter is the best seat in the house because it becomes a great dinner and a great show. The seats are right in front of their antipasti section where all of the first courses are being made. These chefs were outstanding. They worked non stop with great care in making everything they put out perfect.  The care they put into every dish was amazing. We complimented them several times and as busy as they were we had fun conversations with them.  Several dishes we saw them make such as their chopped salad and their Octopus salad looked fantastic.  Would probably try one of those next visit.\nOur dinner consisted of the following (my wife and I shared everything).\n1. Started with the summer vegetable Insalata which was a blend of yellow watermelon, heirloom tomatoes, feta, and croutons. It was dressed in a creamy gazpacho that you eat like soup when you finish. Presentation was beautiful and it was delicious and different that a typical salad.\n2. We then each had what they call Suppli which is a fried risotto cone. This was stuffed with cheese and risotto in tomato sauce and fried.  Really good. It seemed like everyone in the restaurant ate these. The waiters wer always bringing out plates of these.\n3. We then shared a pasta and pizza.  The pasta was their smoked paprika strascinati which is a thick chewy pasta with lamb ragu.  The ragu was filled with lamb and was delicious. Pasta was fresh, and a type of pasta that we really enjoyed.\n4. The pizza was with sun gold tomato, mozzarella, basil, and another cheese whose name is hard to remember. Their pizzas have a burnt crust at the end but it doesn't taste burnt.  We both liked the crusts and the ingredients were excellent. We took portions of both the pasta and pizza home. Chefs behind the counter tried to convince us to try one of the desserts but we were stuffed. One of the chefs brought over a cup of pistachio ice cream that was really good.   Great dinner and show and we will be back.", "author": "Wayne E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-15", "description": "20 bucks for a 12-inch pizza with crust that's three inches wide, hard as a rock, and burnt black all the way through. I wasn't feeling a Kingsford briquet for dinner that night... Inedible and no refund or exchange offered. \"That's how it's supposed to be.\" No.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "The best experience I've had for dinner in a long time. From the minute you walk in to the time you leave, you feel like you're in some sort of escape from the real world. The ambience to the service to the way you're served, everything is a pleasant surprise. Would love to go back more often but it took weeks to get reservations at a decent time. Btw, we were early and seated immediately. All in all a wonderful time and super addition to the divisidero lineup. I actually felt like clapping at the end of the meal! And we're vegetarians so half the items were a no for us.  Try it out, you won't be disappointed.", "author": "Yodlee Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "Super disappointed with this place.  I was really looking forward to trying this place from all the reviews. We ordered the Margherita pizza and it came out super burnt. After eating a couple of\nbites my throat was irritated. I told the Manager Emily and she responded very rudely and told me that the pizzas are made that way. She didn't even offer to make a new pizza and request the pizza to be cooked less burnt on the crust. She shouldn't be a manager if she lacks simple people skills. \nAmy the waitress on the other hand was very friendly and apologetic and took the pizza off the bill. However I won't be coming back if they continue to over cook the pizza crust.", "author": "J C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "visiting sf on brief business trip, made the wrong choice for dinner. probably fell for the hype surrounding the chefs pedigree. sounded like a solid concept, not trying too hard, not reaching to far... still, it came up a bit short. now, details...\n\n\"coppa sando\" a sad little thing, reminded me of the sandwich I had at amora cafe inside SFO...\n\nthe corned veal tongue was generic as hell and just plain nasty with the texture of cat food, much better tongue preparations out there... \n\nthe pasta was ok. Tosca has a smaller menu, but far exceeds in execution. actually there are like 6 places in a mile of here serving great pasta, this place not so much.\n\nthe sweet potato thing demonstrated a severe lack of understanding in regards to vegetables. not sure where the \"chef\" got their culinary diploma, but they deserve a refund... so do I actually....\n\nstar 2 is awarded for the best thing I tried: the fruit tart, holy moly! wow them in the end right?? execution beyond words, I will try... simplicity, focus, restraint, balance, harmony of acidity, texture and temperature... utterly on the level... ultimately what I had hoped for in the rest of the menu. oh well!\n\nActually, it was way too expensive I need to retract the second star even though the pastry was fucking good. just go for the sweets, you'll feel better about it afterwards!", "author": "Mother F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "Overall good, but I'm not sure I will return anytime soon due to minor gripes with the ambiance and pizza. \n\nAmbiance: Loved the decor and high ceilings, but it was very bright for dinner which made it have an office cafeteria vibe given how large and open it was.\n\nService: Attentive, but would have been nice if server told us at the beginning which items were not available.  Drinks had already been served and we were not informed until we were about to order food.  Of course one of the dishes we planned on getting was unavailable.\n\nFood: We enjoyed the the cappelletti pasta and the succotash side.  Fried artichokes were ok.  The biggest disappointment was the pizza.  The house made pepperoni was delicious, however we really didn't like the charred crust.  I realize this is intentional as all the pizzas coming out of the kitchen looked this way, but does anyone enjoy eating burned bread?", "author": "Kristina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Make sure to try the chopped liver, octopus and pork belly, and tortelleni en brodo. Amazing food, delicious drinks, and great ambiance. Leave room for dessert.", "author": "Arthur S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "He wait to go to this restaurant was worth it. The menu is innovative and surprising. The portions were reasonable, which I like. The pizza was gorgeous and delicious. The chicken entrée was fabulous, which is unusual because it is hard to make chicken stand out. We got all of the appetizers for the table. The rice balls were spectacular. The duck chopped liver was amazing as well.The service was top-notch and so were the cocktails. Can't wait to go back!", "author": "Linda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Trust Anderson Cooper it is worth the hype!  Beautiful contemporary restaurant with high ceiling - made me feel like I am in LA somehow. Food was all delish, super crowded, bar seats available first come first serve, but reservation usually available when you try 30 days in advance.  Second time here, many more to come.  The vibe is just awesome.  Excellent cocktail program.  The pizza has the slight burnt crust which had great texture.  Even the garden vegetables (the squash) was delish.", "author": "Edmond T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-31", "description": "I think this restaurant has potential but it missed the mark for us..I'm willing to bet it's because we went they first opened, plus I'd like to go back to try the pizza.\n\nThe space is definitely cool - beautiful and colorful tile and wall paper, exposed wood ceilings, open space. It's quite loud and echoey since it has high ceilings and concrete walls.\n\nThe food was very underwhelming overall.\n\nGood: Corned veal tongue - the meat had a great texture and the salsa verde was funky, briney, salty and bright. This was the best thing we ordered. \n\nOk: Duck liver - the flavor of this was good but it was very wet which we found kind of off putting.\n\nBad:\nCavatelli - sorry but this was not good. The pasta was gummy, and the sauce and veggies were inedibly bitter, not to mention over cooked and under seasoned. Also don't list broccoli on the menu and then serve broccoli rabe...such entirely different vegetables/flavor profiles.I really disliked this dish.\n\nMafaldini: the past on this was pretty good, and cooked Al dente. But the fava Bean pesto was thin and flavorless, I'm not sure they actually added the hazlenuts...if they were there they were lost, I didnt get their flavor or crunch/texture, the lemon was sour in an unpleasant and bitter way, and the whole thing was under seasoned...I actually think this dish would've likely been significantly improved by salt...if we could've gotten some.\n\nOur server was very nice and super friendly but absent - it's ok, the place was very busy, and they're new.\n\nThis may seem silly but both the wine by the glass, and beer menus were weird and random and lacked a point of view. The music was similarly weird and random and sounded like someone put Spotify or some other service on random/shuffle in a bad way.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Amazing menu. The food is pricey, but worth every penny. Staff is courteous/attentive to a bourgeoning fanbase. Having this new spot around the corner is a godsend. All in all, a great experience that's lived up to the buzz!\n\nDon't miss the Tagliatelle Al Ragu and the Margarita Pizza :)", "author": "Kayleigh C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "This place is a must if visiting or living in San Francisco.  The Italian food, service and ambiance meet a 5 star review.  The food was delicious, the service was outstanding and I can't say enough good things about this restaurant.  There are few places that meet and surpass a patrons expectations but Che Fico on all levels is one of them.  You eat here and you're like \"Why can't all restaurants get it right like this place\",  They make it look easy.  Well done Chefs, well done!!!!! 5 STAR!!!!!!!", "author": "R. Allan F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-13", "description": "Food was good, not great, but their service is why I'm giving them 2 stars.  Maybe they just don't have their flow down yet because it's a new restaurant but there were long periods when we couldn't get water or get our chicken boxed up to go.  After we ordered dessert and paid, they didn't bring back our leftovers and it slipped our mind to ask for it.  Most restaurants just don't need to be reminded.", "author": "Doran I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Great pastas, appetizers and drinks. The place looks awesome, nice music and vibe. One of the few places you can dine after 10pm.\nFriendly staff", "author": "Annie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-23", "description": "My husband an I stayed up until midnight (no small feat as the parents of a toddler!) to get reservations at the \"hottest\" new restaurant in town, and I can honestly say I was underwhelmed. We showed up a few minutes before our 7:30 reservations and waited 30 minutes to be seated. Not to pull the pregnancy card, but as getting a drink at the bar wasn't an option, the 30 minutes spent hungry, on my feet and being shoved around by patrons in the bar area wasn't the way I wanted to start my Che Fico experience. Once we were seated out wait staff was attentive and the food came out at a nice cadence. The triangoli was delicious and I would have definitely eaten a whole serving of that, but otherwise I was unimpressed by the food. At the table we shared a few of the salads, the arancini, the fried artichoke, lamb and chicken (TBH I regret not ordering a pizza). I am not a fan of lamb, but my dinner company did say the lamb was quite delicious, I can't speak on it personally. I found the chicken to be just OK, definitely nothing I will crave or think about again. When it came time for dessert they were out of the 2 menu items we wanted, another disappointment.\n\nThe atmosphere at Che Fico is very hip and loud, I felt like I was shouting for the 2 hour meal. I did enjoy the funky decor and it looked like they had some nice cocktails on the menu. I may give Che Fico another try once the hype dies down and I can actually enjoy an adult beverage, but until then I'll stick with Little Star next door.", "author": "Veronica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "I liked the many options for veggies here. The crispy artichokes were delicious with the lemon aioli, summer squash, and the two pastas we had were also winners. They allow you to get half portions of their pastas which gives one the option of trying more varieties. Despite being slathered in oil and butter, the pastas actually tasted less heavy than I would have expected. Not a huge fan of the olive oil cake, but the elderberry gelato that it came with was delectable.\n\n I was expecting terrible service based on some of the recent reviews, but actually felt very well attended. Someone would always come by to refill our water, even though we had a bottle of self serve sparkling water at the table. Despite being very full, we were never rushed to leave. Only complaint is the lack of coffee bar to have after dinner espresso drinks to go with the dessert. All around a pleasant experience though.", "author": "N c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Couldn't resist coming here after seeing a few articles leading up to the opening. Made reservations for my wife's birthday. The ambiance is great and the food is excellent. \n\nThe menu has lots of appetizers and small plates, pizza, pasta, and large secondi courses for sharing. When I go back, I'll be ordering the lamb leg for two. \n\nWe shared everything - two arancini to start, small chopped salad, margherita pizza, squid ink pasta, and half a roast chicken with broccoli on the side. \n\nOur favorites were the pizza and the broccoli. Both came from the wood burning oven, which gave a perfect charred flavor. The pizza has a great chewy crust that has some sourdough in it. \n\nThe pasta was delicious, and the house made noodles had a great chew. Chicken was solid, but has a spicy sweet glaze, which I wasn't expecting from the menu (I guess ingredients I didn't recognize). \n\nFinally, I had the bergamot aperitif and we each had a few glasses of wine. The aperitif was what you want at an Italian place - just the right balance between sweet and bitter. The wine selection is short and to the point. Very targeted Italian wines with a good spread of different regions, and enough Californians thrown in to keep people comfortable. \n\nThis place is a great addition to the neighborhood, and I'm sure we will be back soon.", "author": "Allan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Love Che Fico. Great service, and even better food. Only downside is how difficult it is to get a reservation lol.", "author": "E T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "When the hype dies down (always does) what will be left is a condescending staff who doesn't understand why it's so slow lately. Good luck with your shitty attitudes and lack of customer focus.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Stumbled upon this restaurant on yelp and wondered why i haven't ate here yet! The restaurant was packed so i knew i wanted to try it out as the hostess told me they only opened a week ago! Needless to say my friend said we stumbled upon a hidden gem as we had the best meal and the atmosphere was amazing. The next day she tagged me in an Instagram that Anderson Cooper had posted the pizza we had the night after us! This hidden gem is no longer hidden! But great service, food & atmosphere.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Solid spot! Virtually impossible to get a reservation before 9:30, so we braved the walk-in wait on a Tuesday. We put our name on the restaurant and bar waitlists, grabbed a cocktail for the wait, and were seated at the communal table within 45 minutes. Space is gorgeous - get there before dark to enjoy the golden hour light hitting the rustic/trendy space (so 'grammable)! Enjoyed the suppli, burrata, two pasta dishes, and pineapple pizza. Definitely too much food for two people but we ate it all anyway - was stuffed for two days, so you can get away with ordering less food than we did. Communal table was a nice experience. As always, if it is good enough for Gwenyth Paltrow (and Anderson Cooper) it is good enough for me!", "author": "Candise L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "It was good but not in a rush to go back. Waited 30-40 minutes after reservation time to get seated. Very loud. Appetizers were fantastic but the pasta and pizza, while tasty, weren't stand out from other great places in SF. Seemed a little heavy on vinegar to  brighten the dishes. Courses all came out all in a rush so our mains didn't stay hot. Transferred our tab from the bar but forgot to give us our credit card with it. With some improvements to service would easily be four stars.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Che Fico is an excellent restaurant, great food, and a spirit-filled staff.  My meaning is that when the persons are wonderful and the food tastes good, it all goes down great.  I'v been to many restaurants in this country and out of the country.  Che Fico compares to what I experienced in a restaurant in France some 20 years ago.  It almost bright tears to my eyes, because I was with the love of my life at the time.  No, we never married, but it was a warm and fuzzy feeling with fond memories all wrapped up in my food and drinks.", "author": "Portia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Great atmosphere and delicious food. Wish the entree sizes could be bigger for the price but this is not the only restaurant like this.  Definitely recommend making reservations.", "author": "Jinny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Freaking delicious. Came on a random Tuesday night at 930pm. Got a seat at the bar. Had an amazing meal by myself, and made a new friend.  That's the beauty of San Francisco. I love Che Fico already :) I still can't believe this was the old auto body shop. What a turnaround the space has made. Oh yeah, and the drinks are all freakin amazing.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Went for 10pm reservation on a Thursday and it's a full house. Bring more of that energy from the east, DN. Beautiful space. Service needs a lot of work. Please train your servers on your POS. Had to run credit cards three times at the table beside me for add/refund/adjust because of bar bill. Advice: stop transferring bar bills to simplify the handoff. Hostess was relatively overwhelmed but polite. Amazing music (cranberries, system, primus) and good flavor balancing in dishes. Pizzas take 45' so order the supplí and salads to start. Rigatoni was meh and came out cold, ragu could have used extra layers of flavor to make it more home style. The wine pours are say below standard and inconsistent across bartenders here (beers are in very small glasses, varying 3-4oz pours of wine), but they have a full bar. If you have a hot date or want some amazing Jewish-Italian inspired dishes head over to Che Fico. Honest 3.5 experience but will likely rise once they get their footing and up train staff. Bravo!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "The service was on point and friendly and above par forsure. We didn't have reservations but came when they opened to put ourselves on a waitlist. Great spot with different choices that satisfied my palate.  They are pretty great with the timing and service. The chopped salad was not an average salad there was  a lot of thought into what went in there. The cheese was great and surprised me a little to know that they put pieces of salami in it. Great addition. The buratta cheese was very creamy and randomly paired well with the cheesy rice balls for some random reason. \nThe pineapple pizza is soooooooo surprisingly good. With a torched crust and super thinly sliced pieces of pineapple. The half chicken was so juicy I'm going to have dreams about it. The dessert bundino was so good and buttery-like mixed with chocolate pudding.Totally gonna crave this place again cant wait to come back and try out other plates 5/5", "author": "Charles D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "Che Fico is officially my favorite restaurant in SF...nay, the country!\n\nThe food is PHENOMENAL! The wood fired pizzas are unique and generous with interesting toppings. We tried the one with pineapple and it was stunning. The pastas are out of this world. Each one has hand made fresh pasta with a delicious sauce and vegetables. The lamb agnolotti is killer!!! Unfortunately last time it was no longer on the menu. The only misses were the bolognese. Somehow it was dry and stringy...and the pesto pasta with a long skinnier lasagna noodle. It was overly oily without enough seasoning. The chicken for two is okay, I'd skip and focus on pasta and pizza. Everything else was awesome. Apps are also varied and interesting. The octopus salad is delish, the salad with gazpacho was unreal, it was so good and fresh and healthy. There was a berry cobbler on the menu last time we went which was bursting with seasonal berries, and had a homey feel with a crispy and slightly burnt crust...so delicious. And I'm not a dessert person! The chocolate thing was just okay though. \n\nThe space is also just beautiful. Airy with high ceilings and flooded with light. Beautiful wallpaper etc. servers are courteous generally and seem really into the food and mission of the restaurant. The menu changes frequently according to what's freshest and most seasonal, but classic standbys seem to remain on the menu. \n\nTaking off a star for two reasons:\n1) food is slow to come out. Often you'll have to wait for 30 mins between dishes. They're usually packed but they should figure out how to address kitchen backlog better. Also talk about waiting...getting a table is impossible here and you can wait for hours even for a bar seat. I wish they'd figure this out better. \n2) cocktails are hit or miss. They're expensive so I was just expecting more. Many of them tasted watered down. I also wish they had more reasonable wine options. I don't always want to spend $14-25 a glass. The food is already so pricey, give people a break somewhere.", "author": "Ella M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "We had the BEST experience at Che Fico. Hottest restaurant in SF.  You can tell that the chef really put a lot of thought into the menu and everyone was so friendly.  I can't wait to go back for the pizza!!", "author": "Aimee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "Great pizza and fantastic space. Loved being upstairs.  They aren't afraid of acid and salt, which I really appreciated.  What I didn't love was how the menu was written -- with a gazpacho dish listed more as a salad, and an anchovy dish only containing two anchovies. Seems a silly criticism, but it's a bummed to be disappointed by those things. I certainly didn't take a star off for that!  The food and atmosphere were solid 4-stars and I look forward to going back!", "author": "Lucy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "Wood fired chicken (not fried) was excellent.  Not cheap, but reasonably priced and thoroughly enjoyable.  We did not enjoy the polenta that came with it - it seemed like cream of wheat breakfast food.  But we did ask, if we came back again, could we have an alternative to the polenta and we were told that we could.  We also enjoyed the fire roasted peppers - tasty, plentiful and reasonably priced.  This was an excellent side dish and will get this instead of (rather than in addition to) the polenta if we make it back.  The pasta (PAPPARADELLE AL RAGU) was truly outstanding, but...it was perfect for an $8 'small plate' - not so perfect for a $28 entree.  My wife asked the waiter 'this is it?' and sadly learned that that was indeed 'it'.  If you fold a dollar bill in half, you will be able to picture the approximate size of the pasta serving.  Sorry, I failed to take a photo.  We loved the papparadelle, but it was the worst price performance for a single item in my dining experience (and I'm an old man).", "author": "Bob M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "Wow, what a space. They did a really good job - its big, open, exposed rafters, cool details, great bar. Even if the food was a zero I would come back here just to eat in this space - it is so cool and has great energy. Luckily, the food is also great. SF really lacks in the italian food dept so its great to have CF upping the game with their unique dishes. Great addition to the neighborhood.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "The wait is absurd here. Do you really want to wait 3 hours? They dont take reservations for parties under 6. It is a big hype. You'll drink a lot of they make tons of money on the bar. It's the latest trend this place. Behind the scenes it seems grumpy and angry. The food is good though ridiculously expensive.", "author": "Anne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "LOVE LOVE LOVE\nChe Fico just opened, but I loved the atmosphere, food, drinks, and service - happiness is suppli, pizza, pasta, citrus crostata, and a bottle of wine here. A friend and I walked in without a reservation at 5:30p opening and were seated after waiting for about 20 min at the bar - ask the bartender to make his choice, we loved our drinks. Emily helped seat us, she was lovely.\nThe pizzas were a highlight - LOVED the marinara and anchovy with a brightly dressed arugula salad on top and the SF margherita DOC. The crust is so flavorful, I could eat that on its own - don't forget the chili oil. There are 100 more things we need to go back and try.\nGreat music, great food, unbelievable wallpaper, great energy, can't wait to go back.", "author": "Elizabeth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "So it took awhile before I could get up to SF with our food crew and try Che Fico...had it on the calendar several times so stoked we finally made it.  Great vibes, fun/stylish decor and the food was suuuuuuuper tasty!  We always family-style, so tried most of the menu...huge fan of everything I ate.  Everything.  But, the PAPPARADELLE AL RAGU?  Beat any bolognese I ever ate when I lived in Italy.  My new fave.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Glorious. What they did with the pizza should be described in novels. The pasta was equally on point. Sit at the high top tables to chat with the chefs. One of the best restaurants in SF.", "author": "Sharam F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Delicioso!!!!  I never post but am so excited about this new neighborhood joint!  Went there last night for their opening.  The interior design is littered with gorgeous tile and an open air feel with large windows and skylights. The Suppli (fried rice balls) are THE best I've ever had. They got the rice-to-tomato-to-fried ratio absolutely perfect. Next favorite was their tuna conserva. Highly recommend the Biggoli Nero with dungenous crab and clams. I thought the service was incredible given it was their first night. Oh and coctails were delicious. Will definitely be going back soon!", "author": "Kristi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "I wanted to love this place, it is a beautiful space and plenty of walk in spaces at the bar.  The wines were the highlight of our meal, that and the service.  However I think the main reason you should be coming here is the food and that is where I feel there were a lot of misses.  I'm confused about the pizza, I can tell it's made with quality ingredients however the burnt crust was overwhelming.  I believe that they char it to a blackness on purpose, and I can't seem to understand it.  It made it bitter and inedible, even with the dusting of parmesan to hide the dark color.  The pasta, the orecchiette pasta was made in house but was doughy and rubbery.  Again, I could tell the ingredients for the sauce were of high quality however the actual pasta was underwhelming at best.   It was way too thick for that type of pasta.  I hate to pull the I just got back from Italy for the umpteenth time card, but yes that's the case and these two items were in no way representative of the cuisine.   I really do hate posting a negative review because I really wanted to love this restaurant.  The manager even stopped by to offer a free appetizer because the first course was taking a long time to come out of the kitchen.  I appreciate that immensely as well as having the chance to chat with the chef.  We will be back to give it another go but am not comfortable with recommending it to friends and family quite yet.", "author": "Brye L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Fico per niente. At first sight it seems nice but this place is so loud and austere. The wait list for the restaurant was too long (3.5 hours) so the nice hostess suggested we put our name on the wait list at the bar. He told us about an hour, which was fine, but it ended up being 1 hour and 40 minutes. We had a glass of wine and we observed till we were seated. We ordered the octopus and pork belly appetizer (after our waiter confirmed there was more octopus than pork belly which there wasn't), the carciofi alla giudia (artichokes), and the asparagus. Our waiter came back about 15 minutes later to tell us there were no more artichokes or asparagus. Trying to figure out what else to order, there was no accommodating us at all; couldn't remove cheese from a pizza, couldn't put mushrooms on the marinara pizza, no aioli on the side of another dish, etc. Not many options for vegans here. Lots of meat, I don't eat meat, so there were no pasta options either, as my friend couldn't eat cheese. They \"found\" an order of asparagus and there was absolutely nothing unique about this dish; steamed asparagus in lemon juice. We ordered some bread which was good. Not going back.", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "you.gotta.go.\n\nthought i would just stop there but let's be honest it's about the food.  i don't write many reviews for a reason (usually if it's a horrid customer or dining experience) but just had to share.  \n\ncaciocavallo - the last item (aka the best item) on the antipasti list.  never had anything like it and i've had a lot of cheese.  \n\nthe pineapple pizza with fermented chili.  cheese ON the crust - a nice touch.  need i say more?  just do it.\n\ngot the cavatelli.  pasta was good.  the broccoli needed a little crunch. slightly overcooked and kind of just there.  a pinch of chili flakes would have worked for me - where's my shaker when i need it?\nwas debating on the mafaldini.  try it.  looked delectably delish.  next time for sure.\n\nthe milk punch is something i'll try next time too but their barbera is top notch.  want to try a different wine?  get the one from lodi on the by the glass list - it's interesting in color and taste.\n\nrefreshing, non-pretentious addition to the sf food scene.  the wood beams and gorg fig wallpaper stand out in decor.  a huge salumeria room stands in the main room.  heard they have a garden in glen allen growing fresh ingredients....what will you add to the menu next?  \n\nsat at the bar so can't comment on service aside from andrew and the others behind the bar - made it a super solid first experience at che fico!  congrats on day one!", "author": "chainsawjr .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Wow. Where do I begin? We were excited to try this place out but it was a huge disappointment. Worst meal in SF. From the moment you get up the stairs the heat and poor air circulation hits you first. Then the sound of everyone shouting is literally bouncing off every wall. Everyone is struggling just to hear each other. We ask the hostess whether it's possible for a table and she looks at her clipboard confused. She says yes but has no idea how long. She adds our name to the list and tells us we are welcome to eat at the bar if we can find a spot. After buzzing around 20 min we find a spot. As we sit down the bartender rudely tells us the bar has a waitlist. We inform him we are on the dinner list and were told we can eat at the bar if we find a spot. He says \"the hostess doesn't know what she is doing - I manage the L bar - you can't sit here\". He then says \"you can sit at the window bar top seats only without being on a wait list\" and walks away. Stunned we get up and wait another 20 min for the window bar top to become avail. We sit down and hunt for menus. 5 minutes later an angry hostess cones over and starts yelling \"you can't sit here\" . She grabs menus out of our hands and tells us that area has a list. Not the dinner list , not the bar list, but yet a third list ? This hostesses was the rudest person  I have ever encountered in a restaurant. Luckily we ran into our friends who we joined. Everyone was miserable as the food was awful and the service was atrocious. Never ever going back.", "author": "J S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-22", "description": "I was looking forward to trying this new hot spot in town... and made a reservation for Saturday.... we are sat served water and then the server arrived at the table and instead of welcoming us and introducing herself, she told us about the 5 items no longer available tonight on the menu.... ok... great start... we ordered wine and an appetizer... she says that she will remember the appetizer because she has to put our entire order in at once... ok....   then our food comes out, which is very good... but no one makes sure we need anything between courses or brings fresh plates... then the server tells us she is going home before our entrees arrive... 15 mins after we are done with our meal someone finally checks on us... we said we are done please bring us the check.... another 10 mins pass... she forgets the credit card... hopefully they get the service right, otherwise at this price point, I'll hire a chef to come to my home instead.", "author": "Keir J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-11", "description": "They are, in every way, a victim of the immediate \"buzz\". The food is great but the service is sadly lacking. Imagine 'deer in the headlights' meets Cotogna.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "From start to finish I had an amazing time at Che. You go up a flight of steep stairs and walk into a bustling and super stylish open dining room. I loved the design you can tell from the textures, patterns, and lights they spent a lot of time putting together the space which gives it this funky throwback/bohemian feel. I loved the open kitchen layout and the room of hanging cured meats. They had cute booths and then communal style tables which worked out great for us since the diners next to us were two hilarious men from New York and we shared some conversation. Our server was funny, quick and helpful. We got the octopus and pork belly which everyone loved, the chopped salad which I was hesitant about but was great and came decorated with edible colorful flowers, the Bolognese, the ode to Judy rodgers pizza which we added arugula to per our servers suggestion, this pizza was really interesting. They serve the pizza crusts kind of blackened on top which you would assume would make them taste burnt but it was perfectly crisp on the outside and fluffy inside, the suppli was really interesting and flavorful, the cauliflower side was ok I would pass next time. But, the wood fired chicken stole the show served with an amazing creamy polenta, the chicken had perfectly crisp skin and was so juicy. My two friends said it was the best chicken they'd had. Despite how busy they were food came fast, and the service was very attentive. It's really noisy so was hard to talk across the table. So keep that in mind. But if your looking for a casual yet chic environment, with a lots of energy and great food this is your place.", "author": "T V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "food is spectacular! cocktails are amazing and service very friendly and helpful. ambience is great very pleasant and with great music!\ngetting reservations is a nightmare as they unfortunately use open table and they never pick up the phone but once you get in is an wonderful culinary experience.", "author": "Myrto K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Awesome space with excellent food to match!  Love the suppli and the pastas are sublime.  Our 2nd visit but definitely not the last. Thanks", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "that pineapple pizza really is good.  the crust is fantastic!!  can't wait to try more pizzas.  also good were the triangoli, and the chef was nice enough to add spring peas per our request.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Love this place SO much. Everything we ate was phenomenal! And what was such a pleasant surprise is that the staff were all so friendly, warm, and inviting (unlike most popular SF restaurants where they seem generally inconvenienced by you wanting to dine at their establishment). Gorgeous interior, killer drinks, and just an overall incredible dining experience.", "author": "Erin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "OMG......CHE FICO has the winning combination:   phenamonal food, great service, reasonably priced, beautiful space.  Yes, it was nearly impossible to get reservations, but I persisted!  It definitely was worth the time and effort.   Thank you Che Fico for a memorable meal last night!", "author": "Alice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Holy cow!  You don't want to miss this place when in SF. All of the pasta is home made and cooked al dente. They have an amazing cocktail program where the bartenders take their time and product a phenomenal drink every time. The service was impeccable and I can't wait to come back for dinner next time I'm in town. Make sure and get a reservation as this is a hot ticket.", "author": "Brandon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Had a great experience. Sat at the bar on a Friday night. Loved the lively atmosphere and interior. Pizza was superb and the cocktails were right on point. Excited to see this place grow and succeed and look forward to returning soon!", "author": "Mike J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Great new spot. Decor is tops. Pizza is unique and very, very tasty. Pasta is heavenly. Wonderful wine list and fairly priced. And the dessert was outstanding.", "author": "Fred B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "We were so excited to try Che Fico after all the hoopla around it. Unfortunately, other than meeting wonderful guests sitting next to us, we left disappointed. The two salads and pickle dish we ordered as starters were average, but nothing exciting or to write home about. I ordered the tuna conserva because I love the one at Delfina. This one lacked the kick and excitement that the one Delfina prepares. The two pastas we ordered were overly salty and mundane. And the pizza was overly salty and nothing special. The servers were all very gracious and helpful. They were kind enough to take off all the foods we did not enjoy. All in all, we were very sad to leave feeling hungry and disappointed. The food is too heavily salted and compared to many other restaurants in the city that offer similar options (pizza, pastas, etc.), Che Fico comes up below average. I hope that over time they can learn to cut out salt and highlight the creativity of the chef and authenticity of the food. Best of luck!", "author": "Emma L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "this is place is top notch all the way around. staff, decor, service, food, and price. i travelled here from down south and the journey was worth every mile.", "author": "moss t."}
