{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "***Delivery Review Only***\n \nWow! I'm seriously impressed! The breakfast that we had here was incredibly delicious. I rarely ever order food for delivery, but we were having a lazy weekend and decided to stay in. But, I'm talking EXTRA lazy like \"I don't even wanna make a bowl of cereal\" type of lazy. I checked on Yelp to see what places delivered in the area. Obviously there's an ish ton of brunch spots in the city that deliver, but there aren't too many options in Ingleside. I looked this place up, read some of the glowing reviews, and decided to take a chance. We ordered Chico's omelette, huevos rancheros, and a side of the home potatoes as these were what many Yelpers were raving about in the reviews.\n \nThe quoted delivery time was 45-60 minutes, but we were shocked to hear a knock at the door about a half hour later. Let me tell YOU... this breakfast was the BIZZOMB!!! First off, it was still nice and hot! One of the reasons why I don't really care for delivery is because depending on what you order, the food could be delivered cold. But, I had no problems with that here! Secondly, did I mention how good the food was?!\n \nThe Chico's omelette was stuffed with carne asada, onions, tomatoes, avocado, and jack cheese. It was hearty and extremely flavorful. The toast was perfectly browned and the home potatoes were crispy and had a great seasoning on them. But those huevos rancheros, though! The absolute STAR of the show! Wowza, this tasted absolutely sensational. It was served alongside a deliciously cheesy quesadilla with fresh avocado slices and a large dollop of sour cream. YAAASSS! The fried over easy egg and black bean and salsa mix were perf! We were left completely satisfied after consuming this meal.\n \nAnd, the best part is: breakfast for two was filling and very reasonable in price! They have a $20 minimum for Yelp delivery, but just we barely surpassed the $20 mark with all that we ordered. We're used to seriously having to shell out that paper when we go out to eat in the city, so this was a nice change of pace. I can't wait to actually dine in at the restaurant in the future. Such a nice find!", "author": "Shayla B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-04", "description": "One can never know if it was lunch or dinner that caused a sudden illness. You know, getting the sweats and then the immediate need to find a bathroom shortly thereafter the first symptoms... It is for this very reason that I can't be certain if it was the food from Chico's Grill or not, that I gave them 2 stars. \n\nHands down, the nicest guy working behind the counter. But... after the tortilla soup for 2, which was very good, it was all downhill from there. My friend's platter, the chicken mole, included a very bland mole with unidentifiable questionable cuts of chicken. My beef fajita included the just about the cheapest chewiest cut of meat you can buy. Most of it was fatty and couldn't be property chewed. \n\nWhat a disappointment and regretful $48 spent.", "author": "Bulldog W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "We ordered a burrito and 3 tacos. Good portions. The food was good. No complaints. The carne asada and pollo tacos are equally great.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "I just moved to this neighborhood and I stumbled into this gem by accident. Best  eggs and chorizo I've ever had. My husband had the chilaquiles. We have a date to go back on taco Tuesday. Great food. Eat and be grateful for food prepared with love.", "author": "Cindy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Huevos Rancheros is my go-to breakfast order so I've tried it everywhere I go, all over the world. Chico's version is truly fantastic. Instead of a simple soggy tortilla at the bottom, it comes with fresh quesadillas on top! The red pepper sauce is perfection. The eggs are cooked to your desired doneness. The green cilantro sauce served on the side in phenomenal-must try. \n\nI asked the chef about the recipe. He said it dates back to his grandmother in Puebla City, Mexico. \n\nI will be back often to try more things and to have this amazing huevos rancheros again.", "author": "Marina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Awesome service and delicious mexican breakfast!", "author": "Henry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Great little place where the food taste muey bueno and the price is definitely right on! Very nice owners who will make anything for u if it's not on the menu! We will be back and have been now for the 6th time and making it a ritual for Taco Tuesday's!! Thanks for having Chico's right down the street from mi  hacienda!!", "author": "Curtis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "This place has awesome huevos rancheros. My bf and I stepped into this place for a quick bite to eat; we've never been to this area and the place looked unassuming. The order took a while but it was super worth it. Ask for their jar of sauces on the side, because it wasn't brought out to the table beforehand. That spicy green sauce elevated the dish, but the plate was already quite good. It's a big order, so you might want to share with a friend.", "author": "Lucy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Good morning well I love huevos rancheros do I looked up restaurant in he area found this lovely little please the food was delicious on point and orange juice  was fresh but the service was not too good walked in no great but there than that the food was yummy", "author": "Kassandra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "My husband and I absolutely love this place! We ordered online we were planning on picking up the food and eating at home but we asked if we could stay when we got there. The man working there was so nice he set us a table and made sure we were happy! The serving sizes are awesome we always get the chicken tacos and a side of guacamole and chips. The side you guacamole is huge! We have gotten food from here twice and we plan on coming back for more:) Great service/Great food/ Great price:p", "author": "Stormi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "Ordered breakfast delivery  as there were not too many places open Saturday at 8am, they were quick, like at my home in 45 minutes and the food was great. French Toast was bomb.com.  I will use them again for those early mornings.", "author": "Lei F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "Had a very disappointing experience with this restaurant AND Eat24!  Have used Eat24 a number of times with good results. Tonight, I was delighted to find a Mexican restaurant that delivers to my address.  Just to be sure, I phoned the restaurant, who confirmed they deliver and I should use Eat24. About an hour later, I received a call from the Drive, who said he did not have my address. I called the restaurant to inform them, and they said they'd have to call Eat 24 for the address. He would not take my address over the phone. 15 minutes later, Eat 24 called to ask for my address even though they have the data. Finally at the 2 hour point, the food arrived. The purported chicken tacos consisted of pieces of chicken the size of walnuts wrapped by soft corn tortillas. Yuck! The only good thing was the guacamole was fresh, homemade, and delicious. Really irritated and won't use this restaurant again. And very DISAPPOINTED in Eat 24.", "author": "Rita Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Really good experience with this place! Food was really good and costumer service was kind!", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Great little breakfast spot (haven't tried dinner). I can definitely recommend the chilaquiles - beautifully prepared, delicious, generous portion size, reasonable price. The green sauce is a little spicy but not overwhelming. My food was made to order yet still came out very quickly. The atmosphere and staff are extremely mellow, which suits me just fine. Can't wait to try the chorizo and eggs.", "author": "Ian L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-31", "description": "DO NOT ORDER DELIVERY from this restaurant! \n\nHere is my GrubHub timeline from this morning for an order of Chico's Omelette, Huevo con Chorizo, Sausage and Coffee: \n\n9:10 AM Placed order online with initial delivery estimate 10:15-10:25\n9:28 AM Chico's Grill accepted order and \"began preparation\"\n10:25 AM Order delivery estimate updated to 10:18-10:28\n10:39-10:50 AM I called the number listed for Chico's Grill multiple times and got busy signal\n10:50 AM I left a chat message for GrubHub with delay summary\n11:07 AM I called Chico's again, this time no answer\n11:19 AM I called Chico's again, again no answer\n11:23 AM I called GrubHub and spoke with Paul, who diligently tried an alternate number they had for Chico's. He couldn't get anyone to pick up either and there was no VM set-up. He refunded me my full order cost, saying maybe food would show up later, but he had no way of knowing.\n1:00 PM Food never did arrive and I heard nothing from restaurant. They are a 12-minute drive from me. It should not take over 2 hours to make and deliver eggs, people. \n\nThey might be good for in-person orders but delivery? Fuggedaboutit.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Food was good. Best green salsa ever. Prices were great. Two for one margaritas during happy hour only $4!", "author": "Walter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "I was craving breakfast in bed one morning and decided heck what places are open on a sunday morning and sure enough Chico's grill had a brunch menu. Such an amazing variety of brunch menu items, as well as lunch and dinner options. There was a delivery fee of $5 but I didn't care I was just hangry. By surprise I got the Chico's Omelette and it was simply delicious! The home potatoes were crisp and not soggy which I was super impressed by. Also I asked for flour tortillas on the side so I can make mini breakfast burritos and they did give me 2. Then the freshly squeezed orange juice hit the spot just right. I definitely recommend Chico's Grill because food was FABULOUS!", "author": "Erica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "I ordered delivery from them yesterday for the first time and the beef/steak was delicious! They reminded me of the way my mom cooks her steaks. I got the Taco Platter and they load them up! I think I found my new taco spot in the neighborhood.", "author": "Alan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Holy mole! The Fajitas were so tender and juicy and the chilaquiles hit the spot. The tortillas were made of organic purple corn which added a unique flavor to the mix. I gave it a four star only because the tables were not sturdy and the waitress was a bit slow. The food was well worth the wait though.", "author": "Zaid M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-12", "description": "Yikes was the bathroom scary! Dirty, and in need of cleaning. And no soap. Yikes!\n\nWe had the chiliquiles with the mild salsa and the chorizo egg scramble. Both dishes, according to my cousin, were lacking in flavor, and tasted like \"a more expensive Tv Dinner.\"\n\nThere you have it in a nut shell.\n\nNot very filling, the chiliquiles had about a scoop full of chips drenched in sauce and cheese, and  two eggs on top. One was runny, the other was overcooked. How odd.\n\nThe chorizo tasted like it was from a cheap package, and mixed with 3 eggs for the scramble, served with plain black beans and dry rice.\n\nEven with a Groupon, Living Social, or Yelp deal, I wouldn't be back.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Have ordered from here many times with eat24...usually from the brunch menu. Its always delicious and stands apart from all the other places on eat24 . Very fresh ingredients and they even do a great job on presentation for delivery:)\nLove this restaurant", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Very friendly staff who are bilingual.   The food was great as well . Everything was done perfectly and tasted really fresh. I would definitely recommend if you are in town and looking to have a Mexican breakfast like I was.", "author": "Cali C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "I had an appt nearby at lunch time, was starving though so I walked a few blocks looking for a place I could grab a quick. I passed by this place a couple times before going in. I am picky about food and I was not sure because there were hardly any customers in the place. I went in anyway and asked for a  beef taco.  It was DEVINE and only 3 dollars.  The meat was great quality and the tortilla was soft and flavorful, fresh veggies in it, and it was a good size taco . I took pictures of the full menu because I knew I was going to be eating at this place again and I could add Chicos to my options for delivery.  Don't be fooled .  This place looks very basic, but the food is awesome!!!", "author": "AM S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "I live right around the corner and never came here much. Went again randomly and I wonder why I stopped going here. Chico's Omelette is a steak omelette and it's delicious. Owners/cooks are super nice as well. Make sure to ask for their house made salsas!", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "I feel like I'm in someone's house when I eat here... and I mean that in all the best ways. The food is delicious and tastes like grandma's, the owners are friendly, the place in unpretentious and warm, and I never feel rushed. But again... the FOOD. Unique homemade sauces bursting with flavor, handmade fresh tortillas (if you ask), blue corn tamales... yum! I'm a vegetarian and have so many options here, and my boyfriend raves about their meat dishes. You won't be disappointed!", "author": "Marie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Great place in bern heights for breakfast and brunch. Friendly service with a relaxed atmosphere. Drinks are offered from sangria to mimosas and fresh juices. Love the chilaquiles and their Mexican style dishes. You will leave here full and happy.", "author": "Ella P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "WORST SERVICE EVER!! Never order from this place. We ordered trough eat 24. First they lied about the delivery time, we got the food 1 hour after they claimed they had delivered then the order was wrong and the enchiladas were missing and when we called to ask about the mistake they refused to send us the missing items and said we were lying. I'm trying to get my money back and no one is helping!", "author": "Daniela C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-15", "description": "I ordered it took over an hour and I'm waiting to receive status and I just get a message that the chef has made changes to my order! So now I have to wait another to get my food? Lousy service the food better be worth it or I'm not paying!", "author": "Nellie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "A homey & good quality place. The ingredients seemed fresh were good quality.\n\nThey weren't super busy for brunch, made a reso at 1pm on a Sunday but honestly there were only one or two other tables of people there.\n\nOur server was super sweet, had that genuine motherly smile.\n\nCost: ~$75 for 4 brunch plates & 4 mimosas\n\nMust-haves: Huevos con Chorizo or Huevos Rancheros.\n\n* Huevos con Chorizo - 4 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#399PU6oOROXM6YlS9TINtA\nSoft, fluffy eggs balanced by just the right amount of chorizo - also soft, lots of flavor, super tasty. The rice and beans - excellent.\n\n* Huevos Rancheros - 4 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#COJ5BhQ4S9tPLaDePoFQqQ\nTried a bite, the eggs were super soft and went so well with the tortilla. My friend loved this and said it was exactly what she needed.\n\n* Huarache - 4 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#_JjM1bR2jJP263qH2Lzdwg\nNever had this, liked it! Like a mini Mexican pizza, surrounded by a simple salad with black beans. The \"crust\" was thick and pretty crisp, but all the ingredients worked well together.\n\n* Chico's Omelet (w/ carne asada) - 3.5 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#Obr8dDWYWS2R938QSHgezA\nAlso fluffy egg texture, but in general this was a more simple dish - get this if you want something more classic, without as much Mexican flair. Potatoes had bit of a crisp, though I always like the skin to be a little bit thicker and with more char.\n\nBrunch menu: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#R5IoAqcpKkdGAIF6VIfOfg\nLunch menu: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#occDoAnKvPKXnd88Bdb0gA", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Old School Daly City Pages recommends this restaurant Chico`s Grill to friends & familia .", "author": "Ruben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Ordered eggs with chorizo and some pancakes on the side green sauce is delicious a bit quiet but nice, food was awesome it's definitely a must do for breakfast if you're in the area our drive 30 minutes to get here well worth it", "author": "Ernesto S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-15", "description": "Okay so I ordered chilaquiles, guacamole with chips and flan. The chilaquiles were just ok I was really hungry so I finished them.\nThe  guacamole and chips were super salty it was the one thing I didn't finish #tomuchsalt.\nThe only thing I enjoyed was the flan it was amazing. I don't know if they made the flan or if they have somone else make it but I loved the texture it was creamy the Raspberries were like the right amount of tart for the sweetness of the flan so yeah that's my review overall I won't be eating here again.", "author": "Anna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-23", "description": "I had Sunday brunch with a friend after putting in some loads of laundry at the corner laundromat. Honestly, and I hate to say this, but the whole place needs to be scrubbed from top to bottom as it smells heavily of grease. \n\nThat said, the chiliquiles I had with green sauce were delicious! Beware, the green ones are spicy!  I recommend this place for early morning Bernal eats.", "author": "Tara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "I woke up this morning and had to have huevos rancheros. We live in Glen Park and Chico's was walking distance. Best. Huevos Rancheros. Ever. The BF got the chilaquiles which was a close tie with their spicy, smokey green sauce. My huevos was topped with a quesadilla and served with a whole half of an avocado for $10. Wow. \n\nThe restaurant is very nice and the service is even better. You can tell care and passion goes into everything. I think the owner was doing everything but making the food himself. Great spot. Fresh, authentic food, and no wait. Plus you can't beat the price. Support this place, I will cry if they close.", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "Delicious brunch! I had a Livingsocial deal for $15 for $30 - $10 code = $5!!\n\nCame here for a Sunday brunch with a friend. Parking wasn't too bad, just needed to wander off to a side street for a little bit and there is plenty of 2 hour residential parking.\n\nWe got:\nHuevos rancheros - loved the avocado slices, and the quesadilla was awesome. I don't remember much about the eggs or sauce, but I remember it being pretty good\nSampled a bit of my friend's California omelet - Mmm, more avocado. It was flavorful and fresh.\nBelgian waffle - Hmm.. not as fluffy as I wished. I think the ones I have at home are more fluffy. It was as bit grainy and filling? Still pretty good. We got this so I could go above $30, although I wanted the flan actually.\nThe fresh orange juice was good too.\n\nAll the food is super fresh and delicious here! And not too expensive!\n\nService was great and they are really friendly here.\n\nSadly, they did not let me put the remainder of the bill ($6) on credit card, because of a $10 credit minimum, even though I was going to tip to above $10. Oh well.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "Came here last weekend as it was on a walk home after a marathon trek from Candlestick Park. (Can I review public transit routes?) \n\nThe staff was very friendly and attentive as we were the only people there on a Sunday night. \n\nChips and salsa were below average, especially for a place on Mission. \n\nThe mole chicken was pretty mind blowing. Top five on my mole lists and that's saying a lot. \n\nThe dish was also served with some incredible handmade organic blue tortillas. Wonderful compliment to mop up the mole. \n\nIt is clear they are trying hard to please both the local latinos (amazing authentic mole) as well as the annoying hipsters (as many things organic as possible) at this joint and I appreciate that. \n\nThis review has the potential to be upgraded to a five when I come back and try a few more dishes.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "I went to Chico's Grill and had the huevos Rancheros.  The presentation,  portion size and taste was excellent.  I highly recommend this restaurant.", "author": "John B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-12", "description": "Ordered once and immediately regretted it. Order was wrong, bacon wasn't even edible, not a single even decent thing that can be said about this food.", "author": "Kay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "Had brunch on a Sunday and the place was pretty quiet. Not sure if we just missed the brunch crowd but regardless the food is delicious and would be worth a wait! \n\nI started with the horchata to drink, which was good. Not too sweet, hint of cinnamon. Delish! I ordered the kids breakfast burrito which was egg, potato and cheese in a flour tortilla topped with a delicious sauce. Since it was the kids size it wasn't overly large, which I appreciated. I ate every last bite! My significant other ordered pancakes, scrambled eggs and bacon. The pancakes were a hit, fluffy and light with a dusting of powdered sugar. Yum! \n\nService was great - efficient and friendly. \n\nWe will definitely be returning to Chico's for brunch and maybe even to try their dinner menu.", "author": "Emma A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "I ordered food through Eat24 and said it would be delivered with 45-60 mins. I ordered at 9:30 am and called them at 10:15 am wondering when they were coming. And they said they left 30 mins ago. At 11am I finally called to cancel because still no food was delivered.  They wouldn't pick up and then finally said they don't do refunds that I have to call Eat24 and tell them. What horrible service! !!!", "author": "Elizabeth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "In a nutshell, Chico's Grill serves amazing, delicious, fresh food! It is authentic Mexican food, but not the typical one, the chef adds a little bit of a twist (you have to check it out to understand what I mean). If you check out their website, the chef comes with years of experience from high end restaurants in San Francisco.   \n\nI went for an early dinner with my mom. We shared guacamole and chips: http://www.yelp.com/biz_photos/chicos-grill-san-francisco#70zKFw2-qI-AAh8gRI74hQ which a really good appetizer. \n\nWe also ordered the tortilla soup for 2: http://www.yelp.com/biz_photos/chicos-grill-san-francisco#fjh3kTvnl8xFbUkkvw8s9w To my surprise it was white. When we received it, I wasn't sure if we had ordered the right thing. Which was also pretty good, I would dip some tortilla chips (from the guacamole) into it.\n\nMy favorite was the tacos: http://www.yelp.com/biz_photos/chicos-grill-san-francisco#NNPr7yP_l07TbOamLRvFcw Typically, when I bite into a taco at a normal Mexican restaurant, you feel the nasty grease. But this taco had juicy carne asada but without the typical nasty grease. It was delicious! \n\nI'll definitely be back again!", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Great Food, Super Waiter and Owners. Friends took me there for my birthday dinner and was pleasant surprised how good the food was and how the Waiter and Owners made you feel like you was having dinner in their home. Look forward to be able to return and eat again.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Chico is SOOOO nice!\n\nWe walked in here one night, starving after a long day.. Chico greeted us kindly and served us a really good meal!\n\nTheir mole is AMAZING. I know 12902319012308 other reviewers have said the same thing, but oh man.. that sauce... *droooool*\n\nIt's a bit out of the way all the way out in deep deep Bernal, but it's worth checking out. I've heard good things about their breakfast too -- I can't wait to go back and try it out.", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "A diamond in the rough!  How this place has gone unnoticed for so long befuddles me. \n\nGreat food, great service. \n\nThe chilaquiles con huevos is amazing. Be sure to have it with the green sauce.", "author": "Nish S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-17", "description": "Ordered through Eat24, first time eating from this place for us.\n\nWe ordered at 7:40, Eat24 estimated 45-60 mins, restaurant confirmed 90mins. Store closes at 9pm, doing the math that's after they closed. Our food arrived half hour after the store employee \"checked\" where the driver it's and will be there in 7 minutes. So in total it took 2hrs for our food to finally delivered to our door.\n\nAs for the food, my Mole poblano was not bad but not great but the chicken was cooked nicely. My wife's Steak Rancheros and veggie quesadilla on the other hand was pretty bad. The steak was tough and it had gristle and even I was not able to chew it, so we pretty much had to pick the steak out leaving us with just rancheros sauce. The veggie quesadilla was so-so,  the tortilla was soggy from being in the paper box too long and absorb all it's own sweat. \n\nAfter seeing some of the other reviews, I can say \"Don't order online. If you want to try it, try it in the store. Seems online order is not a priority\".", "author": "Tony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "Ordered a Lunch through Eat 24.  Took over 2 hours to get our cold food.  Food was bland and the chicken enchilada was inedible....really bad.  Poor experience.\n\nThank goodness we ordered through Eat 24 as they took care of the issues for us.\n  \nThe restaurant and the delivery man both said \"Bad Traffic'.....complete BS as i know where they are located....there is no way traffic would have affected a delivery for that long to where I live (unless the food was coming from the East Bay for some reason).\n\nAvoid this restaurant  through online ordering....save your money and pick another place.", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Chilaquiles and Eggs and chorizo was legit. Surprised it was that good. I ordered through eat24 for delivery and honestly didn't know what to expect. Thankfully it was so good I had to write a review and give them kudos! Definitely will check out in person to see what else they have.", "author": "Rosa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Simply delicious! I want to branch out from their chilaquiles but it's just too good to order something else. Totally in love with the green sauce. I don't understand how this place isn't packed all the time. Friendly staff, chill vibes, and they deliver for those of us who can't get out of bed on weekends.", "author": "Matilda Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "I just want to say, I love this place. Great staff, delivery guy is friendly. Delivers brunch. Fast delivery. The food is great. My husband just loves the chilaquiles. You get what you pay for, and to me it's good. To be honest, the food is better than some 5  places I been. I like it. It's just awesome.", "author": "Kay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "The Huevos Rancheros blew my mind. The staff is very nice and welcoming, and the choice in the breakfast menu is decent. Worth every penny!", "author": "Zak E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-19", "description": "The manager is very rude, he doesnt respect customers opinion\nHe doesn't have most of the recipes which written in the menu\nBathroom is very dirty\nThe restaurant has bad aroma", "author": "Ruby U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-19", "description": "The manager is so stupid\nThe service is very bad, \nWe went there for lunch time, but they don't have all the food which written in the menu\nThe manager or waiter is very very rude..\nThe restroom is dirty\nI don't recommend anyone to go there.\nIf I could not to give him a star I won't give him any star\nCos he doesn't deserve even minus star", "author": "joe j."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-23", "description": "Nice facilities, clean bathrooms, personable (if green) service. But our impression of the actual food is maybe a 2-3 average. With the pricing in this out-of-the-way area of about $10 for each breakfast entree, I was expecting much more for my money. \n\nPotatoes were ok, seemed very oily and overdone. Ok portion. \"Chico's Omelette\" (Carne asada and vegetables)  looked decent, but the meat was not very good and the vegetables didn't save it. Very average. Eggs and sausage was standard fare and some ok, still a hefty price for what we got. \n\nI seriously doubt the $3.50 glass of orange juice was \"fresh squeezed\" as claimed. Tasted exactly like store-bought Tropicana.. \n\nNice enough people, but I honestly don't understand the huge amount of 5-star ratings here. This place has a lot of potential if they work on the food quality, but it's definitely not there yet.\n\nOne odd thing to mention, one of the staff did a huge sneeze in front of me, took that same bare hand that blocked the sneeze and placed it into a serving dish that he then filled up and gave me. Ugh. Not sure how to rate that one. \n\nI'd probably give this a 3 based on the space and optimism for their potential. Taking off a star for the sneeze, the overall priciness vs. quality, and to balance out far too many 5-stars which don't seem merited (yet). Please bring them a handkerchief!", "author": "Bob M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "Is it weird that my favorite thing about the restaurant was the food portions?\n\nMy friend and I ordered cheese enchiladas, salmon with walnut sauce (it's weird, I know), and some other dish with cheese and beans and tortillas.\n\nIt's a small-ish restaurant in a random location and when we went inside I didn't expect much. But then when the chips and the crazy fresh guacamole came out with the HOMEMADE SAUCES I just about died. \n\nThe cheese enchiladas reminded me of homemade enchiladas from someone's home. They were the perfect portion for someone (me) who loves cheese but didn't want to binge on it just then (definitely smaller in size than what a foodie might normally expect).\n\nAll in all I think it's a good restaurant, and if I were in the area and craving cheese and some freaking amazing sauces for chips and blue tortillas, I would totally go back.", "author": "Charity W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-20", "description": "The Enchiladas was ok it had that school lunch taste though. I've had way better. The horchata was ok it taste more like melted vanilla ice cream though. The Aroz con Leche was bland and tasted watery overall it was ok I would not come back though", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "I went to Chico's last Sunday with 2 friends and we all ordered Huevos Rancheros.\nBut one of my friends wanted it served with toast, not tortillas.  The server didn't blink an eye and all 3 of us enjoyed our meals.\nWe stayed for 2 hours because we didn't feel any pressure to eat and run.\nAnd we were brought a delicious dish of fresh mixed fruits and berries at no additional cost.\nI just hope they do more business, I would hate to see this place close.", "author": "Jerry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "Alright, I'm not kidding. This place is a secret garden of culinary delight in the middle of a quiet part of Mission street you might have NEVER found.  And the owner is a gracious, lovely person you just want to support and help prosper too.\n\nI showed up because of an article in the Chronicle raving about the mole.  OMG.  The chicken mole.  To die for.  Incredible.  The best I have ever had.  Every year on Dia de los Muertos I try to at least have chicken mole and this was like going to food church in the best possible way lol.  PLUS the organic blue corn tortillas.  OMFG again.  You will never see tortillas the same way.  I can't wait to go back and have them again.\n\nThe place is also simple and humble but clean, adorable with little touches that show the love the owners have for it.  A beautiful little altar to la Virgen in the back (common in mexican restaurants) is extra specially done...and even the bathroom is pretty.\n\nI LOVE this place!!", "author": "T S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "I have ordered brunch here several times and was pleased with their food. Their San Francisco Omelet is delicious.  The chilaquiles, huevos rancheros and the chorizo con huevo are all very tasty.   I also like their fresh fruit salad, and their roasted vegetables.  Their flan is better than most I've tried.  If you order $30 or more, via GrubHub, you get 10% off.  The delivery times were decent.", "author": "Gilda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "3 of us went early on a saturday, and we were all pleasantly surprised. The ingredients all tasted fresh, no frills but absolutely delicious. Kind of felt like a home-cooked meal. The place was minimalist but not dirty. Prices were reasonable, and even moreso with the yelp deal they had going on!!! \n\nAll 3 of us got different meals and we all left happy and satisfied. Don't miss the mole.", "author": "Ed P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-18", "description": "This is my first yelp review that's how bad the service was\n\nOrdered food from them 3 times now \nfirst time great\nsecond time ok\nthird time made it be the last time I ordered breakfast for my family they said 1 hour then hour and a half then 2 hours. \nBy the time we got our food mine was completely wrong normally i would just deal but I was allergic to one of the items on my food so I called to fix the mistake and they out right refused to deliver my correct food. Granted we got our money back but I really wanted my food ruined my whole day.\nJust horrible service", "author": "Julie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "This is my first Yelp review for a restaurant.  The driver made his child deliver my cold food to the door (probably out of shame for how late the order was--took 90 minutes to deliver, and probably laziness and a complete lack of concern for customer service).  \n\nThat said, my roommate and I spent $34 on probably the worst breakfast I have ever had.  Cold, greasy omelette, thin/super fatty bacon--i think it was microwaved, \"toast\" which was cold bread, burned cold coffee, \"fresh squeezed OJ\"--I swear it tasted just like cheap pulp-free tropicana, pancakes which upon first bite, we decided to just toss in the garbage (cold, rubbery, tasteless).\n\nOn top of that, sauce, butter, and ketchup packages were thrown directly on top of the food as opposed to being sanitary by placing them within the plastic bag and away from the food.\n\nI asked the driver why he made his son get out and deliver the food after my mandatory $5 delivery fee and he just smirked at me and didn't say anything.\n\nWhat a joke.", "author": "Rob H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-19", "description": "So disappointing. Chile Rellenos was a tasteless green chile stuffed with packaged frozen mixed vegetables. No cheese. No flavor. Enchiladas tasted like old meat with a lot of salt. A LOT of salt. Food arrived promptly, and cold. Soggy flat white corn tortillas. Really off off night?", "author": "Donna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "The last time I had amazing mole was in Mexico, but this place is pretty great!  Their sauce is amazing, packed with flavor.  I typically don't crave Mexican food since sometimes it just feels too heavy, and I hate that feeling.  What I love about this place is that the dishes don't feel heavy or greasy at all but they are quite filling.  All of the dishes utilize really fresh ingredients.  Their mole is definately a must order.  I bet their breakfast items are good too.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "Excellent, authentic. my favorite in San Francisco. Lunch menu has fewer options than dinner but offers a good variety of fantastic tastes.", "author": "R P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "Came here with my girl Charity as I had been curious about this place for quite some time? She ordered the enchilada con pollo plate while I ordered the mole poblano con pollo & didn't disappoint according to Charity it was like she has an orgasm in her mouth & the organic blue corn tortillas was an added bonus in our latest food excursion & will be back again in the future!", "author": "Alberto L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "Ordered delivery through GrubHub last night and wow, we were really impressed. First off, there are not many Mexican food places that deliver to your door and that was pretty much all we needed to hear, so we took a chance on Chico's. We were quoted 1.5 hours wait time (it was 7pm on a Friday night) and the food arrived in less than one hour. IMPRESSIVE! The delivery driver was probably from the restaurant and had a kid with him, but they were super nice and this was the first delivery person to ever say \"Enjoy!\" as they left. \nThe food was all still warm and very fresh tasting. You can tell these people are using really good ingredients and superb culinary skills. We ordered the chicken enchiladas, the chicken mole, chips&guac, and the veggies side. All dishes arrived perfectly plated in their containers, which was very impressive to me.\nThe spicy red sauce on the enchiladas was great! Spicy, but not too spicy. The mole was also really amazing, and had a nice, smooth texture and flavor.\nThe veggies were ordered because I felt I needed some vegetables on my plate, but they were outshined by all of the other goodness Chico's has to offer.\nWe will definitely order takeout from Chico's again and hope that you will, too!", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "I stopped in here on a lark.  The owner was extremely friendly and the service was great.  I had breakfast and my friend had enchiladas.  The food was fantastic!  I would give this 5 stars except my friend ordered chicken and got beef, and the prices were a tad high for the type of food.\n\nBut for authentic, and extraordinarily well-prepared Mexican food served by the owner himself, you must go here.", "author": "Casey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "Great find and food! We enjoyed our initial visit and will return. \n\nI love their guacamole, clearly fresh and flavorful.  I also give the 5 stars for the salsa verde, which is the real thing I grew up with , made with tomatillos and spicy, not the creamy type of salsa that other places in SF area have.  They also had another red salsa, which provided a good balance and variety for the dinner.\n\nWe had the salmon plates along with sangria for the evening.  Everything was clearly fresh and homemade and I am sure other plates are just as flavorful!", "author": "Chris T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "I got an Amazon Local offer for this restaurant in my neighborhood, so after checking that it got reasonable Yelp reviews (as recently as July 2014) I bought the voucher.  First time we tried it was closed, then we showed up last week and found two men lying on the bench seats and nothing else happening in the restaurant.  We were a bit stunned, but one of them at least pointed us to some of the seats near the front that weren't being lied on, while the other wandered back to the kitchen, presumably to get ready to cook something for us.  At that point two pitbulls wandered into the dining room from the kitchen.  Wow.  \n\nI'm guessing someone died since July and left this restaurant to some family member with no idea how to keep it running.\n\nAt least Amazon Local canceled our voucher without any trouble.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "A hidden gem in Bernal Heights! The mole, the tortilla soup, the huevos rancheros - every dish I have ordered has been amazing. It is great to choose your style of eggs on the brunch menu. Delivery is on-time and the food is still warm when it arrives. I highly recommend this delicious Mexican food joint!", "author": "Melinda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Best huevos rancheros in town! Owner is always there and super friendly, the rancheros come with quesadillas to dip into the mix and avocado on top, so good.", "author": "Cameron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-13", "description": "I ordered steak ranchero and chicken enchiladas and guacamole. Guacamole was the best thing. I stopped eating afraid of what my bowels might be like. It was like an expensive TV dinner. Not really worth the price... A bit disappointed...", "author": "Laura K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-08", "description": "Service was slow and food was bland, greasy and low quality. Definitely not deserving of 4.5 stars.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Every single bite of every single dish was delicious. It's all made by hand, fresh to order. \n\nWe ordered guacamole, sangria, cheese enchiladas with green sauce, sopa de 7 mares (seafood soup), chilaquiles con huevo with green sauce, and the seasonal vegetables sauteed in garlic. \n\nI was moaning with pleasure like a fucking weirdo after every bite. You know how you take a bite of something really good and you're like \"MMMMMMM\"? Well, I did that for about 60 consecutive bites while my girlfriend tried to act like she didn't know me. \n\nAfter the meal, my brain was flooded with endorphins to the point where my girl and I were giggling like schoolgirls in a cheesy anime movie at every single stupid joke we made; the food was basically a drug.\n\nI highly recommend this place and will definitely be back.\n\nPro Tip: Try the green sauce. It's waaaay spicier and tastier than the red sauce-- the mark of any good Mexican restaurant!", "author": "Jay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-04", "description": "So good! Our whole family went for Sunday breakfast - 7 plus the baby. Everyone raved about the food. It was truly superior. The phrase \"home cooked\" was coined for this place - all the dishes tasted like someone made it just for us in their home kitchen. \n\nThe owner and other people were welcoming and friendly. \n\nA new regular spot for our family for special occasions - like whenever we want fresh, straight from the kitchen Mexican food! Amazing!", "author": "Paul R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "This restaurant is one of the most Authentic Mexican restaurants i've had here in SF !!!!  It is amazing authentic food  is very fresh and hand made food . I had  chilaquiles con huevo  it was amazing !! in a green sauce, The green sauce  is very  concentrated very aromatic  delicious!!! People should give this a try! .You will  be transformed to the capital of Mexico City  When you eat the food. I dare you to try it  !!!!", "author": "Juan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "I stumbled into Chico's because of a Groupon, and I have to say that the overall experience of this restaurant was one of a kind. It's a small establishment that would be easily missed, but they have friendly staff, and I've been exposed to new foods I've not had before, and I grew up eating Mexican food. To top it off, I seldom order straight from the menu, but they have a number of items that I found delicious just as is without modifying the my order. This is rare for me, and I have to say that the nuance of such a quaint place with great food is quite welcomed.", "author": "dAvid s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-07", "description": "ugh lame drove over to use my Groupon and they were closed at noon on a Monday their website and Yelp and Google said they're supposed to be open at that day/time no explanation posted why closed. Too bad food was good first time I visited but I can't stand flakey restaurants :\\", "author": "Raoul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "This Restaurant is truly authentic! The owner and chef \"Chico\" creates a casual comfortable classy dining experience . This restaurant was formerly known as Olivia's with the same owner. He changed the name and adjusted the menu however the flavor service and quality has remained . I couldn't been happier to have found this establishment ! Ii had the freshly made beef huarache it was fabulous !! The beef was marinated throughout on a bed of pico which topped the freshly fried bean filled huarache ... Run to this place and try everything !!", "author": "Vetoli B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "Some of the better mole I've ever had. The (blue corn!) tortillas seemed to be home-made. Salsas were very good. I'll definitely come back.", "author": "Joe O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Just ordered through grub hub and it was amazing. As  previously stated,  Mexican food delivered is hard to find! Now I don't have to!  Get the guacamole - huge portion w chips and salsa!", "author": "Deb D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-29", "description": "Just tried this place for the first time and I'll be back!  The people who run it are incredibly nice, and you can tell the food is cooked with love. \n\nThey make the food to order, even the guacamole...and I have to agree with a previous reviewer that the mole poblano made me want to lick my plate...we also tried the chile verde and it was amazing - very fresh tasting with tender pork - but maybe not for the faint of heart, as it has some serious spice to it. Even the salsa, tortillas, rice, and beans were yummy!\n\nTry this place, so they can stay in business...please....", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "Chico's Grill is a hidden gem. The hamburger and chilaquiles are to die for. I am a picky eater and so is my son but the food here is awesome. The price is very reasonable. The gentlemen who took my phone order and helped me when picking up the food has great customer skills. I truly appreciate him showing me both plates prior to my leaving the restaurant and asking me if they were to my pleasing! I appreciate him caring for a customer.\n\nSo if you want good food, great service, and reasonable prices, this is a good place to eat. Today was my first visit and I don't regret it. I will be a returning customer.", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "Chicken mole was to die for!   The best I've ever had!  I'm not even a big fan of chicken mole and this one was delicious.  I believe the cook talks to the chickens to ask them to be this tender before cooking.   Organic spinach lemonade is a must have.  I would definitely come back and will recommend to friends.  Service was also remarkable.  With a little more marketing they should have a line out the door.", "author": "Vaughn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Excellent food from a very unassuming place. Who would've ever thought chicken and chocolate could go together?", "author": "E F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Well, living in the mission as long as I have, I thought I had tried all the good places... I was wrong.   This place should be on your list.   The owners come from Puebla city which is about 100 miles north from Mexico City.  The person who was kind enough to tell me and my friend a little history of this town.  Due to the nature of the weather, all the food is dried.   When the French were exploring this area to colonize the style of cooking had an influence on the food.  Both of these can tasted in the dish that I had... It was a stuffed pepper, with a wallet cream sauce.   Yummy.\n\nOh and the organic blue corn tortilla were so good, with the cream sauce. \nGreat food, great prices, and fantastic service.", "author": "William W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "We were a little skeptical but we tried Chico's with a Yelp promotion.  And are we glad we did.  The most delicious Chicken Mole.  As good as I've had in Puerto Vallarta.  My partner had Chile Verde which he loved.  They serve homemade organic tortillas with the dinner.  Fresh and warm.  Yum.  We can't wait to go back.  More mole please.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "The tortilla soup was very smooth and creamy with little cubes of soft cheese. The Mole Poblano was delicious. And the horchata was the best I've tasted. Very friendly service.", "author": "William A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "Over hour and half for delivery. Kept bumping the delivery time longer.  Didn't ordered breakfast to eat it in the afternoon.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "Flawless chile verde. Really nice owner and family.", "author": "Jackie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "Not kidding the green sauce here is amazing, it tastes like Indian curry. The spices are perfect. The chilaquiles are wonderful but I had to switch my plate with a friend who likes it really spicy because the green sauce is indeed spicier than the red sauce. So if you like spicy, get anything you like with the green sauce. It's one of the best in town!", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "This is the restaurant formerly known as Olivia's.  Went here for breakfast today, and the menu, etc., looked pretty similar to Olivia's and still pretty good!  We had Chico's (Olivia's) omelet and huevos con chorizo, both very satisfying.", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Went there for dinner and it was great. Food was excellent (tamales and enchiladas) and the service was very pleasant. Would love to go back and they let us know that they offer brunch on the weekends. Also, everything was made in house including the tortillas and great salsas.", "author": "The M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "I made a special trip out to this corner of the city just to try Chico's and wasn't disappointed.  They serve breakfast into the afternoon so I had the chilaquiles for lunch - with red sauce instead of the standard green as I don't really like salsa verde.  It was not the best version of that dish that I've ever had but definitely a strong contender for second place.  Which is still high praise.  Everything tasted very fresh and the red sauce was clearly homemade and quite delicious.\n\nThe restaurant has a family business vibe to it and the staff were really, really nice.  I want to go back and try more of their menu and fully expect to upgrade this review to 5 stars sometime soon.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-11", "description": "My husband and I read the recent Chronicle review and showed up on a recent Friday night. We were amazed there were no other customers based on the newspaper review and looking at the great Yep reviews as we loved the authenticity and tastes of the food, especially the mole poblano. We found the owner, Hilario Chico, to be a warm, delightful person who has \"stepped out\" after years of experience as a chef at other top restaurants in the city to do his own thing. So PEASE let's support his endeavors and go there even if it is not the trendy past of the Mission--its the REAL THING!", "author": "Andrea G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "This is the best place in sf, possibly the planet for huevos rancheros and other lovely dishes.  Great service and charm!! Simple but excellent.  You will not regret your choice!", "author": "reena a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-12", "description": "Used to go to this restaurant when it was Olivia's. Was concerned that it was no longer as good but if anything it is better. The owner's wife does all the cooking from scratch and the food is ever so authentic. Have been there for breakfast which is a true Mexican breakfast but recently went for dinner. The mole is divine, almost had to lick the plate, but my family also enjoyed their chile rellenos and enchiladas immensely. You might have to wait for your food to come out but it is worth the wait, the cook is making everything on the spot. It is worth giving Chico's Grill a chance, you will not leave unsatisfied with your meal and he has $4 beers, what could be better for a wonderfully tasty, relaxed, authentic Mexican meal. Enjoy!", "author": "Tenaya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "One of the best mole's I've ever had, it was just phenomenal.  Literally just repeated the words 'wow', 'amazing', and 'this is great' for the entire dinner.  Definitely get the guac to start.", "author": "Frank T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Very sweet service, great homemade dishes, quiet atmosphere.  Service is a tad slow but I'm sure that's because they take their time making everything from scratch. The spinach lemonade is amazinngggg", "author": "Mana B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-05", "description": "I tried to find something to like about this place to at least give it a second star. I went in for a late breakfast (11:30 a.m.) on a Friday. For starters, I ordered a cup of coffee. It must have been the only pot brewed that day. I usually take my coffee black and thought I  might be able to drink it if I added enough milk and/or sugar. No such luck. It remained bitter and burned, and the cup remained full with no comment from the staff. On to the omelet. I ordered \"Chico's omelet,\" which I though would be decent given the name. The meat was tough and gristly. The veggies were far from fresh-tasting. Again, I tried to mask the taste by covering it in hot sauce. With the sauce, the flavor was bearable, though the texture remained distasteful. The service was adequate, though not even average. A very disappointing experience, especially given the stellar reviews to date. Perhaps the Mexican dishes are the way to go here and I just chose poorly.", "author": "Jamie R."}
