{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "Tasty food, nice atmosphere, and pretty good price for a Thai restaurant in SF! \n\nWhy I was here // feeling the Thai on a Saturday night with the fiancée\n\nAtmosphere // kind of a hole in the wall, feels semi intimate like a great place for a date or relaxing dinner with family. Very chill \n\nFood // \nI like that my fiancée and I tried something different from our Norma pad Thai and pad see ew order. \n-crab wonton appetizer - light and crispy! Love this! \n-Tom kha - I get this soup all the time and everywhere. It's delicious!\n-chili cha cha noodles - egg noodles were a different change of pace from the rice noodles I am used to. \n- curry with avocado - I forgot the name but it's a chili cha cha special. It was pretty tasty! \n\n\nOverall // very tasty and affordable I will definitely  come back especially because they are so close to my place in the city!", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "My go-to spot whenever I'm craving some Asian food! The food is inexpensive, portions are generous, and service is quick/attentive!\n\nMy personal favorite dish here is the Chili Cha Cha Spicy Pan Fried Noodles with Beef! If you love spicy food, then you have to order this dish because it's absolutely amazing and just has so much flavor. I recently had my boyfriend try these spicy pan fried noodles for the first time and he was completely mesmerized by how good it was and why he didn't try it sooner! The Tom Kha Noodle Soup with Rice Noodles is also another favorite and very satisfying on a chilly SF night. \n\nChili Cha Cha is conveniently located within walking distance of the 24th Street Bart Station. Sometimes I'll order food here to-go, if I'm feeling too lazy to cook (which is 99.9% of the time) and getthe Pan Fried Noodles to bring home. The portions are pretty big and the noodles are able to last me 2 meals!", "author": "MyTien P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "This review is just for the lunch combination. \n\nTucked away within the Mission, Chili Cha Cha 2 offered a solid lunch combination for a reasonable price. Both my friend and I were pleasantly surprised at the amount of food (soup, appetizer, entree with rice) that came along with a reasonable price. The spicy eggplant with chicken was tasty and well-seasoned. The coconut soup was sweet with the right amount of zing. \n\nRecommendations: Spicy eggplant with chicken (medium spice was plenty)\n\nPros: Food, service, not too busy, price\n\nOkays: Not much street parking\n\nCons: n/a", "author": "Perry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Our favorite place for Thai take out. Love the Panang curry with coconut rice. So good! We usually order two and have enough food for two meals for two people. \nYou have to ask for chopsticks, they don't include them to your order if you don't explicitly request them.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Where is Chili Cha Cha #1? Well my endless streak of exploring Taquerias for Veggie Burritos for weeks on end came to a pause recently as I decided to go for some Thai food in the Mission.\n\nI went w/ the $10.95 Lunch Combo Plate. I got the coconut milk soup for my first course, fresh tofu veggie spring rolls for my second course, & for my entree ordered the yellow curry w/ tofu & veggies having this w/ some brown rice for $1 more.\n\nThe coconut milk soup was sweet & arrived first. It was quite hot so decided to have it as my last course. Shortly thereafter my entree w/ the spring rolls arrived. The spring rolls were quite alright as had plenty of veggies as was liked a salad rolled together w/ a sparingly use of tofu w/ a savory peanut dipping sauce.\n\nFor my entree I enjoyed the yellow curry w/ brown rice. I requested it medium spicy & it had just the right amount of heat. I also requested some of the hot sauces on the side yet didn't use that much of it as they hit the mark w/ just the right amount of kick.\n\nService was attentive & felt the atmosphere was relaxed along w/ being fairly quiet. The total for the meal including tip was $15.50. You can easily order a spicy noodle veggie soup or pad thai that would make a meal here less costly yet feel the lunch combination is the way to go for a feeling & healthy meal in the Mission in a fairly relaxed & quiet atmosphere. Of course I will surely go for another veggie burrito at some point yet it is good to mix it up.\n\nOf special note for vegans or vegetarians dining here know that it is quite veg-friendly here as the menu states that vegetarian items & versions are available upon request as they can make anything on the menu vegan. Substitution w/ tofu & veggies is the same price as regular menu item yet  w/ vegetarian meat it is an additional $3. \n\nI made special inquiry into what the vegetarian meat was & it is indeed vegan yet is made w/ soy & is a veggie \"chicken\". If it is indeed gluten-free I didn't inquiry yet will be sure to ask next time I come here as much as I love my beans & rice one can only eat so many veggie burritos before having to switch it up changing paradigms like a chameleon like the late greats Prince & David Bowie.", "author": "Shane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "One of my Lyft passengers told me about this place -- I'd never heard of it, and I LOVE Thai food.  I can't go everywhere my customers tell me, but a few of my favorite Thai places in the city have been letting me down of late so thought I'd take a chance on this ... and it was wonderful.  Some of the best Thai food I've ever had in the city.  Chicken Satay, Tom Kha Khai, Pad Thai, curries, all excellent. Chicken Satay is worth another mention as it is the best presentation of it I've ever had.  Instead of separate bowls, they put the chicken skewers (cooked perfectly) directly into the peanut sauce, which has been poured on to a rectangular plate, and at one end is the traditional cucumber & red onion salad in sweet sauce -- all those flavors together are amazing!  Serving staff is the nicest and the interior, although nothing fancy, somehow has a calming effect.  I love coming here, I love eating here.  True comfort Thai restaurant.\n\nUPDATE 8/18:  since the original review I have been back here several more times and there have been more items to love, although a few not as much.\n\nThe Sweet Pumpkin Soup is ... amazing!! ...  but ask them to use steamed tofu, not fried. And Cashew Nut Chicken is very good.\n\nDishes that surprisingly didn't do as much for me: Peanut Noodles (def skip), Pot Stickers ('ok'), Pineapple Fried Rice (good, but not of caliber of other dishes, had better), and Panang Curry.  I'm surprised about the Panang because their other curries are amazing, but it has a different flavor than I'm used to, don't love it -- like it better at one or two other places.\n\nAlso, the Tornado Beef, the only dish that uses flank steak cut into chunks (other dishes use a different cut of beef, which is sliced), and which is a gorgeously presented dish and has a nice flavor, I found the beef to be a little tough.  I had expected it to be like stew beef where the chunks come apart at the touch of your fork and is so tender -- but, alas, no.  (Ironically,a similarly named Thai restaurant called Cha-Am, on Folsom @ 3rd, does an amazing Panang with stewed beef, although that's the only thing good they do -- Chili Cha Cha is much better in all other respects).\n\nAlso, as I said earlier, Pad Thai is very good, although I should add here that they use the Thai noodles for this that are more like vermicelli, very thin, and so it tends to clump.  Some other restaurants use a noodle that more resembles linguine, which I feel is a better choice, doesn't clump as much and has a chewier texture that I like.  But it just depends upon chef's preference (or your preference) on that one -- it's still tasty here -- although, like the pumpkin soup, I'd ask for the tofu steamed, not fried.\n\nBut this restaurant is SO good on its other dishes, there is no need to take any stars away -- and some folks may like what I don't (Panang seems to be very popular here, despite how I feel about it).\n\nI am still coming back again and again when I need my Thai food fix!\n\nUPDATE 8/28/18:  Tonight when I got up to leave the restaurant I noticed two young women sitting in the one booth table Chili Cha Cha 2 has (the nicest place to sit in the restaurant), and not only did they have their shoes off, including no socks, but they had their legs curled up on the seat, with feet touching the seats.  Now COME ON, people!  That kind of behavior is just way beyond appropriate, complete lack of respect for the employees and the other customers, and just plain rude.  This is a restaurant, not your damn living room.  Of course, the wonderful ladies who work there were being their usual polite selves and said nothing.  I was so close to doing it for them, but bit my lip so as not to make a scene as the place was packed.  But SO close...", "author": "Merrick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Ordered takeout last night. The food was delicious, the spice levels that we requested were all honored perfectly. And the food was ready to go on time! \n\nI also appreciated how they didn't automatically add plastic utensils to the bag and asked if we needed them first. (Reduce, reuse, recycle!)\n\nWould definitely order takeout again.", "author": "Nani B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Chili ChaCha 2 is our go to for delivery. Great flavors and reasonable prices compared to other options. Lots of vegetarian choices.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "Great find! I had seen this place for years but never thought to try it out until recently, when they were the only place in the area that was open late. \nI've been back two times since and have not been disappointed. The place is small and always busy. The menu has all of the usual Thai favorites like, fried noodles, curry and stuff fries. \nIt's not the beast Thai food in town but the prices are great and so is the food quality. Great for take-out.", "author": "Antonio W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "The food here was really good and the service was excellent! The ambience of the restaurant was very cozy, and it is conveniently located about a 3 minute walk from 24th street mission BART. We were seated and given menus as soon as we walked into the restaurant. For a Friday night the place wasn't too crowded, which was nice. Our waitress gave us enough time to look over the menu and then took our order. The food came out pretty quickly, which was nice because we were really hungry! \n\nWe ordered the fresh spring rolls as an appetizer, the spicy chicken basil, and the Thai spicy pan friend noodles. All three dishes were very tasty - I highly recommend the Thai spicy pan fried noodles out of all three dishes. You have to order rice separately, but jasmine rice is less than $2 which is nice. Overall, I thought the prices were very fair and I was very satisfied with the food.", "author": "Rithika V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Good food, the tom kha soup had lots of chicken in it. I like that they have coconut rice. Nice place and good service.", "author": "Denise G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Wasn't sure how I would like this place but noticed it had 4 stars so I went ahead and got a table. Ordered the drunken noodles with chicken-wasn't expecting broccoli on the plate. Something was really crunchy but was small-not sure if a chili flake which became annoying after awhile. Liked the rest of the veggies and flavors.\n\nI noticed a lot of folks came to pick up their orders so it seems pretty popular.\n\nI would order here again.", "author": "Summer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "I absolutely love Chili Cha Cha! It has become my favorite Thai spot in SF. My go to is the yellow curry, and I also enjoy the veggie spring rolls. Everything I've had is delicious!\n\nThere are plenty of vegetarian / vegan options and the servers are very accommodating to dietary restrictions. \n\nThe service is great. I have ordered pick up or delivery three or four times, and each time it has been early by 15-30 minutes! That never happens! \n\nI strongly recommend Chili Cha Cha if you are at all considering it!", "author": "M P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-17", "description": "The place can be inconspicuous but they have a sign out front. It looks small on the outside but is actually roomy. There are tables along the sides of the restaurant. So the side that ends with the wall feels like a long bench filled with pillows, while the other side is just chairs. \n\nThey have good Thai iced tea and coconut rice. The coconut rice is 2.50,  just .55 more than the plain rice. I obviously opted for the coconut. The sticky rice might also be a good option. The main courses we got were the namesake with duck and a chicken dish. The duck is really good with the skin attached. But all the food are so salty... I drank so much water, tea, and ate a lot of rice. It feels very much Americanized. I'm also sensitive to salt so it didn't feel like that good of a choice for me.\n\nI haven't tried the dessert here or any of the curries. But from what I had, I feel the food is just too salty and Americanized for me.", "author": "Lana W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-18", "description": "Great curry. Pretty rough phad thai, mind you this was take out, but the flavor came up short of others.", "author": "J. Bing K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "We went here to get some to-go recently and the food was fantastic! \nGot the pineapple fried rice and green curry with tofu - not very spicy but very flavorful \n\nLoved the sticky rice and mango as well, usually I like only the mango part but their rice was great.\n\nParking for a few minutes was easy  to go pick up food so thats a plus!", "author": "Anju J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "Had my first ever food poisoning from the food here. \n\nCoworker and I ordered food for lunch via Eat 24(beef pad kee mao and shrimp fried rice), and around 1-2 hours after eating I started feeling nauseous. I then checked in with my coworker and found out that she began feeling ill after consuming the food as well. \n\nMy coworker called the restaurant seeking a refund but they were quite defensive and unprofessional. It took a bit of negotiating back and forth but we eventually did get a refund from Eat24. My coworker seems to be ok now but I had a full 1.5 days of restless bathroom visits.\n\nIt seems like this isn't the first time the restaurant has caused food poisoning according to the previous yelp reviews. During the phone call, my coworker had brought up this issue and the restaurant tried to cover it up by saying that whoever it was did not report about their food poisoning quick enough and so there's no proof that it was caused by their food or that the person was just trying to get a free meal? \n\nAll in all, before you choose to step in this restaurant, I'd just advice you to proceed with caution. Also, food poisoning aside, I've definitely had tastier and more authentic Thai food else where in the city too!", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Always friendly and fast and the curries are amazing. My favorite is the green curry but I get the yellow and panang too for variety. Also an excellent tom kha noodle soup.\n\nI mostly do takeout, and would caution that it's a very unfancy place in terms of the vibe -- great to eat in with a friend, not so much if you're trying to impress.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-31", "description": "once a #firstandlastdate freaked out when i inhaled my whole place setting chick was like \"did you get enough to eat?!\" #lolmybad\n\nn some other chick i scared off bc i'd just finished a marksmanship exam that afternoon. guns muhfuh.\n\nowait those were the same woman.\n\npshh but w delivery i can do shhh like devour 3 entrees in one speedmeal & dgaf.\n\n(^_^) Ginger Chicken\nvery aromatic n flavormatic\n\n(-_^) Garlic Duck\ndidn't taste any garlic, duck so umami\n\n(-_^) Larb \"Salad\"\ndon't trip more meat than vegs\nfunky tang taste chicken\n\ndelivered in an hourish, not bad for 3 dishes.\ni'd order again in a nitetime hanger attack.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "I was so looking forward to this but so disappointed. I ordered the panang curry with prawns and the duck. The curry was watery with no depth of flavor and the duck was pure fat. Not sure about the other positive reviews? Millennials with undeveloped palettes?", "author": "Micah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Normally I would rate this place at a 4* but since it's the restaurant that witnessed the beginning of my lovely boyfriend & I, it gained a 5 star from me for being \"where our love started\" \n\nI've been to a lot of Thai places in San Francisco, the name Chili Cha Cha didn't come out to me as a Thai place until a friend of mine pointed it out to me once and on my first date with my bf, we stumbled into this place and tried it for the first time.\n\nI love this place for 3 things: close to my house, cheap & tasty. I'm sure there are low stars comments out there but people had different experience. \n\nMy go to dish: Spicy noodle nooooom", "author": "Thao P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-10", "description": "Chili Cha Cha 2 (does anyone know where the original is?) is a great place for cheap, tasty Thai food in the Mission. It's conveniently located near the intersection of Van Ness and 24th, and a nice spot to pick up dinner on your walk home from BART.\n\nThe pad thai, pad kee mao, friend rice, curries, spicy basil chicken, and tom yum are all solid and nicely priced. It certainly looks like a hole in the wall, and you'll get maybe one bar of reception maximum when you're eating here, but the service and speed of the kitchen are excellent.\n\nGreat place for a quick dine-in or takeout!", "author": "Tim X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-25", "description": "Because of a lack of good Thai restaurants within delivery distance I have tolerated Chili Cha Cha for the last few years.  But last night's delivery cannot go un-commented upon.\nIt's bad enough that they use frozen vegetables from a bag (which are easy to identify by the zig-zag cut, see for yourself), but they are simply not even bothering to cook the curry anymore: Diluted yellow curry sauce (also from a bag?) add frozen veg, throw in some of those pre-made fried tofu cubes, barely heat it up, send it out the door.  I understand that restaurants are difficult, but you just have to cook it.  No way around that one.\nThe carrots and potato chunks were cold and tough. The cabbage was plentiful, and almost crisp.  Tofu cubes: cold and mealy.  It was about 50% potatoes, some carrots, cabbage and tofu cubes.  I didn't find any other vegetables in this veggie yellow curry.  The sauce was lukewarm and bland.  (I make my own Thai yellow curry from various curry pastes available in stores, and all of them have more flavor than this.)\nThe pad thai, I suspect, is probably also pre-made: sauce from a jar, perhaps?  Boil the rice noodles, stir in the sauce, five pieces of frozen broccoli, five pieces of pre-made fried tofu cubes - don't bother to cook the veg and tofu, they'll get warm in the box on the way.  \nFinally, make the pad thai right away then wait 30 minutes before warming up the curry so it is good and dead by the time it arrives.\nThis place started out halfway decent but has steadily become terrible.  Can't ever order from here again.  Given that I have ordered from here about fifty times in the past five years, I am very suspicious about the positive reviews of this place.  It is very much the worst Thai Restaurant in the city, and that is saying something.", "author": "Jasp R. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "Today we had dinner here, the waitress is ok, the restaurant atmosphere is very good, my boyfriend and I ordered a special lunch plate, and a  dish of Fried noodle. The plate are very big, but the food are not enough much. Its very difficult to find a parking space. Generally speaking, the restaurant is very general. Basic Thai food is not standard.", "author": "Yingying C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-14", "description": "The good news - their food is really good! \n\nThe bad news --  if you're ordering it on Grubhub or a similar delivery service, it takes 90+ minutes to get it, if not more! \n\nI won't be ordering delivery from here ever again...\n\nMaybe I'll go into the restaurant someday because clearly, they have good food.", "author": "Delilah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "We love Chili Cha Cha 2!  Some of our favorites are the green curry, yellow curry, and vegetable noodle soup -- but we have truly found everything we've ever ordered to be excellent.  Thank you Chili Cha Cha 2!", "author": "Amy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "dope.\n\nTry the coconut fries. I was pleasantly surprised. I didn't think they needed the dipping sauce they came with.\n\nI also tried one of their sweeter curries. Pretty high quality standard fare. \n\nI was happy with the overall quality of the food and the quick delivery time.\n\nthanks for the wonderful dinner guys!", "author": "Taryn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I was craving Thai and my partner was craving Mexican. We stopped by Taqueria El Farolito around the block so he could get his massive burrito and then came by here so I could get my Thai fix. We were worried they wouldn't let us bring outside food in, but the hostess graciously let him eat it in the restaurant, which I appreciated. I got the pad kee mao/drunken noodles, medium spice, with chicken. I liked how it wasn't extremely greasy and had just the right amount of spiciness. There were plenty of veggies (bell peppers, baby corn, basil, onion; I opted out of the mushrooms) as well as chicken and it hit the spot. Price was very reasonable and service was quick and attentive.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "I was craving Thai food for days and this place did the trick!  I had the pad thai with chicken.  The portion was pretty big so even though I was starving, I still had leftovers to take home and make another meal out of it.  Prices are very reasonable for San Francisco.  Most dishes are under $10.  Would definitely come back in the future if I'm in the area!", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-25", "description": "I ordered the chicken with fried rice and I ate this for lunch . I work wright down the street. when I went home I was real thirsty then I started to throw up and Diarreha for 3 Days", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "I've been looking for a decent Thai place for a few years. My old place kinda went under.  Tried this place and it was amazing!  \n\nCrab Rangoon was fantastic! And the tom kha soup was delicious.   Also has the BBQ chicken over fried rice and it was wonderful! \n\nI'll be ordering from here from now on! \n\n(And my food came quickly!)", "author": "Amie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-24", "description": "Good Thai food with fast service.\n\nTry the Pad see eew. The dishes tend to be very mild so ask for something a little spicy.", "author": "Vijay K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "The salmon with cilantro sauce.  Don't get me started, this place is amazing and has crazy yummy food.  They also have ice cream which is a very important thing in life to have.  They're open late and the neighborhood is so freaken cute!  Go here!", "author": "Marc R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Chili Cha Cha 2 packs in the Thai taste at a bargain price ($10 for a generous portion of any noodle dish). While not the best Thai food I've had in SF, it is certainly the best value. \n\nFOOD: \n- Pad kee mao (drunken noodle) with chicken was flavorful with a higher than average vegetable to noodle ratio (much appreciated!). Expectedly greasy but not too overwhelming. I ordered medium spice, which was truly medium (perfect amount of kick for me To calibrate, I enjoy the jalapenos on her banh mi but not the burning sensation that follows). My one critique with this dish was the bark-like pepper flakes I was unable to chew. I am guessing they were fried to maximize flavor, and perhaps this issue would not arise with the \"mild\" version.\n- Honey duck was the darling of the table. The duck had notes of tamarind too and was sweet but not overwhelmingly so. Duck itself is greasy fowl, but this dish was no greasier than my noodles, and the bed of steamed bok choy it was served atop balanced out the fat nicely. \n- Spring rolls were refreshing and light--I appreciated that these were wrapped Vietnamese style (thin rice wraps) rather than the thicker rice wraps I often see at other Thai restaurants. \n- Tom kha (spicy coconut soup) was heavy on the coconut, which makes the soup mild enough for those who don't like spice. Flavor was nice, but a little sweeter than I like it given all the coconut.\n\nSERVICE:\n- Servers were incredibly attentive. I never felt rushed or abandoned. Water refills were plentiful, and I felt at ease as I was asked frequently how my food was :). The food came LIGHTNING FAST. In-N-Out takes longer to dish out my food with much less fanfare/plating than Chili Cha Cha 2 did :). \n\nAMBIANCE:\n- Cozy, laid back ambiance with warm lighting and cushion-lined walls, but surprisingly roomy within. There were ~15 tables inside that can be shifted to accommodate anything from a solo diner to a large group. Given the very short wait time (no reservation, no problem!), this is a solid place in the neighborhood great for a quick bite or impromptu group meal.", "author": "Helen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Have you ever had a duck curry so delicious, so perfectly prepared in a plastic tupperware, so quickly delivered via Eat24, that you couldn't help but order it at least 7 or 8 times in the past three months? I have - and that duck curry is from Chili Cha Cha 2.\n\nHere's the skinny:\n\n1. There is no Chili Cha Cha 1.\n\n2. The duck curry is the absolute star of the show. Maybe it's not the fanciest red curry I've ever had, but it's the one I've always wanted more of.\n\n3. I almost always order delivery, but I've been to the physical location on 24th three or four times and it's almost always empty. We've always had a great experience.\n\n4. Pro tip is to order one duck curry and one pad see ew in order to meet the delivery minimum. Pad see ew is even good warmed up the next day.\n\nHonestly, can't recommend this place enough. I've introduced at least three of my friends to the cult of the Chili Cha Cha duck curry and they've become believers. One of them even asked if we could have it delivered for the Super Bowl, and if that's not a glowing endorsement then I don't know what is.", "author": "Noah G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "Service: It was more than 30 mins after we were seated that she even came to our table... there was no water and no food till then. \n\nTwo tables were seated after us and got their food before. They seemed fairly short staffed as the place was busy and only two ladies running running around. \n\nThe food: We ordered all the food spicy and it wasn't. There was no heat at all. The Tom Kha soup was sweet and the rice was mushy. \n\nIt may have been an off night but I didn't get anything at this place that lives up to all the 5 star reviews. \n\nWith so many other great Thai places in town, I wouldn't pick this one again.", "author": "Wildeflower M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "After living in the area for 6+ years, I found that Chilli Cha Cha 2 is hands down the best Thai food in the area. \n\nFriendly service, super good food (firecracker roll, panang curry, all the entrees and pad thai made with thin noodles are hella good) and some unique chef special items on the menu definitely make this a 5 star establishment.\n\nIf you have room, get the mango sticky rice or fried banana! :P", "author": "Ami D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Solid delivery options here. I really like that the chefs are consistently able to leave off requested allergens (egg, etc) out of the delivery meal. A few dishes I have gotten from here are just not for me, but they were interesting to try. The pad see ew is one of my favs, and also the yellow curry - you can even get a side of steamed veggies if you want to really green it up. Staff is so kind they even called me one day when I didn't order side of rice to make sure I didn't forget. I'm not too far from their location but delivery with eat24 is almost always early- avoiding peak times of course. Mm I could go for some noodles right now. Hubs loves the papaya salad too- perfect for those hot sun-tember mission nights!", "author": "Coco J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Since I found this place I have ordered from here more than five times either for myself or for co-workers. I love their pineapple rice, it's delicious!! I also recommend their shrimp pad Thai medium heat, just the right amount of spice. I have ordered to pick up and also had it delivered no regrets, my order is always ready or delivered on time.", "author": "Luisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Really flavorful Thai food. Had the silver noodles and pad Thai. I'd recommend medium spicy", "author": "Adelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Really delicious, from coconut soup with lemongrass and galangal to nicely spicy pumpkin curry. Inexpensive. Unpretentious but pleasant atmosphere. Nice range of lunch options, many right up this vegan leaner's alley. Instant favorite.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Pretty good Thai food. Prices are on the more affordable end for SF with filling portions.\n\nMy bf and I ordered the chicken pad see ew and pineapple fried rice. Both dishes were delicious and flavorful. They also don't skimp on the meat as there were so many chunks near the end when we were full.\n\nService was quick and friendly. It seems like a lot of people order take out. I'd come back again if I'm in the area!", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I love this place. Been going regularly for 6 years and it's still awesome. Great place for dates. The food is presented well, the atmosphere is cozy, and it's affordable. My goal is to try everything on the menu but I often go back to my standard (pad see ew). Great vegetarian meat options.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Someone next to me said, \"the food here is so good that it makes me want to cha cha my butt off.\"\n\nI cringed...but then I tasted the Pad Thai and I am cha cha believer now.\n\nThe pad thai uses the smaller thin rice noodles, full of flavor, and has a good mix of ingredients. I opted for the entree portion as opposed to the lunch combo because I wanted more of the Pad Thai.\n\nMy family and friends have gotten the honey duck (you can catch flies with honey, but you can catch honeys by being fly), pad see ew, stir fried eggplant, tom yum soup, and coconut milk soup.\n\nEvery item has been 5/5. I'd skip on the coconut milk soup since it came out a bit too coconutty and thick for me (though some guys like it thicc)\n\nChili Cha Cha's \"medium\" is pretty spicy, so definitely order mild to begin with and just ask for the spice rack on the side!", "author": "Vi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "You simply cannot go wrong with this place. Lunch specials are magnificent - starting with a creamy sweet coconut soup floated with crisp veggies. I dream of this soup. My favorite is the honey glazed anything, served with coconut or sticky rice. Their thai tea will keep you up all night, so beware :) :) :)", "author": "SisterMable S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Ordered one of their pan fried noodle dishes, the Pad kee mao. It wasn't spicy as described. Maybe you have to ask for them to make it spicier? But it was really tasty! The flavors were spot on, and the beef was well cooked. Also had some of the crab rangoon, which was spectacular! I'd highly recommend getting it.\n\nThey're also open super late, which is awesome.", "author": "Jen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "We love ordering delivery from this place! Their dinner portions are large quantities of delicious food. The delivery is also swift and prompt. We have ordered food over 5 times so far, and am sure we will many more times.", "author": "Akhil K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "My 2nd time this week ordering delivery from here through Yelp.  The food is delicious I've ordered pad see ew and pad Thai from here in the past and it's very flavorful.  Recently I've been ordering the chicken Basil dish with a side of jasmine rice and my man loves it.  I usually get the honey duck with a side of coconut rice.  The only reason why I took off a star is because I feel like they don't give a lot of food and it may be different if you eat in the restaurant as opposed to delivery but the food taste great.  I'd probably order again next week because its free delivery.", "author": "Lennie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "Probably my favourite spot for Thai food in SF. The pad Thai with shrimp, spicy eggplant with chicken and spicy basil chicken are my go-tos.", "author": "Arka G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-17", "description": "If you want to be yelled at and hung up on after your order is wrong you should for sure order from here!! After a large order of $140.00 the order was late and items were missing. I was told that I ordered them wrong and that is was my fault. I asked if I could order those things that I apparently ordered wrong, as who eats curry without rice? I was told I ordered it wrong and was hung up on. Contacted Yelp/Eat 24 and spent 22 minutes on hold and was offered $3.00 for my time...insert eye roll emoji here. We used to order every other weekend from this place and never had an issue. Well never again...and maybe a switch to Doordash after the awful Yelp/Eat 24 customer service.", "author": "Ariah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Super fast delivery on a weekend night! All the food was so delicious and spicy, thank god!", "author": "Malalay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "I love Chili Cha Cha--it's my go-to for a weeknight quick yummy meal to unroll from the day with friends. Crispy tofu is amazing. The only downside of eating here: I really really wish they would fix their door. It doesn't close all the way and it can be freezing if you sit on the wrong side. Plus the servers are always running over to push the door shut. Get it together, management!", "author": "Kay S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-15", "description": "Chili Cha Cha = FOOD POISONING\n\nBased on the reviews, this seemed like a great place but NOT at ALL! Within 20 minutes of eating my order (your basic thai order) I was vomiting excessively and could not eat for a day. Conclusion: Food poisoning. \n\nI reached out to Yelp to see what could be done who called the restaurant. The manager did not even apologize for the incident and refused to give a refund. And this is after I left their delivery guy a 20% tip! Poor customer service given the circumstances. I will never eat here again!\n\nThank you Yelp for understanding how to offer customer service and trying to help.", "author": "Ashley R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "Chili Cha Cha 2 is a fine spot for thai food if you're in the area, but nothing to rave about. \n\nI've ordered pickup from here a couple times and both the pad ke mao and pad thai that I ordered were available on time. The food itself was again, seeviceable and about what I would have expected for ~10 dollars.\n\nThe one time I dined in here I had the calamari appetizer and it was fairly tasty, although the sauce that it came with was not quite spicy enough for my taste.  Also, word of warning, the door does not close fully, so if it's cold out, you may be in for an unpleasent dining experience.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-06", "description": "I ordered spicy pad thai and my girlfriend ordered mild pad thai. There wasn't much flavor in either dish. The spicy dish tasted like noodles with chili paste and the mild pad thai had no flavor.", "author": "Tucker N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "The best! If you're vegetarian, be sure to ask them to hold the fish sauce.\n\nEveryone who works there is incredibly nice, the lunch special is a great deal, and the food is always amazing. The best things are the tom kha and the pad see ew.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Ordered delivery from them many times and the food is great each and every time. Always excited to try something new from the menu cause it's always been great. Thanks guys!!", "author": "Marc E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Small place, good Thai food with neat ambience. The $11 lunch plate is a very good 3-course option with coconut milk soup, pot stickers and variety of entrees to choose from. I loved Pad Thai noodles and the chicken pot stickers tasted great with the sauces. If you are seated near the door, check whether the door closes properly. It was broken at our time and everytime someone entered the restaurant, the door never retracted and we had to close it to stop the outside cold.", "author": "Ajinkya P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "I ordered the Panang Curry, Pad Thai, and Larb. Only the Panang Curry was alright. The Pad Thai was completely clumped up and tasted like ketchup yet still bland. The chicken pieces were dry and had no flavor. The Larb tasted like old cooking oil but didn't have much flavor beyond that. I won't be returning.", "author": "h o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Everything is always delicious and the prices are great! Really authentic Thai food in the Mission!", "author": "Emily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "When you've dined somewhere so much that the wait staff recognize you and know exactly what you order, I think it's about time to write a review.\n\nI have yet to find the original Chili Cha Cha, but this place is my go-to Thai restaurant in the 24th and Mission area. There's an endless supply of Mexican food around, but only a few Thai places and this is by far the best. It's recently become an almost weekly pilgrimage here, and I get the same thing every time. I should probably branch out, but eh, why fix something that isn't broken!\n\nThe vegetarian crispy rolls are my appetizer every time, along with a refreshing glass of Thai iced tea. Before I say what my entree is, I must say: everyone already gives me flak for being picky, so don't go hating on me too! I get a tofu pad thai minus the beansprouts, carrots, cabbage, and peanuts. Don't judge.\n\nIt's absolutely delicious though, and everyone has always been really nice. Pro-tip: the door doesn't close quite all the way though, so snag a table close to the back if you don't want a cold breeze coming in!", "author": "Nikhil S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-28", "description": "Pad thai was good but basil chicken and string beans w/ tofu were mediocre. Also, delivery took an hour and 20 mins considering they're only 4 blocks away from my house. I would've been better off picking it up.", "author": "Abby R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-02", "description": "Ordered delivery. Food is substandard and had to call several times to get a proper eta and it took an hour and 50 min for the food to be delivered.", "author": "Anand N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "I love Thai food, but I really love chili cha-cha 2. I don't know what they do so magically but the curries, the soups, the appetizers, all taste delicious. Also if you're vegan, they are totally able to accommodate.", "author": "Anne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Ordered for Delivery! Foods was Good! My coworkers and I loves it! Fast delivery every time!", "author": "Jan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "Average place. The pad Thai was extremely sour. I didn't receive any utensils in my bag. The lady said she would put hot sauce in my bag but didn't. The mango and sticky rice was drenched in coconut milk, so it was extremely sweet I wish they put it on the side that's how other places usually do it. I'm not impressed at all.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "Wasn't impressed. The pad thai was too sweet, had a weird taste. Larb was overly seasoned, tasted like too much shrimp paste or something else that was really gritty ( think sand texture ).  Overall I  wouldn't order from here again.", "author": "Nancy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "I've been here many times as it's close to my apartment and I've enjoyed each visit! \nI usually get the Pad Thai, which is always great, but they also have many other menu items which I'm looking forward to trying. The portion sizes seem perfect and the presentation is also quite good. The place is great for both take-out and dine-in and the prices are quite reasonable too. Overall, Chilli Cha Cha 2 is a great, reliable place for Thai food and since it's open until 11pm most days, I'm going to have many more dinners here in the near future! :)", "author": "Sahil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Best Thai food in SF! Seriously, everything I have ordered is on point. Always hot and delicious. Not fancy dancy but the food is the star. My favorites : papaya salad Extra spicy and Tim yum shrimp! Also extra spicy! Oh babyyyyy", "author": "esme R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "I absolutely love Chili Cha Cha 2. I eat here regularly and I've never been disappointed. The Tom Kha soup is the beat I've had!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "My favorite restaurant in san francisco!!!! \n The best food \nNice price \nNices staff \nMy favorite dish the pad see eew", "author": "David C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-11", "description": "I went here with my partner as we found ourselves hungry in the Mission District.  She was there for lunch a couple of weeks earlier and she ordered pot stickers with her special and instead received an egg roll.  After bringing it to the servers attention the server proceeded to tell her that she indeed had ordered the egg roll.  The pot sticker never came. \n\nOn our visit we ordered the Green Curry with chicken and the Cashew Nut Chicken.  The curry was unremarkable and the Medium spice that I ordered didn't have a tint of heat. The Cashew Nut Chicken on the other band was very good, as the cashews contained a smoky grilled taste that really enhanced the dish.  We also ordered the Fresh Spring Roll.  These rolls came to the table first and were presented very nicely with a traditional peanut sauce.  The sauce was nothing to write home about but after we each took a small piece of the roll, I didn't see a shrimp in mine.  My partner didn't either. There was tofu in the roll as was advertised on the menu but no shrimp that we could see or taste. After calling the waitperson to our table she told us that there was indeed shrimp in the roll and pointed to the reddish color on the side of several of the rolls. The lighting in the place was dim and she walked away.  I opened two of the rolls and that reddish substance was carrot not shrimp.  We left the uneaten dish on our table through the completion of the meal.  \n\nAfter we had completed our dishes the server came by and asked us how our meal was.  I pointed over to the plate with a couple of the rolls opened and unrolled and again proceeded to tell her that there were no shrimp only tofu.  She looked and smiled as she took the dish away from our table. At this point I fully expected to have this item taken from our bill.  But guess what?  They charged me.  \n\nMy partner then relayed to me her past experience when the server ( a different lady) told her that she ordered an egg roll instead of a pot sticker. She thought that it could be a language problem. I did not agree as our server repeated our order to us after we gave it to her.\n\nChili Cha Cha 2 offers up unremarkable Thai food.  From our table we could see that they do a phenomenal take out business. But for the life of me, I don't understand why as San Francisco has so many great Thai Restuarants..\n\nUnfortunatley, Chili Cha Cha 2 is not one of them.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Great Thai place for the price in the mission! Lots of options (veggie+meat, folks who like their food mild or spicy). Great portions as well, it's def my go to!", "author": "Vinay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Love the pumpkin curry and pad kee mao. It's therapeutic:):)", "author": "Bubble T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Been ordering lunch for the office... good food and nice people...curry is good and appetizers too", "author": "Arlo U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "Idk WHAT the bad reviews are about--I eat here a lot and it's delicious every time. I'll ether pick it up or get it delivered. \n\nStaff is ALWAYS super nice via phone and in person.\n\nAffordable, and everything I've ever tried from here tastes great! \n\nPad Thai, pad see ew, tom yum, tom ka, spring rolls, veggie spring rolls, yellow curry, papaya salad...literally could go on and on about the food and how it's awesome along with the staff. \nI'm pretty sure I have nothing bad to say about this place-it's my go-to for fast and yummy hot food that's close by!", "author": "Mandy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-27", "description": "Very dry beef and the duck is too salty. Overall pretty disappointing neighborhood eatery but the server was very nice and the food came out relatively fast. Tom kha was thick and sweet though and not bad at all.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Everything on the menu is delicious but they frequently get their orders wrong for delivery - not  entire dishes, but protein. Shrimp when you order chicken, tofu when you order shrimp, etc. In my experience it's been almost entirely random.\n\nThe food is all good, but if you have any dietary restrictions I would avoid ordering for delivery.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "Not quite an authentic place. I ordered the Tom Yum noodle soup and it was very Americanized with bland boiled chicken, bean sprouts, and flat rice noodles of a super soft texture. The soup was also different from the creamy, silky, spicy and sour Tom Yum. It's just a spicy broth without much flavor. But no complaints about service and if you are happy with westernized Thai food this might be good", "author": "Alex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-22", "description": "I went to have lunch here with pad thai combo. It was ok but was too sweet for me. \n\nFor the mango sticky rice was not bad. Only sticky rice too soft and too sweet. \n\nThe service was ok :)", "author": "Pinarat S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "Excellent food overall, to wit, Tornado Beef, Salmon Roll, Honey Duck, and Lamb Pumpkin Curry. Pleasant service.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-25", "description": "I. Love their fried calimari rings! \nServers should pack things that can spill and cause a mess in amp plastic bag . Packed in paper bag and made a mess.. Food was otherwise good though.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "This is my favorite go-to place en route home from BART.\n\nI've been here probably a dozen times for dinner by now, mostly dine-in, and it is an exceedingly low key (casual, but nice) dining experience. It seems their kitchen is kept busy with a high volume of pickup and delivery orders, but simple dishes for in-house dining still arrive pretty quickly.\n\nAs someone with shellfish and nut allergies, Thai food can be a terrifying prospect. This place feels safe in that they don't sprinkle gratuitous peanuts over every dish (though I do still ask for none every time, just in case), and they are very accommodating to alter your order in other ways.\n\nI order basically the same thing every time: yellow curry with chicken. I also add extra vegetables, so that you're not just eating potatoes. This gets you more cabbage, carrot, and broccoli, yay colors. Not sure if they tack on extra $ for that.\n\nCrispy vegetarian rolls are perfect to split with 2-3 people (you get 6 cross-cut halves).\n\nThai and lychee iced teas are nice and sweet and peppy (lychee tea has a whole fruit at bottom), but nothing special here.\n\nSweet pumpkin soup is really quite sweet. It is too sweet for me for a main course, and I like sweet. Maybe save it for a nuggety dessert, instead.\n\nFriends have been happy with the Pad Thai and Pad See Ew, and fried rice was another simple tasty meal that provided me a little breakfast the day after :)\n\nSingle bathroom is always clean, but a little uncomfortable to wait in line for, since it's right next to the kitchen.\n\nOh, and one of these days I will ask why Chili Cha Cha /2/. I still haven't found any evidence of Chili Cha Cha 1...!", "author": "Olivia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Yummy yummy you make me very happy. Go to place any day any mood dude and the service is on nice thanks y'all", "author": "Juñior A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "The worst!\n\nI really DONT recommend this place at all. If i can give them negative stars i would cause one star is a good rating for them \n\nAfter 30 min of submitting my order and receiving a confirmation they decided that they don't want to deliver my food.", "author": "Mohamed M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "I love to order delivery from here. Fast, affordable, delicious. I've been ordering for years and never been in the place. Funny...", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "I'm Thai, living in Seattle. On a recent trip to Sf. I visited Chili Cha Cha2. I ordered Pork Pad See Eww, Chicken Green Curry and Pork Spareribs and Sticky Rice. The food was delicious and authentic, just like eating food in Thailand.  The service was excellent. If you are in the area, i would recommend you stopping by.", "author": "Kokadoo D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-08", "description": "(3.5) I spend a lot of time around the 24th st. BART so I come here often. The food here is good and reasonably priced. The level of spice is high and a bit variable. Sometimes medium is a little spicy. Sometimes it's murderously spicy. Still, don't let this detract from the food. It's of decent quality and very consistent. This place also accepts credit cards, which is always a plus in the Mission.\n\nI typically go for the Pad Thai: The noodles are very tasty but they skimp on meats and include tofu and ~2 ounces of sprouts in even the meat Pad Thai. Understandable for a restaurant trying to keep costs down, but some customers may be put off by that. Still it's a good meal, for a good price, and their Yellow and Pumpkin curries are solid as well.\n\nStart off with mild to be safe if you're sensitive to spice.", "author": "Irina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Finally we found our go-to thai food spot in San Francisco!  We always get takeout or delivery, so I can't speak to the ambiance of the restaurant itself, but the food is consistently good.  The portion sizes are reasonable for the price, delivery is fast and friendly, and overall we've never had a bad experience.  My go to dishes are the lamb pumpkin curry, pad kee mow, and pad see ew.", "author": "Riley D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-17", "description": "I don't remember the last time I've given a one star review, if ever. However, I'm sorry to say that the food here is just not good.\n\nThis may have very well been the worst Thai food I've eaten, and I've eaten at a number of Thai restaurants.\n\nI had their lunch combo.\n\nSoup: it just seemed like veggies floating in hot coconut milk.\n\nSpicy string beans: way too greasy. Oil was all over the plate.\n\nPad Thai: it did not taste like pad Thai and had too much fish sauce.\n\nCrispy tofu: this appetizer was okay - only because it's literally just fried tofu.\n\nVegetarian potstickers: too much sauce poured on top of them.\n\nOverall, I would much rather not have eaten this food. \n\nTo end on a positive note, the ambience of the place is nice and the rice is cooked well.", "author": "Raakin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "One of the best Thai food experiences I've ever had. After moving to Orlando, my food standards may have plummeted, but the food here is legit. I highly recommend the green curry and Pad Kee Mao!", "author": "Johnny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "\"Chili cha cha = chili fye fye \" words from my husband. lol best Thai food place we've found since living in mission district. Truly love the broccoli wok and pad see ew. Always delicious. Definitely recommend coming here.", "author": "Megan I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "This is delicious. Quick delivery but I recommend calling them directly instead of ordering through eat24. (Eat 24 is annoying because not all orders go through for some reason.)\nChicken green curry is great\nPumpkin curry is great\nTasty and close by our house\nPeople there are super nice\nMmm!", "author": "Gillian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Delicious thai food.\nPrices are really good. Thom Kha soup & Green Curry highly recommended.", "author": "Ava F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "This is one of my favorite places to grab dinner in the Mission. When every other restaurant in the block serves the same Mexican food, Chili Cha Cha is a welcome relief. I like their curries, they go well with coconut rice. The portion size is just right: big enough that I go home satisfied but small enough that I can finish it. The prices are quite affordable too. 5/5", "author": "Bai L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "Whenever it gets late on 24th St, it's either tacos or... Chili Cha Cha! They are open till 11pm. I love picking up some late night noodle takeout for a warm almost-midnight-snack. Great service and friendly, whether eating in or to-go. One of my favorite dishes is something they call Suki Yaki on their menu - a warm, mild, comforting meal...very understated on their menu, but big tasty portion.", "author": "lesley f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "Probably a 3.5 on food, but a true 5 star on value. Their lunch specials are plenty tasty and a ridiculous deal. The garlic and pepper is pretty solid. The apps are nothing to write home about and probably the most overpriced part of the menu. The coconut curry soup is really good.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "This is my favorite Thai restaurant in San Francisco. I am vegetarian and prefer going vegan when eating Thai food and they really deliver. The noodle soup, pumpkin soup, fried rice, spring rolls and samosa are consistently delicious. Their service is friendly and it's my go-to place when I am in the mood for takeout.", "author": "Dipti D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "1 star edit: have eaten here twice in the last year and gotten food poisoning. \nPad Ke Mao and Duck Curry. Bad experience and won't be here again\n\n\n5 star initial review:\nOrdered: Bacon Loves Scallops & Duck Curry. Rice came separate.\n\nLet's just say it was so delicious I can't wait to get home and eat the leftovers. My mouth is watering as I type this.", "author": "Trevor M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "I came here with a friend, who comes here often. First off, this place is divy little thai restaurant in the, wait for it....the Mission, surprised? Lol. If you are a SF local you know what I mean;) \n\nAnywho, off to the real deal here, the food and service. \n\nThough we were greeted pretty quickly, we had to wait a bit before we were waited on, annoying when it wasn't busy, and it was a week night. The menu is your typical thai stuff. My friend got the yellow curry with pumpkin and chicken, I got the tom yum soup, vegetarian style (fyi-which includes braised tofu, which I would have known, I would have asked for regular tofu), and the papaya salad since my friend raved about it from eating before. The papaya salad was good, but I have had better. It was bit too marinated in the sauce and not the right flavor, something was missing. My friend liked his dish, it looked good. As for my soup, it was okay, good for a cool night in SF, but uneventful overall.  \n\nThe waitress never came back to wait on us, though the place was not busy, and it was a week night nonetheless as I mentioned before. We even had to find the waitress all the way in the back of the place to to get the bill to pay. \n\nAll in all, it was okay thai place if you are in the area and need a quick thai fix. Being a foodie, I am not sure if I would make effort to come back, since there alot of great thai places in SF to try. But I wouldn't mind if coming back, if my friend wanted to, and maybe trying the vegetarian salad. It did sound good.", "author": "Sonia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "I started going here because I had a very, very bad cold. The kind where it hurts so bad to swallow that you cry a bit each time. Someone on the internet said that Tom Kha soup helps. I had theirs. Tom Kha soup is a plain delicious soup with some interesting vegetables - some a bit tricky to chew - all of which combine to be healthy and nourishing. It's very, very delicious.  I went here every other day for 8 days, and ordered the vegetarian Tom Kha soup (large size) and it was the sweetest relief. Some other reviewer said the Tom Kha is too sweet - I hate sweet food, it doesn't taste sweet to me. Sometimes I would have a bit of white rice with it.\n\nThey also have nice fresh meal choices, aside from the soup. I love their vegetarian spring rolls - they are very refreshing and subtly flavored. The lunch specials are very cheap. But at the end of the day, I will always order Tom Kha soup when I come here.\n\nThe staff are friendly and sweet - I think this restaurant deserves a lot more attention than it gets.\n\nEdit: the Tom Kha soup no longer comes with spices automatically added. For the medicinal properties discussed above, please request spicy Tom Kha soup. \n\nAlso, I have since tried other dishes and I don't order this every time now. Their Pad See Ew is also very good.", "author": "A T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-11", "description": "This review is only for food as I ordered delivery.  I was excited to finally order from one of my neighborhood spots, especially after reading the good reviews.  After ordering, they were swift and friendly in their delivery.  Unfortunately, the meal itself wasn't great.  The samosas, made with puff pastry, were mushy and falling apart.  The papaya salad was pretty good, but 2/3 of the dish was lettuce leaving only enough for a side for 1 person.  The Tom Kha was far from authentic, but popular amongst the other reviewers - so I reduce it to a matter of taste on that one.  I won't be ordering from here again, but I'm sure they have some good stuff.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Went here on a Saturday night around 9:15. Place was fairly empty, with only 2-3 tables occupied, so got a seat quickly and great service throughout. They filled my water every time the glass was half empty. Cozy little place, and a nice casual feel. \n\nMost of the usual Thai staples on the menu, and some tasty-sounding specialties as well. Was only 2 of us and we weren't that hungry though, so went minimal in our ordering. Prices were pretty good: ~$25 total for 2 of us, though we did eat light. We got:\n- a bowl of Tom Yum, with prawns: lots of mushrooms, good bit of shrimp too, and great flavor. HUGE bowl, could easily be one person's meal, or shared between 2-4. Spicier than I expected too, as we ordered medium, but not a problem for me.\n- papaya salad: tasty, and nice lightly spicy sauce, which is sometimes drenched on and sometimes sadly absent, so done fairly well here. Presented beautifully too. \n- side of jasmine rice\n\nOverall, pretty happy with what we got, and our experience. Nothing blew me away, but seems like a great local/neighborhood Thai joint, that wasn't crowded pleasantly.", "author": "Kris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "I love this place! I order our staff meeting lunch from here and they never fail in delivering on time. The food is also great! Can't go wrong with any of their curries whether it be with chicken or vegetables.", "author": "Dean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "Pretty good Thai food for the price. I live just down the street, so I haven't experienced dine-in (takeout ftw). Quick turnaround for my orders, typically and a very friendly staff. \n\nI've been pretty happy with most of the dishes I've ordered. Expect A LOT when you order curry, though. Nice, spicy kick to most of the entrees, as well. Which I really appreciate.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-13", "description": "I'm sad.  I think I had a one-off bad experience with the food.  It seems like a nice place, clean, beautiful inside, friendly, smiling, happy staff.  Anyways, I ordered the Tom Kha soup and there was no lemongrass in it and the flavor was pretty absent unfortunately.  I asked them to add lemongrass and sent it back to the chef.  They put some sliced up curls of some type of root vegetable in there, and it tasted slightly like lemongrass but was a little different.  Some of the chunks were really hard, too, and I accidentally bit into it and hurt my tooth.  There were a few other chunks of things in there that tasted like raw turnips or something and definitely uncooked.  I really wanted to have a nice experience.  Maybe I will order something different next time.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "Bummer. Eaten here over a dozen times and always decent. Came in tonight for take out and ordered spring rolls when I meant pot stickers. They refused to waive the rolls!  I was in utter shock. \n\nIt will be my last meal from this place.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "This is best Thai delivery in town. I love how their vegetarian options come with a good mixture of vegetables. I would give 5 stars to everything I ordered tonight - vegetarian tom yum, chicken pot stickers, vegetarian pad see ew. So so good.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Did the lunch combo for $9.95 coconut milk soup, fresh spring rolls & yellow curry. Super full and satisfied! Would visit again!", "author": "Tea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "This is a perfect place to stop in for an excellent Thai lunch. They never disappoint!\n\nFor the lunch menu, you have a choice between soup or salad to start. I always get the soup, which is a variety of vegetables (carrot, baby corn, mushroom, cabbage) in a delicious coconut lemongrass broth.\n\nNext is a choice of appetizers, that come with your entree: potstickers, spring rolls, chicken satay, etc. The fried tofu was the only one I found a little boring (imagine fried tofu, it can be boring). The spring roll is basically a salad, so usually I get that to compliment the soup.\n\nFor entrees, there are a dozen or so. Typically, I'd get the spicy eggplant or one of the curries. Order \"Thai spicy\" if you want it properly hot. It comes with rice, which you can upgrade to brown or sticky rice if you like.\n\nLately, I've been working my way down the menu to try everything, and so far it is all good. You can order each item with either chicken, pork, tofu, or beef. Or for extra make it shrimp, seafood combo, duck, or seitan. Each dish seems to call for a different meat, but chicken will fit the bill for any of them.\n\nThe portions are perfect for lunch, not too much to make you overfull and tired, but not too little to leave you wanting.\n\nIf you are looking for a Thai lunch in the Mission, this is the place to be.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "Wish I could say better things, but my experience here was really \"meh\" :(", "author": "Sahana U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-18", "description": "This place makes a decent green curry, but the pad see ew and tom kha soup are fairly mediocre. The amount of rice that you get per order is also somewhat limited.\n\nI also would not order spring rolls again, there was just so much cabbage and very little of anything else. The peanut sauce that came with it was quite good though, so perhaps the satay would be a better choice.\n\nI like the green curry from here better than the equivalent from Manivanh on 24th, but I'd probably get anything else from another thai restaurant given equal convenience.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Randomly choose this spot as I was walking by. Small little spot with a casual and comfy atmosphere. Tried the spicy tai salad with beef since I wanted something light. Wow! This was tasty and medium spice as ordered. The waitress was very nice and hospitable. The price was no more the ten buck which is average. I loved the soft bench with pillow....so nice at the end of a stressful day. I will be back to try something different from the menu :)", "author": "Roseanna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "I love rating everything on a 1-10 scale.  As far as Thai food goes, I think it's pretty hard for it to be below a 4 and equally hard for it to be over a 7.  Chili Cha Cha 2 perfectly proved my theory and earned a solid 6.  \n\nOverall, the food was slightly above average for Thai.  I was with a friend and we ordered my 2 favorite Thai dishes: Pad See Ew with beef and Panang Curry with chicken.  They were both good and decent sized portions.  The Pad See Ew was a little greasier than usual while the Panang Curry could use some work on the vegetable to chicken ratio (too many vegetables, not enough chicken).  The servers were nice and attentive but the restaurant was also empty.  \n\nI should also note that they're coconut juice was delicious and had plenty of fresh coconut pieces to make this coconut lover extremely happy.\n\nI'll probably end up going back to Chili Cha Cha at some point when I'm desperate for a quick Thai meal in the Mission but it's nothing out of the ordinary.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-11", "description": "Now that Eat24 is a part of Yelp, I don't think it's out of place to review my delivery experience here. \n\nI've been a fan of Chili Cha Cha 2 and have ordered from them several times. However, lately they've been giving me estimates of 45-60 minutes on Eat24, but the food isn't coming until 75-90 minutes. I could live with this and just assume the 75-90 minutes, but the food is arriving tepid. I live about a mile away, so I can only assume that it's sitting around or in the car for 30 minutes or longer. Since I don't own a microwave, this is somewhat inconvenient. \n\nThe food is generally good, but at this point I think I have to find a different place to get my Thai food. It's a shame because they used to be fast and hot. This has been going on for a couple of months now, so I don't think it they're going to be fixing this any time soon. As of this moment, I've been waiting an hour and a half for my latest order (NO exaggeration). No sign of my food. WTF?", "author": "Adam N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-23", "description": "Admittedly I only had the spring roll but there was one piece of shrimp in it which was ridiculous considering it was $8. What a waste of money.", "author": "Xteethx B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "I like this place and they deliver which is great! Some items are hit and miss but mostly every thing is pretty good.", "author": "Maxwell L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-23", "description": "Food + disturbing experience. I've eaten here many times. Last few months the food has been better than ever, fresh and really flavorful. Came in for a quiet supper after an endless seeming workday. The tom yum soup delicious. Half way through my meal a very strange thing happened: a man walked in, fairly put-together looking but obviously really inebriated. Waitperson asks what she can do for him. I look up from my plate as he blurts out ' I want some wine'. Now its obvious the guy is f@cked up.  She just steps aside and goes toward another table. Guy walked through the restaurant, straight at me. I'm sitting on the bench, table in front of me, by myself. He leans in, grabs my glass of wine while saying loudly 'can i have this?'. I was startled, said no, that's rude, you have to go. He leaned more. I stood up. He walked out. Never did a waitperson or other staff ask if I was ok, offer to refill the glass he spilled or anything else. BTW I'm an older woman and probably the smallest person in the place. Weird. Not sure I would go back.", "author": "Inez I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "We get take out all the time. Its terrific. Great dishes are toronado beef, spicy eggplant, and chee choo talay, amongst others.", "author": "Fraser H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "This is my go to, no-frills Thai place for take out. It's a very unassuming place (so I wouldn't try it for a first date), but the food is extremely good. Great for big groups if you're looking for a quieter spot that you can take over.\n\nPumpkin curry is EXCELLENT. All the curries are, actually.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "I absolutely love this place. Very homey and friendly staff.\n\nMy usual: String bean beef, crab fried rice, pad sew ew, bacon wrapped scallop and dressing prawn. All killer dishes, especially the crab dish.", "author": "Kelly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Best Thai in the city! They are extremely nice, care about their customers, and serve a lot at an affordable price. Their great quality and Thai favorite keeps bringing me back. They always know what to suggest in case your not sure what to order and it's a beautiful and small restaurant. Small, simple, sweet and they continue to be my favorite. Big and bold flavors keep me coming back multiple times during the week.", "author": "Bay Area S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-22", "description": "Pretty decent Thai food-- not the best I've had, but good. Had the coconut soup (would have liked a bit spicier, but that's a matter of taste maybe) and also tried their signature noodle and pad see ew dishes.  Think this place fulfills any Thai craving satisfactorily.  I wouldn't go out of my way to eat here in terms of taste, but would potentially return.  Good customer service, very fast, and decent prices.", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "My favorite place in San Francisco. Tasty food and drinks,  awesome stuff, you always can find place to seat inside. And if you are the lucky one and living or working close by to the place they have $10 business lunch menu. Thank you guys for being so awesome!", "author": "Olga N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "One of my complaints about ethnic food in San Francisco is that it's been hard to find places that will serve spicy food to white people. Admittedly, part of the problem is white people who don't like spicy food, and I must ask those people: \"WHY THE HELL ARE YOU ORDERING THAI FOOD? OR INDIAN? GO EAT AT DENNY'S, FOR CRYING OUT LOUD!\" Okay, having gotten that out of my system . . . I've been ordering from Chili Cha Cha 2 for a few years, and I've always been a fan of the food, but lately they seem to have upped their game as far as spiciness is concerned. The last time I ordered from them, I specified \"Thai spicy\" for the heat, and boy, did they deliver. The flavor balance was still good, with the garlic, basil, and umami of the beef coming through, and I found myself blinking through a sudden haze of endorphins and possibly tears . . . of joy, I assure you.", "author": "Bitter J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-07", "description": "After confirming my ETA for an online order, I arrived to find they hadn't even started. They quoted me a second ETA, so I came back to stand around and wait 15 minutes past that second one when another customer showed up complaining of the same issue. \n\nAfter walking across a sidewalk reeking of urine stench six times, I had my food. I opened my spring rolls to find a thimble sized sweet and sour sauce, which made it 1/2 way through my first one of three. My tofu pad Thai came without tofu, and the faux chicken on it was like eating straight salt. \n\nIf they'd been honest about the wait, remembered my tofu, and not chinced on the sauce, this would've been a five star experience. (I don't fault them for the salty fake meat, just not worth $2.)", "author": "dAvid s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-20", "description": "Had never eaten here before and ordered delivery through Eat24/Yelp. Food arrived earlier than expected which was great. Fish cakes were good, but nothing amazing. Praram was kind of lackluster and runny with a bitter peanut flavor. Just tasted a bit off.  Basic Thai offerings. Not worth repeating.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Wow...their food is really good. My fav is the yellow chicken curry.", "author": "Til B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "Wow, this is the best Thai food I've ever had.\n\nVeggie potstickers have an incredible sauce, the Thai iced coffee (ask for coconut milk!) tastes like a dark chocolate dream, and the pumpkin curry was spicy and delicious. This is an uncommonly good restaurant.\n\nIf you're a vegetarian and you haven't been here, you're only hurting yourself.", "author": "Maxx B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "4 stars because they have the dopest lunch special. I go every Saturday for lunch, and while it's not the best thai food, it's one of the better thai places I've been to in SF and again, the dope lunch special....", "author": "Rhea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "Meal arrived in the time frame indicated. The food was fresh and tasty upon delivery.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "I came here on a Saturday night. Was able to sit immediately, about half the tables were filled, and the service was fast and attentive. I started with some ginger tea and followed with the Duck Curry with Brown Rice. Oh goodness is this a fantastic dish. A mild level of spice, a very complex mixture of sweet and succulent flavors. And it's really a great deal ($11 for a five star Thai dish in a nice atmosphere? Hell yes). I definitely will be back!", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Yes, it is surprising to see a Thai restaurant tucked away in a Latino neighborhood. Our waitress Noi was such a delight! Not only did she answer my questions about where they source their baby corn from, she also diligently suggested substitutions for my curry.\n\nMy husband and I started with the coconut milk soup, which was both delicious and surprisingly flavorful. We got the fresh spring rolls which came with the peanut sauce; the spring rolls were bursting with flavor and the peanut sauce made the perfect accompaniment. The green curry, although a bit watery, was perfectly simmered with my choice of veggies; the coconut rice I ordered with it was not as coconut-y as I'd expected (maybe I should have stuck with the usual jasmine rice?) My husband got the Penang curry with chicken, which he claimed is the best he's ever eaten. Needless to say, we left stuffed and smiling.\n\nCan't wait to come back here!", "author": "Divya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Consistently tasty beautiful dishes. Fresh ingredients prepared spicy and delicious.  Friendly and attentive service. I highly recommend.", "author": "Antonio D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Loved it! Big portions for a good price and the food is super good. I used to work at a Thai restaurant, so I can be pretty snooty and the food here is definitely on par. I live in Seattle and wish that I had this restaurant next to my house. Also my friend is vegan and they had lots of options and were super accommodating!", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "I've tried a lot of panang curries I've the years - chili cha cha 2 has one of the best.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "I order from this place a lot and they do vegetarian curries really well. They have multiple options such as vegetarian meat (seitan), tofu, or mixed vegetable varieties of their curries. Their curries are amazing and I recommend the Green Curry because it comes with eggplant that carries the flavor well. I frequently order from them, and recommend their fried rice (it's a bit on the oily side), and their panang curry as well.", "author": "Arjun M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "This is my go-to Thai place, but that mostly has to do with proximity and the fact that I can place a to-go order online and it will be ready by the time I can walk there.\n\nI usually get one of the curries. The yellow curry and pumpkin curry are my favorites so far, but pay attention to the fact that they don't come with rice and be sure to order that separately. I usually get the coconut rice, which gives it a slight sweetness.\n\nI also tried the peanut noodle the other day, which was great, although I wish they would make the same dish on a bed of rice rather than noodles. (I haven't tried asking for this off-menu, but I may try next time.)\n\nThe only thing I've ordered here that I didn't like were the steamed veggies. I ordered them on the side once, but they come completely unseasoned, so they're very bland.\n\nOverall, a solid Thai place.", "author": "Adam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Delicious, legit Thai place with an 11 pm close time a block from my house - AMEN!\n\nThe frikkin green curry paste fried rice was delicious!\n\nA new standard place - so psyched.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "I called and said I would be eating from the restaurant. On arrival, my salad was already placed on a table. but I requested to be seated in a different spot.  The waitress then said, \"Next time when you order, tell us where you want to sit so I don't have to move things twice.\" \nShe said it rudely and she was clearly angry. This made me feel like getting up and walking away but my food was already in front of me so I stayed. If this is how customers are consistently treated, there is a lot that needs to change at the restaurant.\n\nHere is my suggestion on this:\nConsider waiting for the customer to arrive and once seated, bring the food over, rather than having him call and say, \"Get me the fourth seat to the left of the entrance.\" Also, there is a chance someone might already be taking up that spot or anyone could arrive and sit there shortly after the call has been made.", "author": "Martin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Chili Cha Cha 2 is walking distance from my house, so I tend to frequent this place. Their service is always polite and welcoming. I usually order Tom Yum soup and they pay attention to any requests I might have. While the Tom Yum soup and Chilli Cha Cha Fried Rice is really good, their curries are just alright.", "author": "Gayathri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "(+): went back and had the chili cha cha fried rice, the ingredients were fresh and delicious. \n\n(-): i asked for \"really spicy\" because i'm constantly disappointed by spice level at most thai restaurants. chili cha cha was all like, \"you got it, bitch.\" now i have fried rice that i'm pretty sure is explosive.\n\n(0): go here because the food is good, but be careful what you wish for. game set match.", "author": "Siva M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "Loved the the service, very nice waitress. The good was delish, had the green curry chicken, and potstickers abd the banana and ice cream for dessert.", "author": "Claudia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "My office has ordered from here about 5 times now and I'm consistently amazed at how good every dish is. It's not just tasty, there's something special about their dishes when compared to your average thai restaurant. It just tastes like actual thought and effort has gone into the making of every dish here - a rarity among not just thai restaurants, but restaurants in general.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Best place to get thai food in SF!  (Other than Farmhouse Thai Kitchen, which is amazing but a little pricier.)  Love the curries, the veggie basil thing, the papaya salad, and the spicy mango salad.", "author": "Erin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-15", "description": "I love Chili Cha Cha 2 and I eat here/get take out at least once a week. What happened today left a very bad taste in my mouth and I may never return which is unfortunate since the food is delicious. \n\nThe place is down the block from my house, ordered in via Grubhub, left gratuity on credit card and waited for items to come. Delivery woman shows up and harasses me that I didn't tip enough, shoves food in my hand, and storms off. She also left off some topping ingredients for my papaya salad and no utensils. \n\nIt's tax season, we're all on a crunch, sorry I didn't tip 15%+ for delivery that is 0.2 miles away but really!?!?! This literally is the hang out spot with my uncle once a week but we will be taking our business elsewhere. This is the only time I've tipped someone and gotten pretty much the finger for, which is ironic because looking at my last 6 grubhub orders are from CCC2.", "author": "Sara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "So so good. Tastes like we're back in Thailand. The curries were amazing. The pad kee Mao. Omg. Nom nom nom.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-21", "description": "Unfriendly waitstaff and sickeningly sweet food (tom kha and one of the curries). Nope. No thank you.", "author": "Josie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "love this place!!! affordable and great customer service!", "author": "Raquel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "Gone back several times now because it's close by and have had great experience. Reasonable price and tasty food. They finally improved on the rice...now it's more like on a dryer side...love the pad see yew and larb. Great neighborhood joint!", "author": "Xiu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "My cousin lives nearby here and suggested this place for lunch. I'm on a special diet right now, no sugar among other things.\n\nThey were able to easily take the sugar out of the stirfry sauce for the green beans. And it was still completely delicious! Also, they had brown rice. Which was important since I'm not eating white rice at the moment.\n\nWould definitely enjoy eating here again when I'm in the neighborhood. The atmosphere was nice. It wasn't crowded on a weekday for lunch and it was easy to get in and out.", "author": "Mimi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "I love this place. My bf and I eat here almost every week. I think we've tried about 80% of the menue at this point. Good service, they recognize us, always very good and consistent food.\n\nBest story I have is that we ate there once and I left my hat. We didn't go back for almost a month due to travel, and I couldn't figure out WHERE I had put my poor hat. I looked under the bed, in our couch, in my closet, everywhere. We stroll into this place after our long haitus, and before we can even sit down they present me with my long lost buddy! Horray! Thanks for remembering me chili cha cha!", "author": "Halley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "Last Tuesday. My daughter and I are from South Bay and wanted to try something new. We were pleased with the vegetable pot stickers with Thai beer. I had the tofu green curry with brown rice on the side. Nice staff and comfortable surroundings.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "I love this place.  Great, reliable food, and fast delivery.  I love the Tom Yum Soup ...", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "This is one of the best Thai places in the mission. The food is great and fairly priced. The atmosphere is relaxed and casual. Highly recommend starting with the chicken pot stickers and a bowl of Tom yum soup. The Pad see yew is also a favorite. Highly recommend.", "author": "Allen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-08", "description": "Reasonable prices ($50 for two people with an appetizer, a glass of wine each, and an entree each) but the food was just ok. Good option if you're in the area and looking for something affordable but I wouldn't seek it out. I had the Spring Rolls and Pad Thai with chicken and neither was bad or remarkable.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-28", "description": "Finally! A Thai Restaurant on my street! And a good one too! It's always a good sign when you hear the staff and cook speaking the language of the cuisine they're cooking. I tried their specialty of Yellow Curry with Pumpkin which was a delicious twist on your standard Thai Yellow Curry...essentially swapping out potatoes with pumpkins. Spicy n' creamy!\n\nI also had the peanut chicken fried rice after work one night...wasn't too bad...probably would've been better if it was eaten with another dish. \n\nThe food was pretty good but the desserts were divine! The fried banana with ice cream especially made me loopy. I could eat that all day and all night (and die of a coronary...but with a smile on my face).\nKhop Khun Khrap/Khaa (do NOT make that into an Acronym)\n\nThey do not serve alcohol at the moment but have applied for a licence to serve it...so it will soon. Spicy Thai food and lager! (Singha) Unbeatable combo!\n\nThe decor is decent and Thai themed. (10x better than the previous establishment which looked like a lavatory...to say nothing of the Panda Express quality pre-cooked food).\n\nAn interesting touch is having a widescreen HDTV...so it was possible for me to watch the SF Giants win against the Phillies (thus going to the \"World\" series). Come to think of it...I probably should have been paying more attention to my date than the telly...oops. Maybe they should show Thai programming instead (especially Muay Thai matches!!). That should provide a more appropriate atmosphere.\n\nGood eats...affordable pricing...super convenient location (you can eat...then skip over to one of several nearby bars for drinks after). \nStreet parking naturally on 24th Street. So if you're having lunch on Monday through to Saturday...bring quarters (or try to score a residential spot which should be good for 2 hours before you get a ticket).\n\nIf ya fancy some curry and lager (not yet but soon)...give this place a go. And PAY ATTENTION TO YOUR DATE!!", "author": "Rubeun T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "Food is pretty good. Service is wonderful, the servers are kind. I come here often and as they've gotten to know me, they do all kinds of little things to make me feel welcome.", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "Pad Thai was a little too sweet. Papaya salad tasted nothing like papaya, it mostly tasted like vinegar.   Service is nice but not fast", "author": "Monica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "Best Thai food in the Mission!! Bacon wrap scallop appetizer is to die for. \nAlso the Cheese Wontons are super delicious. Fish cake is so yummy.\n\nServers are very attentive and very friendly!! \nDefinitely will go back again :)", "author": "Heather B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "This place is my favorite neighborhood Thai spot. The servers are nice, funny and do a great job. The food is affordable and delicious. Been here several times and haven't been disappointed. Good experience all around.", "author": "Brooks H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "love them! my fav dish is the crispy veg rolls. friendly and almost always much quicker delivery than promised.", "author": "JAllison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "This was the 2nd place I ever ate at on a date in my current relationship. Cannot speak a word of the language yet, but if this situation continues, I may never have to! (Still would like to try!)\n\nAdded plus: very close to BART, and not packed with peeps. Ironic for being on such a busy street, so it's more peaceful inside than you might think.", "author": "Garett T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Their lunch special never disappoints. I like their pumpkin curry and their cashew curry. I've also had their Pad Se Ew for dinner and it was pretty awesome.", "author": "Vishal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-16", "description": "Chili Cha Cha's has the best lunch combo deal. (Full disclosure: I've only been in the restaurant twice.... I normally order online from Grubhub.) The Green Curry and Pad Thai are both excellent. What gets me to order again and again is the soup and appetizer deal. The chicken satay sticks are delicious. \n\nThis is not the best Thai food in the city but it is cheap, convenient, and reasonably healthy. Perfect for lunch. (I think it's less than $10 for a main dish and two sides). The delivery is always fast and the employees are super polite.", "author": "Mel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-15", "description": "Im not a frequent poster...lets be real, Im just too lazy. Tonight (Friday) we ordered food for delivery and it came earlier than anticipated, and it was hot, delicious, and affordable. But let me tell you the best part! My husband had ordered a Thai ic\ned coffee that was forgotten by the delivery person. I called Chili Cha Cha and spoke with a supervisor? who hand delivered the ice coffee herself within 15min. Not only did she refuse a tip, but she also included a free dessert. We were blown away.", "author": "Iris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-16", "description": "S base.\n\nComplicated database: http://en.wikipedia.org/wiki/Essbase\n\nComprehensive dinner: Shredded salmon shrimp satay.\n\nAll of the above. But not at the same time.\n\nShredded papaya salad was generously sized and not over dressed. Fan of any culture who use fruit as a salad topping.\n\nSalmon roll featured a crispy seaweed skin wrap that kept everything inside. Exterior worked well with the seafood interior. Really liked this.\n\nShrimp came as part of a pumpkin curry. Needed a little less oil and a little soft chunks of the the namesake. Just OK. Could have been better.\n\nSatay consisted of four perfectly grilled skewers of spiced chicken. Comes with a rich and spicy homemade peanut sauce. Delicious alone or as a topping.\n\nInterior is simple and unobtrusive and has the usual assortment of Thai accents. Staff was prompt and friendly. Prices very reasonable.\n\nStatisticians love Essbase. Diners will likely enjoy the s bases here too.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "Delivery.\nGot: lemongrass chicken, spicy basil beef (lunch), bacon loves scallop app.\n\nThe first two were quite similar and just waaaay too damn sweet for me.  The lunch thing just comes with a big glob of rice, decreasing the amt of meat.  \n\nThe bacon loves scallop dish was excellent though.  The sauce it comes with was glorious too.\n\nProbably lots of good things on their menu, just not those.", "author": "Xue H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "My fave Thai spot in the mission. Such friendly staff, inexpensive prices and delicious food. The lemongrass sauté is the best!", "author": "Sivan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-16", "description": "I ordered food delvered and specified no peanuts and requested utensils. No utensils and peanuts hidden in the corner of the container. Glad  I am not allergic to them!!!", "author": "Lydia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "My go to place for spicy food. I love their chili cha cha fried rice, tom yum soup, spicy eggplant with chicken and string beans with chicken. I found they use freshest veggies and don't over cook them like other restaurants. The veggies are always crunchy. And the staff is super friendly. Noi who works there is a sweet and friendly person. \n\nI found their prices very reasonable for the quality of food. Especially compared to far too many expensive restaurants with crappy food.", "author": "Su R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "This place never EVER disappoints! Amazing food cooked fast and great portions for a thai place. Did I mention they deliver?? oh and by the way: Favorite dish thus far is the Pumpkin Curry with Duck. You're welcome.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "just got Tom Kha noodle soup, probably the best soup I've ever had! perfect for a cold rainy SF day, highly recommend :)", "author": "Mon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "The only Thai restaurant within a large area of the Mission (I miss you Suriyama). If you need Thai, you can go here or Pad Thai, which isn't significantly better or cheaper. So there's that to consider. \n\nI think a lot of people go out to eat and expect to have their minds blown, especially  Valencia Street diners. This is not that place. It's also not as expensive or trendy as those places, and for the money I think it's perfectly acceptable, perfectly agreeable Thai food. In other words, don't take your date here before you've had sex. Go to the place with the asses on the backs of their seats instead. That'll impress her.\n\nI've eaten here 15+ times, both at the tables and to go, and it's not always consistent. Sometimes the chicken is tough, but it's always edible and never too greasy or nasty. Sometimes I ask for Thai Spicy and I get White Spicy. Sometimes (like last night), the spice level is hallucinogenic. Touche' Chili Cha Cha... \n\nThe Tom Kha soup with noodles has yet to let me down, although sometimes it's better than others. I ordered the \"Seafood Madness\" one time and it was amazing - 5 different types of seafood, and none of them made me sick.\n\nAlso, you can't judge (or call yourself a fan of) Thai food if all you ever do is order Pad Thai. Even more points are lost if you bitch about the food being bland, but purposely order everything mild. The food here doesn't rely on grease, so you need the spice to get the flavor. Otherwise, you might as well go to Cheesecake Factory. I hear they've Thai for you there that is TO DIE FOR. \n\nThis is a legitimate neighborhood spot. It's better than the Lemon Chili Lime place that used to be there, and it's saved my ass on many occasions from having to eat another burrito. It's not trying to impress you. It's not a destination for foodies. It's a utilitarian place for people who just want to get a good meal. By the way, the service is unpretentious and excellent, people are friendly, and there is no wait. Take that, Valencia Street!", "author": "Chris j."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-02", "description": "CCC2 was just as good as the Haight Street location when they first opened. In fact, some of the same people came over from Haight Street to work there. They were friendly, and the food was among the best Thai I've eaten.\n\nWe recently visited, after a long absence, and found that things weren't the same. The staff is completely different. I understand they have new owners. One by one, here's what went wrong -\n\n1. It took 45 minutes to get our meal, when there were only 2 other parties in the restaurant. I did take notice, however, that they were churning out volumes of food for delivery. Seems like they should give some priority to the people who are sitting right in front of them, right???\n\n2. Service was incredibly awkward. Our server refused to set any plates down on the table herself. Instead, she kept sticking them in front of me, until I'd finally grab it and do something with it.\n\n3. Crab rangoons were major disappointment. They were basically soupy, overheated cream cheese with very little crabmeat. In fact, there was very little cream cheese too.\n\n4. My wife's fried rice, which was supposed to come off the line spicy, and my wife asked for them to make it extra spicy, wasn't spicy at all. Not that they didn't pay attention to the special order (which they didn't), but they didn't make it the way it's supposed to come off the line.\n\n5. Firecracker balls were tiny, slightly over-fried, had very little filling (not even sure what was in it this time), and not spicy. Hope they don't still refer to this as one of their signature dishes...\n\nI don't know what happened to CCC2, but I hope they fix their problems soon.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "I went there with a couple friends. It was cozy and fun.\nWe had some wines (wine with Thai food, how's cool?) then we ordered crab fried rice and etc.. Oh! the thing called fired cracker was very good too, we ordered like 3 orders for the table LOL", "author": "Suga B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Fantastic lunch special!! Appetizer, entree, and a side all for $10. Not to mention the quick and friendly service.", "author": "Kaitlin J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-06", "description": "The food was cheap but the pad thai I ordered was very under cooked and drenched in sauce.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-26", "description": "Food here is pretty good but their delivery service is terrible. Late. Food cold. No acknowledgment", "author": "Caleb G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-16", "description": "3.5 is right but I'll bump it up to 4 just because I've had many a positive experience here.\n\nLet's talk food.  It's good, solid and consistent but not amazing.  The spicy string bean is a favorite as is the pad see ew.  Most of the noodles dishes you can't go wrong with and are done relatively well.  Again, while not amazing, credit must be given for consistently good.    \n\nChili Cha Cha isn't the best but eating here is usually pretty easy.  I've never had to wait for a table and so far everything I've ordered has come out in about 15 minutes or less.  The takeout procedure is pretty painless as well.  You can order everything online and pay, needing to do little else than sign a receipt upon pick-up.  This is a boon if you're on some serious deadlines and realized you haven't eaten since breakfast.\n\nAgain, quality is a 3 but consistency definitely pulls this towards the 4 range.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-19", "description": "I'm responsible for the often-tedious task of ordering lunch for the office, and I have had my share of bad experiences with delivery. However, Chili Cha Cha 2 (what kind of a name is this...) definitely restored my faith in humanity today.\n\nI placed an order on GrubHub, and within 5-10 minutes received a call from one of the staff saying that they were unable to buy papaya from the market. Some might groan and complain that they still had the item on the menu blah blah, but with my string of luck with delivery, I was glad they even called to let me know -- much less so quickly after receiving the order!\n\nI received another call at 12:20pm saying the order would be 15 minutes late, and it would arrive at 12:45 instead of the original ETA of 12:30. Eh, not a big deal. By 12:55, I was ready to give them a call but they showed up.... with four complementary Thai iced teas on the house! Awesome.\n\nThe food was decent, the pork in my Spicy Eggplant was a little dry and the coconut soup was not my favorite. But doesn't food just taste so much better when you're in a good mood? #truth.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "So we were walking home from Dia de los Muertos the other night, and hungry. It was late, and my friend was worried that tacos would keep her up all night with ... um, tacos.\n\nWe walk past this nondescript-looking Thai place. Actually, it looked kinda descript - like a dump to be honest. But the menu looked OK and, did I mention we were hungry?\n\nFast forward 15 minutes to awed looks of happiness and mouth-wateringly delightful delectables. We ordered the spicy basil with eggplant and the pork ribs - and both were off the shizzle. Fresh lemongrass and chili clung to the perfectly-cooked ribs, and the eggplant was melt-in-your-mouth tender with crispy pieces of basil adding texture and sweetness.\n\nOn top of it all, the place was pretty packed for late on a Wednesday, and there was only one server, a young Thai lady, completely over-tasked -- and sweet as could be. She somehow managed to take good care of us, get us our food in short order, and be nice, even as she dealt with like 14 tables by herself, no exaggeration.\n\nA hidden gem, this one. Ignore the decor and the 24th-street hipster dive ambience. This is genuine first-rate Thai food.", "author": "Mateo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-20", "description": "This was good thai food. My chicken was under cooked a bit. It was eat able but I was a bit worried I would get sick. I would have had them cook it a bit more but I was on a quick lunch break and couldn't wait. Thankfully I am okay for now.", "author": "Goodguy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "I had dinner here last night with a friend and am still thinking about the potstickers, which were amazing. They are small and crispy, and topped with 3 different kinds of sauce.  Best potstickers ever. \n\nI also had the tornado beef which was delicious and came with a little brick of fried thin potato straws which made it even better. \n\nBased on the reviews I was kind of expecting the place to be kind of a dive, but it's actually clean and nicely decorated. The service felt a bit slow and they didn't bring out the courses for each of us at the same time (I got my soup first 5 minutes before my friend) but overall it was a good meal and I will be back.", "author": "Amy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Great thai food esp the chili cha cha rice and panang curry", "author": "Vicente C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-21", "description": "Sorry to give such a bad review, but this is seriously the worst Thai food I've eaten in a while. While I'm grateful they deliver, the beef pineapple fried rice and chicken satay I just ordered tasted...very nasty. The pineapple in the pineapple fried rice had NO flavor. Nada. It wasn't sour, it wasn't sweat, it almost tasted like...they took it out of the can and soaked it in water then washed in 10 times until it lost all its flavor and only has the appearance of pineapple. The fried rice itself had very little flavor. The meat did not taste fresh. The satay chicken was bland. I'm sorry, but this place won't get my orders again.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "YUM! \n\nEat here for lunch! What a good deal; appetizer, side and main dish for $10.\n\nI was introduced to CCC by a coworker. I was not sure about Thai in the mission at first, but this place was outstanding. Service was attentive and the 3 of us ordered, ate and were back in the office in an hour :-)\n\nSalad, chicken satay and pumpkin curry (with brown rice) were my picks. I recommend that combo, and will return soon to try many more.", "author": "Hilda Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "Nice place with reasonable decor.  If you have friends who are particular, you can bring them here and not have to worry about them. \n\nGood flavor, service was pretty quick, and decent portions.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "In an office full of picky...super picky eaters, IT'S A WINNER!\n\nConsensus = everybody loved it.  \n\nShrimp and mango salad was so good, it melted in your mouth.\nChicken Potstickers - man that  triple decker sauce with the crispy edges...YUMMY!\nPumpkin soup - huh? I dunno but it tastes darn good to me.  I LOVE anything pumpkin or squash things...\nFresh spring roll with shrimp - FRESH!\n\nWe had this for lunch today at work ordering through seamlessweb for financial district delivery so I was nervous if they're going to make it on time for a noon delivery. They were 1/2 hour late BUT...it was worth it.  The food was excellent!", "author": "Grace D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-04", "description": "How this place manages to put out the driest chicken in the world, I have no idea.  First time in my Pad Thai (like sandpaper), second time in my Tom Kha Noodle Soup (like a moth ball).  And how is dry chicken even possible in soup?  That's like the stupidest question ever.  \n\nMy second big tiff with this place is their Tom Kha soup.  It was totally flavorless - comparable to water.  I didn't even bother eating the rest of it because what is the point in eating a big bowl of water.   Please don't sell me water at $10 dollars a bowl.  I know this is America, but jeeze, come on.  \n\nI won't be duped again.  Chili Bye Bye.", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-30", "description": "I stand behind this restaurant!\n\nTo find a thai restaurant on 24th is exciting, but knowing that it's almost the same price as the alternatives in the hood, that the food is worthy of chai yo on polk st... Getting better already!\n\nThe cherry on the cake is how generous they are with portions. Not exactly your average high horse dining venue. \nThanks cha cha", "author": "Adal B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-26", "description": "Me: Hey what time are you guys open till?\nCCC: 11, but last call is at 10:45\nMe: great!\n\nSo at 10:05 I show up at the door and they're closed. \nThis is what I get for having my heart set on Thai food in a neighborhood with no other Thai food:(\n\nBOO.", "author": "Allie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "Wow, thank goodness they closed the horrible Chinese place and opened this wonderful Thai restaurant on lower 24th. I have been here 3 times now and still wonder why the place is not busier. My partner and I are vegetarian and the Tom Kha soup, the curry dishes, the vegetarian egg rolls and just about everything else we have tried have all been outstanding.\nC'mon people of lower 24th neighborhood. Let's support this great Thai restaurant and keep some diversity with our food options in the hood!", "author": "Tim H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-22", "description": "I REALLY wanted to like this place.  It's literally a block from my place, and I was hoping it could be my go-to spot when I need a Thai fix...but sadly, not the case.  Not only was it pricey, but the food made me and my fiancé spend the following morning, er, in and out of the bathroom incessantly.  \n\nThe food itself was decent enough...the Thai iced tea and the Anchor Steam beer we had at the counter while waiting for our food were enjoyable.  The décor is cute, and it looks like the restaurant seating is cozy and inviting.  We ordered a papaya salad, Tom Kha soup (bowl), shrimp Pad Thai, vegetarian yellow curry, and jasmine rice - all take out, eaten immediately upon getting home.  Out the door, we spent close to $50 - yikes.  For so-so food that gives me the runs?!  No thanks...won't be coming back here.", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "They get my online takeout orders wrong pretty much constantly (seriously probably more than 50% of the time), but the food is decent and the price is right. Lunch special is a great deal.", "author": "Travis N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-26", "description": "A friend and I went here yesterday for dinner, and it was a solid, if not terribly exciting, place for Thai. The satay was tasty and the pad thai was okay. Nothing to write home about, but certainly a nice place to have around!", "author": "Tasha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "Didn't know what I wanted for dinner, and when I saw Thai here on Yelp it sounded good.  Chilli Cha Cha was conveniently located and I was very pleased with it.  Really nice server, nice ambiance, good food.  It wasn't mindblowing/best-ever Thai food, but it was really good.  I had the pad se-ew and my friend had the red curry, both were delicious and well worth it.  Also had the Firecracker Balls, which lived up to the hilarious name and were delicious.  Damn right I'm a sucker for fried sushi in spicy mayo.  \n\nI'll be heading back and hopefully soon, so I guess that says it all.", "author": "Nate R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-03", "description": "i came here one a wednesday afternoon and was the only one there. that was kind of nice. i really wanted thai food for some reason, even though i was in the mission. i had the veggie pad me kao, which was chopped up in chunks instead of left long like noodles. i didn't like that. there were lots of different kinds of veggies which was good, but there just didn't seem to be a good sauce. just some oil on the plate and kind of coating my food.\n\ni also had the thai iced tea, which was good, but not great. service was decent, but maybe i stayed too long because i think she forgot i was there towards the end. haha. basically, not too bad, but not somewhere i'd go out of my way to come back to.", "author": "Kensey W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-18", "description": "Ordered (delivery): \n1 Thai Iced Tea $ 2.95 - good, taped shut to avoid spills en route. They remembered to include the straw. \n\n1 Crispy Tofu Salad $ 7.95 - edible, not really a salad but a pile of fried tofu on a piece of iceberg with some shaved carrots and sliced onions for decoration. Dressing was tasty enough. \n\n1 Yellow Curry w/Chicken $ 9.95- they sent green curry, which while is not what I ordered was still something I eat, so I could live  with that. However, they serve it I guess by default super spicy, so I would order it extra mild if I had to eat there again.\n\n1 Jasmine Rice $ 1.95 - decent, it's hard to mess this up. \n\n\nOverall: I wouldn't refuse to eat here, but I wouldn't go out of my way to to eat here again either. The thai iced tea seemed overpriced and the preparation of the food seemed like an afterthought.", "author": "Oly O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "I have no idea why this place isn't consistently rated 5 stars - easily some of the tastiest and freshest Thai food in the Mission, especially considering the price. I'm addicted to the pumpkin soup - only $5 for a large cup that's plenty for a light meal. Lots of great vegetarian and pescaderian options, and you can order a plate of stir fried veggies on the side to add an extra healthy kick to any order. Great spot!", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "My husband and I ordered a numbers of items thinking we would bring the left overs to work the next day-- unfortunately for that plan the food was far too delicious-- and we are left sitting sluggish and satisfied with only empty plates and broken promises to show. But we would gladly do it again", "author": "Dei A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "I love this place. Their food is always delicious and the people working are always incredibly sweet. The sauces they use are probably some of the best I've ever had.", "author": "Melissa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Well Done! Despite the creative spelling of \"chili,\" Chilli Cha Cha absolutely exceeded my expectations.  This location is a definite step up from the one in the Lower Haight, which is pretty good in it's own way.\n\nThe interior is rather chic.  I love the bamboo on the wall.  They avoided  the gilded decor seen in a lot of Thai restaurants and kept things simple and elegant.  Thumbs up for the murals.\n\nService was good.  We ran out of water a few times but otherwise, I have no complaints.  The staff was attentive and very welcoming.\n\nThe best part, however was the food.  That's where Chilli Cha Cha knocked it out of the park.  Everything was so fresh and perfectly cooked.  The larb came on a beautiful bed of assorted baby greens.  We shared the Tom Ka which was just lovely.  The spring rolls were crunchy and almost like little rolled up salads.  The best thing was the pumpkin curry with lamb.  I didn't think lamb got that tender.  It melted in my mouth.  You could cut it with the edge of your fork.  BLISS!\n\nI am so happy that they have opened on 24th Street.  I was also relieved to see the place fill up while we were eating. I was concerned about it being slow on a Friday.\n\nAs of this post, they do not yet have their liquor license.  The application was posted on the door.  They didn't mind us bringing our own bottle of wine, though.\n\nAppetizer, soup, salad, entree and rice was enough for two, with leftovers. It came to $39.\n\n++++++++++++++\nNote, Feller Yelper David G tells me that in SE Asia, chili _is_ spelled with two l's.  Good to know and thanks!!  :)", "author": "Amy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-19", "description": "Very inconsistent, both in service and food quality.  In particular, the duck was decent once, but mostly fat with hardly any meat the next time and stringy and tough the last and final time I'll ever get it.  Staff is sometimes unfriendly and frequently has communication issues over the phone.", "author": "Harlen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-15", "description": "It's aiight.\n\nIt's nice to have a Thai place amidst all the taquerias. Went here on a Friday night and most of the tables were taken, mainly by couples. Food is average, but I've had better Thai food. The price is reasonable but for what I paid, I've had bigger portions elsewhere. Service was fair, and the interior is nicer than what I would think just judging it from its external appearance. Nothing bad, but nothing made it stand out either. Still, a good addition to the Mission!", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "Tried C^3x2 just after moving to the neighborhood, I got the Tom Kha soup with tofu, which was the some of the best i've ever had in the city, also it was huge. Shannon B. got the green curry she was happy with her selection Jen L. got the Duck Curry \"it was really good\" she said, and I finished off with the Panang Curry which oddly was chocked full of what appeared to be both fresh and frozen vegetables but was still pretty tasty. As the other reviewers said, its prices are good, its open late, and its a mere 2 blocks from my house, can you get much better?", "author": "Jared Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-22", "description": "I feel a little hesitant to give such a new place such a poor rating.  In fact, I held off for a few weeks, but the current 4 star review is I think quite misleading and it seems from recent reviews that the food hasn't improved any since I was there.\n\nLet me start off by saying that I really wanted to like this place.  It's super close to my house, and it would be awesome to have some cheap dinner options close-by that aren't burritos. \n\nThe problem is not the service.  It's not the price point.  It's the food.  We had spring rolls, which tasted only of deep fryer and the dipping sauce was a spicy sweet chili sauce which also came with everything else we ordered.  We used it liberally on every dish to try to inject some much-needed flavor, but unfortunately 3 courses of sweet chili sauce gets a bit wearing on the old tastebuds.  I associate thai with really flavorful, savory dishes.  This place has a bit of tweaking to do before it gets there.\n\nThe menu is epically large.  I have a feeling some editing would improve the quality of the dishes.  Quality, not quantity, people!", "author": "Jane F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "can someone play this for the owner and worker?\nThey don't know abou t this song\n\nChili Cha Cha which is a famous song in the 1970s in Asian\nhttp://www.youtube.com/watch?v=wIVHiHG4nwc\n\nsung by Jessica Jay, European Singer (2 singers used this name)\n\nThe restaurant #1 and #2 are 2 different owners", "author": "Sunny O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "So, aside from my recent realization that pad Thai on the west coast is a world apart from the stuff we eat in Boston (that is to say, it's oddly sweet), I am pretty psyched.  I've done Foodler-ordered takeout from here, and I've eaten in, and both times were spectacular.  I think I prefer eating in though - the space is cozy, they've got Singha beer, and you don't have to pay a delivery fee :)\n\nMinus 1 for having the TV on.  What's up with that?", "author": "Jillian Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "I enjoy this spot. Really nice folks serving up good food (at a solid price). I have been here 10+ times.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-01", "description": "Delivery was right on time, in spite of cold, rainy weather. And, the restaurant called to double check the accuracy of part of the order we had placed on line.\n\nTom Kha Gai with noodles was fantastic. Flavorful, with lots of fresh chicken breast and big chunks of mushroom. The noodles came on the side, so that they stayed un-soggy, and were accompanied by a generous dollop of caramelized onions & garlic atop perfectly steamed Chinese broccoli.\n\nFresh spring rolls with tofu and shrimp were tasty, with fresh mint leaves and a not-too-sweet peanut dipping sauce. They had shredded lettuce inside rather than the rice vermicelli noodles that I'm accustomed to, but that didn't alter the flavor much. My only complaint was that they sliced the rolls into many pieces. While this made sharing very convenient, it also caused the rolls to fall apart; perhaps rice noodles inside would be more starchy and cohesive. We ended up eating the spring rolls with a fork, like a salad. But if that's our biggest problem in life, well... you know.\n\nPanang curry w veggies & tofu was deliciously spicy and had a unique blend of vegetables; a little thinner sauce than would be my preference, but full of flavor nonetheless. We had it with brown rice, which was a tiny bit mushy. To be fair, that may have occurred in transit from the restaurant. The Pad See Ew with tofu was some of the best I've ever had. The tofu was lightly fried yet still soft on the inside - not rubbery. Lots of egg and Chinese broccoli in it, too. \n\nWill definitely order from CCC2 again! Thanks for the great meal.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "I think this is my second favorite cheap thai restaurant ever (the favorite being Pam Real Thai in New York City)\n\nWent to CCC2 on a Friday night. The dining room was largely empty, which is a pity, because it was a pleasant space. We did see a bunch of people get takeout, though.\n\nI had a papaya salad and the pad see-ew. I asked for both of them spicy, and they came out flavorful and with a good amout of bite. The papaya has clearly been marinaded in the dressing; a lot of the crappier thai places just piur the dressing on top when you order it.  My husband had a tom yum soup and panang curry with salmon and avocado off the daily specials, and both were really tasty. \n\nIt's 2 blocks from my house; so glad they opened!", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "I loooooove this place! I always order online from work to pick up (I work nearby) or from home for delivery. The staff is always super nice. When you order online they send you an email immediately letting you know they got your order, and they call when they arrive with your delivery. I usually order yellow or pumpkin curry with chicken(sometimes salmon), chicken sa-tay and Thai iced tea. Delicious! Just remember to order rice with your curry because it doesn't come as part of the meal. I'm picky and never eat leftovers but that curry remains amazing even after a day or two in the refrigerator. \nDefinitely my favorite go-to Thai place in SF right now.", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Nice new thai option in the neighborhood.  They have the usual pad thai and curry fares.  But there were a couple of unique dishes, in particular, the the soft shell crab with yellow curry powder (yummy!), the BBQ short ribs (ok, seems more Korean than Thai) and the lamb curry with pumpkin (good).\n\nTheir liquor license is pending but in the meantime, you can go down to the nearby liquor store for some BYOB.", "author": "F. P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "The best crab rangoon I've ever had --anywhere in the country. Cannot describe how delicate the pastry and overall how flavorable it was! Also unbelievably good pumpkin soup! And super yummy spicy green beans with beef. Additionally, the food was delivered not only warm, but HOT!", "author": "Swiss C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "The quality of the food is impressive, given it is delivery!  Every order has arrived piping hot, with great cuts of meat.", "author": "Sam G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "very good no frills thai place. They also know what spicy means and are good with substitutions as well!", "author": "Brian V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-12", "description": "went at lunch time to try their lunch special. had their coconut soup, chicken potstickers and chicken pad thai.. chicken potstickers were decent but overall food was too sweet even when asked for spicy (i tried the chicken pad thai). the soup had a nice coconut flavor but the veggies in there seemed like they came from a frozen veggies pack. service was good though but food wasn't good enough for me to try this place again.", "author": "Vijith N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-17", "description": "Consistently good food, I've always ever done takeout and they're super nice, remember me and it's ready within 10 minutes.", "author": "Charlie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-09", "description": "CCC2 is a fantastic little Thai place in the heart of burrito alley. The restaurant is well-spaced and nicely decorated, and the staff are friendly and attentive.\n\nWhat about the food? The spicy pan fried noodles and fried garlic and pepper beef are both winners, and the Thai iced tea is perfect.\n\nMost dishes are around $8-10, so for two people a meal will probably run around $30 or so, depending on whether you get dessert. (which you should, because the fried bananas with ice cream and sweet sticky rice with mango are both awesome)\n\nI've only been once so far, but I'll definitely be back again soon!", "author": "Nick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "The food was really good compare to what you pay for. The portion is big and servers are attentive. My water was never empty and didn't even notice when they came and filled it for me.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "Pretty tasty Thai food lost amongst taquerias in the heart of the Mission. The vegetable panaang curry is damn good. The coconut rice was a bit bland but certainly didn't take away from the rest of the meal.", "author": "Priscilla M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "Good food, good price, nice people. Vegetarian options galore. I've been here a couple of times, and it's the nice thai food place around the corner that isn't too greasy and isn't too expensive.", "author": "Molly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-13", "description": "The good:\nfast\neasy to order both eat in and take out\nflavorful\nif you specify that you really want a dish spicy, it will come really spicy\nsuper friendly staff\nthe pineapple fried rice is packed with pineapple, cashews, chicken and shrimp\nthe garlic and pepper veggies (hold the tofu) are intensely garlicy \nfree delivery\n\nThe bad:\na bit too oily\nall the to-go food is packed in plastic - no paper or compostables, just straight up plastic containers, plastic lids, plastic bags.\nnot cheap. not expensive either but certainly not cheap.", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-27", "description": "Thai food in the mission is hard to find. But once you get of the street of drunken latinos and pee smell this place is a gem.  They have great portions and the Pad-se-Ew is great. And Im an expert.  Get it with chicken and thank me later.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "This place is a gem- and I'm only recommending the dish I had...pumpkin curry lunch special. That's it! It was the most wonderful curry explosion of mouth watering goodness. My friend and I could not stop eating it all even though we were so full. Just the right amount of sweet savory and a bit of spice. But the best part was the milky texture of the soup combined with the soft melt in your mouth pumpkin squash...oh yes, I've been dying for another chance to go back and try this dish again. I assure you, I've had lots of curries, but this was my favorite squash one. The funny part was that I passed by this place and never noticed it. It's small from the outside, but much more classy and clean from the inside. Just a few blocks from the Bart. If you're craving thai for lunch and you're in the area, this is definitely a must try place. And if you like yellow curry, then you'll love this pumpkin one as much as I did! Definitely keep an eye out for this place :)", "author": "Rayne W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-05", "description": "Not bad! I discovered Chili Cha Cha 2 one night when I had a craving for Thai and my normal go-to for takeout, Osha, told me they were done with delivery orders for the evening (boo!). Grubhub led me to this place -- which delivered until 11:00 p.m. at the time (though the website now suggests otherwise). The portions were more than generous -- there is definitely enough for leftovers -- and the green curry I ordered was excellent (as were our spring rolls). The chicken and vegetables in the curry were not the best I have had, but for the price (less than the usual for a large portion), the food was great, and it arrived practically right as I hung up the phone. I can't complain -- I was very pleasantly surprised, and I have ordered from this place quite a few times since.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-31", "description": "I've tried this place a couple times, both sit-in and take-out. I want everything to be a dollar less, as there wasn't anything particularly memorable about any dish.  I did really appreciate our waitress though, and liked that they were trying for some ambience and mood lighting.", "author": "Lily S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-04", "description": "Tried to order online.  An hour after my order went through supposedly I got an email saying the order was cancelled.   I never got my food.", "author": "Bumpus H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-05", "description": "Bad customer service!\n\nMy friend and I went there on Saturday Dec. 2 2011, to order food to go for 5 people. Our bill came up to a bit above $75. \n\nThe moment we paid, I remembered that I forgot a soda for one other person. I ordered two and handed the waitress a credit card. \n\nShe told me that the minimum payment for the credit card is $10.00. But we just spent $75!!! I said. Nope, it has to be in one transaction.\n\nShe refused to void the previous transaction and re-ring it again with the soda included. She refused to accept the cc for the 2 sodas in the amount of less than $10.00. She refused to cancell everything and give us money back. We basically had to go to the bank, to withdraw cash and pay for the sodas.\n\nTHEN, while she promised food to be ready in 25 minutes, her lack of organization caused us to wait AN HOUR!!!\n\nThere were 9 people in the whole restaurant, and only 2 received their food in the 1 our we waited for ours. \n\nSeems like the place is disorganized. And he fact that we were spending $75 and were not able to pay additional $5 on the cc, is ridiculous.\n\nWill not go back there again!", "author": "Pete B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-23", "description": "Very clean space. The people who serve are very nice. I have had the pad thai and the panag chicken ( both great. )\n\nPlease try the fried banana & vanilla ice cream !!! hands down so good.", "author": "s s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "Had the Spicy Basil w/chicken lunch special...great flavor, fresh steamed rice but the veggie spring rolls were bland and it needed dipping sauce. I would have given 4 stars but I ordered to go and it took an hour instead of the 30-45 min as advertised. I would definitely go back but I would opt to eat in.", "author": "tOnii e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-17", "description": "Friendly staff but expensive. I feel like it's my only resort for Thai food in my neighborhood without paying over $20 a meal. I really wish their curry wasn't so waters and I wish that their pumpkin curry taste like pumpkin curry.", "author": "Melissa O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-10", "description": "I didn't like the food at all. I ordered a spicy Tofu vegetable and a portion of Jasmine rice to go. \n\nThe container wasn't great to keep the sauce inside it. When I reached home it was half spilled out and I just live 2 blocks from the place. \n\nThe tofu didn't taste anything. It wasn't spicy at all and was low on salt and other spice. The portions were not great too. \n\nMy roommate to visited the place during Grand Opening and even she didn't like the place.", "author": "Kapil D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "Got off late from work and just needed food and a beer... tried this place on a whim and was truly (and pleasantly) surprised at how good the food was. Had the beef ribs with sticky rice and pad thai and would order both again in a heartbeat... fast, friendly and decent pricing. This is my new Thai takeaway place. Went in tired and grumpy, left happy and quite satisfied.", "author": "Richard F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "This restaurant looks a little iffy from the outside but is wonderful! The food is excellent, the portions are large and the price is right. The place is nicely decorated, clean and has a great overall ambiance.", "author": "Brooke B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-04", "description": "Quite possibly the worst Thai food I've ever had. Bad enough that, when ordered as take out last night, we stopped eating it, even though still hungry. Granted we ordered close to closing time, but pad see ew with super thin egg noodles and no flavor does not make for good eats.", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "pretty tasty food, i was mostly impressed with the server, there was only one server on and she really took care of us well even though she had other tables and a whole lot of to go orders.\nmy boyfriend had the firecracker balls or something like that, deep fried ahi tuna rolls and they were FANTASTIC!", "author": "Jasmine F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-07", "description": "Chicken noodle soup with flat rice noodles. Spot-hitter, especially if you're trying to kick a cold's butt.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "I've only ordered delivery from these guys and it's been consistently good.  The food comes prompt, hot and unlike a lot of the places I order delivery from nowadays...the portions are decent.  Enough to have left overs at least!   I like their basil chicken, chilli cha cha fried rice with chicken is off the hook, spicy string beans & pad see eu.  It's not cheap but living in SF has me trained to ignore that.", "author": "Ramon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "I have been here about three times, once for take out and love their pumpkin lamb curry and the banana rolls dessert.  I have also had other dishes, like the pad see ewe and I have tried something with duck and other two dishes with eggplant and green beans.  I did feel that it was a bit pricey because they have pretty small servings but it is savory.  The service is pretty good, nothing really to gripe about", "author": "Melody U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "It was a gem! Everyone is right! Loved the green curry and the Tom Yum soup! We were looking for somewhere to eat and it wasn't busy so we popped in and are so glad we did! :)", "author": "Jordan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-20", "description": "We've ordered delivery from here. The delivery time is reasonable (30 to 45 minutes) and the online system easy to use. We've only gotten curries so far and they are tasty but nothing with a wow factor.  One thing that bothers me though is the price of rice.  We paid $4 for a tiny little thing of rice, like the smallest take-out carton there is.  That just seems morally wrong! It's rice... it should be like a dollar or dollar-fifty a person and there should be A LOT per person. Next time I'll make the rice at home.", "author": "Jillian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "Cute and clean with a friendly staff and one particularly secluded inset booth that would be great for a date. Food comes out fast, hot and flavorful. I can't find a reason to complain.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-21", "description": "After passing around a few spliffatonis and downing some coors light we went to this place last night and I almost lost my mind.The panang avocado with salmon was insane and the pumpkin curry with lamb was pretty damn good too, as well as everything else we ordered (and we ordered a lot). In fact i liked it so much that i created a yelp account soley for the purpose of this review. \nPretty excited to have a good thai place right by my house, even though mexican is still my number 1...", "author": "Dustin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Meals here are always delicious, the atmosphere is nice and service is excellent! We come here whenever we get a craving for great Thai food.", "author": "Ian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "I eat here a lot (it's 15 steps from my door). The pad thai is pretty darn good as are most things on the menu, however, the curry is very hit or miss (duck can be awesome or way too fatty and terrible).  When I first started coming here, I ordered my meals \"spicy\" and was disappointed until I told them I mean really, really spicy. That did the trick. The space is clean and well lighted, but somewhat standard when it comes to decor. Also, they need to do something about the front door, it doesn't close on its own and leaks cold air into the first couple rows of tables. \n\nOverall, this is a great place to order out pad thai but a little less awesome for eating in.", "author": "Evan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-29", "description": "Ordered for the first time, based on good reviews. This is for their takeout service. Ordered on Eat24 a few days in advance and came about 20 minutes after the pick-up time, and they didn't have my order ready. They didn't even make it yet. Had to wait another 15+ minutes for the order. -- When opening the food container @ home, the portion of food was just under 1/2 the container (eggplant dish) that had maybe 5-6 pieces of eggplant. $10 for that amount of food is ridiculous, especially for an order not made on time and making the customer wait. Won't order from here again!", "author": "M s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-30", "description": "last sunday's weather made for a lazy night in for our sunday dinner group.  we opted for take away and mindless horror flicks, fitting for this month's festivities.  after idle indecisiveness, we agreed to try the new resto on the block: chilli cha cha -- 1 block from j&l's pad and my work as well.  \n\nme: basil chicken\nl: chicken pad se-eu\nj: tofu chilli cha cha fried rice\n\ni thought that j's rice was delicious.  they flavor the rice so well, and it was simply amazing w/the veg and tofu.  l's noodles were tasty, and i loved the broccoli in it.  my dish was ok.  i was expecting minced chicken, and it turned out to be big chunks of chicken.  the flavor was still good.  \n\nall in all they do thai right, and is a great addition to the hustle and bustle of 24th street.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "they have these vegetarian potstickers that are covered in a combination of three different sauces that i would literally solidify into a deodorant so i could wear it everyday.  i think it's a combination of sriracha, hot mustard and then this brown sauce and this combination - plus the crispy edges of the potstickers and steamed middle - is heaven.\n\nthe pad thai is good, too.  i've gotten a few other things but i am happy with the vegetarian potstickers and pad thai.\n\nCCC2 is close enough for me to walk to so i can't speak to their delivery services, but i have dined in and have gone in to order out.\n\n+ clean restaurant / cute decor\n+ friendly waitresses\n+ prompt arrival of food when i walk in off the street and order to go (and sometimes i'll get a free thai iced tea while i wait)", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "Every time I have gone in here I have had good service and great food!!  I ask about how things are cooked prepared if I am not sure about the dish.   There is a language barrier so make sure they understand with how you want things prepared.  Ex springs rolls you don't want fried they will be more than happy to prepare the food how you want.  Don't be shy to ask and say what you need and they will take care of you!", "author": "gayle w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "Decent restaurant overall but I really stick to one dish, the amazing salmon avocado Curry (coconut) dish. WOW. I recommend it everyone, just be careful because \"extra spicy\" really does mean EXTRA spicy.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Stopped by on a whim and we loved it.  The guys had noodle with peanut sauce and they loved it so much that they ordered another helping.\n\nPumpkin curry was as good as the one from OSHA (maybe better)\n\nGreat jasmine rice\n\nMango sticky rice good, but not the best I've ever had.\n\nWe got there early so we sat in the cozy booth.  Service excellent.\n\nWe'll be back", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-30", "description": "Really want to like this place more as it's a block away and happy to have fresh alternatives to Mexican fare, but the food's been consistently meh. Not bad, just not special. I'll keep going back for convenience sake, but it's not a destination for me.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-09", "description": "I ordered Pad Thai and spring rolls.  I mean, the pad thai is OK, but they only give you sporks to eat with (to-go).  The spring rolls were hands down the worst I've ever had.  I think they're just not their specialty.  They just taste like lettuce.  I mean... I see something else in there, but I can't taste it.", "author": "Cameron J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-11", "description": "Worst coconut soup I've ever had. It tasted like I was drinking some kind of sweet, syrupy dessert. There were all of 2 ingredients in the thing--shrimp and mushrooms--and there were hardly any of those! I should've made an omelet.", "author": "franny p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-18", "description": "Thanks for opening a Thai food place so close to our house!  I wish you the best.  I think this will fit the bill when we're too lazy to walk all the way to Manivahn.  But, I must say that unfortunately the curries ands soups are a little sweet, and the calamari salad is just ok.  The ginger fantasy chicken is amazing, we'll get that every time.  Keep it up, CCC2 - a few little tweaks and this may just work out.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-26", "description": "Increased the delivery minmum from 15 to 20 Ive been going to this place since it opened, but still coudnt make any exceptions n was rude about.", "author": "Jamar t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-06", "description": "Best Tom Kha I've ever had. \n\nTrying Chili Cha Cha's Tom Kha made me fall in love with the dish (Spicy coconut soup with mushrooms and seafood, etc) So I tried to find a comparable experience to what I had found here. No dice. \n\nEverything else I've tried here is top notch, and definitely love its fried calamari and Pad Thai. That said, I keep going back to the Tom Kha with combination seafood and steamed rice noodles. \n\nI mostly get delivery but every time I've dined in, it's been a great experience.", "author": "blake s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-13", "description": "I've had a few delivery experiences here and it's just not that great. I really wanted to like Chilli Cha Cha.. but really, the food is pretty mediocre.\n\nThe first time I got chicken and noodels in peanut sauce. The sauce was way too thick. \n\nThe second time I got som tam salad and crispy tofu. The tofu was soggy and the salad had way too much fish sauce. \n\nSo.. eeeh. It's edible and they deliver pretty fast... but eeeeh.", "author": "A K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-20", "description": "I loved the original Chili Cha Cha in the Lower Haight and was a regular customer when I lived there. So I was thrilled to see that they were opening up a location in the Mission 2 blocks from my house. Sadly, the food is just not the same quality. I think they might have also increased the prices a bit. Its still decently priced but the other Chili Cha Cha was an absurdly good deal and the food was much better. This is just so-so Thai food in a city with many excellent Thai restaurants.\n\nSince they have not competition in the immediate area, I'm hoping they'll stick around. But if you want good Thai, make the journey to the inner Mission or Noe Valley or somewhere else. Chili Cha Cha is a convenient after-work dinner pickup but the food is nothing to write home about.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-06", "description": "One word comes to my mind to describe this place: cute! rather small, well hidden, cheap and \"young\". Despite the restaurant size, the menu is huge and I had to let my gf order long before I could decide what to take, but I'm also a special case :-)   After an almost endless deliberation, I opted for a clay pot with seafood (only shrimps and calamari rings), cabbage and soya noodles which was tasty, a little spicy and with a strong garlic flavour.  I honestly found a bit disappointing the calamari rings that you could have hardly distinguish from ... plastic. The dessert, sticky rice with vanilla ice cream was decent but nothing memorable. The service was good.  Not striking enough to make me a fan...", "author": "Andrea L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-23", "description": "Just wanted to order some tom kha soup and a salad from grub hub. Hadn't heard of this place before but like to support neighborhood businesses. Unfortunately, it was so bad. The tom kha soup was cloying sweet and had cabbage and baby corn in it. Definitely not the authentic tom kha I was looking forward to. The second dish was missing a main ingredient and covered in a super sugary sauce. Wish I wouldn't have tipped 25% without knowing. Perhaps they felt that they no longer had to care. Oh well, now I know. Definitely won't order from here again.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-16", "description": "Just spent $7.40 on an eggplant meal here. Being that I am broke I was indeed trying to get something affordable on the menu. The serving size was literally laughable. It was double wrapped in plastic bags (my girlfriend also asked for no bag) to hide how sincerely pathetic the amount of food was. It tasted great, but I was so upset that that much money couldn't even afford it to be over rice or with tofu. Never again. I liked he waitresses there too. Too bad.", "author": "D. Alexander H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-02", "description": "I love finally having a thai place on the 24th St side of the Mission, so I went in prepared to forgive a lot if necessary - but it wasn't. The food is good, the decor is nice, the waiter was sweet, answered our questions and kept our water glasses full. They say they can make most of their dishes vegetarian - I haven't tested this too hard, but I really appreciate that they make it clear. Most importantly, the avocado curry was delicious.", "author": "Lana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-18", "description": "Last week,My friend and I went there five minutes before 11pm. they staff was still happy to serve us. Actually, I wanted to try their special lunch combo which my friend is so in love with. Unfortunately, I got back in town late. Anyway, I'm glad that I did go to have dinner there.Well,We started with chicken pot stickers and fire cracker balls OMG those was YUMMY!! I ordered grilled salmon because I wanted to have something light.Grilled salmon served with veggies.It was so delicious and I feel healthy. My friend had their steak come with thai-style dipping sauce. Looked so great but I didn't try tho.My friend said that was tender and juicy. Our dessert was Fried banana and coconut ice cream which was so good. \n\n\n\nNice place.Great taste \n\nThe service is always extremely warm and friendly.\nPortion is feeling.\nI love their food presentation.those are outstanding\n\ndefinitely this is my thai place .", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-02", "description": "It's less than mediocre Thai food.  This is the third chance I gave them to get it right, and it was worse than ever.  Way overcooked rice noodles, and tasteless.  Basically I got a bland soggy mess with scant Chinese broccoli.   Thursday night and the place was empty - that should have been a clue.  Boo.", "author": "Nancy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-09", "description": "Friendly staff, quick service, great food. 5-stars, easy.", "author": "Austin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-18", "description": "Solid food. I got the lunch special (chicken satay + yellow pork curry) and a thai iced tea. The appetizer coconut milk based soup was surprisingly good. I need to sample more items before I can go lower or higher than a 3, but the lunch special was only ten bucks which  seems reasonable.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "I read the reviews claiming flavorless, but decided to perservere. So happy I did! This is a wonderful, clean, tasty family run gem in the heart of the mission. The lunch special will be my new go to when working from home. And I am a spice flavor junky... whom thought everything was quite flavorful.", "author": "Rebecca P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-04", "description": "My girlfriend and I have been here twice and it's consistantly been hell-yeah awesome.  Pad thai, tofu with peanut sauce, duck curry--it's just great.  And oh man you should get the firecracker balls appetizer.  Good prices (though we always end up spending a lot because we order so much), good thai iced coffee, I could go on and on.  Check it out", "author": "Charlie E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-15", "description": "yellow curry and pumpkin curries were good. the peanut noodles were gross. the portion was also small for what we paid, but since it was gross that was fine. i'd recommend sticking to the curries.", "author": "E K."}
