{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Visiting the area & so far everyone's been very nice & inviting. After a long day of sight seeing all I wanted was a good burger & a beer. This place did not disappoint. The bartender was very nice, super welcoming. Greeted us as soon as we walked in. Had our drinks in front of us in less than 5 minutes. Ordered cheese burger, carnitas torta, 3 tacos, 2 fries & 1 Cajun fries for a total of $48 with 18% tip. Nice deal. And the red salsa tasted like my mom's . \nThis bar also has 1 pool table, a couple of games, tv's with sports. \nDefinitely would recommend!", "author": "Vanessa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "On my favorites places to go when I was a student at SF State. I just so happened to stop by this past week to meet up with friends and was reminded of why this was always an ideal spot to go to on Friday and Saturday nights. I was here this past Thursday and it was the best timing and day to be there. It was not crowded at all and my group had plenty of space to roam around without bumping into other patrons.\n\nThe beers on tap were only $3 as well which was awesome. I believe there were only 2 bartenders working at the time or maybe they had just switched shifts, not sure. \n\nThe pool table was open and available as well which was nice. The other games I saw that they provide here are Jenga and a home arcade basketball game. \n\nAs for the bathrooms.....I'll let you experience that for yourself!\n\nOverall, a good night and good drinks. \n\n#ThirstyThursdays", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Stopped in after a day around town for the happy hour deal of $3 beers. Overall great selection of beers on tap, especially the Tart Mango Cart.", "author": "Jenna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Came here for the pats vs steelers game on Sunday and had a blast. Sat at the bar and the bartender, Nicki, was very attentive to all the patrons there for game night.Major props to her since she was the only bartender the entire night.  \n\nThis pub is perfect to come watch any sporting events. There's food and good drinks and there are like 8 tvs here!! There's also a pool table and a basketball arcade game. So whats not to like?!? Crowds do get rowdy during game time but that's normal for a sports bar. \n\nWe ordered 2 beers and the garlic fries, Bill came out to be about 23 dollars...not bad for a 3 hrs stay at th3 bar. Garlic fries were good and is very big!! \n\nIf I wasn't out of town during super bowl weekend, I'd definitely come and watch it here...maybe next year then!!", "author": "Caitlin P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "Went into Chug Pub to try out their new Mexican restaurant, Casa Barajas, and I walked out as quickly as I came in. When I came in I went to the bathroom. While I was in there I noticed one of their servers come from one of the stalls and left without washing their hands. I quickly left and will never return. Went to Nick's Tacos at Underdogs instead.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "This was the go-to spot back in the college days. \n\nThey had friendly bartenders, great drinks, and it was the the place to watch Bay Area sports especially during the World Series and Warriors season. There were never any issues whenever friends would come here. Everyone had chill vibes\n\nThey have decent nachos, a pool table, and some board games your friends can play whenever it's not too busy. \n\nThey do have limited seating though and the bar area gets crowded easily since its a narrow corridor but the bartenders are attentive and get to you as quick as they can. \n\nThey even have a smoking section in front with a TV so no important plays are missed.\n\nI made great memories that I can vaguely remember at this bar.", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-15", "description": "Beer is good, despite being a dive they do clean the tubes from the kegs. IPAs specifically lagunitas and Guinness. \n\nThe let down is the full taco menu is not a available. Only fried stuff and they have no nachos.\n\nCute spot though and half the patrons are really intoxicated in a happy, non violent way. Plenty of TVs and sound system for jukebox better than expected.", "author": "David A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Probably the cleanest & nicest pub I've been to in SF. The staff is super friendly, the drinks & the food are delicious. Would definitely come here again & recommend to a friend!", "author": "Mariah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Came to Chug Pub on Saturday for a friend's birthday. Bartenders Joanna and Nikki were friendly and attentive. Pricing was very fair.\n\nWill be back if I'm in the area again!", "author": "Alan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Just visited the Chub Pub because CASA BARAJAS is now serving excellent Mexican pub food there.  Great tacos, homemade chips and salsa, tortas, quesadillas, Asada Fries, Burritos and even Burgers.  The food is excellent, prices unbelievable reasonable.  You can also order take out  and there is $2.00 taco Tuesdays. Catering is also available. A real delightful surprise to find  in the Inner/Mid Sunset.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "I came here after hearing from a friend that they had Uyghur (central asian) food but was disappointed to find out that they are not serving any at least for the next few months. Decided to stay regardless and had a few drinks and some tacos (their menu has a small number of mostly Mexican options plus some random stuff like bruschetta and cheese bread). They were also out of a few menu items so the already small menu got even smaller. \n\nDrinks are fine- decent pours and they had a pretty good beer selection. The food was okay, nothing too special. There wasn't a lot that separated this from other bars and I'm not sure if I would come back unless I happened to be nearby or maybe if they brought back the Uyghur menu. Not bad but not particularly memorable or interesting either.", "author": "Seema U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "\"I'm getting ultimate fires at Chug Pub\" is just about the sketchiest-sounding statement you could make about plans in the Sunset.\n\nIt doesn't help that Chug Pub looks dark and stormy, there is a smoking room, the crowd is not the hip twentysomethings of SoMA, and overall ambiance reminds me of Moe's from the Simpsons.\n\nBut once you get over the apparent sketchiness and appreciate it instead as divey, Chug Pub is a neat place:\n\n(+) Decent selection of beer on tap, and happy hour is $3 select pints until 6pm. We actually got there a little after 6 and the bartender didn't notice, but she still gave us HH on our first drinks. Cocktails are hit-or-miss and somewhat inconsistent in terms of strength.\n\n(+) Pool table and Pacman arcade games. Fee-for-service, but these games are entertaining in themselves and ridiculously amusing after a few dranks.\n\n(+) Many TV's. The extent to which I follow sports is mostly limited to what I passively absorb on my Facebook newsfeed, but for all normal people out there who watch sports, I like how there are plenty of TV's so you don't have to turn around and sit at weird angles.\n\n(+) The food is pretty amazing. Unlike overpriced generic burgers and fries you find at most bars (or worse, no food), Chug Pub gets creative and has used psychoanalytic optimization to concoct the best drunchies food of your imagination. \n\nWe stopped by for drinks one night and saw some people eating what essentially looked like In-N-Out animal fries on steroids, so we made it a point to go back. The ultimate fries are indeed the ultimatum of bar food: a basket of waffle fries bigger than your face, generously slathered with cole slaw (yes, veggies!), pulled pork, bacon, BBQ sauce, jalapenos, and topped with a RUNNY fried egg and DINO CHICKEN NUGGETS. I know the exaggeration looks funny in a review, but it exactly illustrates my excitement :D Although the ingredients were mostly canned/frozen/bottled, everything together was delicious. Also, the portion was large enough to feed two hungry people for dinner (and probably more for post-prandial late-night drunchies).\n\n(?) Parking? If you plan to chug, you should not be driving :P", "author": "Edna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "I've live about two blocks away from this place -- and I'm pretty glad I found it.  It's the perfect casual low key bar.  You can dress casually, just hang out, play pool or watch the game.  It's pretty chill. \n\nI will admit, I totally avoided it for a few months because the bar kind of looks so dark/borderline sketchy from the outside...so as a girl, I wasn't too keen on going -- but it's actually not sketchy once you actually go in.    \n\nI actually had no idea they even had food, since I always come so late -- but I will definitely be back to give the food a try.  \n\nDefinitely worth hitting up if you're local, can't say I recommend making a trek if you are not.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Great prices on pitchers and has all the bay area sports games on! The only problem is that it is hard to find a seat when any game is on because it is a small bar.\n\nHaven't tried the food yet, but I hear good things about the asian food here! First time seeing asian food at a sports bar haha!", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-16", "description": "Chug Pub is small looking but it's a long bar. not a lot of seats.\nmany flatscreens up tuned to my channels\n\nHH: 4-6, $3 wells, beers\n\ndrips:\n-lots of various hard liquor available too.\n-parking is iffy in this area.\n-thursday has more beer on special (stella, blue moon,..)\n3..5 stars. too claustrophobic for me.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Grace place!  I left my bag and the staff helped in every way possible highly recommend", "author": "Ben S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Great neighborhood bar. They used to have this weird Uighur food but thankfully they changed it to normal bar food. I love the management and all the staff. Special shout out to the bar tender Ben. He's one of the most intelligent and well rounded people I've ever met. He has traveled the world touring as a musician, is a talented athlete (golf, tennis, darts), and is an amazing cook and food critic. Tip this man well and he will reward you with legendary tales and sage wisdom. Five stars.", "author": "Coleman M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "This is a cool spot to hang out with friends. There's a pool table, a basketball hoop, good food, prices for beer are amazing, a good variety of beers on tap, the bartenders are friendly, and they play a mixture of modern and 90's hip hop. The vibe is chill and I liked that it wasn't too crowded on a Friday night.", "author": "Evana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-10", "description": "While on an accidental pub crawl we wandered into Chug Pub. There's a pool table squeezed in between the bathroom and some tables making it a little difficult to play, but still fun. \n\nBeers are fairly cheap and I hear they have a chug tower complete with its own tap for a table of friends during the big game. It's also been said that the chug tower comes with a free basket of fries. \n\nThe most interesting thing about this bar is the pop-up restaurant that has taken residence in the kitchen. I'm pretty sure the kitchen is ran by a father-son team trying their hand at the whole restaurant thing. The food is Uyghurm which is the food of Chinese Muslims. You won't be able to find it anywhere else in the city. \n\nIf you're planning on eating at Chub Pub don't expect something close to Chinese food. Uyghurm food reminds me of Indian food; playing up potatoes and plenty of spice. Three of us shared the spicy chicken, which was good. There were large slices of garlic in the dish and I kept eating them thinking they were sliced water chestnuts, so I was left with a funny aftertaste. If I wasn't drinking beer for 8 hours straight I would have enjoyed the food more. For me, I don't think Uyghurm food is te way to go on a belly full of beer.", "author": "Emily E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "The beer selection is on point, a wide array of beers local and nation wide with a little bit of everything for everybody. The prices are solid too.\n\nThe food is pretty good. The lamb pie is mostly the delicious crush while the insides are not as delectable. The pumpkin dumplings are meh because they're kinda loosely packed which is not to my preference. I would prefer my dumplings to be stuffed to the brim or a solid chunk.\n\nThe best thing is those kebabs. Man, three sticks of cumin covered lamb was so good. The meat was a bit tougher than I expected but the flavor and grill of it is just the best.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "This places photos and reviews need to be updated to reflect the awesome Uyghur Food!\n\nNoodles with lamb  were ON POINT... the sauce was delicious and the noodles tasted hand-pulled. That dish along side beers and football and a pool table makes this an awesomely unique spot. Highly recommend.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-06", "description": "This place is fun and lively. Came here for that epic 18 inning Giants game the other day and had a good time.  \n\nMy only problem with the place is the layout.  It's long and narrow, and when it gets packed it is hard to get around.  The room in the back is spacious, but the pool table takes up a lot of space.  Drinks are average pice, about $5 a beer.  They have these beer tower things that look really cool. NOt sure how much they are, but seems more fun than getting a pitcher.  The only problem is you gotta find a table top to enjoy it at.  \n\nWith any place in the area, parking is horrendous and it can get crowded.  It was especially crowded because the Hardly Strictly Blue Grass festival let out during the game.  In some ways this lowered my star rating because a bunch of drunk, funny smelling people came in not so much to watch the game, but to continue their debauchery...annoying.  Oh not to mention it was 90 degrees that day.\n\nAll in all a pretty fun dive bar with good atmosphere, but not really a stand out.", "author": "Veasna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Ben was an amazing bartender. Loved the ViBeS of the place. Would definitely recommend!", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "I went here on Saturday night & atmosphere was great, the music was good & I received the best service from Jessica. Jessica Is The Best Bartender In The Whole Wide World Craig!!! I recommend everyone go check out Chug Pub & ask for Jessica for the best service.", "author": "Michello O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "Street parking. Not a bad selection of beer on tap. Music selection is pretty good too if you like classic rock. Food is very poor quality bar food that tastes a lot like frozen food from supermarkets. There is one pool table that is a dollar per game.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-27", "description": "Your average SF Sports Bar.\n\nFull Bar w/ TV's and Pool Table. \n\nGets a little cramped on the weekends or when there is a game on. \n\nPrice is right and the service is good. \n\nI won't go out my way to come here but never disappointed when i do. \n\nThe food looked decent though i haven't had the opportunity to try it yet.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Chug Pub is a very casual sports bar that is definitely a neighborhood hang out. I only went in for a couple of drinks with my son after the 49er vs Eagles game (49ers won!)\nChug Pub is a very full service bar with many beers on tap. Numerous   TVs scattered around to watch the game. \nWe did not eat there and I really did not see anyone having a meal... So I think this is mostly a drinking joint.\nThe service was very good, and we will be back again! MORRY \nEnjoy... WEST-MORRY", "author": "Morris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Wow I'm really stoked I found this place. When I looked for great bars in San Francisco I've realized there are certain bars for certain people, and I've found it's hard to find a great place to be yourself and enjoy the weekend! Jessica, the bartender, made my experience so much fun, actually she is the reason I actually enjoyed myself there, seriously full of energy, excitement and above all she was positive! Just the reason I come to a bar!!\n\nLove this place would 100% recommend!!!!!!!", "author": "Hunter H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-24", "description": "Used to love coming here but they are very lax with cards. Someone stole mine and one bartender blamed me while one took my side. At one time they were better. Not hopeless but not fun.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Seating can be a little uncomfortable but it is a bar so it wasn't that bad. \nGreat drink and beer selection and good lord the chili cheese fries were suuuuper off the hook. \nGarlic fries are on the bottom and it's covered with delicious chili and cheese. \nHands down one of the best bar apps I've had.", "author": "Blake R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-27", "description": "WOW! This is how I need to start this out ! And SECONDLY, I would never do this ! Never write an awful review BUT between the service and food being, I dunno, soaked, peed on, OR/AND ran underneath cold water. The entire staff was taking shots, drinking beer, and playing pool OVER serving ANYTHING PERIOD. (Not saying having a good and relaxing time during your shift shouldn't happen, it totally should) BUT you also get your job done ! Needless to say, that was so shitty all around ! I'm not some picky person or judgement, but that was one of the WORST experiences at a bar/restaurant I've ever experienced in over 20 years! I HAVE to give \"one\" star in order to even post this ! But it's like negative stars if that was an option !", "author": "Cherie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Fun atmosphere. The perfect place to get together with friends and grab a drink. Get there early because it tends to get packed.\n\nDefinitely go for the beer tower! It's $35 and comes with either garlic fries or nachos - the perfect drunchies. :) The fries are better IMO - they're easier to eat, less messy and taste better.", "author": "Ava S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Rowie and Linda are awesome! And so is Jose! This place is super chill. Always a great time here.", "author": "Elton N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Chug pub is a great local bar in the sunset for you to catch all your sports. They have plenty of TVs all around the bar, varying in size. If you feel like playing pool, they have a pool table. \n\nDrinks are pretty average. We got a blue moon pitcher for $18 and the beers were $5 alone. There's towers of beer that cost about $35. My friends got two towers among about 6 of us during the Giants game so it's pretty worth it to get. It does get warm as you drink though because it's just sitting there on the table so drink fast!\n\nThe shape of the bar is rectangular so there's not a ton of room but it's decent. It can get pretty packed for big games (like the playoffs) but other than that, it's a pretty chill bar.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "Came here by myself on Superbowl Sunday, to watch it with a bunch of random people!\n\nIt was packed. I had a hard time making my way to the bar, but I finally did and ordered a newcastle and fish n chips. 14.75 or something close to that. I opened a tab because CC minimum is $15.\n\nThe fries were overly salty, I understand why... it's a bar and they're trying to sell alcohol. The fish was yummy. I'd recommend it. They give tartar sauce, ketchup, and they have sirracha sauce somewhere, just ask. When Q1 was ending, I was going to go to another bar (different bar for each quarter), I wanted to pay by credit card, so I ordered a PBR + Jager for 6 dollars. Drowned my sorrows, and moved to the next bar.\n\nThere's a good selection of beers and a full bar. The bartenders are fairly nice, funny, and some are attractive. \n\nThere are a good amount of TVs around, which made this place ideal to watch the superbowl. \n\nNow, I've been hearing about the beer tower, which I have not gotten a chance to try, but I'm so down! I'll add another review when I return for this. Definitely coming back soon!", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "I went here to for my 21st birthday with some friends and my boyfriend and we had a great time. \n\nThe interior was typical pub fair, but what I first noticed was the Pringles dispenser near the door. Genius! The bartender was very nice and she told me a happy birthday, which I appreciated. Our group settled in the smoking room, which is a little section of room open to the side walk.  \n\nMy bf ordered the \"Beer Tower\" which, in my opinion, was absolutely beautiful, haha. As the night went on we had more drinks and just had a chill time.\n\nWhen we arrived at the pub there was hardly anyone there (we went on a Saturday night) but after a while more people came in, even a group of guys in fake moustaches and beards! I wanted to know what the reason for the fake facial hair was (and to ask for one myself, haha) but they left before I got a chance to. Oh well.\n\nThe food was ok. I ordered a burger and fries and they weren't anything special, but my bf did say the food can be pretty good but it varies. \n\nWhat I didn't really like was that there were no toilet seat covers in the bathrooms, but nothing like setting some toilet paper down can fix.\n\nI enjoyed Chug Pug as my first bar and I would be happy to go again.", "author": "Adri A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-25", "description": "took me a while to finally write a review about this place. Cool bar play to hang out with your friends. You'll get a stamp on your hand when they check your id at the door. Few tv where you can watch any sports that are showing for the day. They only have one pool table...you have to pay to actually get the eight pool balls. It can get preoccupy on a busy day. \nGood beer. will definitely try other drinks the next time I come here\nGood and tasty chicken wings.\nIf you come around 8 pm even on a Friday, may be less crowded. But it can get crowded if you go during playoffs for baseball or football. This place is small so it can pack fast if you go prime time\nDepend what time you go, most of the time parking may be difficult but unless you get lucky to find parking around this neighborhood.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "Roomy local bar.  Very quiet on a Friday night?  Not my normal hood of North Beach but I was expecting it to be more lively.  I'm use to the North Star where it takes 15 minutes to walk through the crowd from the front door to the bar.  But hats off to the Chug Pub for being there for the neighbors.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-21", "description": "I just moved to SF from LA. Maybe it's the geographic difference. But this is the worst I ever been to. Food is good but took them an hour. Service is ridiculously bad. Bartender thinks she's some hot crap. Enough said!", "author": "Sibo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "This is a place I'd driven and walked by a million times over the years.  I went in yesterday and found it to have a really cool vibe.  The beer though was poured with a little too much head.  I find that to be a prevalent issues at a lot of establishments these days.  The central asian cuisine offered as pub grub looked pretty interesting.  The bartender described it as, \"it's like muslim chinese food\".  I'll be back.  They had a lot college football on and the bartender was very accommodating in changing the channel for the customers.\n\nIt looked like they had some pretty good $3 happy hour deals, though that only goes from 4 to 6pm on weekdays. \n\nThe beer tower was impressive.  I'd only seen something that looks like a 3ft bong with a tap at the end attempted in Vegas.  I was told that it contained 135 ounces.  The bartender said it equates to about 8 beers.  Not bad for $35.  The bartender said that Pizza Orgasmica also has something similar, but that they were the first in town to do it.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-25", "description": "Local, fun Sunset bar with a great rowdy crowd that has clearly just begun its drinking life. Beer towers abound and fun to boot. Just so out of the way, that unless you live nearby I can't see a reason to stick around. Definitely a good time when a sporting event is here or you're just trying to get a drink after some enjoyable packed event in Golden Gate Park.", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-23", "description": "This is my friends' newest hangout spot. I finally decided to grace my presence upon them this past weekend. Haha. =P\n\nWe got the beer tower. $30 for 3 liters of beer. Kinda pricey. But it includes a free appetizer per tower. The garlic fries and nachos are pretty good. Drawbacks about the towers: nothing to keep the beer cold and must pour verrrry slowly to avoid the head. \n\n$1 pool and 50 cents Marvel vs Capcom. Not a bad way to spend Saturday night! =D", "author": "Marti L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "- 1 star for size of the bar, but this could easily be 5 stars (only bias is because I'm an LA native, and really used to spacious areas)\n\nIn other news: BEER TOWER FOR $30-35?! COMES WITH A FREE ORDER OF FRIES OR NACHOS?!\n\nI'M SOLD. I'M DONE.", "author": "Jeffrey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Hey! Lets go to Pub Chug? Ug Pub? Snug Mug? Oh. Chug Pub.\n\nThis was my first time back in years... celebrating a coworkers bday yesterday. \nAs other have mentioned, this is your standard neighborhood dive but with a ton of charm. \nWalking in, youll notice a long, narrow bar with a pool table in the back.\nHH is from 4-8 with $3 beers and your standard pub food ranging from $5-$12.\n\nOur group got the wings (which had the buffalo sauce and ranch on the side), fried mushrooms, nachos with fried chicken on top (yes, you heard dat right) and the waffle fries with what seemed like cheese-wiz.\nAll food was standing, nothing to write home about.\n$3 big daddy IPAs were notable. We also ordered a few doubles of galvatron (151, patron, makers mark) which came out to $8 which was solid seeing as on polk street it can go for +/- $20.\n\nWhat warrants a review was the patrons and bartender.\nAll patrons are the after-work locals who are just there for a damn good time. We occupied the pool table for a while but as others waited, we all chatted up and had friendly competition amongst eachother. It was a mixed bag of people yet everyone was fun, offered us drinks and even got us a round of pool. The bartender was super nice, had heavy pours and chatted up the whole bar as if she were one of us. These neighborhood dives can be a hit or miss when it comes to service, but chug pug slammed dunked it.\n\nAll in all, solid. Will absolutely be on rotation so I can give underdogs a break. wont be my all-night-long destination but i can see myself starting here to get the momentum going. \n\nCome in, chug a beer, shoot some pool and have a jolly ol time.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "I'm a lush that doesn't like bars (a total oxymoron); I prefer lounges instead. BUT, Chug Pub is my favorite bar in SF!\n\nPROS:\n*Strong drinks and fairly priced drinks (~$8)\n*HH is 3PM - 8PM ($3 beers and $3 well cocktails)\n*BOMB ASS GARLIC FRIES\n*Friendly bartenders\n*Chill crowd that's not too Asian (i.e. FOBs) like other Sunset neighborhood bars\n*Flat screens, pool table, and video poker machines\n*Enclosed outdoor patio for smoking\n\nCON(S)\n*BEWARE of the concrete mystery log right outside the front door. I've always tripped over it or fell backwards over it. *sigh*\n\nI've only gone to Chug Pub on weeknights so I'm not sure how it's like on the weekends. But if you're having one of those \"days\", the $30 Chug Tower is the be all and END all of it.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "Theres a reason this 'pub' is always empty and its because they try to steal your money. Even though I've been a loyal customer, I finally had enough last night when they tried to double charge me for drinks I did not have. After inquiring about it they tried to to say that 'I had one too many' and had no idea what was going on. Now, maybe it was the bar tender that night who was new, but either way I had to fight to get my money back, and that is not an accusation you should be making of your customers when you run a bar. That is not how you run a service and not how you retain a customer who has been going to your bar for over a year.", "author": "Don H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "Personally, I think the food is hit or miss, but it is nice to have the option. The drinks aren't overpriced and I've found the bartenders to be very friendly towards me. The vibe is also hit or miss--sometimes it is more crowded, sometimes it is completely empty. Haven't quite figured that part out yet, but it is a cool spot to kick back in my opinion.", "author": "Elise S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-03", "description": "This is more of an FYI review since I didn't really do anything here.\n\nI came here because another bar we were at did not carry the Pac-12 Network. We called this place and they claimed they had it. We arrived here and it turned out they didn't and they didn't have their information straight when we called. So in case you want to watch any sports, just be aware that these guys have DirecTV and are limited to whatever channels are provided through that service. And you should take what they say on the phone with a grain of salt.\n\nAlso, this place was incredibly empty at a time when other bars were packed. You can take to mean either a) they offer a quieter and roomy place for a drink, or b) they're not as good as other places.\n\nThere was one super awkward guy who was here watching a Giants game alone here, and as soon as we went to the counter he started boasting of his amazing tech and hacking skills. Not sure what that says about the clientele here.", "author": "Allen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "Thanks to one of my besties (whom I haven't seen in almost a year) who dragged me and Lovie out last Friday night. This was the location of our impromptu reunion.\n\nWhen we walked in and saw our friends, there was something else that caught Lovie's eye: this cylinder full of beer! Oh boy, I haven't seen his eyes light up so wide since the first time he laid eyes on me ;-) Lovie was so amazed at the sight. And at 30 bucks for 7 pints of Blue Moon with an appetizer of choice, we were chug chugging the night away.\n\nMucho props for serving food all night at good prices. 5 bucks for a basket full of onion rings were greasy deliciousness. And those cheese and salsa fries were just as good! Boo for closing at 1:30. With the pool table, video games, TVs, and hanging out with good friends, I wanted to stay longer!\n\nIf you live in the Sunset, you have to check this place out!", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "Linda is the sexiest bartender of LIFE. I go just to watch her beautiful arms pour amazing drinks. Her long, luscious hair blows in the wind like in the movies. It can't get any better than that on a Friday night.", "author": "Marla M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-07", "description": "This is one of the worse bars for a sports bar. \n1) if you want an Asian crowd, this is the place for yah! \n2) if you want an Asian crowd that caters to \"buddies and friends\" then work your magic and be friends w/ them. BECAUSE you'll have two Asians save seats for like half the bar for more Asians to come and it'll be all ok. \n3) there isn't even decent seating or \"hang out\" areas.  \n4) there's window area that's opened and since there aren't a well facilitated \"smoking area\" the smoke will just come right in. \n5) a pitcher of beer is also very expensive, $18 and it's not even a regular full pitcher. it's like come on, really?!  with usual pitchers, you get at least five pints, but with there's you only get 4 max.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Wings are pretty good. The mini mushu is excellent with spam and egg. Great neighborhood gem.", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "I once saw somebody fall asleep laying down on the sink counter.\n\nGranted, it was his birthday.\n\nAlso, he was my buddy.\n\nAlso, he climbed up, after washing his hands.\n\nAlso, we might have helped him.\n\n9/10, sink counters are sturdy", "author": "Ben T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-03", "description": "+Happy hour 4pm-8pm!\n- Their clock on the wall is 20-25 minutes fast in order to regulate drunks on the weekends lol\n- Cash only\n+In my neighborhood with great prices\n+Good place to watch games or just to stop in for a quick drink\n+/- Staff is friendly and inviting. Some bartenders make better drinks than others...\n\nConclusion: Get the beer tower and come during happy hour! I think its the latest one in the neighborhood", "author": "Julia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-19", "description": "Stopped by here with some friends who insisted on buying a few drinks before heading home. I've been wanting to grab a drink for a while so this worked out just fine for me.\n\nChug Pub is easy to find, but it's hard to find parking. \n\nThe place itself is pretty spacious and nice. They have a good food/snack menu but we were all too full to try anything at the time. I also like that they have a separate room for smokers.\n\nThey had a special on PBR's and Jager shots ($6 for both) so we had a round of that. It was my friend's birthday so he got stoplight shots. I ordered an oatmeal cookie and a chocolate cake shot for myself later on. \n\nAlthough the PBR and Jager deal seems awesome, don't get it if you don't one or either of them. My friend enjoyed his stoplight shots, but the shot glasses were stacked in reverse? We were confused but he took them in reverse order anyway based on the assumption that the bartender wouldn't leave the crappiest for last....but the crappiest was definitely last. \n\nI tried to order an oatmeal cookie but the bartender working that night didn't know how to make it. I didn't mind that so much since I knew the recipe, but in the end she couldn't make it because they didn't have one of the ingredients. Slightly annoyed because the whole time, she was very slow about taking our order and making the drink (and it wasn't even BUSY). She let me have the incomplete shot for free though, which was cool\n\nThe chocolate cake shot she made was pretty good. I didn't think it really tasted like chocolate cake but...oh well. \n\nOverall, okay place. I wouldn't mind going back because it seems like a good bar.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-20", "description": "took me about over 10 minutes to get someone to serve me... \nbut if my friends want to come back, i would. just for them.\nservers are very immature and played around too much. \nparking sucks... street and its by a busy street. \nresidential area too.. so we have to be pretty quiet after the bar closes.", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "Came here to continue my night after Academy of Science Nightlife, and it was not a bad choice.  The energy here is amazing.  It is a cozy little dive bar where drinks are strongly poured and cheap.  Their wide selection of brews really impressed me since I am a beer drinker.  Bartenders are nice enough, but sometimes they get a bit busy so you might have to wait a while for your drinks.  \n\nPROTIP:  Crowd here is primarily Asian.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "DO NOT ORDER the \"Big-Plate Chicken (Spicy)\" otherwise known as Dapanji *unless* you know what you're getting into! This is a very authentic dish made with some ingredients not listed, like Sichuan peppercorns. In our opinion they used wayyyy too many and it completely ruined the dish. Our mouths were tingly and our lips were numb, and you cannot pick them out because they're way too small. Spicy is the wrong word - it's more vinegary/salty and tingly. Very strange sensation for a newcomer. That said, drinks were cheap, Samsa was okay, and my chow mein was delicious. Great sports bar to watch Warriors games!", "author": "Katie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "Strong drinks + very tasty curly fries AND garlic fries = rowdy 5's who think they're 10's with filthy fingers.\n\nAlways had a good time here, more so because of the company and not so much of this particular joint. Nonetheless, it's a nearby place for us to meet.", "author": "Athena L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-17", "description": "I had a buddy order a Jameson and Ginger for me. The Jameson and Ginger were both in separate cups. Really? Do you not know how to mix the 2 together? I would think you know how to mix a simple drink like that since all the other bars I've been to can do it. Then when my buddy tried to ask for the drink to be actually mixed, but he was just handed a pint beer glass.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-26", "description": "Chug pub is a great little sports bar in the Sunset near Golden Gate Park. It's got all the games playing and their happy hour is amazing. Mostly, you can get all drafts and well drinks for $3 if you come for happy hour.  It was great because I could afford to buy a bunch of fries for my group of friends. We were able to catch the A's playoff game without feeling too cramped or overwhelmed my hardcore fans. \n\nThe seating here is a little tight and parking is definitely tough to find. Also, if you don't like sports and just want to hang out it may be tough to talk over the speakers blasting the game. However, the service is very accommodating and the bartenders and amazingly nice and friendly. \n\nOtherwise, the beer towers and weekday specials are tantalizing and I'll hopefully be back to take advantage of those deals.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-08", "description": "Pretty much my FAVORITE local bar in the Sunset (although i know it's slim pickins out here, regardless, it's still a class-act joint). Anyone who kicks it at the Chug Pub has obviously fulfilled the prerequisite of just being cool. Everyone, from the attentive bartenders, management, David the cook/barback, and even the local patrons are all pretty chill and super nice! \n\nPROS:\nAwesome happy hour: $3 beer and wells from 4-8pm\nDelish pub grub: Chicken tenders, wings, and the burger I love!\nHella TVs: you're free to request the game of your choice\nBathrooms R Clean! 'Nuff said.\nTHE VIBE! super chill, fun-loving, generally nice crowd n staff.\n\nCONS:\nI'll have to write another review when I think of some ;)", "author": "Janet C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-06", "description": "Went here after Off The Grid to get some drinks.  The prices are fair but there was an oddity.\n\nAbove the door, there's a sign that says \"Extended Happy Hour - $3 from 8PM to Close\".  The first round of drinks that was bought was $3, around 8:30PM.  The second round at around 9:15 was $4.\n\nOther than that, the drinks are good, the atmosphere is awesome, and there's a pool table.", "author": "Wally W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-15", "description": "The bartenders can be hit or miss here.  Their happy hour special is actually pretty good,.\n\nMy gripe is with the Manager (owner) who I had a verbal disagreement with.  He throws me out and tells me to leave.. well, as I am staying at my friends place the building over I go there... Well this is to close for comfort for this guy.  I tell him I am not in front of his business I am in front of my friends building.  He tells me he's going to call the cops.  I tell him go ahead, I am not doing anything wrong.  He starts getting confrontational with me trying to incite me.  Him and his cook.  As they are trying to shove me away.  I tell them not to touch me and and put my arms up just declaring my personal space.  Well I graze the pot bellied cook in his fat stomach.. and on no.. all of a sudden I punched him?  They call the cops.  Cops come.. they tell their really stupid story.. fake story.  Seriously, these assholes are abusing City resources using false Police Reports b/c of a disagreement with the manager.\n\nNothing happened of course, b/c I didn't do anything wrong.  But, calling the police under false pretense?  You should be fined or arrested for such bullshit.", "author": "Juan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "Drinks are cheaper then a lot of bars. They have certain beers each day for $2 that's great! There's a pool table and plenty of tvs and chairs!\n\nDefinitely a cool bar to check out. Chill enviroment! People/ staff here seems cool", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "Everything is great about this place, but it's always so crowded. Hard to come here with a big group :/", "author": "Anthea W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-29", "description": "When I walked in, the very pretty but very disinterested bartender look a little put out that she had to look away from her phone for a few moments to help me. So she...didn't. At least not for a few uncomfortable minutes that I spent drumming lightly on the bar while she smirked at her phone. I ordered a Guiness that I pretty much chugged and split.\n\nNothing remarkable about this place except maybe it's proximity to the park. But maybe that's the way they like their drinking in that part of town. Staid.", "author": "Jim Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-14", "description": "Service:\n-Friendly/cute bartenders.\n-Someone comes and cleans the tables often. YAY\n\nDrinks:\n-Chug Tower: Comes with fries or nachos. I recommend the fries over the nachos just because its better. Chug tower is a great deal and also makes you look cool.\n-Shots: If I could remember everything I got here I would write a simple review on it but due to the nature of a drinking joint, I am unable to. Ask for a birthday shot on your or your friend's bday! They set it on fire! Bartender also challenges you to a game to play while you drink it.\n\nOther:\n-One pool table. Always occupied. Don't even bother.\n-Great place to watch sports.\n-Convenient location with lots of parking.\n-Good music.\n\nShould you stop browsing yelp and drink here?\n-YEP, what are you waiting for?", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "4 stars\n\nTV GOOD!!\nPOOL TABLE GOOD!!\nNACHOS GOOD!!!\nCHUG TOWER GOOD!!\n\nI need not say more but for folks that don't know let me put a lil more out there.\n\nGood spot to watch Giants play. or anyone with group of your closest 5-25 friends, rowdiness uncouraged when your home team is losing or winning, chill spot, very open, waitresses are friendly and all smiles, you can hear beats being played from the inside sounds like a car on the outside that needs dyno installed haha, but if they were to turn down the bass and up the treble a lil you can tell the speakers would knock hahaha\n\nfun group of characters mostly the patrons have something funny to say or yell out, it is ok to be heard here. 3ft tower of chug is a definite must try just for you or your other friends if you want to share haha, nachos are heavy and filing, tvs all over the bar and pool area. definitely a chill spot for local team games.\n\nfood **** only tried the nachos I would come back for more\nprice $ beers on tap if not 3 foot chug tower is a plus\nservice **** friendly waitresses\nambiance **** open, spacious, friendly, rowdy, chill, with beats bumping making the walls vibrate hahaha", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-21", "description": "-1 star for floors being covered in gross food that people had dropped, napkins, and dirty bathrooms. Like completly disgusting\n-1 star for the three bartenders spending more time with their friends who were there than serving customers (there was maybe 30 people total in the place)\n-1 star for overserving multiple customers. Granted people should stop drinking on their own but when a guy is falling over or sleeping at the bar they should not serve him more beers and shots. We saw several such people and a couple of the guys were really bad off and the bouncer did nothing. I am sorry but the drunk guy trying to grope patrons and unbuttoning his pants in the bar is YOUR responsiblity to take out.\n-1 star for being bitches about serving me water. I am the bloody DD sorry for living!\n\nOnly redeeming part of this place was it was somewhere for us to sit down and the food actually wasn't bad. I don't care how this comes off but I honestly felt that because i was with a group of white people we wre ignored. They weren't over burdened they were simply too busy doing shots with their friends. Sucks for the owner of this place as I repeatedly heard one of the female bar tenders tell her friends \"you dont have to pay this is on me.\" as she poured multiple rounds of shots out. Maybe if they had been less drunk they would have served us a littler better.", "author": "Meg N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-06", "description": "for the sake of not having this review removed i'll just say, RUDE unattractive bartenders\n\nAlso quoting Gianna's review:  \"However, the only thing I did notice was there wasn't a large.....racial diversity. My friend & I were the only ethnically different ones at this particular pub (at least the entire night when we were there!) and normally that wouldn't be a problem but I definitely felt a little out of place at the end of the night as I felt like we got a few looks as though people felt we didn't \"belong\".....its mostly a hangout for Asian ppl", "author": "Sang L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-21", "description": "This review has nothing to do with Chug Pub as a pub or venue.  It has nothing to do with the decor.  It has nothing to do with the bar prices, the food or even the service.  \n\nWhy?  \n\nBecause every time I try to go to the Chug Pub, the place is always CLOSED!!!!  \n\nYou would think that as a \"sports bar\", you would be open (even if it means outside your normal hours) for major sporting events.  Alas, the answer for this establishment is no.", "author": "Brett L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-07", "description": "Been here twice with some friends and watched the Olympics here a few days ago. Both times I've gone, the place has been pretty packed, but the bartenders are pretty friendly and usually get your order in fairly quickly. The place has a typical pub feel to it - loud music (basically stuff you hear on 94.9 or 99.7 which I found amusing), lots of conversations going on, and people having a good time (some a bit more and crazier than others - it got a bit rowdy a few times throughout the night). From what my friends and I have seen, it seems like the crowd is a bit older, but if you're looking for a place to get some drinks and watch a game, this place will do just fine. In terms of transportation, the bar is only a block from the 28 and 29 bus lines and there's street parking along Irving or on 20th - might be tricky but you'll probably just have to park on Irving if it's past 8 PM or so.\n\nAs for the drinks, the Beer Tower is pretty ridiculous I gotta say, but is definitely a fun way to share a couple of drinks with friends. There's a decent number of beers on tap and basically you can choose any option so the Beer Tower is a pretty good deal - basically came out to be $35 for 3 L of beer and a basket of tasty fries for all you who usually have the drunchies. All in all, a decent place to spend a night out with some friends.", "author": "Cheston W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-20", "description": "I hardly ever review pubs...why? Because I hardly ever go to them these days....\n\nMy friends visited from Portland and wanted me to show them SF. We did so by bus and BART from the East Bay.... n proud of it! Walking all day around the hills and crossing through GG Park left one member more parched than the others (the male member!)...\n\nWe found this cute, charming pub during their HH and he enjoyed the set while we chatted. The pear cider was really, really excellent and the selection of beers on tap was plentiful. From a female perspective, I think the place is really charming! Affordable pub-going....\n\nWould stop again for a pint any day....", "author": "Jana C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-29", "description": "Wha???? Why??? Why do people love this place so much? From the time we reached to front door to the the time we left I never felt safe. I'm not sure why but the uneasiness never subsided. (Props to the gal that complimented by scarf in the bathroom!) \n\nThe boys love this place because of the \"Beer Tower.\" For $30 you get approximately 8 beers in a crazy tower-with-spout contraption. The boys timed their \"team chug races...\" $60 gone and 10 minutes later- DONE. Really?\n\nThe bartender was friendly, and I enjoyed picking music off the jukebox...but nothing about this place would make me venture back.", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "Tons of Beer and the Beer Tower with make you an official alcoholic in no time!\n\nCute Bartender make waiting to order a pleasure.", "author": "Mario A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-05", "description": "I love everything about this bar. Location, food, drinks, bartenders, atmosphere, the people!\n\nParking can be a headache to find sometimes but a little walking does a body good anyways.\nThere is usually parking a block down on Irving, or in the parking lot but the only place I don't want to park in front of is a bar.\n\nGreat alcohol selection, they have the good stuff that other bars don't usually have.\nMust I mention their BEER TOWERS!? Perfect for a group, and you can get whatever beer you want!\nIt also comes with a free side (nachos, fries)\n\nShots are huge by the way... Huge meaning like a double shot. I always walk away from this bar drunk, or close to drunk.\n\nPool tables, TV's, huge tables for big groups, JUKEBOX?!! This bar is just plain awesome.\n\nSometimes I even come if I can't drink just for their garlic fries, which are so addicting.\nI'm still dying to try they're samosas, my friend always rants about them but they're never serving it when I go. :(", "author": "Jenny Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "i like coming here with my friends on nights when we want to chill and not go HAM. I didn't see anyone mention this below me, but there are also (dusty) board games behind the bar. they've got battleship, chess, jenga, or connect four! factor in a beer tower and garlic fries and you've got yourself some ridiculously competitive drinking games. just a note though, jenga pieces are not the biz when you knock the stack over and have to pick up all the pieces off a grimy bar floor...\n\nthe pool table is also pretty legit. however, it's $1 per game so you'd best be at least somewhat of a pool player and not aiming to just hit balls around for fun. i've also had some problems when the balls aren't released and get stuck somewhere on the way down after you insert the money. no bigs... just stick the cue up into the hole where the balls are and wiggle it around a bit  (get your minds out of the gutter this is the only way I could describe it!) and get your game on! \n\nother than that, i prefer chug pub for board games, alcohol and just a good night out with friends. I wouldn't recommend this place if you're coming to watch sports games, because the watching area is not very large. the only way you could get a prime viewing seat is if you're sitting at the bar itself.\n\nlast note - credit/debit cards have a $15 minimum! sooo either get your drank on, or remember to bring some cash!", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-03", "description": "My first time at a bar! The food was pretty good. The service seemed to be meh. They have a pool table and couple of tables where you can play Pac Man which I thought was pretty nifty. Friends got me AMF, Gummy Shot and a Fireball. Excellent fun! Might come again (:", "author": "Rochelle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-01", "description": "Stopped by Chug Pub after dinner one evening with some friends. It had an Irish pub feel and was fairly spacious with adequate seating. Also equipped with a pool table and an old school arcade video game. I never knew about beer towers until I witnessed them here! \n\n$30 per tower of beer (approx 7 pints) and came with fries or nachos...score! (http://www.yelp.com/biz_photos/rPwB56EQ9JfEo2mN24fqOQ?select=9JFFMAklyYHz54C46XpaIA) The garlic fries were pretty addicting but the nachos were just alright. Not the best deal for your money in terms of the beer but it was still a fun experience. The owner/workers were polite when kicking us out at the end of the night too. haha Even gave us bottles of water for free!\n\nGreat hangout spot for a chill night in the city!", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "I pass by this place everyday and finally went to try it out for the first time this weekend- INCREDIBLE. Seriously a wonderful bar! My boyfriend and I went to watch the Patriots game around 2ish on a Saturday. It was pretty empty at first but within an hour it filled out but never got too crazy crowded. There are a million TVs which was perfect. We sat at the bar and got a pitcher of Blue Moon which I think was $16. We also got an order of the Ultimate Fries which took bar/pub food to an entirely new and unbelievably awesome level. Get those fries, you will not regret it! Also, my boyfriend ordered a coke as well which was comped when we got our bill- so great. We really had such a great time and we'll be back for sure!", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "Great little bar right by Golden Gate Park around 19th Ave. It's most known for their tower. A tall cylinder of your choice of beer to pour at your discretion. There is about 7 or 8 pints in a tower and its about $30. It comes with your choice of nachos or fries, which is clutch when you get the hunger pangs from drinking.\n\nGet the Tower!!\n\nAside from the tower, its got a bunch of tvs, a pool table, and some tables to sit at. Great place to hang out. The bartenders are always super friendly. I come here to watch sports a lot and their really good about changing the channels on their many tvs to whatever you ask. They also, have food, but you probably don't want to order any of it. It doesn't taste too bad. They have hot dogs and hamburgers and stuff and their pretty salty and the prices are a little steep. Happy hour is good here. $3 for most draft beers and I think Amstel is $2 if you want to drink that. \n\nThere is a outdoor room in the back where you can smoke, which is nice. The bar gets crowded sometimes on the weekends. Friendly environment and great service. Go get a beer here.", "author": "Arthur C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "So i am totally here w/my friends after i told them how awesome it is to get a tower of beer & complimentary nachos (or fries) for your drunchies! Well we paid the usual fee for our tower + tip & received no complimentary item! Turns out they serve food now so you still have to pay the same amount for the tower & thats all you get :( kinda sucks to know that youre not getting the same service when paying the same amount as before. So for everyone out there, the beer tower is sold alone, you get nothing extra! :/", "author": "Jeanette L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-16", "description": "This is definitely a cool little hangout spot and I can definitely tell it is a spot where a lot of locals hangout on a regular basis. I came here on a Thursday night after going to another event, showed up around 10:15PM and it was pretty busy with a lot of people just sitting hanging out or playing pool. It's a small little place but it does have a homey vibe to it.\n\nThe drink prices here weren't too unreasonable. We had two shots of Patron, Cranberry&Vodka, and 2 Coors Lights for $27.50. That's definitely a lot more reasonable than many other bars I've been to around the city and even other bars in Downtown San Jose so I couldn't complain. The bartender I encountered was really friendly. She made a decent drink, she smiled at us, helped us right away, made the drinks quickly, etc. We didn't have any problems with the service. In fact, when we went to close our tab i felt bad for her because she was the only bartender and was busting her butt helping everyone super efficiently and you could tell she felt bad once she had noticed us and couldn't help us right away.\n\nI can't comment on the food here because I didn't try it, but I did notice a lot of people eating and the food did look good. However, the only thing I did notice was there wasn't a large.....racial diversity. My friend & I were the only ethnically different ones at this particular pub (at least the entire night when we were there!) and normally that wouldn't be a problem but I definitely felt a little out of place at the end of the night as I felt like we got a few looks as though people felt we didn't \"belong.\"\n\nIf I was in the area I would definitely come back here and get the Beer Tower if I was with a group of people or just grab a quick drink otherwise.", "author": "Gianna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "$3 beers and well drinks during happy hour. \n\n$30 for a ginormously large tower of a beer \n\nEnjoying the company of good friends over good beer at a decent price while inebriated....PRICELESS.", "author": "May D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-29", "description": "The food was OK. The bartender was kind of low energy and came off kind of not caring. I asked if they had potato skins and my reply was basically \"no look at the menu.\"", "author": "Zachary H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "THE GIANTS WIN THE WORLD SERIES!!!!!!!!!!!!\n\nThat's the memory I associate most with Chug Pub. I was sitting at the bar shoulder to shoulder in black and orange watching as the Giants won it all. People started chanting, drinks were spilling and the bartenders took out champagne bottles to spray on all the patrons. The party continued all night with the celebration spilling out into the street . \n\nThey specialize in the giant tower which is probably good for 3 or 4 people and comes with an appetizer to munch on. Don't even bother with anything other than the garlic fries. \n\nPretty much all locals on the weekends and they all seem to know each other. Unless going to meet up a lot of people you know or watch some epic hometown sports team kick ass, this might not be the best place to chill.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "SAY WHATTTTTT? CHUG PUB!!\n\nsounds deadly doesn't it.  After a nice dinner in the city, we decided to hit up Chug Pub.  It was our first time and we found this place through Yelp ( for the 100th time).   Honestly, I didn't even know a bar existed on Lincoln Way, BUT, when we mentioned Chug Pub to our friends later on, many have seemed to have heard about it.   We were able to find street parking a block away.  We walked over and find this place dead :( Well, we expected.  \n\nThere were only a large party of 5 -6, 2 parties of 2, and there was us, a party of 3.  Nevertheless, the atmosphere was very chill.  Loud oldies were playing throughout the bar.  Flat screen TVs were on some sports channel.  There were also a pool table available.  Being on a Sunday night, there was only one young lady at the bar counter serving the rest.  \n\nWe ordered a pitcher of Blue Moon (almost always) for like $14? Sat and sip on our beer as we enjoy little chats.  The other parties were also doing the same, no one was really trying to get hammered on a Sunday night. haha. My boyfriend and our friend decided to order a Ghost rider for the first time.  The bartender was really nice and friendly and explained what it was made up of and how they should take it.  If you don't know what a Ghost Rider is, it's basically a drink mixed with 5-7 different kinds of hard alcohol in a whiskey glass, lighted on fire, and you chug it through a straw.  According to my boyfriend, it gets quite hot as you get to the bottom of finishing the shot.  \n\nWe want to try their beer tower next time we go.  It's suppose to come with fries!  Happy hour is from 3-8pm with $3 well drinks! I am hoping to move Chug Pub to 4 stars :)", "author": "Stephy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Came here to watch my gf do her league night for bar pool\noverall nice bar, very laid back, very safe neighborhood\ndo drunk idiots when i came except for one guy who was from the opposing team.\ngreat lay out, tv's everywhere.\nbartenders seem nice\nparking is usually not a problem, that is if you're willing to walk like 1 block and park somewhere on irving\n\ni personally dont drink because i am allergic but i wouldnt mind coming here to hang out with friends if they wanted to get a couple of beers", "author": "Andi I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-31", "description": "Place is still great. I come here less often now due to me not living in the city anymore, but when I have a chance I make sure I drop by. Even though my face isn't recognized all the time when I come back, I still get great service. In fact, a few days ago I went in early hours so my friend could try out the place. We had a limited time frame due to us having a schedule of things to do that day so the place was empty when we came. Either way the new bartender, Rowie, still treated us with a lot of respect. Gave a good image of this place to my friend before he flew back to LA. Thanks Rowie and I hope to see you again when I drop by for the super bowl. \n\nP.S. She gave me candy so if you read this Rowie I expect some candy again next time, haha.", "author": "Sonlay V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-08", "description": "I have been here multiple times, and I have come to the conclusion that I am not the biggest fan of this place. I related a lot to Brian L's review because to a much lesser degree, I also had a bad experience with the bartenders playing favoritism and ignoring me for some reason I can't explain.\n\nThe last time I was here, I felt like I was disrespected. There were two bartenders that were WAY more concerned about flirting with some ugly drunk boys than they were about taking my order for drinks for my friends. What made matters worse was the person I presumed to be the manager at the time had to signal TWO times for one of the girls to come over to me. The first time, the one bartender who was not busy didn't look over at me, but instead rolled her eyes and told the guys she was only wanted to help them. Then on the second attempt the manager literally tapped her on the shoulder and pointed his finger at me, and the she walked over with a pouted look on her face. Sorry chica, but your taste in boys suck, and I wanted my pre-birthday celebration drink.\n\nThen she took her time (about 10 minutes or so) to make the worst margaritas and whiskey sours I have ever had in my life. Not all Whiskey Sours are perfect, but how does one screw up a Margarita?\n\nThis place is good for groups, so most likely if I ever had friends that wanted to come here, I would still tag along because I like my friends, not because I like this place. I would just have to strategically plan out which one of us in the group has the best chances of winning the affections of the bartenders so we all don't end up with crappy drinks that take forever to make.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-08", "description": "The Chug Pub is where it's at after other bars close early. My friends and I are here whenever we have a late night. Staff is always friendly and fun. Drinks aren't overpriced and food is decent. No cover charge, but make sure you have your ID. This is one of the few bars that always has a doorman checking ID's, at least all the times I've gone.\nThis place is a smaller bar but still has a fun jukebox, pool, and some lounging areas. The nice part of it being smaller is that even though it may get crowded, everyone is there having a good time and I've never run into any trouble.\nIf you're looking for a fun atmosphere with friends, come here. You will have fun whether you're looking to start drinking, already been drinking, or just plain sloshed.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "The first time I went to Chug Pub was because my roommate used to go there before I moved in with her. I decided to try it out because we only live 2 blocks from it, out of the few times I've been there Alex has been there most of the times and she is super friendly and pretty damn hilarious. I'm a 3 drink kinda girl where I just don't know what is good and I'm not about to buy a drink if I won't like it, and she listed drinks that sounded amazing. Next time I go I'm having her make me a mojito. She makes a mean long island though, props to you girl.\n\nI plan on only going when Alex is working because she made it such a fun experience, and even with one of her coworkers who I could tell English wasn't his first language she was totally nice and laugh-y with him and not berating him like a lot of bartenders I've seen do. I'll be in soon for happy hour with Alex!", "author": "Hal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "The other reviews already name it's best features-- good prices, cute bartenders, good food.\n\nEnvironment-- is just okay! Not a place I would come alone or expect people to be friendly. Meet with friends, play some pool, drink cheap drinks! No racial profiling, but crowd is predominantly Asian (I am Asian), although it's become more diverse as of late... :)\n\nBe weary, try your best not to get wasted here.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-26", "description": "Did I wait too long to write this review? Maybe because I'm too busy coming here. ;)\n\nI love Chug Pub!!! Such a great hangout spot to watch the games and hang with your friends. $3 all beer during happy hour on weekdays (till 8pm) and $6 well drinks. Or you can do $6 PRB specials all night loooooong.\n\nAll the food taste great here. I especially love the chicken tenders and fries. And onion rings, and nachos, and curly fries... and......... YOU GET THE POINT.\n\nGreat staff, atmosphere, music, full bar and variety of draft/bottled beers.", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "I like this bar, you know why? because of the cool Pringles vending machine they have haha, look at my photo, so cool. Nah, not only that they have a great variety of beers and ciders also a TV on every freakin wall spot if you want to watch a sports game. I also tried my 1st Snake bite, Guiness floated on top of pear cider, weird. The only weird experience I had was a girl telling me she was pooping and her stall door was wide open then she proceeded to read a poem off the wall to me while I was in the other stall peeing..ummm awkward!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "We made the trek (okay, more like a quick taxi ride) to the Outer Sunset for my cousins birthday celebration.\n\nThis was my first time at Chug Pub and upon ordering at the bar, I could completely see why so many people love this place - the beer tower! I was really tempted to order it and share with the boy and his roommate but decided it was probably not a good idea, haha. Maybe next time!\n\nChug Pub is on the smaller side but there is plenty of seating, flat screen tv's perfect to watch a game, and a pool table in the back. It's definitely a more casual, neighborhood bar perfect for a chill kinda night with some friends.\n\nI don't know if I'd make the trek out there again, but if I'm ever in the area I would definitely come back!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-28", "description": "In my opinion, any bar with a 3.5 liter tower of beer for 30 bucks is deserving of 5 stars simply for its ingenuity, creativity, and room for more. Chug pub screams out for a good time. happy hours go from 3-8PM, 3 dollar beers and 3 dollar well-drinks, unbeatable anywhere else.\n\nThe BEST item on the menu is the garlic fries. Hands down, no contest, BEST GARLIC FRIES in town. trust me when i say: grab a blue moon and a basket of fries, turn on the game, and the time of your life can then begin. I'd bring all my friends. There is also a pool table in the back, darts, and lots of seating where you can get shitfaced. \n\nI will definitely bring my strongest friends here to challenge them to a chug off for the beer tower.. but i'll have to see when.\n\n-wifive-", "author": "simon k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-30", "description": "I want to like this place because I live nearby, but they don't have a great beer selection. Even worse, their patrons are constantly puking on the sidewalk outside. If a week goes by without any puke, maybe I'll up it a star rating.", "author": "Kerry S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "I was a little weirded out by the door guy/bouncer in the fancy suit who gave us a hard time about coming in at 5:30 p.m. when the place was not crowded.  Mister, this is the Sunset, not some swanky nightclub.   We waited for 15 minutes for the bartender to take our drink order (again, not crowded in there) and when she didn't we gave up and left.  So why the two stars? I love the idea of getting a gimormous tube of beer to share and there was a friendly group who offered me a beer from their tube while I was waiting.  So at least the crowd is nice and the tube of beer looked tasty.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "Small.  But a great bar! Bar box pool table that is not lop sided (yes i shoot pool) good selection or beer on tap.  Good bar food.  recommend the Waffle fries and many tv's to watch your sports!", "author": "Steven M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "I love this place! I never come here without buying a tower! If you don't know what that is GTFO cause you don't belong.\n\nJ/k it's a tall cylinder of alcohol poured out from a spout. $30 for any beer u want, and  you get either fries or nachos with the purchase. Drinks for usually 10 people. So that is a steal! \n\nThe bar back and the bouncer knows me and my friends cause we go so often!\n\nThe only thing I dislike is the small table area. If your sitting on the outside and people are playing pool, you have to watch out for them.", "author": "Brendan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "Maybe its me and I don't enjoy Pubs/Dive Bars. Pretty small, dirty, and grungy looking. The tables near the pool table smelt like puke, (after wiping them down with a dirty towel - that probably did wipe puke earlier on.) I kept my purse on my lap the entire time. I couldn't wait to leave. Why?!?!?", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "Great neighborhood bar!  It's the perfect place for friends to meet, whether sitting at the bar or at a cocktail table.  It was definitely busy on a Friday night, but we didn't have problems finding a table and seats or ordering drinks.  What more can you ask for?", "author": "Audrey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-11", "description": "Last day of a vacation taking me through Vegas and San Francisco. Usually a huge Vegas fan but lost a ton of money and got an insanely intense head cold early. Came to San Francisco late in the vacation and stopped here. It has been the absolute highlight and the bartender Alex has been amazing. If I didn't live 3000 miles away, I'd be back here next weekend.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Great happy hour! Not a fan of the smoking section, sometimes the smell filters through the window. Gross! Food is decent, I recommend the Double D's and the tacos. Bathroom is barely decent. Servers have always been nice. Great chill place to hang out and watch your game with a friend or two.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-03", "description": "This place should get more stars considering the sorry state of the sunset bar scene. This place is solid little bar - though the juke box gets a bit loud for conversation .... if you're into that sort of thing", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Came here on a Saturday afternoon after playing drunk kickball in golden gate park and had a decent experience. The beer and food was affordable, and the wings and waffle fries were amazing. The only downside was that I noticed a slight lingering puke smell throughout the place and the bartender was hard to get ahold of. If not for that I would have given 4 stars!", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "Tower of beer? Good beer and good friends will result in a good time.\n\nThis is a pretty chill place, the crowd seemed to be pretty friendly, gets packed pretty quick but you can't pretty expect too much moving space in a bar right? Definitely would come back here", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "After spending a couple hours walking around Haight Street and checking out the Conservatory of Flowers, my friends and I headed over to meet up with some other friends for happy hour. \n\nI saw some good reviews on Chug Pub via Yelp, so I suggested that we all meet there. Not a hole in the wall nor a fancy schmancy kind of bar, Chug Pub is a good balance of both. The kind of bar you want to meet up with friends after a long day of work and just hang out (kind of like MacLaren's Bar in How I Met Your Mother). \n\nFor you fellow beer lovers, you'll love this place simply for their beer towers. When I walked in, I saw this ginormous tower sitting between two of my guy friends. If I remember correctly, I believe he said for $30, you get the tower and two appetizers (don't mark my words though). Score!  If that's just too much beer for you, then go during happy hour - $3 beers!  Plus, if you walk further back into the bar, there are some typical bar games (billiards, pool, arcade games, etc.) \n\nThe service there is pretty good too.  While I was ordering a round of Irish car bombs for my friends, one of my gfs said that she doesn't like Irish car bombs.  So, I asked the bartender if there were any other bombs she'd recommend.  She suggested a Cherry bomb ( I don't remember what's in it, sorry).  Apparently it was pretty tasty because my friend tried ordering it again the next night when we were at a lounge.\n\nClean, local, chill, and good service from the friendly bartenders. Definitely coming back again!", "author": "Vicki T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-25", "description": "No ulterior motive here folks... just had a genuinely bad night there. I can't understand how all of you guys just can't believe that. I have been to Chug Pub before, and while it wasn't the best time ever I had no problems (which I clearly said in my first review) and I even remember getting rowdy there when we won the World Series but St. Patrick's Day left more to be desired. It really seemed like everything that could go bad, went bad. \n\n@ Alex S... how else am I supposed to explain why I gave 1 star and had a bad night without giving a thorough explanation? I guess I could have shortened it up, called everyone ugly a$$holes and tell the girls who work there to get boob jobs like you would do.  \n\nI'm happy that you all love Chug Pub and that you guys get the best service ever. Pat yourself on the back for supporting your bartender and have a drink for me. Thanks for telling me not to come back to Chug Pub, Alex S. because I was really looking forward to going back until you told me not to.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "A great place with great prices that I wish I could make my local pub, unfortunately I live in SoMa and not the Sunset. Here's the lowdown.\n\n- Pints are always less than $5 (I got their house blonde ale and a Wyder's for $8.75.)\n- On Tuesdays, their Pyramid blonde ale is on promotion for $2/pint.\n- On Wednesdays, their Chug Tower is only $25 and it comes with nachos (though I haven't had it yet, just relaying the info.)\n- The place looks like it used to be an Irish pub but is now owned by a bunch of asian people, which gives a weird vibe.. but how can you complain with those prices?\n\nIf you live in my neck of the woods just take the 71 from Market - drops you off right in front.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-23", "description": "I just love chug pub for some reason. \n\nThey have a special sometimes: PBR and Jager for 6 bucks. Good stuff.\n\nalways fun.", "author": "Ross K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "This is your typical local bar located in the Sunset District. Full of asians but that's expected because of their location. I really like the chill atmosphere here. I usually run into old friends or classmates here on Fridays and Saturdays. \n\nThere's a pool table on the right side and the bar with some seating on the left side. It's not a very large place so it's always crowded. The bartenders are so so sweet and nice. My friend knows them quite well since he's a regular so they were very generous on drinks. \n\nThey also have this huge beer tower that you can share with your friends.\n\nA nice, chill place to catch up with friends and have a good time.", "author": "Vikki K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-30", "description": "It's been brought to my attention that most of my reviews make me seem like a big drunky lush whore. I wish I could say this review would buck that trend, but alas, it does not. Oh well. If it walks like a duck, and talks like a duck, I guess I enjoy vodka. \n\nThis place is legit. $4 vodka and club soda's, which means I can get relatively trashed for about $16. \n\nIt's also close enough to my house that I don't have to worry about navigating the bus system while intoxicated. Another big plus. \n\nNothing bad to say. Cute neighborhood hang out with a pool table, and sexy Asian bartenders for you boys. Enjoy.", "author": "Jillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "Overall a pretty decent place to get a drink and hangout with some friends. Pretty good beer selection. Nice staff with lots of TVs which makes for a good place to come watch the game. My one complaint is that the damn pool table is squeezed at one end of the pub and it made it hard to play without waiving the end of your cue in someone's face with the possibility of knocking over their drink. Someone was clearing not thinking while arranging the back gaming area. But other than that I'd come back for a quick beer after work.", "author": "Kaila H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-12", "description": "1) Don't judge me for going to Chug Pub on a Tuesday night.  I like avoiding massive crowds from time to time.\n\n2) Don't judge me for ordering the biggest beer for the cheapest dollar on the menu.  We're in a recession!\n\n3) The bartenders are friendly and seem to check up on us whenever our glasses looked nearly empty (how do they know?!).\n\n4) The bathroom is clean.  I mean, actually clean.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "Denied at Underdogs for the World Series... I swear you had to camp out the night before to grab a seat. I was bounced around like a pinball in there, so I shot out and walked on down to Chug Pub.\n\nNo seats available here either. But I managed to find decent standing room spots to watch three of the games. They have tvs all around the bar so you can't miss a single pitch.\n\nThe bar had a great mix crowd of guys and gals and all Giants fans baby! Everybody was rocking on each pitch. Spirits were high and the drinks were flowing. The Giants winning helped a lot too.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-22", "description": "Went here to watch a Giants game since Underdogs was packed. I was surprised this place wasn't crowded at all. Our group thought it wasn't too bad and decided to stay and watch the game. Bad idea. Not only was service extremely slow, but the red-headed bartender was extremely rude. \n\nWe managed to find a table and sit down after the previous customers finished and left all their glasses and plates. A friend goes up and places an order for drinks and food and then comes back and we wait for a good bit. When the food and drinks finally arrive, we thank the bartender, and I'm about to ask if she can take the old glasses and plates away when she rudely interrupts me and says \"I'm not a waitress, you need to order at the bar.\" I was surprised, not only did she not wait for my question, she wasn't very good at reading minds either. So who's supposed to take these dirty cups and dishes? I guess they're supposed to walk themselves to the sink.\n\nAfter 45 mins of the dirty cups and dishes just sitting at our table, we decide to just move them on to the pool table thinking they would surely get picked up there. Wrong. The cups and dishes sat there for another half-hour.\n\nWe place more orders at the bar, wait a bit, and get our stuff again from the red headed bartender. I try to let her know that the dirty cups and plates are sitting on the pool table, and she rudely says without me even getting the opportunity to say anything, \"I'M NOT A WAITRESS, YOU NEED TO ORDER AT THE BAR!\" Listen, if you aren't very people oriented and you can't provide decent customer service, you shouldn't be working at a bar. First time I've been to this bar since it became Chug Pub, and I'm positive it was the last time. Watch out for that red-headed bartender, she's got a extremely bad attitude.", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Looking for a place to watch your local SF Giants?! Well Chug pub is the place to be! Everyone here is a Giants fan! From the customers, the bouncers, the awesome bartender girls and even the cooks! The moment you walk in, you know you're in the home of Giants fans. At first glance in each direction there's flat screens everywhere for you to enjoy the game at any location in the bar. \n\nThe thing to order is the infamous Beer Towers! 2.5 liters of whatever they have on tap. My friends and I ordered Stella;  and each tower is just $30 and each comes with your choice of fries or nachos! We ordered 2 towers, so we got  to try the fries and nachos. Personally I felt the fries had an interesting taste; not sure what it was, but they went really well with our beer! As for the nachos we ordered them with cheese on the side to avoid soggy chips, but didn't realize they came with salsa, so inevitably they became soggy; however, those salsa chips dipped in cheese were really good!\n\nThe only downside to Chug pub is that it can get really busy so you have to get there early to get a seated or standing table; however, Chug pub knows how to keep their giants fans happy so when it does get full they're willing to check your IDs and let you watch the game from outside where you can perch your drinks on the window sill and still get a good view of the game! Overall, great place to watch the game and hang out with your friends and fellow Giants fans!\n\nTip: once you get your Beer tower, you get to keep it as long as you keep ordering more, but be careful if you go during a busy time you may not get one because they only have six, so first come first serve; sucks when people order them and leave them at the .25 liter mark just to keep the tower though.", "author": "Jon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "Came here yesterday. The crowd was weird but the bloody Mary was amazing. Also the smoking room was nice Cuz u just hang out there and avoid the weird crowd.  Nice breeze and bloody Mary is all I could ask for . Oh and good company. L", "author": "Heather K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-09", "description": "Cool enough place, usually packed with dorky SF State students getting the beer tower. They serve food which is actually pretty good. I came here once on my friend's 21st birthday and they gave her a complementary shot of tequila, rum and whiskey mixed together that they lit on fire. They have a cool enclosed semi-outdoor smoking area with a window that you can walk up to at the bar where you order drinks/food. Drinks are cheap and bartenders are friendly.", "author": "Kelsey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "3 stars for a decent ambience. It can get really crowded and doesn't provide much of a seating area, but everyone there's generally friendly so you can call it a friendly bunch.\n\nSeparate pool table area with a few couches, nice for people that just want to chill.\n\nLOVE the GIGANTIC menu, I never thought I'd see the day when JUST drinks would fill up a menu the size of Elephant Bar's dinner menu (try the Shambourd Sour!! thank you to my boy's boy Alden for introducing me to the favorite =)\n\nanyways, I'll always look forward to coming here because it's diverse, and if you know ALOT OF SF(sunset) PPL, i'm very sure you will have a very nice reunion one of your days coming here. =)", "author": "Cora K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-09", "description": "Good bar for a quick drink. Didn't really like the creepy fool eating nasty Chinese food and sharing it with the cute bartender. That really didn't sit to well with me idk why. Not gonna say anything more because Id rather not say nothing at all then say something bad about this place, you kinda know what you're gonna get at a dive bar in this part of town, but at least everyone is friendly.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "i first came to this bar during a mini high-school \"reunion\" .  I was excited to see what this place was all about since it's one of the more popping places in this area.  It was fun only because it was fun seeing everyone, but atmosphere wise, it was too bright.  \n\nOne thing they do have is a beer tower, which I can totally see why so many guys like to come here.  I only come here on random nights when we're in the area and the guys just want to drink.  Otherwise, I've been to better bars.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "Best wings. Games on hella tvs. 4 player Pac man. Awesome hot bartender Genesys. I LOVE THIS BAR!", "author": "Regina E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "Came here a few times with my friends. This place is pretty relaxing, with TV's throughout the place. The drinks here are good, and at a decent price. I've only tried the fried shrimp here since they ran out of calamari, and it was good. I mean, I could buy the same shrimp from costco, but it was still good, went well with my beer. I haven't tried the long yard cup thing that they offer yet, but it does look good when I see other people with it, so I'll probably try that next time when I go there.\n\nUsually if you go there before 10pm, you can choose where to sit. After that, more people start to arrive and it can get pretty crowded where people that you don't even know are basically standing right next to you.\n\nGreat place to go to hang out with some friends though.", "author": "Johnson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-24", "description": "This is a great local bar. I felt like i was living an episode of cheers every time i went here. Chill people and cool bartenders. Occasionally you get your college ragers, but its overall a local bar. With the addition of bar food this place is a good to bar. The tuna melt taste really good. I dont expect much, but this is something that i would pay for a sandwich spot.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-28", "description": "Somehow when we're out of ideas on where to go on a friday night, we end up at the chug pub. And for some other reason, when we leave, we come out of underdogs a block up. weird huh? like a teleportation device.\n\nbeer towers are magical! and it comes with fries or nachos.", "author": "kim w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "I like the Chug Pub. A lot.\n\nGreat happy hour: $3 beers. They also have the Chug Tower which is roughly 3.5 liters of beer that includes your choice of nachos or fries for $30. What more can you ask for!!\nThere is plenty of seating, many TV's, a pool table and the bathrooms are clean. They also have Erotic Babe Hunt which always makes for a great time. I'm happy to have the Chug Pub in my life.\n\nIt's a great bar with great beer in a great location and a very friendly staff. Check it out.", "author": "Denise S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "When my friends and I need a place to just chill, we always go to the Chug Pub. Right away, we find a place to sit (sometimes it's hard to find a seat because most of the time, there're a lot of people...maybe because we go on busy days. haha). When you go to the Chug Pub, most def, you get a tower. If you don't know what a tower is, it's a tall cylinder filled with beer (of your choice) poured out from a spout. It cost $30 but if you get it, you can get free fries or nachos (get the garlic fries because they're that good). When I'm not drinking beer, I'll go for something fruity like a \"sex on the beach\". They fruity drinks are good. My mouth isn't being attacked with alcohol (haha). The drinks are fairly priced and the bartenders are friendly. \n\nThey have flat screen tvs if you need something to look at, a pool table, and a video game machine. Another plus, for those who smoke, they have an enclosed outdoor patio. I thought that was nice so you don't have to go outside in the cold to smoke, you can sit, smoke, and chat. \n\nI would recommend going here. I always have a good, chill time.", "author": "Presh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "Chug towers, ghost riders, and great bartenders!  What more do you need?  This is my go to spot on Fridays. Cool vibe, feels like home. Also a great place to catch the games with fellow fans and friendly faces.  Do yourself a favor and stop by.", "author": "D N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-09", "description": "Fun and chill hangout place with a small group of friends...\n\nI came here on a Friday night and my friend had a table at the very back of the bar where the pool table is. Many of the people there were drinking their beer towers, but my friend had a bottle of grey goose, which I was actually surprised they had! Before going in there, I thought they would only be serving a variety of beer, but their bar has pretty much anything you want! \n\nThere are also a few TV's by the bar for those who enjoy watching sports.\n\nWe had some chicken strips and fries that were seasoned very well...so yummy!\n\n3.5 stars!", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-07", "description": "I was here for Giants World Series on a Sunday and definitely you're typical bar in the sunset.  Beer bong towers are you're best value if you're a beer drinker and choice of nachos or fries. Went with Nachos and was unappetizing for me. \n\nIt's a cool bar that sometimes brings in a mix crowd but most of the times I've been there it's predominantly asian...which is the norm for any bar in the avenues.", "author": "robert c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "Chug Pub is the first bar I've been to, therefore it has a slight good bias from me! ;D Truthfully though, now that I've been to several bars, I can review it properly, and I still have it among my favs.\n\nThe bartenders here are friendly, and if you go enough they make an effort to remember your name. The ambiance of the place is positive, and the people here are just great. I never had a bad time with my friends here. Chug Pub also has a pool table. \n\nThe only reason it lost a star was because I'm also use to having bars with dance floors ;D", "author": "Austin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "Chug Pub was never as crowded as the pictures people posted up the times I was there.  The place isn't that big, but there's a pool table taking up a big percentage of the space.  This has to be where all of the asian people go to drink because i know they're not in the Fillmore or downtown san francisco.  I like this place because I brought one of my friends here and the bar tender looked up a recipe for a drink that I told her about that she didn't know how to make.  I can't say this place is super clean because which bar is unless you'er willing to pay way more for drinks which I'm not.  If you're in the sunset area, give this place a try!", "author": "Steven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "I went in for some food that Peter was making for the expanded menu on Wednesday, Thursday and Friday nights starting at 6 PM. \n\nHis food is really good! The garlic noodles, the spring rolls, everything he makes is delicious. I like the pear cider ale it is really tasty. It has a subtle green apple tart flavor. And, most important for me it is not too sweet. The pear cider ale washes down well with the all grub food that is served.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-01", "description": "Went there last Saturday. The service was poor and the food was not tasty at all. Plus, the prices were exorbitant. The chug tower and the pool table are not good. Overall, a really bad experience", "author": "Himanshu J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-02", "description": "I walked in yesterday at opening time (4pm) and had the whole bar to myself. It was Tuesday and so all beers were $3, and Amstel Light was $2. I was happy I decided to just wander on it; $2 Amstel always tastes better when it's a drink special.\n\nThe bartender gal was super nice and very attentive; what a sweetheart!\nI had two drinks and had been there for about an hour and a half or so with only one other person in there besides the bartender and I. She was so apologetic for it being so dead and told me that I'd have to come back later in the evenings to get the full experience. I laughed and told her I'd definitely be back for more...just later in the evenings.\n\nIt wasn't busy at 4pm, so if you are looking to catch up on some reading/homework (as I did) I'd suggest Chug Pub. Yes, I do plan on visiting another day, but I'll go around 8pm instead of opening time.", "author": "Angie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-06", "description": "As a drinking establishment, I'll give this place 4 stars. It's prominent exterior doesn't really quite match its quaint and modest interior. However, the inside is pretty classy (and dive-y at the same time) and I really appreciate the dark wood interior and numerous flat screen televisions adorning the walls. Not enough credit goes to places that make sure their tables aren't wobbly. I have to say the tables are stable! The staff is friendly and inviting, the beer selection is decent, and the cocktails are pretty good.\n\nHowever, I can't really recommend the food here. While it's adequate, I didn't appreciate paying $9.00 for a cheeseburger (albeit being nicely constructed and with seemingly fresh produce in it) that's obviously made with a frozen patty. Tried the fried calamari as well and am pretty sure those were of the frozen variety as well (When they're uniformly shaped and look like onion rings, I'm pretty sure I'm right). Props though for coming out piping hot.\n\nIt's worth a shot for drinks and catching sporting events, but it's probably better to catch some other nearby food options within walking distance.", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "The Chub Pub - aka The Dubliner - aka Lincoln Tavern - aka The Mucky Duck, aka Chug Pub.  This place has more aliases than Method Man from Wu-Tang.   Some of Meth's more famous aliases were Johnny Blaze, Methtical, Ticallion Stallion, etc.  \n\nAnyways, what makes the Chug Pub version wayyy better than the previous places is their Chug Tower. Damm, for 30 bucks you can get this huge 3foot high bong looking beer dispenser that you can fill with any beer on tap. Of course had to get the Hoegaarden on tap but with Guiness, Stella, Big Daddy, and Newcastle being other options you can't really go wrong.   \n\n++++  PLUS, the Chug Tower comes WITH pace picante/canned cheese /jalapeno nachos.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-01", "description": "CHUG PUB is THE place to be at to watch your SF giants play ball! The atmosphere is great with all the loyal fans and massive amounts of drinking going on with the beer towers there. All the bartenders and people who work there are all decked out in their giants gear and that just makes it even better. Wherever you turn in the bar, there is a tv screen showing your SF giants own the Rangers!\n\nEach tower of beer (beer of your choice, we got Stella) is $30 and comes with an order of fries or nachos. Get the fries...much more satisfying with beer. The nachos were good too - we asked for them with cheese on the side, but there was so much salsa that the chips got soggy after a while.\n\nThough this place can get crowded, it is MUCH better than getting squished at Underdogs down the street! \n\nThis time my friend got there a little before the game started and was able to snag a standing table near the entrance, so it was all good. \n\nBathrooms are clean and the staff is great!", "author": "Julia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "Chug pug is legit!  Thursday nights are always cracking with a young crowd.  The first time i came here I got the the tower of beer and shared it with 3 other friends.  The tower is unique, affordable, and comes with FREE fries!  I came here last Thursday and got a couple of pints of haywire for $3!  What a bargin!  Definitely a instant favorite.", "author": "Dean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-14", "description": "My favorite bar when it comes to SF. The staff here are super nice and know how to make their drinks! The crowd that walks in are always usually friendly and diverse. Parking is super easy cause down the street is a small car park. The food does take some time to come out, but its okay, just sit down or play a round of billiards! For bar food, I think everything was pretty yummy! Mmmm.. unhealthy fried food and beer? Nothing gets better than this! Everything is reasonably priced and oh chug pub's beer tower is always a treat! Oh and the ladies room is actually really clean for a bar! I was super impressed! Thanks Chug Pub for so many (un)forgettable nights!", "author": "Crystal V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-08", "description": "This is a nice chill bar to hang out and grab a couple of drinks. The bartenders are friendly. The drinks are strong. Sports are on the set. There's a pool table to play for drinks and the music is sexy. A very down and relaxing place to get a nice buzz.", "author": "Anji W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "Great place but can get pretty pack some nights.\n\nI love this place and their beer towers.  It comes either with fries or nachos, I always get it with the fries since the nachos always gets too soggy.\n\nThey also have a pretty big menu of food, all you have to do is ask for it.  \n\nThe service is pretty good, can't be ask for more from such a busy place with only two bartenders.", "author": "Mimi P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-19", "description": "It's a shame the food is here is great because the people working at the chug pub get drunk and serve you like shit. I hope Adam from Adams grub gets his food in a more respectful establishment. But although the food is great sometimes they serve you something that is terrible as if the cook was drunk. Oh wait they were because I had trouble ordering another drink from the bartender who was busy taking shots with the entire staff. Cooks, Bouncers, Bartenders, and everyone else serving you will be drunk. I understand having some fun but this was terrible.", "author": "Noah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "Just recently discovered this place after a long walk through golden gate park and I loved it! Secret gem for watching Giants games and had great service.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "Been here plenty of times (esp for Monday night football) and not once has there been a fight.  \n\nLove the bar food ;) anything from Cheese burgers to their nacho/fries.. YUM\n\nthe one con i can think of is parking can be diff esp during a crazy Giant's game and when people are eating dinners on Irving st.", "author": "Anna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "Love this place.  Great beer and yummy greasy bar food.    Highly recommend as a good neighborhood watering hole", "author": "Charles D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "came here for a friends birthday and it was a blast. i came late though and as punishment made me take the ghost rider shot/drink thingy ma jigger.. if anyone can please tell me what is in it. I'm not asking because i liked it but because that is the most disgusting drink of my life but it loosened me up and was feeling it in no time. \n\natmosphere: great atmosphere not really all that dirty as far as brewpubs go. they have a pool table to keep you active. a few television sets, an online jukebox and an arcade racing game that seemed older than me but was still fun to play.  its not too loud the bartenders that night were really nice even the bus boy was funny and seemed like he loved his job. \n\ndrinks: the ghost rider and 3 or 4 blue moons did the trick for me.\n\noverall: i had a great time and so did the birthday boy. we even bumped in to a friend we haven't seen in about 4 years and it was great to see him. good music good drinks fun people. definitely a great place to hang out n have a drink or two just don't get the ghost rider.", "author": "Carl T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "Hey Chug Pub I'm really digging your Special (PBR & shot of Jaeger) although my liver isn't.  It gets me messed up on a budget!  Good for you, because then I'm more prone to ordering more booze and food!  Speaking of food, I love yours.  It comes out of your kitchen hot as hell - which is almost dangerous because I don't really realize how hot it is until it's going down my throat giving me 3rd degree burns because I'm boozed up on your Special's - and you season your fries!  \n\nGet some more guys to come in here though because last time I was here it was a taco fest.", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-16", "description": "I came on a special day. It was after Bay to Breakers. My friends and I were limping along Lincoln and I was trying to stifle the cranky monster that would've emerged at any moment due to hunger if it wasn't for Chug Pub. \n\nAfter a couple of sips of beer and a massive burger, fries and just being able to sit down. My friends were safe from experiencing the wrath of my inner monster. \n\nThe burger was amazingly pretty good (I'm not saying this cause I was on the bring of my definition of starvation). I think this is the best burger I have ever had at a pub! I saw a couple other runners order nachos that looked pretty delicious. The over all atmosphere is pretty pub-like. I can imagine it getting pretty crowded at night since they prices for drinks and food was pretty manageable.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-27", "description": "Hmm, torn about this review because I just had a BAD experience here, but have been here a couple of times before and liked the place. My fiance turned 30 and I forced him to pick a bar so we can all get drunk on his behalf. He's been to Chug and liked it each time, so we told all our friend to go there this past Friday night. \n\nI called and see if it was okay for me to drop off 2 cakes prior to the event. No problem. The bartender was really nice and helped me put the cake away in their fridge. I came back at 8p with the posse and we all had a grand ol' time shooting pool and drinking. Spending major $$ since we had about 40 people there. That was about 2/3 of the bar basically. \n\nCake time came and I went into their kitchen to set up the candles and whatnot. The Asian guy in the BLACK shirt was VERY nice. He was very accomodating while we waited for all our friends to gather at the bar so I can bring out the cake. I asked \"Is it ok for us to be behind the bar to take some pics of him blowing out the candles?\". He said \"Sure, that's fine\". Great! \n\nSo, there was me, and two other girls behind the bar. Yes, we were behind the bar a little, but just towards the end since the bar was packed with all our friends. THEN, Terrance comes out all in a huff and startes yelling \"CLEAR THIS AREA! YOU CANT BE HERE\"! He was trying to get out from behind the bar, so we were trying to let him out, but he was an ASS. TOTALLY yelling at us 3 girls who were behind the bar for a reason, not to just block his way! AND, how long will it take for us to sing Happy Birthday. The crowd will disperse right after.\n\nSo, he keeps shouting at us to move and we finally managed to let him get by. Then he goes \"Who are these kids anyway?!\" UM, first of all, these \"kids\" are ensuring that you get your next paycheck. Second, these \"kids\" are the same age as you! Just because we look younger! Last, there's no reason to be rude to your customers. There are other ways to handle a situation like that, especially if you're a \"manager\". \n\nTerrance totally ruined our experience there with his bad attitude. Thank goodness my fiance was too drunk to let it ruin his birthday celebration. Funny thing is, our friends there are actually his friends too! I spoke to a few of them since I know they go there enough to tell me who the guy was in the pink shirt. They're like \"That's Terrance. He's my age\". Which means MY age too, DUH! Kids my ass. What kind of manager would say that about his customers in front of all their faces. \n\nI think I may just end up here again since my friends frequent here. I've had good experiences here before, but what happened on Friday night just blew that all out of the water. I'd love to hear back from Chug! Maybe they can buy me a few rounds too!", "author": "Freckles H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-08", "description": "Can you find a cooler neighborhood bar?\n\nThe chug tower is a hit and the place is packed on the weekends.\n\nNice mixed crowd, cute bar tenders, and awsome drinks.\n\nGreat little hangout with the friends and they have a smoking area for the smokers.", "author": "Curt L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-08", "description": "When I walked in... I felt out of place. But then again there were mainly asians.. So we sat down and decided what to drink. Jager on tap?! hahaha how sick is that. Perfect for the birthday girl. Had a few shots of hen, jager bombs and a few cocktails. Prices were average and the bartender definitely hooked up the birthday folks. Overall had a pretty decent time at the chug pub. Might be back soon, it is in the neighborhood after all.", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "Mainly an asian crowd here usually, well it is in the Sunset so it is expected.\n\nIt can get pretty crowed in here especially in the bar area since it's so close to the tables and stools on the side. Bartenders are cute but so hard to get a hold of to get a drink, especially if there are \"usuals\" or friends that are there, but I dont mind. They still put up good service and make some pretty good drinks there. Not too expensive either.\n\nOrdered a red dragon once, girl said \"i dont make these here but I will for you\". I'm use to ordering them in SJ so I had no idea. At least she still made them for me, I just felt bad that my friends kept ordering them after haha. \n\nFood: pretty good too. So if you're here to chill and grab a couple drinks after dinner, this is a good place. Parking sucks a bit though.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "I am terrible at pool but last night just seemed like a good night to play.  Unfortunately, there was a tournament going on which lasted the entire length of my visit.  What also got me in a bad mood was watching, yet again, another failed game from my LA Clippers and then getting told to go back home to SoCal by some \"local\" whom I suspected wasn't from NorCal at all.\n\nBesides that, they have a pretty good selection of beer on tap and in the bottle.  I had a Honeymoon last night and it was perfect.  The bar also put out some cheese balls.  Any place giving me fatty foods with my beer is a win.  The music stemmed from an iPod since the jukebox was down.  The bartenders listened when I practically yelled, \"Please change this\" when 'Barbie Girl' came on.  Everyone thought it but no one said it.\n\nIt was a lovely night out for a Wednesday.  Too bad for the tournament or else it would have been 5 stars.", "author": "Ashley I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-05", "description": "Twas a Halloween night...\n\nFINALLY decided to come all to Chug Pub after how long people have been urging me to come here. \n\nMost people were dressed up for the occasion. The guy checking ID's in front was in a Heineken get up. The stones up front make the place really stand out. Love the look of the place inside and out. Decently clean too.  \n\nIt's decently small on the inside. Was expecting a little bigger, but pictures I've seen are deceiving.\n\nThe bar itself was not really big as expected since the place wasn't huge. Bartender was really great actually. :) She would always remember who came to the bar first and last so there was no dirty looks for anyone. Drinks were served decently quick too even though we were ordering almost 10 drinks at a time. Car bombs, shots, raging bulls, etc. \n\nDrinks: Not bad. They seemed a little light for some reason? Maybe it was because I had a decently filling meal, but after a car bomb and a kamikaze I felt nothing. I'm a light weight.... I admit it, but this didn't phase me. Also, for some reason, the car bomb, after it was dropped in it started to curdle up really fast. That I've never seen work that fast before. By the time I downed it, it already turned gross on the bottom. Maybe the beer wasn't cold enough? Decently cheap by the way. :)\n\nFood: There was a girl sitting next to us at the bar, whatever she ordered smelled amazing. Must try next time :)\n\nRestroom: I usually don't ever talk about the restroom much, but because I made two trips....why not? It was actually pretty clean for a bar. I could hear the girl that was drunk next to me stumbling around but that was hilarious. \n\nI would rate that we all had a pretty good time here. Drinks were a bit on the light side but I definitely will come back to do the 3 L beer :D", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-07", "description": "I came here a couple weeks ago. Always a good time when you run into friends here! Owners and the staff are super friendly here and the drinks are very reasonably priced! Whats great about this place is that they also serve some fried-up goodies! Perfect for those like me who have munchies when they drink! \n\nThey have games like dice and a pool table for those who just want to kick it and chill out at a bar. Great location too, plenty of parking around. Def. the atmosphere of the place is what makes it great! Everyone's friendly!", "author": "Betty S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-04", "description": "One of my favorite kick it spots with my friends! $30 gets you a 3 Liter tower of blue moon & french fries (free)...what more can a girl ask for :) \nI also recommend their guava mojito if you are into the sweet girl drinks! BEST MOJITO EVER!!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-01", "description": "I live in LA and wanted to find a sports bar to watch the Laker game, so I looked up some reviews and found this place.\n\nWhen I first arrived, I wasn't too impressed because the bar looked a little cramped and they didn't have too many TVs\n\nBut my attitude about the place took a total 180 because I figured out that it wasn't about the physical bar that made it so appealing, it was the locals! My party had a total blast at this bar! The locals are so friendly and vibrant...totally different from the LA bar scene.\n\nIt was fun jawing back and forth with the locals (why are you guys so anti-LA???) Anyways, it was a great place to hang out and can understand why it has so many good reviews!\n\nFor a party of 4 with a ton of food and beer/margaritas, this place is VERY Reasonable!\n\nWould definitely come back the next I'm up in SF!!! BTW, to the bartender - LAKERS Rule!!!!", "author": "Don T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-01", "description": "I grew up watching the show Cheers and I must admit once you step foot inside there's definitely someone you know there.\n\nThey're also known for their infamous beer tower.  Gosh, $30 for any beer of your selection (new castle, guinness, fat tire, etc.), which is definitely a steal.\n\nI don't drink beer, but they have a pretty hefty selection of tequilas, especially a 1945 don julio.  I'm ready with my salt and  lime.\n\nAlways good times here.\n\nCHUG PUB, you definitely had me at \"hello\". ;)", "author": "Sophia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "Wow, I haven't written a review for Chug Pub yet? I'm definitely lagging. \nI usually go to chug pub on Wednesdays, Thursdays, Fridays, Saturdays and sometimes Mondays or Tuesdays. So.... I have been there every day of the week. Interesting. Do I have a problem? No, not really! Chug Pub is JUST that great. \n\nThe prices for the drinks are spectacular and are definitely affordable. $6 Kettle One Tonics. Three Kettle One Tonics for under $20?! Definitely Chug Pub. The bartenders are extremely friendly and are hands down some of the nicest ones that greet you with a great smile.  \n\nOn Mondays... 50 cent wings! Get them they're delicious and well worth it. Also, there are beer towers and daily draft deals. \n\nOverall, great selection of beers, cheap drinks, good food, great bartenders. I love Chug Pub.", "author": "Tony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-22", "description": "Chug Pub might just be my new favorite pub/dive bar in the Sunset! Went for a friends birthday with 7 others and those who have been there before instinctively went for the Chug Tower aka huge tower of beer! It's amazing--Hefeweizen for 8.5 for only $30, and it comes with nachos or fries!   We opted for garlic fries x 2 and the nachos. I don't know if it was because I was 1) hungry and 2) feeling my alcohol from my pre-game shots, but both were DELISH--garlic fries were well salted and not overly garlicky and nachos were with very processed nacho cheese, salsa and jalapenos.  Generous portions and hit the spot. \n\nThe venue is reasonably clean, fair amount of seating in the front near the bar as well as in the back near the pool table, and bartenders are nice. Right before closing, they gave us a countdown on how many minutes we had left to drink up. And then as we're almost out the door, he hears it's our friends birthday, and offers him a birthday shot. (Too bad my friend was too gone to partake.) \n\nWasn't so busy on a Saturday night, but made it perfect for our larger group as we dominated the entire back area. I'm certain I'll make it out there again. Not too many places that have towers of beer in the city, let alone minutes away from where I and most of my friends dwell.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-13", "description": "Couple friends and I came here last night (my first time!) to check out the beer tower. There was only one bartender the whole night and she was very nice. A lot of foam fills up the top of the tower so she gave us some more in a pitcher. The beer tower comes with a free order of fries or nachos ($30)  I love fries! especially FREE FRIES! Being a Wednesday night with work the next day, we were only going to just get one beer tower and chill. That did not happen... \n\nWe started with just one beer tower and grab couple seats in the back, filled up each cup (the tower is about 7-8 cups of beer) and started playing drinking games with cards.  Started as a nice drinking game but slowly it got more intense and it became 3 girls vs 3 boys in the end. One tower became two, two became three! With the other towers we also got nachos and then curly fries.  The nachos were loaded! Lots of cheese and jalapeno.  I liked the regular garlicy fries better than the curly ones.\n\nIt's a decent size for a pub.  Full bar in the front of the pub with a couple high tops and regular tables and chairs in the back.  There a lot of TVs around the place, a pool table, and an old school street fighter machine with a change machine as well.  The bathrooms are also pretty clean.  Despite how much I'm hating being here at work right now, I had A LOT of fun last night.  I'll definitely come back to Chug Pub!", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "This place is cool. \n\nSpacious.\n\n1 pool table.\n\nJuke box.\n\narcade machine.\n\nCigarette dispenser.\n\nDrinks are expensive as usual.\n\nMainly an Asian bar.\n\nWomen from you group will get hit on if they are attractive.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "I've met some interesting people here, with some turning out to be room-mates of friends. Small world!\n\nThe bartenders are above-average while the drinks strong and averagely priced. I like the little smoking area (of which I have no more use for!) and the game area is kinda nice.", "author": "J H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "I'm not really a bar girl, but I came here one night with a bunch of friends to chill on a Monday and it's a decent spot to just chill. We got the beer tower amongst 4 people so it's 2 glasses each in that entire thing. I had a good buzz. Shots are decently priced too and the beer tower comes with fries.", "author": "Diane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "This is one of my boyfriends neighborhood bars.  We typically come here during the early part of happy hour.  \n\nThe bartenders have always been super friendly and attentive.  On several occasions they have made some awesome recommendations.  I came here shortly after it opened, the mojito was suggested, and it was delicious.  Another time came here for pre-birthday dinner drinks and my bf recieved a free shot of bourbon.  Awesome!!  \n\nSince we tend to come early, there is never a problem finding a seat at the bar.  There are multiple screens displaying some game or sports news, music is ok...not too loud.  Easy to carry a conversation.\n\nI've only tried their food once, and it was typical bar food.  We ordered the fries and calamari.  Nothing too special about either, but (in my opinion) the greasiness goes great with beer.", "author": "Lesliegh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "Best bar in the sunset!! Janine (bartender at Chug Pub) is awesome! she doesn't mind making me a Bloody Mary at 6ish pm, and her Bloody Mary is to die for! so0o good! good bar food, happy hour until 8pm, pool table, i mean what more can you ask for! Stop by and pull up a stool and quench your thirst with a beer.", "author": "Lily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-12", "description": "Went in for the first time yesterday and met the bartender Candice, who made me her signature shot - Orgasim! \n\nLet me just say it rocked! It was ohhh soo delicioso! =)\n\nEveryone was friendly and the service was great. The bar was really clean, and everywhere you look there was a flat screen! I loved the 80's rock playing in the background! \n\nCheck it out for yourself you won't be disappointed!", "author": "Jesica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-01", "description": "I came here last night for my friend's birthday.  I live 5 blocks away and drive by every day, but I've never gone in.  Its a cozy little neighborhood bar.  You see the bar right when you walk in, and there's a back room with a pool table and juke box.  \n\nThey have lots of beer on tap, and some yummy pear cider.  They even had Hangar One and Grey Goose.  Hangar One & Tonic, please!  Yum!  They have this Chug Tower which they fill with beer.  I saw alot of people order it, but I think I would've burst if I tried to drink that much beer.  The bartenders were pretty quick.  The bar was packed, but I never had to wait that long to order a drink.  \n\nThe only complaint I had was that the place was small.  Our birthday group was around 20-30 people throughout the night.  And then add on all the other local people, and you get a very crowded and hot bar.  Its not too bad unless you mind people rubbing up on your butt as they're walking by.\n\nI wouldn't mind coming back to grab a drink when its less crowded.  The drinks are decently priced, and I can just stumble home after.", "author": "Patra I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-10", "description": "Coming here is like coming to a bigass lowell high school reunion.\n\nthumbs up on the guava mojitos.", "author": "Will T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "BOTH times i went had a beer tower and jeggggaAAAA bombS!!! great location friendly people.. except the crowd i brought in.. my friend ended up getting arrested.. but chug pub was awsome!!!", "author": "Mykol A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-15", "description": "This is my first review on Yelp lol.\n\nAnyhow, I've been to this place a couple of times already and wanted to get a feel of it before I gave my own opinon. I went during the week and it wasn't so crowded....ok it wasn't crowded at all and it was great. Bartenders were great and funny as well. When I went during the weekend it was crazy packed. Still I got the same great service as when I went during the middle of the week. No complaints from me =). I would definitely recommend this place if you want a chill place and to stay local (yet I am not a local, but like to check out different bars wherever I'm in).", "author": "Jewelz P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "With a name like Chug Pub, there's not much room for mystery.  You chug, at a pub.  Voilà.\n\nThe environment here is your classic sports bar, complete with a pool table, liters of beer, TVs, and killer bar food.  Though the place can get pretty rowdy, it's to be expected when a fight or a game is on.\n\nThe garlic fries were awesome, as were the nachos.  What I love about the nachos here is that it's what you would get at any baseball game, except it's littered with jalapenos.  There were literally enough jalapenos to put at least one on each chip, which, to me, is brilliant.  I can't count the number of times I've had to ask for extra jalapenos only one-fifth of the way through a plate of nachos.\n\nThe beer selection here is the same lineup of drafts you would see at any other rowdy bar in the city.  The Stella Artois on draft was, however, unexpected.\n\nThe music could be a little bit more consistent, but I guess that's what happens when you let the public take control of the jukebox.\n\nAll in all, Chug Pub is a great place to get your game on.\n\nGET:  Beer, Nachos", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Finally spent some time here when my friend was bartending, and it was super fun. We got there around 4pm on a Saturday and so the \"regulars\" were there, including a old English guy who is a little nuts but very lovably nuts. We played pool with him while he gave us some advice on love and life. They play sports games so it's a good place to chill and watch whatever game you want (there was soccer and baseball). This is definitely a casual, neighborhood bar but you get some interesting folks who stumble upon this place.", "author": "Shayna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-27", "description": "This place is great, but it has two great things going for them! \n\nFirst, Alex (The bartender) is great!! She is super attentive and welcoming and is always down to take a few shots with fun bar goers. \n\nSecond, the wings are fried to perfection. If you are a wing fan, this is your joint! They have wing Mondays where the wings are 50 cents each! \n\nAlso, you can't beat their happy hour. They have a great beer selection and are all super inexpensive. \n\nMoral of the story, this place is great!! Just make sure you get Alex when you go, you wont be disappointed!!!", "author": "kristi p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-25", "description": "First off, Alex S, don't be a 10 year old. I was there with Brian that night and service was HORRIBLE. We waited at the bar for 15-20 min without anyone acknowledging us. He was not trying to attack anyone. You going into your little tantrum and attacking him personally shows who has the insecurities. Everyone has a right to express there experience here on yelp. Thats what this site was made for. As for me, I probably wont be going back to Chug Pub anytime soon either. I do find it funny that you joined yelp the same day Brian wrote that review. VERY SUSPICIOUS!", "author": "Harry Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-24", "description": "From the looks from the outside and the area of this bar you would think its just a quite neighborhood bar. One that would have older middle aged men named Norm sitting next to his mail man friend drinking. Far from it haha. \n\nI've been here a few times and  each time its been a lively fun place to have a drink or 6,7,8 oh who's counting anyways :) It's a sports bar atmosphere with a pool table and a bunch of flat screens. The bartenders are funny and I must say not bad on the eyes =0 haha. There is food served there so you won't have to go some where after for that late night alki created hunger for food. Not 5 star restaurant food but good quality bar food. \n\nThe crowd is young and fun. Multi racial though slanted (pun intended) towards the Asian side haha. Fun place to hang out any day of the week and though I've never been there for happy hour they have some great drink specials from what I can see. They even have a Chug tower (think of a tall mini keg) you can share with your friend or yourself if your that thirsty. Stop by with your friend for some fun I think you will like it.", "author": "mitchell l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-21", "description": "Got beers, so that alone is worth 3 stars! Plays a whole bunch of terrible music from the late 90's and don't get the house ale (blonde ale), unless you like two spoons of sugar in your draft.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-17", "description": "Adding another star because I discovered its happy hour.  $3 any draft beers and well drinks until 8pm.  That's a good deal.  Plus the location is great, drink until happy hour is over, feeling a good buzz, then walk one block up the street and you can get some good food, chinese, pizza, vietnamese, etc...i'm partial to pho.  It's a great meal after drinking and it's great to eat on a nice cold night.", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-04", "description": "Lost my glasses here.  Went there for the first time last night. Great place. bought several of those towering beer columns for $30, and when it comes w/ the CURLY fries. oh man, that stuff is bomb.\n\nWill come back, and I hope they have my glasses!", "author": "Morris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-25", "description": "This is probably my new favorite bar! I can't believe I never came here before. It's close to my house, cheap, good, strong drinks, hot ass bartender girls, and just a good crowd in general. \n\nCame here last night and this place was packed. But got seats right at the bar. They have so many flat t.v screens there, imagine how it would be when the Superbowl is here. They have a lot of the sports channel on and news too. They play great music and have a pool table too.\n\nThe drinks were cheaper than a lot of other bars. A shot of Henny was $8? And they do not skimp on it. The bartenders are gorgeous and sweet. Linda was super friendly and hot. If I wasn't a straight girl, I would try to hit on her! I'm definitely gonna go back again. It could even be a weekly thing!", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-18", "description": "This is the first time I have ever written a third update. I am either that good in yelp or I am that bored (meaning no life).  I think it's the latter.\n\nI kinda influenced my friends friend to come here for his bachelor's party after Underdogs.  I like Underdogs but they seem to be lacking the  personal touch or charm..  Some of the guys wanted to go to fire fly but that place can't compare to Chug Pub.   This place has \"it\".  We slammed them pretty hard tonight.  I think we had around 50 heads that came in here tonight and we made everybody work.  They started using plastic cups because they couldn't wash the glasses fast enough.  Think green guys.................come on!!!! j/k.  The guy who broke the pint glass wasn't with me so please don't blame me for that.  Tim, Terrence, Sofia, and Linda did a great job..  You can always see a person's true character or true self when they are under pressure. Can they stand the heat?  are they going to crack?  They all worked really well under pressure.\n\n\nIf you are ever in the neighborhood...................come by here.  They are truly the nicest people you will ever meet. Haven't really tried the food though.  It smelled good.  I think Terrence and Tim do all the cooking too.  Man..........these guys do it all.  Keep it up guys!\n\nhttp://www.youtube.com/watch?v=f3s9ervlVrM&feature=related\n\nThis video reminds me of them.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-03", "description": "After passing by the Chug Pub almost every weekend and reading other Yelp reviews, I knew I had to try this place out.\n\nThis bar is like a great party - it's got something for everyone. \nGreat, nice and fun bartenders who like to chat it up\na pool table (note: there is a sign up list on a chalkboard. if you're like me, you will totally miss it and cut 3 people who had their names up..oops)\ncheap & strong, strong drinks\nan outdoor patio!! - if you want drinks, you don't even need to go back into the bar - there's a window and the bartender can get your drink and slip it to you through the window. efficient.\nflat screen tvs - great for the jocks\nlots of seating \nand a parting gift!  I scored a free t-shirt here, and I didn't even need to participate in a slutty contest!", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "Came here for the first time. Just like any other typical bar. However, they did offer this thing called the chug? Well w/e it's called, it's not bad. It costs about $25, consisting of a huge bong like tube filled w/ Blue Moon & comes w/ a side if French fries too I believe. Overall, it's a nice chill bar. Oh, did I mention, they have a pool table as well & the bartenders are pretty cute!", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-29", "description": "Probably the best spot in the surrounding area to stop in for a drink on any given night. Prices are reasonable, and the staff are quite friendly. It's nice and close to major MUNI routes (28, 71, N-Judah, 29), so it's easily accessible. They've got a handful of television screens, so there's not going to be any arguing about whether to put on the Warriors, Sharks, college football, etc. because it can all be on at once. The selection is pretty good, and there's a pool table in the back. The best time to go, in my opinion, is happy hour with a few of your friends; it's not too crowded, and drafts are only three bucks a pop. I can say the only downside is if you were to go on a Friday night and expect to be able to navigate around the bar - when it gets packed, it's PACKED, like Sardines quite truthfully.\n\nAddendum: The bartenders are all very friendly and look quite good.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "Wow, I wish I had a pub like this around the corner of my street.  I'd go here every night and get drunk.  But I think that'll make me an alcoholic if I did!!  Oh wells, I'd still go here to chop it up with the locals or to shoot some pool or watch free TV.  =)\n\nCame here with Juliane, some of her friends, and David.  What a fun night. The bartender Linda was extra cool.  Damn that Adios!  Strong but downed it like a pro.  And the YUMM on the TICTAC.  Leaves your breath smelling like fresh air!!!!\n\nThis is a fun bar to go to just to chill since clubs scenes are getting overrated... just a lil bit.", "author": "MaryGrace V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-10", "description": "Not a bad place to hang out. Beer towers were kinda neat as a novelty.. not so much for value. The draft beer prices were decent enough that I saw that as a better bet, that way I can have different beers. Not talkin crappy bud light or miller draft beer but I was drinkin pints of some good ales for cheap. Place has a kitchen too.. ok.. but better than no kitchen at all. Stayed open all the way up to last call too. I'll give them props just for having food on site, who cares if it sucks, you're drunk.\n\nDrink I recommend would be the \"blue lamborghini\" .. has a lot of crap in it so the 12 bucks or so is worth it. They light it on fire, need I say more?\n\nBartender was kind of a b*tch though for last call. The night was going so well up until the very end LOL. Oh well. Screw it. They were almost getting 4 stars but 3 seems more appropriate.", "author": "Ray P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "One of my favorite bars to go to in the city when I just want a chill and relaxing night! The prices are affordable and they have a wide variety of drinks. The best thing is too is that if its not on the menu, just ask them to make something! The food is also really good, my top items are the fries, burger and chicken wings! What is also great is that if you don't feel like having bar food, they are more than welcome to you bringing in your own food! \n\nEntertainment wise, they have TVs everywhere with most likely every game that is playing that day will be there. So you can keep tabs on all your favorite teams! Don't want to just sit around and watch sports? There is a pool table, arcade games and a juke box to play your favorite music! If it doesn't have your favorite song, ask to play it off your phone real quick! The bartenders and staff at Chug Pub are super friendly and nice! So if none of those options seem enticing just hang out with the people there, everyone is so friendly, it's like Cheers! You come enough, everyone will know each others names!", "author": "Lorna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-04", "description": "Bliss: \n\nLeaving any Golden Gate Park event early.  \nStake out Chug Pub's Lincoln & 20th smoking patio.  \nPeople watch your ass off as people leave the park.  \nOrder greasy mediocre bar food.  \nEnjoy mediocre bar food.  \nMake friends passing on the street.  \nMake friends smoking cigs.  \nBum extra cigs from new friends.  \nInsult random strangers as they walk by.  \nRealize that you're wasted to the point of douchebag.  \nBe okay with being a douchebag.  \nContinue being a douchebag.  \nHop on your bike.  \nHop off your bike, realizing that safe riding just ain't gonna happen right now.\n\nJust about perfect and not so busy that it gets stuffed.", "author": "Mat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-27", "description": "Damnn another great night at chug pub! Except that tequila with the worm... UGHHHHH! GROSS!!! WE WANT CHICKEN TENDERS AND FRIES! \n\n5 stars for Janet! 5 stars for Michelle! 5 Stars for Tim! 5 Stars for John! 5 Stars for Terence! 5 STARS FOR JEFF! hahahahahaha", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-10", "description": "Stopped by to meet up with some folks after beer pong\n\njust as Juliane N. said, \"cheap, good, strong drinks, hot ass bartender girls, and just a good crowd in general\". that pretty much sums it up\n\nnice little place to meet up with friends and have a beer or shot or whatever. very cozy. our bartender was Linda, who mixes up a tasty Orange Tic-Tac and a mean AMF.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "Work bestie and I noticed Chug Pub on our way to the office a few weeks ago and decided the name was just too enticing to not stop in. So, on election night, we vowed to return to Chug Pub and do some damage as we watched the blue states roll in as Obama kicked some tail. \n\nOh Chug Pub, how I love thee and thy $6 Papst and shot of Jager special! So trashy yet so clever and satisfying. They have some great beers on tap including some special holiday blends, and the food is super cheap as well (HUGE plate of nachos with the classic squirty cheese, jalapenos and salsa  for only $5!). \n\nAs everyone on Yelp has already mentioned, the bartender was super friendly and even gave us a celebratory pint of holiday brew on the house after Obama was announced. Cheers!\n\nChug Pub was a cozy, friendly place  and I'll definitely be coming back with some friends for a few rounds of Jager and Papst!", "author": "Katie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-10", "description": "This last visit was pretty much on a whim. When it comes to matters of the heart, don't leave your buddy at home in their pjs to drown in their sorrow on a Friday night. Nope. Tell them to get off their a**, get dressed, and put their buzz face on! Operation mind eraser started off with a cherry bomb. Next up were 2 towers of Blue Moon and two orders of fries. Homegirl even ordered buffalo wings. There was a better vibe this time around. The crowd was more diverse and the music was cool, with the exception of that one Nickelback track (grrrr). Only slight downside of the night was when the order of wings dropped. I got a crapload of sauce on my purse and on half of my left leg. Eh! It's nothing a Shout wipe and Oxyclean can't fix.", "author": "Rhia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-11", "description": "I had fun when I came here.  It's a simple place with pretty cheap drinks but they are light so it's a give and take.  Nothing really stands out here or is particularly impressive.  I won't choose to come here but I won't fight it if someone I'm with wants to go.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-01", "description": "Damn, this place looks way bigger than it really is!  It's long, and narrow and can get crowded and a bit warm...even on a cold SF winter night!\n\nMy buddy had his 30th birthday bash here after dinner, and it wasn't bad.  Don't know about the drinks b/c I didn't have any, but the two bartenders (\"Hired Guns\" if you following Pick-up Artist on VH1), had most of my friends' attention.  Again, I don't know about their skill in making drinks b/c I didn't have any.  \n\nThe outside \"patio\" smoking area is smaller than the smoking area at NV!  It's about a 5 ft x 5 ft square with a couple of stools to sit and ogle at passersby.  Would be a cool place to hang out on a warm summer day in SF when there are ACTUALLY PEOPLE WALKING ALONG LINCOLN!  The cool thing is out here, there is a small window to order drinks from the bartender, and you can hear the music that you just paid $1 at the jukebox to hear!  We bought two songs, but it is impossible to even hear the tune inside the bar.\n\nTip 'o the day:  Parking at night is not so hard in this area.  If you don't find street parking, park in the public lot behind the KFC/Taco Bell on 20th (more towards Irving than Lincoln), and after 6 pm, you don't have to feed the meters!", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-08", "description": "A much needed sports bar in the sunset area.  Great number of TV's for your viewing pleasure.  Attracts different sorts of people, including opposing fans, so it makes for a lively crowd when the games are on.\n\nFood there is surprisingly good.  Try the tuna melt.  Or the hamburger.  Free snacks like pretzels and popcorn.  If bar grub is not your favor, there are plenty of restaurants around the area.\n\nReasonably priced drinks.  They also have specials (chug tower w/ free nachos) and also specialty drinks.\n\nParking is not that bad.  Plenty of parking on Lincoln or Irving.  Pool table and a Street Fighter machine available.\n\nOverall a great place to hang out with friends and have a cold one.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "Came here on a Thursday night and it seemed like a college-age hangout or maybe it is just on Thursdays. Pretty chill vibe, lots of TVs, jukebox, pool table, clean bathrooms (!) and very friendly, young bartenders. \n\nKnown for the chug tower for $30, cool concept but you only get about 6 or 7 beers out of it (so my beer-chugging dude friends tell me) but with the fries or nachos that come with it for free it could be a good deal.... I kind of like the tower because it has a tap and it looks cool and I can totally imagine college kids playing beer pong and using it to fill 'er up!!", "author": "Christy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-09", "description": "2 things I'm really good at in life is drinking and eating. Chug pub has both.\n\nFirst of all, the beer tower?!?! COME ON! BEST DAY OF MY LIFE!!!! \n\nMy best friend literally lives down the street from here and we happen to just randomly walk in here to see why it was so happening.  After I saw a table with one of the towers I had to get one too.  \n\nThe other drinks are really good too so don't be afraid to order other drinks!  But a drinking sesh is never complete without some grub and their nachos and garlic fries are AWESOME! \n\nAlso, I'm loving the pool table and juke box.  This place has it all.", "author": "Hanna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-11", "description": "This is, by far, my favorite bar in the Sunset!! I started coming here back when it was the Dubliner, to later find it renamed to the Lincoln Tavern, and then again to The Chug Pub. Identity crisis, perhaps? No. New owners. But just because the owners and name changed, doesn't mean that anything else has. This bar still has nice, friendly bartenders, moderately priced drinks and it's NEVER crowded, which I'm sure has to do with the location of it (then again, I usually never come here on a weekend). It is pretty detached from the \"hoppin\" part of the Sunset district (ie. Irving St between 7th and 10th St.). I know some people may view the lessened amount of foot traffic through here equal to that of \"lame\", but to me, it is heaven. I don't believe that you should have to wait more than 5 minutes to get a drink. And I also don't believe you should have to \"play for the table\" (in regards to pool). Why can't we all just switch off? I go - you go - I go - you go. Here, I never have to worry about that. There is never a battle here for the table and I enjoy the people I have encountered here that are always more than willing to share. You don't find that in too many bars here in the city. The other pretty sweet thing about this place is the outdoor patio that faces Lincoln. You can step out to get a breath of fresh air and still have your beer in hand...or cigarette, whatever you prefer. If you run out of beer, there is a window you can order from, so it is unnecessary to leave the comfort of your outdoor seating arrangement. Kiosk games and a digital jukebox - bonus for me! This place is just the best and it is the one thing I miss the most about living in the Sunset. I do drop in from time to time when I can though. And the biggest bonus besides all I've just mentioned: they take credit card!! As you know, not many places in the city do, so kudos to them!! I love this place and thanks!", "author": "Amber Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "My work bestie and I decided to gorge ourselves in some beers and bar goodies while watching America make history. What a great place to spend Election Night! \n\nThe bartenders are FABULOUS. She seriously rocked my world. She frantically raced around the bar attempting to adjust all the TVs to make sure we didn't feel like we were in a cave of Obama speeches--all the channels were on different feedback times, so we heard him say the same thing like 4 times about 2 seconds apart. Trust me, not good if you have ADD. Anwhoser, she raced around, fixing all the TVs so we had pure surround sound of the election coverage.\n\nShe also let us sample the beer before we ordered it and recommended the best grub to order. I got a hot link and my friend got the nachos with the \"good fake cheese\" as the bartender described it (obviously). \n\nFor a neighborhood bar, in once again what I like to call the arctic tundra of SF metro (The Richmond District) Chug Pub saves the day for me. If I could only stumble home and not have to figure out the short cut through the park while driving. Sighhhhh....Guess I'll just have to drink outside on the steps and get yelled at by the crazy Russian grandmas.", "author": "Lexi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "We decided to come here after the first bar we went to was sort of a dud. We walk in and there is a large bar with jager taps and all the drinks you could possibly think of. Then there is a room with a pool table and some areas to sit around and drink and what not. So we walk in and I get my boy a Stoplight since it's his birthday and it only came out to be $7. Super cheap, I was immediately happy about that. Good drink prices here. Next we get one of those huge dispensers of beer which holds like 3-4 liters of beer, blue moon too. We finish that pretty easy since it's a big group of people and then we get another one with fat tire and it's fairly cheap for all that beer and if you split it evenly it's a pretty good deal. So we sit and drink at the bar then we get the beer towers and walk over to the table areas and wait for the pool table to open up. The atmosphere is pretty chill with TVs everywhere playing different sport programs and some TVs with specials and menu items showcased on them. There isn't really a good mix of people at the bar, mostly dudes but it was still fun just to go out and chill. So if you want some cheap drinks, play some pool and hang out with some interesting people this is the place to be. I also came here for my 21st birthday a year or so ago but I don't recall much since I was so messed up so I had to wait for a chance where I remember things to write a review and here it is.", "author": "Jeromy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "Went here on a Sunday night. Not super packed but there were a good amount of people there. Order the large beer thing and you get french fries or nachos included with it. The bartender was really nice and the other workers were too. A good place to grab some beer and snacks.", "author": "Jennie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-29", "description": "This place is crack'n!\n\nThis is home to the beer tower which holds about 3 liters or beer goodness! If you do order the beer tower it also comes with food! free food! Chug Pub is your local pub in the Sunset district and attracts a pretty good crowd. It is a great place to chill and drink or shoot some pool. Get there early if you want a seat because it can become quite crowded as the night progresses.\n\nNice, simple, tower of beer. Can't complain with that!", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-01", "description": "This is the first time I've came here since they've changed names, but everything seems to be pretty much the same.  Great neighborhood place to hang out with your friends.  Nice, friendly bartenders.  Cheap, yummy drinks.  Nice casual atmosphere.  Not too loud.  What more can you ask for!", "author": "Tramy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "So I drive past this place almost everyday! I finally went in because I had a gift certificate...and I'm definitely going back! I ordered all kinds of food which was delicious...the calamari, burger, fries and nachos were sooo good!! Best part about this place is $3 hefenweizen from 4-8!! Only complaint is it does get a little crowded but the place is awesome!", "author": "nabil s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "I think I had fun. My empty wallet, puke on the cab and broken memory tells me I did. There looked like there were more Asians than at my family reunion, but they were all drunk like my family. Maybe it felt like home deep inside.", "author": "Sunie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-22", "description": "What?? An bar worth going to in my area? I don't believe.\n\nGood food.\nGood and Cheap drinks.\nGood deals with the Beer Tower and Garlic Fries or Nachos. ($30)\nAsk about it.\n\nGreat service from awesome bartenders & owner.\nWhat more can I ask for at a local bar?", "author": "Jimmy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Best bar in the Sunset! Great vibe, good food, music, and the best bartenders EVER! :)", "author": "L F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "I came here on Thanksgiving night with three of my buddies. First thing I noticed that it was a straight up cock fest in there! BUT I can't be a hypocrite because we didn't bring any of our lady friends either...\n\nBesides that, I had a pretty good time here. The bartender (don't know his name) was very nice. I was pretty wasted and my eyes clung onto these bags of Jalapeno chips behind the counter. And of course, Mr.Bartender hooks it up with three bags. Not sure if they usually give them out...but it was a very nice gesture. \n\nShots were pretty big here and were cheaper than most places. Shot of Goose was $7 and LC was $8 I believe. Better than paying $10 for some dinky little shots like at other places. \n\nOverall, this place was good. Nice bartenders, drinks that give you the big bang for your buck, clean...but just had a lot of dudes. Maybe all the girls were at home with their families for Thanksgiving? That's my theory and I'm sticking to it.", "author": "Allan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "Pretty chill bar. The crowd was pretty diverse last time I went with a small group.  It's not small (the bar and the side tables have enough room separating them for people to walk through), and they have an area for a pool table. They also have large HDTVs for your viewing pleasure. \n\nOf course their drinks were good, and I believe they served complimentary snacks as well. I think it was popcorns or some other chips; I don't quite remember. =)\n\nParking around there was decent. There's a free (for nights) public parking lot on 20th. I would come back here.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-07", "description": "The owners really value this bar, and it really shows in their hospitality and care.\n\nThey're always coming up with new drinks, and are more than happy to use you as a guinea pig.  The 3 foot beer feeder should remind you of a water feeder for a hamster, but if it doesn't, you haven't finished a foot yet.\n\nI rarely give five stars.  Well, ok I just don't give out many five stars.  But this place I like.  So what? Wanna fight about it?", "author": "Alfred Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "I've embarrassed myself here once. At least, I was told I did. It's a fun little place to stop in for drinks after an afternoon at the park.", "author": "Ana F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-20", "description": "How the hell did this place get an average of 4.5 stars? Usually I don't expect much when I go to bars but this place was WAAAY below my standards. First of all the place is pretty cramped and hard to order drinks on a busy night since the bar area is so narrow. I'll cut them some slack here because it's hard to order drinks at most busy bars. However, I really didn't like the crowd at this place. There were a lot of ghetto AzNs that weren't too friendly. I went here with my bloods one time and we were having a hard time deciding what to drink. So I asked a girl who was sitting by herself with a drink what would she recommend. She said that she didn't drink and to ask \"that\" guy near the bar. Now it's quite obvious she did drink because she had one in her hand! Also \"that\" guy must've been her bf because when he came over he was hella glaring at me. I asked him the same question and he said \"remi\" and continued to glare. I swear he was going to beat me up. \n\nDrinks were alright here but I wouldn't come here JUST for the drinks. I really wouldn't recommend going to this place unless you hang out with ghetto AzNs. But I will say that this is a good place for a date. You can show your date that you can take a beating by a group of ghetto AzNs.", "author": "Michael Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "A complete bar with billiards, neck-cramping TVs near the ceiling, semi-functional restrooms, and dark colored bench seating so you can't see the stains, etc.  Smells funny.  People behind the bar are nice, though.  Seems like a great place for singles.", "author": "Dong T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "always use to come here. bartenders are usually nice, the drinks are cheap, lots of tvs. good place to bring friends and play pool. can be crowded sometimes and league on mondays hog the pool table all day.", "author": "Jake C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "Awesome neighborhood bar with lots of TV's, a jukebox, bathrooms that aren't dirty, locks with two stalls, a pool table, a patio smoking area and a mixed crowd. You can totally meet new friends here since it's so narrow. If you were sitting at the bar, you can easily turn around and make conversation with the people sitting at the table since it's so close. Ate dinner on Irving? Walk down 20th to Lincoln to Chug! Full of Awesomes. :D", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "my buddy and i went to go hit it hard on a random tuesday night and were on our way to buckhorn, another place i have yet to visit and ran into this place instead. we went in and it was pretty cool in there.  the vibe was chill, and the beers were cheap.  they had torpedo on tap, which is a strong beer to begin with and coupled with a jamison sipper for my friend, he was well on his way to smiles.  i like how the bartenders checked his and i's id's.  im not that much over 21 but i hadnt shaved in a few days so i felt insulted when you have underage sf state students throwing up in the bathroom or walking around spilling their beers.\n\nmy buddy and i played pool and i made it even more awkward when i paid for songs on the juke box and made it apparent who ordered the songs when the typical gangster boys who arent gangster but had their parents buy their cars and still live in their 5 bedroom house walked in.  its a cool spot, just expect kids and BET gangsters.", "author": "JD B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "Good place to grab a pitcher or pint while watching a game. Food is mediocre, but hey it's a sports bar.", "author": "Minh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-20", "description": "Came here one night with some friends on a whim. I like this place better than underdogs because they have a pool table, a Marvel vs. Capcom machine, and an outdoor patio (how cool). I guess it is a relatively small bar though. The bartenders are really nice and friendly, and they take the time to come around to see if everything is okay.\n\nWe came in for the $30 beer tower + nachos. The beer was alright (they all taste the same to me, just different levels of bitterness). The nachos were pretty good though. They didn't skimp on the cheese or salsa. \n\nOn a separate occasion I came here for garlic fries, which smelled and tasted great but I wouldn't call them garlic fries. But I have to say it was a really big portion and decently priced.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "I like beer.  Chug Pub has beer... so I am a fan.\n\n...\n\nreally though, it's a great place to get a beer and hang with friends.  Feel like making it a long night?  Get the chug tower.  The selling point for me was the free nachos! woohoo!  There's also a good selection of beer on tap.\n\nI like the fact that this bar has a menu, which also has descriptions of different kinds of beer on the back.  The menu is pretty big too, with food and alcohol filling it up.  The bartenders are always super friendly.  There's a pool table and smoking area.  Pretty cool spot compared to most of the places around the area.\n\nWho wants to share a chug tower?!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "Best place to be for St. Patrick's Day... Green beer flows...", "author": "Sheree A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "Well rum i've never seen (and that's saying something), a great smoking section and friendly and attractive wait staff.  definitely a stop for anyone in Golden Gate park who needs refreshment.", "author": "C. Grant M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "Decent prices. Decent bartenders. Love the location. Good neighborhood bar that has food.", "author": "Sylvia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-26", "description": "Clean bathrooms, clean bar, clean tables, clean seats... am i in sf?! The service, food, and drinks were all much better than I had expected from this corner pub and I'm definitely glad we went here to bask in drunken glory when CAL beat STANFORD and got the axe back ('08, baby!) Although the bf and I were amongst the younger of the customers, it was a lot better than other 'sports bar's' I have been to. \n\nThe bartenders were very accommodating as they turned the game on two screens and adjusted the volume and occasionally made sure we were ok... do you want another drink, do you want something to drink, more pretzels, etc. She also tried to disrupt the old creepy guy from trying to talk to me (as the boyfriend went to the bathroom) by asking me if I needed help. She's awesome! Overall, a very pleasant experience. As a girl, I think I enjoyed the clean floors of the clean bathroom with fully stocked paper towels and soap that dispenses. LOVELY.", "author": "Joyce D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-31", "description": "Love this place.  Very friendly and chill place.\n\nI have been here so many times, and each time, i enjoyed myself.  I usually come here to hang out with friends.  On our rowdy days, we drink a lot and are very loud. On our chill days, we just sit n chat amongst ourselves.  But whether loud or quiet, we always feel welcomed here.  \n\nLOVE LOVE LOVE the selection of beers on tap.  15 different beers on tap.  THIS is what I call a bar.  \n\nThe bartenders here are extremely nice.  \n\nAnd oh the snacks are perfect!!!  The wings they have here are so good!!! They have fries, popcorn, calamari, chicken wings.  All perfect bar food.  \n\nCan't go wrong with a bar like this.", "author": "Mai H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "Beer tower for $30. Any beer? I'm in. Free nachos? yeaa. Had my first snake bite here and it reminded me of an Asian sugar plum drink in sparkling water with a bad after taste... I'm not a big beer drinker, so I should not be reviewing beer. The guava mojito was yummm! I highly recomend the mojito. Next one up was the Flaming Dr. Pepper which could get dangerous fast since it tastes like Dr. Pepper! Don't forget to blow out the flame before you drop the hard liquor in the cup of beer. The bartender made a shot that consisted of 6 hard liquor and set it on flames called the \"ghostrider\". Could barely taste the alcohol going down with the heat burning. Curly fries were fresh and so good, we ordered two!!!", "author": "Anne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "Nice looking sports bar with its basic amenities for one.  They've several TVs along with a big screen, a pool table and a smoking area of all you smokers out there. \nTheir signature item is the chug tower which consists of a three foot tall tower with your choice of beer.  That with nachos is $30.  Not bad of a price especially if you got a group of friends to split the money for it.  \nFor the most part its a good vibe, friendly bartenders, and a great place to watch a ballgame.\nNow let's get the chug tower!!!!", "author": "Kris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "My favorite Sunset bar by far!  Great local bar wilth awesome crowd.  the staff is super friendly.  Multiple TV screens to keep up with the sports updates.  Reasonably priced drinks and bar food.  Try them out as you won't be disappointed.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-10", "description": "Ok, this place may have a different clientele than what I know of. But, I tend to like bars with more diversity. This was a local watering hole in the Sunset I chose. It's definitely has that local on campus bar feel to it. It's close to USF, City Coll. and State. There were a lot of young people here. By young I mean 21-25 age range. This place has a predominantly Asian patronage. But it's plenty loud and boisterous over here. The drinks aren't priced sky high [good, good], considering what I drink is always top shelf shit. They have a very friendly staff of bussers, and bartenders. They also serve food, nothing really exotic or of great variety. Burgers, fries, fried finger foods... I actually didn't eat or see the menu. I saw what was coming out of the swinging kitchen doors. There is a pool table, enclosed smoking area, and coin operated juke box. I'd go back with a crew of friends. Had a good time @ the Chug.", "author": "Erik R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-19", "description": "Very chill place to be on a tuesday night....or any night for that matter.\n\nOwner's and managers are always willing to say whats up and chill with you.", "author": "Dan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-22", "description": "the nicest bartenders in the area!\ni've been here three or four times, and the people remmeber me. The bathrooms are super clean too.", "author": "Tasos P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "Man, Chug Pub is THEE place to be!\n\n- Bartenders (esp. Sophia) are super friendly!\n- Friendly crowd.\n- Free pool on Sundays.\n- Good food! Bomb-ass cheeseburgers and fries!\n\nI can just say, I never leave this place sober! Thanks Sophia...", "author": "Matt W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-20", "description": "I'm not really into the chug pub, I went there once before for St. Patrick's Day and realized it just isn't my scene. The beer tower was cool except that it is mostly foam when you start getting to the middle/bottom. But they did take the time to create the illusion that there's still more beer in it. The place and the atmosphere just isn't anything special. Sure, it's fairly nice and there's plenty of pool tables with lots of people my age, but It just doesn't come across as anything different to me from many other bars. Last weekend my friends and were hanging out in their outside patio the whole time which was a lot of fun. It made for a different experience which was cool. I still don't plan on going back.... but if I did, I would be kicking it out on that patio with friends ordering drinks through the window ;)", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "This is a great option for a weeknight. The drinks are cheap, they have food, a smoking area, and a pool table. People are cool and the bartenders are awesome!", "author": "Megan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-15", "description": "Pleasantly unremarkable. Nothing special, worth a stop if your in the area or a local. There are better bars in the city though. The game machine was busted and the bartender didn't care which was kinda bunk. The city has so many places to drink i dont know that i'll be returning unless it's for a beer tower.", "author": "Corvus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "A 3 foot tower filled to the brim with your favorite beer and a basket full of chips topped with cheese from a can could be all yours for only 30.00!  This is the essence of chug pub, great value and tons of fun. \n \nThe crowd is always eclectic and chill.  Want to be anti social? It's hard to ignore the multitude of televisions, the pool table, or the table top bar game (photo hunt is my favorite).  Chug Pub is an easy decision either on a Saturday night or lazy Sunday afternoon.  \n\nBonus: How can I forget that there is always a friendly and attractive female behind the bar.", "author": "Jordan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "Cool neighborhood bar.  Staff is nice and drink specials are good.  Best when not overflowing with people.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-14", "description": "I'd been here back in the day of Dubliner but never before have I had such a good time and met as many cool & friendly people as I did last weekend at the now named Chug Pub (different management then Dubs). I had a great night with a good mix of people. Everyone there drinking and the entire staff were great. Good bar pooltable and some decent competition (sorry guys and gal, I had to gloat ;). It was one of the best \"first time visits to a pub/bar\" I ever experienced. Plus, it was their one year anniversary and they had platters of free Thai food... a great filler to keep you on the drink and feeling good. I was just going there for a couple drinks but stayed till they kicked us out at closing. \n\nBonus for clean and large bathrooms and smoking area...\n\nShout out to Tim, Justin and crew who made it a great night! And to the bartenders who I never caught your names, but thanks for being so friendly, attentive and fast with orders.  Best to you all and see you soon for sure. \n\nI will have to return for the NFL ticket and try the food... until then, I will keep with 4 stars but I am shooting for 5.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "Just moved to the neighborhood and went there on sunday to watch some football.  $10 burger & beer not bad. Not to crowded, i could actually watch and listen to the Raiders win! Definitely will be headed back for more.", "author": "Benji S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "I have raised Chug Pub up a star due to the fact the the owner made an effort to contact me and ask what I thought he needed to do to make his Whisky selection more attractive to me. Most of the people we write about just shrug of reviews and move on. SO Kudos to the Chug Pub!!!!!!! \n\nThis is a cool place to hang out with some friends on a week night if you are in the area. I like this place a lot now that I have been there a few times. Nice people who work here and good prices on the booze. \n\nI wish they had a better selection of Whisky since that is my thing. They have all the major labels but nothing special to offer from independent bottlers. The prices on the Whisky they offer are very fare and the prices on the beers are good as well. \n\nThey have a pool table but so many people waiting to get on and play it isn't worth putting your name on the list if you are only going to be there for an hour or two. \n\nThey have a heated smoking room that my friends and I tend to hang out in since we all smoke and the great thing about this is they have a window linked to the bar so you don't have to go back in to order. \n\nOver all this is a cool place and it is nice to see a younger generation taking over the older bars and bringing new life to them. I have not yet tried the food but it seems they have a good menu of bar food so I will get there one night early to try and claim a space at the bar or one of the few tables inside to try it out.", "author": "don h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-28", "description": "First off, lost my Yelp review virginity to Chug Pub...she's that good.\nChug pub is an amazing bar/pub that I have frequented many a time with my buddies during happy hour and long into the night. I live in the outer Sunset, pretty much 20 blocks down, and this is one of the best bars in the area. Beer prices are normal, with $2 dollar Tuesdays with Red Ale (pretty decent ale, maybe a 6% ABV?). I like to drink...and drink a lot...and chug pub gets my fuel tank filled. \nOutdoor smoking spot is really awesome. Its heated and has music. Its fun when you are hammered and spit out on the sidewalk or flick a smoke through the opened area and almost nail some passerby. I don't care, its all good in my book.\nGreat for a group of people or with a pal during happy hour. Bank of America and other banks are only a block away on Irving-so if you don't want to drop extra drinking cash on the ATM, you know where to go.\nSo yea, drink and be merry, for tomorrow we may die!\nedit:  the bartenders are babes.", "author": "Zach L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-10", "description": "Okay, if you want to grab a beer and be outside/inside.  What makes it for me is the nice people who work here.  Just a local hole that gets props for good service.", "author": "Valerie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-22", "description": "Hella crackin on a Saturday night. Not a bad place to have a drink or two, then continue your night on, or you can stay here the whole time, as long as you have a sweet spot near the pool tables or a seat in general! It's your average bar with a cute little name, however, there is one thing that sets this part a place from others, the mo-effin french fries are the shit!!! Perfectly fried to a nice crisp, seasoned beautifully, ok, a tad on the salty side but for some bar food, they were damn good french fries. I will only return for the fried fare.", "author": "Tatiana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-16", "description": "I pass by this bar everyday and decided yesterday was the day to try it out. As far as pub food goes it's good. I mean not mind blowing stuff but just the right amount of greasiness that I was anticipating. My buddy and I both got the chicken tenders and fries. Usually chicken tenders are super dry in the middle. Not these. Moist crunchy deep fried goodness. My hips probably hate me. And they have my fav Blue Moon. I actually don't remember how much we paid for the beer. Well, who does after a few cold ones anyway.", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-24", "description": "ok after tonight I feel I needed to make a review about this place. first of all I just wanna say this place is great....drinks are proper and snacks are fucking awesome. employees are all helpful and friendly.\n\ntonight I saw the most ridiculous thing I have ever seen happen at a bar. so at 2 am people need to be out of a bar. as everyone is getting kicked out this dude decides that he doesn't wanna leave and actually gets in one of the workers  face. he actually bumped into the guy and was all up in his face.if it was me I would knocked this asshole out. this motherfucking dip shit had the nerve to actually be mad that he's getting kicked out. yelling fuck you as he walked away. the funny thing is the dip shit and his girl lived across the street. this dumb bitch actually opened her window and started yelling \"yelp.com....yelp.com\" so I felt the urge to put a review in there defense. its 2am you stupid fucks they have to kick you out!", "author": "Leo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-03", "description": "Woohoo! Our little watering hole. Never gets too crowded. Always has the best service. Happy Hour til 8!", "author": "Ping N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-19", "description": "i came here for garlic fries. yeahyeah a bar drinking blahblah. i don't drink. so! garlic fries! i asked bartender dude \"do you have garlic fries?\" - \"yeah\" \"ok ill take 2 orders to go please\" he goes in the kitchen area pulls out the fries from the freezer fries them up and puts salt and some green stuff on it. \"here you go, 6.50\" \"thanks\".\noff i go thinking o boy! theres so much! woo hooo! i'm going to have the stinkiest breath ever!\ni open them.... wtf theres no garlic....... \nmy friend said it was more like sour cream and onion fries. they were good fries i guess... but NO GARLIC.\nDANGIT", "author": "just k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "Great happy hour and decent price on a chug tower plus a pool table. That's all I need. Never had a bad experience with any of the staff even when it gets super crowded, which it does. Irish pub atmosphere and plenty of TVs to watch games and what not. Definitely my go to place when I'm in the Sunset.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-14", "description": "anytime fun.\n\nthis is a totally biased review on my local watering hole that took me in when i arrived in San Francisco and offered me tasty drinks, late-night munchies, good music with impromptu sing-a-longs, fast friends, friendly regulars, awesome bartenders, a place to hang out every Thursday as well as on the occasional Tuesday and Sunday or any day of the week for that matter. \n\nthe end.", "author": "zain i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-23", "description": "Helllll yeah! \n\nI love chug pub!", "author": "Jen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "lots of beer, beer tower, pool table, great crowd, funny bartenders.\n\nthis place is where i go to get sloshed before going out, or just to watch the games with some friends.\n\ntheir food menu aint bad either... but youre mostly here for the fun atmosphere.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-29", "description": "Yes, a good bar. Very reasonable prices, friendly and fast service (even on a crowded Saturday night), and great selection of beer and some hard to find liquors. The highlight for me, however, was the food. Now, of course a fresh grilled cheeseburger tastes amazing in a bar at 1 AM. This is why I decided to go back for a quick (and sober) lunch. To my delight, the food was even better when I could taste it! Not the place for a healthy sophisticated dining experience, but for a big juicy cheeseburger that tastes like I just BBQ'ed it myself: you can find me at Chug Pub.", "author": "Jon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "Chugpub is the spot for folks that live off of 19th ave! Me, my roommates, and friends have been coming here for over a year thanks to the the 28 and Owl bus lines. The bartenders and management are great and friendly, and the great drink specials make sure I come back to hang. Who would have guessed that a beer tower and fries were a perfect combination.", "author": "Ignacio L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-23", "description": "Can you make a good thing better? Hell yes! I'm not a huge burger fan, but I had the burger the other night and it might have been one of the best burger's I've ever had. I really really loved it. It had some kind of spicy sauce on it, which I can't really explain, but it was amazing.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-03", "description": "Great place to hang out on a weekend! I really liked the atmosphere of the place and especially enjoyed the chug tower, which is a $30 tower of beer (approx. good for 3-4 peeps).  Also comes with choice of appetizer.  I went on a pretty busy night but was still able to get my drinks relatively quick.  There are a lot of T.Vs in the bar area and even has a pool table off to the side.  This is a great bar to hang out in and would recommend checking it out.", "author": "Foodie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-11", "description": "This place is growing on me.  I find myself here more and more for weeknight drink.  Maybe because I had this strange tendency of liking places with cool smoking rooms.  I actually come here and take over their smoking room, and turn it into my lounge with my friends.  Bartenders are nice, and the owners are really cool peeps.  The fries are great!", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-28", "description": "i really want to go back and try that beer feeder!!!!!!!\n\nthis place was fine. it was a friday night and there were only like 3 groups of people in there. not too crowded. however i have seen it get crowded in the past.\n\ngood gin and tonic. nice staff. clean. its just your usual bar.\n\nmaybe ill write something better when i try the beer. as for its just...like whatever.", "author": "A. V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "nice place with a good mix of customers. Drinks are reasonably priced and there is a juke box and pool table. Aside from the fact that the bar tender didn't know how to make the drinks I wanted to order, this is a pretty cool place with super good nachos! yea, definitely go and try the nachos.", "author": "meL Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-08", "description": "The bartenders are cute (Linda, Michelle, Sophia! Hi girls!), drinks are cheap, and it's just a great hangout spot for the person/s trying to let off some steam because of a rough week. Generally NOT packed with girls, but thats ok thats why the bartenders are there. Go get a basket of curly fries, a chug tower, and you are set. Go check it out for yourself. Remember its CHUG-PUB spelled with a very big F...U... oh yeah and a N", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "nice neighborhood bar. drinks are super cheap. they have pretty good eats...my friends ordered nachos and they looked pretty bomb. nice chill place to grab a drink with friends. its a bit of a high school reunion though...we ran into a lot of folks we went to school with. i'm not really surprised given the location but sometimes you just don't want to be forced to make small talk with people that you probably aren't going to be hanging out with anytime soon. =P", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "This place is great: relaxed vibe, awesome bartender and great drinks... what more can you ask for!? \nThe best part was the bartenders, who were really personable.  A free round for our group didn't hurt anything either.  Ask the bartender for a Red Carpet Deluxe (his specialty), your lady friend will love it.", "author": "Nikkers B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-29", "description": "A good place to drink some good local craft beers and eat french fries. The drinks are decent priced. Usually they get really crowded during the weekends so I would like to come during week days better. The staff are pretty nice.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "Great place. Awesome design and name. Spacious = not too stuffy. I don't usually go to bars much, but I really like this neighborhood bar because it's clean. The floors if spilled on, are cleaned up instead of walking around on stickiness. The bartenders were also really fast and I was pretty impressed. Keep it up Chug Pub!", "author": "Katherine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "The Chug Pub is a cool place to grab a beer with your friends and relax.  They always have a game on and some kind of drink special.  I wouldn't come here if you're looking for a wild night.  Its just a quiet pub but the food is good and the people here are friendly and relaxed. You can probably find me on one of the stools here a couple nights a week.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-10", "description": "1 year later and i still love this place!  it's definitely become my pub- i've made some great friends there and the bartenders and staff are amazing.  this place makes me wanna smile.  yay for janet, sonia, john, david, and of course terence!  the friendliest neighborhood bar you'll find.", "author": "Jen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "I love this place. They  have an open air room with a fan, heat lamps, and a little window to the bar for smokers. You can smoke a cigarette, stay warm, dry, AND still get booze. When you're done smoking, you can head inside and get a game to play with your friends, or wait in line to play some drunken rock band on the bar's PS2. Drunken rock band is the best rock band.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-17", "description": "I've seen this place a few times and dropped in once to look for a friend. But, yesterday I actually went in for a drink for my first time. Overall atmosphere was okay, bigger pub than the usual bars I go to, but parking was difficult unless you park on Irving. I am very picky when it comes to service because that's why we tip right? I was very dissatisfied when the bartender asked me for my ID and I had to pull it out of my wallet. She didn't even look at my age and gave my ID back. Then I put it back in my wallet and then she tells me she forgot to look at my age. I know I am being anal and maybe she was drunk, but that irritated me to pull my ID back out from my wallet because I rarely get carded wherever I go. On the bright side, they do have snacks and warm appetizers that help with the drinking.", "author": "Pudgy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-15", "description": "Great bar to hang out at with a great group of friends!  Conveniently located near my house so I can just walk there! Shoot some pool and enjoy the beer tower!", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-25", "description": "I like the Chug Pub for a great place to hang out shoot pool, drink beer, and burn. Its perfect for hanging out with a few friends. They have a great smoking cubby that opens up to the park side. The ratio was about 50/50 boys to girls. Everyone was cool, and John, the bartender was really friendly and attentive.", "author": "Philip N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "For months I went by this place every day on the bus. I always thought I would never go to a place called the Chug Pub, I had visions of my nasty college bar.  At last I broke down and my roommate and I headed on over. Besides the fact that my bartender told me I didn't look nearly as old as I really was (I'm 29 she was barely 21) the place was great. Affordable, a good beer selection. Pitchers. Decent pub food. They have a 3 liter beer thing (which really is 2.5 liters).  Good place to just go grab a beer and watch a soccer match.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-13", "description": "Came here to watch Game 4 of the Lakers/Magic game with a buddy of mine and it was a great time.  Got there a little early so got a chance to chat up the bartender and little and pick a good seat to watch all the action from.   The bartender was very attentive and was easy on the eyes as well.  They had at least 10-12 beers on tap though i stuck with the trusty blue moon for most of the night.  Happy hour lasted until 8 pm so i got most of my drinking in before the cut-off.  The food isn't amazing per se but its typical bar food so what do you expect?  The crowd was great though most were in to watch the game but it was cool to chat with some of them.  Definitely a place i would go to again.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-01", "description": "Came here on New Years Eve and it was packed! Could barely find a stool in site! The bartenders were all ladies and all pretty hot. The space had the right vibe to it and I saw a couple of the gigantic chug towers being ordered. Overall, I liked their drinks and I can see that they were definitely pouring generously. That Tokyo Tea may look good, but it will FU*K you up!! I saw the bartender with two bottles at her hand as she poured, poured and poured some more! Then a little bit of this, and back to pouring again with her two bottles! Tasted nasty, looked good. Everything else was good though. The curly fries are delicious, but the regular ones are plain and seems to be unsalted. Prices are very good. The place is small, but great.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-21", "description": "Ha stopped by here friday night and it was packed.  The guys here must be doing something right.  I finally saw the chug tower that I hear so much about....crazy.  Also I still can't get over how cheap drinking at a bar is compared to club prices.  Great place to hang out with friends and have fun.", "author": "Allison T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "I spent 2008 NYE here and 2008 Halloween here.  Its two blocks from my place so it makes sense.  Plus the guy bartenders are hot.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-10", "description": "great bar off of 19th ave. they have a pool table, and have a indoor smoke lounge or should i say an outdoor smoke lounge with heaters. great place to hang out on a friday night. been there one time and would like to go back. \n\nparking- sucks of course but, you could get lucky\nprices- i believe they have drink specials.\nfood- there are appetizers", "author": "master b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "Well, if I gave Dragon Lounge a 4, this place can't get anything lower. In fact, I'd go a little higher just because they have food. Just another local bar in sunset, great place to hang out. and plus, can't go wrong with a bar that serves Hendricks", "author": "Jin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-26", "description": "Was here on a Friday night for a friends birthday.  The place was great, scene was cool (half the crowd was our friends that came out to celebrate).  There was one HUGE thing that totally ruined the night.  The bouncer with his slick back hair and pink dress shirt, that exposed a pale chest.  Really?  Anyways, the beef with him is that he totally disregarded that the place was packed for a birthday party, I was somewhat in the back of the bar area, snapping pictures of the birthday boy blowing out his candles, and he starts to push my girlfriends, huffing and puffing, \"you guys can't be here, what do you think this is, ramble ramble ramble, then what blew it out of the water, he says \"Who the F are these kids\".  LOL.  Okay guy, if we weren't there the only people that would be there, don't even look old enough to party.   I'm gonna forever swear against this place.  Totally unaccomadating, rude and disrespectfull.  Don't bite the hand that feeds you...", "author": "Alice E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-20", "description": "Great place for a drink or ten.  Cute bartenders are always a plus and reasonably priced drinks.  Plus, despite being so close to Irving & 19th Ave, parking isn't nearly as bad as I would have imagined.  This is definitely going to be one of my 'usual' bars now.", "author": "Allan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-18", "description": "Will definitely go back. They have an awesome tower of beer and you can get anything on tap. We got about 9 pints out of it for $30 and we also got fries. This place was comfortable and fun for me and friends to go out and get drinks. The tower is a perfect gift to someone on their 21st birthday.", "author": "Asia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-18", "description": "oh Chug Pub how I love you! The owners and bar manager are the nicest, most fun guys to hang out with! It's a clean bar with clean bathrooms! Their bartenders are all so cute and friendly, and they make mean drinks! I love the chicken wings there and the fries are damn good. The crowd here is always friendly they come in flocks pretty late like 11p..and I event get $2 Tiger Beer specials on certain nights!", "author": "Dessa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "chug pub is a chill spot to hangout with friends. the service is quick and the drinks are cheap! they also serve up some wings and fries that are tasty.", "author": "Gordon F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-31", "description": "Good place to hang out with friends. Not too loud or rowdy, fun atmosphere. Bartenders are nice and attentive, food is good (nothing like skinny fries to satiate your drunken appetite) and prices aren't bad.", "author": "Jasmine O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "We stumbled in here after a free concert at Golden Gate Park.  What a great little find.  Very nice staff.  Of course my friend and I were complaining a little too loudly that it was hot in there and someone who works there came right over and told us he just put the ac on for us.  We ordered the Chug Tower and were surprised with our free nachos.  That was awesome!  Oh, and the juke box had a great selection of songs!  Overall, a pretty fun place that I will be coming back to when in the area.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "This place is very nice.  Very Chill bar with a good mix of people.  Bartenders are nice.  And cannot complain about a place that serves Hendricks and curly fries", "author": "Kendrick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-25", "description": "This bar is drop dead goodness. It's got all the features a true drinker needs. One of two places I know that serves Tiger beer. Fish & Chips is a huge plus. Great environment and atmoshphere. I especially like the location and hours of operation; open pretty early. Service is always good. The staff is young and energetic. See for yourself.", "author": "Butch M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-13", "description": "Have been frequenting this location for many years through its various incarnations, but as the chug pub it has never been better. Very friendly bartenders and owners. Terence is always up for a chat and makes everyone feel welcome. Try the chicken wings and the onion rings!", "author": "ODHRAN M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "Fried food, pool, flat screen TVs everywhere (all sports, 24/7), awesome bartenders (that'll remember your name), 3 foot tall chug towers, and an outdoor patio area in which to drink and smoke.... which includes a little sliding door that the bartender can slip a drink through... awesome.\n\nMy favorite spot to chill and catch up on my Sports Center.  I would say that they should re-name this place \"Cheers,\"  if that name wasn't already taken.  I guess \"Chug Pub\" works too.", "author": "Vincent M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-01", "description": "This place is dope!! You really can't ask for anything more then what these guys provide! Friendly ass service, good ass drinks killer POOL table and sports. Why would you go anywhere else in the sunset!! CHUG PUBS the best!!! Kudos to Tim and his staff for making me feel welcomed!!", "author": "Joely L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "TVs on every pillar recapping the top ten, NICE bartenders, and a wide selection of beer.  Thursday, Friday, and Saturday are busy.  I've only had the hot popcorn, but I hear the food is commendable.\n\nThree of us went here for a couple.  Unfortunately, it was Smirnoff's promotional night...,so we had to celebrate.  Hey, it was free, I live in the area, and it was free.  With the economy so tough...j/k not gonna go down that route.  But seriously, see for yourself.", "author": "leak l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "I've been to the Chug Pub a few times and I've loved it every time.  I was iffy/tickled by the name of the place, but I gave it a chance anyway and I'm glad I did.  The size of the place is about right and I've yet to see it get too crowded.\nMost of the time I've just had a few pints, but my recent trip I started with some of the food, the chicken strips and fries, which was good and just right for the price.\nThat same trip me and my buds decided it was time for the Chug Tower!  The tower is awesome.  It's not exactly going to save you a lot of money, but it's enjoyable to have your refills sitting next to you wherever you are, and some Nachos to go with it, for about the right price.  I recommend it just for the adventure.\nMost importantly, I give this place major credit for the small \"inside-yet-outside\" area for smokers.  Being able to have my drink and smoke a cigg is something I have not been able to do for a long time.\nProps to you Chug Pub.", "author": "Caleb G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-24", "description": "Best bar in town for several reasons:\n\n1) Good prices\n2) Great drinks\n3) Hella beers on tap\n4) Tasty munchies\n5) Cool mixed crowd\n6) Friendly owners\n7) Hot bartenders\n8) CLEAN BATHROOMS!!!\n\nI've been to this bar several times and I've never left unhappy or SOBER for that matter. My friends and I love the chug towers! This place is definitely a favorite!", "author": "Bob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-03", "description": "A great bar to hang out with friends... we came here after a long day at CAS and de Young since it was close by  to grab a few drinks... we left the bar completely hammered... lol.  We started off with the Chug Tower which is a GREAT deal... The chug tower is $30 dollars and it comes with fries and nachos (I think, I'm not sure, there was a little confusion at first but we ended up with fries and mozerella sticks because they didn't have nachos)  The chug tower pours about 8 pint glasses full of beer... and they have a great selection of beer... Where else can you get such a great deal?  After the beer we started drinking their special shots... the bartenders were super friendly and started making us their \"specialty\" shots which lead us to be in a very drunken state... but the shots were very tasty and different!  There's a pool table and tons of TVs to watch sports and other things on... there is also a smoking room which is completely ventilated to the outside but nice if you want to smoke and not outside in the rain.", "author": "Kymberli C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "Parked near this bar several nights ago to have dinner on Irving. It seemed lively and was fairly crowded for a tues night so my friends & I decided to check this place out. It was a surprise as I expected a quiet bar . It was a very comfortable space to hang with friends.and everyone there was  friendly. All the customers seemed to be enjoying themselves with the games etc. the space feels like a giant family room! Nice addition to the neighborhood. Will be going there again.", "author": "M H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-06", "description": "So a friend and I were looking for a place to chill on a Monday night that had a good vib where we could just sit and have drinks...we saw all the reviews on yelp and bang zoom, here I am. Thank the fucking lord. This place is AMAZING. It's in a pretty easy location to get to and the whole place is SO clean. I mean you could eat off the floor. I wouldn't god-forbid I mean seriously ewww, but the point is you COULD. They were playing Scurbs on TV, and seriously who doesn't love Scrubs? The drinks were strong as the river Styx and the bartender was so fun. Seriously she was a doll. I want to invite that bitch on my next girls night out I love her to death. Even after sitting there a few hours and just chilling she made us up shots at the end of the night, just cuz. Too adorable. Great vib, great bartenders, and even with a jukebox that eats your money (they gave it back to us) this place is a 10!", "author": "Marissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-23", "description": "i love this place!  everytime i come back to the bay area and meet up with my friends, i want to find an easy place to get a drink at a good price.  i came here on a friday noon, and found the place fairly crowded, but was still easy to talk to my friends and order drinks.  their appetizers are pretty good too.\n\nthis is my new venue for prepartying and lounging with friends.  it might be a bit far from the SF action, but its worth it.  i cant stand being in the middle of the city unable to find parking and getting ripped off for a beer.", "author": "D C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-27", "description": "This place will forever be known as the \"blackout spot.\"  All in good context, of course!  Thanks, Tim, Terrance, and Janet.  The people are good, the drinks are good, the food is doable, and the beer towers keep everyone happy.  Don't forget to pick up your Chug Pub T-shirt from behind the bar.  It's an American Apparel tee and is actually extremely cute!", "author": "Kendra R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-20", "description": "Came here a couple weeks ago and ordered a couple of towers ($30 regardless of beer choice). Nice selection of beers and can't beat the nachos or fries with each tower! The chicken tenders were also good. It wasnt that crowded when we went, so it was a great place to hang out with a group and drink.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-15", "description": "I love breaking awkward conversations with people by challenging them to a drunken game of jenga.  Good times!  Chug Pub, by far, is my favorite bar in the Sunset District.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "Definitely the best in the Sunset! The crew is great. Big UPS to Terrance and the girls for holding it down. Can't go wrong with a tower (includes grub) when you're chillin with some friends.", "author": "Glen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-13", "description": "CLEAN bathrooms, tasty food, friendly and attentive bartenders, great crowd! Love this place!", "author": "A W."}
