{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "We walked 3 miles to get to this place. We heard about it through some friends and decided to visit. The walk was so worth it and the art was inspirational. Love it!", "author": "Mari M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-25", "description": "Clarion Alley is nice, but it's unfortunately being overrun with photographers and Instagram models at all hours of the day. I don't know how lot of these murals are still intact (not defaced or anything) after a few years of being painted!\n\nOverall cool art with predictable political messages embedded. A good place to get the exact same photos that a thousand other people have for your Instagram. If you're a tourist, go for it. If you're from the Bay, I'd personally recommend trying to be a little more creative and capturing other parts of the city that haven't been done over and over and over again. But that's just me, it's your Instagram, do what you like!\n\nOverall a nice little bunch of art in the heart of the Mission, though it hasn't changed much in a few years and that can be taken as awesome or taken as boring.", "author": "Phillip V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "Clarion Alley is located in the Mission District in SF. The city has lots of murals scattered around but this is the place to go to get the most bang for your (Instagram) buck! It's a long alley completely covered with amazing murals from all different artists. My boyfriend and I stopped here on a tour we were on and I was able to snap photos of many of the murals.\n\nA lot of the murals in Clarion Alley have a political theme to them, which can make for a great conversation starter. I am not sure how often the murals change, but the ones we saw were all incredible with the level of detail and artistry. It would be fun to go back in the future and see which ones have changed. I wish I knew who the artists were so I could look them up and tag them on my posts. When we were there it wasn't crowded at all but I imagine it could be busy at times. I was really glad we got to stop here and I would recommend it to anyone who enjoys art, social commentary, and thought-provoking material.", "author": "Katy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "I love street art and when I saw there was an alley of it in SF I made sure this was on my list of places to see.  Clarion Alley didn't disappoint with its row of of funky art walls and graffiti work. I wouldn't want to visit this alley at night alone but during the day it was cool and hip.  There were people just hanging in the alley but I didn't feel unsafe. I was asked if I wanted to buy some weed a few times but I just said no and kept it moving. I'm a New Yorker so this didn't faze me. lol\n\nI took my time checking out the murals and taking pictures of my favorites. Some of the murals had political and philosophical meanings.  I enjoyed my stroll through the art alley.", "author": "Teresa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Very empowering alleyway in San Francisco. Looks unassuming at first, but the magic really happens when you step inside and let yourself get lost in the individual murals. They each send an incredibly strong message and are beautiful to look at. The entire experience gave me goosebumps.", "author": "Sara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "This brings me back to Berlin, Germany graffiti and Bogota, Colombia graffiti walking tour!\n\nI love the colorful expressions on my alley stroll  in the heart of the Mission!  It's like it's telling me the vibes and history of not only the turned around Mission neighborhood, but of the world and current public dynamics!  How exciting to observe the graffiti and think about what it all means!\n\nA picture is worth a thousand or so words!  I would say and put it, countless words and endless of meanings!  \n\nOn a Mission - it's left to self-interpretation...!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "It was the last few hours in the bay area and was peeping a friend's feed on Instagram and saw she was at Clarion Alley, and I knew I too had to go check it out before I headed home.  \n\nHopped on BART and got off at 16th st & Mission and walked like a  1/2 a block and found Clarion Alley pretty easy.\n\nI love street art, I am lacking in the drawing skills so it just fascinates me.\n\nThe art work is beautiful, weird, thought provoking, political and definitely making a statement, everything art work should be.\n\nIf you are in the city, or even the bay area take some time out and stroll down the alley. I am glad I did!", "author": "Monica O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-22", "description": "Expecting to come across a lot of quality artwork here is like going to a nude beach thinking you'll see a bunch of hot chicks naked.\n\nGood luck with that.\n\nAt least it's relatively effortless to find (in close proximity to the 16th St. Mission BART station and easy to stumble upon while on Valencia) and there are many good places to eat nearby too. Several friends that really know what I like highly suggested I check it out, but it ended up paling in comparison to street art I've encountered in places like LA and NY.\n\nMuch of the work at Clarion Alley was too amateurish and devoid of compelling features. The political \"art\" largely lacked substance and seemed more like a parody of someone trying to make a profound point, thereby trivializing the issue they intended to spotlight. Not everything was a complete miss though - there were a couple of unicorns.\n\nI will acknowledge that just about any public art is subject to a short shelf life due to others constantly painting over things, so it's possible I \"caught them on an off day\" and there will be better stuff if you go in the future. And it's possible that those that gave it 4 and 5 stars walked into an alley that looked a lot different than the run-down one I was at in early August of 2017. \n\nTo give a place 2 stars when you're not even paying money though, that says a lot.", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "This was our 4th time visiting the Clarion Alley mural project.  We love seeing the new artwork along with the ones that have been there.   Beautiful colors.   Great expression.   Also love the thrift shop next door!   \n\nCan't wait to go back soon!", "author": "Shannon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "A must see. Great street art murals, some have been restored from the 80's. It only spans 1 block. Watch your step though, I almost tripped over a dead half eaten rat. It's not clean but not dangerous, well worth the time.", "author": "Tommy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "I actually found it hard to find artwork i liked on the street. Clearly, that is a personal presence. The mission district is known for its street art scene (and this was concluded while I goggle searched for street art in San Francisco). Clarion Alley kept appearing in my searches, so my friend and I drove up to the city to check it out. \n\nLike any alley way, Clarion was a little difficult to find unless you know exactly where it is. I decided to park nearby where our maps located the alley. Walking made it much easier to find it. There was plenty of meter parking on the street. A lot of other alleys have artwork near the area as well so it might help to park in the center of where you want to go and walk around the mission district on a beautiful day. \n\nI can't remember how many murals there were because they were all interesting. I personally like the political murals. There is a lot of depth and you can tell the artists are passionate about the content of their works.", "author": "Martin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Whenever you're in the Mission, stop by the Clarion Alley and see what new and colorful street art is up.  Every time I visit SF the artwork is different.  And no matter your viewpoint or what you believe, you can respect the different socio-political pieces that local artists have created, which tends to be the theme here most of the time.  I especially love how most people here visiting, contemplates what's being addressed in these murals, which great art often invokes.\n\nThe Clarion Alley is free and many people, including locals will visit.  It's not a long alley at all, so will only take you 15 - 20 minutes to really view and check out all the pieces.  It's right in the middle of the Mission neighborhood, sandwiched between shops and restaurants, but will be easy to spot once you're on the main drag of the Mission.", "author": "Jacques I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Fantastic gem. Clarion Alley mural project houses awesome, weird, fantastical, odd, beautiful, and head scratching murals and thought-provoking quotes and political standpoints. It's a great place for art lovers or even the casual street art-consumer, or seeker of the perfect selfie backdrop. \n\nI don't know how often things get painted over and how quickly the scenery really changes, but it seems like a great public art space for a little stroll to experience the self-expression of the community.", "author": "Nikita H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Awesome hidden gem and local attraction--if you're a local of the Bay Area you will definitely dig this alley. The art is very \"a la Mission\", very street, very conscious and beautifully raw. Right in the Mission district as crossing Mission and Valencia Clarion alley is a must see. You may see artist painting and you may smell weed but don't trip because the alley is meant to be admired so walk the alley, take pictures and take it all in. Clarion alley is a local gem right in the Spanish heartbeat of San Francisco.", "author": "Karlos G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Since living in NYC I've become increasingly more obsessed with street art and graffiti.  The colors, the creativity, the overall design is something I'm drawn to.  Soooo whenever we adventure to another city I make sure to search out some of these 'local flavor' type of spots to see what the area's artists are creating.   Clarion Alley did not disappoint!\n\nThe alley itself isn't all that long but with all the artwork it'll take you some time to get from one end to the other... and really you should take your time.  There are so many beautiful pieces to see, many with positive messages, so worth a trip to the Mission District.", "author": "Alyssa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "The hodgepodge of colorful, often provocative art has been on the walls since 1992 under the guidance of the Clarion Alley Mural Project, a group of volunteer street artists that have ensured a forum for free expression on an open canvas of fences, garage doors, and building exteriors in this one-block alley between 17th and 18th Streets spanning Mission and Valencia Streets. The best time to come to the alley is during an event like Sunday Streets or the Summer of Love Festival where they close off Valencia Street.\n\nThis allows people to flow freely into the alley to admire the over fifty rotating works on display. On my most recent visit during Sunday Streets on Valencia, there was a salsa band playing near the entrance (photo: http://bit.ly/2obqulE) with more avant-garde characters deeper in the alley (photo: http://bit.ly/2nNfEi4). I believe I was watching artist Mel Waters put the finishing touches on his painting, Ghost Ship (photo: http://bit.ly/2nURPWp), though his most memorable work is a profile portrait of Prince painted just after his death (photo: http://bit.ly/2oOsscA).\n\nThere are, of course, more politically charged statements like Stop the Corporatocracy (photo: http://bit.ly/2o83VfT) and Tax the Rich (photo: http://bit.ly/2oSq5ma). Several are colorful renderings of the immediate neighborhood (photo: http://bit.ly/2nNe7Zt) or celebrations of local heroes like tattooist Dean Dennis (photo: http://bit.ly/2oStEsv). A few look simply like works by fly-by graffiti artists. The rotation of art over the past quarter century is an impressive achievement, and it's definitely worth a stroll at any time during the day.", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "Such a cool, vibrant alley in the Mission with tons of beautiful murals/wall art. Seems to change every so often -- so I try to come back whenever I make a visit to the Bay Area. \n\nI'd say it's worth seeing even on a rainy day. A lot of the art is political/social commentary, about some heavy topics & current events, as is expected. All of the pieces are colorful and beautifully done. You'll get some great photos here.\n\nDefinitely recommend stopping by Clarion Alley if you're in SF's Mission District!\n\n[29/100]", "author": "Emily K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-17", "description": "One of my favorite places in SF. A whole alley of murals, socially conscious and ever changing. I like to wander down here whenever I'm in the Mission. Free art! A must see!\n -I warn you it is an alley and sometimes smells like urine, but I've seen city workers street cleaning regularly.", "author": "Ana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "What a great place to visit when you're in SF. I loved that it was lowkey and it was nice to see artists literally in the process of painting some parts of the alley when we were there. A lot of the pieces had beautiful social commentary and some were great memorials for famous figures in history. This is a great, quick place to visit.", "author": "Waleed S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Cool art work, would drop by if in the neighborhood again.\n\nIt was cool to stumble on to this, and wonderful how accessible it is to the public", "author": "Jenny V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "One of my favorite places we visited during our winter trip to San Francisco. We went early in the morning around 10am and were the only ones there. By the time we finished, people began trickling in. The murals are STUNNING and with every piece there was a story. Coming here just to use the art as a backdrop for Instagram pictures is doing Clarion Alley an injustice. If you get the chance, it's so nice to just silently walk down the (long!) alley and reflect on what each artist chose to showcase. Also, look up to see multiple pairs of shoes dangling overhead on the power lines - this seemingly small gesture usually carries haunting symbolism. Honestly this spot is worth to check out and I would definitely recommend non-locals to make time for it in your itinerary.", "author": "Mona M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "This is a really cool alley with beautiful street art! Apparently they change from time to time and are usually about current events.\n\nA few weeks ago, the art we saw was related to the housing crisis, corporate greed, racism and other heavy topics.\n\nWhile there are walls of wonderful art, the alley is a bit sketchy so be careful.", "author": "Nina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "This place is so wonderful and beautiful and colorful. I'm so glad I stumbled upon this alley. I highly recommend it to anyone visiting sf. Here is the link to my blog post about this beautiful alley. \n\nhttp://www.paddlinginstilettos.com/2017/05/three-days-in-san-francisco-ca-d-y-o-n-e.html?m=1", "author": "Ann P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Such a fun spot for Urban photoshoot! The art changes every month I think?! It's very neat and you learn to appreciate the time these artists took.", "author": "Monika Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "REVIEWER # 163\n\nI was blessed to be born with a lot of great skills and talent....but one thing I wasn't blessed to have is a good hand that can work miracles. No people! I am not talking about a message therapist...I am talking about an artist. I can't draw for sh!t! True story...That stopped in like 5th grade after my teacher thought that my painting which was a family photo looked like a zoo full of animals. *Bows head in embarrassment*\n\nSo when I go out, I love seeing drawings and graffiti that's dope! I mean photos that tell a story just by looking at the picture!\n\nI was walking in Mission Street when I had seen tons of people in this bright alleyway. Being the noisy person that I am...I decided to go see what everyone was looking at & oh boy!!!\nWho would have known that Mission Street would have an alleyway full of bomb artwork? Wowzers, a definition of hidden graffiti artwork. \n\nI have to admit with other Yelpers about coming here to take beautiful background photos or just hanging out and being a tourist. I don't know how frequently the artwork changes but the last time I came here I was able to see a nice beautiful photo of Prince and the sh!t looked dope!\n\nI would definitely be back here and matter of fact, this may be my background to a couple neat sexy photos. This is definitely snapchat and Instagram worthy photos, so get your phone ready while you take it all in! \n\nA wonderful place to bring friends and family that has never explored San Francisco before! You have to come and see it to believe it!\n\nREWIEW 163/196", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "This is street art at its finest. It is well maintained,however, it can be shaddy. I saw some homeless individual urinating and asking for money.\n\nGeneral background, CAMP( Clarion Alley Mural Project) is  a volunteer run organization and recieves support through their annual block party, donations grants and walking tours. The walls that belongs to an artist for as long as they maintain their murals. When an artist moves away or is no longer available to maintain their wall, CAMP will select another artist to paint\n\nThese artworks are bold, colorful, distinctive, authentic, awe-inspiring, engaging, imaginative,playful, refreshing and symbolic. I was touched by the work I was seeing. It was visionary and visually stimulating. You must go see it for yourself. Amazing and powerful!", "author": "Julie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "I've heard about this place for a while and I am a sucker for street art and wall art! A lot of the art here is pretty legit. I really love the creativity and different styles that was put into this place. \n\nI would definitely recommend checking this place out if you're visiting or are in the area! You can park a few blocks down and walk to this place. You'll pass by a lot of different shops and stores that I would recommend checking out as well.", "author": "Crystal Grace G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "What a cool alley! If you're in the area or have a thing for street art, I would suggest stopping by.\n \nAlley is kinda short, not much longer than just a block's width but so much depth to each mural.\nMurals are constantly changing to reflect current events. Some of the main issues highlighted include tech invasion and home evictions. \nTheir commentary on social and political issues can leave you pensive, definitely food for thought!", "author": "Sheila H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "This alley is smaller than I thought it was going to be, but it features some pretty amazing pieces. I love walking through and seeing all the colorful murals. It makes my heart smile. People come in this alley and linger for hours. So much to look at, definitely a must see for everyone who is in the area!", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "This is where you'll get instagram worthy backgrounds, I kid you not. I'm just strollin' through, photobombing all those basic girls trying to get a candid shoot....(not gonna happen, sorry not sorry). \n\nAnyhow, besides the people who annoyingly ask you to help them take photos, the murals here are beautiful! I'm not sure how often it changes, but I would be excited to come again next time to see if it did! \n\nCheck it out- its beautiful! You'll have to google map it. It's between Mission and Valencia St., and 17th and 18th St.", "author": "Hurjane V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "Street art at it's best. Murals with several different artistic styles that address cultural and political issues line either side of Clarion. If you're especially lucky, you might even visit when some of the artists are there and you can watch them in action or talk to them about their work. \n\nAs of May 2016, there are several murals that address the unfair evictions in San Francisco, and include information and resources through the Anti-Eviction Mapping Project. Stop here and see firsthand how it's affected SF residents rather than just reading about the stats online. If that's too heavy for you, just come for the great photography opportunity and/or some extra exercise.", "author": "Stefany V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Dope street art tucked away in a hidden street alley in the Mission. A friend and local, took me here after dinner to check out this colorful block full of intricate designs centered around community, social activism, and human rights. A truly moving experience. It's so easy to overlook (hence the small handful of reviews), but one quick turn and you will be surrounded by some really beautiful, moving artwork with some powerful messages. Word has it that if you come during the day, you can catch one of these artists live. Go!", "author": "Helina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Literally an alley way of random murals on the walls and  walkways by various artists . It's a pretty cool little alley way . Lots of vibrant colors and interesting designs . The art seems to change regularly, and most of the art seems to to have some sort of social- political undertone.  It's fun to walk through the alley way, if you're in the area , but I wouldn't make a destination out of it . Takes under 10-15 minutes to walk and admire the art and then get on with the rest of the day .", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-13", "description": "I give it two stars because some of it don't represent the mission and some advocate gay pride which don't represent the mission and weird drawings that move away sincere artist who understand the geneterfercation REALLY", "author": "Iz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "I love the murals painted in Clarion Alley. The art is very diverse and constantly changing. If you haven't been here before, this is a must see attraction for people of all ages during the day. I would not suggest driving down here as it is annoying for both the driver and pedestrians: how can you appreciate artwork from a car? Take some photos of this beautiful alley and see the city's liberal perspective of many current social issues.", "author": "Darrell T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Incredible murals up and down both sides of the alley. There is street art all over Mission District in SFO but it's concentrated here and another alleyway or two. \n\nEven on a rainy day the murals are worth making a trip to go see. Lots of political representation (obviously) but many expressions of love and acceptance, too. Very cool!", "author": "Jayci G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "One of my greatest perks as a travel buddy/visitor is I can be easily pleased. I like views, I like street art, & I love local things. \n\nClarion Alley was a great addition to my SF to-do list. The alley itself on a sunny day is brilliantly colorful & full of depth. There are tons of messages and stories screaming out of these walls ready to be told and listened to. \n\nThough it is street art in its literal sense, the moment you take one closer look at the details you realize there's so much more than that. It's a good place to impress some visitors but it's an even better place to just soak in and reflect on the murals presented to you. \n\nWorth a walk & a talk, yelpheads. Enjoy!", "author": "Julienne D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "Should be renamed Urine Soaked Way. Its a shame it used to be cleaner at least no pee smell. Cool art got a lot more words (text instead of focus on image) but that will probably change eventually.They need to clear drunk assholes who whip it out and pee in full view of everyone including children. Its popular enough that cops should stroll through every once in a while.I don't mean ruin it with constant presence but it doesn't feel safe like it used.to.", "author": "NoneyA B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "An alleyway filled with dope street art. Nope, not simply your typical can of spray paint graffiti...this is artwork in its rawest expression.\n\nDuring my visit to San Francisco, Clarion Alley was a must see. It it did not disappoint. I opted for an evening stroll in hopes of catching some work in progress.  There wasn't a session taking place but I was able to capture many amazingly vivid murals and messages.\n\nI have to say that Clarion Alley is definitely something to experience.\n\nBookmark it!\n\nThank me later.\n\n~Christy (from St. Louis)", "author": "Christy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Michael German gave me a excellent customer service. He help me figure out the best decision for my lease/purchase options. He is very friendly, and takes extra steps . Thank you Michael", "author": "Selma C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Most def one of the illest joints in San Francisco and must do for hip-hop heads.\n\nI visited for the first time in 2005, and I couldn't stop from gazing at every inch of that alley. Lots of the murals have social justice messages and critiques about San Francisco. And it's definitely super important in the increasingly denitrified Mission. \n\nThis alley isn't New York City's Five Pointz (NYC) or Los Angeles' Artists District, but it's still dope nonetheless.", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "It was alright. Great art work... And a bit of a smelly alley walk lolx.", "author": "Diann U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "This was a great find! There were many different political and social issues of great relevancy that were depicted. I highly recommend coming here and really analyzing the murals because they were all so interesting and individualistic.", "author": "L. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "I enjoyed my short visit here on a hot a** day in May.  The art is really awesome to look at and gives you an idea about San Francisco culture and values.    Great place to take pictures and overall a good stop to make as you explore the Mission District.  It does smell like pee pee in certain areas and when I went there were some people loitering, someone passed out in the shade, and an odd bird with a weed pipe in his hand.  Just normal San Francisco stuff but I know this is often enough to scare people away.  Just keep your wits about you and be chill and enjoy the art!  Then get tacos after.  Next time I go into the Mission I'll be sure to stop by the Balmy Street Murals, I think those are an even bigger attraction.", "author": "Bayilani V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Things that are free are awesome. Art is cool. I like character.\n\nClarion Alley has all of these things.\n\nCome to this historic alley to take in all of what is San Francisco. Dozens of pieces are projected onto the walls of this alleyway. Walk between Valencia and Mission to take in all of the sights. Bring your wide angle lens as well to get the full photo opportunity.", "author": "Rawlins R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "My daughter begged us to take her and her friends.  They got some great photos.  Didn't like looking down and seeing all the needle syringes everywhere.  That really freaked me out.  It would be so easy for someone wearing flip flops to bump into a needle.  Very scary.\n\nOf course the murals are beautifully done.  Just can't get past all those needles laying around though.", "author": "Jill S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "Idk if we came in a bad time..but the moment we step into the alley a strong smell of pee welcomed us", "author": "Krystel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "When you want to go adventure SF, but you're actually not that adventurous and actually pretty scared to do anything super crazy, this is a great place! It's beautiful and full of creativeness. From the walls to your sides to the floor under your feet, there is lots to look at. It is only slightly sketchy because of the homeless people that are planted there, but I mean, at the end of each side of the alley is a busy street, so worst case scenario just run fast if something happens! I'm totally kidding, there is usually other people there as well. You still should not go alone though. When I went, there was a group of people shooting a movie actually. Well, a music video..that involved roller skates...and lots of falling on the floor and falling in love. So anyway, yeah, this place is awesome!", "author": "Maleah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "Big fan of street art. The alley goes on for longer than I had expected. Great inspiration and talent to be found here, I have a few favorites. Very vibrant colors in most pieces, and some contain social messages.\n\nWorth stopping by for a peek. I would come here again, especially since new pieces get put up?", "author": "Pamela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "I've lived here all my life and I'm always discovering stuff one day I walked from the church it was a beautiful day.and I keep on seeing people posting pictures but didn't know where then all of a sudden BAM there it was right in front of me I'm like well let me check this out, so I posted my own photos went down halfway down the street I still need to go the rest of the way so maybe one day when I feel energetic and I could walk I'll go check out the rest of the street. but if you like street art come down and check it out specially on a beautiful day will see tons of people down there taking photos. :)", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "If you're looking for street art, Clarion Alley is perfect for some local flavor in Mission District. Git at it!", "author": "Olivia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "I absolutely loved Clarion Alley, so much so that I wish there was even more of this colorful and unusual street art to mesmerize me! The alley isn't that long but it is definitely worth going and checking out. If you love graffiti art then the prismatic and picturesque graphics should really capture your attention and imagination. There was even some 3D artwork to behold. Everything was just so big and vibrant! \n\nI really had never even known about Clarion Alley before Yelp, so thank goodness for Yelp because strolling down Clarion Alley really helped make my last San Fran trip that much more memorable! It's an unusual and stunning sight to see so I highly recommend checking this kaleidoscopic backstreet out.\n\nThe only downside to this was, well you know, it's San Fran so good luck finding parking but besides that it was awesome and I loved it! Also another great thing about Clarion Alley is that it is something different to do to create many more different and beautiful memories than just returning to the same tourist spots as usual.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "By far, it's the best alley to come to if you want to impress your friends or family that are not from the bay. They will fall in love with San Francisco even more. \n\nI've visited many murals in San Francisco. This alley is my favorite. So many different murals and they are really breathtaking and of course, Instagram worthy. I spent almost an hour here but I also took a lot of pictures and that's probably why too. It's near a lot of great coffee shops- go drink some after you check this alley out. \n\nDefinitely worth a visit, you won't regret it.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "After seeing Ann S.'s posting of the street art on Clarion Alley, I made an effort to check it out after dropping my car off for service in the area.  The alley is between 17th and 18th Streets and between Mission and Valencia streets.  \n\nWalking into the alley, I was amazed with all the street art lining the walls on both sides of the alley as well as certain parts of the ground as well.  I love street art and was in awe with all that was on display here.  \n\nIf you are in the area, visit Clarion Alley for some unique neighborhood art.", "author": "Al L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "I took a local's recommendation of coming here and am I glad I did. Here were my thoughts:\n\nPros:\n-Easy to find, it's an alley from an actual street [in between Valencia St, 17th St, Mission St, and Sycamore St]\n-LOTS of influential artwork that expresses a lot of society's social issues.\n-I stumbled upon 2 native artists: Meagan Wilson & Christopher Statton from the Clarion Alley Mural Project painting a new picture in this wall.\n-They educated me that San Francisco is going through gentrification, and that the way SF looks will change.\n\nCons:\n-It smells like pee throughout the alley.\n-Cars use this alley, and it is a tight space so you must go near the wall so that a car could pass through.\n\nConclusion:\n-If you appreciate good murals, and seeing influential messages through art then this is the place you should go to. This was my top 5 favorite places to visit in SF.\n-Do it NOW if you haven't because these murals may not be around anymore due to gentrification.", "author": "Howie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-11", "description": "Clarion alley isn't one of the super famous sites in san francisco, but it's definitely worth a visit if you happen to be wandering through the mission district.  Take bart to the 16th street/mission stop if you're using bart.  just walk down mission a bit and it's right there.  it's really interesting to see a bunch of local artists demonstrate their work.  it's ever changing and really neat.  if you want a really authentic and kind of a quintessential san francisco experience, clarion alley should probably on your itinerary for the day.  I usually like to bring friends here when they visit on our way to dolores park.  it's basically on the way there and it's a nice sight to see before the festivities of dolores transpire!", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "Alleyways usually get really weird. This is one of them, but for completely different reasons. \n\nClarion Alley was a cool spot to check out while walking around The Mission. Great street art which had some great messages.\n\nI loved the art and stood there looking at some pieces for awhile. \n\nAs mentioned, some did have a great message about several issues and they were subtle about it. They didn't actually have writing that said it. You had to interpret the art itself. \n\nThe pieces I didn't care for, were ones with messages actually written on the piece of art. On top of being blunt and losing its artistic appeal, they were quite whiny. Really dude? Complaining about gentrification. Get a life. Oh no! Places are safer, cleaner and more fun. Hating on Google? Dude, it's Google. The world is a better place with Google.\n\nWorth a visit for sure!", "author": "Mitch E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "This is such a lovely place if you wanted to have a little taste of SF. This is probably one of the coolest spots here in SF. I've been here several times and it's still really cool! It's an easy find and although the \"alley\" is only a street length, it does offer a lot of social issues that people are trying to portray using the murals. It's kind of like an eye-opener and its just great being able to enjoy the murals and to use your imagination to see what the artists were trying to say!\n\nOverall, this place really is a \"Local Flavor\" as categorized by Yelp. It really shows what the local SF people think about certain issues we're facing today. But it's really just a great and cool place to visit if you haven't already!", "author": "Wendy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Fellow art appreciators, visit this alley in Mission District, despite the smell of pee and amount of trash on the floor. Although the sound of an alley having art may sound small, the amount of art is EVERYWHERE! There are poles covered with stickers, graffiti on the ground, graffiti on the walls, graffiti on the poles. It's everywhere and it's great. \n\nThe art located in Clarion Alley for the most part consistently address social and political issues and are painted very well. For some pieces, the murals extends to the ground, giving you a feeling of stepping into the image. There were some notes on some art pieces being restored due to being ruined by people. \n\nI wouldn't recommend coming to this place at night though. Although I visited the alley during the wee hours of 7AM, I felt somewhat sketched due to the amount of trash and location. Just coming to this spot to look at the art and sharing a moment with an artist's work is a wonderful feeling on its own.", "author": "Trang L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Loved it! My sister and I were trying to find something completely different and stumbled upon this gem. It was really nice just to walk down the alley and see all these different artists creativity come together into one whole HUGE piece. \n\nThe only down side was parking of course being SF there's hardly any spots open but just parking a block or two only ended up being a 3 min walk. \n\nI would recommend coming during the weekday because it can get pretty crowded as per some of the residents have advised. \n\nPS: This is an alley beware of rats they are pretty big but mainly just scare the living shit out of you.", "author": "Heleina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Stumbled into this beautiful alley on a GORGEOUS Sunday afternoon.\nThey had people at the entrance of the alley painting which is was initially drew us in.\n\nThe paintings are so vibrant & beautiful.\nA lot have messages on them which made the meaning of the painting stand out even more.\n\nThe art isn't just on the walls, it's on the ground as well, so don't forget to look down :)\n\nIt's a great find while roaming the city! \nGreat photo-op place as well :) Just sayin'", "author": "Camille C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "We were staying in the Mission on our vacation so we spent a little time at this alley nearby to take a look at some street art. Some pieces were beautiful, others creepy, others downright weird, but all of them were full of heart and local flavor. Best of all, it's free, and sparks a lot of interesting conversations. I thought it was especially cool how some of the art was painted directly on people's front doors or garages. It really made the place feel like a living breathing museum. If you're in the Mission already (which, let's face it, is worth a stop alone for the amazing Mexican food), I'd definitely recommend this place!", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "I wasn't really sure what to expect when planned to see this street. But it's AMAZING! So much talented artwork frames the sides of buildings and the street! None of it is the same style, all so unique and different! This is a must see if you are anywhere near the area!!!! \nThere was a spot where you could buy the prints which was really cool!", "author": "Allison P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "For some reason, I've been living in the Bay Area my entire life but only just managed to explore the Mission District of San Francisco very recently. My friends and I decided to drop by Clarion Alley, and I was SO pleasantly surprised by all the beautiful artwork on the walls. \n\nClarion Alley is a wonderful choice if you're looking for something quick, fun, and free to do in the city. Depending on how quickly you walk through it, it should take anywhere from 1-10 minutes.  Everything was bright, colorful, unique, and thought-provoking. Truly a vibrant and universally awe-inspiring place to visit!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "This is another great place for art! I love that there are so many places in this city that care about art and its different portrayals. I love that it changes almost dailky and that it is a great place to see the artistic nature of the community. I love that the city allows things like this to show that the community cares about the community. \n\nI don't suggest coming after dark, but I do suggest visiting the area to see the beauty of it all.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Beautiful, Creative, Detailed and Unique Murals and Street Art in the Mission District!\n\nMy mother and I visited the Clarion Alley Murals during the afternoon of July 28th, our first day in San Francisco.\n\nClarion Alley is located between Valencia and Mission Streets on the east and the west and 17th and 18th Streets to the north and south.\n\nI was staying at an Airbnb in the Mission District, which was an easy walk to the murals. We strolled through the alleyway, stopping to admire the beautiful, creative, unique, and colourfully painted murals. The street art was interesting, diverse and incredibly detailed and intricate. The photo opportunities were fantastic! The building walls on both sides of the alley were completely covered in murals. Many of the murals displayed thought-provoking quotes, political messages/statements and support for certain causes, which beautifully highlighted our freedom of speech and expression.\n\nThere were a few homeless people in the alley, but their presence did not make me feel uncomfortable, and they were either sleeping underneath tarps and blankets or sitting up against the buildings. My mother and I started chatting with one very sweet-natured homeless woman who told us her life story. It was quite humbling and inspiring to hear about her positive outlook/perspective on life, despite her circumstances. After our conversation, we gave her some money so that she could buy herself an ice cream, which she mentioned was something that she was desiring to eat. I enjoyed being able to connect with this local woman and share a laugh and a conversation.\n\nThe alleyway was not super clean and there were broken and empty alcohol bottles laying on the ground as well as some garbage, but I enjoyed the grunginess of the alley and the stories and character that it portrayed/told. I felt safe and comfortable wandering the alley in the afternoon.\n\nOverall, I thoroughly enjoyed my experience visiting the beautiful murals in the Clarion Alley! This is definitely worth seeing.", "author": "Brittany T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "An alleyway full of beautiful and unique murals. :)\n\nThis is a fun & free stop if you are in the city visiting. Definitely go check it out if you are into grafitti/murals/artwork.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "An amazing street art alley between Valencia & Mission. Such an important part of the mission area, and is so emblematic of SF. Creative, unique, and also political. \n\nI wouldn't drive here specifically to see it, but if you're in the mission anyway or shopping on Valencia...stop by!", "author": "Quyen V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "I don't quite know how to rate this.Because it's not a food review. But I would have to say that it was pretty a gorgeous alley amongst all the alley ways I've probably been to!\n\nThere were alot of tourists, and just, people visiting here.\nI'm pretty sure the painting of Prince was a new addition, but it was wonderful as well.\n\nAlthough getting to the alleyway is a bit ghetto, if you come here on a bright sunny day, you better bring your cameras.\n\nSome skaters were a bit in our way when I visited, but it's definitely one of the \"Selfie\" locations, as I would call it!", "author": "Aya H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "As a lover of street art, I was very happy to stumble upon this truly beautiful gem of an alley.  My husband and I had a lot of fun perusing the artwork, that we made a mental note to bring visitors here to check it out.\n\nWhen my husband's parents were in town (visiting from small town MN) we decided to check it out while we were walking Mission Street/Valencia Street.  I wasn't exactly sure if they would enjoy it as much as we did, but they absolutely loved it.  I think of all things we did (touristy and non-touristy), this may have been one of their favorite things to do - I know they definitely took the most pictures here than anywhere else!  \n\nGreat place to visit - for both visitors or locals.  Also check out Balmy Street Murals (on 24th Street between Harrison & Treat).", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Walk into this alley and you will find an array of beautiful graffiti art on both sides from start to finish. It's a pretty cool place to take a photoshoot if you're looking for some neat backgrounds to shoot behind. Or, you can play \"museum tourist\" and enjoy looking through the different kinds of murals. There are some murals that radiate tons of colors, and others that are black and white. Regardless, it is a fun place to visit and snap some photos of if you're exploring the SF area.\n\nParking-wise, it's all street parking. Luckily, we found pretty close parking that was only a two-minute walk from Clarion Alley! It is definitely a stop worth going to.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "I never knew about this alley, but I was walking around SF looking for a coffee shop when I noticed that there was a crowd of people admiring the murals. If you are in the neighborhood, definitely recommend stopping by. It's a short stroll through the alley, it's free, and each mural is really different. I noticed that there are a lot of residential buildings in the area, so just be mindful of the people who live nearby.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "Intriguing place to take visitors for local flavor. Activist and liberal expressions. Color and art for days. Watch where you step because there may be poo there.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "When I allow myself to get to that place of self pity, may I remember the experience I had here. When I believe deep down that we live in a terribly insensitive world, may I remember what I saw here. This alley is a subtle reminder that free speech exists and it's on full display here.", "author": "Hector G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Your best friend and her Italian boyfriend come to visit for a day (yes, only ONE day in San Francisco). You ask him what he wants to see.  He says: \"Street art and the Cable Cars.\" I pick street art.  Done.\n\nA note, there are definitely homeless people that hand out here, so if that's not your thing, be warned.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "I feel kind of funny reviewing an alleyway but seriously, this is one of my favorite spots in SF.\n\nThere's always amazing murals and new art to check out. This place is in the mission and super easy to get to. Definitely worth checking out and stopping to take some photos and to enjoy the art.", "author": "Heather J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "It kinda became a tourist trap- but it's still awesome! Great murals, some are old from years ago (I have some photos with old ones from like 2007), some - new ones. I saw an artist working on recent one.\nMany tourists, but also many locals hanging out in the alley too - some of them are very unique mission characters. \nThere are other alleys in the Mission when you can see murals (Google has a map with them) but Clarion alley is definitely a first stop and must see.", "author": "Dimi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Wow, amazing street full of murals, art work, etc. I have been to San Francisco many times but never knew about this place. Great pictures, worth the time to stop by and check it out if you are in the area.", "author": "Keith A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Such a wonderful little spot in the mission. Unknowingly passed by it for over a year until I finally did the research and decided to take a leisurely walk with a friend. Surprised at how recent the works were, lots of artwork pertaining to recent social movements and dedicated to activism/activists. Excited to pass by again to spit new artwork.", "author": "Nadine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Must see. This place is worth the stop. It is ever changing so you and visit more than once a year. The artists works are photo worthy.", "author": "Jeanette A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-05", "description": "I'm going to have to reiterate my review of Balmy murals in that Clarion Alley has wonderful murals.  Except, I think the murals here look better than those on Balmy.  The two alleys are a bit far from each other (in terms of walking) but definitely a quick drive of each other.  Make sure to visit both.\n\nI've lived in SF almost my entire life and never new about these murals or that SF was covered in them! It took Yelp and my search for touristy things to do to uncover these treasures!\n\nThe colors and details are just outstanding! You have to come to see them in person. Pictures do not do it justice. Best of all they are free to view!", "author": "Janet E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "Home of the Mission Districts ever changing wall murals the entire alley is done up head to toe!  From political statements to silly cartoons it can all be seen here. We actually saw at least four murals being worked on while we were there which was uber cool in itself.", "author": "Douglas Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "First visit to this alley of awesome murals. I'd have to say really cool art. Checking out Chlarion Alley was one of my main reason to head out to San Francisco. The art definitely doesn't disappoint, however the alley does have a stench. Also, you may run across needles left behind by their users. Not the cleanest. But worth checking out! These murals really speak.\n\nThis will be a stop every time I visit San Francisco.", "author": "Kayla K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "One of the main places I wanted to visit when I went to San Francisco, the murals are so awesome! We had to park a few streets over.", "author": "Cheyenne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Very cool place to check out. i come back whenever i get a chance and i'm in SF, its given me a big collection of all the different street art murals.\n\nAll the stuff you see when you go won't be there forever, for one reason or another at some point someone replaces it with another great piece so just keep that in mind and always come back when you can!", "author": "Jaime D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-12", "description": "If you're a fan of murals and street art, Clarion Alley is a must see.\nThere are rotating works as well as some pieces that have been there for years.\nTake a picture because it may not be there the next time you return.  \n\nStroll down the alley on foot, but watch where you step.  It is an alley and some shady as well as gross activity occurs there.  You can also drive down the alley, so watch out for cars. If you are driving, I suggest driving really slow, putting your windows down (lock your doors) and playing some golden era hip hop.  Bring your camera, this is a great place for a selfie, band, fashion or engagement shoot.\nBring a friend (shady characters frequent alleys).  \n\nHave a drink at the Elbo room after your stroll so you can discuss \"Exit through the Gift Shop\", hipsters and gentrification.", "author": "Kristi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-03", "description": "The short: Kaleidoscope of awesome street art\n\nThis is a must visit spot! I heard about this place from one of my friends, and the street art in here is absolutely amazing! I was blown away by the dedication to street art murals. \n\nI've noticed more and more street art in SF. There's definitely a burgeoning art scene coming up if it hasn't already. \n\nThis place is not hard to find if you're looking for it. \n\nNote: I wouldn't take young kids here; there are some graphic scenes that their young eyes don't need to see... Yet, it's art and art deserves appreciation from the young too.", "author": "Catherine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "Oh the beauty of yelp!!! I was spending a day and a half in San Fran at a friend's place in the mission about 2 months ago. Had no idea what to do so I looked up local flavor nearby. Wah-la this places comes up. Walking distance and something free and cool to do on a nice sunny day! Thanks yelp community!!", "author": "Karen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "Yes yes yes one of my favorite places to show people when we go to the Mission. There's a ton of history background that would be great to know about that I don't know about so I can't write on it, but basically this place does a lot of great things and I think helps a lot of people in this area out. The murals are GORGEOUS. I feel like I hear a lot about random cities that have \"great\" graffiti and every time I see other city's graffiti/murals, it's just like no. Go to Clarion Alley. That's where the real beauty actually is. It's a small, short alleyway but just absolutely stunning. One of my favorite tourist attractions. It has great character and gives you a great taste of the Mission flavor.", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Normal tourist will spend hours at the piers looking at dead water. As much as I love the ocean, it can become jaded after awhile. Although there is nothing wrong with being in the mixed of people gawking over little boutiques and souvenirs. During my brief visit in SF, a friend of mine was guiding me around the area. She asked, \"What do you want to see?\" I respond, \"I want to see where the real locals are, none of this touristy site track.\"\n\nWe jumped on the BART and headed down to the Mission district. There we met up with a tour guide. This is where the real adventure begins, some may not agree, this district seemed like the soul of the city. And boy it was sure a beauty, murals galore displayed all over the neighborhood.\n\nOne alley that spoke the loudest among others was Clarion Alley. The art pieces were vivid and symbolic. The common theme was gentrification, these murals did not hold back and touch everyone differently. Even had the luck of being yelled at by a local and be accused for being part of gentrification. Don't worry, the guy was harmless, it does show you how sensitive topic it is.\n\nThere are a couple of other mural allies but out of all of them, this one has the strongest presence. Highly recommend visiting this side of town, truly the heart of the city lies hidden within this community. The art pieces may be provocative but it signifies the history of this great city. Though you may find yourself unease but that is what art is about, is making you feel and thinking differently.", "author": "Enrique G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "Awesome alley to see some beautiful, unique, and culturally relevant graffiti art in the Mission District! Some of the graffiti is older, whereas others are reflective of what recently happened in our society (Orlando shooting, Black Lives Matter movement, and Prince's passing). These pieces of artwork made me happy, sad, contemplative, etc. \n\nHighly recommend!!", "author": "Angel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Art\nPreaches\nAcross walls\nAnd time for those\nIn the choir or for Instagram posts.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "I love walking down Clarion Alley - I've done it alone, with friends and strangers, and with family - checking out the cool and creative murals, always artistic and often political, passing locals and tourists and workers and sometimes drunks and hidden houses with some open secrets.", "author": "Veg V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "Clarion alley was one of the places I really wanted to see when I visited San Francisco. It's a short alley (shorter than I expected) but the walls are bursting with colorful pieces of art, a lot of them having plenty to say. Just a piece of advice: don't go there alone looking so touristy. I'm glad I had someone with me, otherwise it would be pretty scary. Plenty of guys drinking, or more. There was this one dude who was high and just rambling. Anyway, if you want to see some cool street art it's definitely worth checking out with a friend.", "author": "Paulina E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Love this place, art changes continuously. The alley is clean and the art is really worth looking at. It gets pretty crowded during the weekend but its a quick walk so don't miss it out.", "author": "Suzy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "this place is pretty and you must come here. i repeat this place is so so pretty. so many murals and so many places to take photos!! \ndefinitely come here with friends and family!!!", "author": "Diana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-02", "description": "I love how people treat this place like a museum, sidestepping to the next piece of art, not speaking too loudly and gingerly tiptoeing around other visitors who stand contemplating one wall or another. \n\nI mean, it's an alley. The sounds of city traffic pollute the air and shards of glass litter the ground. \n\nClarion is just filled with so much amazing and diverse art. Even the tagging can be pretty neat -- there was stenciled graffiti on the ground shaped like squid and tall ships and Frida Kahlo. \n\nWith how often the walls get repainted with new murals added every few months, it's like going through a gallery with an ever-changing collection. It's all the more motivation to get over there to see a piece before it's gone.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "This is like a free outdoor museum of modern paintings, with frequent rotation of the works! It connects Valencia to Mission Street, and there's a stark contrast between the gentrified Valencia and run-down Mission. So definitely go during broad daylight and be warned of the stinky smell in certain spots.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "I LOVE this place!\n\nI was going Banksy hunting around the city and happened across this alley way. They have tons of different types of artwork. There were a couple small groups of people taking pictures but not too many. Overall, great place to go if you enjoy looking at graffiti art or enjoy discovering new areas of San Francisco!", "author": "Jessica Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Love this place! Huge fan of street art and this is a never ending alley of joy! Favorite part of my trip to San Francisco!", "author": "Karla .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "My friend and I came upon the Clarion Alley Mural Project on our unplanned retreat day.  \n\nNestled between 17th and 18th Streets, and Mission and Valencia, it was a welcome oasis to stroll along (during the day) with street art along the walls and pavement. A quiet contrast to the buzz along Mission, albeit an explosion of color visually. \n\nBring your Skittles and check it out *before nightfall.*", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "Ever since I was in middle school, I've always admired and loved the artists who create this type of art.  Now, as for those punks who needlessly and constantly feel that they have to go tagging the inside of the MUNI, why don't you learn a thing or two from these true artists instead of inevitably wasting everyone's money? \n\nClarion Alley is a great place to check out, especially if you are someone who can see the true art and beauty in what these artists design and paint on these walls.  Ruggy J. explained it perfectly - there is a clear difference between graffiti and tagging and what you get to experience here at Clarion Alley (for the most part - some of the pieces are vandalized over, unfortunately), is the former.  The colors and designs that the artists use here are just so beautiful.", "author": "Kahanalei M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "I'm so glad I happened upon this Alley while I was exploring/wandering around! I had actually read about Clarion Alley the night before and so finding it while I wasn't even looking for it, was a pleasant surprise :). \n\nI am always amazed by the talent that I constantly see in street art. The pieces in Clarion Alley are beautiful and very thought provoking. There needs to be more street art everywhere!", "author": "Polly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-16", "description": "Murals are cool.  FREE & in SF I love it.  I've been to Balmy Alley and now Clarion Alley - both are good, but different.\n\nClarion Alley is wild & everything goes.\n\nBalmy Alley more ethnic.\n\nGo check out both since they are in the Mission.\n\nClarion Alley is close to 16th St Bart.  Go to 17th St, then turn Left on Clarion Alley.  It's so colorful!\n\nGreat photo ops.  Just don't take pics of the people sitting there, smoking or drinking - too scared they might jump me.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-17", "description": "The Mission is a neighborhood that is distinctly San Francisco. Clarion Alley street murals has been one of my favorite discoveries.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-25", "description": "Great art. I'm sadden by the fact that people don't realize how much time and effort it takes for an artist to do what they do. Then there's people who tags over them. Such a waste of great art. Overall the art work was amazing to look at and admire. It's a shame that it was so short. I wished the alley was longer. \n\nParking is a huge PAIN! Finding this alley is also a huge PAIN! Its like neatly tucked away where youll have a pretty hard time locating the street sign. Luckily when my bf and I was driving around i decided to read reviews again cause we were about to give up. ****[its between 17th & 18th street & mission & Valencia]****. We finally just decided to find parking and search my foot.\n\nIm not giving this alley 5 stars because its pretty short. There wasn't totally a lot of art work to admire due to the tagging/graffiti . At most it'll take you a good ten minutes. It took us at least 30+mins to find parking and the alley itself. We saw a small group of people hanging out so it made it even more difficult to admire the artwork. Since they are blocking our views. \n\nFYI: There's actually people who live on this street and upstairs on the buildings/walls. Bring coins for the meters. The area is a little ghetto. It's located across from the police station. This review is only for clarion alley. I heard balmy is better.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "Love the art, When I went there was a bit of smell and a lot of people taking pics. But other than that it was splendid!", "author": "Jimmy U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "We accidentally stumbled across this alley. I wouldn't normally walk down a back alley in San Fran but the artwork looked so cool we took a chance! \n\nWe were blown away by the talent in some of this street art. Expect creativity, colour and activism which addresses some seriously important political issues (GMO food, racism etc). \n\nI am a massive fan of this contemporary and relatable art.", "author": "Stephanie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "I am a lousy photographer (have you seen the pics I post?! Blurry, bad angles, extreme close-up, etc.) \n\nWonder Twin wanted hella pics taken with Clarion Alley's artwork in the background. Everything was gravy until I spotted a crackhead walking towards us. I tell Wonder Twin, 'Let's go!' & take off running at full speed (I have a flair for the dramatic! I wasn't *really* that scared...I swear...)\n\nLater, Wonder Twin is looking at the pics I snapped & she's complaining, 'Sister, you didn't even get the murals I wanted in the picture!' Well excuse the hell outta me! I was too busy running from the crackhead. \n\nSidenote: I just realized--about 1/20 of my reviews mention crackheads...I don't know why. Drug addiction is no joke, but being a frisco kid, they just play a part in my everyday life, I guess...", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "Saturday Date Night: March 12, 2011 @ 5:30 PM\n\nMost of our Saturday date nights are unplanned. Anything goes unless there is a restaurant we really want to try or we are going on an overnight weekend getaway.\n\nThe spontaniety of the day brings us many unexpected little surprises right in our own backyard.\n\nClarion Alley is one of them.  \nhttp://www.yelp.com/biz_photos/IPO2wE0UeZKHPri_QPCEPQ?select=ULjG3sCDK1Wl3NTDSq85nQ\n\nWe were on our way to dinner on Valencia when we stumbled upon this alley with lifesize colorful murals.  We were drawn to  these fascinating urban street arts that we stopped, admired them and took some pictures.\n\nOther people were doing the the same thing.\n\nA picture paints a thousand words so here are the pictures of the murals: http://www.yelp.com/biz_photos/IPO2wE0UeZKHPri_QPCEPQ?select=rlQrFTRoRLgBUzSKVOiGqw http://www.yelp.com/biz_photos/IPO2wE0UeZKHPri_QPCEPQ?select=OI9PfzHRI5MQrp5tqo49TA http://www.yelp.com/biz_photos/IPO2wE0UeZKHPri_QPCEPQ?select=_Fz-ALIfmpqh7XvrnCppew http://www.yelp.com/biz_photos/IPO2wE0UeZKHPri_QPCEPQ?select=P2QuMyx7F8CS6YN8GZyhdw\n\nThe artists were very talented. I imagine them to be young and passionate or at least still young at heart and full of spirit.\n\nThese murals are urban art at its best.\n\nVery beautiful. Very Mission. For everyone and anyone who will respect it. \n\nAnd best of all, it's FREE. \n\n(I read that the murals change often.)\n\n A MUST VISIT WHEN IN THE MISSION. \n\nWithin walking distance from the 16th Street BART.", "author": "Leah E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Cute place! Wish it was bigger, but it was really cute! If you need a new Instagram pic... Def the place to go lol", "author": "Ariza G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "I was walking around in the Misson with my fiance and we found this \"Awesome! Awesome! Awesome murals Alley!\" Very Unique! I could spend for a good 45 mins at this alley just looking at the details. I wish Berkeley have this kind of Alley. \n\nThis little Alley located in the Mission (between Mission and Valencia Streets). It is really easy to miss if you are driving. So I recommenced to walk around in the mission and stop by at this Alley. I think Mission is awesome place to explore.", "author": "Fenny G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "A Mission favorite. The art's decent but significantly pales against Berlin's.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-08", "description": "Uppers\n\n-A full block of street art\n-Located in a neighborhood worth checking out anyway\n\nDowners\n\n-Not the cleanest area in the world\n\nThe Scoop\n\nI loved passing by Clarion when I lived in SF last summer.  It seems like every few months one of the large mural spaces is recanvased by another artist.  It certainly boasts some of the most impressive street art I have ever seen.  Many of the pieces are politically driven and often very colorful.  One small side note is that a good number of the homeless community live in the area and often walk through Clarion.  If you ever find yourself in an uncomfortable situation, there is no need to worry.  A police station is located just across the street from the east opening.", "author": "Nate W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Super dope place to explore some great street art, have a conversation and take some cool pics. The area has a bunch of great small restaurants and shops too. This is a MUST SEE in SF.", "author": "Stephie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "This is not a review as much as a rant. I hate yelp, I barely go on here, but i am on here to defend a very good friend of mine who is an artist in the alley.\nThe stars are for the artists, and all the bullshit they endure every day keeping the alley going. None of them get paid, and to all you asshole tourists, if wouldn't fucking kill  you to ASK before you take a picture of someone painting. Or to donate because no one makes money painting in the alley, it is all volunteer run. My good friend got attacked the other day while painting. It is really hurtful and sad, and the person who attacked him had put up wheat pastes without asking anyone. If anyone ever attacks him again, i will curbstomp your ass to the moon. So to any of you who go to the alley, PLEASE be respectful, not only to the artists, but to the city you've come to gentrify.", "author": "jennifer a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Love this alley....nothing stays the same and forever changing. I hope the Mission District does not change due to the push to kick the natives out, to make way for the \"hipsters\". That alley holds a lot of history and love for the city.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-08", "description": "Three words: Urban art gallery. \n\nI won't even lie: I'd rather walk down alleys all day long than step inside the DeYoung, MOMA or Legion of honor. \n\nI can appreciate museums, but I love grassroots art.\n\nThese are my pictures from the alley: \n\nhttp://flickr.com/photos/calmenda/sets/72157603672744211/\n\nI had been to a couple of other alleys (Balmy) but this is by far my favorite. \n\nI wouldn't necessarily recommend going out there alone with expensive Dslr gear as there are tons of drug deals and transient people on the Mission side of the alley. You're safe on the Valencia side since the Mission police station is there. \n\nAnyone interested in urban art owes it to themselves to check out Clarion alley.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "Such a rad experience to go here. I enjoyed the cultural aspects of Clarion Alley and hope to revisit soon.", "author": "Farrah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-07", "description": "Wicked cool.  A great space with interesting, soulful and competently executed art and an appealing rebel spirit.  (Especially welcome when you're flown a thousand miles for a memorial meeting for one of the greatest radicals of our time, and then gotten into a pissing contest with an old friend whose politics have drifted bemusedly over to the right of Genghis Khan.)  I was there at dusk but could still see pretty well.  A noirish-looking collection of youths on bicycles silhouetted a ways down the alley turned out on closer inspection to be a small tour group that let me hang out on its fringes on foot learning stuff. I'm very glad I stopped in to the Za Gourmet pizza joint in Russian Hill where the guy told me I had to see this, and very glad I ambled over there from the Lower Haight.", "author": "Suzanne E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-19", "description": "Great local spot to check out! The art is great, and I love that it changes every so often.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "COOL PLACE!!! Constantly changes and I like how different each piece is. Very easy to fine if you are just walking through the mission. \n\nI have lived here for almost 5 years and I finally went here about a week ago. Definatly glad I experienced this work of art.", "author": "Lizzie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-04", "description": "Yelp I love you however I came across this alley via Nextstop.com then I cross checked it and found more reviews about this little alley located in the Mission. It's near a thrift shop off Valencia. Aside of the human poop we saw this alley is by far not intimidating. The murals are awesome and if you look you will find the Jeremy Fish bunnies on a building. It's a dope spot to check out if you are into lowbrow art or graffiti. It's a public art installation. There is no tagging like \"Little Sleepy Sur13\". I took so many pics.. This place is must see when in the area! \n\nMy fav was the dissembled bike hanging on the telephone pole with a broken license plate hanging next to it with a piece of torn clothing!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-06", "description": "Awesome murals! So much personality! Great place along with balmy street murals", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "it's definitely a cool narrow alley designated for graffiti/murals, but . . . I personally feel as if I have seen better work in other parts of the mission district", "author": "Brooke W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "I really dug this alley when I first came over three years ago. However, when I went this past weekend, it was mostly full of \"regular\" graffiti over the prettier, more intricate designs. I guess, in a way, it has been \"reclaimed,\" but I was pretty disappointed when I remembered what the murals used to look like. Nonetheless, it is a unique alley and worth checking out.", "author": "Jess L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "According to Urban Dictionary:\n\nGRAFFITI: An element of the Hip Hop culture misinterpreted and misrepresented by the mainstream media, and most especially hated by affluent (usually white) businessmen who don't understand the roots or meaning of the writing on the walls.\n\nTAGGING: Unlike graffiti, tagging usually takes less time and skill as it is done in one color with a single can of spray paint or thick marker.\n\nTagging is nothing more than an aesthetic shit stain on public and private property... whereas graffiti brings to life a surface that would otherwise be dying a slow and miserable death (beat up train, abandoned building, dilapidated commuter tunnel, etc...). There's a huge difference, and I'm a huge geek for artists that make the world their canvas.\n\nClarion Alley is filled with cool looking bombs from artists all around San Francisco. It's a shame that some folks feel the need to vandalize some of the better looking pieces with their names written in Sharpie marker... but I suppose it's unavoidable. \n\nTake your visiting friends here for photo ops galore.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "great street art! it keeps changing every now and then. makes you look forward to something new", "author": "Rembrandt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Why is there always people taking photos in this alley?  for years I've wondered and finally today I walked into the alley.  No, the alley sucks me in and I was totally awe strucked by the beautiful art works on the wall which takes you somewhere I've never been before.  The museum quality work is free, gritty and surprisingly fun.  A totally secret gem of the city we love.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Free amazing art. I stumbled across this alley just walking in the mission and it says a lot. Take a stroll down this alley on a Sunday afternoon and take in some local art and murals!", "author": "Dylan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-24", "description": "We live right by this alley and every October the Clarion Alley \nfestival is held. Loud garage bands, lots of hipsters, crust punks, \nand b-boys. If you don't like it, just plan not to be home.\nLet the people have this one day, once a year.\n\nOne year we invited over a few folks and bbq'd and watched \nthe madness from our deck, fun times.\nI love the fact that small celebrations like this exist even though \nmost of the Mission has been gentrified and has no soul. . . .", "author": "Kia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-09", "description": "Worth a looksy if you are in The Mission.  Lots of interesting different art, as well as different perspectives on things.  Bring a camera if you breeze through....you'll be disappointed if you don't.  The only sad thing is that some of the art had loser ass tagging over it in different spots from gang bangers.  How disrespectful!  Still...check it out.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "Beautiful designs on the walls, a very nice atmosphere during the day with people observing the murals, and also an interesting place to visit at night. Just walking around and feeling the place can be really enjoyable, and it is also fun to stop in front of a mural and think about it for a while.\n\nIf you want to show a newcomer how different and beautiful San Francisco is, this is definitely one of the best places to do it.", "author": "Abel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "It felt like Easter when I first found this alleyway. I had the same amount of excitement as I did back when I was 7 and found the hidden Easter egg  containing $20, but I digress. Clarion Alley is definitely a gem with all the diverse and colorful murals. Each mural tells a story and it's nice to see so many people take the time to appreciate the hard work put into them despite the smell of piss lingering around.", "author": "May D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-28", "description": "It's a cute, small, hidden street with creative murals. It's a nice stroll and though short the murals are impacting. I would defiantly visit again to see new pieces with a coffee in hand.", "author": "Fairlight S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-04", "description": "Artistic alley.\n\nClarion Alley is a Mission side street full of amazing murals. Passion and dedication fill each one along with some of the most imaginative designs and vibrant colors you'll ever see.\n\nTaggers often disrespect the artists. Stop it. Find your own alley. Leave this one for some of the Mission's most talented residents.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-02", "description": "This is Real.  \n\nThis is The City encapsulated.  Your eyes roll across images of hope, protest, mirth and wit while your feet flirt with extreme filth and urban squalor.  This is a space where artists come to realize visions and junkies step into for a quick fix or to take a dump.  \n\nI've been coming here to photodocument for about 4 years and no matter what there is always something new, something in process and something I recognize from before.  It is exciting.\n\nFor instance.  I went there today for the first time in about 6 months and the first thing I saw was a pig's head in a bag on the curb.  Was it random or artistically placed?  I don't know but the word \"head\" was in a mural right next to it and another mural had a skull gazing down upon it.  Down the way there was an artist putting up a new piece, his friends stopping by to see how it was going and the occasional photographer moving through.  At the end of the alley, ominous, is Mission Street, up to no good.  \n\nSan Francisco is a schizophrenic town, repulsive and frighteningly disfunctional and if you keep your eyes open you'll see an inspiring, ongoing rebellion against fear, despair and powerlessness.  There is no place easier to see it than Clarion.", "author": "Sweet T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "Clarion alley is really tucked away in a very sketchy neighborhood. It's convenient to get there via train and a 5-10 minute walk, but it smells a little funky and the area is definitely not a touristy area. The graffiti art, however, is astonishing. Beautiful, progressive, and inspiring.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "Clarion Alley is a great area to observe the beauty of unregulated art pieced for the masses (void of the urine smell, of course).  Now.. if only all art had the same integrity.\n\nFree. Open to the Public.", "author": "Diane N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-10", "description": "Alley ruled by maniacs!  Some of these artists need to be locked up, seriously.\n\nThought I'd take a stroll and check out the artwork.  Saw a pair of guys touching up a mural.   Began talking with one of them and kindly asked if he could take my pic next to a drawing.  He did and I thanked him.   But then he immediately began to demand money from me.  I told him I was sorry, but didn't have any money nor did I know it cost money to take a picture.  (SINCE WHEN IS THAT A RULE???)  \n\nThe guy would not let up.  He went bat-sh*t crazy.  He started yelling and screaming, \"F*CK YOU!  F*CK OFF!\"  And a bunch of other craziness I couldn't even keep track of.\n\nI was totally thrown.  I didn't know what to do.  Tried to reason with the guy, did no good.  Decided to leave it alone and walk away.  The whole time he kept SCREAMING profanities.  \n\nI'm as poor (if not poorer!) as the next starving artist.  I just thought I'd show my support by viewing and appreciating the murals.  \n\nWell, those f*ckers have lost all my sympathy.  They act like total a**holes and expect free handouts and then go crazy when you don't throw money at them.\n\nKiss my you-know-what.\n\nPS -- You guys just lost a fan big time.  Thanks for spreading so much negative energy.  A**wipes.", "author": "J J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "Whether you want to take in some dope murals or you're just looking for a place to hit the pipe after scoring on Mission - Clarion Alley is the spot. Hell, why settle for one when you can do both?!?\n\nMinus one star for the constant and overwhelming smell of piss.", "author": "Dirty D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "I come from the land of city murals - Philadelphia, PA.  But they tend to be pretty safe and not terribly deep.  Clarion Alley is a concentration of thought-provoking art, and far more lierally fragrant than any gallery.  And it all intrigued the kids on different levels.  Small Dragon enjoyed how the art enhanced the messages, and Allergy Boy liked the dinosaurs.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "This alley is full of life and street art! Both sides covered in paintings wall to wall. It's an awesome little alley to pass by before or after eating in the mission...I usually pass by after hopping of the 16th street BART station.\n\nMy favorite piece is the dinosaur being surrounded by the cop cars and policemen! Make sure you have a camera and your cell phone prepared because you'll definitely want to take pics of this alley.", "author": "Arnold N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-23", "description": "One of my favorite sites we saw in San Fran!  It is really powerful, moving, beautiful, fun and awe inspiring.  So many colors, stories and messages.\n\nIt is within walking distance of Ritual Cafe so stop by for a great cup of coffee also.", "author": "Kara R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-10", "description": "Places like this is what makes San Francisco so cool. There is some really gorgeous artwork here and it's all free for you to enjoy.\n\nGreat stop for visitors. But don't go at night - the area gets a bit shady after dusk.", "author": "Kori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "Some of the best local mural art and graffiti art. One of my favorite spots to hit up with my friends as we are walking to and fro. :)", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "Best little alleyway of Mission Murals. In the midst of Mission so there's plenty to walk to do around there. This is a spot I would bring ppl on my mini tour if they're from out of town.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-24", "description": "I accidentally found Clarion Alley one day while biking around the Mission District in SF. I felt like I stumbled into the best alley in all of San Francisco. And most people I tell have never heard of this place.\n\nIt's a small alley that connects Mission and Valencia, between 17th and 18th. Unlike most alleys in SF, however, it does not smell like urine. Oh and it has some of the most colorful and beautiful modern graffiti/murals in the city.\n\nApparently the city commissioned local street artists to take wall plots and turn then into something wonderful. The best part is that most of them are pristine (i.e. no defacing).\n\nCheck it out. It's better than an art gallery.", "author": "Trey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Very cool alley smack on the middle of Mission. Lots of great art that constantly get updated - easy to come across an artist painting a new mural.", "author": "Deanna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-30", "description": "I stopped by the Clarion Alley block party last weekend and felt like the lamest, most unhip person in the world.  3 stars.\n\nBut the murals are totally badass.  5 stars.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-22", "description": "I am a local photographer and this is a great spot to take portraits. It's about a block long and full of fantastic murals on both sides... \n\nStreet art in the mission is pretty fantastic and this just happens to be a super awesomely condensed area of it.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-25", "description": "My friends live on this alley so I've been exposed to the good and the bad that it has to offer. \n\nGood: Once or twice a year they have festivals that bring out a ton of people and flood the place with music. The murals are excellent and really spruce up the whole vibe of the area. \n\nBad: On most nights there are random people that flood the place with good cheer and by good cheer I mean drugs, sex, drinking and urination. Fist fights and people rummaging through the recycle bins at 4 AM. will put damper on your sleep, but you get used to it. It kinda becomes like one of those wave radios that lulls you to sleep with the sounds of the ocean. With this sound track instead of occasionally hearing a wave crash you hear, \"DO YOU WANT TO GO TO JAIL OR DO YOU WANT TO GO HOME?\"", "author": "Corey V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-05", "description": "Pretty cool way to kill some time and especially if you're into graffiti art. There's also another alley called Lilac Alley in between 24 and 25th st that also has a lot of graffiti art. The Mission District where these alleys are located is a pretty cool place to check out in general. A lot of good bars and cool shops.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "If you enjoy looking at cool graffiti, this is the place to go. There are a bunch of cool murals in an interesting neighborhood. The Mission area reminds me of Los Angeles since it's a bit more urban, diverse and ghetto. Some of the murals have been graffitied on (ironic), which is sad. I would think that there would be an unspoken rule not to ruin other people's graffiti.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-28", "description": "Mission District - Mural Stop #5\n\nThe last stop on my Mission District exploration date with my boyfriend - Clarion Alley.  Walking through was like a free photo op in the Mission District!  Every angle you snap is amazing and full of color (and if you don't have a DSLR, this alley will make you want one REAAALLL bad.)\n\nNow, some of the artwork isn't the best, but some art is full of detail, to the point where your face is soooo close to the wall, and you forget that it's a very very VERY dirty surface.  Womp.\n\nIn any case, many murals have a comical 'twist' and most will definitely make you smile.  There are so many talented artists in the area, and I'm just glad that they are able to show the public their work.  Easy access from public transportation (16th St. BART).  A hidden gem in SF, for sure.\n\nAnd for free?  Yes, please.\n\nPhotographers that want to bust out their cameras for a good time?  Hit up Clarion Alley.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "I used to live around the corner from this spot. It's true, the artwork is lovely. It's a great place to bring an out-of-town visitor to display how serious San Francisco is about its murals.\n\nJust don't be caught here after dark. Seriously. I know it's a great short cut, but you might run into folks doing things you'd rather not see them doing in the middle of the street.", "author": "Beth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-01", "description": "I'd totally forgotten about this area. Back in the day when I used to teach photography, film and video we took some of my students here to see what an artist in residence project/commune looked like. It seems like most people only see the murals and what not and dont realize what goes on behind the scenes. Definitely good for seeing the local art flavor of SF but if you want an in depth perspective, speak to some of the artists that live there!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-12", "description": "Great murals right off of Mission Street... \n\nThe Clarion murals are in a short alley- marked by road sign on Mission- full of art. The murals in the Alley are probably the edgiest of all those I viewed in The Mission- very eye catching and imaginative. If you are visiting The Mission I would recommend them. \n\nFYI's~\n* Only takes a few minutes to check out\n* Larger pictures and objects then a lot of the other murals\n* VERY close to 16th Street BART station", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-17", "description": "A great display of art in the already very mural-filled Mission District.  This alley has some of the best.  Most does have a political point, be it local or national.  It is a great expression of the viewpoints of many San Franciscans, whether or not you agree with them.  Definitely worth the visit if you're in the City.", "author": "Raman S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-20", "description": "I'd have to say really cool art. My wife and I both went there just looking to explore different things in Frisco. Took some really cool pics, if your phone has a panoramic feature on it I would suggest using it when taking some pics looks really cool after you develop them. I would suggest anyone to go check this alley out can't wait to check out some more alleys in Frisco.", "author": "Da Bears S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-14", "description": "Walk, it's good for your health. Enjoy this beautiful city (Clarion Alley)  for it's unique culture, its respect for art, and love that is expressed via spray can..look straight ahead in awe!", "author": "sonia m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "It stinks of piss and it's got great art. \n\nIf you want a sterile environment void of anima and ammonia, go to MOMA.", "author": "Mr and Mrs G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-06", "description": "Clarion Alley breathes murals and tags evolving over time. \n\nThe simple Alleyway is transformed into telling stories. The political message some mural carries a distinctive SF flavor.", "author": "Jack C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-01", "description": "It's an alley. The walls are covered with urban art. That's about it.\n\nBut anything that makes me think, anything that makes me look in wonder, anything that makes me curious about its undoubtedly colorful history, deserves 5 stars from me.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "Clarion Alley has always been my go-to touch down when showing off my city to friends. This techicolor graffiti'd alley way is free, it's fresh... what more can you ask for? The dopeness.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "Im from LA and glad I came here. LA has street art but not like this.", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-13", "description": "So glad I took my friends here.\n\nA little startling when I knelt down to snap a shot, but paused due to the smell of urine that drew my attention to a used tampon... so certainly not for everybody, but man, the art was great, and from the look of things it's constantly changing!", "author": "James Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "I live behind this alley (my deck borders it).  \n\nClarion Alley is another one of SF's hidden gems.  It is covered in public art by local artists.  Murals cover every subject imaginable but have a dominant theme of social justice.  Just type in \"Clarion Alley\" on Flickr for a sample of some of the badass murals covering this street.\n\nPrecita Eyes (www.precitaeyes.org) also does mural tours.\n\n[Minus one star only because the alley gets occasionally overrun by crack addicts who use it for a bathroom!]", "author": "Sid D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-12", "description": "My best buddy from college was in town. \n\nHe's a stay-at-home dad with two kids, lives in the suburbs of Seattle. Doesn't get out much, so I set up some regression therapy comprising drinking, playing Xbox 360, eating, and more drinking. On the fringes of this brutal regimen, I tried to ensure that he got some culture.\n\nClarion Alley was the last stop on an afternoon walk we'd taken from my apartment in Twin Peaks which included Dolores Park, lunch at Tartine, X21, Borderlands Bookstore ( sigh - no Ripley), and the Pirate Store. It was a beautiful day, and the alleyway was crowded with people checking out some new work on the walls. As we sauntered East toward Mission, I noticed some furtive movement on the right side of the alley about 25 yards in front of us. There was a guy pressed up against the fence, slightly stooped, looking for all the world like he was either stuck to, or merging with, the boards.\n\nTurns out both were true. There was a little hole in the fence that he was trying to cram 'himself' into.\n\nNow I have seen a lot of things in my 43 years on this planet. But I have never seen anyone work so desparately to achieve carnal bliss with a FENCE in broad daylight, and with an audience. \n\nI mean -- there is just no protocol that I know of that provides any helpful guidance on dealing with a situation like this. It's a bit of a conversation killer.\n\nSo we walked along in silence, both appalled and maybe a little amused, and tried to give this guy his privacy. However our friend -- let's just call him Woody Woodpecker -- wasn't having ANY of that . I guess he hadn't quite worked that knot out of the wood (if you know what I'm saying), because he stopped in mid-saw and began to berate us for, all jokes aside, \"interrupting my nut\". He yanked his pants up and strode purposefully up Balmy Street in the direction of the Mission police station.\n\nAh, San Francisco, city of art and culture. And carpentry!\n\nWe were glad to get back to the relative calm and sanity of the Castro.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "How many times do I walk down Mission/Valencia past Clarion Alley and not explore the amazing murals that have graced th walls and houses since 1992? Too many. CAMP (Clarion Alley Art Project) had a brilliant idea when they began this project. The list of artists who have participated would read like a memorial, there are so many. Rigo92, Sebastiana Pastor, Aracely Soriano, Jessica Miller..the list goes on. There's always at least two photographers in the alley taking photos of the work. People come from all around the world to see them but you have to be on foot. No S.F. tour bus is going to drive down Clarion Alley! Just another hidden gem of this city!", "author": "michael s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-30", "description": "Oooh Clarion Alley, you always shock me with unexpected color as I wonder down a dark, gray Valencia Street. I remember enjoying a stroll by your spot after leaving Amnesia. I decided to push the cute guy accompanying me onto your street, the perfect location for a kiss! But not for too long as it's probably not the safest place after hours.", "author": "Cyndie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "STINKY, but worth the occasional dry heave. \n\nBeautiful colours and punchy.\n\nEven the tourists flock here!", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-16", "description": "Super awesome.  Minus 1 star for the urine stink.  \n\nAll the stars go towards the art and my friend Lauren's photography project in this alley!", "author": "Annster L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "Wow, this a great collection of urban art!  \n\nhere are my pics:\nhttp://www.flickr.com/photos/7342784@N04/sets/72157604420728361/detail/", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "If you like street art and graffiti, bring your camera and plenty of memory card space. Watch your step. Deal with the odor. Leave happy with 30-50 photos of great pieces. Upload the good pics for others to enjoy.", "author": "Hunter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "Yes, it smells like pee but it's worth it! \n\nEvery one who walks through this alley stops in their tracks to admire the art. It's sooo kool!! Best alley I've seen in SF! It's not even scary walking through it if you do it in the daytime. :) \n\nAlso, I wish some people would stop doing graffiti tags over the beautiful artwork already on the walls! It's beginning to ruin them!", "author": "Bets Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-10", "description": "How could you NOT rate this five stars?\n\nI mean, yeah....it starts to smell like piss once you get closer to Mission Street...but, dude....even my MOM from MISSOURI liked it!\n\nPolitically-charged, completely talented, absolutely unique, must-see-it-here-to-see-it-at-all.\n\nAnd they throw one HELL of a block party.", "author": "Danyell K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-18", "description": "I read about this in a local's guide and had to check it out. I haven't seen anything like this in any other city. \nA lot of times you can watch the artists work.\nOccasionally there will be music show along the backgroup of the art, which is cool.\n\nNeat spot worth checking out if you are in the neighborhood.\nBut I agree- places like this is what makes San Francisco such a cool city to live in.", "author": "Holly O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-16", "description": "Mission mural spot that makes for an interesting 10 min walk. I didn't find it as amazing as others but it is a nice diversion from shopping and eating", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-28", "description": "Five friggin' stars!\nClarion Alley is the best public bathroom in the Mission!", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "50 or so vibrant graffiti murals line both sides of this alley in the Mission. This off the beaten path art project is great for cheap locals, urban photographers, and seasoned tourists. Some murals are artistic and beautiful, some have political messages, and others are wangster crap. I saw one that was dark, demonic, and nightmare inducing. I make sure to bring out of towners by here when we're killing time in the Mission.", "author": "R J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-10", "description": "I love walking down this alley after a few hours of thrifting in Mission. It's perfect! However, I wish someone would clean up the Mission St end, it's so yucky. I always hold my breath and walk super fast when I get to the end.\n\nOne of these days I dream to venture down the alley with my BFF from LBC stoned and chill and see how much more cooler this place actually is. *Chham get your ass up here*\n\nAnyways, it's a definite must see for tourist and perfect place to reconnectand appreciate SF.", "author": "Eclectic C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "I love street art, so I love this place. Totally worth stopping by to check out.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-15", "description": "Posted up on a palm tree. Smoking a cigarette. Hop on my cruiser and start rolling from 17th St. down Mission, southwise.\n\nTake a right at Clarion Alley. Enjoy the treat that hits your eyes. It is the representation of Mission in Graffiti form. Trust me, once you come here, you want to LIVE in the Mission. It worked for me. I live across the street now.", "author": "Haz O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-21", "description": "This is my favorite alley. The artwork is as diverse as it is incredible. If you're spending the day in the Mission, it is well worth checking out.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "If you ever venture into the Mission district... I am telling you, you gotta check out the murals in clarion Valley.  My favorite mural would have to be the hearts of gold mural.  Definitely reminded me of what kind of woman I want to become.  Strength from a vulnerable perspective.  Also, these murals speak of the community in the mission district.  THEY really SPEAK.  and taking a stand towards social injustice through these beautiful murals, from the oppression of women to the oppression of cultures/ethnicities, is truly inspiring.  You gotta see... sit... and ponder.", "author": "Rainbow B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-19", "description": "True its stinky, but its well worth the smell! Great place to take friends from out of town for some great photos. Day time is the best time to go, and the best part is that its free! Don't miss this SF gem!", "author": "Gordon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "This is one of my favorite mural alleyways in the mission. One of my dear friends did a mural in this alley and I even shot his brother's CD cover in front of the mural. I use it alot as an interesting backdrop for portraits. The only thing is that I would not wear open toe shoes and don't be surprised if you see some shady activity here.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-06", "description": "We live above this alley and it's horrible, especially at night when the bars close and every one decides to pee there or hang out there and loudly discuss their nights conquest, one day when you are older and more mature and have respect for other human beings you will understand how annoying this is! The murrals that we have to look out our kitchen window at are terrible! I would love to see the city find another venue for this and close the alley at night so we can all sleep!", "author": "taylor l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "I love clarion alley.  I can't really say anything that hasn't been said in other reviews, so fuck it.  That's all you get.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-26", "description": "Balmy street and Clarion alley are by far the best place for street art in San Francisco and maybe even US. Balmy st is the older site and you can find guided tours from Precita Eyes.\n\nClarion is newer and the art has more anger in it. Don't be put off by the stink. And don't be scared. It is safe - at the end of the road is the local police station.\n\nFor a link to some high quality photos of the murals and more local flavor of these two streets: \n\nhttp://locomotoring.net/2008/07/24/mural-hunting-in-mission-district/\n\n\nYou will be happy to note that SFO is one of the best cities for mural art. Even Diego Rivera (http://diegorivera.com/index.php) painted murals here. \n\nSometimes my out of town guests do get put off by the down to earth Mission district but for locals this is the place to go. So if you are an adventurous visitor, want to do what the local do, please visit Mission after the more obvious piers, north beach, china town and the union square. And if you are at Mission, you can't but not see the murals.\n\nFor a more complete trip of the Mission area, read on :\n\nhttp://locomotoring.net/2008/12/29/three-hours-at-mission-district-of-san-francisco/", "author": "Mishti D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "cool local art, all different styles, always changing, and totally free!\ngood for a taste of real SF culture, and a smell of real human urine. \ndefinitely only go during the day and enter from the valencia street end. turn around and walk back when the smell of piss gets too thick for normal breathing... and viola!", "author": "zachary p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-25", "description": "a truly san franciscan gem.  an alley full of interesting huge murals, covering walls, houses, fences.  stopped by the block party last night for some live music and crowds.  would like to learn more about the history here...if in sf, definitely stop by.", "author": "micaela r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "Who can justify paying $12 for a museum entrance fee when you can see the best art in SF for freezy?! I recently inherited the bfs castaway DSLR when he upgraded so I needed a quick lesson and some tips. What a great place for a self-guided photography walking tour! And yes it is worth it to hold your breath for a couple seconds when you crouch down right next to the dooodoo to capture the perfect shot. Granted Balmy Alley is less smelly....but Clarion is 2 blocks from Birite Creamery....the best way to purge your nose from all offending odors.", "author": "Emily W."}
