{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Let's start by saying this is the only  Vietnamese spot that serves Thai Chili Peppers with the Pho and it's a game changer.\nI created my own bowl with the roast pork, this dish was served with salad, been sprouts, noodles, mushrooms and a hand full of veggies.\nThe service was great and this place is really clean. \nI'd definitely go back to this spot.", "author": "Enrique O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-19", "description": "Solidly average dining experience. TLDR; good atmosphere, food was ok \n\nIn terms of apps, the roti was good though the garlic sauce was quite strong (careful not to scoop too much as I generally do with dipping sauces), the chicken skewer was actually very good, but the buns were disappointing. Papaya salad was not what I expected... was very dry and lacked much flavor. \n\nAs for entrees, well the pho was... pho. Can't say it had much going for it, but it was inoffensive. The combination stir fry was about as good as a regular Chinese takeout, which certainly isn't bad but probably not worth the price tag here.\n\nThe atmosphere and decor is quite nice, and probably the best part of the restaurant. Likely won't be coming back for the food though.", "author": "Allison X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-27", "description": "This is decent Vietnamese food and certainly a cute spot with respect to size / decor, but I would definitely treat this as a \"neighborhood spot\" - come here if you live around here, but don't travel out of your way for it.\n\nLast night, two of us split the roti with curry sauce, wicked buns, garlic herb noodles, a special sausage appetizer (not on the online menu), and the basa fish claypot.  There was an attempt to also have the crispy rolls, but the waiter sort of messed that up, per the below...  All of the food was fine to good.  The roti was really tasty, though the curry sauce was sort of too sweet and grainy (not sure why re: texture).  The wicked buns were OK, but they could have used some mayo or spice to balance out the sweet glaze on the meat, and the buns themselves were a bit stale / hard.  The garlic noodles were also on the sweet side, and not terribly garlic-y.  They were also lukewarm, at best.  The sausage was....again...kind of sweet and generally fairly bland, and it was served with an even sweeter sauce that neither of us liked.  Finally, the claypot was ALSO sweet, but at least in this case I was expecting that.  \n\nMan, looking back now....this was a very \"sweet\" dinner.  I think everything could have used more spice or something umami, like more fish sauce?  But it was all edible, just not amazing.  I think the fish was the best part and it seems to be their most popular dish, so if I did go back, I'd probably order that again.\n\nService was....not amazing.  At around 8:30pm on a Wednesday, the service was overly-harried given how (not) busy they were.  The restaurant was about half full and I didn't see any type of to-go / delivery orders being sent out, so I'm not sure why the staff was so neglectful of their tables.  The person who took our order not only messed it up (he apparently put in our full order, but then decided that he had gotten it wrong....even though he had not...and sent one of our items back to the kitchen???), but he also never came back to help us ever again.  We were waited on, for the rest of the evening, by a quasi waiter / quasi host that seemed completely overwhelmed...and his version of waiting on us was purely dropping off food.  No one asked us how we were, did we want another round of drinks, etc.  I probably would have ordered a second glass of wine if I were able to flag someone down.  As it was, we didn't get any place settings / utensils until after our first dish had arrived.\n\nI will say that they have a pretty impressively broad wine/beer/sake selection for a restaurant this small and they've laid their wine list out in an interesting way, though I wasn't blown away by any particular wine option.\n\nAgain, this is certainly a step above a lot of processed, Americanized Vietnamese food that you can find, and a cute neighborhood spot for dinner....but not worth a special trip.  Maybe not worth a trip, at all, if you prefer spicy food...", "author": "Tay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "this spot in San Fran is really chic and I'm surprised  it wasn't super busy inside. The decor was fantastic and owner? Was phenomenal! We tried multiple dishes like Bo luc lac, pho filet mignon, clay pot fish, beef carpaccio, and a few other dishes and none disappointed us. If you're local or visiting San Fran give this place a shot and you won't be disappointed!", "author": "Bradley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-07", "description": "I've ordered Co Nam from Uber Eats a couple times now in hopes of really good Vietnamese food but, have had two underwhelming experiences. \n\nThe pho ga I recently had delivered was pretty meh. The slices of chicken breast were tough and felt like an afterthought. The broth itself was pretty good but, all in all just felt like standard chicken stock. Plus, they don't give you hoisin sauce or sriracha to flavor things up a bit...kinda weird. I also had a bit of the noodle bowl with chicken thigh that my friend ordered and it was very much the same as described above. \n\nPlenty of better options out there for those of you who are looking for authentic Vietnamese cuisine.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-18", "description": "I got the basa claypot and rice. The basa claypot was literally just basa fish, no veggies or other accompaniments. The fish texture was flaky, though it could have been a bit more moist. It felt extremely healthy. While the sauce (soy + fish sauce combo) could have been a bit lighter, given that the inside of the fish wasn't marinated, it worked out ok. \n\nThe brown rice I got was rather dry and didn't have that nuttiness that makes brown rice so satisfying. \n\n3.25/5 on taste, but quite expensive for what it was.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "I've always noticed this place in the neighborhood, so I decided to try it one afternoon for lunch.  Initially it took a few minutes for the waiter to notice us to be seated and the dining area was really dark.  I would say this place looked a lot more upscale compared to the typical pho restaurants I typically go to.  \n\nI ordered the wicked pork buns and the beef pho.  The buns were tasty with a good combination of pickled veggies and tender pork belly.  The pho broth tasted good, but I couldn't help notice that I didn't get much beef.  I also liked the availability of Thai chilis to spice up my soup, but my eyes and mouth regretted it later. \n\nOverall, this place was pretty good and I'd give this place more of a 3.75.  Food was solid, but I can't justify getting a $20 bowl of pho very often.", "author": "Mitch T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-12", "description": "2.5 STARS\n\nFor my office lunch main, I decided to get some noodle soup. Our delivery order arrived via Caviar on Friday, March 9th around 12:30pm.\n\nI got their Pho: Your choice of beef or chicken with vietnamese rice noodle soup, scallions, white onions, and cilantro ($15.50). I'm a #1 kind of girl, so I got the beef version. The broth had a good amount of meaty flavor, but the portion was tiny. And for $15+, I would have expected at least twice the amount of noodles given. If you are actually hungry, this will leave you wanting more. Like a second bowl of pho. I did ask for extra limes, jalapenos, and hot sauce. I got the limes and hot sauce as I don't think they serve jalapenos with this dish. The hot sauce provided was a small portion, so I was glad I have a huge bottle of sriracha at my desk.\n\nFlavor wise, I enjoyed the soup. But for the price, I would expect a bigger bowl of pho. Glad I had a side from another restaurant as I would have needed a second lunch after this. Make sure to order an app and for ask for extra noodles/meat as their pho will leave you hungry!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "I may be biased but the pho here is a disgrace to Vietnam. The broth tasted like boiled water the noodles were super soggy and worst of all the Hoison Sauce was watered down an bland af.  Sad they took all the good food off the menu pork belly app and didn't have the two appetizers available on The menu that I ordered. Only a matter of time they go out of business. Surprised they lasted this long actually.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-03", "description": "My co worker and I come here pretty often for lunch. We love their rice bowls and the crispy rolls are amazing.\n\nI had their angus burger yesterday and was pleasantly surprised at how amazing it was. The burger itself was seasoned perfectly. It was a little too medium for my taste. Medium here is probably a tad bit more rare so next time I'll probably ask for it well done. This bun was buttery with the right amount of crunch to it and the umami sauce was yum!!!! \n\nThe truffle fries are never a disappointment, I just wish you got more! \n\nPricing is a bit steep in my opinion. $26 including tip for a burger, fries, and drink (no refills) is a bit much. The soft drinks are very watery with very little fizz so I'd probably stick with an iced tea or sparkling water.  Service is so-so.  Once you get your food no one checks in to make sure everything is okay or to see if you want refills, napkins, etc.\n\nWhy the low stars if the food is good?  For one, service needs a little work.  If it is too busy for one person to work the floor, get some extra help.  Also, when I checked my bank account on Sunday I noticed my card was charged twice.  I reached out to Co Nam twice to get more information and to make sure the extra charge was cancelled and each time I was told the Manager would give me a call. By Wednesday, the extra charge was removed but I never received such call from the Manager, which in my opinion just shows poor customer service.\n\nI won't be back!", "author": "Sabrina J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "Thank you very much!  You have successfully assured I will never treat anyone how you treated me.  You have proven that you can call a customer wrong and also tell her that she no longer needs to be a customer, and it's her choice to eat there.  Thank you for the lesson and I'll make sure I never make the same mistake you did. \n\nI ordered the Pho Togo.  Usually it doesn't come with as many noodles in the Togo portion.  I asked for no toppings (no onion, scallion, bean sprouts,etc.) and extra noodles.  They said okay and came back saying it would be an additional $5.00 charge for the few extra noodles.  Okay, that's fine.  I'll do it because sometimes it's not enough.  \n\nI got my soup and there were no extra noodles (or enough extra noodles for what I imagined for $5.00).  Mind you, the soup is $15.50 to start with so it ended up being $20.50 for what is pictured.  I didn't take a picture of what it usually looks like, but I did of what it looked like today.  \n\nI called the restaurant because I believed they forgot my extra noodles, but still charged me.  The lady on the phone said, very condescendingly, \"Well Dear, I did the order and added the $5.00 charge, which is our typical charge.  You didn't have to order them.  I also looked to make sure there were extra noodles so I don't know how many noodles you were expecting.\"  Okay, thank you, but I wasn't asking you to defend yourself or be so condescending.... and please don't call me Dear to make it seem like I'm your child.  I was telling you it didn't seem to me that the restaurant added extra noodles.  She continued and also stated it was, \"your choice to eat here.\"  And then continued to call me, \"Dear.\"  I asked for a manager and she said there wasn't one.\n\nWell, no thank you and your attitude and calling me \"Dear\".  You can keep my $5.00, your attitude, and your noodles.  I don't need that in my life.  Hope you have a better day.  Sorry I won't be there to see if you do.", "author": "Angelique G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "The food here is pretty good, but I think there are better and more flavorful Vietnamese options within a mile or two that are much more friendly on the wallet. Co Nam is pretty standard for pho or vermicelli bowls, yet is about 5-7 bucks more for a serving than other places in the area. With that being said, the ambiance and decor is nicer here, so if you are looking for a place to impress a little more, and bring some one on a date or out for an occasion, this is a place you could check out.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-02", "description": "After a night of fun and drinking. I woke up the next morning ready for some Pho to cure me. I couldn't fathom walking to the TL for some good spots. So I settled this time around a place a bit closer to me and came across Co Nam. \n\nWhen I first entered it has a beautiful Rustic modern look to it. We were immediately sat and provided a few waters.\n\nWe started off with the shrimp spring rolls which were delicious and some Vietnamese coffee. Hoping to get the authentic slow drip at our table, more-so was coffee drinks resembling Starbucks. They were indeed good though! \n\nFinally on to the Pho paired with some Filet. The broth was good but the noodles were way too bundled and twisted. Overall it was alright at best.\n\nThe ambiance of this place is pleasant but due to the price point and average taste. I'd keep moving.", "author": "Nick F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "Came in last Tuesday and wasn't busy at all. Service was horrible. After 30 min I asked where our food was and they realized they forgot our order so I joked and said so we'll get this round of drinks for free? Never checked on us, we had to flag them down for water and another round. Wait over 30 more min for our food, it was ok. They brought us Brussel sprout chips we didn't order and when the bill came it was full price and only gave us the sprout chips for free, that we didn't order. Didn't tip, have never done that before, but the three of us decided it was that horrible a tip wasn't merited. Try aux delices up the street if ur on Polk and want Vietnamese", "author": "Angela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "I'm often asked about the best Vietnamese food in SF, well I think it's here! This is up scale Vietnamese food but in the best way. The kitchen is playful but keeps an identifiable Vietnamese flair. The ingredients are vastly superior to anything you'll find being used on Larkin Street.\n\nThe wine list is thoughtful and perfectly paid with the food. I especially loved the house beer.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Love this place. It's great to find a clean modern Vietnamese place with good atmosphere, nice owners and great food. The basa fish claypot and shaken beef are our faves. Also the garlic noodles are delish!  It's a great plus that they are on Uber eats as well!", "author": "Yasi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Hidden Treasure in Nob Hill. Co Nam delivered a great bowl of pho'. Super large portion, so now I had lunch and will have dinner. We also picked up an order of lemongrass basil chicken to go. Tired travelers, ready to spend a night in and this should do quite fine. Friendly staff and bartender Eric was great, filled with knowledge and eager to please. When in San Fran, I would highly suggest coming into Co Nam to warm up with some unique comfort food. Super cute decor and easy to find parking.", "author": "Tammy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "Yummy food and great atmosphere. My only qualm with this place is that I've had the same quality Vietnamese food for much cheaper, but I get that it's about the modern hip environment and the location. \n\nFOOD: \n- Pork belly buns: delicious! I only wish there were more of them! \n- 6 minute egg: tasty and wonderfully salty. \n- Pho with beef and beef balls: solid. Broth was very good. Really enjoyed their beef balls in particular, but it's kind of odd to have to pay extra for them here. \n\nOverall, great service and I would recommend this place. They have a happy hour, which I'd love to check out.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-19", "description": "Super slow service, I feel bad for the worker here since she's the only one working EVERYTHING in the front. The banh mi was fairly good, however, the fries were fairly cold by the time I got them and they decided to leave a noodle on my bread. Repulsive, but, at least the bread was fairly baked and crunchy and the chicken was JUICY", "author": "Megan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-21", "description": "I came here around 2PM when no one was around. While the food is good, I was shocked at how much my vermicelli bowl was (I don't live in SF so I don't know if these prices are normal). Also I came while they were doing the airshow in SF, so I was frequently disturbed while eating my bowl as the airplane noise was very loud.\n\nThe service is excellent. I think people come here in the evening for the ambiance, but I was just looking for good food at a decent price.", "author": "Ellen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "The food was good (not great) and wait staff was beyond obnoxious.  We either that two people waiting on us at the same time or no one could be found.  Our drinks were ordered 15 minutes before our food and still had not arrived when the food came out.  No apologies, no urgency when the food came and we told them we were expecting the drinks to go with the food and asked them to expedite.  I wanted a tiny taste of a wine sold by the glass before committing to their most expensive wine by the glass and the manager/bartender refused because the bottle wasn't open, went though they would have to open it to sell me a glass.  I was honestly tempted to abandon ship before they brought the food but honestly I was hungry enough to eat my arm so we just stayed and were pretty annoyed the entire time.  Went down the street for dessert because the idea of staying a minute longer was not fathomable.", "author": "Adrienne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "This place is one of my favorite restaurants in Polk. It's also probably my favorite Vietnamese restaurant in the city so far.\n\nThe place is pretty closed and not very well illuminated, but the decoration and music gives it a cozy feeling that few places in Polk have.\n\nThe food is simply amazing. No matter which noodles you're order they're going to be top notch. The bowls especially are super customizable and really good for their cost.\n\nSince the main dish is usually enough, I haven't tried that many appetizers. Only the Beef Carpaccio and the Wicked Buns. The carpaccio was super fresh and really well accompanied. The Wicked Buns were not great, but not bad either.", "author": "Antonio H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "This is a great neighborhood spot. They usually have reservations available on Friday nights. The best things on the menu are the clay pot fish and the shakin beef.", "author": "Sami S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-20", "description": "Food was ok . \nHot Appetizers took 20min came out cold af \nEntree took over an hour but at least it was hot the cook didn't tell me they were out of Jasmine rice till my food was ready . I would of ordered something else. \nService was horrible. I kept having to wave down the waitress \nHire more help If you have catering job to do.\n\n\n****update \nHad to wait few mins to be seated no one was in the front room. \nWave the waitress down for tea and had to remind her after 15min-20min for my tea which wasn't that hot \nAnd reminded her again for our wine \nWe ordered the birds nest , fried rice , and some street food \nGot there at 6:13", "author": "C G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-31", "description": "Went to this place based on the reviews. Food came out cold. Food is very very average for how expensive it is. Garlic noodles had a very odd taste. I don't think I would be coming back. Pretty empty on a Friday night. Much better Vietnamese food in else where in the city for half the price.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "It's kinda funny to see people feel frustrated to pay $20 for Thai or Vietnamese food, while they re okay for pay $30 for some other cuisines. And even though they say the food is good.\nAs a person who lived in 3 continents, I would say quality food needs dedication and effort. Please be open and if the food is good, pay the price regardless where it's from.", "author": "Darren L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-06", "description": "Why is there cheese on the garlic noodles?!? WHY?!?!?! And it tasted more like bad chow mein than garlic noodles. \n\nAnd the pho? They messed up my order and gave me beef with chicken broth, instead of chicken with chicken broth for the pho ga. \n\nNot happy.", "author": "Fanny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "Clean, nice interior with limited outside seating and more than the typical Asian beer selection. One of the best spring rolls ever. Highly recommend it.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "Pro: Love the lighting.\n\nCon: It's quite pricey for Vietnamese food. I understand it's San Francisco, but $20 (post tax & tip) for a bowl of pho, it's lol prices lol", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "Co Nam pho not so special... the filet minon was oke... if ur really vietnamese u wouldnt love the pho here... but if ur american n try to look for something new to eat... then the pho maybe taste good to you.... the vietnamese coffee tasted funny to me.... nice restaurant though with a bar... u will see some of the viet culture while eating here.... love the service...", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Excellent Vietnamese Food in a more high end cozy setting.  Great experience and great food!  Highly recommend!", "author": "Paige M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Best pho I have had since moving to the city. The broth was very rich and flavorful and the chicken very tender and delicious. Also got the shrimp fresh rolls and they were excellent too. Will be ordering again soon!", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "Waited half an hour for cold fries. The rest of the food was very very average and over priced. Would rather go to the tenderloin for good Vietnamese food instead. Customer service was also very slow unfortunately", "author": "Daniel Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "Food was pretty good, but service was lacking. \n\nI arrived with a group of 6 on Sunday at 6:30 and the place was not too busy. Initially, service was great - server came over right away for drink and app orders, and soon after came back for entrees. Apps came out quickly and were pretty good. However the entrees took an entire hour to come out. We saw several other tables receive their entrees before us. We asked a server at 45 mins where our food was and he said he'd go check. A couple minutes later, our actual server came over and apologized for the delay and said we'd get a brussel sprout tips appetizer on the house, which was a nice gesture but didn't help explain the delay. Finally we got our entrees after another 15 mins. \n\nFood wise it was decent, the street noodles were good (although came out lukewarm rather than hot). Prices are as you'd expect in SF for the value. Great ambiance and location, I just wish I had a better service experience here.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "YELP 100 CHALLENGE 2017: 9/100.\n\nFOURTH OF FIVE SPOTS FOR NYE! \n\nThis is THE one spot I didn't want to miss for the night. I got the chance to take a look at these digs (via Yelp, of course) and saw way too many interesting apps I REALLY wanted to try. And since Hubbers and I were gonna be in the city anyway... HELL YES!!!\n\nIt's a small cozy place. They can probably seat just about 40 people, I'd say. Each wall has a different modern decor, pretty interesting to look at.  \n\nMost of the tables were pretty much reserved (understood) but there were a few seats open at the bar. \n\nOur intention was just to have a set of drinks and maybe a couple of apps. We figure we'd be outta there in about an hour. \n\nBut. O...M...GGGAAARRSSSHHH!!!\n\nOther than a couple of brewskis (for me) and a few glasses of wine (for the Hubbers), we ended up ordering the following appetizers: \n\nBEEF CARPACCIO: This is one of the best carpaccio I've had. Presentation was nice, it was well put-together. There was an absolute Asian flair to it - slight hint of sesame oil, mint, and the crispy shallots was a nice touch. YUM! \n\nCHICKEN LIVER AND HEARTS: Both came with the jalapeño glaze. Both were grilled. Both were delicious. No gamey or weird after taste. \n\nBONE MARROW: At anytime I see roasted bone marrow on anyone's menu, I get it. This was a bit of a downer because there wasn't enough marrow for the amount of baguettes that came with it. Hardly worth the price. \n\nENOKI MUSHROOMS: Who doesn't like anything bacon wrapped?! If you're a mushroom fiend, get this! Delicious! \n\nCRISPY PIG EAR: It really lives up to its description. They are thinly sliced, thinly battered and deep fried. Seasoning was perfect and it wasn't greasy at all. And that CRISP! It went really well with my beer! \n\nBEEF WRAP: Not too impressed with this one. Hubbers and I felt the beef could use a bit more seasoning. \n\nSHRIMP LOLLIPOP: It didn't really need the glaze. It was delicious just the way it is. But just like the bone marrow, it was also a bit of a downer - it only came with ONE. \n\nHubbers and I lost track of time because we had an amazing time! \n\nFood. Drinks. Service. Almost perfect. 4.5 stars! \n\nIncroyable, Co Nam! I shall return!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Spring rolls were so good! Love the lighting, decor, greens and ambience!\nAlso, great service, thanks!", "author": "Shivani M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Food here was pretty good. The roti appetizer was super yummy. The bowls are a good portion and they are generous with the meat. I think they are a little over priced for the kind of food they offer, but nice ambiance and overall good.", "author": "Aya O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-04", "description": "The pho is not great pho. You don't get the rich flavor of the broth that you want in a bowl of pho. They do give a whole lot of noodles though. The wicked buns weren't that great either.. buns were cold and the meat and veggies inside weren't that flavorful either. I wouldn't come back!", "author": "Jeana Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "We stumbled upon this restaurant and the food was fantastic!  The decor was very cool with a wall of dried moss on the back wall. The music creates a cool vibe and the service was very gracious. Their signature drink was so tasty and everyone had a great time. Highly recommend!", "author": "Bob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Food was amazing. The service was great. The drinks were delicious. Very pretty inside. Got to try it!", "author": "Alex F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "I only came here for the Nem Nuong (Pork spring rolls) and hot tea, so here's my review of that:\n\na) The Nem Nuong was grilled and wrapped to perfection. Mouth watering, flavorful, delicious.\n\nb) The tea did its service.\n\nc) The service staff was friendly, the restaurant looks clean, and the atmosphere is nice.\n\nI'm not from SF so I can't comment on its price. Overall, nice restaurant.", "author": "Vincent V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "Ordered for delivery through UberEATS.  The delivery service is good and the foods are average.  At least we tried it but with other options in SF, no point being a repeat customer.\n\n1. Shrimp spring rolls - you get one shrimp sliced in half with vermicelli noodles, lettuce, sprouts\n2. Pork spring rolls - about the same as the other spring rolls\n3. Shaken beef - c-h-e-w-y but cooked medium rare which is good \n4. Basa fish claypot - ugh, not authentic and therefore, very disappointing \n5. Wicked buns - the buns are ready made freezer kind you can get at any asian grocery, the pork belly was decent and it has a \"banh mi\" flavor to this appetizer", "author": "Kayla N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "Starving and on Polk Street - not a good combo for the indecisive! What to choose? We settled on Co Nam to try something new. \nWe were seated immediately. We ordered two apps: the pork belly and pork buns, both around $10. The three buns were extremely small, as in one bite small. Not exactly a bun, in my opinion. The pork belly tasted OK but it was five small and thin cut pieces. \nFor the entree I ordered chicken pho. The broth was flavorful and I finished the entire bowl. For me, pho is a predictable dish to order and it met my expectations. My friends ordered clay pots, one chicken and one fish, and enjoyed them. \nDecent beer selection. I had the blueberry gimlet (OK, I had two...) and I enjoyed it. Easy to drink but it didn't taste very strong. \nThe staff was very friendly and attentive!", "author": "Emma B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "We have been going to Co Nam for the past two years and their food is consistently great. Today was no exception.  We had a take out order for beef pho, seafood fried rice and spring roll. Quality of ingredients are top notched as always. You do pay more for their quality ingredients. If you are looking for cheap Vietnamese food with big portions without caring for fresh ingredients, Co Nam may not be right choice. If you are looking for quality Vietnamese food, go for Co Nam.", "author": "Arthur N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "The tastiest PHO I've ever had. No condiments on the table because it's not necessary, the food is FUL of FLAVOR. The restaurant is extremely clean with a modern design and art installations that promote cultural awareness. One can walk through the kitchen and see Vietnamese chefs prepping and preparing food with fresh ingredients.", "author": "M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "This place is a gem. I had the delicious spicy ginger cocktail (spicy to your liking), fresh spring rolls with shrimp, make your own bowl with grilled pork, and the green papaya salad with tofu. Service was a little slow for the restaurant not being full but I would eat here again in a heartbeat.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "My friends and I had a great brunch experience at Co Nam and I look forward to trying lunch/dinner here in the future. The non-traditional brunch menu really caught my eye but I was mostly excited for the $14 bottomless mimosas. \n\nI ordered the Egg in a Basket (a fried egg in brioche bread, served with bacon, a small salad, and potatoes) and bottomless mimosas made with grapefruit juice (they also have orange). The egg was perfectly cooked and seasoned with chives and black pepper. My friends ordered the French Omelette and French Toast, and I think they both enjoyed their dishes as well. \n\nFor the bottomless mimosas, they give you a bottle that contains 4-5 servings of mimosas and they will bring you another bottle after you run out. \n\nIt took a while for our food to come out, but our server was very friendly and attentive. Keep up the great work!", "author": "Helen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "I'm a regular at this spot! Great vegetarian and vegan options as well as awesome meat options! Always have had a positive experience here. Not to mention how awesome the owner is! They also do a fantastic job catering to my food allergies.", "author": "Meredith P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "I got the vermicelli chicken bowl for lunch -- not cheap that's for sure!  (About $21 with tax). Tasty though and service was polite and quick. Like that they don't close between the traditional lunch and dinner times.", "author": "Tilly D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "Came here with some friends. The atmosphere is very nice, great for holding conversation.\n\nFor appetizers, we shared the pork belly. A little bit on the salty side but it was cooked very well. For entrees, I had the bass fish clay pot. The fish was very well cooked. The outside was a little bit crispy and the inside was super tender. My big issue with the dish however, was that it was extremely salty. So much that it was overpowering the natural flavor of the dish. For its price, the portion sizes were on the small side but still quite filling. Overall the food was cooked well but the seasoning could use some work.", "author": "Cassie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Upscale Vietnamese restaurant with nice, modern decor. They have happy hour from 4-6pm when you can get 25% off appetizers. Service was friendly and attentive.\n\nWe ordered the shaken beef ($23) which were savory cubes of filet mignon. The texture and flavor were great. The salt and pepper sauce was super addicting. This dish wasn't enough to feed one person if you're hungry though. We also got the bun bo hue ($16) which was good. I liked the lemongrass broth and tender cuts of beef. \n\nOverall it's a trendier Vietnamese place so expect higher prices for smaller serving sizes.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-13", "description": "Terrible experience!!!!! I have been to co nam many times and have never had a great experience. So my final time there my friend and I ordered the pho. Within a couple minutes of eating it we had both found small black hairs in our broth. When we told our waitress she acted as though this was not an issue. In the end all she did was comp one of the phos and nothing else that we had ordered! Awful customer service and establishment!", "author": "Talia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Excellent food! Dishes well thought out for maximum enjoyment. Stsrted off with Garlic Herb noodle that was a tasty treat with egg noodles. Basa Fish Claypot tender caramelized fish was delightful. Shaken Beef a mind altering experience with notes of taste that delivers a memorable experience. Wait staff had excellent suggestions and made our meal sensational.", "author": "Dwayne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "Took way too long to get a pick-up order. Design of the restaurant was neat, but not worth the wait.", "author": "Mohamed O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "Really solid Vietnamese food with good drinks to boot! The bun bo hue was surprisingly authentic and delicious, and the lemongrass chicken was so flavorful. When I came here in a weekday it wasn't really crowded so you can expect to get seated quickly. \n\nOverall I really enjoyed having dinner here. Yummy cocktails, good food, comfortable ambiance - what more can you ask for?", "author": "Claudia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-11", "description": "The food is ok and outside looked clean.  But I am not sure why the SFO government gave 73 points on cleanness.  Maybe something we cannot see from outside.\n\nOne thing I would like to bring to customers' attention.  This restaurant charges SF health insurance on all the orders.  SF health insurance is not a tax which passes to the consumer like sales tax.  The customers do not need and are not obligated to pay SF health insurance.  The restaurant should ask the client if he or she wants to contribute money to their employee health insurance fund first and charge it on the bill.  Without informing people and charging directly is a very dishonest way doing business.", "author": "Louise T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "This restaurant blew my mind! I wasn't well versed with Vietnamese cuisine outside of a pho, but came with a Vietnamese friend ready to try new dishes. We had a variety of dishes, all were so delicious! Shaken Beef was the best dish ever!! The meat melts in your mouth and pairs so well with the vegetables and shredded beets that are on the side. Phenomenal flavor and style in everything served. Would recommend to anyone.", "author": "Robby A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Co nam is very underrated in my opinion. There is solid Vietnamese fusion dishes and street food options like shishito peppers and bone marrow. Their draft beer selection is strong with up to 10 different options that are quirky like the saison tsuya -- wholesome & mildly sour flavor. The interior decor is very nice with a wall of succulents and a wall of vietnam culture.", "author": "Young Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "I used to love this place. But my most recent experience here was less than favorable. We had to wait an hour for our food. About 45 minutes in, they finally addressed us and told us it would be another 15 minutes. Finally, a minute before we were going to walk out, they brought us our food. But they didn't even get the orders right - they made the non-vegetarian version of a dish for someone who ordered the vegetarian version, and they brought us a dish that was meant to go to another table! They tried to make up for their misses by giving us the tiniest possible appetizer, which was definitely not enough for 5 people. I think the service at this place is best summarized by the words that were on the back of our waiter's t-shirt: \"I'm not listening.\" This was the worst service I have ever experienced, and the food was not especially good either. Apparently they have a new chef, and the food is now over-salted - and they got rid of some of the best menu items! Reading some of the other reviews, this is not an uncommon experience. Unfortunately, I will no longer be a regular customer at Co Nam.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "This was my first time here.  The gentleman that greeted us and then was our main waiter was extremely nice.  He gave us great food and beer options to think about before we ordered.  The food had a lot of flavor.  I personally loved the street food menu and loved the claypot medley!   \n\nThe owner came by to check in on our experience which is always a nice touch.  I definitely plan on going back!", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "The bartender Eric was extremely amazing and quickly helped us out when we were indecisive.  I will definitely come back!!!", "author": "Sara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "On a cold winters night, I decided to meet a friend for a drink, but first, SOUP! Yelping the surrounding area to our bar, I came across this place and it looked super cool, so of course, I need to check it out!\n\nThe joint is super hip! The bar top was a slab of cement; obviously so were the floors. I love the wooden accents around the place. And what really caught my attention was the wall of rustic photos. It really stayed true to the theme of the \"rustic Vietnamese restaurant. My servers, were awesome as well. Super personable and quick to give me recommendations. Super appreciated. \n\nAlong with having a delicious glass of the J Lohr Pinot Noir for $12, I also got the Bun Bo Hue for $16. Wow, talk about soup brought to the 100th level! This rustic soup was filled with noodles, beef shank slices, pork sausage slices, oxtail, pigs feet and yes, blood patties. Once you get over the fact that they are pigs feet, oxtail and blood, those things are actually really good. Lots of marbleized meat so you know you're getting a bowl full of flavor. The broth was rich and delicious. I highly recommend this dish! \n\nIf you're ever in this area, I definitely suggest coming to this joint. It's fun, hip and full of great food. You won't be disappointed!", "author": "Rockne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Such a wonderful restaurant. :) Gorgeous atmosphere and a dedicated friendly staff. Our waitress tonight was a young woman from Vietnam, and she was so excited to tell us about her native food in her home country and how authentic it tastes here at Co Nam. :) She was extremely sweet and very knowledgeable, and made an impression with me and my aunt.\n\nI almost didn't give it five stars, only because there aren't many vegan or vegetarian options that weren't essentially just vegetables.. I'm a vegetarian who hates salads, so I was struggling to find non-spicy dishes that contained tofu. With no luck, I settled for the Grilled Salmon, and it was DELICIOUS. I definitely recommend that one, although all of the dishes were objectively amazing I'm sure. Plus I hear great things about this place from others.", "author": "Allison D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "I started off with a spicy ginger cocktail which was the right mix of spice and ginger. The claypot medley came out just as I was contemplating a second drink...good thing because the beer, wine and sake selections were so robust. You will never be short on drink options here. The claypot medley was fresh, healthy and seasoned to perfection. I got in during a busy dinner rush which was a-okay because the bar was wide open and it gave me a chance to meet the owner Trong. He was as nice as the food was delicious! If you're in the city you should stop in and grab a bite. I didn't get a photo of my claypot because my cell battery died :/", "author": "Lyndsay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-28", "description": "The pig ears were amazing! This protein can be difficult, but these were perfectly seasoned and crisp. The bahn mi was also very good, and the basil on the fries was a great touch.", "author": "Wayne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "This place is awesome! They have delicious summer rolls, their papaya salad is really fresh, and they have these delicious bowls where you can mix-and-match and customize with proteins vegetables, and sauces. My only complaint is they don't stay open late enough!  It's a great spot for casual Vietnamese food.", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "I ordered a bunch of stuff through UberEATS here and was overall satisfied, but didn't think everything was great. \n\n1) Shrimp spring rolls - theses were good! With peanut sauce, and pretty standard with other shrimp rolls I've had in the past. I enjoyed these. \n2) Beef pho - this was good too! Yummy broth and soft noodles, overall good as well. Would recommend not getting beef, maybe chicken instead, when you are ordering take out because the beef comes raw and doesn't cook as well since the broth isn't as hot after the delivery. \n3) Pork bowl with vermicelli noodles - this was really good, except the pork was too salty. Otherwise it would have been perfect. \n4) Papaya salad - do not get this!! I don't understand how this was supposed to be a salad... there was no papaya, only bean sprouts and carrots with some fried tofu on top. Did not like this at all.", "author": "Caley Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Decided to dine in on a Sunday afternoon and was surprisingly empty. Looked at the menu and was confused as they serve different types of food as I was expecting mainly Vietnamese dishes. Ended up ordering the pho filet mignon. Was surprised by the price as it was $15. Assuming it must be some bomb pho, I gave it a try and to my surprise broth was on point. Beef was decent and noodles mixed well. Portion wise was a bit small but I can understand as it's SF. Considered the burger but I'll leave that up for next time. Nice cozy interior, which I always put into consideration when dining out.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-19", "description": "I should have known before we were seated that this place may not have been what I was looking for. I was hoping for some amazing, traditional Vietnamese food with a twist of farm-to-table options & fresh flavors.\n\nWe opted for some street food skewers which were okay. The waiter took our order wrong, so we didn't get what we wanted. By the time we figured it out... it was too late to ask for a correction.\n\nI ordered the Bun Bo Hue, and the flavor wasn't bad. It wasn't spicy at all but the flavor was enough to make up for it.  I was appalled at how big the slices of meat were. They were cut like how my blind grandmother would slice them at home.  I wouldn't mind the slices being so thick and large, IF the meat was tender enough to bite through. I felt like I was playing tug-of-war with a beef tongue.  Also, they only provided one small piece of the pig's ankle, which is a staple for the dish.  I was also appalled that they charged as much as they did for this bowl of tough meat and didn't even offer the banana blossoms that are also a must.  Please don't say you can't find it, because if I could find them in Portland, I can definitely find them in SF.  And hold the door...white cabbage? Are you that gentrified that you couldn't even opt for the purple cabbage? \n\nMy husband ordered the burger and couldn't bite through the meat.  Don't get me started on that monstrosity.  \n\nNote: If you want Vietnamese food, don't go here. If you want a combination of stuff on pretty plates, go here.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "Good beer list and decent menu but the service was slow, the food took more than an hour to arrive, and the manager was unbelievably rude.  Should be a great place but with this approach to service it is not worth a visit...", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "This restaurant's staff and manager named Erik were extraordinarily rude to us and the service was remarkably slow. We placed entree orders around 7:30pm and the food didn't arrive until 8:30. We told them we had to get back to our babysitter and didn't have a ton of time. When we asked if it was normal for service to take over an hour they said yes, that was normal. I asked Erik if he could apologize for the slow service and consider comping anything and he called me \"crazy\" and told me to pay the full bill and leave his restaurant as soon as possible. I have never been this insulted in a restaurant and I would strongly recommend against eating here.", "author": "Josie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "This restaurant used to be a neighborhood gem, however the last few times I have eaten there have been utterly disappointing. They served dishes without key ingredients (ie tofu), claimed a dish was vegan when it had fish sauce and took 30 mins to prepare one take out dish that was returned since they provided us an incomplete dish (noodles without sauce or tofu, just boiled vegetables). Sadly, due to multiple bad experiences, I will no longer be a customer at Co Nam.", "author": "Ketki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "They got my order wrong... so I asked them if I could have the extra dish while they made the one I actually ordered. They didn't give it to me. And I waited a long time. But then... the waitress came back later and asked me if I wanted to order another dish, on the house. So I ordered the stone fish clay pot and it was good. I ate a lot that night and I was satisfied. I would definitely return despite the small hiccup at the start-it was very worth it. Thanks!", "author": "David T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Polk street has both changed and remained the same since we left the area in 2002: Cool bars and eateries but still grungy and on-the-edge. Picked this place after some music at Mayes Oyster House and was pleasantly surprised. Great flavors in all 3 of our dishes: The bacon wrapped enoki mushrooms - great idea!; The beef lemongrass dish was so fresh and tasty, not soupy at all, wow!; And the combination dish had more protein than other filler stuff, all bathed in a lovely sauce that didn't disappoint. Hoi Polloi beer on tap from our Oakland neighborhood was an extra treat and we finished the meal with fried banana wrapped in a wonton. Very impressed with Co Nam!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-26", "description": "The service is the reason why this review isn't 4 stars! The lack of attention, the forgetfulness of orders (drinks) and slowness of the kitchen made it just too distracting to fully enjoy our meal! You should not have to work that hard for food and drink during a Sunday brunch. We weren't the only customers who noticed, incorrect food was delivered to our table as well as the two tables on either side of us. Servers not using their table numbers!!\n\nOther than that, the ambiance is quite nice with a good mix of natural wood, gray walls and greenery. Our vermicelli bowls had great flavor on the meat, fresh and crispy vegetables and the right amount of side sweet sauce it for a bit more depth.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "So delicious, I woke up the next day regretting I did not take my leftovers home. \n\nI had the fish hot pot with a side of jasmine rice. The sauce was so yummy and the fish was perfectly cooked. \n\nAlso I suggest trying a cocktail. I had the Elderflower cocktail which was light, floral and refreshing.", "author": "Angie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Absolutely fantastic food and excellent service. We tried several appetizers along with a speciality beer and cucumber martini and everything was fantastic. Highly recommend the roti and grilled shishito peppers along with the garlic noodles. The calamari salad and shrimp spring rolls were also great. Can't wait to come back!", "author": "Audrey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "I passed by this place a few times and wanted to check it out. I was a little skeptical at first because it looks very fancy and Americanized. The decor and the pictures on the wall was what caught my eye in the first place. I love it. \n\nI came here for brunch and bottomless mimosas on a Sunday. The service was great. The waitress and the bartender where super nice. \n\nInstead of getting the traditional American brunch, we got the Vietnamese noodle bowls. It was very good! I can't go to a Vietnamese restaurant and order American food. We also got the beignets for dessert. The waitress told us the sauce for the beignet is condensed milk and peanut butter. \n\nThe whole experience was great. \nI definitely recommend this place if you are in the neighborhood.", "author": "Edie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-05", "description": "Totally overpriced.\n\n$29.32 for lunch for:\n\nspring rolls\n\nchicken clay pot\n\nwas over cooked very chewy\n\nI have never written a poor review of restaurant on yelp before", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Got the Bottomless mimosa, beignets, shishito peppers, grilled pork rice bowl and the tofu vermicelli noodles. Everything was delicious. Good service and I like the modern casual ambiance. I recommend this place", "author": "Ro N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "This is one of the best Vietnamese restaurants I've been to! I ordered the pork rice bowl and it reminded me of my mom's cooking. It's authentic, delicious, and will leave you full and happy as their portions are very generous. It's a little on the pricey side, but I think it's worth it! \n\nThe veggies were fresh and the pork was seasoned perfectly. Even though they gave fish sauce on the side to drizzle on top of your food, it wasn't necessary! Most Vietnamese restaurants I go to make the meat so dry and bland that you need the sauce. This restaurant did an excellent job in seasoning their pork perfectly!\n\nOn top of that, drinks and HH deals are great! My mojito was pretty strong and the lychee drink will leave you with a buzz.\n\nIt's a very cute restaurant and perfect for those who love Vietnamese food or for those who have a big appetite!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "This was a cute spot. Came here with some friends who are locals. Salad calomri was bomb. Recommended if you wanna do bottomless mimosas. Vibes are great, food is great, staff is kind. Totally come here if you want to chill.", "author": "Frank R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "Food was weird and wayyy too much pepper. Drinks were fine.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "We tried grabbing dinner & drinks at Amelie across the street and ending up being seating in a table in front of another couple, super awkward and had to yell since it was so loud so we walked down Polk and found Co Nam. Co Nam sits in a nicer part of Polk street than what I am generally used to and has a nice, trendy interior. It's a great place for a quiet dinner date. We didn't make any reservations ahead of time but luckily, there was no wait on a Friday night around 7pm and we were seated right away. \n\nWe had ordered the wicked buns and I personally feel like they lacked flavor, even having put sriracha sauce on. I would say my only recommendation would be the shaken beef!This was absolutely delicious, and juicy with an order of a side of jasmine rice.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "This is our go-to Vietnamese restaurant, and a great option for both last-minute dinners out and special meals.  The pho is the best I've ever had. If you're treating yourself, have the shaking beef.  It's actually a wonderful value at $24 conserving they use filet mignon and oh yeah yum yum yum. You really can't go wrong here. Get the roti from the street foods menu to start. It's just a bite or two but so flaky and good maybe get two. It comes with a delicious curry dipping sauce. If I'm doing a healthy meal out, I get a salad bowl which is like a rice bowl or noodle bowl but low carb and very satisfying! Beer and wine options are an excellent value but excellent quality. We are always amazed this place isn't more packed considering the beautiful decor, good lighting, friendly service, and top notch food. Don't tell too many friends!", "author": "Tom M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "It took 2 hours to get our food. When it came out the birds nest dish we ordered was cold and tasted bland. We think it was under sauced, but we didn't care at that point. Only come here if you're up for cold food and waiting 2 hours for your food to come.", "author": "Will H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Vin and Am are the best chefs ever. I got a chance to meet them and showed me their process of how they make they're food and their A1. Mimosas automatically getting refilled is a nice touch as well. I recommend this classy place to everyone.", "author": "Logan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "Sorry, the most weirdist review ever... So I'm sitting with some friends eating dinner at this Vietnamese place (At least I thought it was Vietnamese based on it's name and description) But after eating the food I guess I'm not sure.\n\nAnyhow, there's this guy at the bar that just starts coughing and wheezing and I'm like OMG, he's having a heart attack or something.\n\nSuddenly some guy comes out from the back wearing a t-shirt and goes behind the bar and starts talking to the bar guy (customer).\n\nIt sounds like he said he was the owner and asked what the problem was.\n\nThe bar guy said he had an allergy (It looked like he was being poisoned), and told the owner guy that he must list ingredients on the menu so people with allergies could be safe. He even pointed to other entries where the proper ingredients were listed.\n\nHere is where it get weird....\n\nThe Owner guy basically tells the customer guy to FUCK OFF!!! and I'm like OMG, WTF??\nHe tells the customer guy that he owns this place and he can do what he wants!!!\n\nThe owner guy then tells the customer to pay his bill and leave.\n\nWTF???  I've never in my life seen an owner of a business Fuck over a customer in their establishment!!\n\nThe guy paid and left, but I don't know if he had to go to hospital or what. Also, we just got sick after that so we paid and left as well.\n\nI can NEVER, EVER go back to that place again with such a SHIT owner and so Disgraceful!!!!\n\nI'm sick to my stomach right now as I write this.", "author": "mary p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "I really dig Co Nam. I've been more than a couple times now, so it's time for a proper review. The takeaway is that their food is absolutely delicious: fresh, healthy, tasty and simply well prepared. I like both the meat dishes and the noodle/rice bowls (I always sub for brown rice - it's delicious). Lots of great options for vegetarian or meat/seafood sides too. \n\nBonus: the brussels chips side is DELICIOUS. I believe each leaf is peeled off then baked, sinful.\n\nMy only gripe is that the service is spotty pretty consistently. They're very friendly and helpful with the menu, but it often seems like they're one server short. Either something doesn't make it to the table, or an order is off, or takes forever to get a water refill. Things like that. Not lazy service, just in-the-weeds. This will never stop me from going here, because Co Nam is great, but I think they can do a wee bit of work on their table service.", "author": "Meredith R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "This is my go-to-joynt every Saturday for lunch, and if your in the area you should too! The draft beers selection is among the best. La Fin du Monde, Monk's Cafe, Allagash Curieux....shall I keep going..these are craft beers, among the best. They also have an amazing bloody mary that will make you wanting another. They wine selections, red and white awesome. I've even see several sake brands that are also premium.\n\nThe app menu is wicked, hearts, liver, squid, mushrooms, all prepared in a tasty flamed method. The breakfast, I know is great because I can hear everyone talking, eating and laughing it up. I absolutely love their noodle bowls. It comes with either chicken, beef or pork. It is so yummy, and addicting and delicious that you'll be craving it soon enough.\n\nThe service and servers are wonderfully kind, knowledgeable and super approachable. They personally cater to each and every guest regardless of age, gender or drunkness (kidding about the last one). I always feel so VIP when I drop in every Saturdays. I'm gonna keep going back because I love the vibes, people and especially the food and draft beers!", "author": "Suprkwn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Last night was my first time at Co Nam. The food portions were very small, but delicious! We really loved the seafood fried rice. The lollipop shrimp came with an amazing sauce that the waitress informed us was made of cashews. I would definitely go back here again!", "author": "Zinia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Went there on a rainy Sunday at 2pm, expecting it to be empty -- but it was full! Small, narrow space with seating for about 30 maybe. Long bar as well. Pretty noisy from the music, but as it turns out, we were sitting right underneath the speaker. \nFood was great! We both got the bun -- known as \"noodle bowls\" here. I got mine with 5 spice chicken, my friend got it with lemongrass beef. All the usual accoutrements -- greens, sprouts, carrot, daikon, nuoc nam. Tasty and large bowls -- I couldn't finish mine. If you're looking for middle priced VN food, this is definitely a place to try!", "author": "Yasi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "Update.  Came here  a couple of more times after and it has improved (or maybe grew on me).  Food was tasty and service was friendly.  I recommend getting the steak carpaccio (super yum) and the claypot fish dish.\n\nGood low key spot on Polk for date nights.  =)  \n\nAlso, Henry at the bar is super friendly and the service was great.", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Loved it. Great little spot. Good ambiance. Friendly service. Delicious and innovative food. I'll be back soon.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "It's pretty okay but I've had better. A lot of 5 spice in their pho and the papaya salad was super bland. Crispy rolls were pretty good.", "author": "Irina M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-31", "description": "A meh and expensive bowl of pho. Came here after doing an escape room in the area because we were cold and hungry, the interior is nice but the food was only ok. We got much more excited buying and eating fresh Bob's Donuts next door.", "author": "Wen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "We started with the crispy rolls. They were warm, moist, mildly spiced and soft inside. Just perfect. Then we moved to the salad, combo seafood for me and the bird's nest as the delicious main dish. The ambiance combines dim lights with soft music and a beautiful modern decor.", "author": "Renata V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "I stumbled upon Co Nam close to when it first opened and have been going ever since - the combination of great food, quick service, well designed drinks and good people is sometimes hard to find, and this little authentic vietnamese restaurant has figured it out.\n\nThe Drinks:\nThey have a great assortment of cocktails, beer, wine and sakes including one of my personal favorites - Hitachino Nest.\n\nThe Food:\nI have never had anything but great food here which is always plated nicely.\nIn particular I recommend the Basa Fish Claypot, the variety of rolls they make and the pho.\n\nThe Ambiance:\nTrung and his staff are friendly, fast and committed to a great experience\nThe restaurant is usually quiet enough to have a conversation\nYou can't beat the living wall and soft lightning for overall feel\n\nSo in short if you find yourself looking for fresh original vietnamese, a great drink and a cool place to enjoy it I highly reccomend Co Nam.", "author": "Mirja T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "So yummy! Quality ingredients, each dish seems simply but full of flavor. No huge line on a Fri night, seated right away. We ordered wicked buns, crispy egg rolls, calamari skewer, veggie skewer, shrimp lollipops and beef pho. The street food skewers and lollipops were a little expensive ($4 for one lollipop ball!?) and if you're not used to paying double digits for a bowl of pho, be warned it's $14. It was definitely one of the 'cleanest' and much higher quality beef you'd get compared to any other pho joint. Overall, the dishes were delicious, great vibe and great service. We'll definitely be back to try more dishes.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-12", "description": "I was in SF for the weekend, so I'm not sure if I caught this place on a bad night... I really wanted to like it, but I've experienced better.\n\nService:\nThe service was friendly, but painfully slow. We had to ask for water. We had to ask for refills. We had to ask about our food.We had to ask for our check... twice! It felt like we had to check-in on the status of everything. In short, the service was friendly, but not attentive or proactive.\n\nFood:\nThey have a full menu and then a \"street food\" menu that they recommended for quicker eats. To start I ordered the \"shishito peppers\" but found out they were all out. The server recommended we try the veggies, so we got that. When they came out my first reaction was \"is this it?\" to which the server said yes. I wish I took a picture because it was the saddest display of veggies ever. Imagine having 2 green beans cut into a few pieces and then maybe 1 piece of asparagus. Then it was placed on a skewer. It tasted amazing... which I'll give them, but the portion was TERRIBLE for a price of around $4 for the item. If they revamped the menu to lower the price OR increase the portion this would be better. The taste was awesome, but you don't get a good value in portion size.\n\nFor my entree I opted to get a vermicelli bowl with pork and added the fried egg and egg roll. I was a little surprised that the fried egg and egg roll didn't come with the bowl, especially since the price of the bowl was around $16 -- the egg roll and fried egg were about $2 extra (each). The pork was seasoned really well and tasty, but overall I thought the bowl lacked enough lettuce. The presentation was nice, but for the price I think they should include an egg roll and fried egg with the meal.\n\n\nDrinks:\nI didn't order any cocktails, but did have to ask for water, and our first two refills. I also ordered a coke, but didn't realize refills weren't free. I'm not sure if they're using a mexican coke, but the glass is super small. The server was very nice and let me know that normally refills were charged the full price of another drink, but since I didn't know he wouldn't charge me for the 2nd one. I appreciated this... but think if they're going to charge for each glass they should just bring the bottle/can to you so you know you're getting the entire thing. I don't feel like the glass they gave me was a full 12 oz beverage.\n\n\nOverall I wouldn't recommend this place (off of this first time visit), nor would I return here. I kept wanting to like the restaurant, but felt like they were failing big time... and it wasn't even packed! Since I was out of town visiting, I'm not sure if this was just an off night, which every place can have, or if this was their typical routine. Some of the flavors in their food were awesome, so I don't think the food is the problem... but they should definitely work on ironing out the other kinks.", "author": "Ishea B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "Cute place. It's a small place, but well-run. Great décor.\n\n1. Thai iced tea: Standard, which is good.\n\n2. Bird's nest: I enjoyed the fresh veggies, mushrooms, and the sunny-side up egg on top of crispy noodles. Well-flavored without being overpowering.\n\n3. Wicked buns: Pork belly in bready buns. This is a classic Taiwanese dish, actually, and it did not disappoint. You get 3 pieces per order. I just wished there were more since they were so delicious.\n\n4. Bass claypot: The fish was very tender and flavorful. Satisfying! \n\nOverall, I liked everything I had here. It's definitely reasonably priced especially for this neighborhood.", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "Decent place to get some Vietnamese food. We had the veggie rolls which were alright, and different kinds of rice bowls. The portions were pretty big and tasty, we were satisfied in general, would gladly come back if we happen to be in the neighborhood but probably not make a big trip just for this.", "author": "Ioannis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "After walking from the Castro to Fort Mason, my friends and I wanted something light and had vegetarian options. We unanimously decided on Vietnamese and out came the various review apps. Simultaneously we decided on Co Nam (which was also still a hike away, and with many intriguing spots, but we were dead set).\n\nWe arrive a little after one and the place is dead, but the staff was incredibly friendly and helpful, pointing out that while they were still in brunch mode (served until 3, and offers bottomless mimosas), lunch was an option as well.\n\nBoth menus were very impressive and a group could go with small plates and get a lot of variety (pork crispy rolls, shrimp crispy rolls, shrimp fresh rolls, etc.). And with all the variety - we all got noodle and rice bowls.\n\nFor what it is worth, I really enjoyed the pork belly rice bowl. The pork belly was incredibly tender, easy to break into smaller pieces with chopsticks, but YOU MUST pour that pork belly sauce on it. Wow, was that full of flavor (and most likely delicious fat). And you can add a crispy roll ($2) or an egg ($1), which isn't too bad and well worth it.\n\nRetouching on variety is the drink menu. While they had an impressive tap and bottle selection for beers (including some of the less common Asian beers), after all the walking a beer didn't sound all that great. But a mojito did, and they had a selection of those as well. Had to go with the passion fruit and it was worth it (although the bar tender mentioned he wasn't the normal bar tender, he did an excellent job). My friends also enjoyed their bowls - the vegetarian got the brussel sprout chips for his and said they made the bowl even better.\n\nAlso worth mentioning: the living wall behind the bar, the great views you get when walking past the kitchen to the restroom (I wanted to grab the pork belly, it was right there) and the sweet faucet in the bathroom. Hey, sometimes things catch your eye.\n\nI would like to return here for either a more traditional brunch or dinner.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "My girlfriend and I were looking for a brunch place and stubbed upon this gem. The \"$13 bottomless mimosas\" sign really caught our eyes, so the excellent food was just icing on the cake. There was no one inside which worried us but we still followed through and got a table for two. All of the food was very tasty, sauces included, which were (no judging, we were hungry) shisito peppers, shrimp roll, 2 orders of bottomless mimosas, roti, shrimp lollipops (most delish thing I had!), and beef pho. Everything was great and our waitress Kiran was so sweet! The new guy (I'm assuming) claimed that we could only have raspberry mimosas since that was the first one we ordered but she came up and asked if we wanted raspberry, orange or grapefruit, grapefruit being the best. Lastly, Right before the time ran out for bottomless mimosas, she came up and informed us that it was ending and I, being slight buzzed at this point, mentioned for her to surprise us with the flavor of our last carafe, which she made a mango mimosa! Everything was great, including the throw back jams. Def coming back!", "author": "Johnny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "Only dropped in for a quick lunch. Haven't been a huge fan of Vietnamese cuisine since a trip to Vietnam a number of years back. After only having the Pho this time, I am more than excited to return and sample more from the menu, especially the street food. Good food & service in a modern setting. Good work Co Nam. Lastly, the menu is very accommodating to anyone avoiding gluten for any of many reasons.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "3.5 STARS for food.\n4.5 STARS for service.\n\nCo Nam is a cute little upscale Vietnamese restaurant on Polk St in Russian Hill. Having read the fairly harsh reviews from my fellow Yelpers I was quite concerned I had booked a reservation on Opentable. There were highlights and lowlights but from an upscale Vietnamese restaurant perspective I thought it was tasty.\n\n* BRAISED PORK BELLY ($ 8) - 4 STARS:\nServed with a cashew nut garnish. It was tender, fatty and flavorful - I just wish there was more.\n\n* CRISPY SPRING ROLLS ($ 8) - 3.5 STARS: \nChicken, shrimp, wood-ear mushroom, glass noodle, carrot, jicama, nuoc cham. I'm not sure I tasted any of the ingredients listed, but I did notice that the spring roll was fresh out of the fryer, perfectly crispy and piping hot. This was a great way to start the meal.\n\n* BEEF CARPACCIO ($ 14) - 2 STARS:\nFilet mignon, rau ram, mint, crispy shallot, red onion, cashew, nuoc cham. The preparation from the menu description sounded on point, but unfortunately the odd text of the extra thick cut raw beef was not appetizing to me. The extra ingredients were not enough to counteract the feeling that I was biting straight into a live cow. Not my cup of tea.\n\n* BASA FISH CLAYPOT ($14) - 4 STARS:\nBraised basa fish, carmelized with black pepper, Thai bird chili and scallion. Basa is a hearty white fish which stands up well against the very flavorful, slightly sweet and thickened Thai/Viet style sauce. I liked that it was hearty, yet not dry. They have a version with chicken.\n\n* SHAKEN BEEF ($21) - 4 STARS:\nFilet mignon cubes, green onions, sauteed in garlic pepper sauce, organic baby watercress, lemongrass viniagrette, salt and pepper lime dipping sauce. Super tender, flavorful but a bit on the expensive side. I'm happy with Bodega Bistro's which is just as good and cheaper.\n\nI'm generally not one to gravitate towards the upscale Vietnamese restaurants since they are on the expensive side and don't always serve something unique or worthwhile. I still love Tin for their Bun Bo Hue and Pho, and Slanted Door for their crab vermicelli, but I really enjoyed Co Nam for the Basa Claypot. Can't wait to return for brunch or happy hour!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "I was on my own, so I didn't get to try many dishes, but my dinner was excellent! Flavors spot on, ingredients much better than average, and lovely to be able to get a decent glass of wine. I will definitely go back!", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-11", "description": "The wings comes in 5 pieces. It's also very salty. I wrote this review the day I had my first experience there but unfortunately yelp had my first review taken down. This is my experience, costumer service was not so friendly, maybe the restaurant had a bad day, but don't take it out on me. It took a server a while to notice me as I tried to figure out if I should just sit anywhere or wait for a server. Second, I reviewed that the wings are the best. My opinion, it was too salty and the price I paid for was not worth it. Overall, I rated this place 3 stars. I've ordered take out before but this was my first experience dining in. I also had the spicy bun bo hue. I'm very particular about my bun bo hue, I also rate this dish a 3 as well.", "author": "Lily Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "Q: Whats a Vietnamese coffee?\n\nBest fancy Banh Mi ever\n\nCo Nam's tagline is \"rustic Vietnamese\" and while the venue is well designed inside and out - there's very little \"rustic\" about it.  Its a lot more gourmet fusion than rustic. As Anna noted any place that calls itself rustic - almost definitely wont be.\n\nCo Nam's banh mi is the best i've ever had.  Its almost to banh me what Giordanos Bros is to \"sandwiches\" yeah its technically a Vietnamese sandwich but thats an understatement.\n\nWe also split an order of beignets - which comes with Vietnamese coffee if you can appreciate good sweet coffee you should give Co Nam's a try.\n\nOther items looked equally well crafted and the presentation alone provided a reason to return.\n\n\nA: its a drip coffee that comes with your GLASS (as in not cup) and slowly fills it up over some condensed milk.", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Delicious Vietnamese cuisines in a chic modern restaurant. Their menu doesn't come as too extensive of a list but I had trouble choosing because everything sounded great. Plus they have a great selection of alcohol. I had the lemongrass chicken with rice and it came out perfect. The chicken was marinated well and was so tender. I loved everything from the modern twist on traditional Viet decorations to the bold flavors of the food. I will be stopping by here again when I'm in SF.", "author": "Evana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Co Nam is so incredibly delicious. As someone else mentioned, I think this place is totally underrated. They consistently serve up fresh, unique and inspired takes on Vietnamese food. Their 'street food' menu is full of interesting choices and their pork chop brined and then marinated in sweetened condensed milk and 'umami sauce' is literally the best pork chop I've ever had. This place is serving the best Vietnamese food in SF right now.", "author": "Kira M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Come here for the:\nFriendly staff\nFresh ingredients\nDelicious food\nDiverse menu\nTrendy decor\n\nBrace yourself for:\nLoud music\nSweeeet thai tea (objective and may differ another day)\nSmaller portions (not your local Viet hole in the wall)\n\nWe ordered:\nBasa Claypot (fish only) $14\nRice $2.50\nPapaya Salad $10\nMango Sticky Rice $7\nThai Tea $0 (yelp check in)\n\nAll were delicious!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-06", "description": "The best thing we got was the burger.. so that says something about this Vietnamese restaurant.  The service was pretty good, and the space was fine as well, but the food is bad (well.. other than the burger of course). Ultimately, we wont be coming back since there are better and cheaper burgers out there in the world.", "author": "John S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "Vietnamese food served in a nice restaurant /ambiance means you're not paying cheap Chinatown prices for authentic Viet food. Dining here means you're paying a small fortune for smaller portions of their Americanized counterparts.  Don't get me wrong, the food is decent. In fact, it tastes really good. But it's not worth it for the price or portion. You might leave here hungry after paying $50 for dinner, like I did for the shaken beef cubes + a bowl of rice because it doesn't come with the entree + a drink.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Had a delicious meal at Co Nam. The service was super attentive. The entrees were well balanced, not too sweet. My friend had a really nice ginger cocktail. I really liked the lemongrass chicken, very succulent. Plus a very nice decor. Would definitely return.", "author": "Stacey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-05", "description": "I wanted to love this place so much. It's a cute, hip little Vietnamese restaurant with an awesome menu. The staff is great and the food was tasty. But every meat item I was served was undercooked. I ordered the chicken heart and chicken liver skewers, and the calamari salad. The calamari was so undercooked it was still a little translucent. My chicken heart literally dropped blood on to my white plate. And the liver was definitely also undercooked. \nI should probably give only 1 star, considering I got food poisoning and am not in the greatest shape currently. (Hoping the pepto-bismol kicks in soon.) However, it's my fault for not sending the food back. The waitress mentioned to me the cooks say \"that's the way they grill their calamari,\" so I took her word and assumed it was safe to eat. I should have been smarter about the chicken!!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-12", "description": "You can tell a lot about a restaurant from the restroom sink. Yes, that's true. Don't roll your eyes at me. And there's quite a sink in the men's room. It's a huge stone rectangle with multiple layers in the basin. Bold shades of blue, green and teal on each layer (photo: http://bit.ly/1b8cX29). I remember washing my hands thinking maybe it's meant to evoke the rice terraces in North Vietnam since the painting on the back wall picks up the same patterns. Or maybe there was a sale on really ugly sinks at Home Depot. But that's the kind of design decision that informs this hipster-heavy Vietnamese spot on Polk. It's not that far from Little Saigon, but it might as well be in another dimension for all it has to do with those family-run places.\n\nNo, Co Nam is brought to you from owner Kiet Truong who owns Unicorn (pretty good - my review: http://bit.ly/1e4VBEu) and Region (pretty dismal - my review: http://bit.ly/1g3eCDU). Co Nam is somewhere in between food-wise but definitely in the same family as the other two when it comes to slightly overdone, swank decor. I mean, just look at that sink.  The menu is described as rustic Vietnamese (photo: http://bit.ly/1g3e68Z), but I'm not sure what that means when everything is so impeccably presented on small plates. I decided to try two appetizers instead of an entree just to experience more culinary variety. First up was the $8 Garlic Herb Noodle which was stir-fried in Parmesan cheese and fried shallots (photo: http://bit.ly/18WkKtM). It was no match for Perilla, something tells me the Parmesan cheese is not an authentic touch.\n\nMy second dish was the $8 Braised Pork Belly with Cashew Nut Garnish (photo: http://bit.ly/1g3dMHb). You don't have to twist my arm to eat pork belly, but five slices seemed a bit on the skimpy side, and frankly the ground cashews were an unnecessary touch. I made room for dessert, and the $7 Mango Sticky Rice was topped with chopped fresh mango and cashews and accompanied by a shot of coconut creme (photo: http://bit.ly/1b8dlOd). I liked it, but there wasn't nearly enough of it to satisfy, so I completed the meal with a soothing $7 pot of the Dragon Pearl Jasmine Tea (photo: http://bit.ly/14HuNHh). That did the trick. The service, by the way, was quite attentive without being intrusive. Maybe another visit would make me swoon over the place, or maybe I'll just hang out in the men's room.\n\nFOOD - 3 stars...middling Vietnamese fare targeted to a hipper crowd\nAMBIANCE - 3 stars...that sink!\nSERVICE - 4 stars...here is where they excel\nTOTAL - 3 stars...but the food does not\n\nP.S...Subsequent to my review, the current owner pointed out to me that Co Nam is under new management and no longer associated with Kiet Truong.", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Last month I went to Co Nam for dinner in celebration of a co-worker's birthday. When I first found out where we were going, I looked it up on Yelp and noticed it was a trendier, cute, Vietnamese restaurant. What?! I'm used to my traditional, hole in the wall, casual, bright Vietnamese restaurants. \n\nWhen I arrived at Co Nam, I noticed how small it was. It had a fun vibe going on and it was cozy. We arrived early for our reservation and hung out at the bar - drinks and service were great. After being seated, service was great throughout the rest of the meal. Their food was delicious - we ordered a variety of items, however, I LOVED their basa fish claypot and shaking beef. \n\nI would definitely return and am already thinking of when my next visit will be.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "The Shaking Beef here convinced me to never be boring and only get pho/spring rolls from vietnamese restaurants again.\n\nFood:\n-Shaking beef, aka vietnamese-style filet mignon cubes, magically marinated and tender, basically life changing.\n-Basil lemongrass chicken, the chicken had perfectly infused lemongrass and basil flavors with a side of subtly savory jasmine rice, tasted like culinary mad skills\n-Basa fish claypot, decent but on the more predictable side and didn't stand out  \n-Sugarcane shrimp spring rolls, nothing too unique for $10\n\nVery friendly service, typical SF claustrophobic dining space. Still dreaming of those jizzworthy beef cubes.", "author": "Tian Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "I've been here for 4 times!! Co nam burger is amazing and Delicious!Pattaya salad is fresh ,highly comment to come\nHere with friends!", "author": "Keke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "A colleague and I had dinner there the other night, and we both were very happy! The food was excellent, with each dish having very distinctive flavors, nothing over-powering other dishes. We had a combo of what they call \"Street Food\", which is basically small bites/tapas, papaya salad and entrees. The street food we had included shrimp lollipop (very flavorful), enoki mushroom wrapped in bacon (yummy) and roti (a bit greasy, not the best I've had). The entrees we had included shaking beef (very tender and juicy) and lemongrass chicken (very flavorful), the latter of which was served on a bed of white rice. \n\nThe portions are on the small side for everything, except for the lemongrass chicken entree, which was why the two of us had to order so much food to feel satisfied. Each shrimp lollipop was one ball, so we had to double the order for each, i.e., 4 total. The bill came to just under $90 for the two of us without drinks, so definitely not a cheap eat. However, there are cheaper menu options, if you want to spend less than we did. Our server was very attentive, filling our water glasses very frequently, and another staff member promptly took care of an error on the bill. We liked the ambience a lot, too. It wasn't overly noisy, so we could talk. The restaurant has a trendy but intimate feel for visiting with friends (or even a date) over good food.\n\nWith all that said, definitely recommend Co Nam and will definitely go back the next time I'm in Nob Hill.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "The service is ok, but Not the right place for pho. I ordered one beef pho, and found that the basil and sprouts were not fresh. The beef tastes a little bit wired. And the soup was the sweetest I've ever had for a pho. Note: the chili pepper is very hot. And it is pricy.", "author": "Xuejun L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "We randomly stopped in with a group of five. They were super efficient and fast in their service and getting us our orders. We ordered the calamari, steam buns, and vermicelli. All of it was pretty good. It was definitely some of the best vermicelli I've had in a while.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "My homegirl and I literally spent all day snoopin around trying to a spot to eat for dinner. We both decided we wanted pho, so we decided Vietnamese. We then decided vermicelli, only after looking at the menu for Co Nam. We looked at the pictures on yelp and decided this was gonna be our spot for the evening.\n\nWe called in for reservations at 7 and somehow mysteriously they weren't taken in their computer system. Had they been super slammed and busy this might've caused a predicament. Thank lord baby jesus they were a bit slower this evening because we got sat right next to this wall of moss. I'm a huge fan of plants/animals/earth so once I noticed it I got pretty distracted. On top of this I thought the bar looked incredibly fucking cool, like reminded me of something underground; very low key. Originally when we sat the lights were noticeably bright, I think the owner cruised in and turned them down a bit. That's where things started being really awesome.\n\nOur waiter (forgot if he mentioned his name), was super informed about the menu. Talked us into getting appetisers when we normally don't ever do. This included some pork spring rolls and some Vietnamese street food. Holy fucking shit the spring rolls were fantastic. They were incredibly fresh tasting and balanced with this dipping sauce that was equally fantastic. The street food was several meats and some green onions skewered and cooked up. Pork, chicken heart, something wrapped in bacon, and green onions. Another fantastic treat.\n\nBoth my homegirl and I decided upon vermicelli bowls. She got the chicken. I got the BBQ pork. Neither of us made the wiser decision as they both absolutely tremendous. Super flavorful, and incredibly fresh tasting ingredients. It looked as good as it tasted, so much so the table next to us saw what we were eating, asked what it was, and ordered the exact same thing.\n\nWe also ordered some cocktails while there, the spicy ginger one, the mojito, and I forgot the other two now. I think I got one that was elderberry. A different waiter said the top three drinks on the menu were the most OG drinks on the menu. The cocktails were pretty good, but something is always lost in translation across the use of sake/soju instead of classic liquors.\n\nThis was probably the best dining experience I've had since living in the city. I hesitate to say you'll find a better experience nearby, if at all.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-01", "description": "Food took 45 minutes to come out. Portions not large or particularly tasty. Prices are high. Service was not friendly. It's a shame because the restaurant is really nice looking inside.", "author": "Elliott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Service was a little slow and kind of all over the place but the food did make up for it. \n\nIt took a long a time to get out drinks and appetizers and then when they finally did, they brought the entrees with it too so we had to eat it all together. They also forgot to bring one of our sides, but at that point, it was kind of a mute point. \n\nRe. the food, then that's a different business. The pig ears were strong and the cid was amazing! Definitely recommend the spinach ginger drink.", "author": "Guilherme B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-23", "description": "Food was not that great. \nAtmosphere is nice.\nSomewhat expensive.", "author": "Nitesh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "The pho was amazing!  It reminded me of the pho I had for breakfast every morning in Vietnam.  They give you Thai chilies on the side instead of jalapeño, it added intense heat.  I could eat a bowl of this pho every day, craving it just thinking about it.  Decent wine too, great ambiance and great service. Highly recommend.", "author": "Cari N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "Early dinner here on Saturday night. We made reservations but didn't really need to as we were the first table there. Nice airy space and a bar section. Service was really friendly and gracious right off the bat. The host was great! \n\nWe ordered the devil wings, garlic noodles, Bahn Mi, and beef noodle bowl. Everything was really tasty and the devil wings are actually really spicy! They have a very extensive drink menu which was a nice surprise. It's not in Little Saigon but I thought the prices were reasonable and the food/service was good enough that I'll return!", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "Came here because I saw nice reviews and decor of the bars and restaurants.  Just ordered \"street food\" and appetizers - they were awesome, both taste and presentation.  We didn't order the dinner so I can't say how good the main courses are.  I noticed this place is not for die hard VN dishes but if you want good ambience and fun, hip place for happy hours or small group fun food the definitely it should be on your list", "author": "Tom V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "The definition of consistent. From the food (authentic yet inspired), to the service (warm yet refined), to the ambiance (eclectic but comfortable); Co Nam has it all. Start with some Crispy Rolls and Devil Wings, move on to split a Phà for two (without a doubt the best broth in the land) and finish with the shaken beef (tender and umami). \n\nCapping it all off is the curated beer and wine list.  If your a novice, get a flight. If your a nerd, settle in for a session of Curiexu or La Fin Du Monde. \n\nThis place has it all. So try it, fall in love, and give away your Friday's forever. Because there is enough here to kick the weekend off right.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "This is my go to neighborhood spot whenever I'm feeling Vietnamese but am too lazy to trek to the TL. I was a bit skeptical when I first entered (usually modern decor = mediocre food) but I was pleasantly surprised. On my way to the bathroom I peeked in the kitchen and saw an older Vietnamese lady behind a giant pot of broth. \n\nThe bun rieu here is legit for being a non hole in the wall in city.", "author": "Christine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Great meal. Had some surprisingly authentic dishes and ingredients that are hard to find in most Vietnamese restaurants - definitely not something that was expected at a sorta-trendy Polk Street spot. And the quality of ingredients - especially meat - was much higher than at your typical Vietnamese joint. \n\nSmall place that can struggle to keep up with reservation times - we weren't seated until a half hour after our booked time. \n\nAll in all it's comparable to Mau and Tin, although I'd give this spot the nod on both taste and menu diversity.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "We had a lovely impromptu dinner here on a Friday evening.  First, we checked out their happy hour (half off draft beer wraps and rolls).  We ordered a few rolls, and my fave was the fried chicken and shrimp roll - yumm!  We opted for cocktails instead of beer and our fave was the lychee martini - love lychee!  In addition, we ordered the daily street food special which was breaded beef on a stick - tasty!  And then, once we saw the dessert menu, we had to get the fried banana with ice cream and the mango sticky rice  along with a couple of hot Vietnamese coffees -- we loved both these desserts!  Lots of ooos and aahhs resulted!  \n\nLoved the ambiance of this place with the green glass bottles overhead lamps, pictures configured in a flow on one wall, live greenery on another, and we loved the restroom sink that looked like terrace fields -- wonderful decor all around!  And service was so friendly, understanding and patient answering all of our questions.  \n\nI will be back!  :)", "author": "Maile N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "Basa fish claypot is a classic for any Vietnamese fusion place and this restaurant does it well. It doesn't come with rice or any sides, so I recommend the Jasmine rice, which has a very slight fresh cilantro flavor. \n\nThis place feels trendy, rather than a homey Vietnamese comfort food kind of place. Nice decor and lighting. A combination of after-work and post-workout crowd. No wait around 7:45pm. Would come again!", "author": "Linda Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "We went for lunch and also ordered from the dinner menu.\nStarted out with beef carpaccio and wicked bun.\nBoth were very delicious, but wicked bun had some dried parts of the bun I had to spit out.\nThen we had noodle bowl with lemon grass sautéed beef and 5 spice chicken ban mi with truffle fries. OMG best fries ever.\nFries got cold and it was still crispy.\n\nOverall:\nA bit expensive for what we ate (except carpaccio)\nVery well balanced flavors (really different from other vietnamese restaurants)\n\nWe ended up spending over $70 for lunch but would do it again.", "author": "Yunmi J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Based on the second time of eating here, I still, hands down, think this is the best place in SF for Bun Bo Hue! It's perfection! \nTheir Bo La Lot is also amazing, serving it with 'mam nem' sauce which is 100% legit Vietnamese.", "author": "Van-Anh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "Came here for a dinner when a friend was visiting for nyc. Overral the food was pretty good. Ambience was super dark. Service was poor. \n\nFirst, the ambience. The restaurant has nice decor. However, it was a little crowded (make an reservation!) and very dark. I am not a huge fan of dark ambience as my eyesight degrades so fast in dark so i could barely see the food.\n\nFood: We got quite a lot of food and everything tasted good. The pork belly was the killer. The claypots (fish and chicken) were tasty, although in general the serving size was small. This is not your typical vietnamese restaurant for sure: pricer and smaller-portion.\n\nService was super slow. My fork was dirty and i kept asking for a new one. It is very clear that this place is understaffed.", "author": "Ruxin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "Great food! Shared the vegetarian spring rolls, the pork belly appetizer, the shaking beef, and (couldn't help ourselves) the mango sticky rice for dessert. The service was prompt; the food was hot and delicious. \n\nWe didn't get drinks, but the bill came out to ~$30/person with tip, which seemed super reasonable for the amount and quality of food we devoured.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Love this place! I'm big fan of Vermicelli noodle salads and this place had a great choice of options. I ended up opting for the Lemon Grass Chicken with Jasmine Rice which was delicious. I went on a Sunday night, so there was no wait. \n\nIts a fancy Vietnamese place, so I appreciated the change of pace from the regular whole in the wall type of Vietnamese places. I'd definitely go back with a group of friends and grab drinks and dinner.", "author": "Ebonie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Excellent Vietnamese restaurant. Very calm laid back environment with soft jazz soundtrack and candlelight. The food was excellent as well. Got the seafood fried rice and loved it. Not greasy at all and delicious.", "author": "Rick R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-06", "description": "I came here the other day to get take out and had to wait 30 minutes after arriving (on top of the 15 minutes between calling and walking to the restaurant) to receive my order. I ordered only one dish and after eating a third of the dish I noticed a fleshy wing type thing in my food which could have either been a roach or a discarded shrimp tail. I lost my appetite after that and discarded the rest of the dish. I can't say anything about the dine in experience but be wary of ordering out.", "author": "Ramla M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-05", "description": "Food is quite salty. In particular the pork belly and the fish hot pot, both recommendations of the waiter. The shaken beef was good, very tasty. Service was very slow and with lack of attention to the tables.", "author": "Javier S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "Date & Time:  Tuesday September 18, 2012 @ 1pm & Sunday July 29, 2018 @ 1pm\nDining Companion:  The Husband\nScene:  Couples & Groups Gather Here in Lululemon or Off-the-Shoulder Tops & Skinny Ankle Jeans \nMusic:  EDM & Techno\nDecor:  The Server will Welcome You to this 49 Seat Eatery w/ Recycled Woods & Environmentally Friendly Space.  Sit in One of The Cozy Tables for Two or Bench Banquettes & Enjoy Some Good Food\nService:  Nice Bradley Cooper Dead Ringer & Sweet Server\nImbibe:  Iced & Hot Vietnamese Coffee\nDevour:  Goi Mu'c(Poached Calamari Salad), Ga Nu'o'ng Ngu Vi Hu'o'ng(Grilled Fice-Spice Chicken), Heo Nu'o'ng(Grilled Pork Vermicelli), Pho w/ Steak + MeatBalls & Pork Belly Buns\nTotal:  $48.83 & $51.63", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Excellent service and delicious food! Lovely venue with personal attention to design and decor which creates a welcoming and comforting ambiance...\nAnd they have beignets!", "author": "Alanna Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-08", "description": "They include 20% tips in the check and then put fields for additional tips. So we basically paid 40% in tips (!) and noticed next day when we started to venmo each other", "author": "Mikhail L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "AMAZING. Highly recommend the Beef Carpaccio, Braised Pork Belly, and Spicy Devil Wings. Great food and ambience!", "author": "Jerrin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-29", "description": "We came here during a recent trip to San Francisco since we were in the area and it was one of the few places open around Christmas that had pretty good reviews. We took note of some of the negative reviews and so we came in with slightly lowered expectations. Unfortunately, we'd still have to give this place only 2 stars.\n\nService: The staff was friendly enough and welcoming (as is the case with most San Francisco establishments), however, the service was incredibly slow and inefficient. Perhaps they were understaffed for the holidays, but the waiter/host took a little under 10 minutes to seat us in 1 of several open tables. He chose to spend a lot of time taking the orders of other customers who clearly were not yet ready instead of taking a mere 10 seconds to seat us. We also had to ask for water 3 times before someone brought us our glasses and a few more times in order to get refills. They were also quite inefficient in that each server could only seem to do 1 thing at a time (for example, instead of taking away empty appetizer plates along with serving the main course, they went back and forth multiple times to do each task separately).\n\nFood: The portions were relatively large for the price. My fish pot was okay. It was a little too salty but had a good amount of spice and flavor. The pho that my girlfriend ordered, however was definitely not authentic. It tasted as if it were made with artificially flavored powder packages (similar to what you'd find in ready to eat cup noodles). It was definitely a disappointment and not something I'd recommend off the menu.\n\nAmbiance: The place was very clean and the decor was pretty contemporary, which contrasted with the old cutout photos and magazine pages of Vietnamese culture taped along the main wall of the restaurant. \n\nOverall, I can't recommend this restaurant as there are several other places around the area with Viet cuisine. Just make sure that those other places are open.", "author": "Russell M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-03", "description": "Co Nam must be the Vietnamese term for \"all our staff has run out.\" Made a reservation for dinner and after waiting for 5 minutes for someone to show up to either greet or seat us, I walked up to the bar where I was told to wait by the door. Dude chilling by the door couldn't seem to make up his mind if he worked there or not. We walked out.", "author": "Ash S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Expensive for the portion size. Great food, great drinks. However, I did feel like it was Americanized. \n\nGarlic noodles: nice thick noodle, but it was a bit too sweet for my liking. \n\nEgg rolls: delicious. Can't go wrong!\n\nLemongrass chicken: also very good! Didn't have that authentic taste though. \n\nDrinks: soju mojito comes in various flavors. A tad sweet/syrupy but overall a good buzz.", "author": "Katherine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "I happened to stumble upon this gem because I parked in front of it, and so happy that I did! My bf and I were intrigued by the sign that said \"Rustic Vietnamese food\". It was still happy hour (4-6 PM) when we walked in so we ordered some drinks and skewers off of the Vietnamese Street Food menu. That menu alone is quite unique and something I have not seen before. The skewers had about 5-6 pieces of meat on them and ranged from $3-5. The calamari was cooked perfectly and not overly chewy. The chicken hearts were BOMB! For those that might be scared to try them, they taste nothing like liver or other organs but have a milder flavor more reminiscent of the dark meat of a chicken. Must try! I also ordered the ginger cocktail ($2 off during HH) and it was refreshingly spicy and citrusy but also strong as hell. The staff were really friendly and personable and they made good recommendations. I will definitely have to come back the next time I'm in town to try the burger and the noodle dishes.", "author": "Mymy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "I was impressed is an understatement. The falvors are beyond! We had the garlic noodles and fish clay pot. I'll never be the same again hahaha we will definitely be back!!", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-04", "description": "I honestly quite liked the food at Co Nam and was a relatively regular customer here. I have never written a yelp review before but had to after the horrific customer service I just experienced. I ordered a beef pho through the app Caviar and went to pick it up when the app told me my food was ready. I showed up at 7:45pm and the woman near the entrance told me to wait at the bar because my food was not ready yet. I waited for 15-20 minutes and she finally gave me my food. I took it home and the broth was luke warm and did not cook the raw beef in the soup, making it inedible. I called the restaurant and spoke to Henry and he said I would need to go through the app to receive a refund. When I did, the app's customer service rep said they contacted the restaurant and they would not be refunding me. I called Henry back and was yelled at by him saying that he did not remember seeing anyone waiting and the food was ready at 7:40pm so it is not his fault that it was cold. Before I could say anything back he hung up on me! This interaction was so unpleasant, I will never be returning to this restaurant or using the app Caviar to order food ever again. Henry would greatly benefit from some customer service training and if I were the owner I would seriously consider letting him go.", "author": "Jenny O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "Love the food. Their wicked buns were amazingly delicious and so was the garlic noodles. These dishes made me really nostalgic of Taiwanese cuisines as well since we tend to have similar ways of cooking noodles and buns. Also a great place for happy hours: great selection of drinks and appetizers and no crowds before 7pm!!", "author": "Claire Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Great upscale Vietnamese joint. Atmosphere is a bit chic and quiet (may not be popular enough yet). \n\nDevil chicken wings are tasty but a bit sticky. The fish claypot is excellent and was by far the favorite dish. The papaya salad with shrimp ceviche is good.\n\nStaff is friendly and attentive. Drinks are expertly prepared -- Elderflower Martini in particular.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "I'll start of buy saying that the Vietnamese food here is pretty good!  The ambience is relaxed and the decor is very upscale.  The service was attentive and very friendly.  It was a party of 8 of us and they say is 10 minutes to closing, which was very nice of them.  Throughout the whole meal, we weren't rushed at all and my party felt like we could really take our time and enjoy the food.  The pork vermicelli noodle bowl and garlic noodles really stood out from the rest.  The drinks are strong, but unbalanced.  All in all, it was a great meal with great music! I.e. Kaskade, Above & Beyond, Armin, etc...", "author": "Josh S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-19", "description": "Food quality is ok not great, their meat dishes did felt it was undercooked. Their customer service is extremely bad and consistently messes up orders. (went here twice)\n\nProbably would not come here again...", "author": "Edward S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Food is absolutely delicious. I recommend this spot constantly. Take out is also super painless.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "So we just walked out of there after 40 minutes of wait, without any food because the waiter didn't enter our order.  They were super busy and under staffed with just one extremely inexperienced waiter and bartender who is also trying to be a waiter.  Chaos is the only way I can describe how the restaurant was managed - people next to us got their order messed up so they waited another 20 minutes to have it fixed.  The other table waited at least 10 minutes before the lone waiter brought them the menu and that's only because the patrons asked.  People were seated out of sequence.. the food was taking a long time for every table but we knew something was wrong when people who were seated at least 25 minutes after us got their appetizer.  \n\nWhen we called the waiter over to check on our order, and his answer was \"so what are you waiting for?\" Really?!  After we told him to go check the computer and that's when he told us that the order was never entered.  Granted he said he will bump our order to the top of the line, but given that the next table waited for 20 minutes to have the correct food delivered,  we know that top of the line doesn't mean very much and left.\n\nThe waiter's excuse is that they got busy.  But I've been to restaurants where they were under staffed and still ran quite smoothly because they knew what they were doing.  This is such a pathetic establishment - has a lot to learn to live up to SF standards and anything that resembles decent customer service.", "author": "H. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "Social media tip: check in on foursquare and/or yelp for free thai iced tea, beignets, and wicked roll.\n\nThe free stuff we got - the beignets and wicked roll - were actually the best things we had at brunch.  Wicked roll had pork belly and was fairly delicious.\n\nI ordered spicy devil wings (not that spicy, small portion), my friends ordered the american omelet, and vietnamese omelet - both OK, not fantastic.\n\nGreen tea there is pretty fantastic though.  And apparently the french toast is great. I would return...but order different stuff - maybe try the bahn mi and order a lot more wicked rolls. \n\nNot super busy but our service was kind of slow.", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Our favorite Vietnamese place in SF and exceptionally good value for money. Very attentive and friendly staff too. \n\nDon't miss the garlic herb noodles, Brussels sprout chips, rice or noodle bowl (recommend with beef), but you won't go wrong with anything on the menu!", "author": "Christoffer K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-07", "description": "TLDR: Slow service, small portions, mediocre food. \n\nWalked in, waited a few minutes before getting greeted and seated. Menu is pretty short, so we didn't need much time to decide. Waited some more before being able to get the waitress's attention...both the waiter and waitress were here physically but their minds were elsewhere. Couldn't get their attention even when they walked past to other tables. \nThe food... I'd save my money and would rather eat somewhere else.\nThe waiter's friend came towards the end of our meal, and the waiter, waitress and the friend all chatted it up with the waitress's back facing us. Impossible to get her attention after that until she went to get a sip of her vino. \nWould we come back? Definitely not.", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "Food took forever. Appetizers came in 10-15 minutes, but entrees took almost an hour  from the time we ordered. Granted, we had a large group of 9, but come on.\n\nOther than that, service was decent. Water was continuously refilled for the most part, they weren't stingy about limes/lemons/garnishes, the waiter was responsive.\n\nHowever, when it came to pay for the bill, there were two main problems:\n- Automatic 20% large party gratuity. I'm totally happy and willing to pay this when the food comes out promptly, but we were all beyond starving an hour after sitting down when the mains finally came out.\n- SUPER SHADY $1 CREDIT CARD FEE...PER CARD. Not only is this ridiculously high and unexpected in an Asian Fusion-ish restaurant, but there was no warning whatsoever. We paid with 8 cards, the maximum, but the $1 fees were all loaded onto my card and I wasn't told about it until after my card had been charged. Really weird and left a bad taste in my mouth.\n\nI normally only care about food; service, especially at Asian restaurants, is secondary. But the food wasn't amazing enough to overshadow this ridiculous $1/credit card usage charge without any notification whatsoever. Brussel sprouts, chicken wings and grilled pork bowl were decent. Bo bun hue was mediocre. So...nothing special, especially so close to the Tenderloin and the multitudes of Vietnamese options there.", "author": "Suana W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "We came early and sat at the bar. We got to meet Trong and Henry. The food was delicious and it was a great way to spend our NYE. \n\nWe ate:\n- street food\n- birds nest\n- garlic noodles\n- shaken beef\n- bass clay pot \n- beignets \n- fried bananas\n\nAnd somehow, between the two of us, we seemed to finish most of it. \n\nSide note: cucumber martinis. Purchase 4. You won't be sorry.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "The service didn't work well and we have to wait all drinks and our main course almost an hour. Food taste very good and place is nice. But overall we like the Co Nam.", "author": "Jouni H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-30", "description": "I ordered their Bo Bun Hue and took it home. It was awful. There was a gigantic bone with tons of cartilage. Never Never again. \n\nThe only reason why I'm giving them two stars is because I only tried one dish and they were really fast.", "author": "Colleen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "Nicely done interiors, and a cozy ambience. Ordered Basa fish claypot and Beef sautéed lemongrass rice bowl. Both dishes were very flavorful. They have a good selection of craft beer and cocktails as well.", "author": "Philip T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "the pho here are soooo good it's not like anything other pho i've tried. even my mom liked it and she's a picky pho eater aha!", "author": "Hop N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "This place has the best beef vermiceli bowls. The crispy rolls and pho are also good. Great place.", "author": "Vince M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Good food! Their waitress Kiran is awesome, which made the experience even better. \n\nI got the banh mi and just the bread by itself was delicious and fresh. You know that crackle sound fresh bread makes when you crack it? It was like that. \n\nPerfect portions. At first when the food came out, my American stomach said 'what that's such a small portion'. But hell no it wasn't. It was perfect. \n\nThe Brussels sprout chips were a miss. I don't think they were worth $8. \n\nThe Thai iced tea was a little too sweet for my taste as well.", "author": "D M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-28", "description": "3.5 stars.\n\nI always walk by Co Nam on Polk and wonder if it's any good, since I'm a little critical of fancy Vietnamese fusion restaurants, but I enjoyed the food and dining experience here.\n\nThe service was great - our waiter was very attentive and friendly. I almost expected a hipster-douchey attitude (*cough* Mau), but was pleasantly surprised. We walked in early and were seated right away.\n\nThey have a nice list of wine, cocktails and draft beers, which were reasonably priced. Overall, the food was good with some high and low points, but I thought some dishes were a little on the expensive side for what they were.\n\nCrispy rolls - tasted just like an ordinary fried egg roll.\nBo Tai Chanh (Beef carpaccio) - Good, but lacking in flavor.\nBraised pork belly - Good, well braised and saucy, but the dish could have used an acidic element like pickles, to cut all the fattiness.\nFish Claypot - The fish was good and not too saucy, but this dish could've used some additional veggies or tofu.\nShaken beef - I've had better. \n\nOverall, food was decent and service was excellent. I would go back to try other claypot dishes.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "My husband had a gig next door at Red Devil Lounge so we all (bandmates & significant others) decided to go to CoNam for dinner. We were first a group of 6 which became a group of 10. \n\nAll the tables were occupied already with the exception of a couple that had the \"reserved\" sign on it.  We said we had no reservation but they didn't turn us away. I was immediately impressed. He took a few minutes to review his reservations for the night and ended accommodating us! \n\nWe all enjoyed our orders.  Lots of yums going around the table.  I personally had the beef carpaccio & garlic and herb noodles.\n\nBeef carpaccio: surprisingly good.  Beef seemed \"fresh\" with the correct carpaccio texture. Good balance of acid, sweet and savory. My husband agreed it was very good and he's not huge on raw beef.\n\nHerb garlic noodle: very tasty. Not too garlicky. Good flavor.  Good chewy noodle texture. Very satisfying. \n\nOthers had noodle bowls (some had beef, chicken, and veggie).. All said good. All bowls empty.\n\nAlmost forgot to mention the drinks... I had the elderflower martini. Made with soju and sake. Very light and refreshing. Strong enough to do its job :). Now one of my favorite drinks.", "author": "kate w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-22", "description": "Super Average. The rating is actually a 2.5. Let me break it down.\n\nDecor: Starting with the best here. The decor is very nice. A perfect blend of Vietnamese decorations with a modern decor. Simple yet comfortable seating.\n\nBar: Good effort. Didn't try the cocktails. But the beer selection is a wide range. But that's really yet. If you are serious about your beer, you know this is probably not the place to come to. They have a selection, but any beer connoisseur would quickly dismiss it as mediocre. They're IPA's especially are weak. \n\nService: Again, good effort. Very friendly service and happy to help and make you feel welcomed. But, don't expect great service. To give you an example, if you order two dishes which are pretty much the same, don't expect them to point it out. To give you another example, if you order a dish such as veggie chips, don't expect them to point it out while ordering that it indeed has fish sauce. There's definitely potential here for great service. It's just not there yet. \n\nFood: This department was unfortunately the least impressive. I like fusion, when in fact there is really some fusion. Here is it basically vietnamese food taken down a notch in flavors, spice etc. I would say its vietnamese Americanized rather than any Vietnamese fusion. Some of the dishes we ordered tasted pretty much the same served differently. The whole heart and soul of vietnamese food was missing. Also, don't order the iced coffee expecting the nice little drip. This iced coffee is more...think Iced mocha at Starbucks. Literally the only dish that tasted good, actually great were the chicken wings which luckily was the first one at the table. So that made the evening not so bad. It was all downhill after that and came crashing down when we got the bill. ~$30 per person for which we could have eaten three meals at a great vietnamese restaurant. \n\nIn summary, i'll definitely come back when maybe someone tells me its changed drastically or if somehow I become the kind of person who wants to eat vietnamese food but scared to go to some place in the outer richmond or little saigon. But not for now.", "author": "Karthick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "This restaurant is adorable! I was looking for a Vietnamese restaurant that also had delicious drinks and they delivered! My boyfriend and I ordered the pork spring rolls, bacon wrapped mushrooms, beef lemongrass rice bowl and the banh mi. The rice bowl was my favorite thing! It had so much flavor and the pickled vegetables were the perfect contrast. My boyfriend order a delicious martini and they had a great selection of wines (two different glasses of rose to choose from!). This is a great date spot!", "author": "Jesse F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "This place is dope. Best banh mi chicken sandwich I ever had. Fries are great. Friendly staff. My only complaint is that there was one hidden pepper in my sandwich that was spicier than holy shit. 10/10 will go here again next time I'm in the area.", "author": "Phil I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "I love this restaurant. It's consistently great, fresh food and friendly, efficient service. It's a bit loud and I have to yell to speak to my friend but, that seems to be the trend in SF these days. Love the cloth napkins and nice white dishes. Food is presented in a nice way too.", "author": "Kimberley L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "Thanks for responding, nice to know owners read and accept feedback.  And glad to know you donate leftover food to the needy, I will return just for that reason.  I arrived and sat at the bar around 4pm.  And the shrimp roll could not have been prepared to order as it came out within 2 minutes of me ordering it, she hadn't even poured my glass of wine yet.  I understand siracha is a staple in Asian cooking, but shows no creativity when you just pick up a bottle and squeeze.", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Co Nam is absolutely delightful! The food is impeccable, fresh, and full of flavor every time we've visited (which is A LOT). We've never had a bad experience with service, timing, or the food. It's got a charming appeal, low light atmosphere and really cool photos on the wall. The staff is always polite, attentive, and knowledgeable. Christina (I could be spelling wrong or have wrong name) is wonderful, she's so sweet and has made our experience there even better.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "I tried Co Nam for the first time through UberEats and was pretty pleasantly surprised!  I ordered the Bun Bo Hue (BBH) which was maybe a 8 out of 10 compared to some more authentic BBHs I have had in Seattle.  The catfish clay pot was perhaps a 10 out of 10 - super crispy and the perfect amount of sweet and salty, when eaten with rice. The quail wings were interesting - the sake was a little unexpected and kind of overpowering. I would give them a 7 out of 10.  Overall pretty amazing for a delivery order.  Uber Eats was fast and delivered in about 30 minutes and my food was still hot.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "Stopped by this place for dinner on the way home from work with a friend and thought it was great stop. Really small spot but we were sat right away. We ordered cocktails and pork spring rolls to start. Neither of us were crazy about the cocktails but spring rolls were absolutely delicious! I actually didn't drink mine and got a glass of wine instead which he didn't charge me for.. very nice of them. Definitely get the spring rolls if you need a healthier appetizer. I ordered the pork chop as my meal which were two large chops and cooked well in a light sauce with a side of rice. Definitley cooked well but kinda wish I had something green on my plate... I recommend ordering a side to split. My friend ordered a beef vermicelli bowl and she thought it was delicious but wished there were more toppings and less noodles. I recommend stopping by!", "author": "Aryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Amazing food. The sweet and sour soup is possibly the best soup I've ever had in my life. It's not traditional sweet / sour. It's something amazing! \n\nBe warned this place is often understaffed in the front of house so it could take a while to get your food or be seated.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "This has recently become one of my go to local spots for Vietnamese. I usually take out but the restaurant itself is a tight squeeze but modern and inviting. The food has been a solid experience each time: we have tried and loved the crispy rolls, vegetable stir fry, vegetarian rice bowl, and noodle bowl. I'll be back to try their clay pot dishes but I'm just really happy there is a solid place like this on Polk to compete with the other Vietnamese spots - the variety of menu options is a nice change.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "Surely the most expensive Vietnamese food I've ever had, but it was a pretty good and fun experience. The atmosphere is very cozy, reminded me to places in NYC. \n\nI love the concept of \"rustic\" Vietnamese food. flavors are very traditional but all the dishes have a refreshing and modern twist. I appreciated the full bar, wines and beer variety. Unusual for Asian spots. We had glasses of prosseco, the fish pot, the pork buns and the lemongrass chicken. Everything was delicious.\n\nThe service was great - granted we came at a time when was not crowded. and I mean really great! our server was super friendly and always checked on us throughout our meal.\n\nI loved everything about it - minus the price...I spent 45 dollars (with tip) with drinks, a shared appetizer and an entree. Not happy with the high prices, but again, the atmosphere was great as well as the service.", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Very quaint place with indoor and outdoor seating. Sunday brunch menu was varied and the pork rice bowl was excellent. Prices were very reasonable.", "author": "Andrea G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Basa Fish Clay Pot (5/5) - Served in a sesame/honey sauce that perfectly complements the very lightly breaded white fish, which was cooked to perfection.  Does not come with a side of Jasmine Rice (which I suggest ordering).\nQuail appetizer (4/5) - Split out onto individual serving sticks to make it easier to share.  Good app choice for meat-a-tarians.\nPork Vermicelli (4/5) - Good fresh dish though the cuts of meat were my least favorite part.  If I ordered it again I would try the chicken.\nI would order all three things again (and have already gone back for the Basa fish clay pot).  All in all a good restaurant at a very reasonable price.", "author": "Tyler G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Awesome place, pho was amazing and on my list for top 3. Bartender Caitlyn was awesome and owner was great. Will be back for sure! See you guys soon.", "author": "Marissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Great knowledgable staff!  Street food menu is on fire and the beer selection/cocktail list is as well.  HH specials from 4-6 make this well priced spot a fantastic deal.", "author": "Sheehan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "(See pics) Review #1299. Solid 4+ stars for the delicious Vietnamese food. According to elite Yelper friend Peter L who has the better knowledge of the cuisine, he stated the food was authentic and home style as we were enjoying the dinner.\n\nQuick note on the name. It's actually Co Nam but Yelp has it spelled as Conam.Was not able to find the restaurant directly on Open Table but the link from Yelp was correct. So take note if you try to make a reservation.\n\nBeef carpaccio was crisp and refreshing with very thinly sliced chilled and very red beef, laid out beautifully like a piece of art with scallions, and strips of mint leaves.\n\nThe claypot fish was excellent, a Vietnamese signature dish well made.\n\nSweet and sour soup was not the Chinese style. It had more of a sour taste that kicks up your appetite and was actually a clear soup.\n\nThe green beans, spring rolls and sauteed beef were all tasty and tasted very home style cooking..\n\nThe alcoholic drinks here were on the slightly sweet side but you can definitely still taste the alcohol.\n\nThe dessert soup was more of rice pudding with taro cubes mixed in it. It was a very warm dish and was very tasty without being too sweet. Definitely a great highlight.\n\nThey also served house made Vietnamese yogurt with raspberry as well as blueberries. Each was chilled in a concealed container. It tasted more like a Greek yogurt, as Peter has suggested.\n\nThe hot banana cakes was warm and delicious. Of course a Vietnamese meal is not one without a Vietnamese style coffee. And it definitely was a good drink to keep me wired for the rest of the evening out!\n\nService was very nice and our server was very humorous and tried to answer any questions we had, especially on the restaurant name.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Good drinks for a very reasonable price. Enoki mushroom is very well made.", "author": "G T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-14", "description": "Cocktails were ok but not spectacular. Appetizers were dry and small. Meals were the best bc of the meats being cooked great but still needed more flavor  lemongrass basil chicken was the best out of all. Good restaurant but will not do it again with so many great ones in the area", "author": "Lynda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "The food is delicious here.  Love the claypot fish, eggrolls, sticky rice, and even the sandwich.  Yummy braised pork belly if you want to splurge, but everything is a must try.  \n\nThe decor is quite rustic.  Service is excellent.  We had a big group and everything was served promptly.  Our water glasses were always full which I look for in terms of service.  \n\nWill definitely come back again and already craving for their beef carpaccio.", "author": "Helen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-06", "description": "If you don't know what to get from Co Nam's menu, I'd highly recommend their Beef Carpaccio and Braised Basa Clay Pot.  Even though I live in the South Bay where Vietnamese cuisine is abundant, I wouldn't mind coming back here just for the unforgettable taste and texture of these dishes.    \n\nFriendly service, cleanliness, and new interesting decor also makes me a big fan!", "author": "Bobby L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Very clean beef filet pho, love habanero or spicy peppers instead of sriacha. Awesome fresh veggie rolls (sans noodles), place is by Bobs ;)", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "I've been to Co Nam five times now, and it is reliably very delicious and a fun environment. Great beers, great food. Even was a part of a group that rented out the entire restaurant once, and that was a blast too. Highly recommended!", "author": "David V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Easter sunday comes and I'm randomly in SF, on Polk, looking for a place to eat dinner with other atheist/orphans friends, when we come across this Viet place. Yelp it and good reviews surface, so we open their door and step into the best ending for a great day spent together. \n\nThe ambiance is chill, a bit dark in the back so we sit closer to the window, though the allure of the living wall and dark wood keeps my eyes returning to look towards the rear, slightly wishing we had sat further back. \n\nThe waitress is smiley and immediately on my good side, and as she single-handedly took care of the 12 tables she was on top of our requests, so it was impressive. \n\nThe food - we got crispy spring rolls, which can hardly be bad, and yet these were so good it was like a krispy kreme compared to a regular donut. Then the rice bowls, I had 5 spice chicken, and it was delicious (kudos for having a gluten free sauce replacement). I could only eat half, and so I also get to look forward to repeating part of this experience tomorrow. Def a tasty Viet meal.", "author": "Candace B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-28", "description": "Came here once with a group of friends after a colleague recommended it and found myself craving it the next week so ended up here again for a dinner with my mama when she came into town. Its on the small side, going for a classier Vietnamese vibe. The servers were all extremely friendly and on our mother-daughter date night the server even offered to sample various wines if we were interested in making a wine selection for the evening...which we were!\n\nWith friends we ordered:\nApps:\ngrilled sugarcane shrimp \nshrimp pops\nspicy devil wings- delicious\nMeals:\nbasa fish claypot- delicious\ngrilled pork vermicelli bowl- delicious\n\nWith the mama we ordered the grilled pork vermicelli once again (thats what I'd been craving) and she had the clay pot medley accompanied by a lovely cab sauv. I LOVE this vermicelli bowl, so flavorful. I finished it. I rarely finish anything. My mother really enjoyed the claypot medley as well, which I liked but wasn't as much my vibe. \n\nAll in all- great service, delicious food, apps are a bit on the pricey side compared to portion. Great ambiance for a date night.", "author": "Nicole Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-23", "description": "I really like the food here but unfortunately can't overlook the last 3 times that I ordered food there was something wrong each time. This is a review for delivery only. \n\nThe first time I was overcharged by $25. The second time I ordered the mango panna cotta dessert but it had mold on top. This time I ordered thai iced tea but the milk used had gone bad.  It tasted disgusting and some of it was curdled. \n\nGet your act together co nam!!!  Otherwise I fully enjoyed the wicked buns, vermicelli noodle bowls, and the filet mignon.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "I actually kind of love the idea of americanized cuisine, so I was curious about Co Nam. The place is pretty small (we actually missed it the first time we walked past), but the decor/interior is cute and pretty nice for a trendy date night or girls' night. \n\nFood:\n1) Braised pork belly - delicious, and I personally hate the texture of fat. Very tender and great flavor.\n\n2) Beef carpaccio - not my favorite because the taste was a little bit 'off' overall, but the quality of the meat was there.\n\n3) Medley & basa claypot - Basa did not come with any side of rice, although the medley did. Both were tasty, and the portions were just right paired with one or two appetizers. \n\nOverall, not a bad dining experience. It was definitely americanized, but since I knew that going in, it's not a bad thing at all. The flavors were definitely there, and while it is slightly expensive for Vietnamese food, the decor/interior definitely makes up for the difference.", "author": "Emily Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-15", "description": "I was super excited to try this obviously americanized viet place. It looked so cute and cozy! Lots of friends meeting up and dates, it seemed like.\n\nI was feeling sick and hung over, so I ordered a tomato based noodle soup, and my sister ordered papaya salad.\n\nBoth were.... pretty hard to eat.\n\nYou know how you feel kind of upset when you get full after eating something super so-so?\n\nThat's exactly what I felt...\n\nPlus it was kind of pricy for what it was.\n\nIt was really loud in there, it was really difficult to have a conversation with my friend from across the table and even my sister who was sitting right next to me.\n\nService was slow, but the servers were really nice, I just assume they were a bit chaotic that night. It was surprisingly busy.........", "author": "Alexis P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "Walked to this place as it was near our motel.  The food was very good!  I had the noodle bowl with chicken.  It is a lot of food and very flavorful.  I wanted a beer but wasn't sure which one.  The server was nice and let me try a few of them to help me decide.\n\nThe place has a nice look and the bathroom was clean, which is a bonus.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Seriously the most amazing food and service I've had in San Francisco. The mojitos were so great, I had the citrus one and my friend had the passion fruit so great!! Highly recommend to all, super trendy and great music", "author": "Brooke N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-19", "description": "We were able to score reservations on a Friday night very easily.  I knew maybe it wasn't a good sign.  Cute, updated space on Polk but with great Asian food all around us it fell short.  \n\nOur table shared everything - \nRoll sampler - nothing special\nDaily street food - chicken heart - I didn't try it\nGreen papaya salad - You can't really mess up this classic dish but it lacked a lot of the flavor & heat that it would normally have.  Super disappointing. \nBasa Fish Clayplot - it was just ok  \nBird's Nest - it was just fried noodles - nothing special and lacked flavor\nBrussel sprout chips - standard \n\nNothing stood out and I wouldn't recommend this place - sorry.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-13", "description": "Over price for the quality of the food they are serving. The spring roll was dry and not fresh. Anyway if you are looking for legit Vietnamese food, this is not the prefect spot for it.", "author": "Mikey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Service was SUPERB.  Food was Grade-A.  Got the Vietnamese sandwich and loved how tender and marinated the chicken was! Hit the spot! There were about three other things I wanted to try, so I'll have to see about next time  ABSOLUTELY LOVE THIS PLACE.", "author": "Fawn M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-13", "description": "We used to come here very often, this place was our fav place in Nob Hill but I unfortunately have to update my past review because the quality has decreased dramatically during the past few months.\nI believe the staff changed (have been seeing new faces for at least 3-4 months) and it impacted the quality of the food and the service very badly.\nThe service is now very slow, waiters and chefs are not organized and seem overwhelmed every single time (at rush hours or not), appetizers are served after the entrees are, and the food doesn't taste nearly as good as what it used to.\nTo go orders are now missing at least an ingredient or item 100% of the time, and our last order was terrible: a wicked bun was missing pork belly (how can you forget about the main ingredient?!), garlic herb noodles tasted more garlicky than anything else (couldn't finish them).\nPortions are also much smaller than they used to be. I know covering rent, employee salaries, etc. gets tougher and tougher on the city, but this is in my opinion not a reason why quality should be impacted this much.\nSorry Co Nam, but you won't see us again for a little while...", "author": "Morgan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "CoNam is a somewhat upscale Vietnamese joint with a clean, modern space and pretty good quality food.\n\nAs a fan and often-diner of Vietnamese cuisine, the food wasn't amazing but it certainly was good. I would give the food a solid 4/5 rating. \n\nThe clay pot chicken breast and veggies was good, the spring roll was fresh and tasty, and the vermicelli noodles were reportedly pretty good according to my friends.\n\nI like the ambiance; very sleek, cool, and chic. Definitely a chill place to take a girl out on a dinner date for food, wine, and ambiance. Didn't feel rushed at any point, even though the restaurant is on the smaller side (maybe 10 tables?).\n\nOverall, a cool spot. I'll probably come back again.", "author": "Roy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-13", "description": "The restaurant is freezing. I wore my coat and scarf the whole time. They couldn't close the door because there was a ventilation problem, but this has been going on since I first went there months ago.\n\nOn the food side \nWicked buns - fantastic, don't go without ordering\nCalamari salad - meh - it isn't pan fried or grilled so tastes a bit slimy, although is probably quite healthy\nChicken liver street food - pretty good\nShrimp lollipop street food - good", "author": "Lizbeth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Absolutely fantastic Happy Hour from 4-6pm on weekdays. $2 Off Draft Beers and 25% off Appetizers! Applicable at the bar or for dine in- fabulous!", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Best Pho my partner and I have had in ages. Definitely check it out if you are a fan of Vietnamese food!", "author": "Ben H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-02", "description": "I had just helped my friend move into her new apartment in Nob HIll and we were starving and wanted to try out a new restaurant nearby. We saw Co Nam and decided to try it out.. We came on a Saturday afternoon around 3:00pm and it was a bit empty. \n\nOur waiter seemed really busy for some reason, although there were only 3 other tables seated. Once we sat down, we checked in on Yelp and saw that there was a special for a free Thai Iced Tea and when we told our server we wanted them, he told us to hold on and ran to the back. We thought this was pretty rude since he had just come over to our table to give us the menus and we weren't asking for a lot. \n\nAfter taking our orders, he came back and told us 2 out of the 4 items we ordered RAN OUT. The 2 items were a banh mi (vietnamese sandwich) and bone marrow. How can you run out of a sandwich at 3pm on a Saturday?? We decided to order crispy rolls instead. We waited and waited for our rolls and they never came! We had to remind our server that we had ordered it and he went to go check on it. \n\nI'm giving 2 stars because the service was not very attentive, they ran out of certain items on their menu but didn't note it, and they forgot one of our orders. \n\nI'm not sure if I will be coming back here...", "author": "Monica W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-17", "description": "Overpriced and underwhelming food and crappy service. My fiancé just said he wishes he could go back in time and go anywhere else. I second that.", "author": "erin l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "The food is good and reasonably priced. Fresh roles are delicious and they obviously use good ingredients.\n\nService was poor - I was sat for 10 minutes without a menu, had to ask for water repeatedly and my plates weren't cleared even when I settled check.", "author": "Emma D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-21", "description": "Exceedingly slow service and mediocre food.\n\nHave been eyeing the place for a while.  Had good impressions upon first entering the restaurant: clean, minimalist decor, cool music, trendy atmosphere.  We started with the broiled shrimp roles which were somewhat flavorless unless you soak them up heavily with the peanut sauce. The papaya salad (with tofu) was fine -- nothing to rave about but also nothing wrong with it.  For entrees, we had fish clay pot and a bird's nest noodle dish with seafood.  Both were just ok.  Flavors in general a bit simple and bland for my taste; I generally expect more layered and herbal accents with Vietnamese food, but I understand that they are probably catering more to the hip and fusion food crowd.  Price was high for the food.\n\nMy main gripe was the exceedingly slow service.  Food came out very slowly.  Water was unfilled for most of the meal.  On the weeknight that I went, there were two wait staff (one or both doubling as bartender) and a busboy (whom I saw rarely -- suspect he was working in the kitchen too). They just looked really overwhelmed for such a small place. Don't think I'll need to visit this place again.", "author": "Ray H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Had the skewers (Chicken hearts and liver) which where pretty tasty...the Bun Bo Hu is probably the best hangover remedy I've had, vertu flavorful broth base..\n\nSmall spot but will definitely come back", "author": "Cam V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "This is a trendy Americanized (and priced) Vietnamese place. If you want something more authentic, go south on Larkin and pay 3 bucks for your smelly plastic seat.\n\nThe wings were phenomenal. The street food was great. I service was fab and I can't wait to try more off the menu!", "author": "Monika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Best Pho I've had on this side of 19th Ave! :) Everything we ordered was just savory & tasty! I wish I could've tried more items on the menu!!! Will definitely come back! Thanks for the recommendations Henry!", "author": "Carol J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-11", "description": "Decided to come here for an early dinner Sat eve (6:30PM) with bf.  We started with the sugar cane shrimp which was mediocre - it was basically two rolls with scant shrimp (and it was pastey shrimp versus real shrimp) and all we could taste was lettuce and dough.\n\nNext up, I had the veggie stir fry with tofu - meh, nothing to recall and I thought was overpriced at $14 for tofu and veggies.  Could've added some garlic/ginger and a more exciting sauce? You know, caramel soy or something?\n\nBF had the sautéed filet mignon which was really confusing because it was sautéed with french fries (not freshly cut - the frozen kind since they were dry and lifeless).  It's the strangest dish I've ever seen in a Vietnamese restaurant that's for sure.  You had to mix some sauce with salt and pro it over and even then it's still confusing and why would you want to stir fry filet mignon till it's grey?\n\nI had an interesting experience in the bathroom where they had a sink hole strain/drainer that was plugged up and caused standing water in the sink.  The drainer looked like someone had puked in it so I had to let the manager know about that.\n\nThey seemed to have spruced up the decor compared to the previous Moroccan restaurant that was there but you can see it was a minimal investment.  \n\nLook, will this place stay in business? I think it will, at least longer than the previous two restaurants at that location.  What bugs me is that it's just mediocre food at jacked up prices in a hip decor so it will attract a young Polk Street crowd.  I'd be off elsewhere before I come back here to again.", "author": "Favoloso M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-26", "description": "All anyone wants when they go out for dinner is to be unknowingly served something they have told staff they are allergic too. AMIRITE?\n\nI battled with what rating to give this place, but ended at a 2.\n\nThe food and decor was nice enough, but a fundamental service error really took over the whole experience.\n\nA group of us ordered the 'selection of rolls' entrée and my friend confirmed when ordered, and when placed on the table that they didn't contain shellfish as he is allergic. I was in another conversation and saw him eating the crispy rolls that I remember on the menu saying they had shrimp in them.\n\nThere was obviously a bit of concern at this point, as a shellfish allergy isn't like a headache, it leads to hours of vomiting. We told the next waiter who came over about the error, and he said sorry it is her first night. (Which didn't actually seem to be true because she knew the menu back to front and took our oder for 7 people without writing anything down). He then asked if we wanted to order something else (LOL). They made no compensation for a pretty massive error. \n\nIt's important to note this wasn't a picky SF eater - we weren't requesting kale grown while having nursery songs played to it, its a stock standard allergy and something restaurants should really be competent at dealing with!", "author": "Mitchell S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Simple, clean and healthy dishes in perfect proportions that are not overpriced. I think that sums it up.\nGot the Squid street food $3\nBanh Mi - AMAZING!!! - $11\nChicken hearts and liver - $3 each. Chicken hearts were good, but liver a bit too strong.", "author": "Dhruv L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "The best shaken beef dish in town. And that's saying something, given the competition. This is the spot for great food and positive service. A highly recommended experience.", "author": "bryan o."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "This 1 star is for service.\n\nMy gf and I entered into a reasonably busy dining room, and didnt get seated for 5 minutes, we just stood there awkwardly. When we were seated, we became ghosts. The host (Manager/owner?) walked away hastily as soon as we were seated. 15 minutes go by and hes chatting up the table next to us and seemingly glad handing them. \n\nI have no problem with that, in fact I like it when the staff goes an extra mile to make customers feel welcome, but not when im seated next to them and havent even been given menus or water after 15+ Minutes.\n\nAfter I stop him as hes walking past me and get the menu/drinks, I wait another 10 minutes before I have to literally interrupt him as hes striding past our table to place the order. By this time the restaurant was empty so there was no reason to believe they were busy. \nThere were several other staff hovering around the back area, so im not sure why neither of them helped. \n\nThe food was ok, the buns were good  but it would have been nice to have been offered 2 or 4 buns since 1 order gave 3. Our table was only 2. (Some restaurants will do that) \nThe bun bowls were tasty, but overpriced. \n\nOverall the food was good if not overpriced, but the service made me feel like I was unwelcome. Chopped liver. It doesnt make sense to have to beg a restaurant to take my business.", "author": "Justin I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "Hands down this is one of the best restaurants in SF! \nMy husband and I eat here at least once a week! The food is always top notch and so is the service. We have come to know everyone who works here and we feel like and are treated like family when we arrive.\nWe highly recommend the wicked buns, garlic noodles, filet mignon and french fries, and definitely the beignets! Price point is spot on for the food.\nGood for a nice dinner or group dinner.", "author": "Melisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "Delicious, over priced comfort food. Not sure if it's worth paying for such humble ingredients, but it was delicious.", "author": "Ana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "Pleasantly surprised.\n\nFirst off, forget about Pho, this place doesn't have any. Still want good/trendy Vietnamese food while you're out on Polk? Co Nam's definitely worth a stop.\n\nWe ordered the filet mignon skewers, a beet salad, and two different soups. All were delicious, filling and fairly-priced. The service was top notch. Attentive, fast and pleasant, no complaints there.\n\nDo note the place can get really loud, so if you want a quiet dinner date, skip Co Nam.\n\nAll in all, a great little \"higher-end\" Vietnamese place with good food, fair prices and good service.", "author": "Teiki K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-06", "description": "Went for lunch and had the Vegetarian Spring Roll - one of the best spring rolls I've tried. Then ordered the Grilled n' Marinated Japanese Eggplant Carrot - it was so flavorful. (Keep in mind it's small so order to share as an appetizer.)\nGrilled Five-Spice Chicken - if you've ever been to Cordon Bleu Vietnamese Restaurant on California Street this will sound familiar. This is just a fresher, probably more healthy, version and I loved it!", "author": "Jenna P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-28", "description": "Had dinner here on 9.27.14. Food overall was tasty but nothing too remarkable, though the duck heart was a treat. I would return to try other dishes.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-08", "description": "The decor is nice.  The food is ok, but nothing special.  The prices are high compared to most Vietnamese restaurants.  \n\nI ordered the mussels entree.  What they brought was really more of an appetizer.  It was six (sm/one bite) mussels on the half shell, no rice or anything more so it wasn't filling, and I sat there starving watching everyone else eat (the pictures shown here have mussels about twice the size).  I feel like either the description should be changed so you know what you're really getting, or the waiter should have warned me that it was such a small portion.  I was pretty disappointed in this place.", "author": "Tonie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-29", "description": "This place was good. I went with my boyfriend on Friday, and the decor and service was awesome. We had a super-friendly host and waiter. The food was so-so, if only because I am not a courageous eater. We got bahn mi (which was great), and some kind of soup with ox tail and blood sausage (which grossed me out, but BF enjoyed), and the filet mignon in sauce (again-- just OK).\n\nWill probably go back and try out some less-interesting dishes next time we're on Polk.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "My girlfriend has a proud and profoundly refined aesthetic, and we often let decor and design help drive our restaurant choices.  The very first thing she uttered on clearing the doorway of Co Nam was truly high praise:  \"This place has the best look of any restaurant I have seen in this city.\"   \n\nThe look was composed of several distinct features: a lush, deep brown wood slat wall on one side; a beautiful three-dimensional (living?) green wall in the back that was cut into a pattern resembling the aerial view of Vietnamese rice terraces; and a diagonal array of old portrait and landscape postcards on the wall behind the tables.  Even the sink in the bathroom was unique, as the bowl was carved into the shape and painted the colors of rice terraces.  I have a special fondness for rice terraces.  One of my companions thought the sink was impractical:  Oh well, it worked for me, putting form over function.\n\nThe food here is solid as well, offering pleasantly divergent renditions of classic Vietnamese cuisine.  Take the cool and fresh spring rolls packed with shrimp that had been grilled on sugarcane, a truly sublime preparation that I make a bee-line for each time I go Vietnamese.  We loved our bun, a large bowl of rice noodles buried under a plentiful portion of grilled pork and topped generously with the requisite julienne of carrots and cucumber and crushed peanuts, all doused in nuoc cham.  \nOur second entree, a chicken and green bean stir fry with ginger and coconut, had great promise but underwhelmed us due to the insufficiently aromatic sauce.  \n\nOther menu items that looked good but didn't make the cut on our first visit included the grilled mussels and the banh mi.  Another sojourn to this Russian Hill spot may be in the works for the near future.", "author": "Derek W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "Very friendly and attentive waitstaff, nice interior. I had the Chicken Claypot - delish.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-03", "description": "Came in for a late dinner on a Friday night. While the ambiance and service were enjoyable, the food just didn't impress me.  We tried the steamed pork buns.  Anything with pork belly should be dripping with flavor...this was not.  We ate them, but they didn't really do much for me. \n\nNext was the claypot medley which also was in some desperate need of some flavor.  Loved the ambiance but hoping for some more impressive dishes if I make a return visit :)", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "We enjoyed a delightful dinner date here. All the food was great, there is not a single thing I wished was different at all. We had the Wicked Buns, I could eat hundreds of them. We had the devil wings, also spot on and I really liked the basil that was sprinkled on top of those. For entrees we tried the Shaken Beef and the noodles with pork. The beef was so tender and flavorful, it came with a salt, pepper, and lime dipping sauce that I totally plan to copy at home. The cold rice noodles where refreshing, but I want to go back to try their fried egg noodles.\n\nGreat ambiance and service. I would recommend this place to my foodie-est of friends!", "author": "Halley S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "I usually never write Yelp review but my god was my experience here abysmal. My girlfriend and I popped in here for a quick brunch. With the restaurant less than half filled, we were promptly seated and waited to quite attentively. We ordered the beignets and Vietnamese iced coffee which were quite good. Things quickly went downhill after this however. \n\nWe ordered the Bun Bo Hue and the chicken rice bowl with a crispy roll on top. They ran out of Bun Bo Hue -- no big deal, we substituted with a banh mi. After about 30 minutes of no food, we started noticing that guests who were seated after us were being served. It was then that the waiter informed us, unapologetically, that the kitchen lost our ticket and to reconfirm our order. That's it. No \"I'm sorry for keeping you waiting\" or anything. \n\nAnyways, at this point we're still trying to be understanding. Things happen, we'll just be patient. Our food finally came out after an additional 30 minutes and our patience (and hunger) was just about to give out. Again, fine; things happen we just wanted to eat and get out and on with our day at this point. However, the chicken rice bowl with crispy roll on top that was given to us was neither a rice bowl (had vermicelli) nor did it have a crispy roll. You would think with an hour plus to get the food out you would at least check to see if the order was correct. \n\nI'm just frustrated at this point and try to grab the attention of the waiter, who takes his sweet time getting here. I explain that hey, the order was wrong, it's been an hour plus since we got here and I just want to pay for the beignets and leave. Again, the waiter was very unapologetic and gave excuses that the kitchen staff has language barriers and that brunch was very busy -- it was less than half full when we got there!! I'm just so livid at this point I have lost all appetite completely. We left without even touching the food, the only small redeeming portion of this experience was that we were given a comp on the coffee and beignets. \n\nI'm very frustrated because all the other reviews indicate great service and food, and the food really did look delicious! I wish I could have given it a real try but at this point I no longer can give this establishment my business, and I strongly discourage anyone else from doing so as well.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Wow! This place was the one restaurant we visited twice while visiting San Francisco. Andrew, our server, not only recognized us, he paid for our \"wicked buns\" which were incredible! The best banh mi I've ever had. So nice, so good, so worth it. Also, while you are here, try the clay pot medley. Insanely delicious!!!", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "Big disappointment in the food!! There's no mushroom in that bacon mushroom wrap. The service was bad and the server was arrogant. The bacon was so thick and greasy that it just ruined our appetite for the entire meal. Not coming back again. Plus this place people don't really wash their hands either as there is no soap in the bathroom. When I asked for some, Henry the douche told me that their workers don't wash their hands before cooking. I am highly concerned about the cleanliness of this restaurant. Now I just am very disgusted after eating here. Stay away from this restaurant unless you want bad food bacteria infection.", "author": "Yumi Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "Service was earnestly friendly and well-intentioned but still frustrating enough to dampen the evening. All servers, at the behest of their manager, refused several requests to close the door to deal with a cold draft blowing through the restaurant, table surfaces were left sticky with menus placed on top of them.", "author": "katherine c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "I work down the street from here, but had never thought to go in for Lunch.\n\nI was pleasantly surprised last week when some friends and I stopped in. We all selected one of the cold noodle bowls, and it was honestly the best dish I've had for a quick lunch in a long time.\n\nOur sever gave us fresh beers when the ones we ordered were running low on CO2, and was super friendly. \n\nIt ended up being a little pricey ($70 lunch for three of us with a drink each), but was super delicious and I will be going back.", "author": "Kayla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "Co Nam has SOLID vietnamese food. Their garlic noodles are delicious. Their claypot with the chicken medley is also really yummy. I liked their basa fish claypot as well as all of their appetizers.\n\nThe decor is really modern and love the wall in the back. Service the three times we have gone has also been rock solid.  I'm so glad Co Nam opened up on Polk!", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "I've been to Co Nam a bunch. The food is awesome. My last experience there, I was seated at the bar. If I had a choice, I would have avoided it knowing what I know now.\n\nI'm not sure if it is the length of the bar or the person serving the bar BUT the service was horrendous. My friend and i was sat at the end of the bar and the woman couldn't hear us order, it took 30 minutes before we could even order a drink. My wine came after I already finished my meal. The man next to me ordered take-out and he was there an hour before we even sat down, waiting to be helped (I was ear hustling).\n\nAnyhow, don't be discouraged by this review. If sat at a table, no worries, great attentive service. The bar on the other hand... its a no go. \n\nThe pork chop, beef carpaccio, and the fried banana is my favorite dishes.", "author": "Kaylie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "My go-to restaurant for Vietnamese \"street\" food and bun bo hue.  The wait staff is friendly, capable and they have excellent beers on top (read: Fin du Monde).", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-05", "description": "Pleasant ambience and friendly staff but very disappointing food - all of our dishes were extremely sugary and it's much more of an Asian fusion than Vietnamese", "author": "Róisín D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-19", "description": "Service was not great, the waitress forgot two of the items we requested (hot sauce and my husband's sake).  Overpriced Vietnamese, the waiter recommended the Filet Mignon but it basically was a plate of French fries hiding the limited filet in the dish.  Cute décor.", "author": "Alicia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "My bf took me here on a date on a Thursday night and it wasn't too busy. We ordered a  couple appetizers (the shrimp spring rolls and the pork belly served in little steamed buns). Both were pretty good. For my entree, I ordered the fish clay pot (thanks to other yelp reviews) and was not disappointed. Service was good and the food was tasty. They also have a nice selection of beers! Bonus points for its location on Polk Street!", "author": "Leana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "I was on a mission for a rice noodle bowl and some five spice chicken (some comfort food) last Friday night. I wasn't feeling good and that usually fixes me up. So when I found this place (off Yelp) I was excited to give it a try. Plus it was close to me (location) at the time. \nFirst off the decor was very unique with the chandelier being a carrying pole (Yoke) filled with illuminated, clear glass bottles. The \"living\" wall with different colored/varieties of moss in a very organic pattern. Love the rolling ladder at the bar. And the bathrooms were clean and that sink..so cool! Needless to say I thought the place had great feng shui. \nSecondly, I was greeted timely and with a smile (I can't tell you how many times I see employees \"put out\" by simply doing their job). The bartender was knowledgeable about their cocktails (and every liquor/spirit/sake they carried) and was quick to produce them. \nBut then...oh boy, my food came :) Smelled just as I was imagining it to be. Good size portion of the nouc cham and the 5-spice chicken was moist and flavorful. Egg rolls that came with it (had to order those extra, but so worth the $2) were rolled tight and were flaky not chewy, like so many are at other places! \nOverall I give this place SIX stars for doing everything right. Nice job guys/girls, I will be back!", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "This place is amazing!  We stumbled in here and were greeted with genuinely great and kind service and wonderful, personal food.  We really enjoyed everything we ate, and the prices were low.  Can't wait to return!", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "Very much enjoyed my first dinner here this past Wednesday.  I absolutely love the décor and vibe of this restaurant.  The walls, bar, lighting and Moby like tunes playing in the background all make for a great mood to dine on tasty Vietnamese food.  The crispy rolls were a great appetizer and I also tried the shaking beef as an entrée which comes on a bed of greens and no rice or noodles (exactly the dish I was in the mood for, it was quite nice).  \n\nThe service was fantastic, around when you needed them but never pressured us through our meal.  I will definitely be back, and definitely recommend.  My one suggestion for improvement, this restaurant seems too nice to be using paper napkins.  I noticed that at least one person from each table around us, (including me at my table, oops!) dropped their paper napkin from their lap at one point.  The paper ones feel way to \"fast foody\" for a place like this.", "author": "Janelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "It's one of the better restaurants on Polk. I went for a small birthday dinner for 8 people and they were super nice and accommodating. The place is small, but perfect if you want to have a nice, modern place to eat then go out to the bars on Polk.", "author": "Tessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "We love the spicy soju martini! And their cocktail lists are delicious'\nFood is fresh and affordable. Highly recommend !", "author": "Katie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Had a birthday party for the wife here a few days ago. The Staff was teriffic, the kitchen kept the rest of the tables running as our party of 10 was served without delay. Very impressive and very responsive. Just an e-mail set the plans up and they were ready for us as we arrived.", "author": "Brendan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Great flavors, great atmosphere, awesome staff! I definitely recommend this place if you're looking for your fix of some hearty asian noodles. Everything tasted super fresh. I can't vouch for their brunch food because I didn't try it but I'm sure it's also delicious. Don't hesitate to give this place a try. Only downside was that they were understaffed and it took a long time to get our check.", "author": "Isabel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "That shaking beef.... I could eat just that, but everything else is yummy too. Except spring rolls are nothing special, better spring rolls at Zadin in the Castro. Pricey and worth it. Unique decor, really pretty. That will be my new go to restaurant in Pac Heights / Nob Hill. And go with friends so you can order and try lots of things on the menu. On par with Out the Door on Bush/Fillmore and Zadin. Yummy!!!\n\nAlthough they need to hire another server, there were only 3 people working the front, tables and bar tending on Saturday night. Don't go in a big hurry. But really awesome, highly recommend.", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "I really wasn't that impressed by this place. This feels very much like a dressed up vietnamese restaurant. Everything in the restaurant is black and they played lounge-y type music. I don't recall a dj :).\n\nI had the beef noodle soup and the veggie rolls to start. The beef noodle soup was alright, it wasn't super hot. It was alright. It wasn't terrible impressed. A couple of friends ordered the veggie stir fry, they definitely weren't raving about it. Was expecting more but just got your standard vietnamese food experience with a little more decor than what you'd find normally at a place in the richmond.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Delicous!! Fish claypot, street food calamari, green beans, shaken beef, veg spring roll!!! Sparkling lychee and mango drinks were yummy too!", "author": "Chris V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-06", "description": "The food is good but takes forever. The service is horrible and the attitude of the guy who served us was TERRIBLE! Not even gave us water after sitting there for 30 mins. We waved to him for couple times trying to order but he ignored us. Overall, the food is good but the service ruins everything. Never go there again!", "author": "Evelyn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "Went here for dinner on a Thursday night. We had a big party, about 10 of us. The space is small so our group took up most of the space in front of the restaurant. \n\nWe shared the rolls sampler = $21 and it was about one roll cut in half of each roll. The rolls were ok, we managed to get everyone one half roll. \n\nWe also ordered garlic noodles and the pork belly buns as appetizers. both were delish but the serving size of these as appetizers was not enough for a group our size. The pork belly buns wee 3 for one order so we couldn't share this among 10 ppl. the garlic noodles looks like it would be good to split between 2 ppl at max? \n\nAs for drinks, I got the elderflower martini which was light and crisp! I really liked it. I think all their soju/sake martinis are worth getting for all the unique flavors.\n\nFor my entree I got the basa fish clay pot with a side of brown rice. The fish was very flavorful and I added the extra chilis which were served on the side so that gave it an extra kick. Would really recommend getting a side of rice as the sauce the fish is simmering in is great to mix up in your rice bowl. \n\nOverall our group split bill came to about $40 -$50 per person and that incl. tip and tax. I think its a bit expensive for vietnamese food but it has a nice ambiance and it's a nicer vietnamese place to take a date right on polk st.", "author": "Christine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "I been here several times, however, i never get to write a review about this restaurant. This is my first review in all time. =) Anyway, i really like the environment of this restaurant. the layout is cute and very modern.  Importantly very clean so is a plus. \n\nAs for foods, Most of the stuff i orders was good, however is not a typical vietnamese foods I thought it would be.  The services is very friendly and very welcoming when I walk in. There is small selections of cocktails but the one so far i like is blue geisha, is light and somewhat fruity cuz of the lychee.  In addition, they have lots of different types of drinks for people that doesn't like cocktails as much. \n\nI would definitely come back to try other dishes that they have and also their cocktails!", "author": "Lala B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-15", "description": "Being just north of Little Saigon, Co Nam really should step up the game.  I was more than slightly resentful that I was paying $13 for a \"grilled pork noodle bowl\" when I could have had a better, cheaper version of \"Bun Thit Nuong\" at several other places within blocks of Co Nam  I know, I am the one who went there, but ambiance shouldn't cost more than good, quality food.  What also peeved me, is that i almost choked on the grilled pork.  It was in much larger pieces than most Vietnamese places, much tougher and had a lot more hard fatty pieces. Not cool.  Normally I eat all the pork and then work on the vermicelli, but this time I ate all the vermicelli and left the pork, and I never leave pork.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-20", "description": "came here with my friend, because HOPR was busy so we ended up walking over here. \n\nas soon as we walked in, they said 'sit where ever you want..' (if I am going to pay that much for Vietnamese food, you better have your seating arrangement correct) we sat for a 10 mins, and still NO MENU we ended up just grabbing it ourselves. (i think they should open up shop in the TL they will feel right at home)\n\nwe ordered: \n\nBo tai chanh: platted very nice, but the flavor was alright, need more onions and basil. \n\nclay pot catfish: this was pretty delish cat fish was soft and sauce was perfect. \n\nbun thit nuong: save your money. \n\nOverall? for the price? service? food? Save you money, because Vietnamese food itself is very inexpensive and to pay this much for weak service and for food that is hit or miss, it's just not worth it.", "author": "Zane T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Tried this new Vietnamese place on Polk and I was pleasantly surprised.  The place was nicely decorated and service was good.  I only tried 1 dish since it was lunch.  The bun Rieu was very authentic and tasty.  It's the best I've had at a restaurant.  My husband had a cold noodle salad with grilled pork and that was tasty too.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Wow! Trendy but simple interior welcomes you.  The dishes pop with incredible flavors.  The shaken beef is the most delicious I've had, with lean cuts of filet mignon and a simple DIY lime pepper sauce.  The pho used the same lean filet cuts, and is great on western palates (they steer clear of tendon and tripe). The Brussels sprout chips were a great surprise.  The papaya salad wasn't as spicy as I'm used to but very tasty.  Everything was clean, complex and delicious.", "author": "Dan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Came here for Sunday brunch. \nBEST FRENCH TOAST EVER! \nTheir bloody Mary is really good too. Staff was nice and attentive. Overall great experience and food. I'm glad the had display food on the table out front to draw us in.. Definitely will be back!!", "author": "Mia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "Came here on a Tuesday night. Called ahead and was promptly seated. Food is good. We had the shaken beef and the lemongrass chicken. My main food gripe was that my shaken beef was room temp by the time it got to me. Normally I would have sent something like this back to the kitchen but that would have meant I would be left wondering if I would ever get my dish back. Service was horrendous and I really don't know what was the cause of it. Lack of anticipation of how busy it was going to be? Staffing issues? The poor lone waitress and lone bartender were busting their butts and serving the entire restaurant. It's not a huge establishment but we waited forever to place our order. And to get our drinks. And to get our food. I asked for the bill right away not knowing when I'd be able to flag the waitress down. No one ever checked on us during our meal. The hubI would have gladly ordered more drinks. The waitress was obviously very stressed and short with each interaction she had with us. \n\nOh, and if you have kids, leave them at home. The place isn't very kid friendly. In other words, no high chairs. Waitress looked at us like we were idiots when we asked for one for our daughter. \n\nPlace definitely has potential but I don't know that I'll be going back any time soon.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "Solid spot. I was craving some Vietnamese food, but Out the Door was booked solid. \n\nSeating is limited so they stagger the tables, so best to reserve a spot before you head over. \n\nThey have some interesting cocktails - I had the Co Nam, which had some egg white in it and some other stuff I couldn't figure out. Pretty good though and stiff. \n\nFor dinner, I had the Beef Vermicelli bowl, and the wife had some mixed veggie plate. Both were pretty solid.", "author": "Count C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-01", "description": "The price is not right, in this case. The food we had was just good (the bun bo hue) and OK (the basa claypot,taste was fine but fish was too soft and gooey), but the price would suggest better than good vietnamese. $15 for a bowl of bb hue, when i can get a bowl that's just as good at Pho Vietnam just down the street for about half that. So you know, we eat Vietnamese frequently and last year went to the source. So we know street vs upper end, etc. The issue with Co Nam now is it's caught in the middle. If they want to nail the mid-scale then the food needs to be both better than and more creative than the very high quality traditional (and cheaper)  fare you can get at Pagolac, Pho Vietnam (esp the soups), and Golden Star (killer 5-spice chicken, etc). \n\nTo calibrate, if the price was cheaper and the food the same, they'd get 3 stars.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Good food, but the service is lacking. Our waiter disappeared for quite some time after taking our drink order, and we eventually had to waive someone else down to take our meal order. Based on the disorganization of the service, I'd be surprised if our experience was an isolated incident. I'd find it hard to justify the prices based on the experience.", "author": "Kate T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "I crave the poached shrimp spring rolls all the time!! Not only is is so fresh but savory. the pork belly this evening just melted on my palate! \nMy BF always gets the lemongrass basil chicken entree, soooooo good! & I've mixed it up with the clay pots but my go tibia the rice bowl with the chicken or pork. The service is always terrific and attentive! Its our neighborhood gem!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-13", "description": "Great option on Polk, but a little pricey and slow for my liking. Food is decent though -- would recommend the filet with potatoes, the lemongrass beef noodle bowl, and one of the claypots. Their cocktails are pretty good, particularly the Spicy Cocktail.", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "Was so disappointed in dinner last night at Co Nam. Used to be a favorite go to restaurant. But last two times, I have taken friends or family and the food has been served cold and way over seasoned. The people that I have taken were not impressed. What a shame. None of us will be returning. I was hoping since I haven't been in awhile, the last visit was just a fluke. But same issues. Food not served hot. And too salty and over seasoned. Friendly waitress though. It's too bad.", "author": "Alisa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-15", "description": "I noticed this spot pop up a few weeks ago in my hood and was curious to check it out.  Finally went for dinner with a couple friends and.....I hate to say it but there's just something off about it!  \n\nWe tried a couple apps which were mediocre as well as the veggie vermicelli and the filet mignon entrees and they were both very average.  The vermicelli was okay, not amazing and the filet dish was served cold, which was a let down.  \n\nThe place was pretty dead when we showed up around 7ish and picked up a bit in the cpl hours we were there. This place has potential as far as location and ambiance goes, but definitely room for improvement on the food.", "author": "Gohar J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-24", "description": "Nice decor.  Took over the space from an Indian restaurant that didn't do well.  Walked by many times but finally decided to give it a try.  Just ordered a beer and a variety of appetizers.  Got the grilled mussels, sugar cane shrimp, pork belly, garlic noodles, fried shrimp pops and chicken wings.  Went during Happy Hour and got the beer for $4 a glass and 25% off the appetizers.  Forgot to redeem a free check-in deal for free iced tea.  Next time.  \n\nThe food was pretty good; not perfect but went well with the beer (an IPA).  I could nit pick but not point doing that. Each of the appetizers could have been better but we (my GF and I) finished off everything, so it obviously wasn't that bad.  Very large beer/wine selection not available elsewhere on the street.  Not cheap but a good alternative to some of the other less interesting restaurants & drinking joints currently on Polk.\n\nNeglected to try their Bun Bo Hue.  Will have to try that next time when I collect the free iced tea.", "author": "Martin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "I love Co Nam for a bunch of reasons. \n\nFirst is the beer. While they only have 20 or so beers available, the ones that they do have are delicious. La Fin Du Monde and Coronado Idiot are two of my favorites. They also have lighter fair like Asahi if you're not feeling super adventurous. On top of that, the staff is super generous in giving out samples of the beer. Awesome. \n\nSecond's the food. Love the Spicy Devil Wings. Love the Shaken Beef. Love the Basa Fish Clay Pot. These guys have really delicious, well balanced dishes, with interesting flavors. \n\nFinally this place has a great vibe. From the people that work here to the decor, I like how Co Nam feels.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "Cute small restaurant catering to younger crowd. Good food. Food is better down the street at Aux Delices.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-29", "description": "Nothing to write home about, food okay, service okay. but do you really want to pay $65.00 for a vermacceili bowl, dish of shaken beef and a coffee. I don't! when there are so many other options in this city.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "Nice ambiance and setting. Food is good but I'd say this is more trendy and fusion than authentic. The higher price point is basically because of the ambiance. If you're really against hole in the wall restaurants (that are cheap and semi-dirty), then you should def check this place out.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Love the coffee. Very full flavored, but not too sweet. The wings and filet mignon with fries were good.", "author": "Doris H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-21", "description": "My wife were walking by this place before it opened, and we were very excited to give it a try. \n\nUnfortunately, this place was extremely mediocre. The pan seared Basa turned out to be a deep fried piece of fish covered with a thick tomato and onion topping that had the flavor of frank and beans.  The pork spring roll starter - meh - nothing out of the ordinary except the lettuce hanging out and the scarcity of meat. I've had better at the fast food joint on 4th street. The rice crepe starter had a piece of thick, rubbery, and nearly flavorless pork that had the consistency of Spam in it. Disappointing.\n\nThe desert - banana cake - was pretty awful.  It was bland, stringy, with almost no banana flavor.  Our waitress attempted to warn us, but we didn't quite pick up on her discrete & professional subtlety.\n\nEven the rice was lacking. What saved our meal was a surprising side of bok choy and mushrooms.\n\nHonestly, Conam seemed like an attempt at western influenced Vietnamese gone wrong.  I am sure the owners will disagree and suggest this is truly authentic. \n\nMy wife and I eat a lot of \"ese\" with a preference for Vietnamese. We frequent the best in the Tenderloin and seek out great Vietnamese in Sacramento and San Jose whenever we pass through.\n\nSan Francisco is blessed an abundance of great Vietnamese restaurants. Even the cheap eat Vietnamese restaurants blow this one away.\n\nTry the lemon grass chicken here:\nhttp://www.yelp.com/biz/my-canh-san-francisco\n\nTry the clay pot seafood here:\nhttp://www.yelp.com/biz/pho-vung-tau-san-francisco\n\nTry the shaking beef here:\nhttp://www.yelp.com/biz/sais-restaurant-san-francisco\n\nTry the 7 kinds of beef here:\nhttp://www.yelp.com/biz/anh-hong-restaurant-san-francisco\n\nTry the crab rolls here:\nhttp://www.yelp.com/biz/bodega-bistro-san-francisco-2\n\nTry the banh hoi here:\nhttp://www.yelp.com/biz/pagolac-san-francisco\n\nYou can taste the authentic family-style skill at these restaurants.  This is what rustic Vietnamese should be. Very disappointing this is not what is happening at Conam.  \n\nFor the sake of these entrepreneurs, I hope this is early misfires.  I'd strongly suggest digging deep and figuring out how to get REALLY rustic. Kudos on a nice-looking restaurant. Now you have to deliver on the promise.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "One of my go to spots in the city. Basa fish clay pot is the best thing on the menu. It's surprisingly large for a small looking storefront so it's not hard to get a table. There's also the option of eating at the bar.", "author": "Carly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "Was surprisingly impressed with this place!! Initially, I was a bit skeptical about the restaurant because of the prices and the seemingly pretentious food concepts since I've had amazing Vietnamese food for much cheaper at many other establishments. However, my friends and I still decided to give this place a chance after reading some of the wonderful reviews on Yelp. The place was already so packed around 6pm, but we still managed to get a table since we only had 3 people.\n\nLoved the contemporary interior design and artistic touches. The modernized decor, dark walls, and dim lighting evoked this sexy, relaxing atmosphere. It made me want to make out with the food & stuff....just kidding. \n\nHere's what we ordered:\n\n- Grilled Pork Spring Rolls $8\n- Sauteed Filet Mignon $16\n- Braised Basa Fish Claypot $14\n- Grilled Pork Noodle Bowl $13\n\nI enjoyed all the dishes very much. Although different, I was able to taste the creativity and authenticity in each dish. The tantalizing, unique flavors, tastes, and spices incorporated into each selected entree & appetizer greatly appealed to us. I assure you that you'll enjoy almost every bite here. I must say that my favorite of the night was the Grilled Pork Noodle Bowl. I liked everything else very much, but I was craving noodles for the longest time, and this truly pleased me.\n\nService was simply awesome! The owner even came over to introduce himself and talk to us for awhile. A driven young man with such great passion and a creative soul. I wish this restaurant all the best as it continues to thrive!!", "author": "Juliet Rachel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "I was walking by on my way to another vietnamese restaurant with cafeteria style decor and MSG every dish when I saw this gem.  \n\nI have been to Vietnam and this was better than any restaurant I went to in the entire country.  Every dish was delicate while still generous in portion and utterly delicious.  The street food was a pleasant surprise on a stick.  There was nothing I wouldn't order again.\n\nThe decor was both modern and appropriate for a Vietnamese restaurant and evoked the best of my trip to Vietnam.\n\nI highly recommend this place!", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "The food tasted really fresh and healthy. The hot and sour soup was tasty and had many pieces of Baja fish. The Banh Mi sanwich was very tasty. The Banh Mi sanwich bread was great and the meat in it was tender and juicy. The Spring roll was packed with veggies and tasted like a garden. The calamari skewers were grilled to perfection. I love the food there.", "author": "Ananya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "Chicken clay pot...yum! Veggies were really fresh. In general, the restaurant was small but well-decorate and quiet. Will be back to this spot soon.", "author": "Janelle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Fun spot.  The wicked buns, despite 3 small ones, were delicious.  The food was vibrant in color, and fantastic in flavor.  The server was cute and sweet, too.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-13", "description": "We went on a Friday night and had no problem getting a table. The food was amazing! The food was not authentic, more Vietnamese inspired. I can get down with it though. The pork roll was great, especially with the amazing dipping sauce. I got the noodle bowl, which was big, full of flavor, but still light. My bf got the red hook, which I definitely stole some of. It was fantastic!", "author": "Kelsey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "This place has reasonable prices and delicious food! The pork sticky buns app was only $9 and was enough for a full meal, and the sugar cane shrimp rolls were a great starter. Date got the chicken clay pot, which was also delicious.\n\nWait staff was super friendly and attentive. Would definitely recommend. I will be back for those rolls!!", "author": "Charlie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "Love this place! The garlic noodles are delicious and they have an amazing selection of wines and beers. Great date spot. This is our go-to restaurant!", "author": "Anish B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-27", "description": "Good spot for a date night, as it's easy to get into and conveniently located on Polk. But the food is average at best and slightly overpriced for what it is!", "author": "Claire S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-27", "description": "This is the third restaurant that's appeared in this location in as many years. I liked each of the other two quite a lot, but for some reason I guess they couldn't make it work. I guess it's kind of a tough location, since it's not quite by all the dive bars on Lower Polk, but neither is it near all the trendy bars on Upper Polk.\n\nWhatever the case, when I saw the sign for \"Rustic Vietnamese\" food go up, I was excited to try it out.\n\n\nTHE GOOD\n\n- My pulled pork vermicelli was, overall, quite delicious. I'd get it again, but the menu had enough intriguing stuff on it that I'd probably explore further the next time I come here.\n\n- Following up on the previous point: I'd come here again.\n\n- Classy ambiance. Quiet enough to talk. Would be a great place for small groups to dine.\n\n- Service was very attentive and, honestly, kind of adorable. And as I type that, I realize just how condescending it sounds, so let me explain. I'm just saying that it was kind of clear that this place opened really recently and the staff was still getting the hang of things--in a totally forgivable and friendly kind of way.\n\n- Seriously, I was totally rooting for my waiter. Again, I know, with the condescension. Sorry. Sorry sorry sorry.\n\n\nTHE LESS GOOD\n\n- I can't call it bad, because I liked it well enough to finish it, but the dessert soup is probably not something I would get again. That said, I have never had a dessert soup before, and therefore have nothing against which to judge it. It's entirely possible that I just don't like dessert soup. It was interesting. And in fact, I take back what I said earlier. If I were in the right mood, I could see myself getting it again.\n\n- My pulled pork was not, as far as I could tell, pulled. This may be a culinary misapprehension on my part. But it seemed like more or less regular pork to me. The point is somewhat moot because It tasted great, but it was a surprise.\n\n- Also, one of the pieces of pork was pretty tough.\n\n- The price is not quite right. My meal (pulled pork vermicelli entree and dessert soup) came up to $25 (including tip). I would have been happier with something closer to $20. (Admittedly, my entree was one of the more expensive ones.)\n\n- Try to sit away from the entrance. Otherwise, if it's a chilly night (i.e., every night in SF), you're gonna get at least one or two unpleasant blasts.\n\n\nIN SUMMARY\n\nSolid stuff. I was perhaps a little lenient in the star rating because this place *just* opened, but I do hope they manage to stick around.", "author": "Greg P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Delicious.  My friend had her bachelorette party dinner here and they were so accommodating to our group.  We ate so many different things - but my favorite was the steak and fries.  It was so good - I am still thinking about it months later.", "author": "Autumn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "Super excited to have Co Nam join the Polk St scene. We live nearby, and had passed by a few times, always saying \"we should go there\"... And I'm glad we finally did. \n\nIt's nice to have a place with a sense of ambience and decor among all the hole in the wall dives on Polk. That being said, it didn't feel to be trying to hard or pretentious; it was just comfortable. \n\nWe came in after 9pm on a Friday, and the place was almost at capacity. We were offered a table or the bar and chose the bar. My only gripe about the entire experience is at the bar, there was a strong residual beer smell, but we got used to it. (Some candles would probably help!)\n\nCocktails, all made with soju, were carefully and cleverly crafted. Over the course of the meal, we tried the Street Peddler and the Cucumber Martini (worked well together: heat and cooling), and the Elderflower Martini (sweet... We had it for dessert).\n\nWe had the poached shrimp spring rolls (there is something magical in that peanut sauce, and I don't even care if it's just sugar), the poached calamari salad (a little vinegary, but appropriate for the dish), a street daily selection of calamari, shishito peppers, beans, green onions, and ponzu sauce (just... Yum), and finally, the basil lemongrass chicken (simple but powerful flavors). They missed our order for the spring rolls, but when they realized, promptly comped them and had the plate out in minutes.\n\nThat would have been enough... it was truly a delightful experience... and then we were brought beignets to sample. I hope they end up on the menu, because I'm still thinking about them. \n\nFood = 5 stars. Service = 5... And maybe an extra half. We'll definitely be back!", "author": "Jasmine F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Stopped here for breakfast on a Sunday. Great host and delicious food. Best Vietnamese coffee outside of east Asia! Try it!", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "This place is amazing. Great service and great food. The steak with French fries is to die for and the wings, pork belly, and garlic noodles are amazing! We eat here at least once a week and are never disappointed.", "author": "jeff d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-11", "description": "Made a reservation on Opentable, let them know we were a little early, no problem they said... \n\nHubs and I ordered two appetizers (chicken heart skewers and garlic noodles) and two entrees (claypot medly and lemon basil chicken) to share. Appetizers were good, heart skewers were juicy and garlic noodles had enough flavor.  Entrees were a little too savory for our taste, but something worth trying again.  \n\nBut the service, ick. Where do I start? Our water glasses were constantly empty.  Waiters seemed angry/irritated when we asked for refill.  Even though the tables on either side of us were seated after us, they finished their meals and dessert way before we even got our dessert menu.  I really tried to give dessert a chance, waiter cleared our table, asked if we  wanted to see the dessert menu, and I said sure.  After waiting 15 minutes for a dessert and watching our neighboring tables finish theirs, we had enough and asked for the check.  Took forever for us to get that too.\n\nAnd to top it off, when I got home, I got an email from Opentable that they canceled my reservation because I was a no-show.", "author": "Irene D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-01", "description": "Delicious and great service.  \n\nThey do get busy but when they get to you they are very consistently attentive.\n\nWe were there for Lunch and they offer up the lunch menu but also give you a look at the dinner menu in case you want to expan beyond the lunch.\n\nThe Geso Fries appetizer were excellent!  We ordered two rounds.\n\nWill definitely be back!", "author": "Martin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "Cute little place on Polk. Need more of these places on Polk.  You can tell they spent a good amount of effort, time, and money on how they designed the space.  Had a chat with the owner and he said he's an architect/designer by training....makes sense.\n\nAgree with other folks that the prices are a bit high (they really should consider dropping prices by a few bucks.  The rent can't be THAT high in that part of Polk)\n\nBut on to how the food tastes....\n\n1. Grilled mussels - 4 starts. Nicely grilled and dipping sauce had a good sweet, tangy balance.\n\n2. Pork belly - 3 starts - decent but not memorable compared to the other dishes\n\n3. Bptyass clay pot fish - 4 stars - very good flavors. Fish was fresh and the caramelization/spices were perfect. Without s doubt will order this again.\n\nNice job!\n\nSome recommendations to the owners:\n\nThe design is very welcoming but your service though not bad could be more personal.  I have dined here a few times and though I never felt rushed, your service staff should be more on the ball about reading when a patron is ready to go (please bring the check) vs. they want to stick around and enjoy the ambiance a bit more, allow themselves to digest so recommend a nice after dinner cocktail, port, drink...whatever.  Bring them more water as they sit.  This is especially important if the restaurant is not busy.  After all if you rush them out before they are ready you lose in two ways...1. patron feels rushed and is annoyed 2. restaurant looks empty and new patrons may not trust dining at a place that looks empty.", "author": "Lev E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "Solid, new entrant into the neighborhood and a much-appreciated one, at that. I'm a fan of nuanced, light, fresh Southeast Asian food and Conam delivers. The portions are small, but the flavors are manifold and delightful - case in point is the Omely wrap. You get about six lettuce cups, savory fish paste (was this anchovy?), and a selection of other fillings (dried shrimp, ginger, chili bird pepper, among the things I remember) that you put together - the lettuce cups are small and soon gone, but each bite is hauntingly salty, spicy, slightly sweet, with textural contrast provided by the smooth paste on the crispy lettuce.\n\nThe entrees are equally strong, with the house special one day (I think it was seafood soup with vermicelli noodles) making a strong aromatic entrance before it reached our table, causing us to salivate before we dug into the rich, meaty, hearty stew. I've also enjoyed the braised basa clay pot, finding the balance of caramelized sauce and thick chunks of basa to be a nice foil for rice or your other starch of choice.\n\nI wasn't a huge fan of the desserts here, not ever having gotten onto the dessert soup train, even as a young girl in Beijing where such a thing is de rigueur. Conam also offered a banana-based dessert that looked tasty, as well as an organic yogurt with blueberries option, so the dessert here may be fabulous. For me, it wasn't ideal, so I'm giving them 4 instead of 5 stars.\n\nI urge you to try this place and form your own opinion - the ambiance is calming, the house music is usually house music, and the decor is evocative of Vietnam. You'll experience some flavor explosions and walk away feeling a bit happier - promise :).", "author": "Annie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-16", "description": "Pretty good food that's a refreshing change from some of the other Vietnamese options in the neighborhood. Cordon Bleu has lost a little in terms of quality over the past few years. I'm not the only one thinking this, several of my friends thought so, too. Pho Vietnam is good if you want a quick bowl of pho or some OK bun, but it's just basic (spartan) dining. \n\nSo when Co Nam opened their doors I was really excited to have something \"nicer\" (but not froo-froo) in the hood without walking all the way down to Aux Delices. The food here definitely could give Aux Delices a run for their money if Co Nam's dishes were priced a little more modestly. Don't get me wrong, I like this place. The food is good, but it's not on the level of Slanted Door.....so we shouldn't be paying Slanted Door prices.\n\nThat said, the shrimp ball appetizers and 5 spice chicken are both really good. The GF gets the clay pot entree every time so it's gotta be OK. I had the basa before and it reminded me of a weaker catfish courtbouillon. Not bad, but not as good as what I've had (and made at home).\n\nOverall, give this place a whirl. It's something this stretch of Polk desperately needs (dear god no more cheapo take-out-oriented places).", "author": "Richard H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "I wouldn't expect to find a Vietnamese restaurant in this cool and hip neighborhood. Hell I didn't even know there was one here.\nBut I have to say, Co Nam is now my favorite Vietnamese place in the city. I've been on this quest to find real Vietnamese food in SF and I am so glad this day finally happened. My decision to go over my dining out budget for the month paid off big time !\nI went with my 2 roommates and we were all very happy with everything.\nWe started with the Bo La Lot - a street food that is very typical in Ho Chi Minh, Vietnam. Man the sauce...THE SAUCE. My friend was like \"Did you try to make that sauce the other day at home?\" and I'm like \"I only tried to make it cuz I couldn't find that anywhere here in sf. If I knew Co Nam sells it, I would've just bought it here\"\nNext we tried the 3 soups: Sweet & Sour, Bun Rieu, and Bun Bo Hue.\nAll 3 of them taste exactly like how it;s supposed to. I feel so homesick eating Co Nam's food.\nThe Basa FIsh in the claypot could be a little saltier and a little less sweet. But overall, I left the restaurant very satisfied. I even forgot I have a paper to write for school for a minute.\nMy roommates and I are planning to make Co Nam our Tuesday go-to comfort homey place from now on.", "author": "Alan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "This place is beautiful and the food is delicious. I've been here over 10 times and it never disappoints me. The waiter Amrita is very helpful and just a great host. I love the decorations and think it's a hidden jem on Polk st. I have tried a lot of the dishes and my favorite are their brussel sprouts, stir fry vegetables, steak salad, vegetable spring rolls and can't remember the name of the others but they are all uniquely flavored. Big plus for this place.", "author": "parisa e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "I initially thought it was a little expensive, but then found that the portion was huge (I could split it up into two meals). Very flavorful and good meat.", "author": "Kira G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "I went here for dinner and it was a really enjoyable experience. The staff were very friendly and made great suggestions. We got a noodle bowl and a clay pot and they were tasty, as was the papaya salad. The staff were super helpful and when we had to get going, they were quick to get the check. They forgot to take off some of the cost for what we got during happy hour, but were very quick and pleasant to change it to the correct amount, which was helpful because the dinner was not cheap. It wasn't the best food I've had, but it was certainly a positive experience.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Very good Vietnamese style food and a decent wine/beer selection to boot!   After dining you should check out Bob's Donut Shop down the street.  I highly recommend the Apple Fritter. Your life will never be the same!", "author": "Pat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "What a great surprise!\n\nWe had:\nBraised Silver Fish - think salty fish jerky over rice with a hint of spiciness. A delicious unconventional way to start off a meal.\nPan-Seared Basa - incredibly tasty with a good amount of spicy peppers. Texture was almost pork-belly like, delicious. \nChicken Clay Pot - my entree, when I first saw it I was a little disappointed, it looked like a chicken pot pie without the crust and gravy. Once I dug in, I could really appreciate it, beautifully aromatic. Tasted like the whole dish had been steamed in a lemongrass mushroom broth. I will definitely order it again. Got especially delicious with the hot sauce that was served (the one without the chili flakes was my preference)\nFrench-Vietnamese Yogurt with raspberries - THE HIGHLIGHT - delicious, sweet, incredibly locious. I could have eaten ten servings, no joke.\n\nThe servers were very nice. The owner came by and asked us how we liked the meal, the server gave great recommendations and was very ... cheery. The drink, cucumber martini, was just okay. Out of 8 cocktails, they only had materials for two.\n\nThe place is a bit expensive, definitely for Vietnamese food. Nevertheless, that yogurt was such a showstopper I have to go back.", "author": "Cristina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-13", "description": "First of all I have to say that I am happy there is a new \"cool\" place in the neighborhood... We have many food options in the area some of them great but not many places where you would bring a first date... I mean a cozy, fancy-funny place.\nDo not get me wrong, the place is just fine but I really like the atmosphere.\nFrom my experience food is pretty good, I guess it really depends on what you order. We had the noodle bowl, calamari salad and omelet rolls plus fried banana for dessert. All these were very decent dishes so I am fine with the food.\nService could be better of course but we can't forget this is a new place and they are still probably adjusting things plus it is pretty busy all the time.\nI definitely will come back and have a second round!!", "author": "Mario B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-24", "description": "Fantastic food and polite staff, but the slowest service I've experienced in the city. We were a group of 6 and it took ~15 mins to order drinks, a further 10 mins to receive them and ~1 hour to get our food. We tried to hurry the process as much as possible throughout and still had to take the check to the bar to clear it in order to not miss a show. Took almost 2 hrs to finish what should have been a 1 hr quick dinner. I'd love to get takeout from here, but wouldn't come back for dinner.", "author": "Rodrigo D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "I was skeptical of Co Nam when I first heard about it because I don't believe in \"fancy\" Vietnamese food. After our meal, I was very pleasantly surprised. It's definitely not authentic but the food is delicious and the flavors are a good representation of the more modern and \"new\" feel that the restaurant seems to be going for. My group ordered the banh mi, spicy chicken wings, sauteed filet mignon, lemongrass beef noodle bowl, and the fish clay pot, all to share. I liked every dish! Balanced flavors that were all unique to each dish, and each dish was a good reinvention of the classic Vietnamese one. Thanks for proving me wrong!\n\nI also have to say that the service was amazing! Not sure what his name is but he was wearing a Niners jersey the night we came in. Great guy who was very personable and made the experience awesome.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "Food was alright (had the burger), but the service was pretty terrible for brunch. Took them about 20 minutes from when we sat down to collect our drink orders. I read the other reviews, so was disappointed with the service. My friends actually really enjoyed their meals, which is part of the reason why I'm giving them a 3 star instead of a 2 star. I may give them another shot, but it's definitely not squarely in my rotation.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "This place is the best! Their pork belly sliders and to die for! Everybody was so nice to us, they were offering to try new drinks and food. Definitely recommend to everybody.", "author": "Moni H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "Had the fish clay pot and brown rice. Good stuff. Tasted fresh. Nice subtle flavors", "author": "Tim O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Yumzies. Basa Fish Claypot and Tofu Rice Noodle Bowl. I've had the Claypot before and this time was just as delightful. It's a fair priced family restaurant that's been great to pop into. Maybe I'll see you there next time!", "author": "Rob L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-22", "description": "No laughing matter.\n\nConan has perfect timing: http://www.youtube.com/watch?v=eD1nwe5Esx0\n\nCo Nam needs timing practice: Long lag between sitting and having our order taken. Sporadic water refills. Plates kept coming even though we weren't finished.\n\nService issues aside there is much to like about the food:\n\n- Sugarcane shrimp rolls include a delicious and unique dash of apple\n- Grilled chicken banh mi has plenty of flavor and includes a side of truffle fries\n- Clay pot medley contained an impressive amount of chicken, veggies and flavor\n\nOnly the street food calamari salad disappointed. Too much dressing. Not enough squid.\n\nHouse cocktails includes new takes on ginger and martinis. Pairs perfectly. Dim lighting, dark wood accents and abstract art make for a modern and inviting space.\n\nBathroom sink is awesome. Walking to it you might notice peanut butter and Jim Beam in the kitchen. Perhaps should have ordered something with those.\n\nEverything was reasonably priced (and enough to Replate http://www.replate.org/), and our server was friendly and trying. Just needs to be present more often.\n\nWatch Conan to learn the art of perfect timing.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "This place made my husband and I soooo happy! We stopped by for the banh mi sandwich and it was delicious! I will be dreaming of this sandwich for years to come! The chicken was so good and seasoned to perfection and it came with truffle oil fries! Oh, my! We also tried the clay pot medley and it was so, so, so good!!! We could not stop eating and just looked at each other in amazement when the food was all gone because we had tasted heaven.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-23", "description": "they really have a stick up this ass about credit cards and groups. with our party of seven, they would only allow one credit card. annoyed, we gave them some cash and ask them to put the balance on the credit card (for the one couple that didn't have cash). to our astonishment, that wasn't acceptable either-- it had to be either all cash or all credit. who's making these rules?!", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "I have been here three times and each time was phenomenal. The vibe is hip but relaxed and festive. The decor is intriguing and check out the decor again, is that a living wall? Are those pics of someone's childhood in Vietnam? It's chic and sleek, yet welcoming, if you don't believe me, check it out for yourself.\n\nSo that is the vibe and the ambiance but what about the food? To die for, mouthwatering, don't ask me any questions because I am so busy chewing, yum, yum again, great food that is so delish and innovative that you want to take a look at the menu one more time, just to see what it is you are eating and why it tastes so good.\n\nAnd the staff is efficient and all smiles.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-30", "description": "Confusion galore amongst the people that work here. Slow service and no follow up service. Food is good not great for the $$$", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-11", "description": "This review is for the owner of the store. I normally don't Yelp. This is second review I ever wrote. Went to your restaurant this afternoon, before we went in realized you have a happy hour between 4pm to 6pm. Was there 3:55pm. Asked waitress about the happy hour cocktail, she said the bartender wouldn't  be in till 4pm, then she said just ordered food first, when he comes, you can order the drink. So ordered food. Food came,  taste good, bartender never showed up. So ordered beer. I would give this place at least three or four stars till we got the bill. We were charged full bill, no happy hour discount. The bill was $78.00. Asked the waiter (the waitress left), he said that we ordered on 3:56pm, so won't apply for happy hour. Even explained the reason we ordered , he basically showed no interesting to listen, just said I wasn't here. Don't know. We paid bill, left NO TIPS. This is the first time I ever left nothing for the service. You know, since he won't care, and didn't serve us, why should we left tips! San Francisco is the foodie city, there are tons of good places. The difference is good food and good customer service. The attitude of the serving stuff really could make or break the business. I don't think we will be back there any more.", "author": "Jian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "Love the location and the vibe.  The interior design and art work create a chic atmosphere contrasted with pictures of Vietnam.\n\nTried the five-spice chicken clay-pot, ingredients were very fresh and perfectly spiced.  Service was extremely fast given how crowded the place was.  I'll surely be back, perhaps eat here before the classic polk street pub crawl.", "author": "Prakhar S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-25", "description": "My boyfriend is Vietnamese, so you can assume I've had great vietnamese food many times. \nThis is why I decided to introduce my mom to Vietnamese cuisine. But I should have picked another place!\nCo Nam is overpriced restaurant with bland food and terrible service. Another disadvantage- there is no private parking lot. We spent like 20 min looking for a street parking nearby. Oh well, this is San Francisco...\n\nWe came for lunch and ordered two dishes: Ban Bo Hue (15$) for me and a rice bowl with grilled five-spice chicken (13$) and an egg roll on the side (2$ extra) for my mom.\nIt took them quite a while to serve us (around 20-25 min), which is strange because the place was almost empty when we came (around 2:30-3pm). \nMy soup came first. I asked it spicy, and they brought me a bunch of red jalapenos on the side. The broth was pretty bland. Pieces of pork had way too much fat, and small amount of meat. I had to leave out the blood thing because it had absolutely NO FLAVOR. Why do you put something like this in the soup? \nThe culmination of my disappointment was my mother's rice bowl, which came with pork instead of chicken and a minute egg roll, literally pinky size. When I told them that we asked for a chicken rice bowl, the waiter told us they can grill chicken and bring it on the side. It took them another 10 min, obviously. The amount of chicken they brought was half of the amount of pork my mom had to take out of her rice bowl because she doesn't eat pork. I have to mention, this grilled chicken didn't have a flavor of chicken. I can't really explain what was missing, but something was definitely wrong.\nMy total was 35 $ (including tax and tips). \n\nI hate to say it, but dining in Co Nam was quite a miserable experience for us and I will never-ever come back to this place.", "author": "Natalia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "Stopped in with a couple friends for cocktails and appetizers. We had the Bo La Lot (beef wraps), it's ground beef in betel leaf, pickles, mint, bean sprout, all wrapped in lettuce and served with an anchovy dipping sauce. It's like a Vietnamese sandwich without the bun, a very tasty appetizer. We also had the lettuce chips, I don't remember the Vietnamese name but they are fried Brussel Sprout leaves smothered in garlic and anchovy sauce. A very addicting companion to a cocktail. Cocktails are alittle on the strong side but hey! That's the point sometimes ;) As for service, they were very knowledgable of wines, beers, and cocktails. The decor is very interesting, they have old pictures of Vietnam along the walls. It's about the food and the ambiance, a very good place to go on a date or a special occasion. I don't recommend children, the space is fairly small and intimate. Overall a great experience.", "author": "France Marie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-14", "description": "Great place for a group of 4-6. Basa fish and the beef carpacio and the pork belly are must gets. To get variety do family style. It's much more fun to try everything.", "author": "Corey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "This place is the bomb!!!\nThe base fish claypot is amazing!!\nI've been there three time I've tried something different every time it's always great. The own is cool dude too.", "author": "Jesus P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "The food is amazing!! So flavorful, I loved the Brussels sprout chips, the grilled pork spring rolls, and the garlic noodles! I will definitely be coming back!", "author": "Gabrielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-11", "description": "They get 5 stars because they are NEW and handling the growing pains well. \n\nI've been there twice.\nThe sugar cane rolls are amazing. I took an order home for the next days lunch. \nBraised Pork Belly is amazing and a decent portion for what you pay. We had apps and beers. The mains coming out of the kitchen looked great. Enough for two to share as an app.  Definitely going back for main courses soon.", "author": "Foodie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "This place is simply amazing. Visiting from Miami and went in without any expectations. Food was delicious, staff was very nice, the decor is beautiful and although it was full we were able to have a conversation. Try the Che or the sticky mango rice for dessert. So good!", "author": "Philip N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-09", "description": "Culinary blasphemy! Ambiance was okay but the food was terrible! For what they are charging, they should be serving something a little better.\n\nSecond, the table was dirty, so we cleaned it ourselves, and I was given a dirty plate. I wish I had known how dirty this place is. I would never set foot inside this establishment ever again.\n\nBased on most of the other reviews, it is safe to say though that Co Nam, has very inconsistent dishes from each time you go there.\n\nBut if you're a Vietnamese restaurant and you can't make a simple soup, what hope is there for you? I could have boiled my own hot water for free and added sugar, lime and other seasonings to make a better soup than what they delivered to me. \n\nSo 1 star for decoration and I'm being generous by adding another star for customer service.", "author": "Jake M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "This is a cool modern spot, they have great cocktails, and the food is great!  Went on a Friday night, it was pretty crowded and service was a little slow.  All the food looked great, we got the crispy rolls, birds nest, and clay pot Medley, all super delicious and fresh!!", "author": "Keri K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-27", "description": "Nice design, clean and good food. Pork belly is amazing. The appetizer came out very fast but entrée was slow. The cocktail is great. Kid friendly! And service very nice.\nWe are looking forward to go back soon.", "author": "Dear J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Food is not bad but is a bit overpriced for what you get. Plenty more Vietnamese places around the city for much better value. Service was good and the street food menu is interesting.", "author": "Annika C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-18", "description": "Yelpers loved this place so I took my boyfriend for his birthday. I didn't love my food. I had lemongrass chicken, cubed beef, stir fry veggies, and the eggplant carrot dish. The chicken tasted odd, kind of gamey.  The beef was also weird, but had enough seasoning to mask it better. The veggies were meh, and the eggplant and carrot dish was exactly 2 peices of each, served cold and not cooked. Prices were high, portions were small, menu was small. The place is tiny so youre sitting in close quarters here, so youre totally overearing conversations on both sides. I won't go back here.  But the decor was very nice.", "author": "Y K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "I really was pleasantly surprised. I ordered a bowl of bun ba hue that I was expecting to be dumbed down for western tastes but this bowl was legit. Pigs feet and blood and all that good stuff. This was better than a place in sac that supposedly had he best bun Bo hue in town. If I'm in the area I would go back without hesitation.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "One of my favorite restaurants I've visited in the city! I went again last night and ordered the thai tea martini which I'm a huge fan of but my date was not so he ordered the lychee soju which I would HIGHLY recommend, it's amazing. I wasn't a huge fan of the bahn mi the last time I got it but the clay pot chicken is phenomenal. Last night I ordered the 5 spice chicken rice bowl and loved it. The dressing was just sweet enough and paired very nicely with the spiced chicken. Our waiter was great, he recommended the soju to us and was very friendly and attentive. This place is a must visit.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Shaking beef was bomb. Maybe the best I've ever had. Medley claypot was good, but not outstanding. \n\nGreat service. Employees are nice and knowledgeable.\n\nWas empty at 6:45, but filled up and got lively while we were eating. Very pretty decor -- one wall is all plants, dark interior with lots of wood. \n\nI'd eat here again especially considering Polk street alternatives", "author": "Alyssa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "I'm a huge fan of Co Nam. We've been several times and it never disappoints. It's one of the more intimate, interestingly decorated restaurants you'll find. Trung & his staff provide excellent service, an ever-changing, thoughtful beer and wine list, and great food. I never miss the shrimp pops, spicy basil wings and Red Hook (think modern Vietnamese fried fish). Recently, they began serving brunch on the weekends. Not only was the brunch fare as good as anything in the neighborhood, there was no waiting. Doh! Why'd I let that secret out?!?!?", "author": "Corey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "The lady and I had a good time here today.  Great food and drink, nice clean restaurant, some decent music and polite and attentive service.\n\nStars of the show were the appetizers.  We had the wicked buns, the garlic herb noodles and some shrimp lollipops from the daily street food menu.  Everything was delicious, and we were regretting not getting more of the noodles and shrimp pops to go.\n\nEntrees were solid as well.  We had the bird's nest and lemongrass chicken.  Presentation of the bird's nest was nice -- it actually looked like one.\n\nHappy hour discounts were a pleasant surprise.  Will be going back!", "author": "Dom And Jazz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "For a party of 4 that come in right before they closed, they are the nicest.\n\nDECOR: Very SF chic, warm dark brown colors, with interesting light fixtures. Grass Wall...o_0\n\nAPPS: the pork was tasty, the calamari salad was dressed nicely (and the calamari wasn't over cook) and friend springs were OK (i wish there was more veggies and wood ear mushrooms, and less noodles).\n\nENTREES: Lemon grass Beef vermicelli (could use more lemongrass), Grilled Pork vermicelli (good grilled flavor) and the Braised Chicken (reminds me of the chinese dish Drunken Ginger Chicken, which is always a good thing). The vermicelli with there hot sauce, is really good, if you like spicy. If you don't stay away from their hot sauce, I mean it.\n\nSERVICE: the server was so cute, inside and out. He was very nice and attentive, and had to deal with our late butts, so A+.\n\nOverall, a good meal. I would come back, if I was in the city. I only wish they had Pho...and when we went they didn't have their alcohol license yet, so maybe drinks too next time.", "author": "Mei L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-24", "description": "Ugh. Beyond disappointed. I love Vietnamese food and was excited to try this place. It looks so chic but leaves the palette wishing for a whole-in-the-wall on Clement Street where they know how to cook.\n\nTHE FOOD\nWe did a bit of sharing, and everything that was put on our table was just plain mediocre. My dish was probably the worst of all -- a chicken claypot with veggies that tasted more like a Lean Cuisine frozen dinner.\n\nTHE PRICE\nI've seen several other reviewers mention their price point and agree that it is way too expensive for what you get. \n\nTHE BOTTOM LINE\nThere's far better food in the area. If this place manages to maintain a 4-star rating once it gets up to a couple of hundred reviews, I may give it another try. But I'm doubtful!!", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "This place was a great find on a busy street. Awesome cocktails, prompt and excellent service, and delicious food. Great atmosphere and good music too. All around fantastic night out!!", "author": "Steve V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "Delicious food, friendly service, and quick! I tried the daily street food...so good, had a spring roll and a salad.  Healthy, filling, and so tasty. Cant wait to come back and try more of the menu...What a better choice for this space than what had been there before!", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "Wonderful addition to the neighborhood - fantastic service and solid food. A huge upside: really interesting beers on tap that are 1/2 off during happy hour. They are pretty generous about allowing you to sample different draughts before placing your order.\n\nGreat for both groups as well as more intimate dinners.", "author": "sar h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Another new gem in the Polk neighborhood, had the pleasure of dining at the bar with the owner/creative mastermind Trung.  This provided an intimate experience and for us to ask questions about the preparation and nuances of the food.  Modern trendy decor, good drink options.  Omely wrap was interesting make-yourself appetizer, Clay pot was generous, spicy and comforting, and 5-Spice Chicken is a filling but lighter option.  Tried both mango sticky rice and espresso creme brulee for desserts; mango sticky rice was better.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "This is what I would call very good Viet food. It's worth a visit - and a likely return for me (which says a lot in this town).  I particularly liked the Shaking Beef and the fish clay pot.  Quite delicious.   Food is very nicely presented.  The beer list, both draft and bottle, is excellent.  You should go ahead an eat here!", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Had the bass clay pot and shaken beef started with the pork spring rolls.  Delicious! Cute waiter too very knowledgable about the dishes. Coming back!", "author": "Kim a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "They were really busy when I was there. Even though the food took awhile to come out the staff was super nice and you could tell they were working really hard to serve everyone. I felt bad for the staff having to deal with whiny customers who can't understand things might take some more time if a restaurant is busy and the food they bring out is made to order and not frozen!! I would suggest ordering the burger. And if you like things hot, their ginger cocktail has this very unique, spicy flavor that is worth a try.", "author": "Bella C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Four of us went to Co Nam on a weeknight and all of us thoroughly enjoyed the food, service and atmosphere.  Very nice host who seated two of us even though we were waiting for two more.  Our server got us drinks while we waited.  This was a nice change from places that won't give you the time of day until your entire party has arrived.  They have a nice selection of beers on tap.  All entrees were really good - clay pot chicken, shaken beef, vermicelli bowl, pork chops.  We were not rushed at all even though the place filled up while we were eating.  We definitely plan to go back.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "My boyfriend and I came on a Friday night around 9:30 and got seated right away (awesome!). We wanted to try a bunch of different things instead of just one entree so we ordered some appetizers since happy hour had started at 9:30. We got the shrimp pops (so oily.. I imagined it tasting like a deep fried shrimp dim sum dumpling.. It was nothing like that), garlic herb noodles (ok), and red spicy wings (favorite of the 3 we ordered besides the free thai iced tea and beer). 3 1/2 stars for the food we ordered but 4 stars for service. Our waiter was pretty attentive and was very knowledgable of the menu items. Vermicelli is a must try next time!", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-12", "description": "We tried this new restaurant for takeout last night since we live around the corner. There was no problem placing our order over the phone, and the food was ready on time. When I arrived (early), the bartender Rafael was experimenting with some new soju-based cocktails and he let me try a few while I was waiting for the food. For a place without a hard liquor license, they can do magic with their own tinctures and concoctions!\n\nThe meal was overall very good. We ordered poached shrimp spring rolls, calamari salad, pork belly, and pan-seared basa fish. The spring rolls were hearty and fresh. The calamari salad was a bit light on calamari, but still tasty with other crunchy vegetables. The pork belly was delicious, and the basa fish was very good, particularly the spicy tomato sauce. \n\nI would definitely eat here again for eat-in or take-out, and I look forward to trying more cocktails! Also, they will be having some lunch specials starting soon which will be great for when I am working from home.\n\nWelcome to the neighborhood Co Nam!", "author": "Christine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "I've been here a few times.  It seems there is always just one person, during the week, taking orders.  He's terrific at what he does, but sometimes it's hard to get his attention.  The food is good but know it's more like Vietnamese fusion.  Their pork belly dishes are great!.  The soups are satisfying. The street food selections are always interesting.   I will return but go elsewhere for true Vietnamese food.", "author": "Jane G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "Chicken clay pot and good beer selection. Also good decor", "author": "Mister T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-04", "description": "Fairly new Vietnamese on bustling part of Polk and we really wanted to like this place.   The room is very narrow room and they did a good job making it seem open and bigger.   The service was attentive and good overall.\nOur biggest disappointment was the food.   For the shared appetizers the crispy rolls (Imperial?) was presented plain and bland with out any traditional wraps or mint leaves.   The braised mussels were not a hit and only one out of the four in our group would eat it.  The braised silver fish was very unusual (fishy and salty over rice) and 2 out of 4 were ok with it the other 2 wouldn't touch it after the first bite.\nThe fish claypot was probably the strongest dish going very well with jasmine rice.   The lemon grass beef was ok but nothing special c/w a good clement street vietnamese at half the price.   The filet mignon over 'french fries' the weakest entree.   The amount of filet was small and worst of all it was stir fried to overcooked and topped over semi soggy fries.  Yuck.  \nToo bad.  Good location, space, service but they need to rethink the food quality.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "Love this place. Shaken beef is to die for. I'd say the food and ambiance is fantastic. The cocktails are so-so.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-24", "description": "A great restaurant with a beautiful new design that fits an awkward space perfectly. I hope Conam survives and thrives. My favorites: mussels on the half-shell appetizer and 5-spice chicken entree. Clay pots are fabulous. And the dessert soups are divine (get both and share them). Everything is fresh and perfectly seasoned. \n\nEverything about the space (down to the bathroom) is simple and beautiful. I love to sit in the restaurant and take in the environment: the collage, the wood, the moss, and the chandelier. Really, it's a lovely place. And the service is attentive, polite, and efficient.", "author": "Louise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "I hands down love this place! The service is fabulous, always friendly. I haven't had a bad thing off the menu.  Start with the beef carpaccio, trust me you will add a second order. The grilled sugar cane shrimp is yummy and the braised pork belly is to die for. You must complement anything you order with  the garlic herb noodle. I've tried just about everything on the menu. They always offer a few appetizer specials, primarily seafood. Great wine list to complement the meal. I really wished I still lived in the neighborhood as I would probably be there every other night.", "author": "Deb B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Excellent for lunch with tasty but smaller portions so you don't walk out needing a nap afterwards. The cocktails are also decent and worth a mention. It gets a four vs a five star because the open, airy room is a little cold at lunch time - feels a little too echo-y if there aren't many people and gets too loud when most tables are filled.", "author": "S C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "Very good food in a chic space. Nice waiter. I'd go back in a heartbeat.", "author": "Sheviche R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "THE GOOD:\n - DECOR: very chic\n - NEW NEW: the place is really new, so while that lasts and it's undiscovered, you get to show your friends how plugged into the city temperature you are =)\n - PORTIONS: The food is well portioned. I hate feeling like I'm wasting food, or feeling hungry afterwards. The staff is also great about describing how big a portion is, if you accidentally order something too big and they sense it. (I speak from experience).\n\nOKAY:\n - the menu selection is the largest, and the old familiars may not be there; however, of everything I've had so far it's been great\n - since the restaurant is new, they may not have worked this out, but it seems like there isn't a dedicated server, they all serve at the same time -- it's a little confusing.\n\nBAD:\n  - nothing yet, I'll update if I see something.. I guess you could say space but I like the layout and think it's a plus\n\n\nRECOMENDED FOR: \n - dinner dates, catching up with old friends\n - for a date, try eating by the bar, it's spacious, beautiful and I personally found it took the awkward interview feeling away\n\nNOT FOR:\n - families with children\n - people who prefer fast food to good/healthy food", "author": "Sanjeev D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "A terrific addition to the Polk Street scene...I love the banh mi sandwich with truffle fries and the roasted mussel appetizer--soo good!  It took some folks with a solid sense of design to finally banish the Double Rainbow aesthetic, and these folks finally turned the space into something interesting and inviting, with good food to boot.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "We're definitely coming back.  It is a bit pricey (for Vietnamese food) but it was worth it.  The staff was very warm and attentive.  Good ambiance and drinks.  We had the 5 spiced chicken banh mi, fish clay pot, beef carpaccio, and one other thing that I can't seem to remember.  However, the sandwich was a star...granted it was priiiicey...but was the best sandwich i had in a loooonng while.  4.5 stars for us!", "author": "thuy n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "Got the 5 spic chicken to-go and it was delicious.  A little pricy but still very good.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Amazing! Great atmosphere, wonderful cocktails, trendy music, and fantastic food!", "author": "Rebecca F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "This clean, inviting, modern looking restaurant is a welcome addition to Polk St.  Based on two trips and sampling a range of different items, there is no doubt that Conam generally turns down the taste and spice to cater to a wider audience.  This is not necessarily bad but it's def helpful to know beforehand.  \n\nThe service both times was fantastic - warm, attentive, friendly.\n\nAlso, please note this restaurant just opened and they will, without a doubt, make adjustments to the menu and recipes.  If I could cast a vote, I would ask them to go for it - make the food bolder, more authentic", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "Awesome pork spring rolls.  The pork chops were kind of dry.  The pot medley was okay but not for the 16 dollar price tag. Sautéed green beans were pretty good. The service was friendly and helpful. We may have just picked the wrong dishes.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "A friend and I tried the brunch at Co Nam after walking by a beautifully set table out on the sidewalk showcasing their fritatta and french toast.  We ordered the french omelet and the brioche french toast with berries - both were amazing.  We'll definitely go back - highly recommended, worth every penny!", "author": "Megan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "This is a bustling little place with terrific food.  The staff was very friendly and attentive.  If all the tables are filled, you can eat at the bar.", "author": "Jon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "Wow what aamazing food....bahn mi. ..god damn...what a great place...", "author": "Arjan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "Wednesday night dinner with pork spring rolls, calamari salad and lemon grass beef vermicelli.  Everything is excellent and they have a nice wine/beer list.   A welcome addition to the neighborhood.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "The space is very inviting, warm, and chic. I love the light fixtures made of baskets filled with glass bottles and the plant wall. We shared the grilled pork dish, five spice chicken, grilled pork spring rolls and the wings (a special for the night). Everything was very good; favorite being the wings. You can't go wrong with this place!", "author": "Linh S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-09", "description": "Service was atrocious. Went last night at a not very busy time and it took forever to order, waiter forgot our order and then our food took 45 minutes and it was just appetizers. Food was decent but I will never go back.", "author": "Virginia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "Fabulous dinner. Everything was great, especially the red hook fish.  Unexpectedly perfectly fried with tons of flavor. Also had the vermicelli bowl with beef which was also very tasty.", "author": "Julie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "Interesting and tasty food. Service just OK.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "taking asian food to a new level in SF\nwhich is hard to do since it's such a value based and competitive market\nbut Co Nam do a good job of offering fine ingredients in a Vietnamese dining experience\nnot sure if it's a bar or restaurant though, which is hard to accept sometimes when looking to indulge in food alone and cocktails seem to be offered every few minutes\ntry it once if on Polk and you decide. It will add 20% to your usual asian food bill, but in turn add 50% to your health with the carefully selected ingredients and combinations.", "author": "Jed K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-28", "description": "Great new neighborhood restaurant, upscale but comfortable.  The owner is really hospitable and energetic and the food is delicious!    Great place for a glass of wine and an appetizer at the bar after work.", "author": "K P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "I've seen lots of restaurants come and go in this space.  This one is my favorite so far.  I loved the Bahn Mi and the spring rolls.  I've always loved Unicorn downtown.  The owner has created another winner.  I can't wait to eat here again.", "author": "Heinz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "OMG, the food here is incredible. The beef carpaccio and shrimp pops are both great for apps and the claypot medley is my absolute favorite for dinner. I love the atmosphere here as well, the moss wall in the back reminds me of the Moss Room at the Academy of Arts and Sciences. I would give it 5 stars, but the service is still a bit lacking -- the last time we went in for dinner, our server forgot to give us menus, never refilled our water and rarely checked in -- even though the place was almost empty. I chalk it up to being relatively new and the food more than makes up for the faults in service.", "author": "Shelley R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "The plump silkenness of the grilled chicken in the rice bowl was an unexpected surprise. The quality of the chicken and the melding of flavors in that dish set it apart from your regular Vietnamese fare. Ditto the caramely, spicy crunch of their devil wings.  I'd stay away from the mango sticky rice, which was rather lackluster. I'd return for the date night level setting and service. You can actually have a conversation here without shouting!", "author": "Aiko S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-27", "description": "The food here is fine - although their vegetarian choices are limited - but no better than many other Vietnamese restaurants in town to justify the high prices (double).  Perhaps as customers, we are paying for the more modern and upscale ambiance, but it really does not represent value for money.  The portions are also not at all generous - I had a starter, a main dish, and a dessert, and I went away hungry and had to snack afterwards at home.\n\nI just dined on a saturday night, and there were plenty of empty tables, so perhaps the diners are voting for the money.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "An amazing find\nBy all means, if you appreciate delicious Vietnamese food and excellent service, run, do not walk, to Co Nam. Recommended: Spicy Ginger cocktail; starters: quail (fabulous), calamari salad; entrées: claypot medley, basa fish claypot with jasmine rice. . .but you probably can't go wrong with just about anything on the menu. The restaurant is attractively decorated, not too noisy, and the service is attentive and smiling. It's probably not good for larger groups & I hope rowdy patrons never find it,  but if you enjoy a sophisticated meal in a charming atmosphere, this place is for you.", "author": "Helen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "Very good Vietnamese food.  Been there twice and liked it both times.  Grilled pork roll delicious.  Lemongrass beef and prawn tomato (can't recall name) were very good.  Service is very good.  Seats are uncomforatble IMO, unless you like sitting on a board.  I wish them luck - te location has turned frequently.", "author": "Glenn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Very tasty food, excited to see how this new entrant to the neighborhood develops!\n\nHad been meaning to check out this place for a couple of months and ended up going in for a quiet Sunday lunch.  We shared some Vegetarian spring rolls, then I got the Sweet & sour basa fish soup and the boyfriend got the Pulled pork rice vermicelli.   We were both very impressed with the tasty, simple but well-balanced food.  \n\nThe food was well presented and service was attentive.  Portions were generous but manageable.  They went easy on the chilli but gave us sambal and chopped chilli peppers on the side to add according to our taste - and they were good strong chillis as I discovered when I poured a generous handful into the soup!\n\nOh and I'm a big fan of the delicious Genmaicha tea to wash it all down with, served in a beautiful cast iron teapot :)\n\nThings that just stopped it getting 5 stars (for now):\nAt $19 each plus tip, the food was a little pricey for a lunch (especially on a street with lots of cheap lunch deals).  However, I could appreciate that it was high quality food and I wouldn't mind paying that for dinner.  \nThe place was pretty quiet when we were in so not feeling the ambience, though it was a nice space and well decorated.  We will have to return for dinner!\n\nOverall, a welcome addition to the neighborhood - hope it does well and gets busier.   The food certainly merits it!", "author": "Katie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-09", "description": "We really wanted to like this restaurant. The menu looked interesting as did the decor, it's not the slanted door, but it looks interesting. We enjoyed the food and the friendly service but when the bill arrived we were very disappointed. I am not exaggerating, 75% of the items were priced more on our bill than on the menu! In each case we were charged one or two dollars more that the menu price. On top of that this the restaurant adds that annoying \"SF Health\" charge. I just don't understand the thinking of someone opening a new restaurant and engaging in this practice. Anyone who reads the paper knows that people hate this. I can't remember a visit to a restaurant where there wasn't a discussion of this after a bill arrived with a line item adding a charge for SF Health. A restaurant owner would have to be either an idiot or so arrogant that they didn't care that this angers their patrons. The fact is, we can walk to 500 restaurants from where we live. It doesn't take much to sway our decision on where to eat. As long as the quality doesn't slip, Delfina Pizzeria can get away with a healthy SF charge, we grumble but we pay it. But a new restaurant which charges more than the menu prices? No way.", "author": "Lee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Absolutely brilliant! I was really surprised; walked past the restaurant and we thought 'why not?'. Food was of an exceptional standard, service appropriately attentive and I had a rare shock at the size of the check at the end (what good value it was). Highly recommended :)", "author": "Adam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-06", "description": "Went on Friday night on a date. The food was very over priced and the wine was on the level you would see at a bodega. I found a very long hair in my food dish and I almost got sick right at the table. I told our server and they apologized but didn't offer me another meal. I refused to eat this dish so it just sat there until I told them to take it away. They stll charged us for the dish that was not eaten where the hair was found. I will not be back.", "author": "Christie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "Just wonderful! My husband and I are so happy that this cozy, modern spot opened in our neighborhood. We've been twice this week. The food is delicious. It's balanced and full of flavor. My favorites so far are lemongrass chicken and claypot medley. But there are so many things on the menu that look very appealing and I need to try next time. Staff is very friendly and attentive. We are coming back next week for sure!", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "I sauntered by this place a couple of weeks ago, and didn't realize that the former Pakistani/Indian Restaurant that used to be in this spot, was no longer in business, and this new Upscale Vietnamese Restaurant had taken it's place. I was duly impressed by the aesthetics and the vibe of the place, and went in and talked to the young owner (male). I told him that I was interested in eating here, but not that particular day and could I grab some Paper Take Out menus to peruse, of which he graciously complied. I made it a \"must do\" thing for my next outing on Polk Street, and grabbed a friend and went there on saturday, the 30th of November. The menu offerings for an early afternoon brunch were numerous, and we settled on their version of the Thai Burger, which did not disappoint. It was so juicy and it had it's own sauce and was on some kind of a combo pretzel/potato style roll with cheese and fresh greens. Delicious! Since there were no accompaniments, we asked if we could order a side of fries, which we wanted to split. Amazingly, they split the order in the kitchen and gave us the one order on 2 separate plates. Now that is service! The fries were delicious and they had shreds of finely diced thai basil shredded over the top..Nice Touch. I asked for some salt and pepper, which the server graciously brought, but it was mixed together in one small dipping plate, which I thought a little odd, but interesting. All in all, it was a great experience and they truly (all the staff) went out of their way to make our dining experience truly memorable. I can't wait to come back and try the \"true\" artisan nouveau Vietnamese hand crafted plates.", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "Really solid, got the fish clay pot and it was super tasty. Easy to get a seat on a Wednesday night", "author": "Ojus P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "We tried this place last night based on table availability and the few Yelp reviews I read. I was very pleasantly surprised. This ambiance is warm, but contemporary. All the food had a unique twist and was prepared with very fresh ingredients. The green been and shrimp salad was delicious and the fish clay pot was really good. Extensive wine and beer list won't leave you thirsty.", "author": "Heather W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-22", "description": "Not authentic by any means.. Tried the food for the first time and I won't be back. I left the place very hungry as they were very small portions. The wife and I both ended up eating more food at home after we left Conam. Much better options in the City if you want real Vietnamese.", "author": "David J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-24", "description": "Great new spot on Polk, but service wasn't steller.", "author": "Sierra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "This place is AWESOME. My uncle dragged me here about six months ago and since then I haven't been able to get enough of Co Nam. The food is wonderful, with pretty good prices for what you get. Definitely do-able as far as dinner in the city goes! The Shaken Beef is unreal and the shrimp on the sugarcane (can't remember the exact name but comes out as an appetizer) was to die for. The ambience is awesome, cozy but definitely trendy. And the beer list blew me away. My boyfriend is a total beer snob and could NOT stop raving about all the wonderful beer they had. Priorities, right?", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "food is great.  i am sure that many people will label Co NAm as Americanised vietnamese food, but hello people, that's what makes it work.  reliability, high quality ingredients, consistent cooking, and nice presentation with discerning attention to detail is what we al should strive for in a culinary experience.  and whoever complains about prices-- c'mon, the prices are posted online.  if you want \"authentic\" cuisine at cut-rate prices there are plenty of places in downtown/Little Saigon that you can visit.", "author": "eshwar k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "Great decor and great food-will definitely go back. Ordered pork rolls and vermicelli, chicken clay pot and beef. All solid and flavorful.  One of the few nice looking restaurants in this town playing music with a nice loungy vibe. Don't be fooled by the negative reviews. Restaurants in sf that actually have a nice interior always get graded more harshly on food on yelp.", "author": "Q Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-27", "description": "came here for a late lunch.  they close at 3:30 to prepare for their dinner service.  the food was okay. best dish that i had was the five spice chicken noodle bowl. very light, made with fresh ingredients. they have an assortment of asian beers which were $4.  beer was cheap, food was a little on the high side for what it was. i wouldn't go out of my way to go back but if you haven't been there it's worth a try.", "author": "Sanil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "Nice interior décor and creative use of their limited space...oh and the food is pretty good too!  Been here a few times for dinner and have tried the spicy red devil wings, braised pork belly, and shrimp pops for appetizers, beef stew for soup, and the grilled five spice chicken for an entrée.  The braised pork belly was on the thicker side which I really enjoyed.  The beef shank in the beef stew was nice and tender and the French baquette that comes with the stew is great for dipping and soaking up all that stew.  They also have an interesting selection of beers and a nice assortment of wines.  The service has always been great and I definitely feel welcome and will be back again.", "author": "Edward Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "I was initially on the fence between 4 and 5 stars...the food was excellent, the service was very good but not exceptionally speedy...but the place has a very unique and friendly vibe...which makes me really want to go back. I don't remember the name of the guy behind the bar, but his girlfriend is one of the owners and/or chefs, and he was friendly and very helpful with the drink and food menu. I think he had something to do with the interior design of the place, which is not usually something that catches my eye, but they did an incredible job with the design of this place. Awesome and unique cocktails to start off. The bun me appetizer was really flavorful, and very nicely done. I've had maybe a half a dozen others in San Francisco, and Co Nam's is my favorite by far. The tumbled beef and the fish clay pot were unanimous winners with our group. The pork chop was very good, but not our favorite. Its hardly been a week, but I'm craving this stuff already...", "author": "Tom C."}
