{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "+ Beautiful views of the city with a dog park and lots of tennis courts.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "Great dog park. The wooden chips they added make all the difference.\n\nI am a dog walker so I like to use this park as a variation for my dogs. Beautiful views and everything is well kept.\n\n2 things I dont like: \n- The fences on the street/housing side are too low. So if a crazy dog loses a ball there.. who knows what'll happen. It hasn't happen in my case but it's really easy to jump over for medium to large sized dogs\n\n- Some dog walkers here think they own the park and are assholes. It varies from flat out ignoring you to getting yelled at because you missed one of your 8 dogs take a dump. Don't have eyes in the back of my head. I wish tho. Fix yourself people, and maybe pick up dog waste you see that somebody might have missed. Not everyone is an *ssh*le.", "author": "Styn V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Corona Heights has a many things going for it such as its central location, unique rock formations, stunning views, and hiking trails.  \n\nThe entrance on Roosevelt is the most direct but for a more rustic trail enter on 15th st to the right of the school.  Blackberry bushes adorn the beginning of this path in the summertime. Hiking-wise the park has some trails but it seems to be more popular for people walking dogs and hanging out with friends taking in the view mesmerized by its beauty.  To make it more of a longer hike it's best to add on Buena Vista Park and/or the Saturn and Vulcan stairs nearby.\n\nOn a clear day the view is amazing and you can see all the way to the East Bay but keep it mind it can get very windy here.", "author": "Joan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "This is a nice park that houses Randall Museum, but we didn't visit today. The small group of 4 people started at Twin Peaks Bar in the Castro. Then we had to climb the hill to this place. It has some rocky parts to climb around. There are views of the city and it is a different view than the Twin Peaks area. It was completely new to me and then we somehow made our way to Buena Vista Park. This path is really unique and not something that I have done. From Castro to the Haight District, it takes an hour. It is uphill and downhill. This is probably not a dog park in SF.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "I came here for a special Dachshund friendly event and this park doesn't disappoint. It's one place that's pretty unique and stands out from the hustle and bustle of San Francisco. Once you go up to the right sections, it's virtually sound proof. I had no idea it was going to be so calming. This is not the only best part about Corona Heights Park, believe it or not there is ample parking available if you are not taking public transit. I originally thought there was going to be less parking but even during pride weekend, there are still spots available at the museum attached and did I mention everything is free except food? I had no idea the park is in a rugged setting. It actually hugs a small hill. There is something for everyone here. If you play tennis or did so before, this is the place for you. Last this park has no tourists, it's all locals and they are real nice. There's something for everyone\nDrawback: bathrooms are limited here so don't drink too much fluids upon arriving. Shade can be hard to find on a hot day so plan ahead. Despite being close to public transport the commute to this area can be slow on city event days.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "Very short hike. So easy! Lol.. but the view is very pretty. I visited this spot with my bestie last month, and there were alot of people just perched up on the rocks. At the time, the sun had already set so it was getting kinda dark there, and you can definitely see the city lights starting to brighten up the darkening skyline. \n\n3.5 stars.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Corona Heights is such a hidden gem and beautiful place to visit if you want to escape the hectic city life for a bit!\n\nDiscovered this place during my 7-Mile Run towards Golden Gate Park and I was surprised that a scenic place like this in San Francisco even existed! I'm so glad I took a detour because the view here is breathtaking and makes you appreciate living in SF even more. I would definitely take my friends visiting out of town here since there is plenty of parking and is an easy walk.\n\nI'm definitely running here more often! It's worth all the up-hill running on State Street!", "author": "MyTien P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Easily accessible park with stunning 360 degree views of Oakland and the West Bay, whether it's the downtown skyline or the nearby hilly neighborhoods of Eureka Valley and Noe Valley as they slope up towards Twin Peaks and Sutro Tower. \n\nThere are several ways to get to the top, whether different trails from different entrances in the surrounding neighborhoods, or one that consists of actual steps. It wasn't at all busy when I was here, and it all feels more intimate and personal than the crowded overlook atop Twin Peaks. Highly recommended!", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "This one of my favorite hills to visit.  Amazing views and my photos turn out amazing too.  Feels like I am somewhere else and not in the middle of SF.  A short 10 - 15 hike will bring you to the top of the hill. I see people climb to the top of the borders and just sit and gaze at the amazing views.  Always nice to explore the hills of SF.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "Ooh, controversial 3-star rating! \n\nCorona Heights offers a great view and a good dog run. However, from an ordinary pedestrian perspective, a short couple blocks over, Buena Vista Park offers a much better walking experience with lots of old growth trees and a real sense of escape.\n\nCheck out the view atop Corona Heights, for sure. It's probably almost as good as Twin Peaks and considerably less crowded. I like that it's nearly outside my back door, easily accessible on foot and offers a stellar view of the city in virtually all directions. It's a fairly quiet urban oasis, tucked away in the Corona Heights neighborhood. More rock and dirt than trees and brush, it's a well-maintained city park.\n\nThe dog run is maybe a little overrun. It's mostly a dirty/mud area depending on the time of year and amount of rain we have had. Given the limited off leash areas in the city, I can see the appeal for dog owners.", "author": "Sara E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "This park is one of my all time favorites in SF! I absolutely love the view from the top (even better than the one at twin peaks). I usually hike up to the top from the side entrance near the tennis courts, and the trails is fairly short but a little steep (and slippery post rain) so be careful! \n\nDefinitely great for a nice clear day in SF though it tends to be windy at the top so be ready for that! I love the mini rock scramble at the end too, though there will usually be a lot of people sitting there if it's busy!", "author": "Kristie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Corona Heights Summit is my new favorite place in San Francisco. It's better than Twin Peaks, because you can see Twin Peaks from Corona Heights.\n\nThe park makes for a fantastic little hike in the heart of San Francisco. It's Steep and some of the terrain is just a little rugged. But when you get to the top the view is fantastic.\n\nAnd then there's the geology. If you're interested in geology, you will love this park. Bedded chert everywhere. And off of 15th and beaver you'll find the most amazing slickenside side anywhere. If you don't know what it's look inside is, look it up on Google.", "author": "scott h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Fantastic dog park! Took my pup here for the first time this weekend and we all loved it. \n\nThe park is just the right size. Not huge like Fort Funston, and not just a small park for dogs. This park is great on a clear day for an easy walk/hike. Go all the way to the top for a 360 view of the city. \n\nDog park is in the back area near the entrance. Large enough for several dogs to play fetch without running into each other. Great view here as well. \n\nEasy to find parking here and fairly central in the city. Overall a great place for canines and humans alike! \n\nOne complaint is I wish they have more trash cans around the park so people don't have to carry around their dog poop.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "This park has a really stellar view of the city. I finally decided to check it out since it's only 20 minutes walking from my house. Once you get to the entrance to the park- the ascent is only about 5 minutes, and is pretty easy- so if you park near the entrance it's a breeze. However climbing up the hill on 15th to get there is another struggle in itself- definitely wore my puppy out! I went on a Sunday morning and there was only one couple there- I was surprised how empty it was because the weather was phenomenal. I will likely make this my go-to weekend dog walk.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Pretty nice view of the downtown skyline. Parking wasn't too bad on the streets. Easy hike up to the top and dog friendly", "author": "Mason L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Beautiful view of the City.  San Franscisco has alot of areas that overlook the City.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-16", "description": "Great park. If we treat the dogs well and keep thout parks clean it will stay that way. Winter is muddy here so choose your visits with that in mind.", "author": "Menehune D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "I didn't realize how close this place is to Haight/Ashbury. It's a very short, easy hike up despite the sign that says \"challenging.\"\n\nit's such a beautiful view up on top with some flat rocks to sit on. There's a couple paths you can take to get up/down. One has this awesome, branchy tree that you can climb pretty easily. Highly recommend checking it out with someone you adore, lol.", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Corona Heights Park is like the adidas of Twin Peaks (Nike). The view is just as nice as Twin Peaks but is less crowded and less of a hassle to get to than Twin Peaks. It's easily accessible, considering I just walked 30 mins from the bottom to get to the top. There are easily many places to sit and see all 360 degrees of San Francisco. It is definitely chilly up here so remember to bring a jacket!", "author": "Binh P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "This place is such a hidden gem! My friend moved into the neighborhood, and when exploring the area, we stumbled upon this park. It's just a short walk to the top and doesn't require much effort to gain access to the stunning views of the entire city. We visited on a cloudy, windy day and were literally blown away with how peaceful and beautiful it was. I can't wait to come back on sunnier, warmer day.\n\nIt's only 1.5 miles away from Twin Peaks, so if you don't want to deal with the stress of that, I highly highly recommend coming here.", "author": "Nikita N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Yeesh, I hate to give up a killer \"secret\" spot to view the SF skyline, but Corona Heights Park (CHP) is better than the tourist-laden Twin Peaks (TP).\n\nLocated above the Castro District and downslope from TP, CHP is a downright odd place with rock outcroppings and a close-up view of downtown and The SF Bay.\n\nLot's of dogs too - it has a dog park.\n\nI found the place during an exploratory mission of SF several months ago and returned this past weekend with a whole crew of \"day-trippers.\"\n\nParking is sketchy, footing borders on deadly, views are spectacular and CHP is a 5 star spot to me.\n\nPLEASE don't go there, tell anyone about it or advertise in any way/shape/form its \"badassness!\"\n\n5 stars", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "I absolutely adore this spot! So do my pooches they're like WOOF WOOF where the dog park at? Haha. Seriously folks there is a beautiful view, fresh air, and happy dog and non dog people doing their thing! I completely understand why everyone calls it a hidden gem! Pooches agree!!\n\nP.s this is near the Castro area which is an added bonus if you like that area too!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Awesome view of SF! You can also do a little bit of rock climbing too :) Lots of cute dogs too!\n\nTips for visiting:\n- There are street parking around since the park is located in a pretty nice neighborhood.\n- Wear shoes you don't mind getting dirty. There were mud patches when we visited, even though it hadn't rained...\n- There are 2-3 giant rocks that you can climb on to get an even better view of the city \n- Bring a jacket! Get's pretty windy in the evening. \n- If you are afraid of dogs you should avoid this park because a lot of people come to walk their dogs\n- You can see Mission Dolores Park to the east!", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "Great views of downtown.  And I've knocked out another of SF's hills.  Funny, I was looking down upon Corona Heights from Tank Hill and thought, \"Might as well try that hill since I haven't been there yet\".  So, that's where we headed from Tank Hill.\n\nWonderful views of many parts of SF from up there.  Go late afternoon for the best lighting -- as we did.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "I honestly have always wanted to go to Corona Heights Park ever since I passed by it back in late 2015! I had a prediction that San Francisco would be beautiful during sunset, and I stood corrected!\n\nMy boyfriend and I spent our four months here (yeah, not too long) and got some food. It was a little chilly, so we ate at the foot of the hill.\n\nWe luckily found parking in the street and easily climbed on top. It was easier than I thought, haha.\n\nIt was during one of those lunar eclipses when we went to the top. The sky lit up with beautiful colors that looked like it was from a painting.\n\nI definitely would love to come back here again!", "author": "Aj C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Absolutely one of the Best views. It's quite, serene, gorgeous and a short walk to the shops and restaurants on Castro. Don't miss the opportunity, it's free!", "author": "Elease A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Well it's hard to call this a hike.. it's barely a 20-30 minute hike but you do get great views of SF from the top and it's a nice hike you can jog up.\nThere are a few entrances and the most challenging(still fairly easy) and most fun is the entrance from 15th Street from the Tennis courts. It's a great little park as it's in the city and easily accessible.\nOn a clear day, you can see the city from 360 degrees including a great view of Twin peaks.\nAfter all the good Latin food in Mission, i recommend this little hike up the hill to take in some views :)\n\nvalue 5/5\natmosphere 5/5 it could get really windy up at top\nservice 4/5 easily marked trail\nquality 5/5 bang for the buck\n\n19/20", "author": "Nina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Beautiful view and my dog loved the dog play area! It's definitely a hidden gem! There are different sections for the dog play area, playground and where you hike to enjoy a 360 view of the city. You can actually drive and park near Corona Heights summit where the view of the city is. But if you plan on taking your dog, there's lower section where the dog play area is located.", "author": "Angelie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "Best place for great views of the city. I've came here once on a weekend and once on a Monday. When I went during the week there was hardly anyone there. I think parking is limited to two hours but no meters :) The weekends get a little busier which makes parking kind of tough, but that's typical SF. You can get great clear views and see the fog rolling in behind you as well. There's a few boulders you can climb on which depending on where you sit, kind of blocks the wind.  It gets super windy/cold up there even if it's not a windy day. Would really recommend bringing  a scarf and hat.\n\nWouldn't really call it a hike. There's just a lot of stairs to get to the top. Not bad at all. \n\nI'd definitely come here during the week if you can! Would love to come back at night too. \n\nAs for dogs, I only saw one and from my two times coming here people seem to do a good job pick up after them and keeping them on their leashes.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "Walk from the 24th & Mission to 16th & Castro looking up for the way up. Quite a good exercise! You have to walk to States street to keep on going up and find the entrance of the park. \nNice view of the city and a fun way to do something around the city penniless and worth every step!", "author": "Florence D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "I dig this park! I never even knew it was here, but I feel like it gives you the same beautiful views you'd get at the always cloudy Twin Peaks but for less effort! My friend and I were traveling from Land's End to Mission when Google Maps routed us past this park. We saw the giant hills and knew that we needed to park and take a walk up this hill to see what we were missing. Street parking wasn't terribly difficult to find near the park--and it doesn't seem like a super frequented park since there weren't that many people there.\n\nAnyways, it's a light 5-minute walk up paved steps to get to the top. We went the day after #hellastorm so it was pretty muddy and gross, but I'm sure it would have been lovely on a normal day. The views are SPECTACULAR. I think the photos on Yelp definitely do it justice. You're very much almost in the center ish area of SF so you get great views to the north, east, and south. I don't remember views of the west, but maybe we just forgot to check. Anyways I just dig the place since it gives really nice views--not sure how it would hold up in the fog? Maybe just as well since it's not very high up yet you're still able to see a lot of SF.\n\ntldr; awesome park, definitely worth stopping by if you want some nice views of sf!", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "There are many places in the city where you can get a good view and Corona Heights is one of those places!  A popular dog friendly park, CH is just a hop and skip away from all the madness of the bustling city.  It's tranquil up at the peak, but not entirely secluded where you will feel unsafe.  There are 360 degree views of SF.  You can see both bridges and everything in between and beyond.  There is a paved main trail that leads up to the summit as well as other hiking trails along the mountain.  Great place for photo ops.  Lots of locals as well as tourists tend to gather here.  Of course, there are lots of dogs running around too.", "author": "Liv A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "A mini getaway in the city with great views. I usually come here with my dog. If you need to drive, parking is usually easy too.", "author": "Nikki S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-10", "description": "I love the place and have been visiting it my entire life. When I was a kid I had little league practice on the field by the tennis courts. I was at the Museum so often the animals recognized me. Here's my problem: This mountain was always known as Rocky Mountain. That's what it was called when I was a kid, a teen, 20's, 30's, 40's. Now it has another name just like what newbies call \"Kite Hill\", really catchy, The kids who grew up there in the 60's, 70's, 80's, we called it Solari Hill after the dairy Farmer who owned it 200 years ago. People talk about discovering these areas, that they are \"hidden gems\". Maybe so but I'm beginning to understand how Native Americans must have felt 400 years ago.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "If twin peaks is too windy, this is the place to be! I can imagine myself watching fireworks here in the near future... Oops that was suppose to be my secret.. Oh well what good is a secret if you can't tell anyone?!\n\nI've came here during the day and nights, and the nights are my favorite because the view of SF is just breathtaking, but BEWARE there are sneaky THIRSTYYYY mosquitos everywhere!!! \n\nI got at least 8 last night :'(", "author": "Jamila W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "This is Benji and my favorite park in SF. Street parking is easy and the hike up takes less than 5 minutes. The panoramic view at the top is breathtaking and never gets old. There are also lots of friendly pups for Benji to play with and it's super safe for him to wander around.\n\nWe finish off each visit with some play time in the dog run area. Benji loves the big water bowl and he enjoys being able to play with dogs of all different sizes. I've taken several visitors to this park and everyone agrees that it's a winner.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "Recommendation: Great place for a view of the city and minor climbing on rocks. Very windy, when we went. Cool! \n\nI went here with friends this past weekend during a trek around the mission, and this was one of the highlights of the day! We were somewhat disappointed when we had to climb hill after hill just to find another one waiting, but once we got to the top we were happy we made the climb. The 360 degree view of the city was fantastic! The Sutro Tower was just peeking out beyond the clouds, the skyline was at the extent of our vision towards the east, and the Mission sprawled out at our feet had an incredible amount of diversity. Looking down in all directions, perched at the top of the rock formation at the summer, we felt like kings and queens. \n\nI don't know how much of a \"dog park\" this is, but even if that is what the place is marketed as, it was great as a people park too! We started out on 16th Street looking for an entrance there, but the hole in the fence had been patched up. We then wandered along Flint Street until we found the steps and path that led up past the tennis courts to branch off to the building, but we decided to continue on to the right and head to the bench overlooking the east, where we stopped for a meal. There was a squatter's little camp nestled into the fencing at the bottom of the area though, which detracted a little from the view. After the quick break we continued the climb up the deteriorating wooden/dirt terrace steps up higher, where we took a side path directly up to the summit. It was definitely quite a view, but on our way down (on the opposite side) the path was much easier to follow. I'll definitely be taking people up that west path next time!", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-28", "description": "(+) great for dogs (off leash)\n(+) incredible city view \n(+) water fountains for dogs \n(+) easy, small trail to the top. Not difficult to climb \n\n(-) took us a little time to find, but nonetheless a great place to walk around & play with my dog", "author": "Chelsea R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-06", "description": "I really wanted to love Corona Heights! \nPros: \neasy parking\nbig fenced in area for dogs\ngreat views of the city\n\nCons:\nfenced in area does not have separation for big/small dogs\nlots of dog walkers bring their dogs here to play and some of them can be a little too aggressive (there were a fair share of germans, pit bulls, etc)\n\nmaterial of the doggie play area-if you have a poodle or poodle mix (we have a doodle) the material of the doggie play area really gets matted into their fur. We spent a few hours removing the sharp sticks out of our pup's body and paws. It really gets stuck in there too.\n\nAs long as you are aware of the cons, the pros are really great! We won't be bringing our pooch back just because it takes too much out of mommy and daddy to de-mat her hair!", "author": "Betty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "This is the first park I'd ever visited in San Francisco, and it opened my eyes to how many amazing vantage points of the city there are. The trek up to Corona Heights is quiet and peaceful. It's also a little rocky with dirt paths, so make sure to wear shoes with good grip if possible. I didn't realize that this was a \"dog park\" because people bring their dogs everywhere anyways... but I like that this place has more of a local vibe rather than the more crowded Twin Peaks area. Nice hilly walk!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "The views here rival or even beat those at Twin Peaks! \nMuch less touristy and I hope it stays that way.\n\nParking is minimal to none but is a easy walk from Castro.  \n\nI got so many stellar shots here.  Gosh, I love SF!", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Hands down the best view of the city.  I was wary of even writing this review because I did not want to share this little secret.  Other people have claimed best views int he city.  Grand View Park, Twin Peaks, Coit Tower.  None are as good at this.  Twin Peaks is great if you can catch it on a non cloudy day (almost never).  Coit Tower is blocked by ridiculous high shrubbery.  Grand View Park is nice... but just nice.   Corona Heights Park gives nearly a 360 view of the city on a clear day.  Bring some music and some drinks and enjoy the skyline on a nice day or beautiful night.\nIf you park at the museum it will be a shorter but steeper climb up the steps.  Its a very brief workout for those who never go work out.  An easier walk is to park at the corner of Museum Way and Roosevelt.\nBring a coat.  Even if it's not windy it can get windy on top of the park.\nGreat place to go on the 4th of July.  But get there early.", "author": "Cap P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "An urban hike that is so totally worth the effort and trudge for the near panoramic views of San Francisco at the very top. \n\nWe probably went up the hardest possible way and at time veered off course to make it more difficult for ourselves but in the end, we were rewarded for our effort. It's so nice to take a moment to sit back and admire the city we love to call home and the views here are great.  \n\nIt's easy to get here since the Castro Muni is but a stone's throw away and there are few things better better than rewarding your cardiovascular effort, besides enjoying the views, with a nice adult beverage at one of Castro's many generous happy hours after. Love SF!!!", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "The best view of the city hands-down.  How can you find another chill park to go on a hike away from the hoopla and people surrounding SF?  You can't!  Corona Heights park is perfect for dogs, pups, and people alike.  I've even seen a cat-on-a-leash so it's a perfect park for everyone.\n\nCheck out the view for yourself one day.  Just pick a warm one and you'll be happy. I've heard it gets quite windy up there.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-11", "description": "The view = WIN. AWESOME.\n\nDog park, fenced in area = FAIL.  Why? Because portions of the fence line has either fallen down, or there is NONE, or there are HOLES.  Is this okay for ME? I suppose.  But for the dogs? NO.  This is very unsafe.   The gates need work--they either get stuck or do not lock properly.  Safety first. \n\nThe trails = nice but there are dogs running up from the fenced area (from the holes) up to the trail.  \n\nOverall, this area is quiet, and very good for a short hike. \n\nParking = there's some street parking but be careful to not use Randall Museum's parking, and make sure to read the signs.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "WHAT A BEAUTIFUL VIEW...\n\nI loved this place. \nI was looking for a place to eat outside and saw a park nearby on google maps. So I went to it but didn't realize I had to go up some steep streets. However, once I entered the park, the hike up was not hard at all.\n\nyou get an amazing view of SF from a very high point. \n\nCan't really describe it, but you gotta go and check it out. \n\nThe wind is also pretty strong, so if it's a chilly day, make sure to bring a windbreaker or something. \n\n\nIf you want, I also recommend buying a sandwich from Ike's Place (not that far away) and taking it up here to eat it. \n\n\n\nbeautiful!", "author": "Yong K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "Simply magical.\nThis park has wonderful views of the city, and a nice rock formation you can climb on top of.\nYou can basically see the whole city, and check out the bay, mount Tam and mount Diablo. \nPretty romantic spot, but also pretty good place to bring visiting friends, to show off how great SF is!", "author": "Amira T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "This is an amazingly beautiful and well maintained dog park. A little bit hard to get to, but completely worthwhile. Everyone I've seen there is very nice and polite with their dogs. There's a place to get water for the pups. There is a pretty spectacular view you can take in on a nice little walk.", "author": "K J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "This place has some of the best views in the city and not nearly as many people as some of the other hotspots. Additionally, it's next to Buena Vista Park if you want to get some extra exercise in (the views and surroundings aren't as stunning but it makes for a decent urban park). I like to go to Bacon Bacon afterwards to undo any health benefits I just accomplished", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-07", "description": "Turn down the noise and turn up the quiet in your life. \n\nCorona Heights park is predominantly a dog park, with both a fenced in playground for doggies and a small patch of green for the lil pooch (and their master!) to run around.\n\nLocated amidst a residential area of Twin Peaks/Upper Castro, this park is located on Roosevelt Ave, near the Randall Museum. The park itself is not that big, but it has this amazing rock formation, can be easily climbed but there are no rails, so be careful. When you reach the peak, you'll feel the strong winds but will marvel at the unobstructed views of downtown SF and Twin Peaks. \n\nYou can always come here and find that it's never crowded. It's almost as if, this is SF's best kept secret.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-01", "description": "Cute little \"hike\" to bring your pups. By hike, I mean five minute walk. The hike to the top is super short and easy to get to. I went on a weekday and there was a lot of people at the top so I didn't get a chance to sit down and enjoy the view. I decided to check out the off leash play area and it was your typical dirt area that was fenced. I prefer dog parks with grass because with my dog running around like an energizer bunny, dust always gets into my eyes. It's a nice place to check out but i probably wouldn't come back just because the hike is not strenuous enough to tire out my pitbull puppy!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "Sweeping views from GG bridge to the west and bay bridge to the east. An enclosed dog run with watering station.  Nice  incline path to the peak.  A few drought tolerant landscaped areas,  and dispersed wooden benches to sit and take in the elevated hideaway.  \n\nCaution: SF residence snap at you if you don't pick up ur dog's poop after 5 seconds.", "author": "Cole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Amazing you can get such awesome views of the city with such a short hike on this group of hiking trails. Unfortunately, the pit bull protected homeless encampments that pop up along some of the trails mean I I probably wouldn't go back alone.  Dusty and exposed, without much greenery.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "When I moved to the Haight several years ago I looked up fenced dogs parks on yelp and Corona Heights Park was the first result. Back then, many of the reviews claimed the walk was ridiculous and up some of the biggest hills in SF. \"Not worth the visit\" was used more than once.\n\nI threw it on my SF \"To See\" bucket list and moved on with my search. Today I finally got around to visiting the park. I am so mad at myself for listening to those reviews. It was an easy walk. I am not sure if you can even call it a hill by SF standards. It was 100% fenced in and no foxtails where in sight. Any review thats says otherwise is old or full of exaggerations. \n\nBoth of my dogs, an old farm lab that moved here with me from Kansas, and an apartment friendly terrier I adopted here had a great time. The lab, my old girl, had a ton of room to run and explore. My terrier found dogs of her tiny stature to hang out with. \n\nI've always said you find the nicest people in any area at a dog park,  and that rings very true here. I now come here every day.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Gorgeous views on top of the hill and beside the dog park. Dog park is spacious and fully enclosed. Be prepared for the 100 mph city winds!", "author": "Julian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "bring yer dawg! Here's a big dog/little dog park with a free-run open space, tennis courts, a rocky bluff, cool views of the city, and it's just a short walk from Buena Vista Park.\n\nRight now, the blackberries are ripening; if you can find a long stick, you'll be lucky enough to grab a few tasty ones!", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Beautiful view on a cloudless night. Good hike through Vulcan Stairway too!", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-23", "description": "I took my two-year-old to Randall Museum and then down the hill to the playground today. The views are great! The playground equipment is old, but the slide is fast, the swings are good, and the sand is deep. \n\nHowever, I don't recommend the park for anyone who isn't comfortable with off-leash dogs having the run of the place. Even though there are two different off-leash areas on the hill, today I saw several dog owners using the fenced in tennis courts to let their dogs chase tennis balls (and pee in the corners), as well as one owner who let her big off-leash dog run into the playground where my toddler was playing, pee on the swingset, and lift its leg on my bag before she called it off. Luckily it didn't go near my son. Plus the dog owners were parking in the disabled spots while their dogs played. This is 30 minutes' observation, by the way. \n\nThe dog people own this park; it's not for kids or anyone else who doesn't enjoy seeing leash laws broken, dog piss everywhere, and taking the chance that one might bite your kid.", "author": "K C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "This is what I love about SF. You can wander 2 blocks away from a major intersections, walk past some houses, and be above the city. Yeah, you kinda gotta work for the view (it's a steep-ass hill, and then a billion stairs), but the view is tots worth it. There are always some cuties up there too.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "I like to jog through this park early in the morning while it's still empty. My favorite time to visit is after it's rain.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "First time experience.\n\nCorona Heights Park has some great views of Castro and of San Francisco.\nYou can really get a workout while walking. Just when you think you've gone as far as you can, you see another pathway up. \nThe view can be just about 360 degrees of San Francisco.\n\nI was on vacation here and I wish I could have brought my dog.\nBut for those that do have dogs, it's a great place to bring them.\nThere's an enclosed area for them to run and play.\n\nIt can be a little chilly or windy depending on the day, so always make sure to bring a light jacket. Also make sure you have some comfortable and decent walking shoes as it's mainly dirt and rocks \n\nAlso the day that I went  it didn't seem too crowded.\nSo in certain spots of the park you can have moments to yourself.\n\nThis could also be great photo ops for great sunset/sunrise pics.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-11", "description": "One of the best views of SF but given that the SF lacks the architectural uniqueness of Chicago or the massive skyscrapers of Manhattan, there is something left to be desired. Nonetheless, it is sill a breath of fresh air to soak in the views on a clear day (sans tourists of course) on top of the park here. When it comes to skyline view, nothing comes close to the view from Marin Headlands / Golden Gate Bridge but from this side of town, no other public space quite matches up to the offering Corona Heights Park provides.", "author": "E E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "This was sold to us as an \"urban hike\", which is probably 3/4 right.\n\nUrban - utterly fantastic views of the city, no yelp photo has done it right justice. I'd say fairly comparable to Bernal Heights or Twin Peaks, except having a true panorama with views over to Potrero and further south.\n\nHike - more like a hearty stroll up some stairs.  It'll take 10-15 minutes of moderate walking.  If you're an SF resident I doubt you'd struggle, especially if you regularly climb up from the Marina via Baker.\n\nThere's a large mulched dog park on one side, we took our mutt and he enjoyed.  It didn't get too busy, maybe six dogs at midday on a gorgeous Saturday.\n\nBlock an hour off one weekend and come check it out.  Come before noon for easy parking at the museum.", "author": "Scottie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "A hidden gem, even for a local such as I!  Absolutely gorgeous!  Yesterday, I was with 1 Singaporean tourist  friend at the Randall Museum.  I hadn't been there in such a long time, but I knew it was free and, near the parking lot, had an awesome view of SF.  As we were walking into the museum, my tourist friend noticed a person up on the peak and asked how he got up there.  Initially not knowing about this, I told him I didn't know so we shrugged it off and enjoyed the museum. \n\nI'm so glad he noticed the person because after our short visit to the museum, we decided to take a \"detour\" to find out how the person went up the mountain.  We walk to the side of the museum and, lo and behold, we see a hiking trail; my tourist friend got so excited he decided to run up the long, but not-so-steep stairs, while I took my time climbing them.  Turn around, and WOW....welcome to SF indeed!  The city in all its glory!  Definitely a better view than the daytime view at Twin Peaks (Twin Peaks is better for the night view of the city).  Because there were flora in the way, I was motivated to continue to want to get a better view.  I finally reach the top and that 360 view was absolutely breath-taking.  \n\nWith the current weather feeling like Indian-summer, SF and Bay Area locals MUST hike this trail before the fog rolls and/or the rains arrive.  This is THE most local place to stop and and quietly soak in the beauty of the city.  No words can describe the view.  Absolutely amazing...this has become my favorite hiking spot.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "A Flash Of Flamboyance: For the sartorially artful, there's more to spring's equinox than a botanical blossoming; it's a rallying call for adventure in this exuberant and incredibly diverse country. We hike up into Corona Heights to be closer to the sun in all its majestic glory and to inject some vitality of nature into one's being. A sense of color and spectacular celebration on San Francisco's highest mountain-where every turn dazzles more than the turn before. Where every nuance speaks of pageantry and a sense of life and wonder unlike any place on earth.", "author": "Saurabh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-04", "description": "All the tourist flock to Twin Peaks, but if you're looking for a more intimate view of the city and don't mind climbing some steps, this is worth it to check out.  From between the rocks at the middle of the park, you'll get a 270 degree view of the city, including Pacific Heights, Downtown, and the Mission / Castro.  \n\nYou can sneak in at night too, if you're looking for a make-out spot.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "I think this was the unspoken place to take someone you were puttin' the moves on  amongst my group of friends back in our early 20's. I mean, the view is so damn romantic. \n\nIts unsurprising then that my now-husband picked this location to propose (via Geocache, for you nerds). Keep this spot in mind, kids - V-Day is just around the corner!", "author": "Monica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-19", "description": "Great view! Great park if you want to take a walk (or without) with your dog. I would highly recommend going just for the view alone!\n\nHowever, I am not a fan of the fenced-in dog area. I've been there several times and it has been really crowded with at least one dog fight. Definitely not something I want to expose my large breed puppy to... \n\nPositives:\ndouble gated entrance\nwater area\ngreat view", "author": "J F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "Another San Francisco gem. An almost meditative experience walking up and around the peak.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-10", "description": "It's a nice park, but I'm writing about the dog run--the fenced in one.\n\nI took my dog--who I've had about 4 months--here almost every day. Most of the other dog owners are attentive, at least somewhat, but my dog contracted two illnesses here in a matter of two months--Canine Corona Virus, which made her sick for two weeks during which she lost 10% of her body weight and we spent a significant fortune at the vet, and Giardia, for which she had to take a bunch of heavy duty meds and we had to be extra careful about picking up poop so our own yard did not become chronically infected.\n\nSo, if you are a dog owner, I'd try to avoid any fenced in dog parks..especially this one.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Easy, accessible climb that ends with a breathtaking 360 view of the entire city. Quick walk from Buena Vista park.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "Little old lady in a Rascal Scooter need not apply.\n\nThis is not a long hike by any means but it is a great 5-10 minute climb up rocky stairs to an amazing panoramic view of the Bay from one of the peaks high above.\n\nI love climbing all the way to the absolute top so that the wind whips around you and you feel like you're ascending above the city. \n\nThe only bad thing I could say is that despite what Randy Newman may tell you, it ain't lonely at the top. \n\nOne time I got up there and had to hear two nerds drone on about API calls while another group smoked cigarettes and blasted some pretty ferocious metal music through a smartphone speaker (not pleasant!", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-29", "description": "I'm not sure why I couldn't find any postings for Corona Heights, perhaps it's included in the review for Randall Museum (http://www.yelp.com/biz/N9bEFoatbzaXjPHfbbUH4w), but I thought this park, with one of my favorite views of the city, deserved its own posting. \n\nIf you've never climbed up the hill at Corona Heights to enjoy the great view (see photos) you've got to try it.  One of the several ways to reach the peak is to street park your vehicle at the corner of Roosevelt Way and Museum Way.  There is an entrance with a path leading to the peak with dog play area to the left.  The climb is a bit steep at points, but nothing difficult.  You also don't need a car since this park is very close to Castro Street Station on MUNI.  \n\nWhile the altitude here is lower than Twin Peaks (http://www.yelp.com/biz/WV2fVK6OJfzn2BkRGpbP7A), you are closer to the city so you get to enjoy the details of buildings from Civic Center and Hayes Valley to Potrero Hill and Mission.  The best part was the quiet and peaceful environment it provided for you to sit back and relax, unlike tourist bus invated Twin Peaks.  Also, I think this view is far better than the view from the peak of Buena Vista Park (http://www.yelp.com/biz/M-oyI3PMmr9FIECvb-21YA) where the trees block most of the view.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Friend of mine showed me this park today, I have been living in SF for 10 years and never stumbled upon it. Interesting day to explore when is 40 degrees outside not counting the wind factor and you forgot your gloves, after about two min. I could not feel my fingers. Great views with picture opportunities.", "author": "Magda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "I recently went on a \"tour\" of the \"hills of SF.\" There are quite a few, and Corona Heights is one of the more unique spots.\n\nThe rocks at the pinnacle of the park are really cool. The view is just great, as are all the views in SF really.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "Great little park. I approached it from the Castro and just went straight up the hill on 16th. Not too steep of a climb and the rock formations are really cool. The wind up here is unreal and even though you are a quick jaunt back down to the neighborhoods below, you feel miles away from the hustle & bustle below.\nGreat views of the bay, downtown, and Twin Peaks. Not a true 360 view like other city hills but still glorious!\nRight now there is some trail maintenance going on, but you can still get to the top.\nMinus one star because on the rocks at the top is a ton of broken glass-c'mon!!!", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Spectacular views of the city. Short little climb up stairs rather than a hike. Perfect for kids as the climb is easy and Randall Museum is right below. Free parking and free museum admission make it a perfect day for the fam.", "author": "Ish V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "I love this park! Many great dogs and owners frequent this run, and it is kept in good shape. In fact, they're even fixing the low fence around the back right now, so that will be nice once it's done! I drive here, and parking in the area has never been an issue.", "author": "Veronica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "Corona Heights is slightly off the beaten tourist path, but that's what makes this park a great locals-only gem! I've lived in SF for a full year now, and I only just discovered Corona Heights a couple weeks ago. Tucked away amongst a warren of neighborhood residences, the easy hike up to the peak offers a stunning view of the city. There's also a fully enclosed dog run (no grass, only woodchips), tennis courts, and the Randall Museum (free admission!). \n\nI love to bring my pup Riley here to meet new canine friends, but it's also great to come solo and meditate on life while taking in the scenic vistas and expansive city below you. The tourists can have Twin Peaks; let's keep Corona Heights an unspoiled local secret ;)", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "There are some awesome rocks on top of this park that are a fairly easy hike and are great for taking photos! Great views of the city. A friend and I walked here from Castro and it was a good work out.", "author": "Abby S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-06", "description": "Not the best dog park. The dog park is really small with a lot of big dogs. It's full of dirt and it's just not in the best condition. There is a little hike but it's not all that great.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "This place is great! It's the first time I go there with my dog. He found many friends to play with! There are two dog parks, one is at the bottom and the other one at the top of the mountain. There's also a hiking trail that goes on the summit of the mountain. It's definitely worth hiking it, the view of SF is great from there. Next time, I will try the park at the bottom of the mountain.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-13", "description": "Took a stroll with my best friend up this park for a good night view. Gotta say, I'm impressed. I love sight-seeing & I love exploring new sight seeing places so this place really hit the spot. \n\nIt was pitch black when we came up, but thank goodness for flashlights! I'll definitely come back for a day view since I hear so many positive reviews about it!", "author": "Anna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-16", "description": "I am biased.  I admit that right away.  I love Corona Heights Park because of its wonderful views, great location, and relative obscurity.  I REALLY love Corona Heights Park because its where my fiance proposed to me. \n\nEven if you aren't planning on proposing (or getting proposed to), Corona Heights is a great spot in the city that a ton of people don't know about.  It's like the local's Twin Peaks.  \n\nI highly suggest going up there if you have a dog, if you want a walk, or if you just want to commit to spending the rest of your life with someone!", "author": "Amy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "I come here at least weekly. I used to be able to have the place to myself, maybe that's cuz it was winter. Now it's hard to find a solo rock, stare into the distance, and think about life.... without some coffee drinking G-rods walking in on my shiat. But, oh well. The only constant is change.\n\nThis spot rules, great views of the city. A good place to bring new visitors to get a geographical sense of the city and point out some major landmarks (but don't come while I'm there).\n\n\nIt can get REAL windy and chilly up here, so be prepared!", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Hiked around a bit since the park is right next to the Randall Museum. Corona Heights offers some stunning views of SF, it's definitely worth the trek up all those stairs! =D", "author": "Sam F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "\"Where are you going?\"\n\"Uranus.\"\n\"HAHA no really...where are you going?\"\n\"Uranus...\"\n\nJust off of 17th and Uranus (Street), this hill is a secret little spot with a great view of the city. I never knew the real name for this spot; my friends and I always call it \"Uranus\". Unlike Twin Peaks, you can't park your car on this hill. Park your car on the street and walk up the dirt path road until you get to the top (where the big rocks are). \n\nReasons why \"Uranus\" is better than Twin Peaks:\n*Quieter\n*Less foot-traffic\n*Not super touristy \n*Equally great view of SF (City Hall, Downtown skyline, Bay Bridge, etc.)\n*More secluded \n\nHike up this hill from the Randall Museum sign or through the back parking lot. Best to come on a clear night. Breathtaking, indeed.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-12", "description": "Unknown Graffiti Thugs Leaving Their Imprint On The Rock of Corona Heights! \nNothing nice or funny or good about it.  A thug or group of thugs painted up what needed no improvement, the Rock above Corona Heights, that has a commanding view of this area, right across the street.  Rotten.  Just rotted values now imposed on all of the rest of us.  Unlike Andy Rooney, I will not apolgise, not for this one.  It was nice \"as is\" without the spray painted evidence of a complete lack of understanding of  the difference between right & wrong.  The Mount Rushmore approach, in this case, does not work at all.  Whoever you are, what you did was wrong.  I hope someday you grow up & learn to give back instead of taking away.  For now, your evidence stands as a testimony to a hate-crime against Nature.    Shame on you!  Shame on you!  You know better.", "author": "Thomas O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "Nice fenced in park with fantastic city views.  Willie had a blast running around with dozens of tiny dogs at the monthly Chihuahua Cha Cha Cha (think Pug Sunday with Chihuahuas...you gotta see it to believe it)\n-1 star for the nasty wind and the poor dog that was made to wear a skirt by it's owner.  Please people, if you must dress your dog do so with dignity!", "author": "phil h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Hidden gem. The view from the peak is unbelievable, but also explore its other nooks and crannies. There are some great little paths through the woods worth exploring as well. Great for dogs, have both an official fenced-in dog park, and some de facto lawns that have been appropriated for same.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "Holy sweet God damn...\n\nThe view is nuts. \n\nYou thought Twin Peaks were nice? Think again... this hidden gem is hands down the best view of the city, without question. Grab a seat against a rock so the wind doesn't blow you over... and you're sittin at one of San Francisco's best kept secrets.\n\nWhat's better? No tourists!\n\nBest view. No question. 5 stars.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "SF's parks are astounding. They're through out the entire city, and they vary from sea level hollows to a park like this: a rocky rock collection with incredible views of the city, with a wood chipped clearing of a fenced in dog park, tucked in a neighborhood, with a panoramic view of the city. Coming from other cities such as LA and Indianapolis, these parks are a true gift. This park in particular... accessible, dog friendly (and controlled with a fence), and dirt trails leading up to the rock formation to rest atop the city.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "If you make it to the top of the hill at this park, you can see the entire city. If you're looking for a peaceful spot away from the hustle and bustle, this would be it. Who says you can't escape? There's always someone walking their dog or just wandering around.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "My friend just moved in not too far from this peak and park, and had always wanted to explore it.  We came from the direction of Market and wondered through the beautiful neighborhood around the park.  The homes are amazing!  As we made our way up to the peak, the view opened up and is breath taking.  The walk is easy.  Twin Peaks was my favorite view of the city, but this is better because it is more intimate.", "author": "Shelby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-26", "description": "Corona Heights Park is just an amazing spot to go to on a fantastic San Francisco day.\n\nAlthough, Bernal Heights Hill may have a better 360 view of San Francisco, Corona Heights Park's view is quite breathtaking as well.\nI really enjoy the intimate atmosphere when you reach Corona's peak. You can sit at a plateau that overlooks all of eastern San Francisco and beyond! You can also move a little further up on the sides to sit in the shade behind some large rocks.\n\nBring a friend and bring another friend (the dog) because they will thank you for it! Your dog will enjoy climbing the hill or running around in a gated area at the base of the hill. A large grass area will give your best friend ample room to stretch out.\n\nAnd for you first timers, stop by the Randall Museum to check out some free exhibits!", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-22", "description": "From the pug:\n\nYeah, this place was pretty sweet.  I went to the fully enclosed, fenced-in dog section and had a pretty sweet time.  Yeah.  They've got some sweet toilets and there was a lot of room to run around.  Saw some bitches, sniffed some sweet ass.  Yeah, it was pretty sweet.  They even have a nice water bar for drinks.  The place was real clean, too--owners seem pretty sweet on picking up all of our dung heaps.  Yeah.", "author": "Daryl E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "I didn't even know this park existed, and so close to the Castro. It is a little small but sure does pack a punch. It's beautiful!! Getting there is half the battle as it's located on a very steep hill. The summit looks like you're in the Southwest somewhere, with a  big rock. Views of the city are gorgeous. Not  many trails but perfect for walking your dog. And just sitting at the summit looking at the beautiful city I live in.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-27", "description": "This has been one of my favorite parks for a long time.  As a 5 year old I used to go to the Randall Museum for the wood shop and nature classes.   Now I still enjoy coming to this place because of its beautiful views and and great surrounding area.\n\nThis park has a lot to it:  two playgrounds, an off the lease dog area, a children's museum, a tennis court, neighborhood garden patches, and some amazing sights of the city.\n\nDown at the base near Beaver street there is even a small pet cemetery that lines a cement wall next to the playground.  And there are a few routes for rock climbing down there as well, known as the Beaver Street Walls.\n\nKind of a tangent here, but I remember when I was 14 years old I was hiking over the rock crop at the top and I came across a young couple getting intimate on the rocks...by which I mean a guy had his girl bent over a rock and was going to town.  A bit awkward for me at the time...", "author": "Kevin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-03", "description": "Nice view, but not as high up as I thought it would be. Was fairly dirty (dirt and woodchips) and saw some foxtails on the side which are a nono for your pup.", "author": "E T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "Half the fun in going to a dog park is watching your dog run amok with other dogs. Unfortunately, on today's 11am mission, ample dogs wasn't the scenario. The pros here though is definitely the lovely view and also the mulch groundwork. Unlike some other dog parks where the dust kicks up with every romp after some bitch, at Corona Heights, you won't have to worry about a wash right after. Another perk is that it's fenced in.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "I truly love this place, so much so that I come here every morning.  Its never overly busy, except for maybe all the dog walkers, but I love that since I bring my dog here as well and he plays with the many doggies there.  \nIts a perfect little hike around the mountain and the views are spectacular.  Your not really supposed to let your dog off leash outside of the gated area, but everyone does and its fine.  I highly recommend coming here for the view, to walk your dog, or simply to escape the chaos of city life only a few blocks away from the Haight.", "author": "Molly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "I really love this park. The views are awesome, the fenced dog park is pretty big and is all wood chips. The hill next to dog park is a good little hike and gives you additional views. Be aware that there is improvements currently being made so part of the trials are closed.", "author": "Russell D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "My favorite run in the city is a run up the hill to the top of Corona Heights Park.  The views are spectacular, it reminds you a bit of the desert, and the dogs add to the atmosphere.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-26", "description": "The views are fantastic!  \n\nWalking down from Buena Vista Park, I didn't think this hill would be very impressive.  I was so wrong.  The red rock formations were beautiful, the trails up them were easy, and the views from the top of the rocks were just like I was in the sky.  \n\nIn the sky.  Really.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "I *love* coming here with my little monster. In fact, I would even go so far as to say that this is my favorite single spot in the entire city.  The dogs (and owners) tend to be much more mellow than at other dog parks, e.g., Duboce, and it's never too crowded. Even if you don't have a dog, it's a lovely little walk to the top, where you'll get great unparalleled views of the city. Whenever I need a break from life I walk up here with my dog, bring a book to read, and let him run wild.", "author": "Andie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-24", "description": "Great space for dogs to run around.  The fenced in area doesn't have any grass, so that is kind of a bummer.  But what I like about this place is that it is more of a \"locals\" hangout - meaning it isn't a place that everyone goes to and the locals are really quite nice.  There is also a grassy area and you aren't supposed to have your dog off the leash in this area, but we all do it anyway (WHOOPS!).\n\nThere is also a great hill you can climb.  And the views of The City are spectacular.  A great place to go on a sunny and warm day.\n\nWas just there today, and oddly enough saw a Garter Snake.  Actually, the dog saw it first.  Scared me more than it did her.", "author": "Jason I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "Fenced Dog park...with an outstanding San Francisco View.\nThe entrance to the dog park as well as a large portion of the fenced in park itself can be SUPER muddy after wet weather...don't wear your good shoes...and be prepared for your pup to get a bit dirty. They do have a convenient little area to hose off your dog..bring a towel, although the bath area is inside the fence, and doesn't solve the muddy entrance situation. Just know you and your buddy might get dirty....and that is ok!\nDuring the weekdays there seems to be A LOT of dogs. This seems to be a hot spot for dog walkers. On the day we were there, there was two dog walkers; one with 14 dogs and the other with 11, plus one other dog. I didn't have an issue with this, as my dog is very social, and friendly; however if your dog is more on the shy or timid side this could be overwhelming. \nLucy had a good time, and really enjoyed rolling in the mud and running around like a maniac in the large fenced area.\nMaybe next time we will hike up the hill at the larger area of the park.", "author": "Kelle K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-25", "description": "Went there recently. It's a medium-sized park, all dirt -- and this year's early rains made it way too muddy for any good play. It does have a great view, but otherwise not recommended.", "author": "Tom R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "Amazing views--it's a tough climb if you're running it, but when you get to the top, it really makes the racing heart worth it.  Love to sit up here after the nearly 400ft. climb from Market & 16th.  and it's usually empty, so you can get a much appreciated moment alone in the bustling city.", "author": "John K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "I love this park and my dog loves it too! He gets super excited everytime we pull up to it. I know our dog walker takes him here sometimes too which is great.\n\nI never get to go during the week so I'm not sure what it's like but on the weekends it never seems very crowded. I think the time I was there with the most dogs there were like 5 dogs in the park. It's not particularly huge and there are woodchips on the ground in the fenced in area.\n\nThe little hike to the top of that hill is awesome and you get a really sweet panorama view of the city- and if you have a dog with good recall you can (probably shouldn't) walk with them up the trail. \n\nI have never encountered any bad dogs there, never seen a dog fight, nothing like that. It's a quiet and sweet place to take your dog. It gets a little boring at times though if what you like is meeting other people and their dogs.", "author": "Betty K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "I'm a fan of this dog park as it has amazing views of the city and is never crowded.  It's also clean compared to the others.  There's even a small trail behind the park for more kodak moments.  It is pretty small though, but that's SF for you.", "author": "Stellan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "In March 1991 Phil died. His body was cremated. After the main funeral, his parents had a ceremony on this hill and released his ashes at the very tippy top. \n\nAt the time, I wasn't thinking too clearly and ended up standing in the worst possible spot for this event. When Phil's dad opened the box, I received a face full of human ashes.  \n\nI was already in shock from Phil's death so when his ashes hit me and some went in my mouth, I didn't freak out. I just stood there with my mouth gaping and tears streaming down my face. \n\nPhil's parents were already wary of me because at the main funeral service I got in a drunken fist fight with my then bf 's ex-girlfriend. I don't remember what exactly happened, I do remember going blank with rage and attacking her.  She was clearly in the wrong place at the wrong time. Plus, she barely knew Phil. Condolences my ass. \n\nSo, when Phi's ashes hit me, I tried to remain calm and be considerate to his family. My screaming in terror would have made the situation worse. I think they appreciated this because they let me into their home for dinner.\n\nLater that day I had a craving for human flesh but that was curbed by eating funeral cake and then taking a steady cocktail of pills from Kaiser Permanente. \n\nI rarely visit this park but when I do, I think of Phil. \n\nRIP Philthy Phil!", "author": "Mitsi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-07", "description": "If you knew me in high school (or read my reviews with a stalker-like obsession...in which case, thanks! ) you would know that I was a nerd. Oh yes...dress code, shy, AP English, AP History, AP Spanish, AP Art History, Honors Calculus nerd. \n\nMy one \"cool\" factor was that I played tennis...and yes, I wore the short white skirt.  At a catholic school, being able to wear a short ass booty skirt  on game days made the rest of the nerdiness fade away....for a while at least. \n\nI love tennis.  I'm not great but I'm not bad.  I even know a bunch of little racquet tricks to pick up a ball off the ground....makes me feel kinda cool in a dorky way.  \n\nGood public tennis courts in SF are almost as hard to find as cute straight men. There are two courts in this park...one is faded and has a loose net. The other is better, darker and anchored correctly. Though it's sometimes windy as all hell the fence is high enough for rogue tennis balls to stay inside the courts. This tennis court also has its own parking and it's not very busy at all.  \n\nYou know what? Don't go here....because then I'll have to find somewhere else to play. Somewhere where I'll need to wear that booty skirt again just to persuade a couple guys to let me take over their court.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "Poor people eat a lot of carbs. I know this because I am one.\n\nWhen I quit my job I just assumed people would be lining up at the door to hire me. I mean, I am ME. And have you met me? \n\nSadly, no one ever lined up, and my savings account has gone from plentiful to painful to even look at.\n\nSo I've had to cut luxuries, like vegetables and fish, out of my diet.\n\nI've been living off pasta, rice, risotto, potatoes, quinoa, and rice, and rice and rice for the past three months.\n\nThe rice is showing up on my thighs. No really, instead of cottage cheese thighs, I actually have rice kernel thighs.\n\nSo I thought maybe, just maybe, instead of sitting on the couch for 24 hours a day, that I should spend 1 or 2 of those hours trying to reduce my rice thighs.\n\nYesterday I began walking. I took turns on streets I've never been down. I hiked steps I've never dreamed were there. I ogled homes I'll never be able to afford. And I ran into Corona Heights Park.\n\nI literally ran into it. The sign I mean. And I stared in awe at that hidden natural wonder of San Francisco and scolded myself for not finding it earlier.\n\nThere were about 8 million dogs running around the fenced-in dog area. Some ran along the fence as I grinned ridiculously at them and asked them \"who's cute?\" Some, like the one with the Hannibal Lecter mask, made me stagger away from the fence a little, but continue to grin like an idiot.\n\nI walked up to where the benches were and looked out over my great city and said a quick thanks to the carbs for giving me the energy not to pass out from exhaustion and lack of exercise on my way to this phenomenal park.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "One of my go-to spots.  It's the local's version of Twin Peaks.  Full panoramic views.  Take the stairs on up, and you will not be disappointed.  Make sure to bust out that iPhone and start snapping those photos.  Note: you won't be able to see the Golden Gate bridge (for those tourist's out there) but you can see straight down Market and a great view of this fine city.  Definitely dog-friendly, and Randall Museum also happens to be next door for those interested.", "author": "Alice Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-11", "description": "Lovely little park in the midst of residences. We came for the rock wall, which skews towards intermediate climbers, but appreciated the kids running around the playground and pet cemetery. There are community gardens, tennis courts and a dog park with incredible views of the city and Sutro Tower. Lots of outdoor fun, yipee!", "author": "Ligaya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "I know you are scared. You have always eyed Corona Heights while drinking a beer at The Cafe or scopin' for bois at Cafe Flor. But you always think, \"dang, that's a big-ass hill. Me and my fat-ass could never make it up there.\"\n\nOh, my friend, you can!\n\nCorona Heights looks intimidating, and like it would be a massive hike. I eyed it from my apartment for a freakin' year before I laced up the hiking shoes, layered on the clothes, and geared up for the big hike.\n\nOh, how I laughed at myself when I got to the top. 12 minute max *walk* from Church and Market. The hardest part of the hike is the couple of residential blocks up from the Castro. Piece of cake! (cake? hmmmmm.....)\n\nBut the view! Oh, the view. It is surreal. Clear to Oakland on a good day.\n\nDo it!", "author": "S F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "As a child growing up a few blocks away I used to come up here all the time! It's a secret place that many people outside the neighborhood don't know about, great dog park nearby as well. Climb to the top of the heights and you can see the entire city! It's a nostalgic and beautiful place.", "author": "S. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "Beautiful view and great big space for the dogs to run around fenced in. Good group of dogs and people. Parking is easy, too. So glad I found it!", "author": "Sara R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-12", "description": "After watching my dog play at duboce park,\nAnd with a smile on his face and an  unbridled burst of energy almost sprint into the oncoming traffic, I did a search for fenced dog park and ended up here.  It's a cool spot and Very beautiful, feels San Francisco  and is defiantly fenced in. It's clean, has water and the whole nine yards.\n\nSo why three stars? There is a huge natural wall on the left side of the park.  The fence that limits where the dogs can go is at the trail above  the wall and not at the base of the natural wall. \n Sounds picky right? \nWell I watched my dog and two others run up the extreme left corner of the fenced area up kind of a run off area and end up on  a ledge on top of the wall  that was maybe a foot wide..   My safe fenced in dog park led to my puppies first ever mountain goat play time as he played on top of a cliff that would have been about a 30 foot drop for the first twenty feet.\n \nNothing happened and  he was fine.\nNervous owner? Abosultely.  Undue worry? Probably.  \nBut my dog loves to wrestle and play and is a puppy who has misgaged his surroundings before.   I think next time I might take my chances with the oncoming traffic of duboce.", "author": "rob c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-28", "description": "My favorite view in the city, and I'd like to think I've tried them all.   You can see downtown, the mission, market, civic center, potrero hill, noe valley, and the bay bridge.  (Golden Gate bridge is obstructed from this location.)\n\nAs others have pointed out, it is not the highest, but the view from here is more immediate and intimate.  This is the place to perch and watch for crimes in progress with your supervision.\n\nYou can expect to see a few other people up there most nights, but people are generally respectful of each other's privacy.  The stabbing and raping crowd has yet to discover this neighborhood treasure.\n\nIf you go at night, be aware that the pathway is very dark and without lighting.  Once you make your way to the top, you may also find the wind very cold, so dress accordingly.", "author": "joe b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "When I was living around upper Market Street, I saw this dusty and brown hilltop that kept saying \"come up check me out!\"  What a great mini-hike in the center of the city!\n\nGo to brunch in the Castro, walk up the hill for a view, take your tennis racket (if you want to play a game), or bring your dog - it's all good as you wander around this great cityscape!", "author": "Dan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-24", "description": "Nice little secret park with amazing overlooks of the city. There are some steps, but totally doable if your'e in reasonably good health. There are some interesting rock formations and a cool dogrun as wel.", "author": "Celeste T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "Best 360 view of the city! \n\nWe took a picnic and a box of girl scout cookies on a clear Sunday and sat on a rock to soak up the view. Lots of cute, friendly dogs and owners running around. Not crowded or too many kids. Its a pretty easy hike up to the top. I wouldn't go after it rains because there is potential for mud. \n\nPlus you can take the 37 bus there, which is always nice and empty!\n\nIf you've never been, go with a camera! Its inspiring!", "author": "Halley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "There is such a thing as urban hiking!  We decided to walk up 14th Street from the Mission on a whim one day and stumbled onto this park.  The amazing views from the top made the uphill trek totally worth it.  There's also a dog park at the base and rocks you can climb on at the top.  \n\nP.S. We stopped at a little corner store about halfway up 14th Street, where we got some awesome fresh-squeezed orange juice in a cute, little mini-gallon bottle.  Highly recommended.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "My park in the middle of the City. \n\nMy early morning wake up walk. \n\nMy after work shake off the day jaunt. \n\nMy watch the wonder of the fog whiping away the day seat. \n\nSearching for a bit of the world in the middle of the City, see you on top of the rocks.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "Stunning views.  Tourist-Free.  Nice fenced in dog area.", "author": "Brandyn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-23", "description": "Things I like: a. dogs (I squeal at the sight of them, slightly embarassing) b. San Francisco (and views of said city), c. the outdoors, d. hikes, e. good company\n\nAll of these things were encompassed on the hike up to Corona Heights Park. It could only be better if there was a personal sourdough factory at the top that handed me a fresh loaf when I reached the top.", "author": "sholeh m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-14", "description": "This is a quasi-secret spot tucked in btwn the Castro and Buena Vista Park.\n\nThe views aren't as classically postcard or sweepingly spectacular as Twin Peaks - you can really only see 180 degrees (G-Gate Bridge is obstructed) - but the unique angle on the city and the neighborhoods below are more direct and immediate (great photos by Toro E.), and the park's slightly tricky access (Roosevelt Way & Museum Way) and lack of elevation keep the tourists and fog away.\n \nThe park adjoins the Randall Museum - which is great place for kids (if you're into that sort of thing).  There's a fenced-in dog park, and off-leash dogs & owners are also common during post-work pet-walking hours.  But climb the 40 feet or so up the trail to the rocky 'peak' and you often can (feel like you) have the place to yourself. \n\nMeditate as you trace Market's line to the Bay Bridge, listen to the eucalyptus sway in the breeze, sip on your brown-bagged adult beverage of choice, and enjoy the feeling that you're hovering over top of the urban sprawl below. \n\nThe bottom line: The lack of crowds and intimate, quiet solitude Corona affords make it a great 'getaway' within the heart of the city.  \n\nAs Joe B. points out: \"The stabbing and raping crowd has yet to discover this neighborhood treasure.\"  (Too great a line not to be used again.)", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Spectacular views for a dog park. The park is clean and tidy. There werent any dogs when I was here but my dog enjoyed taking a piss and watching the view at the same time.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "I never made it to the top of the hill - little dog was dying to go play in the dog park so we went straight there. The locals were super friendly and since it was lunchtime all the dog-walkers were there. The dogs were all well behaved and I didn't see any trouble between dogs. There must have been at least 25 dogs running around of all sizes and everyone was behaving. \n\nThe dog park is fully fenced and is all dirt/gravel/wood chips but still a great space. There is also water in the fenced area for the dogs.", "author": "Sarcastic T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "Here is why we come here.\n\n1. Our dogs get all excited and act like they are wild coyote babies when we let them loose.\n\n2. We send pictures back home to our east coast friends and they say .... ohhhhhhh...ahhhhhhhh... looks like you guys are in the desert.\n\n\nyeah. it is the desert. closest thing we have to it. there's some scraggily wild grass that sort of resembles desert vegetation. and a few rocks that maybe possibly are the great grandchildren of the grand canyon.\n\nno camels though. minus one star for that. I wanted camels.\n\n\nwe love corona heights park. the dogs love conorona heights park. we all scream for ice cream... i mean corona heights park.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-25", "description": "One of my favorite spots to catch a view in the city.  You can't see GG park but can see all the east side.  Plus it's a pretty short hike from the Castro and usually you'll be the only ones there.  I think the only one that beats it is Twin Peaks.  But how often can you get a beer and then hike up to great views?", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-16", "description": "This park is a really great place to have in the middle of the city!  I went here for a school Ecology project during the spring, and it really does offer an awesome view!  I'm a nature person, so I really loved the different aspects to the park; the restoration efforts, the different flowers and grasses, the butterflies and birds, etc.  It also provides a decent walk that doesn't require too much effort, but since part of it is uphill you can get a decent workout if you jog it.    \n\nThis article is pretty helpful too...  it talks about more specifics about Corona Heights Park.  :D\nhttp://www.examiner.com/x-33222-SF-Walking-Examiner~y2009m12d14-Corona-Heights-Park-a-walk-a-view-a-great-place-to-be", "author": "Jackie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-29", "description": "Damn good dog park.\n\nGood folks who work to preserve it and who are real dog people (ie who understand dog behavior).\n\nAdjacent to a good park with a baseball diamond.", "author": "Sam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-30", "description": "When you need to get outside or get out of the city, but you don't have the time or wheels for a hike, walk up to the tip-top cluster of rocks and just park yourself for a few minutes.  It will likely be windy as hell.  You'll come back down a refreshed kid. It's awesome,  partly because it's just a good rocky hill with no hype, so it's always better than you expect. I don't know why I don't go more often. \nThere is a short way up (dog park) if you need a quicky or longer way if you want to achieve - see directions in the other posts.", "author": "C G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "Another little secret uncovered...\n\nHELLO wonderfully beautiful 360 degree view of San Francisco/San Francisco Bay!", "author": "Misha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-05", "description": "This little gem of a park is inconspicuously tucked between Buena Vista Park and the Castro / Market Area.\n\nLooking east, the summit boasts one of the best views of the down town and greater bay area.  It's not as populated or touristy as Twin Peaks, but more of a tranquil getaway right in the heart of the city. \n\nFrom the lower entrance on 16th and Flint you will find several winding trails through, up and around the park making the way to the top with benches along the way to sit and admire the view.  On the opposite side of the hill at the Roosevelt / Museum Way entrance there is a small green lawn and another area specifically for dogs.\n\nI only wish this place were bigger and covered more area for exploring, but for being right in the center of the city, it's doing pretty darn well for itself.", "author": "Shayna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-03", "description": "This park is just stunning: a pyre of red rock rising up between the Castro (Duboce) and Buena Vista. Off of Roosevelt is a grassy field and great dog run. (I think the first Sunday of the month is the Boston Terrier social.)  Continue down Museum Way to the Randall Museum. Just off States is a playground and tennis courts.\n\nFrom the top of the red rock is an incredible view of the Castro, Mission and the bay. Beautiful sunrises.", "author": "Brad C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-26", "description": "Start out at Home Restaurant,  walk up 14th street, turn left on Alpine Terrace until you hit the Park.  You'll get thighs of steel.  NO JOKE.  That hill is a work-out!  \n\nThis is a total hidden gem in the neighborhood.  This place is great for non-dog owners as well. You can climb up the huge rocks that look like flaky chocolate chips and a get the same view of the city that you'd get from Twin Peaks.  Everyone who knows about this place has probably taken pictures from the top of the rocks.    And when the sun is setting, you wonder how many more gorgeous things in life you get to see just outside your door.", "author": "I love t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-08", "description": "This place is great. Huge open space with tan bark. Bunch of dogs if you come at the right time.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "1. Great for dogs during the day\n2. Beautiful romantic view at night \n3. Cozy, chill, quiet any time, day or night\n\nThis park still feels like an undiscovered gem in the city. Really lovely for a quick hike with views, walk outside or in the surrounding, well-manicured neighborhoods, or for the dogs. I've been going to this park for years, and each time I introduce someone new, it feels like a special experience, particularly with the view from the top of the \"mountain.\"\n\nRegarding dogs, the one thing I would say is that the fenced-in area could use a higher fence on the city-side. Seems a big dilapidated.", "author": "a m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-24", "description": "One of my fave spots in SF.  Be careful climbing those rocks though.\n\nI loved sitting on that one rock that lets you soak in a more detailed view of the city.  \n\nSure, it doesn't beat the panoramic view of Twin Peaks...but, for a more personal photo-op, Corona Heights Park is tough to beat.", "author": "Diego S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "tucked away in the castro, great little urban getaway.  good for a visit any day, though warmer, sunnier days are best. overcast days can get a bit windy. mild climb (depending on your physical condition) up to the summit. very dog friendly. offers some great views of the city, without the need for a car. highly recommend everyone visit at least once.", "author": "Sandy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "I'm not sure if we actually found the full on Corona Heights Park, but I think we found a secret spot. I think their is a secret society of dog owners who come up to this secluded spot in Corona Heights, because everyone we saw up their knew each other and their dogs! They all came at separate times throughout the hour or so that we laid out and ate some lunch. Anyway, I'm pretty sure I'm not allowed to tell you where this spot is, but I will tell you it's fricken awesome! Beautiful view, cute little garden, an empty dingy tennis court (which will be the perfect spot for me to be horrible at tennis in front of no one), and lots of grass to spread out on and get your tan on.", "author": "Casi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-20", "description": "The view!!!\n\nStart out in the Castro and walk up from there (approaching the park from either the south or east...or overshooting and coming back down Roosevelt).  Such a good workout (your buns and thighs will feel it)...and the spectacular view of the city is your reward!\n\nIf you have a pooch with you, he's welcome to come along...and even can roam around off-leash in the fenced in dog park.", "author": "Kimberly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Good views of Castro, Noe Valley, Mission, SOMA, downtown, Portrero Hills, etc. No tourists. Short hike with or without steps. Some cliff rocks you can sit on.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-15", "description": "nice area. \nfenced park is small. My dogs got really dirty because there was mud all over the park. \nreally nice view of the city. \nYou should try to go there and see if your dogs like it. \none of mine did, the other, not so much...", "author": "jaime b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "This place is pretty cool. Came here today with the dog in tow to check out the dog park. LOVED that its completely fenced in for the dogs to run crazy...wished it was grass though...the mix combo of dirt and bark was alright. With the light on and off sprinkles the pooch wasn't a total mud ball which i was very thankful for. Will definitely come back for more dog park action!", "author": "Julie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-23", "description": "I love this place. And so does my dog. Two spots for her to play, one that is an official fenced in dog run; and another less official grassy area by the basketball courts. The 360 views, rocks to climb around on, and relatively easy parking also make for a special spot.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-11", "description": "Panoramic views of the city.  Very windy at the top, and not much grass, as the couple near me found out to their chagrin.  They tried in vain to spread a picnic blanket and then ran away.  The girl kept saying, \"Is this it?  Where's the PARK?\"  Yes, this is it, and it's spectacular.\n\nThat said, she was right: Corona Heights isn't the spot for picnicking or sunbathing  -- head to Dolores Park for that.  But there are great views, and it's walkable from nearby neighborhoods.  The official entrance is on Roosevelt Way -- we tried wandering in up a very steep 16th St. hill and eventually turned around; it turns out you can get to the park trail from there (near the tennis courts) but there's only a very steep narrow dirt path with nothing to hold on to, so you're better off coming up by the gentler path if you're not feeling up to something strenuous and possibly precarious.  But do go.  Ascend the tallest rock and assume a king-of-the-world pose.", "author": "S P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-14", "description": "Was looking for a place to let our new pup run like the wind, but not fear that he would run into the street. Corona Heights met that need. There is a gated area that allows the dogs to run as they please, and a couple benches where the owners can hang out and watch. The view is quite nice. It can get quite chilly and windy up there, even on a nice day so bring your layers folks. The area consists of a bunch of piles of wood chips, which is a bit messy but it is what it is and our dog has fun there. The other people who bring their dogs are friendly and considerate. Yay.", "author": "Anne Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-10", "description": "One of the best views of San Francisco that you will find. Good for sunrise and sunset.", "author": "Mo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "I've been wanting to come up here for YEARS and i finally had the opportunity to take a walk up this afternoon. i stared at the view for like 10 minutes just looking around, saying oh there's where i live! and oh there's the safeway, and oh there's where i work! there's dp, and ooo look at the nice roof deck, and there she is the castro theater. i think one of the best views is over to euerka valley b/c that's a vantage view point that you rarely receive in the city. it made me feel cozy looking at the valley. the only bad thing about this park it gets a little windy and it's not very conducive to just hangin out to have a picnic. none the less i'm glad i went!", "author": "Mikey B W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-10", "description": "I am so afraid to let my Prima Pooch run loose here. she is rather free-spirited and obstinate and headstrong and the little bugger doesn't always come when called. what if the baby darts out onto Roosevelt Street and gets her pigheaded self run down ? boyfriend has already told me not to come home if I let some accident befall our baby. so here's what I do: I keep her leashed, she looks with mad envy at the off-leash dogs frolicking about, and I enjoy a beautiful view from atop. then like a crackpot I tell the dog, see, if you knew how to behave you could run around free like the others. then she stands up and scratches at my leg to pick her up and carry her. now THAT is called being trained.", "author": "Prima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-05", "description": "Located in my favorite neighborhood in SF, this is easily my favorite park.  I take my spoiled chihuahua to the monthly Chihuahua Cha Cha as often as I can because it's fabulous.  First Sunday of every month from 12-2:30pm tons of little chihuahuas and the like are released like butterflies and allowed to do their little dog dances in the large dog run at the base of the park.  \nI have SO many great memories associated with this park, spanning over 10 years.  I took my gay 34 year old hairdresser to my senior ball in 1996 and, since he lived in this neighborhood, we returned here after partying at the Gift Center.  We drank champagne straight from the bottle while sitting on the big red rock under a full moon on one of those rare hot summer SF nights.  Then it got REALLY fun.  We met a group of satanists, argued over the gay/straightness of a guy I thought was hot, Danny kissed the guy proving he was gay, I made out with the guy's unnattractive MUCH older friend, walked off with my \"new\" friends screaming \"It's my senior ball and NO ONE'S going to stop me!\", got dragged home by Danny by my pony tail, passed out in bed and didn't wake up until 5pm the next day.\nI love you Corona Heights Park.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-10", "description": "Yay! Fenced doggy area for Murphy to run around and make friends. Wonderful view.", "author": "Howard T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-13", "description": "The view in this park is great, and I love it! This is a great spot in the city to spend a nice afternoon during a weekend. Everyone in the city should try!", "author": "Lisa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-14", "description": "I really luv this place..its all rocky and natural,....its more crowded than it used to be, but its nice to take your sweetie here and look at the view at nite...(but bring a blanket its gets COLD!! and WINDY!!!)", "author": "Peter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "It's a huge red rock (some people call it Red Rock) perched above Castro next to the Buena Vista neighborhood, and a pretty spectacular place to have a seat on a breezy, sunny day and watch the city do it's thing. It's a special place for me because I hiked up to it on my first day when I moved here. I had never been to SF before and had only seen some pictures of the city, so I was in full exploration mode. I woke up from the hostel early to walk around, and made a new friend named Christian a couple hours later. He showed me the F Market line, which I thought was the coolest thing. We headed up Market toward Castro on the F-line. At about Octavia street is where the Red Rock comes into view, and I instantly started asking Christian about it. As soon as we got off the F-line, we headed up to there. I'll never forget the feeling that day sitting on that rock. It's a towering lookout in the middle of the city.\n\nIt really is an amazing spot, even if it isn't your first day in your new home. Now i live a couple blocks from it, and it's still the number one place I take my SF-newbie friends to see. It's just as nice a park as Tank Hill, but a little more touristy & you have to occasionally pick up after some other jerk's broken beer bottle. For the most part though, the park is in great shape, mostly because the fellow San Franciscans tend to take pride in it. It's also a great spot to sit and watch the downtown fireworks.\n\nThe best approach to the peak from Castro is to walk up States Street next to the Gay Cleaners (yes, it's called Gay Cleaners) until you see a small road on your right that leads into a lower park area. There's a switchback path on your left that takes you up to Randall Museum. Go around the back of Randall Museum and you'll find a dirt path that leads you up to the top.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-17", "description": "You can't beat the view of the city from the top of the park.  You can see all of downtown, the Castro, Diamond Heights, etc.  This isn't a big park but it has a lot to offer.  There is a great fenced in dog area as well as an open grassy area.  Also, the park is a short walk from Buena Vista Park.", "author": "Garrett D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "Corona Heights is like the sidekick to Buena Vista Park, and you can make a fine walk by combining the two.  When you see this place from Twin Peaks, it looks strikingly out of place: a very barren and rocky hilltop popping right out of the surrounding neighborhoods.  There's not much else to say about this place, except that it seems to be quite popular with dog owners, and that there's apparently a museum here, the Randall Museum.  I'll definitely have to come back and check it out sometime.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-15", "description": "did i miss it, or did the collective oeuvre of reviewers exclude mention of how this place is a gay sex/hook-up locale in the wee/naughty hours?  i'm not into random public sex (partly because I'm not into hepatitis, HIV, or any, really, STDs) but I have been demi-stranded with my friend near the tennis courts after after-bars to have a schmig and heard sex-wails (i love a good screamer, but i mean the kind where you think \"you should really just go over to Treasure Island to film that aural mess\" because you know it would be slightly scarring in person).\n\nIN CASE ALL YOU ZIPCAR/CITYCARSHARE FOLKS DON'T KNOW - YOUR CAR WILL DIE FROM A MERE 20 MINUTES OF MUSIC AND DISCUSSION, SANS HEADLIGHTS, IF THE ENGINE ISN'T RUNNING.  Apparently, those little fob/card readers on the vehicles consume a lot of juice so they die down more easily than one might expect/plan for/desire.  I thought it warranted broadcast to save you an embarrassing cell-yelling volume call at 4 am after hearing BB sex noise and attempting to flee with your friends.\n\n...allegedly.", "author": "Nathan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-25", "description": "this is an amazing park with one of the best views of the city.  there's a nice grassy area at the base of the hill right next to this awesome fenced in area w/ soft wood chips where you can take your dog off leash and let him run around w/ all the other dogs. good for those pets who like to pretend they're Houdini.  they have running water to fill up the doggie bowls too.\n\ni like to walk here from my mission/upper market/deco ghetto neighborhood, pooch in tow.  this is also where the monthly Chihuahua Cha Cha is held - first sunday of the month, 12-3.", "author": "Suzanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-11", "description": "I'm not sure exactly what it is about this place, but I'm sooo enamored by it. I used to live just below it so I'd come up about once a week and stare at this beautiful city I love.  It has great views of the Mission, the Castro, and the Pac Heights area. It's also a great place to watch the fireworks, provided it's not too foggy!", "author": "Maia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "What a great park!  It's not very big but very cool place with rocks to hike up, excellent views, and friendly dogs.. it feels like a mini hike in the middle of the city.", "author": "Engelbert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-30", "description": "This is the best place to enjoy some quiet time with different views. Love to enjoy the various individual vegetable/flower gardens. Steep, steep hill, works off that chocolate calories.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-06", "description": "I like to call this my secret spot. Even though it's totally not a secret. Despite the fact that it's right in the middle of the city and easily accessible, there have only been a couple of other people when I've been up there. It's like Twin Peaks, but without the tourists and fog.", "author": "reb f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-16", "description": "This is now my new favorite dog-walking destination!  Great dog-friendly area, including a fenced-in off-leash part.  The short climb to the top will put you on a large rock overlooking everything from North Beach to Potrero.  Unlike Tank Hill nearby -- the rock has many comfortable seats and perches -- even my beagle got to play mountain goat on it.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-25", "description": "The best part about Corona Heights might be that it's close to Tank Hill, so if you're entertaining guests from out of town, or just interested in exploring the geographic center of the city, it's really easy to combine the two locations. The panoramic view doesn't differ much from Tank, you still get to see downtown, the western addition, and all that stuff, but its lower elevation makes everything seem a bit more tangible, albeit, less lofty.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-02", "description": "Great views, and I like watching the dogs play.  Also, it doesnt get too crowded and I dont ever worry I'm going to get dragged into the bushes. Unlike that Buena Vista park.", "author": "b s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-10", "description": "Home to Campbell hill, the perpetually brown guardian of Duboce Triangle and the Castro. Climb to the top to feel like you're hiking the great California wilderness , and surprise yourself at the crest with a stunning shot of the city.", "author": "Geronimo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-09", "description": "Nature and urbanism intersect at the top of Corona Heights, the big rocky hill that hovers off to the right as you head southwest down Market.  Braving the windy path up the rocky slope at the park's center is well worth it--at the top is one of the best views in the city, high enough to make out the contours of the hills and get a whole new perspective on how San Francisco's streets and neighborhoods and landmarks relate to each other. The best part is being able to take it in without entering a building, instead perching on a jagged, windswept cliff in the middle of the city.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "If you want a fantastic view of the city without the twin peak drive this is for you. Perched just above castro and overlooking the entire city and east bay this exquisite view is hard to beat. This park gives you the benefit of seeing city details without the city noise. Keep your eyes open for hummingbirds at the peak they are beautiful.", "author": "R J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-30", "description": "shhhh.\n\ndon't tell anyone.\n\nthere are nice tennis courts at corona heights park.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "the view is the greatest thing that surprises me each time i visit. the view is astonishing, showing the best view of the eastern side of the city in fine detail. walking to the summit of the hill is what i do every time, stopping atop one of the rocks to sit on the breathe and enjoy the views. \n\nan enclosed dog park at the foot of the park so this park is really dog friendly.", "author": "Court L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "another san francisco's \"green/secret spots\". the view was amazing from the rocks. a small doggie park is located at the bottom of the hill and adjacent from this place is the randall museum. from the top, you could see bagdad cafe, dolores park, st. mary's cathedral, market street, tip of the bay bridge & etc...a great place to walk your dog or  just to sit on top of the rock to muse or contemplate.", "author": "Nelle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-26", "description": "i come up here with my dog at least once a week. most of the time i drive even though i live 4 blocks away. sometimes i walk up the winding hills. when i say walk i mean, my dog drags my limp body face down in the asphalt cause i rarely do cardio when i go to the gym and can't handle the inclines. my ambition is left to how badly my dog wants to hump the neighborhood bitches. it has amazing views. it's completely gated so dogs can't run away like mine who think cause i am vietnamese i will eat him. you can hike up the red rocks after/before. there's also basket ball and tennis courts near by (not that you can actually play tennis there, i don't think those courts have been upgraded since the 60's). i heart san francisco. this is what i pay for to live here. even if it means i don't get groceries for a week.", "author": "dan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-08", "description": "great views, good enclosed dog park, and trail hiking all in one.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-15", "description": "full disclosure:  the house of hula is across the street from the city's best, (mostly) secret park.  that said, this park rocks.  from the plethora of dogs at all times to the fab views from the top, everything about this place is special.  huladog is tiny but thinks he's a giant and the truly giant dogs here are very patient with him trying to herd them.", "author": "nic f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-17", "description": "on top of the rock you feel like you OWN the city.  the neighborhood is well worth a walk-about as well.", "author": "Geoffrey W."}
