{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "this Is one of my favorite bars In sf!!..clean friendly place to have some drinks and watch the ufc fights..me and my lady were there last weekend and we watched ufc bellator and boxing all at once..staff Is cool af and I want to especially thank alfonso..bar does not serve food but I love how you can call in uber eats or just bring your own..thanks danny coyles well be back soon!", "author": "Henry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Danny Coyle's is a great spot for catching a game or hanging out with a group of friends. The bar is pretty spacious with ample seating, good drinks, and 3 restrooms. The bartenders are really nice so that's always a  plus. I ordered an Irish coffee and the bartender offered to make a fresh pot of coffee since it was 10pm and they didn't have any coffee at the time. I love the smell of fresh brewed coffee (they use Peet's) so gladly obliged to wait 10 mins for my Irish coffee which was delicious!\n\nSaturday night was a good crowd.. there's a jukebox so different types of music was playing all night. Our group of 10 had a great time hanging out at Danny Coyle's. Definitely a low-key, laid bar to head back to in the near future.\n\nCash is king but if you prefer plastic then it's minimum of $20 for credit card.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-30", "description": "A Haight neighborhood bar seemingly off the beaten path with a devoted following of Irish drinkers. It has Carlsbad on draft, something I hadn't seen in a looooong time and a few other drafts like Lagunitas. Again, no real complaints and I understand a bar needs to stock certain libations based on what customers order but it was disappointing that the bar only stocked one kind of rye whiskey. No Templeton or even George Dickel but that's ok too. I'd check it out again if I am ever in the hood, as it IS a nice place with friendly folk. Cheers.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-05", "description": "I'm normally a fan of divey bars with friendly staff, cheap drinks and good eats. This spot misses a few of those features.\n\nWalking in, it felt like my partner and I were interrupting a conversation that never quite recovered (there were only a couple people in the bar). I enjoy chatting with regulars, but no love that night.\n\nI was also a bit annoyed by how long it took to receive our drinks. The bartender even stopped making them to tell a lengthy story to a person nearby. I was sitting right in front of him the whole time. Come on, fella.\n\nIf you're looking for a spot to watch the game, this is the spot for you. Late night dwellers looking for ambiance and mellow conversation, seek additional options.", "author": "Nicholas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Love going to Irish bars. Gavin is a great bar tender, made retry awesome drinks. \n\nThey have a juke box, pay for the songs you wanna hear.", "author": "Aditya C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "One of the better sports bars I've been to in the City. Was not here for a for a very long time due to time constraints but a cool vibe with several tv screens and projector I believe.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "I recently moved out of San Francisco, but this bar will always hold a place in my heart. Friendly bartenders and awesome owner Brian Coyle. \n\nIt has a great atmosphere, tons of TV's and amazing bartenders. \n\nGavin makes amazing drinks and is super attentive even when its crazy busy!\n\nIts hard to have just 1 drink when you go in there, the patrons are super friendly and warm. \n\nGreat place for groups in the back of the bar. \n\nThanks for all the great nights. \n\nxoxo\nFarah", "author": "farah b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "I've been coming to Danny Coyle's for years now. After graduating from UNC in 2010, Danny Coyle's has served as a hub throughout the college basketball season for my friends and I. We often find ourselves here for more than 20 games a year, not even counting the ACC and NCAA tournaments. I wouldn't be anywhere near as close to the Carolina community as I am now without our regular gatherings for games here.\n\nDanny Coyle's is pretty much what you'd expect from an Irish pub. While it's a Carolina bar, it definitely serves a lot of other sports teams, and at times it can get a bit crowded. It's not really my stop-over for everyday drinks, but I have a lot of friends that live in the Haight area that swear by it as a great nightcap spot. Brian is an awesome bartender and always takes great care of his guests (and is EXTREMELY patient with the rowdy Carolina crew).\n\nYou'll find plenty of Carolina memorabilia around the bar, but don't let that scare you off. Coyle's is clean, friendly, very comfortable and has good drinks (and great drink specials). And it's also located in the middle of Haight, so it's a great stopover for people passing through the area. I wouldn't say it's a great bar for tourists or visitors, but it's great for locals -- especially if you're a Carolina fan.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Danny Coyle's was a cool spot. The atmosphere was fun. The service was fast and friendly and the bartenders were on top of service. They have many TVs so that you will never miss a game. This is a great local spot with a friendly crowd. They have a full bar with beers on tap and bottles.", "author": "Ron V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-11", "description": "Huge Sportsbar. lots of people inside. Not so many Seahawks during Seahawks game.\nHowever. Bar was very crowdy. I was lucky to get a seat at the bar. \nmany screens showing mostly the running events. There was a huge, I mean a huge display in the middle of the bar. Unfortunatly, they placed a Billard-table just infront of the screen. The people have played Billard during the game, which felt weired to me.\nHowever, there were much more games people can play inside the bar. Its very touristic, but its a Sportsbar. Another downside was, that I was not able to connect to the wifi. I think there were too many logged in already.\n\nprice ok, but I had no food - just the beer", "author": "Ben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "I don't leave reviews.  I don't actively use Yelp.  This is the best bar in San Francisco.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Who knew there was a Chargers bar in SF... well, not me. We came up to the city to visit some friends who were in town for SD. I told my bf we should get there early bc it would probably be busy...he scoffed and said there aren't \"that\" many chargers fans in SF...\n\nWRONG\n\nThis place was PACKED with Chargers fans, it was unreal. The bartenders were AMAZING, dealing with huge crowds, drunk fans, and just the madness of a packed bar. The prices were typical for a bar in SF. \n\nIf you're a Chargers fan place is for YOU!", "author": "Channing M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Great Spot!  Must go to when in SF.  The bartenders are top notch, great atmosphere.  \n\nBest selection of suds.  Great crowd!  Good for watching PL Football also.\n\nCheck it Out.  Pull up a seat.\n\nCOYS!!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-26", "description": "Absolutely love this place!\n\nWe actually came in due to the fact that we had 30 mins to kill.  Once we were in, I felt as if I was in Ireland, sooo many Irish people and so friendly.\n\nWe ended up getting 2 hot toddies (which we never had), pure delicousness, Irish whiskey, lemon, hot water and voila. We also got an Irish whiskey shot and a tecate for $6, how could anyone pass up on that deal?\n\nI highly recommend this place if you're in the area, great people, great vibe and if you're lucky enough you'll get to see the bar tender leave the bar and go smoke with the regulars or just whoever is smoking outside :)\n\nPs: they stream lots of soccer :), and I also found out that they but boxing ppv at times.  Can't wait to come here and have a proper Irish coffee next time.\n\nCheers!!!", "author": "Josh Giosue D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "Came here because I typed in \"Chargers Bar\" ended up watching them on the tiny screen while the Seahawks and Raiders had the big screen. 2017 sucks wish I could put 0 stars", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Always have so much fun at DC! The bartenders are great- friendly and fun! Glad to live in the neighborhood and see the regulars while catching a game. Gavin in particular is great! I can be a bit picky when it comes to what I'm drinking and he's always ready with a recommendation when I need some guidance or order something new.", "author": "Jana M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-12", "description": "Wow, lots of 4 and 5 star ratings. \n\nAll I know (knew), being in the area temporarily, was that it looked like a good place to stop by and have a beer, to work on my laptop.  Even the placard outside advertised free wifi and outlets, etc.\n\nYea, not so much.  I checked the online schedule on their website and saw that no \"big\" games were being featured on Sunday afternoon; went on yelp and checked the usual popularity on a Sunday afternoon.  All looked good.  I was expecting a reasonably quiet environment when I arrived.\n\nI grabbed a small table across from the bar, there were no outlets, no signs indicating the wifi access.  Apparently there were no servers as I had to go to the bar to order a Stella ($7).  \n\nIt wasn't all that busy but the noise level was high; my own internet signal was diminished to the point I couldn't get a good connection, and as stated, there was no signage indicating internet access.  In other words, may be a good bar, but not a place for one to hang out, have a beer and be online...\n\nI left.  Simply wasn't worth it (to me).  From the sounds of the reviews it's a fun place at times, but definitely not fitting my interest...", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "I absolutely love this place. Laid back atmosphere yet fun! Bartenders are super friendly. Great Moscow mules!!!", "author": "Daniella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Even though this bar is shared with Chargers fans, during a Seahawks game you feel like you're a Seahawks fan IN Seattle. So much love and great energy!\n\nIf you want to get in, you'll need to be here an hour earlier than the game starts at the very minimum. Once they are at capacity it's unlikely you'll get in unless someone decides to leave (and who leaves a Seahawks game early?! ;) ) \n\nWith tons of tv's around, it doesn't matter where you look you'll never miss a moment. There's no food around except slim pickings. Chips, chips, chips. Pass.\n\nMy heart is happy watching Seahawks games here!", "author": "Shereen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "I'd like to say that I know the history of this place and that I may have even had a hand in some of it, a very small one (Tecate tower... *cough, cough*), but a hand none the less. Ladies and gentlemen, this is a Charger bar. Sure Seahawks fans now also call it home with their recent successes, but years before a #12 jersey ever walked through the front door of Danny Coyle's it was all blue and gold. \n\nNo, it hasn't always been an American football bar and before pigskin ruled supreme the bills were paid by early morning football... the European kind (soccer to us). I've never been here to watch a soccer match but the staff remains the same and will kindly serve you up a stiff cocktail, a sharp shot or if you're a Charger fan, a Tecate of course. \n\nFood? Nope. Bring your own. They're happy to let you post up with some grub from any of the local haunts and they've even been known to pass you a tray of Oreo cookies if you're sitting empty handed. Nice, nice folks with nothing but love for all... even if you root for a silly team.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "So before I even had the opportunity to see the bounce i was told I was too \"fucked up\" he may have seen my friend and I singing out loudly and which we do with or without drinking. It was quite embarrassing as people behind us laughed and starred when we knew we were far from drunk (it was 7:30pm) but we were unable to enter and that's why they are receiving a 1. I'm sure the establishment is great but I was unable to fully judge since I was denied entrance at 7:30pm.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "While wandering through the Haight, like a typical tourist, we happened upon Danny Coyle's and their sign for Irish Coffees. We popped in for one, which was delicious and hit the spot, and followed it up with a perfectly pulled Guinness. If you're a soccer fan, especially a Tottenham Hotspurs fan, this is the place for you.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-05", "description": "Extremely rude bouncer told disabled customer (me) \"it's not my problem.\"\n\nI have two broken arms. It was raining hard and I ducked into the doorway so my casts wouldn't get wet. The bouncer (Irish guy with big red beard) told me to wait in line. I'd be happy to oblige except for my arms. I asked if I could stay in the doorway to compose myself, signaled to my two broken arms, and he said \"that's not my problem.\" I kept my cool and said \"at least you could be nice about it\" to which he responded \"f*** off.\"\n\nDisappointing behavior from a bar that I used to \ngo to (but no longer).", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "1) this place let you bring food in. (I love it!!)\nI love Thai food down the street (house of Thai 2) so this is perfect for me to grab some spicy Thai food and go get beer and watch the game. \n\n2. A lots of HD TV for games. Every kind. Football (soccer), basketball NCB, baseball and hockey. They even have huge projector in the back.  \n\n3. Pet friendly. You can bring your dog here. \n\n4. Drink are all affordable. Nothing fancy and just great!\n\n5. Easy to find street parking. And they are all residential so no meter.", "author": "Fah Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Kinda nicer dive bar, I went here for free stand up on a Tuesday, most of them were pretty funny, its BYOB and we ordered a pizza from a place down the street which worked out great, not a huge beer list, but they had a solid $6 shot of jameo and tecate deal which I did, they had some good local beers though, bartender was nice, and talked to a few of the patrons, overall a good time was had", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "Awesome place to catch a game . They do not have food BUT they do have a pretty sweet delivery set up with \"Wing Wings\" around the corner . Try the angry Korean wings , they'll deliver them right to you.", "author": "Brittany A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Best place to watch the Charger's game in San Fran! My review is more for the food than the bar. Though, the drinks are really reasonably priced and not just for San Fran standards.  \n\nThe best part of this bar is that the food truck, fritas tacos, caters at the bar for chargers fans! The owner is a huge chargers fan himself. Best game day California burritos and carnitas fries ever! Can't wait to come back for another game :)", "author": "Joanna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "Q: Best trivia in SF?\n\nA: Yes!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "I've came here twice now on Saturday evenings to watch college football after spending the day perusing SF. It's right next to Alamo Square and there's usually street parking within the radius of a few blocks.\n\nThey have plenty of TVs with all of the big games on. They also offer specials on certain drinks - $7 for a PB&J (can of PBR and a shot of Jameson). \n\nAnother cool thing about this place is that they allow you to bring your own food into the bar to eat while watching the games. I'll more than likely return again before the season is over.", "author": "Mackenzie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "SAN DIEGO SUPER CHARGERS!!!!!\n\nThis is the place to go for your Chargers football games!!!  PACKED in this place and everyone was having such a GREAT time!!! Sorry for all the CAPS but I LOVE THIS PLACE!!! Can't wait to go back!! What I wouldn't give to watch a Chargers vs. Oakland game here!!! haha", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "It's a brightly lit, very clean Irish pub.\n\nYou read that right.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "What else do you want from an irish pub besides a good Guinness? Danny Coyle's provides this along with a host of great drink options and perfect bartenders. \n\nLook no further for your SF Irish drinking pub!", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "Friendly and personable bartenders, great spot! Strong drinks with a smile! :) always has the games on as well as the fights! I enjoy this bar. Cheers!", "author": "Grant G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "This Irish pub's usually bustling with locals. It's nearly always loud to very loud inside. The flat screens will always have the latest football from around the globe. The bartenders are overworked but they make the most of it, and a little patience is rewarded with good service at the bar.\n\nAt first I thought my black & tan was muddled; after asking our bartender, she carefully explained that their beer choice for black & tans is a brown beer so it merely looks as though it's all mixed up. So order your black & tan with confidence!\n\nThere weren't any bar fights during our visit, so I can't comment on the entertainment value of this pub. But for our Saturday afternoon visit, it was just fine!\n\nThe down & dirty:\nFood - ?? - We only had beer.\nService - 4 - It's a dive bar, so \"curt but quick\" is acceptable!\nValue - 4 - Decent prices for SF.\nSetting - 4 - It's a sports bar, a little nicer than a dive bar, with generally friendly patrons and TVs.\nDate worthy - 3 - You're taking your date to a dive bar??", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Best bar in SF in the best neighborhood in SF. Real San Francisco without any millennial pretensions. Owned and staffed by really nice people, fun local crowd. If you're into Euro footy this place is Mecca. Vibrant local atmosphere every night and weekend. I'll go out of my way for a pint here, any time of day.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Fun outpost in the Haight for the Brainstormer trivia empire!\n\nWe showed up at 7:15  for the 8 pm trivia night on Wednesday and were able to score a little side table for four.\n\nStandard Irish pub beers ($5) like Smithwicks and Guinness. And since they serve no food (they do sell some chips), patrons know to bring in Rosamunde sausages and pizza from down the street.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "best Chargers bar ever. came here most recently prior to the SDvSF game last month.\n\nshout out to all the loyal Bolts fans. gotta love the camaraderie and good times. was handed at least 2 beers by fellow patrons donning chargers jersies. damn that place must've been a mad house on game day. \n\ngreatest. charger. comeback. ever.\n\n-civilities.", "author": "Joy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "True neighborhood pub. A great place to catch a game or people watch from a window seat.", "author": "Leah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "THIS IS THE BEST CHARGERS BAR EVAAAAR!!! I absolutely love going to this bar on Sundays, Mondays, or Thursdays to cheer on my San Diego Super Chargers.\n\nAlfonso is a wonderful bouncer :)  They have a great deal on a bucket of tecate (6 for $15 I think) The bar tenders are fast, even with all the people crowing the bar to get a drink. Tons of TVs to watch the game on and even a big screen in the back. Lots of places to sit, but on game day you probably will have to stand if you don't get there early enough.  But what i love most is the atmosphere and the experience:\n\nEven long before the game begins the place is filled with Chargers fans.  The tecate towers begin climbing towards and discussions about the upcoming game, players, and what everyone has been up to recently fill the air. \n\nDuring the game Chargers fans are going crazy cheering, clapping, chanting, hooting all for the love of their team. When the chargers get a touchdown the team song comes on and EVERYONE sings along (and it is okay if you don't know all of the words because there are plenty of people wearing Danny Coyle's t-shirts that have the lyrics on the back).  I live for the moment when we the Chargers get that TD and I can sing our song along with the rest of the bar!\n\nWhen the Chargers win there are tons of displays of pure joy by everyone in the bar because WE WON! People high five eachother until their hand goes numb, jump up and down, laugh, hug, and some may even take off their shirt and do a victory dance. It is a place of camraderie and spirit in the name of the Chargers. I love it! \n\nThis place is the place to go if you are a Chargers fan looking for a Chargers bar experience unlike any other.  :)))", "author": "Apryl S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Home of The San Diego Chargers Fans in The Bay Area. Hands down one of the funnest places I have ever watched a Chargers game (and I live in San Diego).\n\nTop 3 Places to watch a Charger Game:\n1. The Super Bowl\n2. Jack Murphy Stadium\n3. Danny Coyles.\n\nGrab a bucket of Tecates, and build something in honor of Antoniooooooooooo GATES!\n\nThey play the San Diego Super Chargers Theme every time there is a touchdown, and the Charger Fans feel this place is sacred, and show it great respect. Trust me when I say, if you are a Charger Fan, you got to experience it.", "author": "Hugh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Growing up in San Diego and moving to the Bay Area meant I had to find a good place to watch the Chargers and this is the best Chargers bar I have ever been to. The energy here is unrivaled, the beer is cheap, and the bolt pride is plentiful.\n\nHawks fans like to go there too but Danny Coyles is the best Chargers bar I have ever been to.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "We had a great time at Danny Coyle's for the Seahawks/49ers game last week...until 2 days later when I got a notice from Capital One that their bartender had written himself a $68 tip on our $20 bill.  If this is how someone let's their employees do business do you really want to take your business there?", "author": "Zack P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Can't beat the warm welcome they provide for fellow Chargers fans! My friend and I have been using the cheers and chants we learned during every other Chargers game we've seen since stepping foot in Danny Coyles. I proudly wear my DC shirt around SD and can't wait to make it back there the next time I'm the city! \n\nKeep the Bolt pride alive DC! And make those Tecate towers extra tall for me!! Woo", "author": "Kristina J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Great Seahawks bar that was easy to find for us travelers trying to find a home in the \"enemy\" territory that is San Francisco. Small, cozy barn that had some drink specials and also food to order it seemed. Not bad for just stopping by. Not sure how it holds up to other local bars but it's not too bad on my scale.", "author": "Pauline T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-14", "description": "First let me say that I love coming here for Seahawks games and the three stars is not a reflection if the bar just the people attending. As a native if Seattle when I first moved here I found it hard to find a good place with hawks fans to cheer with me on Sundays. Then I found Danny's this place has always been good to me every time I've been there. \n\nThat being said I was shocked to hear about the experience my friend had. Her and her friend who are also Seahawks fans, went for this years opening game and had a horrible experience. They arrived early to get a table. After sitting for a bit a group of regulars \n(Who will remain nameless) came to their table informing them that, that is their regular table and they needed to move. This continued and escalated. They then said \"we will get all our friends to stand in front of you and you won't be able to see the game or get drinks if you don't leave our table.\" \n\nI am truly ashamed of those people for treating someone that harsh over a table. Needless to say I have found a new bar to watch my games as I no longer wish to be associated with people who lack respect to their fellow man.", "author": "Shaun K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-13", "description": "Came here for the Chargers game, great atmosphere! The service is the reason for the 1 star and I would honestly give them No Stars if I could.  I ordered a Bucket of Beer, again a great deal for game time, and that is when it went down hill.  After paying, a second bartender came over and before I even put my wallet away said, \"what, you don't tip?\" I'm not getting into the whole tipping vs. non-tipping, and coming from a restaurant family I know how to tip, however due to the unprofessionalism behind the bar I will never be going to this bar again. (FYI I did end up leaving a tip)", "author": "Renzo V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "I have never seen such a devoted bar to the Seahawks.  This will be my home next season with this Amazing staff from the bouncer/doorman to the owner!\n\nGo Hawks!!!!", "author": "Phillip H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Best bar for early Bundesliga games in SF. Mainly a Tottenham Spurs bar, but Dortmund, Bayern Munich, Manchester United, and Bournemouth supporters all frequent it. Especially fun and rowdy for big Tottenham or Dortmund/Bayern games.", "author": "Nestor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Thank you, Thank you, Thank you... We had a great time at this bar last night. We were looking for a friendly neighborhood bar and this place delivered. Everyone was so friendly and hospitable. Patrons were singing along to the jukebox when we walked in...:-) We knew we had found the right place. The atmosphere was warm and inviting. As soon as we walked in we were greeted by Dan, the bartender. He made the experience that much better. This bar reminded us of our favorite watering hole at home, where everyone knows your name. Thank you again.", "author": "Shannon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Had a lot of fun.  The mixed drinks are innovative but you can always have a great beer.  The bartenders are attentive and personable.   This bar is perfect for the sports afficiando no matter what the sport.   Lots of fun.", "author": "Barbara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "There's not much to this place. Seahawks and Chargers bar! There's quite a bit of line that forms before the game. I got there an hour before the Seahawks game started and was in line until the Chargers game was over and the fans cleared out. Very warm inside, and completely full. Somehow managed to find some stools, but chances of having to stand are very high. You can get drinks here, but no food, though you can pick some up and bring it in. Kinda dirty, no one buses the tables from the previous people for the whole duration of the game. It is what it is though. Roudy/passionate crowd to watch my team in SF!", "author": "Kathleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "We are the best Chargers bar in the world. HANDS DOWN\n\nIf you live in the city and watch at home on your pathetic computer, you are missing out.\n\nIf you're visiting town and think it's just 6 Charger fans in front of a small tv, YOU ARE WRONG.\n\nCome to the bar, no matter how lazy or hungover you are, and have the time of your life.\n\nSUNDAYS ARE BETTER AT DANNY COYLE'S", "author": "Harold C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "They serve great Irishmen lots of booze who then lay it on pretty thick for the 1-3 women here. Women, be those women.", "author": "Em L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "Such a great place for Chargers fans to call a home away from home. Nothing like hearing the San Diego Chargers theme song play every time a touchdown is scored and having the whole bar sing along in fervor and excitement. Honestly, I have more fun watching the Bolts at Danny Coyle's than I do back in San Diego. Such a great, fun, and lively group of die-hard fans to watch a game with and a true Chargers bar. Thank you, Danny Coyle's, for having us!", "author": "Brent S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Easy to get in.  No cover.  Drinks were good.  Music wasn't so loud that I couldn't talk to people.\n\nAlso, great location.", "author": "Max P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-02", "description": "well, its a proper bar serving full size pints and maybe the best Guinness in the City... i know i know its a seahawks bar! But its really just a good sports bar, showing everything... good staff... 5 stars", "author": "Reg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "It's a Seahawks bar. When I came here two years ago to watch the 2012 season opener we only had one TV in the corner, but look how far we've come. The NFC Championship game was amazing -- this place was banging. Go Hawks!\n\nOpens early Sundays for Premier League matches. A bunch of TVs with good viewing angles. Surprisingly clean. No kitchen but you can bring outside food and coffee no problem.\n\nCan be tough to get a drink during games, so I recommend the Tecante bucket. In addition to a great deal, the bucket of ice will keep them cold for as long as it'll take you to drink them.\n\nOverall, a great place to catch games (especially so if your rooting interests align with the Chargers or Seahawks) or grab a laid-back beer when the games are over.", "author": "Greg K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "I freaking LOVE this place!!!! I'm a San Diego Native and a die hard Chargers fan! This bar is awesome if you're the former or the latter. If you go during the games you're guaranteed to have a fun time. Everyone there's a Chargers so you'll have plenty of San Diegonites to share the highs and lows of your favorite teams season. They have drink specials and a great selection to choose from. If you ever feel home sick go to Danny Coyles, when the Chargers score a TD the bar ERUPTS in SD spirit and makes you forget your still very much in SF!", "author": "Shahin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "This is an awesome bar in San Fran for SEAHAWKS and SOUNDERS fans! GO HAWKS! \n\nOpens early, the bartender was friendly, with an Irish accent. No food, but I think the bartender said you could bring in outside food.", "author": "Tracy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "The story begins with my best friend moving from San Diego to San Francisco...\n\n A week before he leaves, he asks me \"Please god, tell me there's a bar in San Fran where I can watch my Chargers play...\"\n\nI don't usually answer to the Lord's name but something made me feel it was necessary to acknowledge his prayers. I asked a friend who I knew moved there a few years ago if he knew of a \"truly special place\" where a man can watch his frustrating, liquor inducing team watch a game\" and he answered with 2 letters (not words, letters).\n\nDC's.\n\nAfter further elaboration, he added me to the facebook group... I promptly added my friend who would be attending and forgot about it until football preseason began... Something curious happened, I began seeing TRUE FANS (I live in San Diego and they are few and far between here) posting playfully vulgar comments and quips about how excited/dreading our season would be. I became active in the group, posting a few vulgar comments of my own and before I knew it... I was driving 10 hours from SD to SF to join 40+ ROARING CHARGERS FANS for the Chargers/Niners game. \n\nI arrive on the eve of the game to a roar and friendly bouncer. He smiles, lets me in and I'm oddly known by multiple people I have never met. What is next is a blur but I'll try to decipher the memorable aspects...\n\n- The bar is small, but cozy.\n- The people are friendly to the point where you wonder if you should put your wallet in your front pocket (It never left my pants, btw).\n- A drink is never far away, I was a bartender for 5+ years and this crew is ON.THEIR.GAME.\n- Charger fever is alive here.\n\nI heard laughable scoffs that this place was a seahawks bar. In all honestly... good for them. It's a lot like seeing a girl who suddenly got cute but is still absolutely clueless and terrible to talk to. If you meet one \"12th man\" in here that actually knows who Jim Mora is, I will legitimately die of shock.\n\nHands down, best Chargers bar I've ever been to and has some of the greatest human beings here that I've ever had the pleasure of meeting. \n\nANTONIOOOOOOOOOOOOOO.\n\nGATES.", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Great bar to be at whether for sports events or just chilling for a quiet drink. The bartenders and staff are very friendly and welcoming. Danny Coyle's is a Great bar in the city to go to.", "author": "Allan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "titles this bar has won: \n\n-undisputed world's greatest chargers bar on the planet \n\n-best place to watch a chargers game in san francisco \n\n-number one chargers theme song rendition -the dc super singers-\n\n-ultimate dream destination to witness a chargers victory \n\n-sounds the  charge more then any location annually \n\nif you are bolted in any direction other then up, stay at home.", "author": "Parker R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-19", "description": "As an Irish lass, I love cozying up inside SF's wide selection of pubs. Danny Coyle's is one of my favorite places to duck into for a weeknight drink, say around 8pm on a Tuesday when you and a pal are craving some whiskey. \n\nPeople go there to have a fun time--last time I was there, I found a girl's credit card on the floor, returned it to her, and we celebrated with a round of Fireball shots. It's a friendly, down-home place like that. The bartenders are super nice too. I'm always down for a round at Danny Coyle's.", "author": "Meredith C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "So apparently this is both a charger bar and a seahawks bar. Fortunately, the day I came the two were not playing at the same time, so the review might be different having to deal with a mixed crowd. As it was, I got to watch the chargers play with 100 or so other charger fans and it was a good time. Drinks were cheap. No food, but I guess they let you bring anything in.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "A must for any Charger fan.   Win or lose it was fun.  Great Bloody Marys and fast bartenders.  Small and crowded like most SAN FRAN bars.   Crazy loud.  Lots of singing.   Lots of TVs and plenty of games.  Everyone wears true Charger gear so get ready for a costume party.", "author": "Jane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "I'm a huge Seahawks fan and yes, 12s do come here to watch the game, but my Chargers fan friends would be pissed if I called this place a Seahawks bar. Nevertheless, I truly appreciate them for allowing us to watch the games here with them on Sunday! This place is a great place to hang out and drink even on a non-football day so I would check it out if you're ever in the area. $6 PBJ every weekday....I only know since I live near by and pass by on my way home...", "author": "Cody M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "This is my alumni bar... and it's around the corner from my apartment... so 5 stars was kind of a given. BUT, luckily enough for me, DC's happens to earn it's 5 stars on its own merit.\n\nThese are all signs of a great neighborhood bar (In my narrow opinion):\n\n- Good TVs/staff/seating... blah blah blah\n- PBR+Jameson shots for $7 (PB&Js!)\n- Dogs.\n- Credit card valet services*\n- Eclectic mix of patrons**\n- You can bring in food\n- They pour a mean Guinness\n\n_________________________________\n\n*I've left many a credit card behind the bar... once I unknowingly left 2 here on separate occasions which led to an awkward exchange with a bartender that ended with... \"Yes, that is mine... I'll take it back... buuut it's not the one I was looking for...heh heh... I'm not an alcoholic.\"\n**Last time we met this woman celebrating her write-up in allure magazine: http://www.yelp.com/biz/lonnis-punani-waxing-san-francisco-3", "author": "Jake D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "It was a very low key pub when I went on a Thursday night, but gets pretty busy once games are on. You can definitely tell that it has the potential to be a really lively bar once the games get going-- so make sure you make your way here to see your favorite sports team play! Lines go out the door!", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Best Chargers bar ever!! If you find yourself in the bay area looking for a great place to watch your San Diego Chargers this is the best spot. I haven't even been to bars in SD that has the same Chargers atmosphere as this one. A definite must go if you are a Chargers fan in SF", "author": "AJ L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "Drinks are OK, music is OK, food is OK.  Nothing too great or too bad.", "author": "Derek n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "Went in early to get a seat for UFC last Saturday night. $10 cover, but  it was worth it since I only had one drink for hours and nobody bothered me to order more or give up the extra chair I was saving for my friend. \n\nIn fact, nobody bothered me at all until late in the evening - even then, the guys were drunk and friendly, but not creepy. The bouncers are really nice, too. Good beer selection, HUGE whiskey selection. I'm impressed.", "author": "Sam Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-14", "description": "I was in San Francisco for the weekend and wanted to watch the UNC - NCSU game and my girlfriend found out that this is the UNC bar in SF.  The crowd was nice and the bartender was friendly and quick with the drinks.  It was a bit tough to get a good seat (although that's probably because I arrived late for the game).  They allow dogs inside, which is cool.  Also, cheap beer.\n\nA good neighborhood bar.  If I lived in the area, I think this would be my standard watering hole.", "author": "Jake W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "fun place, friendly bartenders. Not sure if they have food, didn't see any, but theres loads of places nearby to eat at.", "author": "Cliodhna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-19", "description": "Charger fans living in Bay Area...check this spot out next time you want to watch the charger game. They play the game surround & even our song :) all smiles for this San diegan fan. \n\nBest part....BYOF...yup bring your food it is welcomed.", "author": "Priscilla N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "¡THE GREATEST SAN DIEGO CHARGERS BAR IN THE WORLD!\n\nAnyone claiming its a seahawks bar is simply mistaken. This place bleeds blue and gold.\n\nhttp://www.chargers.com/multimedia/videos/Philip-Rivers-Highlights-Chargers-vs-Seahawks/3f866bbc-ef86-468c-a48e-b01f736f9090\n\nSee for yourself: \nhttp://instagram.com/dcsuperchargers\nhttp://dcsuperchargers.com/", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-16", "description": "The scene: PB-esque crowd who are Charger's fans.\n\nSan Diego SUPER CHARGERS San Diego SUPER CHARGERS...CHARGE!\n\nBeing in San Francisco, Charger's fans may be far and few, but you wouldn't know that if you were here at Danny Coyle's on a Sunday! This place is packed (like a hot sweaty dance club in Vegas kind of packed) and your eyes will be delighted by the sea of navy blue, powder blue and lightning bolts adorning everyone surrounding you. Your ears will be delighted (and amused) by the chants and although you may not be at the Q, this is a pretty good runner up. As others have mentioned, you can bring your own food and I saw a food truck right outside this place. It does get super hot and stuffy so don't come wearing your peacoats and scarves.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Been going to Danny Coyles for as longs as its been open  . Best Pub in the height by far. \nGood Cocktails , Awesome Bartenders, Excellent Sport bars.", "author": "Fergal M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "Moved away from sd and I'm thrilled there's a part of me here in SF. So many Chargers fans here. Feels just like home!", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "Even though this bar is three doors down from my house ( which happens to be my favorite band)...  I love this place. \n\nJust kidding about the band.\n\n You know what I am not kidding about???... The friendly smiles and strong drinks I receive from the DC's  staff. Who is my favorite bartender you ask? I don't know... EVERYONE. \n\nEven though this place is my unofficial living room, I recommend it to locals, tourists, first dates, break up dates, and legit sports fans.\n\nThe only downside is they 'Accept' and 'Like' Seahawks fans. boo. hiss.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "Recently moved to the neighborhood, but have been coming to Danny Coyle's for years now.  This is definitely my favorite bar in the city, given the great atmosphere, friendly bartenders/owners, and game day environment.\n\nMy friend and I are die hard Seahawk fans, and while this is primarily a Chargers bar, we've quickly grown a strong stable of Hawk fans for every Sunday.  Typically, the Chargers fans get the back room (w/ projector), while we occupy the front.  If you're a Seahawks fan in SF, then this is your bar!!!\n\nOh, and who can beat the $2.50 Tecate specials on Sunday?  \n\nDanny Coyle's = Best bar in the city!", "author": "Jerome Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "$96 for 16 shots of fireball?  not bad!  i forget how much cheaper this area is compared to the marina.\n\ndanny coyle's was pretty empty on the most recently saturday night that i went, but i since i went with a group of 20+ people, it was fun as shit.  the jukebox in the back has a GREAT selection of songs, so i spent a long time lurking next to it.... and then dancing / acting like a crazy person / dancing. \n\nthe other time i came here was during some soccer match a couple years ago.  that time i went, it was SO PACKED, and i could barely move at all.  i ended up leaving because it was bat shit crazy inside / full of dudes yelling at the TV.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "Check them out for trivia night! Wednesday night gets a good lil crowd, there are DJ's that come play who aren't half bad! Great bar to get together at with friends before you head out for the night, or even for brunch on the weekends (read:hangover recovery spot)!\nFood is priced fair & is definatrely good. Huge portions. My favorites include a veggie burger with cheese and the tacos!", "author": "Kelli G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-17", "description": "Served the purpose for me to watch the NY Giants game.Good set up with a lot of TV's and they maximize their space in not the biggest location.\n\nLike my Yelp homey Rachael S said, it seems to bring some fratatellos d-bags but you'll pretty much get that at every sports bar in some way or another.\n\nIn between drinking my cold $5 Stellas I had to overhear some insecure ex state school bros talk about their \"stories\" from last night about \"sniping bj's\" and \"bagging but titty babes.\" I would have thought this is normal had they not been 35.\n\nStill a cool spot in a cool neighborhood to watch a game.\n\nCons: don't serve food which really sucked but they let you bring in stuff. There is Katz's bagels and pizza right across the way.\n\nAlso-not sure if this is a pro or a con but I saw at least 4 dogs in there. Is this an SF thing? Kinda cool.", "author": "Bobby C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-28", "description": "After checking out some of the reviews, I understand why some people gave it 5 stars: they were Chargers fans. What I didn't see is any mention of the Seahawks. When we were there trying to watch the Niner game the rowdy Seattle fans parked themselves right near the door to make for an awkward entry and exit. The bartender was kind of slow and forgot about the second pull on my Guinness too, though he's not the first person to do that. We took our business to Nicky's and enjoyed it more over there.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Came here after Bay to Breakers. The crowd is mixed and people seemed happy and friendly", "author": "Mia X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-11", "description": "Continuing my crawl down Haight in pursuit of the \"Soused\" badge, we ended up here. Decent little bar, had the pub vibe, but it was a total sausage fest on a Tuesday night. \n\nGood beer selection, sports on the tellys, soccer and the Giants playing. Kind of a small joint, and relatively crowded early, so we didn't stay for very long.\n\nWould check it out again, but hoping the male:female ratio is a bit better for the next visit.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "Absolutely had a Terrific time!! We picked it out of the directory and it was one of the best flying fickle of fate finds for our day.  We walked in, and were hungry, we asked for a suggestion and he directed us to a place he goes for grub.  Then we headed back for a Guinness to celebrate. :) That lead to another and another, by the way it was also our marriage day... And the bar was the perfect follow to that joyous spirit. We hung out for hours just simply enjoying the surroundings.  We will be visiting again when we come back to town. =)", "author": "Kara J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "Brian and his crew are great. Remember your face, good happy hour drinks. Most importantly it's a great atmosphere", "author": "Joshua L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "Trivia wednesday night was AWESOME. (Cue the overexcitedness.) The bathrooms were clean! So many TVS!! Ringing a bell when the Giants score and then win the game??? How freaking cool?!\n\nBut I'm bummed you don't have cider on tap to make a poor mans black velvet.  =/ But my Guinness was the best draft Guinness I've ever had!", "author": "Emily D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-22", "description": "Typical sports bar. Nice place to catch the game with some friends, but nothing too special. Would come here to watch a game again.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "So, it pains me to write this review, as I have recently moved away from the Lower Haight, as well as SF itself.  The \"DC\" has been my Cheers for the last 4 years, and I miss it daily.  If you are looking for a local neighborhood bar that pours a mean Guinness and has amazingly friendly bartenders, look no further.  Great jukebox and a wide variety of characters/regulars to help make your night one to remember (or forget).  Also, a great place to come and sit and have a cocktail when you're alone, as you won't be alone for long!  The best bar in SF by far!  Cheers!  Miss you DC!!!! XO", "author": "Meg G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-29", "description": "Great spot for pub trivia that's close to my house. Tables set up throughout the place, as well as a ton of chairs along the bar. There are about 7(?) TVs so you can take your pick in terms of sports/politics channels.\n\nHuge plus: free chips and salsa throughout the night for pub trivia! You can even pick between red, green or guacamole.\n\nAlthough the bartender is pretty hot, our team was a little disappointed for different reasons: he never asked if we'd like a second round of drinks (we were sitting at the bar), and he kept people waiting for drinks for a relatively long time. I kept glancing over at him not only because he was cute, but because I was parched dammit!\n\n1 Newcastle + 1 coke = $7.50", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-14", "description": "Up until recently, my only experience at DC's was for Chargers games. I'm not a Chargers fan at all (I'm not marking this place down for that...honestly), but I still think this place is A-OK. To be honest though, I did have a better time here on my non-game day experience. \n\nThere's nothing that really stands out about this place, for better or for worst. It's divey, which is fine by me. They serve alcohol, which is DEFINITELY fine by me. What else? Hmmm...I kind of wish they had more seating, there's that. The drink prices are reasonable (actually, I think they're pretty cheap...at least based on my tab to alcohol consumed ratio on my last visit). The bartenders seem nice. \n\nHonestly, I think the one main problem I have with this place (and I'll admit, it has nothing to do with the place itself) is that I don't really like any of the other bars in the area. This would be fine if I LOVED Danny Coyle's, but I don't. I'm a mover and a shaker so I like to bar hop, and I can't do that in the Lower Haight. Oh, and I wish this place served food.", "author": "George A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Awesome place to catch a Sounders game when put of town. :) Thank you Fog City Faithful for being so welcoming! :)", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "The fist time I hung out at Danny Coyles, I was told that it was a Chargers bar! So naturally, on my next visit I had to come back when I was in town for the Cowboys/ Chargers game.\nI never expected the amount of people that came out to show their love for the San Diego team.\nBy the time the game started (which was displayed on the very large projection screen) the place was packed wall to wall with people decked out in the Blue and Gold.\nEven though the place was overflowing, the bar tenders did an awesome job of keeping all of us filled up on shots and beers.\n\nThe only little downfall is that they don't have a kitchen, but they let you bring in food from outside.\nCant wait to come back for another Chargers game.", "author": "Noel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "Trivia night on Wednesdays. Super fun and super difficult, but the drinks are pretty cheap, and the place isn't too crowded.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "I don't know why I didn't give it 5 stars. It's my favorite bar ever. Maybe because it's not off the BART? But's it's off of N-Judah. It's gonna be the new place to watch tennis!!! Tennis fans will finally have a home! :)", "author": "Leena B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "This is most definitely my local bar/favorite bar in lower Haight. \n\nIt's an Irish bar...like EVERY bar in lower Haight, and it's awesome! It's also one of two bars that serves liquor in lower Haight and they have an excellent selection of top-notch stuff.\n\nI started going here because a friend lives two doors down, and we'd go mostly to watch Giants/49ers games. It gets crazy packed and served for an unbelievable venue when the Giants  won the World Series. Sometimes there are also DJ's for holidays, like St. Patty's Day.\n\nThen we just started going to have a beer during the week, and it's perfect for that too. They don't serve food, have a few snack for sale, but you are totally allowed to bring in food from anywhere. (I suggest Wing Wing's or estrella taqueria)\n\nThe owner is incredibly nice, and he takes the time to get to know the regulars. It's kind of fun that many of the bartenders are Irish, and many of them are hottttt. \n\nThe bouncer on weekends, or game/fight nights is Alfonzo, and he is DA best. He sometimes works in full-on Mad Men suits and you just want to be his friend. \n\nI LOVE THIS BAR.", "author": "Chloé M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "What can i say about this place that hasn't already been said. Best Charger Bar in the world...Yes, great prices $2.50 for a tecate or $5 for tecate and shot of tequila(usually during games only), great bartenders, good people (i have met some great friends here). Even if you are not a charger fan they still show all types of games or matches here whether it's baseball, futball, hockey or even MMA and if it's not on just ask and they will usually put it on they cool like that. \n     Outside of the sports world this place has a jukebox ,trivia night, lets you bring in outside food, and sometimes has a food truck outside, allows dogs and takes credit/debit cards which is rare in sf.", "author": "Raul R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "Seahawks bar. Wtf. Jersey on the wall. We had to leave. They have fun trivia night. Normal beer selection.  Not too crowded.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "being from Seattle this is one of the best Seattle Seahawks bars that I have ever been to in the city. When we first walked in all we could see were Seahawks fans wearing their jerseys to support the team from San Francisco. The staff year was awesome and really timely on getting us our drinks and very supporting of the amount of people that were at the bar. The bar was packed with Seattle Seahawks fans when we were playing the Forty Niners and it was a great game to go to. Now that it is playoff time, this will definitely be a place I will come back to. The staff here was extremely friendly and I have not had a chance to eat the food because it was too busy for me to even want to eat. But overall, this is a great place for Seattle Seahawks fans to go to if you are living in San Francisco area to go to to watch the Seattle Seahawks place an awesome football game.", "author": "Thaddius D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "A seahawks fan in San Francisco can be a bit sketchy but Danny Coyle's is the spot to watch a game.  It's also a Chargers bar so the line can get a bit long out the door to get in (especially if there's a Chargers game on at the same time as I found out last week) but this bar has an awesome vibe to watch the Hawks.  It should be mentioned that the doorman Alfonso is the man.  I don't envy trying to manage as many people in line as he has to, but he has a rad attitude and was super friendly to us as we slowly made our way up the line to get in.  Keep him around!  Go Hawks!", "author": "Rachel O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-07", "description": "I came here for the Chargers vs Packers game and now I kinda get the hyphy massholes who live in PB... I mean people weren't d!cks in here but damn they were excited to watch some Chargers Football.. \n\nTeh fans in this place were more enthusiastic than an Oggi's Pizza Chula Vista crowd... Serio guey.\n\nAnywayz $2.50 Tecates and a cool crowd.. Thnx for putting me on to this place Yelp.", "author": "Noe O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Came here with my roommate to watch the NHL Stadium Series on Feb. 21. I was a little disappointed at the lack of a hockey atmosphere considering how big they hyped it up, but they did put on the game for us, and as a Kings fan, it was nice to be able to chirp the Sharks and not get yelled at by Sharks fans (they lost anyway, so the joke would've been on them)!\nI also liked that others at the bar just minded their own business with whomever they were with, so overall a very nice, laid-back atmosphere, which I'm sure gets much louder during baseball and football season!", "author": "Kristine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "As a Chargers fan, this place is like home.  It's so great to be around other Chargers fans during games, especially in the Bay Area.  The atmosphere and energy during Chargers games is just awesome.  It gets VERY crowded during games, so get there early if you want a seat.  Even with the crowds, the bartenders are great and definitely know what they're doing.  We will definitely be back next weekend!  PS No food there, but you can bring your own food in.", "author": "Jackee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "Are you a Charger fan and have found yourself lucky enough to now reside in San Francisco? Looking for place to watch the Bolts put the smack down amongst your fellow Charger fans? Look no further, Danny Coyle's is the place to be for the Charger games!\nSo many of us in the place have the love for the Bolts, it exudes into the street. \n$2 Tecates! Check!\nDC's does not serve food but they welcome you to bring any food from their many food establishment neighbors, peeps even get food delivered, right at their table in the bar.\nThe game is pretty much on every screen in the place but most important, always on the big screen. When we were there last, the 49ers were playing at the same time as the Chargers and who was on the big screen? The Bolts, of course!\nWhenever we find ourselves in SF during football season, DC's is where we are on Sundays!\nGo Chargers!!", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "I like pubs because I like the casual atmosphere without the pretentious undertones of having to dress a certain way.  But there is a limit to the level of casualness for me, because when obvious drunks belt out an unrecognizable song at the top of their lungs at 8:30pm someone better stop them.  Thank you nice bartender for shutting them up.\n\nI love how the windows open up for a nice summer's day and I love how they have tons of tv so it really doesn't matter where you're sitting because you're totally on top of the action.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "Finally. I found a CHARGERS bar in San Francisco. They are also a Seahawks bar. I've been here on 3 Sundays since i've moved to san francisco a month ago and the place gets packed with Chargers fans during the game. After every touchdown they play the original San Diego Super Chargers song. Awesome! Game day specials are $2.50 for a can of Tecate. Not a bad deal. Several TV's throughout so they will play other games as well.", "author": "Steven K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "What a great Charger bar! This is by far the best one I've ever been to outside of San Diego. Brian the owner couldn't have been nicer and the locals made us feel very welcome. I loved the Tecate buckets and the tower fans make with the empties. I also scored a Danny Coyle's Charger fan t-shirt while I was there. A great time for the Charger-Seahawk game. I will definitely be back.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-12", "description": "Best Chargers bar north of the 8! Found this gem after a frantic Yelp search for Chargers bars in SF the morning of the Bolts' home opener and what a fantastic, friendly and energetic place to be to enjoy the game! Plus, it doubles as an Irish pub the other 349 days of the year. This place rocks!", "author": "Terrence M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "I came here to watch the Eurocup semifinal between Spain and Italy. We got the table by the window so it kind of felt like we were in Europe watching the game, with all the people watching through the window from outside. \n\nA typical Irish pub with all the typical Irish beers. Of course I had to be different (it was Sunday Funday, after all) and got a bloody mary. They make them super spicy. My boyfriend asked them to go light on the spice and got the reply \"it's pre made\" as the bartender continued to pour tabasco in. There was practically a fist fight to order any drinks before the match, so spicy bloody marys for all.\n\nHave yet to try the food or catch this place on a non crazy day, but looks like it's a contender for one of the best Irish puts in Lower Haight.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "Great bar!  my friends complained that the service was kinda slow...  but it was busy on a friday night and sheesh,  if i was in as much of a hurry as my friends to get a drink i should probably call betty ford...\n\nhuge selection of whiskey (they are irish) and lots of beers on tap.", "author": "Phoenix D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-08", "description": "Tell me it was \"Irish Heritage Night\" at Danny Coyle's or something because they wuz reprezentin' last weekend during the Cal-Maryland game.\n\nProps to Danny for having the NCAA Football DirecTV package; props to Danny for having one TV dedicated to English-Premiere League Soccer and every other futbol game.  More props to the DJ at Danny's for spinning \"Passin' Me By\" by the Pharcyde just before \"Award Tour\", a classic Tribe Called Quest tune on a Saturday night.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-22", "description": "Is it a good place to come after work?\nYou betcha.\n\nIs it an Irish pub?\nNot remotely.\n\nDo they pour a mean Guiness?\nSure enough.\n\nWe meet here often after work.  It's a decent crowd for the most part, with many more men than women.  - Last time I was here that was not a good thing: after being very aggressively groped by a random man who sported the best mullet I've seen in a long time, nearby jock guys just leaned back and laughed.  Thanks for the help, dudes.  (BTW, the mullet-head's pick-up line was: \"Don't worry.  I can touch you.  I can kiss you.)  Guys.  I print this here to let you know, this is *not* a good line.  Even when very drunk.  Even when very late at night.  Never.  Ever.\n\nIt's a shiny sports bar with good-looking bar tenders.  Good for after work cause it's close.  Drinks are fine.  Not worth trecking across town for though.  \n\nDon't worry.  I can drink you.  I can sit you.", "author": "Ravena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "I got my Manchester United Scarf for the game tomorrow! STOKED! So glad I found out about this place!", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "Love to come here for Weds trivia.  They let you bring in your own food so you can eat while you play.  Lots of good options nearby - Memphis Minnies, Ali Baba's Cave, Rosamunde, even Three Twins Ice Cream. \n\nMy favorite trivia joint so far, even tho parking is a biaaatchh!!", "author": "Josie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-09", "description": "I was diggin Coyle's the night my 9ers whooped some Steeler ass. Good ambiance, polite and attentive bartenders and a very nice location for a Irish pub. For those on a beer budget, they also have a nice deal on $2 tacates. They also provide a solid amount of TV's, highly recommended for watching a game of your choice.", "author": "Patrick O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "This bar has a great vibe starting with the door man (\"GQ\"Alfonso), bartenders (Dan \"the man\") and the Seahawks and chargers fans of course. Also the best and safest spot in San Francisco to watch a Seahawks game. Go Hawks!!!", "author": "Jova E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-15", "description": "A Chargers bar in SF?! Heck yes!! We got there a little bit late, which was a mistake because it's a small place and was PACKED. Everyone is decked out in Chargers gear, gotta love it! They have $2 Tecates and one of the best bloody mary's I've EVER had.  If you live in the Bay Area and love the Bolts, this is the place for you.  I was visiting from Las Vegas and was really surprised that this place actually existed.  Had a blast and saw my Chargers squeak out a big WIN versus the hated Donkeys!", "author": "Teri W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Love this place! Live a couple of blocks away. This place is a great local spot.", "author": "Marc B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Fun little hole in the wall. Good triva night.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "Loved my experience here for the first time. Great service, very attentive, cheap beer 5$ for a bluemoon on tap. Awesome random music.", "author": "Shakei D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "Sports up the wazoo here!  And I love wazoos filled with sports! What IS a wazoo anyway???\n\nDanny Coyle's.....sports pub extraordinaire. Lower Haight so its not flowing with tourists. Across the way is Rosemundes which is a hipster haven for sausage lovers...and who doesn't love sausage? I know I do..heh heh ;) . They'll let you bring them back to the bar.\n\nThe bartenders are fast and can watch the game and serve at the same time! That's talent folks. Its a friendly environment and if you come on any given Sunday....you'll def feel like you're watching with a room full of friends.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-05", "description": "Such a bro-y bar.  Breeders.\n\nTrivia here should be avoided unless you get there way early and have super human hearing.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "Great bar to watch a game, I'm a San Diego native, so I can definitely agree this is the place to be! Last time I went was a Saturday night and it was uncomfortably hot and icky in there, it wasn't even that packed. Other than that, the service was good and quick! A ton of dudes as well, so ladies, this is definitely that place to be if you're single!", "author": "Samantha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "Excellant !!!! Great service the bartenders are just exactly what you need, smart and entertaining and they definately know how to pour a perfect pint of Guinness", "author": "Geoffrey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "Great place to watch MMA when they have a main event for only a $10 cover. Sine they don't serve food you have in and out privileges to go to nearby Japanese, BBQ, Mexican etc and bring it inside. I like that there were plenty of screens and places to sit. They kept picking up glasses and kept the place clean. A downside was it was too warm inside. Nice staff.", "author": "Jo H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-13", "description": "So I have to say that I've never eaten here before... but I came here early to watch an EPL match when I was visiting and am definitely willing to come back and try food.\n\nThis is a great cozy pub to watch matches at... but beware and get there EARLY! Windows open out but it's a strictly residential area so if it gets too noisy (and let's not kid ourselves here it's the EPL) the windows need to be closed again. On a cold day it's not that big a deal... on a HOT day with all those sweaty people, well... I think you get the point.\n\nThe bar situation is pretty decent too and I had as good a service as can be expected considering it was packed that day. They have some decent beers on tap and the staff is quick and professional.\n\nOnly 3 stars because I haven't tried the food.", "author": "Wonder W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-26", "description": "I'm keeping this one short and sweet - great drinks, great people, great vibe. This bar is one that, from what I can see, a lot of the neighborhood locals call home. The bartenders are awesome -- always chattin in up with their customers and talkin sports like like they do it for a living. I love comin to this place to watch the Giants game and to grab a brew after work. \n\nSports lovers? Pay Danny Coyle's a visit.", "author": "Sara K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-31", "description": "When I go into a bar, it should take approximately 2 seconds for the bartender to ask what I want. Why do I demand such a request? \n\na) It's been a shitfest of a week.\nb) I'm ordering something that will take 3 seconds.\nc) I have bewbz.\n\nOk, so the first two don't matter. Do you have any idea how hard it is to get drinks from bartenders who ALSO have bewbz?!\n\nPlus, why are you measuring out your drinks? I learned how to free pour in about 2 seconds. One, two, three, four. Please tell me, how hard is that of a concept to grab?\n\nBut you guys accepted credit cards. Plus one star. \n\nAnd have a back where I could put my stuff without worrying about it getting stolen. Except by the time I left the bar, I had no fucking clue what was going on ANYWAYS, and even left my credit card with the tab still open.\n\nOh and thanks for having my friend take my card for me. \n\nBut the space in the back was kinda dark. \n\nAnd I got sneered at by a lot of people. WTF. Nice clientel, peoplez.\n\n(disclaimer: this review was brought to you by Jaime's PMS. Again. Someone please take away her computer. kthxbai.)", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-15", "description": "Danny, I really want to love you for what you are, but your bar seriously smells like ass.\n\nDanny has a lot of good things going for it. And I need a good sports bar in my life. Being a crazy obsessed San Jose Sharks fan (and hockey fan in general) and living with roommates who are diehard baseball fans, living 2 blocks away from Danny Coyle's should be a dream come true. They have a lot of nice TVs, make really good drinks (including my breakfast Bloody Mary), and have a nice selection of interesting Irish beers on tap. But what the hell? This bar smells ridiculously horrible and on game days it's way too over crowded. So if you like visiting bars where you can't breathe comfortably, this is your place.\n\nI only resort to DC when I am seriously too lazy to walk an extra 2 blocks to Mad Dog. Which is never.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "San Diego Chargers Fan? CHECK! \n\nLiving in the bay area? CHECK! \n\nAppreciate $2 tecates on a sunday afternoon? CHECK!!!!!\n\nif you fit any of those three and know how to really appreciate a good carne asada burrito you should only watch your chargers games here.  no they dont have any burritos here, but at least everyone here will share your sorrow on not being able to get a legit burrito like you could back in sd. \n\nout of towners who are charger fans, GET YOUR BUTT IN HERE ON SUNDAYS.  this place is filled with every type of chargers fans during the football season on game days!!", "author": "omid a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-27", "description": "Yesterday was my first time at Danny Coyle and I thought to myself \"Why haven't I been been here before??\" Danny Coyle is one of the nicest and cleanest bar I seen. The interior is modern but old fashioned at the same time. i love how the fact they have open windows especially on a nice night like yesterday it was a perfect for drinks. There were 3 TV Flat screens, plenty of tables and chairs for seating and also a small private upstairs seating area if you want a little privacy. But one thing that seal the deal was the CLEAN bathrooms (3 private stalls!), i cant stand dirty bathrooms! \n\nDanny Coyle is known for their Pomegranate Mojitos (which is really GOOD!) plus they use Odwalla Pomegranate so you know its the good stuff. The bartender was really nice and the drinks are moderately priced ($8 Mojitos). Supposedly each day of the week there is a theme of the night. Wednesdays was Trivia night which i came out for my friend's birthday. The winner receive a $40 bar tab and sad to say my team placed last.  \n\n5 stars = clean bar, good drinks, cheap beer, clean bathrooms, & good crowd.", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Great place to get away from 49er fans in San Francisco. Go Hawks!", "author": "Andy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "Great service, nice people, and the Fog City Faithful! Nice to see that Sounders fans have a place to watch the games and celebrate together. It's cool that this place shows out of market games. We're telling everyone back home about Danny Coyle's!", "author": "Summer F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "Danny Coyle's is such a great bar. The manager, is a bad ass from somewhere in London. Soccer on at 5am (if there's a game). Always willing to put on another sporting event if you are so keen on watching it. \n\nRosamunde and Little Chihuahua are close walks by and you can bring your food in. Can get a bit crowded during FA Cup games or any other major sporting event. \n\nBest place to grab a pint of Guinness with some friends and forget about the \"real world\". Even if you have to remember it in the morning.", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-01", "description": "Okay I guess this should be my first official Yelp. I dont count the party I dj'd for cause I killed it and whatever...\n\nThis is a CHARGERS BAR. Even though football season is almost over, and we didnt make the playoffs this place is special to Chargers fans, those that live in SF/Bay Area and those traveling that find us here. We tolerate the Seattle guys (actually nice cats but the Seaturkeys? cmon) But we have an NFL sanctioned, signed, framed Tomlinson jersey (D'OH) and they have a goodwill framed Hasselbeck photo on the wall. Brian Siobhan and Steve (my next door neighbor) are in turn very tolerant of our antics and keep the Tecate's coming. anytime the Bolts are playing you can find me here as long as it doesn't fall on one of my custody days! DANNY COYLES SUPER CHARGERS!!!!!!!!", "author": "Sonny P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "It's been a busy week going to a bunch of AWESOME places for the first time - which has awakened my new Yelp reviews as I've clearly been MIA for a while. Danny Coyle's deserves one of my new reviews!\n\nFirst time here on a sunny Sat afternoon and I can safely give my stamp of approval. If you were to judge a bar by how clean their restrooms are - I'd give this place 5 stars just on that because their restrooms are not only clean, they smell nice but also have quite the zen quality. You'd think you were at a Westin Hotel! \n\nSpacious, roomy, bar seats have PURSE HOOKS which is always a winner for us females, service is pleasant, great selection of whisky, scotch, bourbon, vodka, tequilia, etc. - and they keep the place clean. It sure doesn't hurt that Rosamunde and Memphis Minnie's are down the street and you can bring your grub in. \n\nNo doubt, I will be back! Say yes to Bulliet Rye!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "It took me forever to find a charger bar in san francisco, and since I don't have cable at my house anymore, the only way i can watch a charger game is by going to a bar.  I searched google forever, but no luck and I had almost given up hope when someone said I should check out danny coyle's.\n\nWith my fingers crossed I headed out this sunday for the game.  Walked into Danny Coyles and a sea of blue!   It was just like being in PB again.. but with cooler SF type PB'ers.  \n\nThe bar itself is a nice pub with an irish feel.  A moderate selection of beers, ton's of TV's, and solid alcohol selection. The bartenders are really nice and did their best to serve the capacity crowd.  I'll be here again next sunday for sure.\n\nAnyway, to help other poor displaced charger fans like myself, I'm going to say \"danny coyle's is a great charger bar in san francisco\" one more time in hopes that google picks it up.", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-08", "description": "Lots of TVs. Good drinks. Cheap beers. Potato chips behind the bar. \n\nI love this place on football Sunday. Granted, it gets PACKED for games, but the people that you meet in the bar are all down-to-earth and cool to share tables with. For Sunday games, they also have the projector going with the Chargers game on, and PBRs for $2. There's usually another beer for $4 (in the past it's been bottles of Sam Adams). Wells are usually pretty inexpensive as well.... trust me.... the last thing I need at 10am is a beer... so I usually start off with a screwdriver.\n\nFeel free to bring food from anywhere else into the bar. We've brought in BBQ from Memphis Minnies, pizza from Mythic, and sausages from Rosamunde. One sunday, there was even a food truck parked outside (GENIUS!!!!) The only sucky thing is that you have to call in your food outside, because cell service inside the bar is pretty crappy.\n\nThis place makes me feel like I'm home... in PB.... watching the game with the bros :)", "author": "Mar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "Danny Coyle's would be my ideal neighborhood bar if I lived in San Francisco.  With a great staff and regular drink specials, this non-pretentious and sports savvy bar provides everything a 20 something like myself needs, futbol (soccer), good drinks, and some free parking in the surrounding streets.\n\nA big shout out to Steve for his famous Bloody Mary's on the weekend and for always having the San Jose Earthquakes and Tottenham Hotspurs fixtures on.\n\nWith so many bars in San Francisco, it's amazing how I always end up at Danny Coyle's before my stay is over.", "author": "A.J. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "A great atmosphere for watching sports. And from what I could tell, they had a pretty good beer selection (not so much wine, but if you're there to watch sports, you probably want beer anyway!)", "author": "Katie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "Sizable Irish pub littered with LCD screens running ESPN. Drew huge crowd on St. Patty's. Small dance floor in the back.", "author": "Robin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Good beer specials and fun scene. Worth stopping in!\n\nThis bar is in a great neighborhood with a chill vibe.  The guy behind the bar even has the accent. The accent! Give it a shot!", "author": "Don G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-07", "description": "Alyssa G. and I have been hitting up the Danny Coyle's pub-trivia night semi-regularly for the past couple of months--go team That's Spanish for Jesus!  The trivia itself is fun and really challenging, but why can't we get someone on our team who knows anything about music from the years 1 through 1981?  \n\nOK, rant aside (I'll leave it for a future pub-trivia review), this place is all right.  It's appointed very nicely, and I could imagine it being very interesting to watch a sporting event in here.  But it's not exactly comfortable, and there's a distinct lack of chairs and barstools, which is weird because this is, um, a bar.\n\nI think I would normally go with four stars just because it's nice enough and they allow you to bring food in here (the sushi place next door will even deliver to the bar), but it loses a star because one of their bartenders is a jerk who helped a particular team, which ended up winning that night, by cheating; he took the sheet around the bar and asked people to identify photographs.  Dude, other people are playing too.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-27", "description": "Gotta say it has become one of my favorite spots to grab a drink with friends. The bartenders are great! They remembered my name and drink of choice after the first time meeting them. \n\nI also love coming here to watch sports. They have several big TVs that are placed perfectly so you can watch the game from anywhere in the bar. The bar itself is attractive and has a warm feel to it.\n\nBest of all, it's very easy to get to from my house on Muni!", "author": "Terry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "I'm not really a sports bar type of girl, but I really liked this place. We stumbled in here after our stint at Bay to Breakers. First thing I noticed was how bright it was inside, with tons of natural light coming in. It was crazy crowded, but I didn't have any trouble criss crossing the space multiple times, or getting into the (VERY clean!) bathroom. They were playing the Celtics-Magic game, which no one was really paying attention to, as well as the Sharks game on multiple screens. They had a freaking giant projection screen showing the hockey game! The bartenders were very friendly, accommodating our vegetarian bloody mary requests and offering up conversation when I managed to lose my group within the bar. \n\nApparently this is the designated Chargers bar, so when I move here I have a place to go when I'm feeling homesick for San Diego! Woo!", "author": "Natalie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Good service with decent selection. Abundant bathrooms. Internet jukebox. Smells nice (for a bar).", "author": "Kyle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "Love this place - the local neighborhood sports bar. Go Sports!", "author": "danni r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "#1 seahawks bar in san francisco. brian, the owner, is regularly working the bar and the drinks are great. there are rotating deals that are usually good. no kitchen, but you can bring in any food you want. i go all the time, great neighborhood bar.", "author": "Michael J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-12", "description": "Green beans and pearl onions? I had considered sardines, Guinness, and celery, but never green beans and pearl onions in my bloody mary. This was a serious game changer and I am now on a mission to find something similar in nyc.", "author": "Steph G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-13", "description": "Danny Coyle's is a great place to watch a game.  There is a decent amount of seating, the bartenders actually card people to keep the 'young people' out, and there are tons of TVs and a huge projector to watch your game of choice.  There were plenty of soccer fans who turned out for an 11:30am Sunday soccer match, and I've read they will be open at 4:30am for those die-hard fans.  Beer selection is respectable, fewer options than Toranados (Chimay and Duvel) but more traditional (Guineess, Stella, Blue moon).\n\nOverall, a great place to hang out", "author": "T. M. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-22", "description": "So I am on  my way home to SD from SF and of course I book my flight until WELL after the Chargers game so that I don't miss it.   My flakey friend who was supposed to meet me to watch the game didn't come through so I turned to my BFF yelp (is that sad?) and searched \"San Diego Chargers Bar.\"  Danny Coyle's came up.  I trekked it there, big suitcase and all, and arrived to what looked like an average pub.  There was a Christmas tree in the corner and I pushed my suitcase behind it and got to work.  Bloody Mary was mediocre.  Then I hit the Speakeasy on tap.  Yum.  After trying to mix in with the rowdy fans I realized that there was no room and found a lone Chargers fan next to the only empty seat in the house and plopped down next to him.   Things were slow at first but the more we scored the rowdier it got.   \"San Dee-aygo Super Chaaaargers\" was belted many times.  I saw more cool Chargers paraphernalia there than I have seen in all of San Diego!  Vintage button downs, Mitchell and Ness T's, and even their own \"Dany Coyle's Super Chargers\" gear (someone please tell me where to get it)  \n\nI am meeting people left and right listening to everyone's San Diego stories and a chick decked out in head to toe Chargers gear grabs my hand and hauls me to the rowdy end of the bar where a tray of Don Julio awaits.  Two shots later we are all friends for life and my suitcase gets placed behind the safety of the bar by a nice gentlemen.  Of course the Chargers beat the Bangles and they play the entirety of the Super Chargers song over the speakers and everyone sings along.  It was probably the most fun I have ever had singing that song!  \n\nIf ever in SF again on a Super Sunday I will be there....", "author": "Juliana M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-19", "description": "Great, i can go all the way to the marina without leaving my neighborhood  (ok Its not really that bad).\n\nDanny Coyles is one of the two establishments in lower haight that has a hard alcohol license, It's pretty unlikely that you will enjoy both of them however as they are nearly on opposite ends of the spectrum.\n\nAlso, when I go in this place, its usually not that crowded, but there are not exactly a lot of places to sit.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-11", "description": "I am giving this place 2 stars for one reason only. This bar does not know how to control its rowdy, disrespectful patrons and they do not respect the neighbors that live around them. I have been to many bars that reside in neighborhoods (gay bars) and I can say that they really respect the people that live around them by keeping the noise down. \n\nThis bar could care less about that. I have witnessed this bar opening their doors to rowdy guest as earl as 5am. Loud music, screaming and hooting and hollering. Why the bar feels the need to keep their front and back doors open to let the noise travel far is beyond me. Also I have seen their guest climbing and setting up a smoke camp outside peoples front steps until 2am. Whoever owns this place does not seem to care much about the people that live around them and who have to maybe work in the morning.\n\nThis place is a great bar, but they really need to start taking lessons from Castro and SOMA gay bars and learn how to keep the noise levels down and control their guest.", "author": "Robert Shawn W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-10", "description": "Overall, this was not my favorite pub I've been to. It was clean and spacious inside, but it didn't have a lively pub atmosphere. It felt like a typical sports bar based on the number of TVs and the fact they were playing baseball, soccer and golf simultaneously.\n\nI ended up at Danny Coyle's with some co-workers on friday night because we couldn't find a table at Bean Bag. We ended up getting a table here, at a place with decent lighting, fair bartenders and Journey playing on the electronic jukebox.\n\nThe place seemed like it had potential\n\nI looked at the tabletop menus and ordered a pint of Magners but was informed after they opened a bottle that they didn't have it draft and the menu must have been a misprint. One of my friends got a cocktail, which was strong and well prepared. I probably should have ordered that instead, but oh well.\n\nThe crowd wasn't very big, but there was one obnoxiously loud older gentleman who probably wanted to kill himself when his baseball team lost.  He was quite amusing to watch, but I didn't mind that we only stayed at Danny Coyle's for our first round.\n\nIt seems like a find neighborhood joint, but not a place I'd make the effort to go back to. Overall, a very \"meh\" experience.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-04", "description": "I really have nothing bad to say about the bar facility. It's nice, and has a great Irish style pub feel to it(obviously)... But my friend and I went to Danny Coyles one Saturday morning to watch English Premier league Soccer. The bartender was friendly and the atmosphere was nice. But a day later I go to use my debit card and it wouldn't work. I checked my statements and realized Coyles had charged for 2 purchases...one being 16$ for my soda and my friend had a few whiskey and cokes. The other purchase was for 40$. I had no idea what it was for, but I knew for sure I didn't spend an even 40$ there, on a second purchase. Since it being the end of the month and my bills auto-deducting from my checking account, the 40$ over drafted me. (Plus an overdraft fee) I called Coyles and the person working seemed willing to help. They wrote down my number and said they would call the next day. I heard nothing. I called again, and this time I was given the cold shoulder and treated like I was accusing them of stealing. I was very calm and polite and made sure I mentioned to him that I was just inquiring as to what was going on. They said the owner would contact me the next day. The next day my bank called and said that Coyles had cancelled the purchase, so I checked to see with my own eyes, and sure enough it was reversed. I never heard from any owner or anything. I was disappointed because it was actually a great place to watch a soccer game, and because it was a nightmare to get the situation worked out. Make sure you monitor your card if that's how you're paying.", "author": "Luke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-29", "description": "This place gets a 5 star rating from me purely from my Saturday night experience.\n\nMy group of friends was celebrating a birthday over at Toronado when all of a sudden the birthday boy annouced that he wanted an Irish Coffee. Ok- let's do this! I pulled out my Yelp! app and typed in irish coffee and lo and behold Danny Coyle's popped up. I've been there before to watch hockey games and I believe I've played trivia there once or twice (not enough to remember it being as good as everyone says it is), but never to drink irish coffees so I figured I should call first. And I suspected (with it being a bar) that the phone would just ring and ring. THE BARTENDER PICKED UP! On the second ring. I was so in awe that I think I sat on the line not speaking for a moment until the bartender was like, \"umm, hello?\" \"Oh- hi! We were wondering if you serve irish coffees.\" \"We do.\" \"If we were over there in 15 mins would that work?\" \"Sure, I'll brew a fresh pot of coffe.\" \"I love you (my group told me to say this).\" \"I love you too.\" Major swoon! \n\nWhat do you know, 15 mins later, we step into Danny Coyle's and not only does the smell of fresh brewed coffee fill the bar, but he is warming up the glass coffee cups. Needless to say it was the best $8 Irish Coffee I've ever had. Best service I've had in a bar in SF.", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-15", "description": "I know I belong here.\n\n1) Stiff cheap drinks.\n2) Busy but not packed.\n3) My kind of people - while standing outside with one of the regulars, we were watching someone across the street moving a couch.  They dropped it down a flight of stairs.  The regular yelled \"PIVOT!\" \n\nWhen molotov's is overrun with Santas, Danny Coyle's offered me safe haven.  At least until I join the Santas next year.\n\nShamrock.", "author": "Archie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-02", "description": "I love this place. Wish I still lived in San Francisco to keep coming here.\n\nMy brother and I would come here for big footy matches. Every US national team soccer match, we'd be here and there would always be a good crowd. The SF chapter of the American Outlaws have even made it there official home bar. The bartenders rule, they will make you a stiff drink, and the cheap Tecates are always appreciated. \n\nThough I would normally knock a star off for serving zero food, the bartenders and the general ambience and atmosphere of the place makes up for it (not to mention that they let you bring food in). The place reminds me of my favorite bar here in Albuquerque. As soon as I move back to The City (hopefully sometime in the near future) I will make every attempt possible to be within walking distance to this place. A very chill, laid back neighborhood bar that, if you visit it enough, will earn your sentimental feelings.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "A great place to watch a soccer (football) game in San Francisco.\n\nHave enjoyed being there in the afternoon for a game, the evening or at the break of dawn.\n\nA few weeks ago I got several friend together to watch some World Cup Qualifiers that started at 7 am and the doors were open and the bartenders ready to pour a beer with a smile.\n\nI used to go to Mad Dog but it is not as friendly to soccer as it used to be.  Danny Coyles is now the place to go.  For the USA vs. Honduras World Cup Qualifier,  Danny Coyles was one of only thirty bars in the country that you could watch the game.  There was a crowd out the door watching the game!\n\nThey had a good selection of beers, and a great atmosphere.  The only reason I don't give it five stars is there is no food served there so you have to go across the street to Katz Bagels for some grub during a morning round of watching games.\n\nI can live with that.", "author": "Douglas Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "My first attempt at finding a Chargers bar in the Bay Area leaves me feeling a bit torn.\n\nI do like your inviting motif of the irish bar, yet I don't enjoy the $7 I spent for a white russian.  This is Sunday morning at 9:30am, not Saturday night on the Vegas strip. (ok ok maybe I'm exaggerating but still, that's a bit steep for a cocktail in a neighborhood bar)\n\nI like the sweet setup for football watching.  Plenty of hd screens all around and a big projector in the back.  I didn't enjoy the vibe of the crowd.  Rowdy is good, just not douchebag angry rowdy.  What's so hard about relaxing and watching the game?\n\nPerhaps they have some more reasonably priced drink options.  It would be nice if there was some sort of bar food, but no dice.  Kudos to being a Chargers bar with a good sound system to go with all those tv's, but more work is needed.", "author": "Bennett L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "THE Charger bar in SF. Every Sunday (or Monday, Thursday) it's like going home. I look forward to hanging out with all the fellow Charger fans, who have been going there for years. And in the offseason, it is a big gaping hole in the week. It is and always will the a Charger bar, all Bolts are welcome!", "author": "C C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "Not to copy my BF, but this has become my FAVORITE bar to frequent.\nIt's clean, cute, plays good music - not too loud, there's always a spot to sit (OK - I'm old), easy to get a drink, and most importantly the bathrooms are clean. One minor complaints that isn't really a complaint, I wish they still allowed people on the back patio (what is it with neighbors complaining about back patios, if you don't like noise, don't live above a bar or cafe)....oh and sometimes I wish they served food!", "author": "Kate O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "Pretty much the best sports bar in the City, at least for me. I'm hesitant to say so because I don't want too many people to know about it.\n\nThe bartenders are overworked but don't worry, they know you're there and they'll get to you. The beer selection is nothing special but it's all you'll need and reasonably priced ($5 for a pint - whose complaining?). The atmosphere is, well, it's an Irish pub - it's just what you think.\n\nIt gets crowded for big events, and you might have trouble getting a seat. Hence I had to knock off a star. But really, there'd be something wrong with the place if it wasn't crowded, right?", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "Danny Coyles is a major reason the lower haight is one of the places to be these days.\n\nThe staff are wonderful! Owner Brian Coyle is extremely nice, extremely talented, and knows all of his patrons by name, practically! The bar itself is very well kept, clean, classy, but very down to earth. There's a small dance floor and they often have djs on the weekends for a younger crowd. Great place to watch a game, have a party or just hang out with friends. \n\nOh, and did i mention super fresh ingredients for delicious drinks, like pomegranite margaritas???? love!", "author": "Piper P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "This place makes me wish I drank a lot more.\n\nShows UFC events, friendly staff, great crowd, great bathrooms, thumbs up.\n\nEven though there are 100s of bars closer to me I'd rather make the short walk up Haight St to this friendly destination.  This is strictly a bar, no kitchen but you can bring food in which to me is even better.  \n\nFutbol (soccer) is the favorite sport on the tube but this place goes out of their way to arrange the sporting event you want on one of their many conveniently located flat screens.  They are showing PPV UFC events for $10 which is great, nothing is better than enjoying a night of great fights at a place like this.\n\nWhat firmly makes this my #1 favorite bar in the city is the ownership and staff.  Nice people with no attitude!", "author": "Mitch M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "I am reluctant to tell people how awesome Wednesday night trivia at Danny Coyle's is, because I want to make sure I can continue getting a table there. Even though it's more of a hike for me to come here than go to Martin Mack's in Upper Haight, it's just... better. I like the trivia MC (I think his name's Tony), and it's a cute little venue with reasonably priced drinks. They take cards. The male bartender puts lemon in my coke. Mmm. It can get packed when there are big games on, but isn't that the point? It's also a cool place to hang out on a weekday afternoon.\n\nEdit: Tip - order from the male bartender, Dan, whenever possible. He's awesome!", "author": "Lara C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-20", "description": "I came here to watch the late morning Europa League final. Good place with plenty of space. Large bar and a plenty of TVs (I think there is a projection tv as well). Good selection of beer, so you won't be disappointed. I look forward to going back to watch more matches while in SF.\n\nMy one disappointed is that they didn't server food since it was lunch time and I was getting hungry.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-11", "description": "I live two blocks from this bar and it has become my favorite local bar.  They play charger's games during football season which I love.  I also love that they allow dogs and have a dog bowl by the jukebox so my little pups don't go thirsty.  It is a fun, mellow place most of the time but can get crowded on weekends and during sports events.  A lot of my friends love this place cause they play all the soccer games at odd hours of the night/day.  Also they have good happy hour and beer specials.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-23", "description": "One of the best places to watch a sporting event in a small place.  But I have to say the bartender/owner...  THEEE BEST.  Very courteous, attentive.", "author": "Demanding T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-01", "description": "As one of the few bars in the Haight where I don't have to worry about bumping into a guy I've led on in the past, Danny Coyle's holds a place in my frozen, man-eating, ain't-no-bar-safe-no-more heart.\n\nI would tell you this is my come-to spot on Saturday nights, but since I've led on half of the Internet, then my secret would no longer be safe, and fisticuffs or kidnapping might ensue.\n\nThe bartenders are hotties, guys outnumber girls 3x1, the lighting slowly grows dim, the jukebox sometimes makes way for a DJ, and  the customers appear to have good hygiene practices and carry few periodontal diseases.\n\nLast night, we ordered some stiff drinks and four red-headed slut shots.  According to some bystanders, after I take red-headed sluts, I smile like one.  Who knew?!", "author": "Janney B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-25", "description": "I am not a football fan. I am a fan of cheap light beer. So 11pm at Danny Coyle's is perfect. Miller Lite is $3 all weekend in honor of football, but football isn't actually being watched. Sure, the requisite ESPN clips are running over and over, but it's drowned out by a DJ spinning hip-hop and people conversing.\n\nThat same beer at 11am surrounded by people yelling at the TV would be considerably less enjoyable.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-22", "description": "So this is the bar closest to my flat that plays European football matches. You know, Chelsea vs Barça or Ireland vs Croatia. I watched every European Cup game here, well, save for 2 or 3 games. Why not five stars Klik? Well they don't serve food, that would be dope. But they'll let you bring in whatever food you want and there are a bunch of places in the area to get food. Hell, order from Sushi Raw and they'll deliver it to you at the bar. The other downside is that people smoke right outside and there really isn't any place to avoid the smoke. I know, that's a pretty lame thing to complain about but still. I've watched two World Cup finals here, literally dozens maybe even a hundred or more Premier League, Champions' League and La Liga matches here and just to put the cherry on top I watched the last 4 innings of Matt Cain's perfect game here. So yeah, I like coming here.", "author": "Klik W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "Not surprisingly, it was packed at 6pm on St. Patrick's Day. However, it was still possible to move through the crowd and I give the bartenders props for being as quick and attentive as one could reasonably expect. A barback was roaming the floor collecting empties throughout. The bathroom is rather cramped and entirely visible when the door opens, so decide ahead of time whether you're feeling exhibitionist!\n\nTRIVIA: The association of the shamrock with Ireland and St. Patrick's Day is based on the belief that he used the 3-leaf clover to explain the Holy Trinity to the pagans he sought to convert.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-03", "description": "I grew up in San Diego and have lived here just over 9 years.  HOW IN THE HELL DID I NOT KNOW ABOUT THIS BAR UNTIL LAST WEEK????!!!!!  I'm a huge San Diego Chargers fan and watched my first game at Danny Coyle's today.  I had a blast!!!  I got to meet some great people and drink a few $2 Tecate's.\n\nI'm going back every Sunday that I can.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-29", "description": "As a gal that moved here from NC, I can't help but love a bar that sports my fave Carolina BLUE! :) The bartenders are awesome, the space is cozy (but never cramped) and the drinks are decently priced. \n\nI'm here *every* Thursday night, what can I say? Kinda love it ;)", "author": "linda t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "Come early for trivia to get seats! It was fun. Nothing to remarkable about this place", "author": "Alexandra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "I love it when both the fiance and I agree on a place, and Danny Coyle's is one of those places. It's perfect for him because he doesn't like night clubs, scenes, dance floors or anything the he thinks is trendy. I like it because though it's casual, the people hanging out don't totally look like they just rolled out of bed, and no one is smelly. (had problems with smelly people at bars recently). Also if you wanna wear a cute shirt and jeans to go out you can do that here and not feel like you didn't go anywhere all weekend. \n\nIt's a pub, and it's clean and polished and there is even a DJ I think on weekends, where part of the back area becomes an impromptu dance floor. So though it's not a club, if I want to dance to some cheesy music I can get that urge out here and my fiance doesn't have to be miserable. \n\nGreat for hanging out with friends. They even let us bring our own jello shots in. \n\nParking is a challenge though and since I don't live nearby I and parking is so tough I won't be here as often as I'd like.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-09", "description": "What better way to wile away a Saturday afternoon, post-girls' brunch and boozey shopping spree, than sipping Bloody Marys and screaming along to The Killers with good friends at Danny Coyle's? I honestly can't come up with one good alternative. Thank you, Nadja, for insisiting we head over to meet you just when we were hitting the peak of our morning binge-drink.\n\nSaturday Brunch Club invaded Coyle's for a raucous good time this Saturday. What fun! What drink specials! What an awesome music selection! There was drinking, dancing, and merrymaking. And parking. Right out front. It was pretty quiet in there, and we were 6 of only about 10 people in the bar, so no one minded us ladies jumping around, dancing, and singing along. Plus, this bar is CLEAN. It's pleasant. It's spacious! Nice bathrooms, too!\n\nGood times! Nice bartender! I'd come meet friends here anytime. I just probably wouldn't go out of my way to make this a regular spot, as it's nowhere near my house. If this is your neighborhood bar, I strongly suggest you become a regular here.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "Good spot, good crowd, nice people, fun trivia night on wednesdays...winners get $40 bar tab, And its $2 Tecates! Dark, home-y, local atmosphere.", "author": "LeighAnn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "The best part about moving to a new city is discovering things in your neighborhood that you never knew were there. For me, it's been the whole Lower Haight area and it keeps delighting me with discoveries and every time I walk up here, i wonder why I don't hang here more.\n\nLast night's adventure included a stop in to Danny Coyles for a coworkers bday. I didn't really know what to expect, but liked that there were a mix of things and styles going on here. Kinda like a cocktail, if you will...\n\n1 part sports bar\n1 part fun trivia night\n2 parts decent red wine choice\n1 part cool bartenders\n3 splashes of eye candy\nFinish with a lime.\n\nYeah, I'd drink a Danny Coyle again :)", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-02", "description": "I haven't been serenaded since that stalker I had back in 1998. He waited for me in the parking garage of my work and sang me a song about all of the places we had been and all of the special memories we shared during our year long sham of a relationship. It was almost sweet, had it not been a little psycho. Anyhow, yes, that was the last serenade I received......\n\nuntil I came to Danny Coyles. Within 5 minutes of settling down with my Magners (it was a warm Saturday afternoon, and I was in an Irish bar, with my girlfriends....what else would I drink??) I had a lovely Irish gentleman, who, himself, had had quite a few Magners, saunter up to me.....I mean REALLY close up to me, and sing me a song while he strummed his electric air guitar, with wah wah pedal sound effects and all. I hear the look on my face was priceless, but you should have seen the gals staring at me with that \"WTF? Please don't let me laugh\" look on their faces. \n\nThis serenading looked like it was going to hit a round two about 45 minutes later, but the bartender yelled at my admirer to leave me alone so he quietly went back to his seat, leaving me and the girls to our hangovers and gossip. Hooray for a bartender who is aware of what is going on in her bar!\n\nIt must be noted that this is one of two bars in the lower haight that serve hard alcohol. It must also be noted that it is the newest looking Irish bar I have seen in the city (not sure this is good or bad, just noted), with the cleanest restrooms (this, on the other hand, is definitely good).", "author": "Drue C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-14", "description": "I tried to go to Danny Coyle's without thinking of it in the context of the old An Bodhran. But it's impossible when its predecessor was one of the best neighborhood bars around. So it's impossible for me to even think about this new place without mourning all the things I miss about the old, dark, musty pub that was like a second home.\n\nTruth be told, there are many bars like Danny Coyle's in Ireland... \n\nAnd they're in hotels. Bright, slick, and full of modern interior design, they're swanky and comfortable, but completely lacking in character. (Exception: The Octagon bar at U2's Clarence Hotel.)  The same holds for DC's.  \n\nBetween the plasma TVs, weenie digital jukebox, and wobbly high bar tables, this bar invokes the \"I just got my first corporate job\" bachelor pad more than it does a place to get a dose of the ol' Craic.  Especially without Guinness on tap (!) nor a kitchen serving up chips & curry.\n\nOn the bright side, they do have the cleanest bathrooms in the Lower Haight (it wouldn't take much, but they are indeed very nice), they kept the Strongbow tap, and they still draw a pretty cool crowd of neighborhood regulars.  They're also dog friendly, which means you have an assortment of cute pooches to play with as you wrack your booze-addled brain coming up with your answers for Monday night pub quiz.\n\nDespite that, all I really want to say is fuck Danny Coyle and his fancy bar. I want An Bodhran back.", "author": "Omid T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-02", "description": "Oh Danny Boy, the yelps, the yelps are calling. I was a fan of An Bodhran, and when Danny Coyle's replaced that fine drinking establishment, I wasn't sure of what to expect.\n\nI stopped for the first time this Saturday afternoon, and the place was pretty busy (March Madness on the plasmas, don't you know). Getting a drink turned out to be a bit of a chore, but that Guinness was worth the wait. \n\nDanny Coyle's is good for the neighborhood - while it didn't feel like a true Irish pub, there is that sense of jovial (or drunken?) friendliness, which is good for something. And it is good for meeting up with friends, watching the game, that sort of thing, just nothing out of the ordinary. \n\nIf you are lucky enough to grab one of the window seats during the day, then you might just be charmed enough to make this more of a regular destination. Also, if they start serving food, like an honest Shepherd's Pie, call me.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-14", "description": "I came here during a random night of drinking that started at a friend of my friends' housewarming up the street.\n\nThis place is an average pub, I was going to give it just two stars because the DJ was a Mac DJ, which was hella whack!  I hope on other nights they have a guy who is doing some serious spinning.\n\nThe reason it gets the extra star is because I learned it is a San Diego Charger bar!  GO CHARGERS!  Now I know a spot on this side of the city where I can go and be around other San Diegans!  Can't wait for next season!", "author": "Mark L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-21", "description": "Nice, but not a destination bar.  Surprisingly \"classy\" for the 'hood, and the prices reflect that.  Another reviewer mentioned that it's the type of bar where you could take your mom and I think that hits the nail on the head.  Personally, though, I wish I could have experienced it in its previous incarnation as a pub.", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "1) Who was the leader of USSR when Nixon was US president?\n2) In what country was Monica Seles stabbed?\n3) What school did Harry and Sally graduate from in \"When Harry Met Sally\"?\n4) \"Gettin' Jiggy With It\" samples a song by what band?\n5) Name the country with this flag: http://www.ri.net/schools/Smithfield/gms/walls/Mandela/Flagbig.GIF\n\nIf you can answer at least 3 out of the 5, you qualify to be part of my DC pub quiz team!  Honestly, I could only answer one of those (the tennis question)...I kinda suck.  I'm really just the secretary of our team.  I'm not sure why I go when I leave feeling kinda dumb.  But with the right team esp. with a music whiz, my team's won 1st prize a bunch of times, a $40 tab for Danny Coyle's.  So we keep coming back...\n\nI've only been here for pub quiz on Wednesdays.  I've heard it can be a scene on the weekends.  The bar's puppy friendly and the bathrooms must be some of the cleanest in all of SF.  If you prefer dives, this may not be for you...but if you prefer cool nerds, this bar may be for you on Wednesdays!  Oh and there's a hot, friendly bartender (Daniel I think) that's usually there on quiz night. \n\nAnswers:\n1)  venhzerB dinoeL 2) ynamreG 3) ogacihC fo .vinU 4) egdelS retsiS 5) acirfA htuoS", "author": "Mimi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-09", "description": "I used to equate watching soccer in this town with places like Martin Mack's: dirty and smelly and gritty and loud.\n\nBut now I've been to Danny Coyle's. Which is a very lovely, clean bar, tended by a very polite bartender, with a cool back patio. And it still has the requisite rowdy Irish and English soccer fans gettin' their schwerves on.\n\nI'm a proponent of dirty and smelly and gritty and loud. Really; I am. Every girl likes a bad boy like Martin. But it would be stupid not to give a nice guy like Danny a try for a hot soccer date some time...", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "Cal and I were an hour or two early for our dining club event, so we decided to stroll along the Haight and perhaps shop or drink. The first interesting place we saw was Danny Coyle's. What really caught my eye was the blackboard sign out front that read \"Killer Bloody Mary's!\" Killer - awesome. Bloody - pretty awesome. Mary - just about the best name ever! \n\nI've only had Bloody Mary's on long plane rides with my best friend, and those don't compare to the one served here! Dang, was it strong! I only finished about 80% of it, which I thought was pretty impressive. As for the garnishes, I didn't think the olive was that great, but the onion and green bean were really really good.\n\nThis place was cute, clean (esp. the bathroom), and pretty welcoming. I'm glad Cal and I decided to pop in. My drink and his beer came out to be 9 bucks.", "author": "Mary T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "The website for this bar makes it seem like a club -- what with the green neon lights, people on the dance floor, and martini glass, but it was not like that at all, at least not on Wednesday nights.  Instead, it was a great, laidback Irish pub with good beers on tap and solid trivia.  Nice!\n\nThey also have some signature cocktails, which included a blackberry mojito, pineapple gimlet, pomegranate margarita, and bloody mary that night.  After succumbing to the Irish pub urge to drink Guinness, I tried their bloody mary.  It was good, but nothing out of the ordinary.  Might give some of their other cocktails a try another time.\n\nTrivia was lively, but not too crowded (every group had seats and a table), which is key to an enjoyable experience.  There was good variety of subject matter (music, current events, sports, pop culture, history, etc.).  \n\nThey had baseball and soccer on the tvs, which was also nice.  And, like many other people here, I have to give a shout-out to their bathrooms!  Very clean, and there was a third one, which essentially turned into a 2nd women's room - awesome!  And it's in the middle of the bar, so you can still hear and participate in the trivia when you're standing in line.  There was also an ad in the bathroom for \"the funniest movie ever about bulimia.\"  Cool beans.\n\nP.S. The \"Office Squids\" will be back to dominate at trivia! :)", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-10", "description": "So I was dubious at first when Jill K. suggested this as a possible Happy Hour location. However,  I went and checked it out myself as a pre-Happy Hour recon last night and it quite handily passed muster.\r\n\r\nI like this bar, while it isn't like my usual haunts I like it's atmosphere and the fact that front windows open up almost floor to ceiling in a fashion that reminds me of Key West...A good staff and a very nice owner (I spoke with him on the phone about drink specials for HH). I would like to see a bit more decor and bit less TV. I will hold my judgment of the jukebox until after tomorrow but I like what I heard.\r\n\r\nHappy Hour at Danny Coyle's should be a blast...\r\n\r\nUPDATE: Happy Hour at Danny Coyle's was everything I expected and then some - Thanks to all who made it!  This is definitely a great location (proximity to Memphis Minnies is a big plus) and I think that Brian, the owner, has a winner on his hands - Thanks for a great night Brian! \r\n\r\nI only have one wish and it's on the jukebox front...While the jukebox is decent it doesn't stack up to Zeitgeist or Lucky 13's...It's workable but could be better with a little more old school punk, a little more funk and a lot less Gnarls Barkley (then again I hate Gnarls Barkley so I am biased).\r\n\r\nGreat place, definitely recommend it as a place to go and toss back a pint or 3.", "author": "Todd E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-16", "description": "I'm giving them 5 stars for a few reasons! Been here 3 times and liked it everytime. Twice on a Sunday and once on a Friday night. \n\n1. CHARGERS bar on Sundays! Unfortunately we lost both times :(\n (minus the drunk eagles fan who came in and started a fight during the game)\n\n2. The girl who bartends there with the red hair is AWESOME! I hadn't been there in a month and she remembered what beer I drink!  That's impressive to me! She also made an effort to call the owner to see if I could get on the [FULL] guestlist for an \"invite-only\" Christmas party. \n\n3. They ended up putting myself and 4 others on the guestlist for that private party after it was supposedly full.  \n\n4. Beer specials are great on Sunday. \n\n5. More that one bathroom for women! A plus when you're drinking!\n\n6. I've met some cool people here.  \n\nHighly recommended!", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-04", "description": "Sure, I'm not the prettiest guy in the world, but that doesn't give license to IGNORE me.\n\nLets paint the picture: not crowded on a Thursday night.  I walk in and see familiar looking law students meandering about.  Seeing the bar is mostly empty, I figure -- grab a beer and then to the mingling.  \n\nSEVEN MINUTES LATER I have a beer in hand.  When the bar isn't busy, that's OBSCENE.  Repeat this once more, although to be fair, the second time around was about five minutes for a drink.\n\nClearly this place has an internet juke box which leads to non-staple music, which I appreciate.  However, it's WAAAY too loud.  Trying to talk in this bar is like *insert witty analogy*.\n\nBathrooms are SPOTLESS and HUGE.\n\nI may give Danny Coyle's another shot simply based on the praise provided below (and likely above).", "author": "jack p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-01", "description": "Clean, comfortable, and seemingly new.  It doesn't even smell of stale beer yet.  \n\nGet it while its hot!!!", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "I don't generally like sports bars, and I tend to avoid places with vaguely Irish sounding names or decoration. At least in DC, we have a lot of crappy bars that masquerade as Irish pubs, and many bad experiences have led me to roll my eyes every time someone suggests stopping in at one.\n\nThat all being said, Danny Coyle's was so much better than I would have expected. First, the bar was comfortable and not crowded, and they had an incredible bloody Mary, served in a pint glass, for $6. So spicy and delicious, and served with a pickled green bean. Eclectic crowd--several cyclists in biking spandex seated amongst people in sports gear watching the game. And people not watching the game, too. Mmm spicy bloody mary.", "author": "Stuart S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "Great place to watch sports. They always have good beer specials ($2 tecate or $3 Sam Adams).", "author": "M R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "This is one of my favorite bars in the city! Whatever you want when you go out is here - sports, great bartenders, fun people, locals, visitors, awesome jukebox, happening neighborhood are all big check marks here! I've watched election results, World Cup matches at 4 am, and UFC fights here. You just can't beat the versatility and appeal of this place!!", "author": "Makela C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-09", "description": "This place is pretty alright, but it certainly doesn't wow me in any way. Definitely not a bar that I could stay at for too long - it is usually just an accessory to the other bars in the lower haight.\n\nOne highlight was an Onion pub crawl that was here - absolutely packed, but met some good people, and got a righteous onion pint glass. Yes!\n\nI've tried to come and watch games here before, but it rarely works out very well - too many people, too much noise. Meh. Maybe I just haven't had good luck.", "author": "Ben Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-13", "description": "I was poking around on the yelp events in SF to see what was happening Saturday, and lo and behold Bryan B. is a fellow SeaHawk fan WITH an event set up to watch the game at Danny Coyle's. Hell yeah. I'm there.\n\nAfter a bus ride and a walk, I arrived in Lower Haight. Seeing as I'm pretty much new to the city, it seemed to me that Lower Haight was a pretty cool little area. I walked into Danny Coyle's, which is a neat little pub with lots of room and lots of flat screens to watch multiple games. Bryan, his bro Trevor, and a few other guys were hanging out waiting for the game to start. I ordered a local SF beer, an amber that I don't remember the name of but was really tasty. Looked like DC's had a bunch of good beers on tap as well as a bunch of good stuff in bottles. \n\nDC's is an Irish pub; the bartenders are Irish, some of the patrons are, and I gotta say that's pretty fricken cool to find. The bathroom wasn't too shabby, and there was plenty of spots to rest your butt and drink a beer and still see a monitor.\n\nGreen Bay pounded the Seahawks, unfortunately, and there were a bunch of Packers in there. However, me, Bryan, Trevor and a fellow named Mario made sure to whoop it up when we could. I'm hoarse again, but it was well worth it.\n\nI'd definitely recommend DC's. Looks like there's a fun group of regulars there, and it probably would be a fun time on a Fri or Sat night as well, though I don't know that for sure.", "author": "Will L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "Danny Coyle's--great for moms!\n\nIt's the LH bar I'm most likely to bring my mother to.  I've already brought my roommate's mom here and that was a smashing success of an evening.  It has a fresh, clean interior and a nice enough staff.  They've also got enough Otis Redding and Rolling Stones to keep mother and I happy.\n\nI have high marks for DC's because it's great at being what it is--a nice, clean establishment in an area where those are pretty rare.  Also, I enjoy watching the socc--FOOTBALL--games on the TV above the jukebox. \n\nI just wish nice places didn't give me the creeps.  I'd rather go to a shitty dive and feel right at home.  Too bad my mom's not a Molotov's kind of gal!", "author": "Eric E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-12", "description": "Well F me. That whole Duboce Park Cafe yuppie pincer movement* on the Lower Haight was a decoy! They're really attacking us from the hills!!\r\n\r\nNow open in the old An Bodhran location. Owned by the same folks as Martin Mack's, the space is still under development, but is shaping up to be a \"nice\" pub in the Lower Haight. Rather large back area with a stone floor, totally new bathrooms, flat panels on the wall... A big step up from the scuzzy neighborhood norm. By the same token, the space has no character -- yet. But we'll see what they do with it over the next few weeks (when, hopefully, I'll be raising my rating). Crowd-wise I don't know yet, but the staff is super-friendly. Keeping my fingers crossed it doesn't contribute to the 2AM \"woo hoo\" quotient outside by apartment much.\r\n\r\n*See: http://www.yelp.com/biz/R3YMmqmPIjJh8V80VpTD1w?hrid=BNXgN9k3p6aY2zJMsEdtVw", "author": "Tom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-22", "description": "I finally got a chance to have a drink here after passing it repeatedly for the past several weeks. I was feeling slightly wary when I saw the marina-looking crowd, so I thought it was due time to check it out.\r\n\r\nI must say, I was plesantly surprised. The bar staff is all extremely friendly and laid-back. I had a greyhound with the new Absolut RubyRed which was delicious and refreshing. Yes, it's a little sterile for an Irish Pub, but it just opened up... give them a break! As much as I love the grungy dives around here, it's nice to have a more upscale place in the neighborhood.\r\n\r\nI look forward to returning!", "author": "Jill M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-30", "description": "That bartender Steve is a nice bloke.  \n\nIt is now the best place to watch the Premier League in the City.  Any supporters are welcome, except Chelsea Jerry.  \n\nIt would have been 5 stars but that disturbing Spurz doll shatters the atmosphere a bit.\n\nEdit: The doll is gone,  5 stars\n\nBTW  It's not a Sp*rs pub right.  That's really a ridiculous concept this far away from London.  Of course it wouldn't work there but this ain't London is it.  Whether you're from Ireland or Iowa, London or Lickme we all co-exist here.  It makes the atmosphere a bit more fun I think. \n\nThat's that!", "author": "Byron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "I spent hours here last Saturday. Friendly bartenders. Good people watching. Good specials. TVs everywhere!!", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-12", "description": "I know it's been mentioned in other reviews, but this has to be the most upscale-looking bar I've ever been to in the Haight, which kinda makes it stand out in it's own way...\r\n\r\nI went here for the first time on one of Todd E's weekly installments of the 'Destroy Your Liver 2006' tour, and had a great time. The bar has a very open feel and I like the little area in the back (I didn't get to hang here though because it was too packed with Yelpers...that's what I get for arriving late). I also loved the music that was playing on the jukebox (Arcade Fire, Franz Ferdinand and the Killers among others)...good stuff!\r\n\r\nThe owner, Brian, and the staff were extremely friendly, and they have a nice selection of beers on tap...being German, the lack of Irish beers didn't disappoint me, because they have Franziskaner Hefeweizen on tap! The beers are decently priced, and I heard the prices are even better during happy hour...\r\n\r\nBrian hooked us Yelpers up with a free round towards the end of the evening, and this was way cool because he wasn't obligated in any way to do so. It's refreshing to see business owners give a little back to their patrons for a change!\r\n\r\nI'm sure that at some point this bar will eventually get more 'beaten down', but it's definitely worth checking out at least once, regardless of its state...", "author": "Art D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-11", "description": "Killer local bar. The bloody mary here is amazing - long on pepper and an interesting bitter citrus. Show up during a soccer game and get caught up in the excitement with the locals - just don't do what I did and hope to cure a hangover during a big game!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "I come here to watch EPL games early in the morning...like 4/5:30am. Great staff, very friendly and other patrons are just as nice. Love this bar!", "author": "Cristina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-05", "description": "When I first heard that there was an Irish pub in the Lower Haight, I was a little cynical about what I would find.  I walked in here for the first time at the request of my girlfriend and was amazed! They have large televisions, great drinks and friendly bartenders.\n\nSomehow, I managed to spend $85 dollars there last night...so...maybe the drinks aren't the cheapest in town, or maybe I just drink too much...oh well, Danny Coyle's is a great place!", "author": "Craig E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "I just found my favorite UFC bar. fuck yea", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-12", "description": "I'm getting really, really tired of hyperbole especially since that appears to be the only way Yelpers can express themselves. Where are these bars with bathrooms that have puke & urine all over them?  I have been to many bars in this city and I have yet to find a bathroom that had puke all over it. And I don't frequent no Redwood Room. Where was this puke? Was it smothered on the walls mental hospital style? Was there a trail?  \n\nIn any case, Danny Coyle's does have an extremely clean bathroom, well sized drinks (none of those tiny glasses) a very nice happy hour with 3.50 pints and awesome huge windows to watch the neighborhood. And anyone who's ever been to the UK knows that not every single bar is a giant, cavernous dark pub. They have nice bars there, too, so there's no reason to hate on it just because it's clean.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-29", "description": "Bartender was really nice. Made good drinks. \n\nI think my loud friend scared her. He was REALLY loud. Its not Au Bodhran, but no place is. I like darker bars. This bar is almost sterile looking. There is no vibe or atmosphere at all. Its like a blank slate waiting to made into something. I'm a dive bar kind of girl, so as nice as it is, I don't see hanging out in there if there is no food.\n\nI like what they did with the windows.", "author": "Marz W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-05", "description": "What the hell did they do? These geniuses managed to take a 'real' looking Irish bar, An Bodhrain, and turn it into a 'faux' Irish bar. They took a place that had a great Irish dingy-ness about it and essentially turned it into a Bennigan's.\n\nThey drywalled over exposed brick and wood and replaced it with framed pictures of Ireland! \n\nAbsolutely pathetic and sad....", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-18", "description": "I almost had to turn my back on this place b/c I received a poorly poured Guinness. I mean the shit was like a third head. And I like head but not THAT much! Especially when it comes to my Guinness. SO I had the resident Irishmen at the time fetch me another b/c they would never mess up his. The second go round I received a JEWEL! For that alone Danny Coyle's gets 5 stars. \n\nAnd 5 extra stars for playing cuts last night! I don't know who the DJ was but he was knockin!\n\nDIsclaimer: I was later told that they hired extra folks for St. Patrick's Day which is why my pour was atrocious. Damn newbie effed up my drank!", "author": "Brittany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-17", "description": "It was the World Series. Every San Franciscan was at home or crammed into a sports bar, pub, restaurant watching the Giants play. My cousin and I were looking for a spot to watch the Sacramento Kings game. I spent an hour calling almost every sports bar in the city and was told the same thing -- \"no way, not tonight, we'll be playing the Giants game on every screen\". It was looking hopeless until I called Danny's. \nMy fellow Yelpers, not only did the very sweet bartender on the phone agree to play the Kings game on one of their screens for the only two people in the extremely crowded pub that were going to watch it, but upon arrival, we were treated like VIP's! They reserved their cozy back lounge area with couches and a screen just for us, let us bring food in, helped us set up the game on the TV, all with cool, calm and kindness while their place was packed to the brim and ear-splittingly loud. \nI'm not a big pub/bar goer, but when I needed one most, Danny Coyles showed up 100%. Three cheers for genuine hospitality. We're going back tonight.", "author": "Ophir B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-14", "description": "I enjoyed the experience at this bar immensely.  On the whole, the drinks were reasonably priced, the bartender was extremely attentive, and the place is immaculately clean.  I learned from the bartender at the bar takes its name from the owner's father, which, to me greatly adds to the charm of an already charming bar. \n\nWhat I did like about this place is the classiness of its clientele.Now, mind you, I was here in the middle of the week at night. But what I saw was an interesting cross-section of locals from all walks of life, just being really friendly.\n\nI look forward to coming back very soon.", "author": "Jaime R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-31", "description": "I stumbled upon Danny Coyle's when looking for a place for my husband, an avid Spurs fan, and I to watch his beloved Tottenham play while we vacationed in San Francisco.  We arrived in town on Tuesday, game day, and not only watched the game there, but returned later that evening AND at least once every other day we were in town.  In fact, I couldn't even tell you our hotel's address, but I can get a cabbie to Danny Coyle's!\n\nIn no apparent order, here's what I/we liked about Danny Coyle's:\n\n*The smell!  Weird, huh?  Generally, bar reviews mention that ever presence combination frat basement and industrial cleanser smell, but both my husband and I noticed, and commented on, the subtle cedar scent present in the bar.\n\n*The people.  This is what makes a bar, in my world, and both the patrons and the staff were super friendly and welcoming. It was an awesome place to watch Premier League games, with fans of many teams being represented.  We interacted with three different barkeeps and all were just what you want in a barkeep:  friendly, witty, attentive, and knowledgeable.  Brian, the owner, was fantastic, as well!\n\n*TV's are appropriately placed for easy viewing, no matter where you are in the bar, w/out having a chain sports bar-esque feeling.  \n\n*Restrooms were clean and well appointed.\n\n*Location: lots of other great beer bars nearby, as well as tons of food options (which you can feel free to bring to Danny Coyle's to enjoy while you watch the game).\n\nThe only *slight* downside for me is the beer selection isn't my pint o' hops.  I thoroughly enjoyed Speakeasy's Big Daddy IPA while we were there, but I'm not sure what I'd have ordered if it had kicked (as you'd imagine, the beers are mostly Irish, w/a few mass produced standards and I think the only other pale was Sierra Nevada).\n\n(Please note all of our time spent at Danny Coyle's was late morning/early afternoon.)", "author": "Summer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "Came here to watch a Euro Cup match. I came a little late so I was standing in the doorway. Should there have been an earthquake, I was hands down in the best spot but now my neck hurts from leaning in to watch the game. It's not dingy AT ALL as I had imagined it to be and the bathrooms are CLEAN. Even the men's! They pour Guinness well which is something I'd automatically expect from an Irish pub. There's a nice little area in the back with couches and such which I discovered after the game. \n\nThey're dog friendly which is good for my friend's dog that enjoys licking the spilled beer off tables. \n\nIt's nothing spectacular but the atmosphere was fun because everyone was really into the game. I have no idea what it's like on a regular day or at night even since the games are at noon.", "author": "Janelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "I like to call this place Danny O'Danny's.  Why, because it's funny.\r\n\r\nAs for the bar, it's a good place to drink.  One of the owners is Brian from Martin Mack's.  If that doesn't mean anything to you, well, Brian is a great barman.  He makes people comfortable, serves great drinks, and occasionally drops a freebee on the barflys.  \r\nThe place has been extensively remodeled, which isn't necessarily a bad thing.  Those purists that liked the old place can find a new shithole I suppose.  \r\nDanny Coyle's is a clean well lighted place to drink.  Don't go there, cause I want a seat at the bar when I get there.", "author": "Nelson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "If you're a bay area Charger fan like myself this is the place to be to watch the games and hang with fellow Charger lovers!", "author": "Rochelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "Chapel Hill ex-pats:\nThey serve Miller Light in He's Not Here bazillion ounce blue cups. \nAnd they will cheer as the Heels trounce Dook.\nEnough said.", "author": "Chava K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-24", "description": "So, I would expect Irish Pub + Lower Haight = divey (especially if they do Pub Quiz).  Surprisingly, though, Danny Coyle's is quite bright and polished inside, though the bartender is so authentic he might make you think you're in the village pub somewhere in the Irish countryside.\n\nAs for Pub Quiz itself:  when I say the British MC is better, I mean it!  The British guy has charisma and runs the quiz like clockwork, whereas the guy at Danny Coyle's got started late and was reaaaaaal slow, so it wound up dragging on till 11:30.  Plus, he was a bit boring, perhaps the reason why this was definitely the least crowded pub quiz I've been to yet.  Lots of teams dropping out early or starting late.  And yet we still only got second place.  Damn!\n\nOverall: good pub, but not the best pub quiz.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "When I first moved out here to San Francisco, or America in general, I thought I would have to give up watching the EPL games, the Champions League games, the FA Cup games etc. Not until a friend of mine told me about Danny Coyle's. It truly is a great bar. Great atmosphere, lots of televisions mounted and a big projector screen. The place overall is very clean, probably the cleanest bar I have been in. Bartenders are awesome and always friendly. Long live Danny Coyle's!", "author": "Jon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-12", "description": "UPDATE:  8.22.06  Have been back a couple times.  DC's has the cleanest bathrooms which is nice.  Jukebox could use some work but that will happen.  They make a great margarita and that's important!\r\n\r\nI was not at the Yelp happy hour however, I just went over to DC's to meet a friend for a little bit.  Actually, I didn't even drink a beer.  I just sat at the end of the bar looking at my cute friend, catching up, and being completely content.  \r\n\r\nI could for sure go back to Danny Coyles and waste an afternoon.  The owner actually stopped to chat and was very nice.  Yeah, this bar is a bit clean for a pub but give it another World Cup season and the place will be beat up just right or actually, maybe a few more yelp happy hours?!\r\n\r\nRock on DC's!", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-30", "description": "Great little bar with an awesome selection of drinks. Don't really remember much from my visit as it was the third stop on a tour de bars with my friends, but \n\nFriday night: good crowd, fun music, cute girls\nMonday: Trivia, cheep beer, we got 3rd place.\n\nI'd return for sure.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "After being very excited to finally find a Chargers bar in San Francisco for the playoffs, I made my way to the bar at the start f the game. There was wall to wall people, almost unable to move, but OK, it's playoffs, I expected that.  And they played the \"San Diego SuperChargers\" song!! After muscling my way to the bar, I stole a bar seat where there were 3 bartenders for the whole bar. The service was quite prompt for how busy it was, I didn't wait long for a decently priced drink at all. Despite the large crowd, there was never a line for the bathroom. \n\nThe only reason I am giving 4 stars and not 5 is there was one bartender who was very obnoxious. He was wearing a Radiers t-shirt and talking lots of smack to all the patrons there. I understand that he may be a Raiders fan, and dislike the Chargers, but you work at a CHARGERS BAR!! My only regret was giving this douche bag a big tip before I heard him run his mouth. This guy alone would make me not want to go there again. He sat down every 5 minutes to eat, leaving only 2 bartenders busting their ass, while being rude the whole time. For this reason alone, I would avoid this bar, or at least that employee. It was appalling.\n\nOther than that one person, the experience there was good. Good crowd, fast drinks, and Chargers fans!!", "author": "krista z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-23", "description": "Buy out the An Bohdran, chase out the sessions, do your level best to Americanize a product that really did not need changing and double your beer prices.\n\nA suggestion to make some more money- have a little table where patrons can take out a second mortgage to make the bar tab.\n\nOh, they do have clean bathrooms.  Very, very, very clean bathrooms.", "author": "Cheezy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-14", "description": "Yeah 5 Star, and why are there so many damn Elite 08 people coming hear and shi-shi-ing on this place.  Poo on you\n\nOkay, I'll give you some people here can be total wankers, like the ass who decided to push his stool backwards  (while he mumbled in drunk talk about me being to close to him)  not allowing me to get near the bar to order my drink.  Hey fuck face go smoke another cigarette so I can get my drink.\n\nTrivia night, awesome....until that damn competition started, who knew there was so many damn Jeopardy champs in this town, go away and solve world hunger, or the green issues....let the dumb people play again.  98% of the population has an IQ under 130, let them have there fun.\n\nAnd to the Bar Tender that keeps carding me, learn you damn locals, I have been coming here over a year, every damn Thursday, and I know you don't work often but damn, really, a whole year and you still think that I am under 21 this whole time.  I even point out this fact to you every time you card me.\n\nBut why 5 you ask at this point because I am pointing out all the bad.  Brian(owner) sponsors soccer teams, he hosts great events, especially for Football(yes Soccer).  And last St. Patty's Day my best friend and I fixed there electrical problems with 150 people drinking in there, this kind of heroism leads to free drinks.  As does tipping the wonderful Bartender.  Being nice gets you nice things.  Remember this.\nAlso, one of the guys that worked there recognized our BYOBW symbol.  Kudo's to the hip and Knowledgeable staff.\n\nI think everyone would give more 5 stars if they were 5 star customers. bitches.\n\nNow for the recent reviews:\n-Andy F. don't dock stars because of your inability and lack of social skills at a sports bar, your problem not theirs.  You lose two stars.\n-Christopher S.  thank you for acknowledging that places have off nights, I recommend you go again, not on a weekend, and enjoy the place.  Come during a Football game(soccer game) and enjoy this place for what it really has to offer.  You will find yourself into the games even if you don't know who is what is going on.\n\n-Alissa d.  thank you for wasting time and stars, reserve them for real reviews with actual stories.\n\n-Jaime L, bewbz does not always = free drinks, however, I may reconsider this if you stumble in on Thursday night when our soccer team is there.  I will have a tab running.  But lay off people who might be training, and leave the PMS in the bathroom.", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "Although not officially a Chargers bar, it appears that all of the San Diegans currently in the Bay have an understanding to congregate here.\n\nA lot of great energy for games if you're a fan. If you're not into football, and I mean AT ALL, don't come here during game time. It gets crazy packed and crazy hot. During halftime, I couldn't stop thinking about how I would like to take a nice shower.", "author": "Joel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "Absolutely hands down the best place I've been (in sf) to have a beer! Brian was very friendly as was all his staff who served us throughout our many stops here this week.  English premier league games on, as well as real deal supporters enjoying the games. Only downfall was no food, but as others have reported there are some good spots nearby to grab a bite to eat and bring it into the bar. COYS!!!!", "author": "Cory K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-23", "description": "Wow, how did I forget to write about this place after my very first Yelp event?\r\n\r\nThere's nothing to dislike about Danny Coyle's.  It's a beautiful bar, with a lot of friendly faces, great service, nearby restaurants for involuntary food timeouts, and a solid happy hour.\r\n\r\nThe \"upper level\" (a whole two steps up) provides a great area for larger groups to socialize and relax.  If I could assign any more stars for the comfortable seating, I would.\r\n\r\nDanny Coyle's makes me want to move to Lower Haight.  I don't care if it's just an easy trip on the 22 from where I live, that's not good enough damnit!", "author": "Adam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "I love a good jack and coke\nThey make the most delicious jack and cokes!!\nGreat place to sit and talk with friends\nNice atmosphere (candles and mood lighting)\nThe best thing about Danny Coyle's is that it's CLEAN!!!  I am not afraid to go into their bathroom for fear of no toilet paper or puke on the floor.  I give a star just for having soap!", "author": "Jordan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-15", "description": "Super hetero place. Some douchey guys watching the NCAA game (this was back in March). We came here for Trivia Night, and it was our first and last times here. He quiz master was super annoying and the grunting basketball fans got on everyone's nerves.\n\nBartender was nice though. He brought out a dusty bottle of Patron XO (he didn't even know they had it until we asked him about it), gave us some free shots (since we were the first ones ever to order it). So that made up for it. Hard to find a table also. Grunt Grunt.", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-10", "description": "Update:  Just had a party there a couple weekends ago.  They really took care of us & everyone had a blast!\n\nIt's like your favorite neighborhood bar in location newly remodeled & clean!", "author": "laura g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "Recently opened (remodled), the bar is clean and crisp -- especially their marbled spacious bathrooms.  The place is very presentable with an inviting attitude that lets you bring your coworkers (not just your Irish friends) along for a drink or seven. There's plenty of space to sit and stand, whether it's at the bar, at the tables that line the floor, near the jukebox or in the back area.  Luckily, Danny Coyle's also happens to be one of the few bars in the Haight that serve hard-hitting liquor -- and in good sized glasses with good prices.  Yay.\n\nAll in all, I really enjoy the ambiance and the senior bartender to want to come here again and again and not have to apologize for my choice in drinking establishments.", "author": "Vicky B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "My favorite bar in the area. They have nice TVs and show every sporting event imaginable. Every time I've been I've made friends with someone. The drinks are drinks and made as well as you would expect. There usually have pretty nice drink specials too. Bartenders are all really cool as well, which is nice. They also show all of the UFC events for $10, which isn't bad, considering most places charge double. Also, like everyone else has said...nice bathrooms.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-05", "description": "I don't know where you'd go to around the Haight, in a pinch, to watch big-time sports events (at least the ones important to me). This is an Irish-style pub where you'd expect heavy-metal motif should be-- but that's the Haight. The drink prices are a little stiff and pricing for big-event nights will vary. I saw a Pacquiao fight here about a year ago, and it was $20 per person, but they did cram us in despite what the fire marshall might say. There are two big screen TVs at the back of the bar and there are plenty of friendly locals and tourists there to enjoy your Guinness with.", "author": "Reyz A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-24", "description": "After going to to the Giants- A's game with my older brother. I really wanted to go to north beach bars  but my brother said Haight bars were good. We went here a lot of hot brunette chicks! i was shocked for Haight street bars. I thought it would be all weird hippies lol", "author": "Brian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-01", "description": "There are plenty of Irish bars in San Francisco, and this one's a bit off my usual path. The place has the right feel - dark and has Guiness. There were quite a few knots of people (I'm assuming each group consisted of friends, but one can never tell) around each table. My alumni group held a place in the back, and we had a good time until we got hungry. Coyle's does not serve food, but allows food to be brought in; the size of the group, however, militated against .ease of sharing, so we headed to Axum Cafe up the street.", "author": "Marcus M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-02", "description": "I used to come here all the time to watch football.  Then I had enough.  It is stupid to have one girl working on a Sunday when you have that big of a crowd for football.\n\nReally, one bartender and a buser. Get it together, get some food and change up the seating. Oh and don't let so many Cowboys fans in, they get loud and lippy.  It's just asking for a riot to break out.", "author": "Jackson D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-04", "description": "Mellow joint and unlike many of the other bars in the neighborhood has a full liquor license.  Was with some friends who wanted scotch and we hit several bars that only had beer before finally finding the promised land - Danny Coyle's.\n\nCool bartender.  They have a digital jukebox.  People were dancing, including us.  Overall quite chill, not a scene.  Seems like a neighborhood kinda place.", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "This is by far one of my favorite bars in the city. It is super chill and they have Carlsberg on tap which is what keeps me coming back time after time.  The bartenders are super friendly and attentive. My boyfriend and I love coming here to grab a beer after work. The weekends are fun as well but what I love most is that no matter how busy they are, you can always find a place to sit or a table to stand around with your friends. They also have this comedy night which is pretty cool and you can bring in your pizza from down the street or your dog.  :)", "author": "Monica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-21", "description": "What is so appealing about a sterile Irish pub? Sure, it's clean but where is the authenticity? Slapping an Irish name on an otherwise generic space in which to consume alcohol (hotel lobby, perhaps?) does not an Irish pub make. \n\nI just moved into the lower Haight neighborhood so I thought I'd check out the local bar, stumbled in at the tail end of trivia night - wow, those are some tough questions. I didn't care too much for the overall scene. \n\nOne star for the jukebox. \n\nOne star for $2.50 Miller Lite that, for some reason, tasted like french fries to me that night.", "author": "Angela N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-30", "description": "I have mixed feelings about Danny Coyle's.  I love their pub quiz night--the crowd is usually pretty cool on Wednesdays.  Other days of the week?  Not so much.  \n\nThe staff varies from great to downright incompetent and snooty to freakin' awesome.\n\nSo while I'll continue the pub quiz, you won't find me coming back on any other nights.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-07", "description": "Here's something great about Danny Coyle's:  They keep their obligatory, framed photos of the \"old country\" way in the back, upstairs, further afield than the bathrooms.  \n\nIt's about as pleasant and unpretentious a place as you'd want to drink in.  Decent mixed drinks, a few beers on tap, friendly bartenders, and a huge, cuddly dog that plonks down in the least convenient spot on the floor. They have a jukebox which I still haven't figured out.   When you're tired of getting sneered at by the Toronado's beer wench (she's a review waiting to be written), out of cash from Mad Dog in the Fog, and don't have the energy for Molotov's, Danny Coyle's is the place for you.  What's not to like?         This isn't the best bar in the city by a long shot, but a reliable neighborhood standby.", "author": "Phil K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-12", "description": "This place definitely deserves bonus points for the free round for the Yelp crew, but an Irish Pub needs to serve more Irish beer (no Guinness or Murphy's :-O) and it should smell musty and stale, it should be dark, with lots of cheesy paintings, pictures of people from years past, and mirrors with beer logos on them.\n\nPositives: area in the back is great for lounging with a large group, happy hour pints are $3.50, the bartenders really are as cool as everyone says, the bathrooms are clean and can fit more than one person (definitely an improvement over the traditional Irish Pub, I'm not a complete purist).\n\nBottom line: give it time to accumulate some grime and it will feel just fine.", "author": "David V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-13", "description": "Went here for the first time yesterday.\n\nDanny Coyle's feels amazingly out of place in the Haight, but it's a nice bar...almost too nice (cue \"The Who\" music)\n\nSeriously, this place is very clean, warm and cozy.  It's a nice little bar, like Martin Mack's better-looking younger sister - the one that gets really good grades, looks great, but probably won't sleep with you.\n\nI tried, but I couldn't hate it.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Fun bar with decent drinks specials. Only advice is that the crowd is very into sports and may get a bit intense with the cheering. But if they are rooting for your favorite team then by all means it is definitely the place to be!", "author": "Jose B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-20", "description": "Danny Coyle's is usually the place I go when I'm in the lower Haight and want to relax with some friends and a beer or two.  Toronado's is always too crowded, and the Mad Dog in the Fog is too scummy.  I'll stop in for bar trivia from time to time, and my wife was nearly stabbed by a homeless lady right outside.  She quickly made her way into Coyle's to ease her stress with a pint.\n\nHowever, we walked in last Friday and the whole bar turned to look at us - not in an LA-is-it-a-star-kind of way, but in a what-the-f-are-you-doing-here kind of way.  People at the bar stared, pointed, acted like asses.  Including the people behind the bar.  \n\nWe're not hipsters, yuppies, fancy-pantses, or, in fact, young.  After living in Boston for 6 years, we generally just like Irish bars.  And, usually, we like this one.\n\nMessage - don't come here on a Friday unless you already come here on a Friday.", "author": "Pete G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "Came here with a friend to watch the Chargers play... Good crowd, quick service at the bar, and decent price on beer. Gets crowded but an open back door gives the room a nice breeze. Nice bathrooms, and didn't take too long to find close parking. Yay for Dannys!", "author": "Cori C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-24", "description": "The other reviewers are right - the bathrooms are really amazing! But, that's not the only thing to say about this bar. It's a super chill place to hang out on the weekends in the afternoon. They make good drinks, let you bring in food, and the people are cool. Plus, Danny Coyle is a sponsor for my soccer team - so they're awesome for that!\n\nThey let me bring in my dog (there are often other dogs there, too), which is cool. Although, at some point in the evening they turn up the music - Charlie doesn't like that very much.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-08", "description": "I've spent many a night here getting trashed.  There's nothing really special about this bar, however, except for the fact that it's close to my house.  No pool tables, beer is on the expensive side, and not particularly comfortable seating.  There is a back patio that they don't let you use.  There are TV's that will usually have some sporting event on, although American sports are often preempted for soccer.  They do have friendly bartenders.  They do serve liquor though, which is a plus.\n\nAlso, as many before me have noted, their bathrooms are always pristine and the door can be locked behind you, should you be doing something that necessitates a locked door. . . \n\nI miss An Bodhran.  They had a dart board.", "author": "matt c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "As my neighborhood bar, Danny Coyle's certainly fits the bill for comfort, style and great drinks. They have Carlsberg on tap (+), great service and always have a game on. I have sat in on their trivia nights which are fun also!", "author": "Alissa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-17", "description": "I want to like this bar because it's in my immediate hood, but I pretty much don't. \nThe have a sign out front that says \"killer bloody marys\". Their bloody marys are really terrible. Go to Zeigeist for a real bloody, yoho. \nThe only thing Irish about it is the name. \nNo atmosphere, no character, nothing. Booo.", "author": "Mort B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-15", "description": "I came here once, early on a weeknight, when they were doing trivia and cheap margaritas, and left feeling pretty positive. Seemed like a chill, laid-back neighborhood pub type of place.\n\nThen this weekend I went late on a Saturday night and the place had morphed into some weird club with lights and booty-shaking stupid music. \n\nNot sure yet what to make of this spot. I like my Irish pubs consistently relaxed, with a buy two get one free policy.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-24", "description": "Nice place to get a beer in the lower Haight.  As a rule, I prefer my pubs a little darker and grittier with dim lighting (resisting...urge...to....compare....to...An Bodhran....), but the bartenders are kind and the big windows in front allow a nice refreshing breeze to waft in.  \r\n\r\nI was served a well-poured Black & Tan, which passes the pub test for me, and only $4 at Happy Hour, which passes the drinking funds test for me.\r\n\r\nI could NOT remember the name of this place so all day I was calling it \"Rusty Spoon\" in my mind, which I am now trademarking (\"Rusty Spoon\" tm Liz S.) as the name of the darker, grittier bar that I may open one day.  Yar.\r\n\r\nMeanwhile, if you are looking for a clean, decent place to have a beer or margarita on a lazy day or after work, check out Danny Coyle's for its friendly atmosphere and reasonable prices.\r\n\r\nThanks, megan j., for the introduction, and to you other fine Yelpers, cheers & hope to see you there again soon.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "Spacious Irish sports bar on East Haight, everyone is very friendly and beers for a good price.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-05", "description": "After hitting Duboce Park Cafe for lunch I headed here with Bunny for what we call Mojito Monday Madness. The place wasn't quite packed yet and we had the pleasure of sitting in the backyard drinking a cider (me) and a Mojito (Bunny) enjoying the afternoon sun. The bartender was quite friendly and invited us back for their 1yr anniversary which is this coming Saturday. Overall price for drinks was reasonable and the patrons were friendly and even offered to share their sampling of pomegranate margaritas. Needless to say after 2 ciders for me and 2 Mojitos for Bunny we headed to Nickie's for a bite.  \n\nGreat service with friendly staff and patrons makes for one good afternoon of camping out in the Lower Haight (See Bunny is a ture Lowerhaighter...and am just an impostor from SOMA).", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-22", "description": "DC's is effin sweet.  Good deals on drinks, TVs everywhere and good parties.  Plus they host the Baracus Rugby Team!\nand the bartender (Tanya on Thursdays) is great", "author": "Spencer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-07", "description": "What do you expect, It's a Irish sports bar. Good TVs and at least they have pitchers and a few beer specials on trivia night ;)", "author": "Minh V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-22", "description": "Went here on St. Pattys and it was super packed at 6pm, which is by no means surprising. However, it took way too long to get a drink, I quite possibly waited over 20 minutes to get 1Guiness! It was also super hot inside, which is also something I've noticed every time I come here. So why do I keep coming back? It's simple, easy to get to, and chill. On a normal night, it's a good place for conversation, however like I said wearing less clothing is preferable since it gets so hot.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "If you're looking for a great place to watch a soccer game, this is your place. They open very early for games on the weekends. Good beer, great crowd and you can bring food in with you! Good times!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "Came here for trivia night last Wednesday after the Giants parade. I had a really nice time here. They have lots of TV's for watching various games. The bartenders were friendly. Only thing was their beer selection was okay...only one IPA? I guess it's hard to be across the street from Tornado.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-14", "description": "When I first moved into the lower haight I was stoked to be so close to Rosamunde, Toronado, Thep Phenom, Cafe Soliel, et al.  An Bodhran was included in the high stoked factor.  When seeing it close I was very dubious indeed of the new development.\n\nSide note:  Funny that I see bar availability as an amenity to a neighborhood.  I'd be a horrible realtor.\n\nWell, after a trip to Martin Macks on some hazy night that left me without my favorite jacket, of which I had to retrieve the next day, I got to speaking to the bartender, while partaking in the hair of the dog, I learned about the plan of DC.  I'd give it a shot...they returned my jacket.  Well, that and I can see it from my window making it definitly stumble distance from my bed...or any other flat surface in my house.  So, in other words...I was going to check it out anyway but the jacket return made me feel like a trip was deserved.\n\nInterior:  Not as charming as the old place but damn clean and accessable.  This is so nice when meeting a group of friends.  The bathroom is always nice.  The bar is always clean.  The lighting is OK and the TVs are doable as well.  I know that DC wants to rival Mad Dog a little re football games so I understand...plus I love sports so no real complaints.\n\nThey take CCs.\n\nStaff:  Brian is top notch.  My girl can vouch for the other bartenders as well.  They are all very friendly and make it a point to get to know their customers.  Again, another shoutout to Brian.  He pours himself into DC and you can tell.  There has never been a time when he hasn't made me feel like and old friend returnng back to the bar.  \n\nI agree w/ a comment earlier about gentrification.  As a Planner myself I know the pitfalls of certain redevelopment and resettlement patterns but when done right, also allowing for market forces, a mutually beneficial path will emerge.  DC is an example.  Yes the lower haight has a steeped history of being passed over for more trendy neighborhoods...thank god for that.  However, if things never change it leads to stagnant neighborhoods.  A measured amount of new blood and new approaches can retain old values but add vigor to accomplish the overall goal.  I am glad to see DC do well.  To those that don't go because they want to keep lower haight the way it used to be are missing out.  DC will be around for awhile and I'd like to welcome Brian and crew to the lower haight...and by the looks of things (i.e. business) you guys are doing very well.\n\nCheers", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-16", "description": "I head here after a long night at work to have a quick drink at the bar. The bartender Brian is perfect with his service. I always find a seat, and the noise and crowd are never too obnoxious. I can actually have a real conversation with my friends and not have to shout over anyone. This bar is super refreshing for me, as there are WAY too many drunken 21 year old hipsters in front of all the other local bars to keep me coming here.", "author": "Jena D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-01", "description": "Pretty typical Irish pub.  They pour a good Guinness, they've got a good selection of whiskey.  They're apparently known for blackberry mojitos, which strikes me as odd given that it's an Irish pub, but I didn't try them so couldn't tell you how they are.  There are a lot of TVs, so sometimes it can feel more like a sports bar than a pub.  They're dog-friendly, which is fun.  There's also a fairly secluded space in back with some bench/couch things that's above and away from the noisy floor of the bar which is nice if you've got a small-ish group and want some space to chill.\n\nBasically, there's nothing to particularly recommend it, but nothing to particularly recommend against it either.", "author": "Don H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-02", "description": "Oh Nish--I felt bad about signing onto Yelp and giving this place 3 stars...then I saw your review and agreed completely with your 3 stars and your assessment.  Thank god for Nish.  \nThis totally isn't a bad bar.  It's even better than decent.  But for some reason it just can't jump above 3 for me.  Why?  Read Nish's review.  He's right on.  And I miss An Bodhran too.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-22", "description": "I really must stop drinking on Mondays!  I came here on Monday with a friend and had a great time just hanging out and talking.  Granted, since it was Monday, the place was empty.  But I really liked the venue! As others have written, it was really nice and clean!  I liked how there were a bunch of TVs with sports games on. \n\nI'm not sure how this place is when it's poppin, but I'd definitely come back to check it out then.", "author": "James C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-16", "description": "I heart this bar. They let me bring my dog, Molly. \nI will be back, OFTEN!!!", "author": "Erin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "This is kind of our go-to place for trivia.  The MC is fun (his music round is hard as hell though), the drinks are reasonable, and they allow outside food (hello sausages/bbq/ethiopian food).  I don't know when or if they still do this, but a few times we came early...around 7pm or so, and they gave out free chips + salsa.  Just, you know, something to think about.", "author": "jon y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "Yep, the specter of a clean bar in the lower Haight is something to behold. In fact, that's the reason I went there. Sometimes you just don't want the energy sucked out of you.\n\nI had heard that their bloody marys were good. Not so. I asked for extra horseradish, thinking that was the most polite way of getting more bang for my buck, but it did little.\n\nThey were advertising their hot toddies. Perhaps those are better. Or other drinks.\n\nRugby was on the television and there was a healthy population of Irish lads there. And there were dogs present, which I consider a near panacea for anything bad in a bar.\n\nDanny, I'll give you another try to find your greatness.", "author": "Blake E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "When the DC first opened, it quickly became my regular local, specifically because of the great Magners on tap, and the low key, chill atmosphere it provided. The fact that is is right across the street from my house didn't hurt either.\nBut as time was waning, I came to find all these marina-esque-wanna-be-urbanites coming into the neighborhood and bringing with them lousy music that pulses into the wee morning hours, as the drunk said wannabes walk up the hill to divis, gaggleing all the way,  to catch a cab back to their own hood. \nOther than that, Steven is the best bartender in the world! I do like going on Sunday-Wed nights when it is not so busy you can get thru the door and the hip hop, bass thumpin music has been turned down a few notches.  Locals stay away on weekends....\nBring back the Magners on Draft!!!", "author": "Sara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-22", "description": "I've been coming here to play trivia recently and it's actually a pretty nice looking bar.  They  must of did a remodel recently because really has that look. If you're into bars with that real divey feel, then don't come here.  The bathrooms are ridiculously clean unlike 98% of all other bars.  It's so clean, I wouldn't feel so bad if I had to drop a yule log here.\n\nAnyways, the bartenders are usually pretty quick and the drink prices are about average.  I can only comment on trivia night (wed) but it gets pretty packed and sometimes we have a hard time finding a seat.  Anyways, I guess it doesn't matter when you win first place hahaha.  Ok we don't win first place every week but I think we do ok.\n\nParking around here isn't the best but I tend to be able to find something in a reasonable time frame. (5-10 min of circling).  That's one of the negatives of the location.\n\nI can't comment on the place on the weekend because I never come here on the weekend so come here and let me know how it goes.", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "The area is a little scary, but trivia nights are pretty fun.  That is....even if i don't know any of the answers!  I guess all the regulars here are pretty smart, that, or they study their butts off for wednesday nights to compete at a bar.  \n\nReally chill environment and mgd for 2.50!  I would like to go back or try other places for these trivia nights with a bunch of friends.  there's a great burrito place down the street, but I don't recommend walking alone at night.  \n-j", "author": "Janice's A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "After stuffing my face at a barbecue restaurant down the street, my friend and I find ourselves basking in the sun on Haight, and as we walk past Danny Coyle's we see a few girls hanging on the windowsill like cats. We stop in for a pint.\n\nIf you're going to drink during the day, this is the place to do it. Irish accents everywhere, spitting drunk friendly rantings from the locals on any subject ranging from the sad state of Ireland's representation in the Olympics to the best bar snack on the planet. Don't bother the bartender with your girlie cocktail drinks, it's annoying to her and the rest of us who just want another round of pints for the crew. This is a bare-bones Irish bar in San Francisco, and it will be remembered. If only it had a pool table.\n\nThe girls were very entertaining and within a few hours we all stumbled off together to begin the evening's activities, which thanks to our stint at Danny Coyle's will not be recorded in the Yelp chronicles as they are not easily recovered from memory.", "author": "Ben W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "I knew this was my kind of place when I bellied up to the bar only to find a dog on the bar stool!   I couldn't believe it when we stopped by on a nice afternoon (drawn by the the fact that they open the front windows to the street) and the bartenders let me bring my sweet (but not always perfectly behaved) yellow lab Motley in the bar with me.  We had a few beers, enjoyed the great weather, and watched the street traffic mozy by on Haight.  Anyplace my boyfriend, our dog, and I can all go grab a beer together gets my stamp of approval!", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "Danny Coyles is a simple sports bar but it does what it does very very well.  Great place to watch a game (flat screen tvs all over the place) or just get drinks with friends.  They'll also let you bring food in from surrouning establishments which is always a plus.\n\nI would definitely recommend DC as a place to watch a game or just to get drinks (Bloody Mary is pretty good).  One reviewer sad 'bar most likely to take my mother to' and I completely agree!  I mean this in the best way possible - my mother's a cool chick.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-19", "description": "Went here on Weds night for Trivia, got stuck next to a trio of loud mouth drunks doing shots, which is no biggie, but when they let there dog drink from a glass of water at the bar right in front of the bar tender, then thats not cool. The place had about six other dogs inside,  two that were large breeds, one of which was let off lease to wander the bar, sniff crotches and be a nuisance to other patrons. This is just a new level of ridiculousness with people and their pooches. My wife just did not appreciate being sniffed up and come on to by yet another dirty dog.", "author": "Bill K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-10", "description": "I am giving 4 stars for having big open windows that let all the awesome sunshine and fresh air in.  It helps me feel less guilty about drinking indoors on a beautiful day.  I'm holding off on the 5th star becuase I havent tasted any of their mixed drinks, just beer...\n\nSeriously though, I am sorta ok with global warming if it causes this beautiful weather.\n\nDid I mention I like the weather lately? And drinking when the weather is beautiful?", "author": "b s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-02", "description": "Danny Coyles is one of the best bars in the city, period. A great mix of people, probably 50% Irish, and the others locals in the neighborhood. Also several dogs were there the few times I went in, so bring your dog for a walk in Duboce park, work up a thirst, and then stop by DC's afterwards. \nBrian the bartender and owner is one of the best in the business. Consumate pro, and all round nice guy...", "author": "Dave O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "This place has gone through a lot of iterations in the years, with my favorite name: Don's Different Ducks.\n\nBut now, as Danny Coyle's still Irish, since the previous incarnation, the bar was rebuilt to an incredibly day-friendly place to sit and sip on bloody marys, beer, whiskey, what have you.  It is easily one of the most pleasant places to spend the early part of a Sunday afternoon with its open window front. And the owner is an extraordinarily nice guy, who takes great pride in his establishment.\n\nI've not been in here at night yet, but it's high on my list of places to drink in the daytime.", "author": "Kennelco C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-16", "description": "This is such a cool and fun bar that my friends and I tabbed Danny Coyle's as \"Danny Goodtimes\". I love this place. It is clean, people are friendly, the bartenders and very nice and professional, and the flat screen tv's are awesome. They have NBA League Pass, Euro football, American football, you name it, they got it. I love this place even more because everytime I am in there the bartender always gets a drink for me and my crew (oh, your tip is rising, sweetie!!).  I don't know what you would call this: An Irish Pub, a sports bar, local joint, weekend scene? It kind of is all these into one. For a quasi sports bar to have a decent number of good looking women and for them to have a solid female to male ratio is an extra plus. I love this place.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-07", "description": "Solid place. Good sports spot, particularly international sports.  I'll certainly be here for the World Cup next summer, as the many ex-pats here (I know, actual Irishmen in an Irish bar!) will add a nice fanatical edge to things.  Drinks are pretty reasonable, and they let me watch the Red Sox here pretty much whenever I want.  Hard for this transplanted New Englander to complain after that.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "A sports bar with very good bloody mary's. Open space and not too cramped.", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "I've changed my mind about this bar.  Stopped in for a few pints last night and had a pretty good time.  Bartender was great, beer was cold, and the crowd was chill.  The jukebox selection was a little too pop for my taste, but I'd be more than happy to swing by again soon for another pint.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "Danny Coyle's defines what a great neighborhood bar should be. It is authentically Irish, with a professionally but completely down to earth staff, and a hilarious litany of regulars. I can think of few places I would rather watch the Giants game. There are plenty of TVs and the sight lines are great. On the weeknights the bar is often busy, but rarely crowded so you'll be able to watch the game and be amused by some surprisingly drunk/friendly Irish fellow just off work with the moving company. Recognize that you're in for a much more crazy viewing experience if you try to attend any major European football matches (or even NFL football when it can get quite crowded,) but for baseball or a quick pint on the Haight, DCs is always my first choice.", "author": "David N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-27", "description": "This place might yet become cool, but right now, it just isn't yet.  First of all the drinks are too expensive for the neighborhood - if I want to pay $5 for a pint of beer, I'll drink downtown.  Second, it can't seem to decide whether it wants to be a chill lounge (ala Amber) or an upscale sports bar, and as a result, is unsatisfying as either.  I was there recently at happy hour, and thought that if they had been playing Marilyn Monroe movies (or whatever) instead of ESPN news on the big LCD tvs, the vibe would've been much nicer.  It's brand new, though, so maybe they'll get their act together still.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-14", "description": "now i love dive bars as much as the next person, but damn it, toronado bartenders, you better be nice to me next time or i'll take my rosamunde sausage and my business over to the nice bartenders at danny coyle's. damn! this bar is really clean and it's in lower haight. an oxymoron? i think not. obviously, the gentrification of lower haight is further along than i thought. yeah, you can preach me about the downside of the gentrification. blah, blah, blah... however, sometimes all i want is good beer, a squeaky clean space that doesn't smell like barf and squeaky clean bathrooms without bodily fluids all over the floor. as matter of fact, the bathrooms at danny coyle's are so damn clean that i might even bring my girlfriend and have sex. how's that for an endorsement? \n\n* ok, the sex part was to emphasize how clean the bathrooms were.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "Trivia nights are great, I've never noticed any douchey guys there, and the bartenders are always fast, professional, and nice - plus, they know how to pour a drink without skimping on the liquor! Not too pricey, and very comfortable. Plus, this is on one of the quieter blocks in the lower haight - the next block down (Molotovs, etc.) gets sketchy and loud.", "author": "Dustin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-03", "description": "It's a solid Irish Pub. Not cheap, not overpriced and has a great atmosphere. Great place to watch football (or football).  The bartenders are nice and the service is good. I was here for trivia night on a Wednesday and it got so hot in there I had to leave. I know usually places have to worry about staying warm, but open a window or something. Alcohol plus heat just makes for an ornery crowd.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-02", "description": "The place has no character whatsoever.  It's not a bad bar, but there is absolutely nothing that makes it superior to any other bar in any conceivable way.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-09", "description": "I miss An Bodhran.  It was dark and pubby with low ceilings, and dark wood, and dark light and also it was pubby.\nIn its place is Danny Coyle's.  A generic \"pub\" where the only thing pubby about it is the sexy accent on the bartender and the selection of beer & whisky.  The remodel is very updated, clean & fresh.  Sitting up front by the big foldy windows on a nice day is lovely.  It was pretty empty when we were there so we had our pick of seats.\nBut it's about as \"Irish pub\" as I am Mexican.  Which you know, I am, but not much.\nI'm picking on poor Danny Coyle, and maybe I'll have a change of heart once I'm fully over the loss of An Bodhran (which I went to ONCE mind you, but loved immediately and intensely) and this new \"upscaling\" of the scungy lower Haight; but on a foggy San Francisco summer day, I want a close, cozy, dark spot to sip my Bass.  Also?  The plaster needs fixing - man that's a pet peeve of mine.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-04", "description": "If you are a legit soccer fan, like legit enough that you call it football, then this place is for you. I was recently there for the Tottenham/Arsenal game. There were at least 20 fans watching the game split 50/50 for both teams. When Tottenham scored the final goal in injury time to tie the game, the spurs fans errupted. Running around, hugging, jumping, knocking over drinks, mocking arsenal fans, although I was gutted from giving away the two points it was awesome to sit through something that felt like a real english soccer experience. Drinks are a bit steep though if you like the imports, but what do you expect? it's SF", "author": "Ian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-25", "description": "Solid, all-around bar. It's especially great being a New England Patriots fan out here and knowing that I can watch my team every Sunday no matter who they're playing. Very clean, nice bartenders, good selection of drinks. It's not really amazing in any facet and nothing wows you about it, but still a great place to go.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-17", "description": "Danny Coyle's is a reliable neighborhood Irish bar where you can watch sports without an overwhelming crowd of people. $2 Miller Light bottles on Sundays during (American) football season do the trick. They don't serve food, but they invite you to bring your own in. The nearby take-out options like Burger Joint and Rosamunde make that a great idea.", "author": "Seth B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "I am a hockey fanatic.  I would LOVE to go out to watch the games more, but during playoff time I can't risk showing up at a bar that has the game on one tiny TV, sandwiched between two baseball games with no sound.  Well, I was in the neighborhood with my bf about to head home for the Habs/ Caps game when I decided to stop in.  The game was showing on one TV, no sound, just like I thought...but wait.. the bartender said he would be happy to turn the game on the huge , private TV in back and turn the sound on?!!!  Too good to be true!  I called the only other Habs fan I know in SF and put out the alert.  Soon we had a great group and although the front bar filled up with rugby shenanigans later on it didn't matter.  I am so happy to know that DCs is an option for hockey!!!!", "author": "R G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-06", "description": "I came to Danny Coyle's recently for a coworker's birthday party.  There was a group of us there, probably 7-10 people.  A lot of us are bartenders ourselves, including myself.  We were not a rowdy bunch, just looking to have a good time together.  The bar looked great, it had a very comfortable atmosphere to it.  Unfortunately, the woman behind the bar had to ruin our experience.\n    When I first arrived, I soon noticed the the bartender had a brash personality, a little 'rough around the edges'.  I watched as she helped the people next to me, and the way she communicated with them seemed to make them a little uncomfortable.  I didn't think much of it, I actually found it a bit entertaining to watch these people squirm as she did her best to give them lousy service.  \n     Pretty soon the rest of my party showed up, and we started ordering drinks.  We were all together for no more then 10 minutes when one of my friends tells the bartender a joke that he had been telling the rest of the group.  The joke had a bit of sophomoric humor to it, but nothing overly offensive.  After asking my friend to repeat the joke, the bartender starts ridiculing and snapping him, almost as if he insulted her.  I don't remember it verbatim,  but it was basically \"I'm 34 years old, why would you tell me something so stupid\", but really laying into him in a very unnecessary way.\n     After completely spitting on our good time, the rest of the group tried to collect ourselves from that incredibly awkward and unnecessary encounter. As we started to buy some more drinks.  Another friend of mine called the bartender over to buy the birthday boy a drink.  After ordering the drink, the bartender starts to criticize him for making the birthday boy pay for his own drink, which he clearly did not do.  After trying to explain to her that this wasn't the case (it was loud and it was hard to hear), we made the decision that we needed to leave this place ASAP.\n     So we left, and had a great rest of the evening at the bar down the street. \n  So, in conclusion, the bar is pretty, and seems to have a lot of potential.  Unfortunately, even with our best efforts we could not enjoy ourselves, thanks to the unpleasant woman (euphemism) behind the bar.  She told us that she is related to the owner of the bar, which is probably the only reason why she has a job.  This also tells me that she won't be leaving any time soon either!", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-03", "description": "Great pub and sports bar. Only got 4 stars bc no food. Great bloody marys as well.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-20", "description": "This bar confuses me.  I heard it used to be the Ah Bodran but now its an Irish bar, a nice Irish bar, a real Irish bar.  I like the Irish, heck I'm half Irish but this place is too nice to be in the lower haight.  I've had issues with my neighborhood gentrifying and unfortunately more places like this equals bad for me.  I do like their open windows, they have plenty of TV's, the bloody mary wasn't bad.  There isn't anything wrong with this place, my hairdresser and her crew hang out there after work but its just another example of the nice moving in, pushing out the old.  I want my old, I don't want trees lining Divis and I'm going to be pissed when the marina darlings move in and push up my rent.  Stay on your fake land down the hill.  Sorry to rant but this is serious, I want to keep the flavor of the lower haight.  Danny Coyle's will probably fit in just fine in a few years after enough wear and tear.  The place seems to be packed regularly and does show football, I mean soccer, still channeling Ireland.   If you live in the neighborhood and want a change from the usual Toronado or Mad Dog it might be worth stopping by.", "author": "Kristin Marie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-06", "description": "Hard to get a drink in there during today's soccer matches. Props for having the Argentina-Brazil match on today, but why was the English broadcast on over the P.A. speakers while the Spanish was on from the TV speakers -- couldn't hear anything!", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-12", "description": "An irish pub with comfy leather chairs and gorgeous bathrooms?  So maybe it's a little confused but I loved it anyway.  Good beer, great service.  And, once they heard we were with yelp they sent over a free round.  Now that's savvy!", "author": "Elena S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-18", "description": "I don't like it. It's not god-awful, but I can imagine so much better at this particular location. How about a place called \"The Wiggle Room\" where thirsty cyclists can have a mellow beer and then wobble away? How about some themed place, like Beauty Bar or something, where people actually dance (we need a place for people who like to dance here that's more bar than club--even though I don't dance I am thinking of the common good). How about a place to spotlight all the DJs we have in this area? I'd love to hear what my neighbors are up to with all that fancy gear.  I could come up with a lot of other ideas, but I'm too lazy to run a bar. No character, and, I can't say I love the crowd it attracts.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-29", "description": "I simply go here because the are VERY friendly, but more importantly, they play the SAN JOSE EARTHQUAKES games.\n\nGo  SJ  EARTHQUAKES  !!!", "author": "B D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-14", "description": "This was a really fun bar that had a bunch of tvs showing the football game. Lots of bears fans in tha house!!! Plus, they have hangar one lime vodka, my fave:) Good casual crowd too.", "author": "ella a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "Solid bar. Great for watching Sunday football, as they usually show all the games on their various TVs. Decent domestic and Irish beer selection. Also a nice place to hang out in the afternoon as they keep the entrance to their bar wide open so you can sit and enjoy a beer, watch a game, and still get some fresh air.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-30", "description": "No flavor in this joint. Then again, I'm biased because it replaced one of the best bars in Frisco: Don's Different Ducks. With a throwback jukebox  full of James Brown and Aretha, White Mike playing pool in the back, and neighborhood love all the way around, Don's Different Ducks represented the diversity and quirky spirit of the Bay.  Danny Coyle's, unfortunately, just seems like part of the inexplicable wave of Irish pubs popping up in the City.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-14", "description": "This place is like a little sanitized oasis in the middle of the more often grungy Lower Haight and yet it's perfectly at home.  You can tell that the place was recently remodeled.  This place is a decent size for small to medium groups wanting to enjoy some drinks.  It's not so small that you feel crowded and it's not so big as to invite a horde of people.  The service was very good and the prices were right.  They don't give out free attitude with your drinks at this place which is very refreshing.  Some places think that treating people badly is a way of giving themselves some credibility in this city, fortunatly this place has an owner who is taking a different approach and focusing on treating people right.  The only thing I can think of that could use improvement is a better selection on the jukebox.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "This is a pretty classy joint!  ha!  I was expecting more of a dive, but instead got a laidback, loungy w/out being too \"Marina\", packed place w/ a fun crowd.  Great beers on tap, kickin' '80s tunes, and a bunch of \"who gives a shizznet, I'm here to have some fun!\" rhythmically-challenged 30-year olds sweating up the dance floor!  It was a blast.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-15", "description": "how do you ruin a perfect irish pub? spruce it up. \n\nthe same guys that brought you the forgettable martin mack's took an awesome neighborhood irish dive 'an bodhran' (dark wood, cool ceiling, low lighting, musty smell of old beer) and brought in a giant vacuum to suck all the character and charm out it. \n\nand what do you replace them with...  slate tile? flatscreen tvs? wall sconce lights that fit better in a cheap ski condo? a big obnoxious mirror with a plastic sign? check, check, check, and... check.\n\nan bodhran needed new bathrooms, not a wholesale character rape. bummer to lose a great bar in the hood and be left with... this place??", "author": "Hunter H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "Being born and raised in SF, this was the first time being at this establishment. After ordering 2 rounds of 3 beers (total 6, amongst 3 people), I go up to the bar to close my tab only to find out my card was about to be charged for more than double that amount. After my card was declined due to an excessive charge that I was not prepared for, I asked the bartender what the final amount was. After discussing this with the bartender and owner they had told me an unidentifable man in my party that was no longer at the bar had been charging my account. I explained that there were only two people in the bar that I knew and after the owner walked away to fix the situation, the bar tender proceeded to yell at me because they had to cover the loss cost of someone that supposedly left the bar that I didn't know charging my card. After I told her I was done speaking with her and would only speak the owner she preceded to tell me I owed everyone an apology and went to the owner to throw a tantrum, after i refused to speak with her further. After the owner charged my card the correct amount he decided to change his attitude after he originally apologized for the situation.  If anything I was the one that deserved an apology for the \"person no longer with my party\" that was unauthorized in charging my card had such a tab. Needless to say, I will never go back due to the disrespectful manner I was approached with. Such a disappointment and a poorly run establishment. Customer service is clearly unheard of here amongst its bar tenders.", "author": "Bridget W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-19", "description": "Came heret on May 15, 2008...heat wave day.  It was hot out.  The inside of this place was even hotter than the outside...that sucked.  then the bartender girl told us she was out of all the things we ordered.  The keg thingy was broken so the draft beers were warm, the selection of bottled beers was not so great...i mean...it was ok here...i guess.", "author": "desiree n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-23", "description": "This is such a friendly neighborhood bar! And it's sooooooo clean-even the bathrooms. It's pretty chill here and I love the ambiance-there's plenty of seating with all the tables and rounds. Tanya is my favorite gal behind the bar-she's so cool and she's so damn fast behind that bar! I like coming here and throwing back some brews-but of course those Tiger Beers ;)", "author": "Dessa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-09", "description": "I used to come here before it became Danny Coyle's and it is quite different now.  It's sleeker and cleaner than the other dive bars in the area almost to the point of being bland.  It's also brighter with higher ceilings and shiny fancy fixtures.  The crowd is different too.  P and I had fun just observing the younguns in the place.  It was prolly the new freshmen class at USF.  The girls sipped colored frou frou drinks in martini glasses and the boys seemed not to have learned yet to put the coasters on their beers before leaving for a smoke.", "author": "Pelle Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-23", "description": "With sports on the TV and free wifi there's something for everyone at Danny Coyle's. I spent most of the Champions League finals on my laptop, but it was a lot of fun being surrounded by soccer fans screaming and jumping up and down. The bar has a pretty good selection of beers, and isn't too expensive. It's definitely a nice place to relax and have a few drinks.", "author": "Will A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "Just went for a quick drink on a Monday evening...but...$10 for 3 import beers...in San Francisco? I gasped and thought I got away with getting a free beer.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-29", "description": "Only been there a few times but always have had fun.  People seem pretty fun and nice  Some of the guys are a bit boarish however...  Bartenders are quite nice and competant.   A bit out of place for the Lower Haight.  \nFor what it is, however- an Irish pub-  it's too expensive for my sensibilities.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "Typical bar, but it's got an Irish name and is nicer than most irish pubs. Lots of flat screens and soft colors make the environment inviting. The wide selection of Scotch and Hangar One helps as well...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-05", "description": "I'm sorry, but there are too many dive bars in SF. I think it's a disease. Thank god they cleaned this place up. Don't get me wrong, I understand the whole dive bar thing... but too many is not a good thing. An Bodhran was nasty, old, smelly, dark and just tacky. If you want a dive bar, go to the many that are located in the Lower Haight. It's about time that the neighborhood gets at least one place where I'm not worried about the bathrooms. Besides, this place is partially owned by Brian (the best bartender in San Francisco) and that means that it wasn't revamped by someone who doesn't know the place.... it was revamped by a true Irishman who knew what problems An Bodhran had. Congrats Brian!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-23", "description": "I liked it better before the remodel.  It's sooooo loud.  The crowd has changed, too shi-shi for my tastes.  On the plus side, the bartenders are cool.", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-04", "description": "I have no idea what this bar wants to be.  Is it a sports bar?  A lounge bar?  An irish bar?   Whichever way it's nice to have bar options in the neighborhood plus they have a cool jukebox in the shape of a musical note.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-13", "description": "So glad they kept this spot Irish!  Totally revamped... it even still smells new so you better check it out before the bar mold sets in.  Great guys behind the bar who won't let you out of there without them buying you a pint, and there are even Irishmen to chat with who'll be buying you a pint as well!  Nice addition to the hood by day... don't really know who the night will bring in : )", "author": "Tara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-09", "description": "i love this place....one of my favorite in the city.  the bartenders are wonderful...it's clean, it's open, it's great on a warm afternoon or a cold night.   Oh, and to the person who has yet to encounter a truly disgusting bathroom, just head down the street to the Toronado or over to Fly Bar.   Lord only knows what kind of bacteria is brewing on those floors.", "author": "chrissy k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-13", "description": "It'll never be a destination for me. Good place to take the parents. Or certain friends. Or in case of an emergency.\n\nIt's clean, the bartenders have passable knowledge, and on occassion you may be suprised with some entertainment.\n\nBut really, it's not a place for a night out.\n\nSorry.\n\nMy recommendation is that they could cut back on the attitude, as it doesn't belong in the neighborhood.", "author": "kyoto s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "went here lastnight for the first time....it was eehh. coolish crowd that included b2b stragglers and middle aged working class men.  got hit on by a creepy guy in a captain costume, not so fun. plenty of room to sit, music was ok.  enjoyed the dog doorman. all in all ppl were pretty friendly.  maybe im just being pessimistic about this place because i was sober driver....that must be it. oh yeah and they were playing the sharks game, so that was definitely a plus.  might come back, liked the neighborhood.", "author": "Jamaica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-24", "description": "I have been craving yummy Indian food, So my boyfriend and I decided to walk to get dinner at Indian oven and spend some time talking and \"rekindleing\" our relationship. On our way , we came up to Danny coyles or as I prefer to call it (Danny's Coyle). We decide to have a beer before dinner.  Cut screen 2 hours later......laughing, drunk, enjoying free shots from the kind bartender.  My boyfriend is Irish so when we go to Irish establishments, his accent gets nice and thick, which helped in the rekindleing, since I love a thick Irish accent!We never made it to dinner but we did in fact rekindle our relationship! Although, I did wake up at 4 a.m starving. But no longer craving Indian food, now a jamba juice. Which I have yet to get either and am instead having a class of wine.  Hmmmmmm, maybe I should be yelping A.A..", "author": "butters m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-08", "description": "I stopped by Danny Coyle's not knowing what to expect as I'm more of a SOMA/Financial District drinker. I was pleasantly surprised. The place was clean with a hip vibe. I liked the fact that it had cool mood lighting and a very EURO feel. I'll be back again and again.", "author": "D Scott D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-02", "description": "You know that \"humph\" sound you make (or at least I make) when you are confronted by something pleasantly surprising.  Like \"humph, that romantic comedy/weird foreign film/horror movie was actually pretty good.\"  Well, when I walked into Danny Coyle's I thought \"humph, this places looks pretty nice.\"  Shiny bar, glowing green thingies, plasmas - the whole places has this upscale Irish bar thing going for it that's unexpected in the lovably scumy lower haight.  I really wanted to like this place.\n\nUnfortunately, a lack of security quickly put a damper on my opinion of Danny Coyle's.  Now, don't get me wrong, I understand that a-holes can wander into any bar and ruin an evening.  But when (1) you're serving vast amounts of liquor, (2) in the Haight, (3) on a Friday night  and there's a total lack of any sort of bouncer you deserve to be put on blast.  The script:\n\nAct 1\nScene 1\nJ, N, C and P walk into bar\nJ: \"humph, this places looks pretty nice.\"  \nN goes to bar and gets drinks.  J, C, and P go sit at the only available table.  N returns with drinks.\nN: blah, blah, blah, game, blah, giants\nC: blah, blah, girl stuff, blah blah\nRANDOM GUY THAT IS SO DRUNK HE'S SLURRING HIS WORDS BEYOND RECOGNITION AND HAVING TROUBLE MAINTAINING HIS BALANCE (henceforth \"RGTISDHSHWBRAHTMHB\"): hey man high flive!\nJ: uhh\nRGTISDHSHWBRAHTMHB continues wobbling with hand in air.  J awkwardly gives him a high five.\nRGTISDHSHWBRAHTMHB (to C): high flive!\nC, weirded out, reluctantly gives RGTISDHSHWBRAHTMHB a high five.\nRGTISDHSHWBRAHTMHB (to P): high flive!\nP capitulates.  RGTISDHSHWBRAHTMHB wanders away.\nC: What the hell was that?\nJ: Drunk people, whatever.\nRGTISDHSHWBRAHTMHB returns.\nRGTISDHSHWBRAHTMHB: high five.\nJ: that's ok man\nRGTISDHSHWBRAHTMHB: come on, blah, blah, drunk talk, blah blah\nJ: Hey, I think there's some people over there that want a high five\nRGTISDHSHWBRAHTMHB: hey mlam you're just trying to get rid of me.  not cool mlam.\nJ smiles.\nRGTISDHSHWBRAHTMHB: ok mlam. ok.\nRGTISDHSHWBRAHTMHB makes a fist to get a pound.  J gives him a pound.  RGTISDHSHWBRAHTMHB  walks away.  \nJ: they need to get that guy out of here\nC: there's no bouncer\nJ: damn\nRGTISDHSHWBRAHTMHB returns.\nRGTISDHSHWBRAHTMHB : high five!\n(repeat 3,471,023,841,208,321 f-ing times, each time with RGTISDHSHWBRAHTMHB being more obnoxious and exhibiting less equilibrium)\nJ, N, C & P finish drinks and vacate in a sour mood.\nEnd Scene.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-01", "description": "Met some of my Irish friends for drinks on a Friday!  I would never have known about this place had it not been for my Gaelic connection.  The owner, Brian, used to bartend at Martin Macks down the street and ventured out on his own!  So cool...anyways the service was fast and furious and the concoctions well above par!  The music was entertaining and not too loud and the crowd was a great melange of characters!!!  Definitely a good time for you peeps on stag or coupled up!  Slainte!", "author": "Cherry M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-02", "description": "What happened to An Bodhran?  They cleaned it up, added some lights, added a bunch of tvs, added some speakers, raised the prices, and ... wait, what happened to An Bodhran?", "author": "Tim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-21", "description": "This place is great.  I went there with two friends to watch the FA Cup final after spending a miserable 45 minutes down the street at Mad Dog.  Even though Danny Coyle's is half the size it was not nearly as crowded.  The six plasmas make it so there's a good tv in every direction and getting a drink was easy (Guinness on tap).  The best part is that this pub is clean and the bathrooms are immaculate!   The staff was friendly as well.  This is definitely the new spot to watch footie on a Saturday or Sunday morning.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-17", "description": "This is the best place in town.  For all those haters out there who do not think it is an authentic Irish pub then maybe you should meet the owner and all the bartenders (save one...it's okay Daniel).  This place is the biz and they let me bring my pups in whenever I feel like it...as long as they don't do their biz on the floor and bark all evening it is all good.  Saturday and Sunday are sports days, soccer in the morning and then football all day long.  They even have NFL Sunday ticket and the try to accommodate all football lovers!  The weekend evenings are hoppin' and the crowd is great.  Get over yourselves and get into the best bar on the Lower Haight!", "author": "Ashley E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-02", "description": "I love this place!! It's nice, it's clean and it wasn't crowded on a Thursday night. Also they have a men's room, a woman's room and a man and woman's room! How thoughtful!", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-29", "description": "Don's Different Ducks has changed into an Irish sports bar", "author": "Thomas S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-29", "description": "Lacking in personality, at least it's clean.  There are bistro tables and a bar, so there is plenty of room to have a conversation.  Nothing really stands out about this bar besides how consistently young the crowd is.", "author": "regina k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-11", "description": "this bar seems really out of place. if you could pick this up and move it to, oh say, the marina, then things might make a little more sense. it was weird to be in a bar with both d-bags sporting armani exchange and girls with tattoo sleeves. very weird. as far as irish pubs go, this one is really nice, and if i cared about sports, i might think of frequenting it more. drinks are overpriced for the location and i thought the cute bartender was checking me out but he was just telling his coworker to ID me. jerk.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "My new neighborhood Irish Pub.  This place is HUGE  and has an absolutely beautiful wood bar.  Great bartenders--they're glad to hear you're ok the day after your birthday when you were a stumbling mess.  And they took good care of my purse until I could get back over there to retrieve it.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-12", "description": "Great place for a beer. Very friendly staff.  Although I liked the dark old bar I have grown to love Sunday's at Dannys.  The regulars at the back of the bar are friendly and welcoming. They have 5 TV's with the Sunday ticket and most Sunday's people bring food in to share wth everyone. Overall it's a good neighborhood bar I dont' know how it stacks up late night. In my opinion if  you want to watch a game and drink a beer with friendly locals it's perfect.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "I don't drink much, and I am pretty over bars. That being said, I am a huge UFC fan. I went to Danny Coyle's to watch the fights tonight, and what a great place. People were friendly. It was not a big pick up scene, though it did have a pretty descent representation of young good looking singles. I found the staff to be attentive and friendly. The bar was not overcrowded, and when it did get full, it was still comfortable. I could watch the fights from any place in the bar, and though I was happy to stand, I found a seat without much of a problem. THere were no drunks in the place, and a live DJ began as the fights ended. Great spot-I will be back.", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-31", "description": "I love this bar! Every time I go here I have a blast! They have a nice selection of alcohol and beer. Always I fun friendly group around.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-26", "description": "Quiz night is great, but a haughty overcharging bartender I do hate. Still, I'd go back to test my trivia and watch some sports on the big screen.", "author": "Bee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-01", "description": "I fucking love this place.  I went there with a bunch of friends for one of the most absurd nights of my adult life.  The drinks are strong, they have Fernet (which my roommate promptly threw up after each shot) and the music is danceable.  I ran into a bunch of people dressed like Nacho Libre while outside for a smoke.  They gave me a HUGE Nacho Libre keychain that recites quotes from the movie.  Sick.  Then we ran into this El Salvadoran guy who let me listen to Mana on his mp3 player.  Then he gave my friend Zach a mini-flashlight and told him could put his cock in it.  Seriously.  Zach ended up giving this guy his phone number.  Guess who called Zach on New Year's Eve?  Cock-in-a-flashlight guy.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-18", "description": "I've only been to Danny Coyle's after work during the week.  There is a good crowd at that time.  They have a good beer selection and a friendly bartender.  I also like that it is so clean.", "author": "Sara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "Hey, Trivia night on Wednesdays is at 7:30... Photo gallery and bonus question here:\n\nhttp://www.brainstormer.com/venueDisplay.aspx?venueID=171&state=ca", "author": "Bob N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-11", "description": "Great bar, super friendly owner and staff.  It's definitely a place that appreciates your business.  Cleaner and more stylish than any other bar in the neighborhood with a nice selection of liquor and beer.  Girls, it's worth stopping in for a drink just to use a bathroom without urine or puke all over the floor!", "author": "D'Arcy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-22", "description": "I love this bar. This is my home bar. The night I moved to SF in August, my friend and I stumbled upon this bar. We needed a drink after the 14 hour (straight) drive from Seattle! Tonya was our bartender, and she STILL remembers me every time I go in to have a drink! Friendly staff  and great drinks, not to mention clean and usually a diverse crowd of twenty-somethings to the older crowd, I always feel welcome in this bar.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-01", "description": "bar trolling with the wife over labor day in the haight. stepped in here after having been to Molotov's. yeah i know. i didn't fit in there either. \n\ni give it a three cause i have been to better and i have been to worse. been drunk all over this land from maine to the rio grande. toasted in hickok's in deadwood, blasted in mandalay bay, vegas and paid $12 a shot for blue berry infused grappa in bar 888 at the intercontinental. ain't choosy. like the fact that the place was clean, even the shitters. drinks were reasonable. the only thing i didn't like was when i ordered a b&b with a coffee chaser, the bartender asked me if that meant a cup of coffee. come on. b&b is benedictine and brandy. she grabbed a bottle of benedictine and i had to tell her to add some brandy to it. way to god dam sweet if you dint. the red wax seal is benedictine and the gold seal is the premixed. i would have been pissed but it was only five bucks. plenty of sports on so i might go back.", "author": "scott c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "I live in the neighborhood. This place is very cool looking with all friendly bartenders. Safe enough to go to have a few drinks and walk home. I love it.", "author": "Puangrak A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "I love this bar, the staff is always friendly, they are always open for the big games.  After only going there a handful of times to watch soccer in the mornings they knew me by name and drink.", "author": "Thomas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-02", "description": "for the bartender knowing to top off a pint of guinness with a shamrock float.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "Danny Coyle's rocks.  5 stars for super-fast service from seasoned staff, 2 women' s bathrooms, and because every time we stop in for one we stay for several because we have such a good time.  This place just has a great ambiance for chilling out with a good drink.  I love how the windows are wide open on nice days, and that I never know what I am going to get in terms of the crowd (people watching).  Plus I see nothing wrong with a bar that is actually clean and does not have all-black painted walls and ceilings (and I am not a marina bar fan. People come with friends and mind their business, who cares what you wear.)  I know if I tell someone to meet me here, they will have a good time, too.  And maybe a new hang-out.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-29", "description": "This bar has a broad beer list, good atmosphere and excellent for watching UFC fights ($15 p.p.). Not too crowded, good price and nice staff.", "author": "kris k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-24", "description": "this is a good spot.  i didn't get there when it was an bodhran (sorry).  therefore, i'm probably the only person on here that is scoring this place based solely on how it is now.  simply put, it feels a bit out of place for lower haight.  it's either pleasantly clean or excessively sterile, depending on your world view.  likewise, the beer/drinks are either high quality or too marina.  the patrons are either freshly showered or sadly yuppified.  hey - i report, you decide.  that said, i was ripped while there.", "author": "schnarf-a-larf a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-15", "description": "Any and all fears of Au Bodhran's complete and total demise have now been fully realized. Danny Coyle's represents the opposite of it's predecessor. In a very bad way. Gone is the intricate Celtic ceiling. It can be assumed that the groovy Lower Haight street scene mural that once hung above Au Bodhran's cozy confines has been trashed. Worse than the erasure of one of the neighborhood's most comfortable Irish pubs is the faux-nice interior that the Martin Mack's owner pulled the trigger on. It makes his Upper Haight bland-o-rama look like the Taj Mahal. Instead of the Guiness-perfect lighting and old-world accents that used to don the walls, the new proprieter went with slate-grey walls, yellow freshman year hanging lamps and chunky pretend-stone tiles. Simply put, this place has been ruined. As my good friend said as I entered the strip-mall looking watering whole, incredulous look plastered on my face, \"welcome to SFO.\" To send us on our way, the tastemaker DJ behind the bar played us out to the Hootie And The Blowfish classic, \"Hold My Hand.\" Perfect.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "The bartender was a man this time.  He was nice.  He served me a cider and had an honest looking mien.  The man on the other side of the bar was not a gentleman.  He bought my friend and me a shot of Bailey's, of which I could only do half, and then sucked my face. My friend meanwhile, had gone over to the other corner of the bar and was making fast friends with the owner, who then gave us another irish cream to toss back. How could we say no? I think the DJ they hired was on drugs. Watchout, this place is W.I.L.D.", "author": "Reena R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-12", "description": "Great little Irish bar in the lower Haight. Everyone there was extraordinarily friendly (read drunk) in the middle of the afternoon. The owner went out of his way and offered all of the yelper's present a shot or a drink of their choice. The only other time that has happened to me was when a group of us went drinking after an all you can drink beer Mexican brunch in San Diego at 10 a.m. What do you do after drinking more beer than the owners ever expected? Go across the street to an Irish bar and have some doughnuts with your free whiskey. Back to the review, this bar is really upscale and has some top shelf vodkas like Hanger One and Charbay among others. Flat screens showing Giants baseball on some and 49ers pre-season games on others. Awesome happy hour specials $4 pints of Guinness and $6 margaritas or pomegranate margaritas. They also allow food from a number of the joints on Haight.", "author": "Rob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-27", "description": "OK, I too, am waiting for the decor and the atmosphere to shape up a bit.       But let's focus on the fact that the place has amazing potential: the coolest and most sincere barman around, Brian Coyle, has opened his own place. That in itself makes it worth sticking around to see how the place shapes up.  There are plenty of stinky dirty bars with graffiti infused bathrooms in other parts of the Haight - do we really need to mourn the loss of An Bodhran?  Right now it's a clean slate waiting to develop its own character and personality. Congrats to Brian!", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-12", "description": "Danny Coyle's is a lovely Irish bar. It is aesthetically pleasing, the bar tenders are all fairly attentive, they serve Harp on tap, and the e-Juke Box has just about everything under the sun if you are willing to drop a few coins. It is definitely not the cheapest bar in the hood, but for the lower haight they have a fantastic selection of whiskey, vodka and tequila. They even satiated my parent's very astute taste in delicious anejos... that is unusual for an Irish bar. They regularly have the sports of the moment on the TVs that are spread throughout, and they have an entertaining trivia night on Wednesdays. I love this block (Haight btwn Steiner and Pierce) with the great Irish Bar, Baghdad Nights (Iraqi Cuisine $$), Axum (Ethiopian Cuisine $), Katz Bagels ($), a few boutique shops and Sunrise Liquor (Solomon is the best). I write about this block in hopes that I can help pick up business just two blocks from the Lower Haight hub. We need to support these fantastic establishments to ensure diversity in the neighborhood and to support our local small businesses.", "author": "Jenifer G."}
