{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "My favorite pizza! I'm not actually a lover of pizza because I don't like bread - I enjoy pizza once in a while or when I drink, but I love other foods more. But wow, the pizza here is amazing where I'd crave it sober. The dough is so soft but in the best way... most crusts I've had on pizzas are usually dry or hard or empty/airy inside but the crust on these is soft and yummy.\n\nHad the sausage pizza which was a little too salty. Also had the bianca pizza which was phenomenal. I'd totally come back and recommend this place. Service was friendly and ambiance is nice for a group dinner or for a date. Prices are slightly pricey but also typical SF prices. Reservations can be made on Resy.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "The margherita di bufala pizza was pleasant. \n\nThe dough was evenly charred, thin in the middle, and bubbly all around. I really appreciate the slightly sour taste. The dough is a bit chewy, and you really have to work your molars.\n\nCheese was nice and creamy. The sauce was a little bland. \n\nOverall, it was a nice pizza.", "author": "Allen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "A friend and I were going to The Masonic for for a show. Wanted to grab dinner in the area, so I picked Del Popolo. I made a reservation through Resy about two weeks prior for Thursday, October 4th at 6pm. I arrived about 15 mins early, so they seated so me at counter. Though I believe my reservation assigned me the counter since that's what is stated in my email confirmation.\n\n*LITTLE GEM SALAD: summer squash, olive, pecorino toscano re nero & meyer lemon ($14)\n*MOZZARELLA DI BUFALA: heirloom tomatoes, pine nut pesto, crushed basil & crouton ($15) \n*SALAMI PICANTE PIZZA: crushed tomato, mozzarella, peppers & onion ($18), add Mushrooms (+$4)\n*CHENIN BLANC: Breze, \"Cremant de Loire\", France, 'NV ($12 glass)\n*CABERNET FRANC: Saint Just, Saumur-Champigny, France, '16 ($56 bottle)\n\nI adored the pizza. A nice thin bubbly crust. And just the right amount of toppings. My favorite pizza is a pepperoni and mushroom, so this hit the spot. The mozzarella was tasty. I adored that pesto sauce. I liked it so much, I could have licked the plate clean. The salad was nice and fresh, but for me, the olives made it too salty. They only offer two bubbles by the glass, so I picked the non rose one. The cabernet franc paired nicely with our meal. And decently priced.\n\nSitting at the counter was a bit uncomfortable, so I recommend trying to get a table if possible. The heat from the pizza oven made it a little too toasty. If you get red while drinking, this would definitely take it up a notch. Service was great. Our waitress was very sweet and attentive. Restaurant filled up fast after I got here, so I would definitely recommend making a reservation.\n\nGlad I finally visited their brick and mortar. I tried their truck ages ago. Solid spot to grab a pizza.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Great pizza and an awesome experience as well. There's not a ton of variety which is the reason that I am giving it a four. Every time I have been I sit at the Chef's Counter so I can watch them make the pizza and enjoy the ambience of the big pizza ovens. You definitely need to make a reservation. The highlights for me are the wood fired carrots, fresh mozzarella appetizer, Margherita di Bufala pizza and I like to add prosciutto, mushrooms and sausage to it! All of the pizza's are amazing. Definitely a great casual place!", "author": "Carol Ann V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "I love this place. The decor is great, inside and out. The host and server we had were so nice and completely on...water was refilled without asking, orders were taken in good time and food was brought out with good pacing. The food was outstanding. We had their Cornmeal Fried Maitake Mushrooms (sooo good, with black garlic creme fraiche that was delicious), Lacinato Kale Salad (yum! I would have this over and over!), Margherita Di Bufala Pizza (very good), and the Pizza Bianca (with excellent ricotta salata). Such a great experience - I want to go back tomorrow!", "author": "Florence A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Super yummy pizza! Right up my alley. Soft dough, light and fluffy. Decent pricing. Good service.", "author": "Meagan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "This is a solid option in the city for Neopolitan style pizza. Easy to get a reservation, and you could probably walk in on a weekday without much of a wait. They have an affordable selections of wine as well. All of the pizzas I have tried have been delicious, but I especially like their potato and rosemary one. The crust is tender but chewy with a nice char. I recommend coming with a group of 4-6 to try more flavors! Their appetizers are not nearly as good as the pizza, so go light on those.", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "I'm usually not a fan of pizza, but theirs is divine to be he point that I've actively sought it out several times. The crust is so perfectly blistered and yet light, soft and chewy. You can tell they use really fresh ingredients as the flavors of your toppings really pop and amazingly, the pizza isn't oily or overwhelming. They have refined their pizza to make the ideal single person pie. \n\nAlso, the staff is wonderful. They're always very knowledgeable and professional. Personal apologies for the last time we visited - my boyfriend and I were arguing over something and I may have snapped at the serve when he cut in during this. That being said, he was still super polite and professional throughout the meal. Apologies and it won't happen again!", "author": "Quinn Li O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Del Popolo is an exquisite Italian restaurant. It all starts with the terrific layout of the restaurant, where the large wood fired stove is center stage, and a majestic wall stocking wood for future use. Around this, there's a bar for individuals or couples to sit and watch the pizza chefs do their thing.\n\nThis is definitely a pizza restaurant, and boy are their pizzas amazing. Crust and dough is perfect, but I could see them being not firm enough for some people (if you hold a slice by the crust it is droopy). \nThe small plates are a perfect complement to their pizza choices. The theme of modern Italian cuisine runs true through the menu. It's not your everyday Italian restaurant as it's taken the classic receptors and brought them to the next level, without being pretentious or pompous. It's simple, but elegant.\n\nMy favourite was the potato pizza. Potato pizza!? Yes, you heard it. They put very thinly cut slices of potato on the pizza, just enough to get the fantastic taste of roasted potato, without it being a carb overload. Really unique way of using potatoes without the meal being about them. \n\nMake reservations ahead of time as this is another one of those somewhat difficult to get restaurants in SF. Would come here again when in the area.", "author": "Mati K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-01", "description": "Yesterday I came at 6:00 PM and they told me I had to wait two hours for a table or sit at the bar area. I was hungry and there was no alternative so they sat me on the long table facing the wall. I felt like I was eating at a prison cell, The chairs are uncomfortable and the heat from the pizza oven made it worse, i ordered for myself 3 small plates and 1 pizza total $75.00 no drinks. I was going to spend more money but there was no space for more food. I'm glad I didn't order anything else because everything I ordered tasted greasy, canned, flavorless, I've been here a couple of times but this time I'm not coming back! While I was there for 30 minutes I saw the same tables empty! Don't waste your money here. Go somewhere else. The food is not that great!", "author": "Gabe B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "Very casual ambiance, good service, a bit too expensive. The seating arrangement was uncomfortable.\n\nI enjoyed my pizza but it was not one of the best of SF. Burrata appetizer was good but nothing to rave about. Desserts variety is limited.", "author": "Alessio S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "Was only able to book a reservation for 8:30pm on Thursday, but I called at 6pm and they said they had spots for us at either the communal table or a dining table, as long as we left by 7. Since that gave us a good hour to drink wine and eat pizza, we went with the dining table. I would've liked to sit at the counter area and watch them take pizzas out of their cool-looking oven, but I'll save that for a time I come alone. \n\nWe ordered the Asparagus and Margherita pizzas, since we were not in a salad-eating mood and the small plate part of the menu comprised mostly of salads. I also had a glass of red Lustentia, which was this nice dark red with a slight fizz. \n\nThere have been a lot of people critiquing the pizzas here, and I think it depends what kind of texture you like for your pizza. There are a lot of ways to bake and make a pizza, and this may be one that most people aren't used to, with the slight sourness to the crust, the doughiness, and the burnt bubbles. I enjoyed the pizzas, especially the asparagus. The lemony taste from the Meyer lemon was like an extra little surprise after each bite. The margherita is nicely flavored and doesn't overdo it on either the sauce or the cheese. \n\nThe pizzas also came super fast, probably within 5 minutes of us ordering. They weren't piping hot, which was a bit disappointing, but the timeliness was appreciated considering our limited time-frame and our hunger levels. We managed to eat 3 slices each and left with a takeout box of the 2 remaining slices for breakfast!", "author": "Sophie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "One awesome woman stokes the oven, banks the coals, slides the pies.  All night long. Talk about skills!  and grace!!   \n\nOtherwise...\nCrust is naan, period.  Hardly enough topping to qualify as anything but good, chewy bread. Looking around, many women left wide crescents of crust, and no doubt left hungry. No salad available to speak of.  (Croutons don't count.)\n\nDel Popolo prints money, you eat carbs.  Nice business model.  \n\nSix dollars for a half-full of sparkling water served in a recycled generic bottle.  Seriously? At Gather it's on the house when offered in this fashion, but nicer.", "author": "Ada Louise H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Good for groups! Del Popolo is a lively spot in the TenderNob area on Bush - hard to get a table so make sure to reserve beforehand.\n\nOur party sat on the communal table (with swinging chairs) in the middle of the room and we ordered quite a few items from the menu. Particularly, the MARGARITA ($15), the BIANCA ($15) and the HOUSE MADE SAUSAGE PIZZA ($18) stood out with their well-mixed and distinct flavors. \n\nFrom the starter section I found the WILTED CHICORY SALAD (cauliflower, fennel, anchovy vinaigrette & pangrattato, $14) to be a delight.\n\nDel Popolo is a great choice to start off your night right, make sure to reserve a table though.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "Best pizza dough I've had in a long time. Nice venue and menu choices too. \n\nCommunal seating got me in at no notice on a Sunday night. The olives were almost too pretty to eat - perfectly formed, firm and tasty. The pizza came out in what seemed like mere seconds with towering charred crust bubbles and a nicely leopard spotted base. The topping included al dente broccolini stalks which worked very well. It was no problem to finish the pizza on my own. \n\nDessert was a simple panacotta, done well. Nice touch to offer vermouth as a digestiv. \n\nI'll definitely return", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "I found Del Popolo through Eater SF. What an amazing find. It's worth time reading the story of how the chef/owner started his business as a pizza truck. Pretty cool.\n\nWe took a chance and went early without a reservation. We were told the wait would be about 30 minutes, but about 15 min were given the option to sit at the communal table. I'm so glad we did. Not only was I hungry but we wound up meeting some great people sitting with us at the table. \n\nWe started with olives to share then two pizzas, the Margherita di Bufala and Bianca. Both were awesome! We finished off with a delicious dessert and then headed out for drinks with our new friends. \n\nI would recommend a reservation, but either way don't miss out on Del Popolo!", "author": "Roland W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Easily one of the top 5 pizzerias in SF, which is an amazing accomplishment given all the quality restaurants we have to choose from. The ambiance is very nice, some communal tables and the pizza has a unique crust that borders on crispy yet is somehow still chewy (in a good way). The carrots are amazing, I highly recommend them. I know who orders carrot!?!? At a pizza joint....you should that's who!", "author": "john j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-29", "description": "This is one of best pizza spots in SF! Recently attended a friend's joint birthday celebration here. We ended up sitting in the communal table since there were 8 of us, and we feasted. Just be careful with those swinging chairs at the communal table, as they swing out and in and don't have back support!\n\nMake reservations at this yummy pizza joint, as this place is bumping on a weekend evening. We basically ordered everything on the menu, but here are my favorites:\n\nSmall plates:\n- Crispy chanterelle mushrooms - withmaple soubise and pickled cabbage\n-Seared king trumpet mushrooms with crispy prosciutto and savory-caramel, and chimichurri\n-Wood oven roasted cauliflower\n\nPizza:\n-Margherita - with basil, crushed tomato and mozzarella\n-Bianca - with mozzerella, ricotta, basil, and garlic\n-Peppers- pecorino, pancetta, roasted sweet onion, and lemon\n\nThis is a perfect place for a date or a night out on the town with friends. \nThe place is cozy, and can get loud. Great and friendly service. Awesome wine selection by the glass and bottle. A few beers, too.\nAlthough it's in the Union Square area, it feels far from the hustle and bustle of Powell and the surrounding streets. \n\nCheers to you Del Popolo! Til next time!", "author": "Gill C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Pizza is good. You have to make a reservation though. Obviously dinner time is busiest.", "author": "Nikki B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Make a reservation, otherwise good luck getting in!\n\nFOOD:\n+ Tempura fried butternut squash: This was served with whipped ricotta, fried sage relish, lemon, and garnished with pomegranate seeds. I was amazed by how yummy this was! The butternut squash was fried perfectly in the tempura batter. Delicious!\n\n+ Pizza- Broccoli di ciccio: Calabrian sausage, mozzarella, pecorino, and red onion. With any of Del Popolo's pizza's, the crust is where it's at! It's so fluffy! If pizza crust holds any importance for you, and if you care about fluffiness at all, you won't be disappointed!\n\nThe wine selection here is also quite good!\n\nAMBIANCE: I would describe this as a combination of industrial, rustic, and art gallery? Either way, Del Popolo is a great spot for date night or for gathering with friends.\n\ntl;dr: I would come here to satisfy pizza cravings, but definitely do so WITH a reservation!", "author": "Lillian Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-12", "description": "Dinner review. Pizza.\n\nBeef tongue - 4\nTrumpet mushrooms - 3\nBianca pizza - 3\nBufalo margherita - 2\n\nCrust is just way too soft. Need to leave it in the oven longer or something.\n\nOverall, \"I've experienced better.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Omgomgomg. This place has fluffy crust that is baked to perfection in a wood oven. I've yet to have a bad meal from here. Waiting is always annoying so put your name on the list and grab a beer across the street while you wait.", "author": "Gianna D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "Beware: do NOT come here for team/company event. They nickel and dime you with an absurdly high minimum charge. We booked for a table of 9 people, and the minimum was $800 (for pizza!) despite the prix fixe meal itself costing $45/pp. That means with we were expected to spend $400 on drinks.\n\nMany people in our party do not drink, and early into the meal they let us know we could purchase bottles of wine to take home to reach the minimum at 50% off. While the discount was nice, it feels like this must be a process they go through often... Feels like a scam. \n\nFood: some pizzas were excellent and appetizers were mainly solid, but scarce. I would pass on dessert if you have a choice (we didn't with the prix fixe).\n\nOverall, I think this restaurant would cost roughly $30-50/pp if dining normally. We left with a bill of roughly $100/pp before tax/tip. Do yourself a favor and book a restaurant like Flour & Water instead for that price point.", "author": "Abbie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "We ate at the counter and really enjoyed our dinner.   Our waiter was great and the food was delicious.  We started with the Barbecued Stone Fruit which was full of flavor.   We also had the Trumpet Mushrooms which I really enjoyed but my husband did not care for them.    The starters were followed by 2 pizzas - Margherita di Bufala, Salami Picante.  The crust was nicely charred and the toppings were fresh.  \n  \nWe will definitely return if we are in the area.", "author": "Diane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "We came here for an early dinner around 5:45 on a Sunday. It had a neighborhood restaurant vibe with lots of families. \n\nWe wanted to start with a salad and the waiter recommended the kale pecorino salad with dates which was both refreshing with very robust, satisfying flavors. Smashing start to the meal!\n\nWe also got the margherita pizza with sausage and the salami pizza. Both were good. It's a thin crush pizza with a doughy dough that's got some chew to it, which we enjoyed. The dough bubbles with the bubble part getting burnt. That was unfortunate, but not sure if that's just part of this type of pizza?\n\nIt was a lovely date night place. It's pricey -- came to $60 before tax and tip, but that's pretty typical for SF.  It's a good date night spot in this area :).", "author": "Kathryn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "5 Stars for the pizza. 5 stars for our service. 3 stars for the sides. \nMade reservations and ate here before a nice date night in the city to see a show. Place is relatively small and very busy. We decided to order one pizza and one salad thinking we would share each. The salad was very tasty. No complaints about flavor it was excellent. But for the same price as the pizza it was micro. I would not order a salad from there but next time two pizzas. We had the potato pizza which others have mentioned and it was very flavorful. Great crust. \nAlso, drink prices were crazy high in my opinion. 6 oz imp stout was 8 or 9 dollars. Right across the street is a great tap room which has much better if only normal prices and a super selection. I dont think one should price their drinks to the point where a customer would actually not order a drink and go after across the street. But that may just be my frugal, I worked for this money, side.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-09", "description": "Came here for pizza. Got the Bianca and the sausage pizza.\n\nThe Bianca has ricotta cheese in blobs. So if you like the pizza really cheesy, this won't be the place for you. The emphasis is instead more on the dough, and yes the dough is pretty good. If you love that New York cheesy pizza, this place in general will not be for you. It came with some basil, and I generally like my basil after the over rather than before.\n\nAlso got the sausage pizza. Like the Bianca, focus is on the dough so there isn't much sauce. The sausages themselves had a lot of flavor, not spicy.\n\nAll in all, all the pizzas are pretty bare. The atmosphere is nice, get to see them make the pizza and would seem like a good place to take dates. 20 bucks for a personal pie does seem to be on the expensive side though", "author": "Victor D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "the host is great. everything else is mediocre and the sad part is they will remain open because people in california do not know quality. \nwent in and asked for extra basil and this is what i got. if this is considered extra basil then what does the original pizza come with, 3 pieces of basil? on top of that when i asked for more i was given attitude. i am in the service industry as well and you can not make a paying guest feel like they are a hassle for asking for what they need. there was no hospitality. on top of that their crust isn't really crust its doughy chewy bread. you do not get what you pay for.", "author": "Meena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "INCREDIBLE PIZZA PLACE, THE BEST IN NOB HILL FOR SURE. They make the pizza right in front of you, delicious thin crust, not too much sauce bc it's so flavorful, and amazing selection of homemade topics. The potato pizza is particularly special, delicious seasoning on those thin sliced potatoes. Re the pepperoni pizza, the red peppers are really flavorful and add so much to the pizza! \n\nGO HERE!!!!!! Oh and call in advance. Sit at the counter to watch the pizza being made!", "author": "Sela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Ordered a Margherita pizza to go as the wait to dine in was long, even for a lone diner. Upside was that I was able to wait inside by the kitchen (and wood oven) while I waited for my order. It was fun to watch the magic happen as the energy is upbeat yet chill. After walking back to my hotel room, my pizza was still warm and amazing. The ingredients was definitely fresh and good quality. The dough is exceptionally San Francisco (not NYC). The wood fire oven makes a difference as well. I have to come back but know to place a reservation ahead.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "We loved this place from the start from the gigantic pizza oven to the dimmed lights.  The hostess was nice and checked us in with our reservations.  We recommend getting Reservations.  They have a nice wine selection but some of the wine is only available by the bottle.  They have a\nSmall selection of beer.  Kale salad was incredible and the pizza did not disappoint .  One of our top 10 pizza places.", "author": "Levi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Fast forward two years later and still going strong \n\nCrust is amazing with a great chew factor + the flavor is so good you don't need toppings\n\nThey are minimalistic with the sauce and toppings which is great because it doesn't steal from the dough however at the same time they aren't present enough to make a lasting impression\n\nThe night we went, they ran out of dough and had to ration one per table for the last few tables including ours so keep that in mind if you have a later reservation\n\nStonefruit salad was refreshing and had interesting flavors mingling but not a must get. Same went for the black hog slices, fine but you won't miss out if you don't get it \n\nOverall Thoughts\n\nPizza is top notch, sides are not bad but I'll be coming back only for the pizza going forward", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-11", "description": "The worst pizza I ever had! \nWe went there because this place was near our hotel on the day of our arrival. I walked in the restaurant at around 5:30pm, the place was half empty. I asked the receptionist that we are a party of 3 but we don't have reservation, she said ok! but when my father walked in with a walker, right away she said we will have to wait for at least 45 minutes or longer. Obviously they don't like disabled customers!  We could not wait that long so we ordered take out to eat at our hotel. \nI couldn't believe they charged 15% service charge for take out!! The pizza weren't even good, the bottom part of one of the pizza was so burned that it could cause cancers if you eat them!!!  \nWe don't recommend this place!", "author": "Josephine E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Small local pizzeria with a cozy atmosphere. \n\nStumbled upon this restaurant while I was in the area. Nice upscale pizza parlor with a very relaxing ambiance. Dimmed lights and noticed almost every patron was sipping on a glass of wine. Seemed to be a popular local joint to wine down at. Brought my two toddlers in and realized this place is not ideal for children. \n\nOrdered the basic marinara pizza and I have to admit this is by far the best plain pizza ever. Mainly because the dough tasted like naan rather than your regular pizza dough. The marinara sauce was very flavorful and you can taste the burst of garlic in it. I could see my pizza in the making from where I was sitting - open kitchen concept where you can see the chefs tossing the dough in the air. Pizza was served piping hot and it was absolutely heaven at first bite. \n\nI have to come back.", "author": "Mei W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Incredible food. Pizza is light, airy, crispy on outside and chewy on inside. Sauce and ingredients are fresh and compliment the crust so well. Fun atmosphere. Love the huge burning oven as the main attraction of the restaurant!", "author": "Amanda V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Pizza is never a bad idea in any situation.  There's also something insanely satisfying about thin crust, Neapolitan pizza.  Coming in, my husband and I were hungry.  So hungry that we decided that we needed to order two pizzas.  We had the delicata squash to start, then proceeded into splitting the Brussels sprouts pizza and the House Made Sausage pizza. Both were delicious, and while we both love a good sausage pizza, we were more impressed with the Brussels sprouts variety! \n\nReservations are accepted and I recommend having one before showing up, especially if you have more than two people.", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "---- STARTERS ----\n\nWinter chicory salad: 4.5 stars\nYummy but only seasonal. Made me want to come back to this restaurant again.\n\nSeared Romanesco\nbrown butter-sultana relish\n\nCherry Tomatoes: 5 stars\nFresh produce, delicious salad.\n\n\n---- PIZZAS ----\n\nHouse made Sausage Pizza: 4.5 stars\nGood 3/4 enough to fill me but too small for 2 people. Update: 4/6 the dough today was amazing. Up to 4.5 stars.\n\nMargherita di Bufala: 4.5 stars\n\nBianca: 4 stars\nTheir pizza dough is impeccable. With the mozzarella, ricotta, basil, garlic, and white sauce, there are very little toppings on there but you can taste the dough in all its glory. I recommend adding another topping though.\n\n\n\n---- DESSERTS ----\n\nCreme Fraiche Panna cotta: 4.5 stars", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Pizza pizza pizza, who could have enough pizza? This place makes it to my top 10 list of favorite pizza places. \n\nI usually like a crispy crust but the dough here is chewy and soft which goes so well with the toppings they offer here. We got the Italian sausage and hot salami pizza. We also ordered the melon with prosciutto with creme fresh - it was amazing and so refreshing. I like this combination better than cantelope. \n\nTo top it off, they serve Mr and Mrs Miscellaneous ice cream here. That night we went had stracciatella, which was amazing. Mr and Mrs Miscellaneous is one of my favorite ice cream places in SF, who knew restaurants serve their ice cream. \n\nI will definitely be back!", "author": "Kim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "The buffala margherita pizza was great, delicous.  What put it up to 5 stars was the absolutely incredible salads.  Laid eyes on many, but devoured the turnip and avocado salad.  Simple but amazing!  And, the warm olives were divine!  Will return!", "author": "B S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "Disappointed to say the least.  I'm visiting from Phoenix and was so excited to eat here. I came here from the airport and was dressed casually, but nice.  I immediately felt judged for my appearance by the hostess, even though their attire says casual. Perhaps her condescending looks were because of my jacket? For the record, I didn't think I'd need it, but San Fran got a lot cooler once the sun went down. \n\nAppetizers took ages to come out and were not very impressive.  No one was around to fill my iced tea or get my friend a refill until our dinner was brought out.  And the food overall was pretty bland and I left craving something else. \n\nOn a positive side, there are plenty of other restaurants in the area to check out. In search of a restaurant who hires people with a positive attitude and serves tasty food! Wish me luck!", "author": "Theresa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "Given the stellar reviews and the fact that the SF crowd is a tough crowd, this was a disappointment.\n\nCame here on a Sunday evening to grab some pizza to-go. The place was pretty packed when I arrived around 8 pm-- every table taken. To place a take-out order, I was instructed to go stand by the server station.\n\nThere were several other people waiting for their orders/to place their order. The server who took my order was super friendly (in general, it seems like all the staff are), and I was able to quickly order. However, there isn't much space in that corner and several times, I had to move to allow waiters to pass or get to items. It was uncomfortable for me and I felt bad for the wait staff-- it would be great if there was a way to make sure customers didn't get in the way of staff.\n\nThe wait from order to pizza was pretty fast, and I quickly took the pizza back to my hotel (2 blocks away). As I was walking, I could smell the pizza, which is always a good sign. However, when I finally sat down to devour the Bianca pizza with mushrooms, I was disappointed.\n\nThe ingredients were definitely quality-- the toppings mixed together beautifully. However, the dough of the pizza was a miss. It was soft and doughy, but not in a good way. The pizza was almost limp in its form. It was obvious the pizza was cooked-- the crust was charred. But it was like the pizza refused to be fully cooked and ended in a state of charred, not crispy.\n\nI really hope it was because I got it to-go, because if this is what they serve in the restaurant I have no idea how these rave reviews exist. If only because the toppings were top-notch, perhaps when I return to the city I can give this place another chance. But with the abundance of good eateries in the bay, its hard to justify a retry of mediocrity versus a chance at a stellar experience.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-16", "description": "This is a beautiful place in the city but the pizza is soggy and both over cooked and under cooked. \n\nThe food has good flavor but the pizza was kind of a disappointment. The edges are very charred(if you like that flavor it won't be a bad thing) and the middle is really doughy. \n\nI'd say it's nice for a date spot as far as ambiance goes, but the food could be better.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Wow super good pizza!  More on the simple side with fewer toppings but sometimes that's all you need.  I had the marinara.  The tomato sauce was unlike any other pizza I've had (at least in recent memory), and the crust was so fluffy--thin in the middle and thicker on the edges.\n\nThe only bad thing about this place is the WAIT.  Omg we waited over an hour for a table (there were 3 of us) on a Wednesday night after 7:30!  I would recommend making a reservation.  \n\nOnce we ordered, though, the food was quick to arrive.  I tried a slice of the butterball potato pizza with salami added.  The salami was a bit spicy, and this one was more creamy/filling than the marinara.\n\nOther nice things to note are the service and ambiance.  It's dimly lit, warm, has high ceilings, and there's a big oven in the middle behind the bar.  Makes for a good date spot!", "author": "Melissa W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-12", "description": "Unfortunately a very disappointing meal. I've eaten at Del Popolo a couple of times and enjoyed the food, but after this meal would not return.\n\nWe ordered the beets and burrata as a starter. The texture of the burrata was off and the dish was over-salted. The broccolini pizza we ordered was also extremely over-salted. As someone who loves salty foods, this is not a complaint I often have. The kale salad with dates and prosciutto was fine but not noteworthy.\n\nAs for drinks, I ordered a glass of sauvignon blanc that was undrinkable. After sending it back, the waitress apologetically said that they often had this problem - apparently the restaurant focuses on serving natural wines and diners are often displeased. The menu doesn't make the emphasis on natural wine clear, but since the wine can have a more unfiltered feel, it seems like something the staff might flag, or that could be mentioned on the menu. I've had some good natural wines, but this wasn't one of them. I traded it for a mediocre chenin blanc.\n\nOverall, not great.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "Sat at the front counter area and watched my pizzas come to life end to end! The cheese on the Margherita di Bufala is magical. Not too heavy but just the right amount of cheesiness to get you hooked. House Made Sausage pizza was even better - so many bold flavors in each bite. I'm not usually a crust person but I saved them all for last and dipped them in chili pepper infused oil. So delicious! \n\nThe staff has really got it down to a well-oiled rhythm: quick but not to compromise quality.", "author": "Briget P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "I've been thinking about this pizza pretty consistently for the past 24 hours or so that it has been since I first had the pleasure of eating it. I could eat the crust with nothing on it for every meal and be happy. It's that good.\n\nI've known about Del Popolo forever but was too lazy to go find the truck before there was a brick & mortar location, and then just too lazy overall. But I finally happened to be relatively nearby at the right time of day and got to experience the wonders of the Del Popolo pizza. It was a magnificent experience.\n\nMy friend and I shared both a Margherita pizza and the brussels sprouts pizza. I always like to try the classic Margherita on my first visit to any pizza joint, and the one at Del Popolo did not disappoint. The sauce was flavorful and it had just the right amount of fresh mozzarella. The brussels sprouts pizza was fantastic - I loved the crunch that the shaved sprouts gave each bite, and the flavor worked really well with the pesto. Both had a fantastic and wonderfully fluffy crust that was out of this world. Seriously, I want it all the time. And each pizza was perfectly charred (NOT burnt, goddammit).\n\nI will be back, I promise you that. I was a fool for not coming here earlier.", "author": "Dylan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "This was not your average Italian food. If I had to succinctly describe the food here it would be casual elegance. The menu presents very simple but what they do with the food here is just phenomenal. The price is also another amazing aspect because this place is truly in that $$ range which is shocking because of the location and how elevated the food was.The restaurant is small but gives off a community vibe with the long tables in the middle and open seating around the pizza oven.\n\nWhen you taste the food, it kind of tricks you into forgetting you came in to nonchalantly share a pie. Our first dish was an appetizer carrot dish. The menu didn't say much else but it turned out to be barbecued rainbow carrots with a buttermilk dressing and pistachios. The dish was served cold which I was not expecting but really tasty. It was pretty much a grown up version of carrot sticks and dip. We followed this up with the crab toast that was layered with a really smooth sweet potato puree and tiny wild mushrooms. The last dish we got was the bianca pizza. The crust is a thin, soft and easy to pull apart crust. If you had to ask me it feels like it's more on the dough side of the spectrum than what you'd think of when I say crust...very simple and my new favorite style of pizza crust. A very simple, clean and delicious pizza.  Highly, highly recommend.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "You'll want a reservation. We had a reservation the first time, but we went back a couple nights later for a late dinner without a reservation, and we waited. It was only 10 minutes, but the place is so good and it's always packed. The food is fantastic! We tried 4 different pizzas and shared. I saw salads for other people that looked really yum!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Came here for dinner with a friend and we were seated immediately at one of their communal tables. We started with the cauliflower appetizer which was sooo good. It was cooked in butter, nuts and a few other things which made it very flavorful. Honestly, I would just come back for this appetizer and would love to try the other ones they had as well. For our mains, my friend got a margherita pizza and I went with the salami pizza aka pepperoni. The pizza was good but the crust was a little dry and doughy but the cheese, sauce and salami were pretty good.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Made reservations Saturday midday for a 9:30 same-day late dinner with a group of 4, at the recommendation of some friends.\n\nFOOD: we shared the cauliflower app, which was delicious and not a starter you'd expect at a pizza place, even a \"nicer\" one. In fact, all their starters were pretty unique and tasty-sounding and out-of-the-norm.\n\nPizzas are personal-sized and cut into quarters. . I got the salami one, toppings were really flavorful, if a bit thin. Ratio of toppings to crust could've been higher, or at least they could've been spread closer to the edge.. Crust was soft, chewy, thin, blistered by their blazing wood-fired oven around the perimeter - all good things, but 1.5\" crust around a 12\" pizza is a lot of crust!\n\nEnded on some scoops of McConnell's ice cream, which obviously isn't made in house, but reinforces the whole New-American-place-that-happens-to-only-serve-pizza-entrées-that-should-be-eaten-with-knife-and-fork vibe. \n\nSERVICE:\nWe were served promptly and our food came quickly because of our late reservation. Their pizza oven is right out in the open, and made for a cozy environment coupled with the dim lighting. \n\nOVERALL:\nGreat pizza in a great setting. Now I just need to get over my \"it's just pizza so it shouldn't be so expensive\" prejudice to come here more often...", "author": "Sijia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Kickoff to the Wedding Weekend warranted a special space with great food. \n\nThe Patio at Del Popolo welcomed my crew with a giant hug from start to finish. This was the perfect setting for people who had travelled far and wide to relax and enjoy some incredible antipasti, pizza and chicken. The September menu featured a selection of starters/ salads, three pizzas, a vegetarian tart and a chicken main. The Patio is warm and inviting and Valerie and her team designed it with the perfect additions. My crew had a great night.  If you are looking for a special event space with great food I cannot recommend Del Popolo enough!", "author": "C K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "We tried Del Popolo early on a Thursday night, sitting at the bar close to the wood-burning pizza oven.  The space is unpretentious but pretty (especially with the skylight over the kitchen area).  It wasn't the most comfortable (small, high stools close to each other, with heat coming off the oven).  I'd recommend reserving a table or eating at the communal table instead.  \n\nMany of the servers were SF hipster types.  They were kind / friendly with helpful recommendations, and service was quick.   Given that it's popular and a small space, I would avoid during peak hours.  I could see how it could get loud and chaotic when busy.\n\nI had one of their seasonal sides to start. the BBQ'd stone fruit with bufala farm cheese and corn.  I love all of the ingredients separately, but there was something in it (maybe a sauce or glaze) that was overly tart, so it wasn't my favorite thing.  \n\nI tried the salami picante pizza (salami, tomato, mozzarella, peppers, red onion, chili) and added green olives.  The dough was good (crispy but not burnt on the outside, pleasantly chewy on the inside).  The combinations of toppings worked really well together.  I prefer my thin crust pizzas a little more crispy so, I'll probably ask them to cook it a little more next time.\n\nOverall I think it's a solid dinner option.  The food and service merit the price ($45 for 1 app and 1 pizza), but the atmosphere (casual, loud, not super comfortable) really doesn't.  I wouldn't make a special trip or jump through the hoops to get a reservation, but I'd probably pop in if I was in the neighborhood at a slower time.", "author": "Holly P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "Fantastic pizza.  Nice wine on tap.  Appetizers were incredible, too.  We also enjoyed the small and more intimate atmosphere.  Our waiter was quite snobby and rude the entire evening.  Maybe he was just having a bad day.  We'd still go back though.   Snobby waiters won't ruin our good food.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "After seeing this on the SF Chronicle' s top 100 list, I was dying to check it out. The pizza did not disappoint!! The wine is a bit pricy but we enjoyed 2 bottles split at the table and shared 2 pizzas between 3 people. By far this is my new favorite pizza in the city! Loved loved loved it and can't wait to go back. The only thing is didn't like was the pizza was a tiny bit burnt.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "Pizza: mediocre to bad. The worst I ever had at this price point. The dough is burnt and undercooked at he same time. The pizzaiolo should go to Naples and learn how to bake a pizza. Actually forget about that. Just go a few blocks north and it will still be an improvement.\n\nAmbiance: visually trite and terrible acoustics.\n\nService: rude, except for one guy who knows about beers.\n\nVerdict: don't go. This place only survives because there is no pizza for a few blocks around it. Do yourself a favor and go to il Casaro instead. Or that other one with the stairs i forgot the name of. Even tony pizza napoletana is better! And i don't rate that place at all!", "author": "Winter M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "Such a disappointment! The low point of our San Francisco trip. Service was very slow, inattentive, several mistakes. Kale Caesar salad had a mildew aftertaste. Coffee was very weak. Pizza was very good, though. I recommend bringing your own wine and just ordering pizza.", "author": "Jane R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Delicious tasty hot pizza that is made in a wood oven in front of you. \n\nMy husband and I got a recommendation from a friend who loves this place; Needless to say we have become fans as well.\n\nWhen you come in, sit at the pizza bar where you can see all the action: flying dough, pizza assembly, the oven master operating a huge oven placing pizzas in and taking them out. Waiters examine the pizzas before bringing them to you to make sure they are top quality. You will not be disappointed!\n\nEach pizza is cooked for about 90 seconds, they total 190 pizzas per day! One of the guys said it is gets slower during the holiday, to about 120 pizza's per day. \n\nThere are other great dishes, like Barbeque Carrots, with buttermilk and pistachio. Amazing desserts are also available.", "author": "Julia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-31", "description": "Pretentious hostess, no need to tell a party of 1 that there is a 10-15 minute wait when there are open seats.   Food may be good but she is terrible.", "author": "Ramona B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "Terrible.  Front of house very rude. Drinks are very expensive.  Pizzas are doughy and not good.", "author": "CRaig P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "I love Del Popolo! Their pizzas are a little different from what you would usually get a pizza joint - it's lighter, a little more chewy, and super tasty and simple. And I also love how their menu changes every now and then, bringing in new delicious dishes to try every time I visit.\n\nMy favorite pizzas are the Margherita di Bufala and their House Made Sausage. I just love the buffalo mozzarella, both its taste and creamy texture. The chewy consistency of the pizza just enhances the flavor of the cheese. On the other hand, the House Made Sausage(s) are a little spicy; the heat works well with the other fresh ingredients on the pizza (tomatoes, peppers, red onions, and chili). I would also recommend trying any of their appetizing appetizers!\n\nThe place is usually packed! With pizzas that good, of course there's going to be a little wait. Service is reasonably good, for a busy place. If you feel ignored, just remind your server what you're waiting for or what you need. They will happily oblige. Lastly, they do take reservations for groups up to 6 via Resy and 6+ via email, so I would recommend doing that if you plan on visiting this establishment. If it's only one or two of you, try to sit at the pizza bar and enjoy the show of your pizza being made right in front of you!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "This has to be my favorite pizza spot in SF. Came here for my girlfriends birthday and ordered:\nMargherita- perfect crust and very simply done, but executed perfectly.\n\nHousemade sausage pizza- same crust, and the sausage added the perfect fennel taste to it. Def was my favorite of the night.\n\nBlanco Pizza- the least favorite of the bunch, but still worth trying. \n\nIf you like thing crust neapolitan pizza, then you need to come here. No one does pizza better in Sf.", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Amazing pizza. We walked in to order carry out (you cannot call in carry out) and it was ready after just a few minutes. I think the pizza was done by time the hostess finished running out card.", "author": "Joseph E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "Soggy and too much oil on top. I was so unhappy with my pizza and I truly never thought I would be unhappy with a pizza.", "author": "Rene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "I'm always excited to try new pizza places and was looking forward to trying Del Popolo as I heard good things. We started with the artichoke appetizer which the server raved about. It was pretty good, but nothing I have to order again. We also got 2 pizzas - the butter ball potato and the anchovy. The butterball potato pizza was really good. I like the crispness of the potato as it was still soft and crunchy (not at all like a crispy chip). It was really simple, but it was really good. I like the anchovy one too, but it was a tad on the salty side, which I guess makes sense since the fish is salty and so were the olives that were on there. The pizza was just a little softer than I would like from all the liquid. \n\nOverall, the pizzas were good. I really liked the dough and the way the cooked (wood fire).", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "My idea of a great pizza is:\n\n- The right amount of fluff and stretch to the dough\n- Has to be wood fired to get the right kind of char\n- Do not like the crisp that you get on the dough when it is done in electric ovens (hence not a big fan of NY style pizzas)\n- Has to piping hot when it gets to you\n- The Sauce has to be strong in flavour, not too runny that it makes the pizza very messy to eat\n- Option to customise should be available \n\nDel Popolo pizzas can get better. The char is more than required. The tomato sauce in the Marinara was too sour that it was overpowering. The Bianca (white pizza) was thus a better choice. The good part is that they were happy to customise (add toppings) on half a pizza. And it is hot when it reaches you. \n\nAlso their Chilli Oil is spicy, so pour accordingly.\n\nInsider tip: You can add broccoli to the pizza, even though it is not mentioned in the extra toppings list on the menu. \n\nThere are so many pizza spots out there. Not coming here anytime soon.", "author": "Puneet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "One of the best spots we found in San Francisco!! Great space with an awesome vibe! Excellent service!! The whole staff went above and beyond to make our experience wonderful even into the late night hours! Pizza was fantastic and the panna cotta was heavenly. You won't be disappointed!", "author": "Jessie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "I already knew the truck was awesome, so I've been meaning to try their brick and mortar, but as with many places worth going to, getting a table takes some luck or patience. I arrived at Union Square early to see Drag Queens on Ice (!) and swung by Del Popolo to get my name on the list hoping the timing would coincide with the end of the show. A table was actually expected to be ready earlier than would work for me, but the host was able to work things out to text me around the time I wanted, score.\n\nWhen you enter, it's hard to miss the mammoth wood burning oven and wall of logs behind it. The smell and warmth instantly lure you to settle on in. While we waited for our table to get ready we were able to order drinks. I chose the cider (served in a wine glass), but it was too sour for me. If you want some extended time to watch the chefs in action or just admire the oven, get a seat at the chef's table.\n\nThe delicata squash was the best I've ever had (and I've had some great fancy schmancy  squash). The spices were warm and comforting, the green curry provided a nice tangy balance to the sweetness of the squash, the restrained cheese shavings offered just a little fatty oomph, and the sunflower seeds finished each bite with a delightful crunch. I could eat that every day. Really, every day.\n\nService was great, down to the little touches of asking if we had any food allergies, swapping out our plates and silverware in between courses without asking, and discretely wiping up our mess.\n\nAnyone who knows me well knows that I'm a sucker for a potato pizza. Years ago it was a strange concept to me, and now I wonder how anyone could live without it. And so while I normally choose the Margherita as the benchmark to evaluate pizza prowess, the potato was a no brainer for me. The one miss of the night is that the potatoes were way over salted, but given the rest of the pizza (sauteed leeks, slightly indulgent fontina cheese, chewy crust but with a slight crunch from the lightly scorched top) was perfection, it was easy to overlook. San Francisco is spoiled with several great pizza spots, and this is certainly one of them.", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Originally tried to go to Uncle Vito's down the street but the wait was insane and this place was opening shorty. We got there right at opening and we're seated quickly (although they seemed surprised we didn't have a reservation). We were carb loading for the San Francisco Marathon the following morning. The pizza was good (I'm not normally a huge wood fire pizza fan because the crust is too thin but the hubby enjoys it), but the prices were pretty high for what you got. I don't know that we'd go back again, but it did its job. Fast service and friendly wait-staff.", "author": "Carlee P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-23", "description": "Thank you for the horrible customer service. This is specifically for the blonde hostess. She was rude, did not text us when our table was ready and did nothing to help after I showed her my phone with no message from the hostess system.", "author": "Ivory A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "Best pizza I had in the US!\nAfter 4 months and just one decent pizza I was walking to the top of the Mark and noticed somebody eating what looked like a very succulent pizza and decided to try it.\nI think this is the closest real Italian (Neapolitan style) pizza you can get on the West coast!\nLovely place and setting. Get a reservation if you want to be able to sit :)", "author": "Flavio Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "This is really sad. Reading prior reviews, looks like this place has gone terribly downhill recently. I've been a fan of Del Popolo since it opened, loved it, best in city. Was there a couple weeks ago. The guy who normally made pizza was gone and replace with two new guys. The pizza had 30% more dough than normal, and it was wet and soggy and undercooked. I wanted to write to the manager and let them know about this, but there is no way to contact anyone there. Seems like the people with passion for pizza just left and nobody cares about quality anymore.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "Wow. What a waste of calories. Basil what basil, ugh! Not impressed. Eating out of starvation.", "author": "Meli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Delicious wood fired pizza, fun loud atmosphere and nice wine list! Del Popolo is our favorite date night spot, and our most recent server Jessica was so awesome and attentive, thank you Jessica!", "author": "Maria M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-30", "description": "Came here last night with a large group of friends to try for the first time. There isn't very much good to say about this place, so I'll leave that for last. \n\nThe bad - like really bad: \nThe pizza did somehow manage to be burned and undercooked at the same time. Very strange. \n\nThe management made a mistake on our bill and stopped us in the door as we were leaving (after we had already signed and tipped) to ask for more money. After having them yell and cuss at us we gave them our cards back - out of intimidation and shame FOR A MISTAKE THEY MADE. It's unacceptable to treat patrons with such aggression, anger and abuse. \n\nThe mediocre: \nThe table service was not bad, but it wasn't good either. It was hard to track down a server to put our order in. \n\nThe good:\nThe atmosphere was quite nice. There is a large pizza oven in the back of the restaurant which is fun and beautiful to look at. Everything seemed clean and tidy. Also - loved the olives, but to be fair I haven't met an olive I don't like. \n\nGive it a try if you really want to, but you will be disappointed and possibly abused by the staff.", "author": "Petrea R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-30", "description": "Lets start with the positive: Nice ambiance, candles cozy\nOkay now for the sad part: To the owner, I have never been to a restaurant having a manager demand a tip and we could not leave his restaurant without the tips! Excuse me? Not sure if you need to go back to training customer service but demanding tips is extremely terrible service. We understand the mistake your employee made, however do not demand for tips. Likewise, the pizza wasn't cooked well, burnt to be honest. Really awful experience, asides from the ambiance I would suggest heading down at North Beach for pizza", "author": "Taryn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "This is my second time there. First time was amazing. Second, extremely frustrating. \nMy pizza came up pretty bad. I'm not talking about under-cook due to \"style\" and \"trend\", I'm talking about raw. So raw you can gather the dough and make raw balls out of it. (Funny I see people complaining it was burnt...)\n\nThe server, unfortunately that night, couldn't care less. Didn't try to fix/do something about it and didn't care to address it to the management or anything whatsoever. Worse! I ask for a box to go, so I can finish baking it home and this dumb server brings me salad boxes. What for?? So I can pile up the 4 pieces of the untouched piza? Really???? Is that a joke??? Luckily I made him realize he was working in a pizzeria and he switched to real pizza boxes. \n\nI'll never return. I guess I'll just stick with the always GREAT and CONSISTENT Delfina Pizzeria.", "author": "Marco V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-30", "description": "They will force you to tip bad employees! Avoid the place, pizzas are damn small, a draft beer is smaller than a can, the dessert menu is limited to chocolate and... chocolate.\nPizza are over and under cooked at the same time this is ridiculous.", "author": "Romain D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "We shared the Crispy Broccoli with cashew, turmeric, currant & mint - the flavors of this were SO so good. I want to know how to replicate this because I'm so intrigued! \n\nWe also shared the Margarita Pizza, which was also good! The consistency of the bread is very soft and wet from the sauce. It does taste kind of like sourdough. The only thing I would have preferred would be less charring on the crust because it was pretty black and charcoal tasting once you got there. I saw on some photos it was more dark brown/golden brown vs black, but I'm sure this is hard to control depending how hot the oven gets. Other than that, the flavors were good!", "author": "Fahren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Fantastic pizza! We had the Marguerita di Bufalo and one with Potato and Prosciutto and I loved them both. Soft and chewy crust with a slight sourdough taste. Flavorful sauces and cheeses. We also had the little gem salad and Tokyo beats and they were both awesome. Highly recommend this restaurant!", "author": "Kristin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "Good pizza done more traditional style. Crust is very light and airy (which was interesting though I personally prefer more crisp texture in my crust)\n\nThe buffalo margarita (4/5) - your classic combination though done well.\n\nSalami picante pizza (4/5) - they aren't kidding that this is spicy but definitely keeps it different from just standard pepperoni \n\nI think Tony's Pizza in North Beach beat this place from a sit down pizza standpoint but this place wins on romantic and charm atmosphere and service.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "The atmosphere at Del Popolo is great. It's intimate but lively and sitting at the counter is debatably better than a table because you get to watch them make the pizza! The broccoli di sicco pizza and peppers pizza were also very good. Service was alright, we were left waiting at the front for a little before someone came up there but that's not a big deal. It gets pretty crowded so if you don't have a res expect to wait for a little but they turn out the pizzas pretty quickly.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "Came in for dinner with a few friends on a Tuesday night.  Thought we could catch up and enjoy each other's company, but this place is too popular to allow for lingering.  We were the annoying \"too busy catching up to immediately look at the menu\" people, and then the annoying \"I don't like any of these wines\" people, and then the annoying \"enjoying our meal and each other's company people\" and it was pretty clear throughout, that the one constant was that we were a pain in the butt to the staff.  Our server rolled with it fairly well, and it's not as if our service suffered - it was just clear that we were a burden.  I was baffled as to why the hostess was doing the old tried and true Touch Everything on the Table, Multiple Times technique until I saw the line of people waiting, not by the front door where I had been looking, but along the back wall.  We then sheepishly made our exit and found another place to linger over more drinks.  \nAs for the food - the carrots were outstanding.  The salads hit or miss (the kale one was much yummier than the little gem/farro one, in my opinion) and the broccolini pie was yummy and spicy.  I usually like a little more crisp to my crust, but this soft, blistered version was still very tasty.\nI'd definitely return - but if it's with friends that I know I want to spend time catching up with, earlier or later in the evening when I can take my time.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Dang I love this place. It's held up on repeated visits. Beautiful space, good service, absolutely great good. To die for fried artichokes the other night. Everything I've had there has been awesome!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "Looks great but if you do not make a reservation the head of the house can't handle making a decision about when to sit you, so plan on sitting there for more than and hour and a half.  We waited with a drink for over and hour and watched open tables sitting there with no parties for over 30 min empty.  Can't tell you about the food because I left before I was seated.  I would  NEVER give them my money. Plenty of wood fire pizza around the city. They told me seating was an \"art\". For all those who are from New York and Los Angeles and understand what customer service should be like in San  Francisco don't go here.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Come for the intimate atmosphere alone. Great for a date or dinner with friends, the dark room and candlelight make for a great night with food that's more than just pizza. \n\nMaybe a little pricey for what it is, Del Popolo serves very solid classic pizzas as well as some unique seasonal varieties. Some have been hits, some misses. Although I must say the small plates are what really wins me over. Definitely worth your time to peruse and consider a few of those with a pizza or two.", "author": "Vinh B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-23", "description": "Came here on a Sunday night and we're seated in about ten mins at a very uncomfortable communal table. The stools were attached and very unstable and there were no hooks to keep our bags. The server came in and we ordered two draft beers. The server immediately came back and told us it was unavailable and I see another server pour out a glass for another table. I found that very very strange and was very bummed out. We then went on to order pizza. We got the margarita with additional olives and peppers. The pizza was OK nothing to talk about. I was still hungry after eating and had to go out and get some more food. Not recommended. Another classic situation where reviews in SF Yelp have been severely misleading.", "author": "Ashmita V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-18", "description": "This place is overpriced 40 bucks for 2, ten inch pizzas! We had to go out to get more food because still hungry. Staff did nothing to make us feel invited or welcomed to their place.  Self centered and arrogant millennial s.  Pizza was slightly burned, tomatoes tasted like can chopped and barely any mozzarella cheese  \n\nSave your money go to Buena Vista or any other place. BTW worst review I ever wrote.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Go online and make reservations now. We had difficulty getting through on the phone and had a miscommunication about seating without a reservation. Apparently we said the magic words, we wanted to get in and out to make an 8:00 show, and somehow with a little patience and a glass of wine to keep us company, we were seated. \n\nWe split the little gem salad and a pizza margarita and were not disappointed. The salad was surprisingly delightful, the top sprinkled with crispy shallots. The wood fired pizza is as good as Delfina's, great sauce and cheese, but it is hard to cook the dough just right to get it crispy but not burnt. Ours was a little underdone. \n\nThe wait staff was professional, kind but not chatty. $76 including 2 glasses of wine and tip. I would go back.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Omg this place is so bloody yummy. I mean I am super picky with my pizza, I am literally a pizza snob. Nothing is ever really good enough when it comes to my pizza and this place totally blew me away. I came here for my friend's birthday, she got the margarita pizza and I got the beef salami pizza and we also tried the beef tongue which was delicious. Uhhhh best decision ever! Obsessed with the beef salami pizza and I can't wait to go back. The slices are thin and the bread melts in your mouth. What more can a girl ask for? Well more wine of course. Lol. Always more wine.\nEnjoy!", "author": "Belle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "I cannot stop thinking about this pizza. The soda is seriously overpriced--I paid $6 for a tiny little baby Coke bottle--but I don't even care because the pizza was so freaking good. Please come to LA.", "author": "Caitlin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "I didn't catch the hostess' name last night but she is the perfect example of excellent service! \n\nFirst of all, it's torture for me to live two blocks from this place. Everything is really really really really good! \n\nI remembered that they don't take reservations (now they do) and walked over to treat a friend for his birthday. We got there at 7 pm and we were seated in about 15 minutes.\n\nMy friend even mentioned how great she was when they came here with a group of 7 without a reservation and she assisted them with their party.\n\nHostess,  you are magic!\n\nThe King Trumpet small plate is my favorite. I could eat 6 of those. \n\nThank you / damn you for being so close to my house. Mostly Thank You :) !", "author": "Ema I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "When I visit the Bay area, I like to check out the pizza. I'm a Neapolitan fan, and Pizzeria Delfina is my gold standard in these parts. Del Popolo had a lot of good things to offer on this first visit, but the pizza did not measure up for me. \n\nVIBE: Rustic, hip, a little noisy as the place filled up on an early weeknight. Clearly a destination. \n\nSERVICE: Friendly, informative, polished staff. Our courses were well-paced. \n\nFOOD: Roasted cauliflower was a delicious starter. (The starter menu was definitely a notch above most pizzerias.) A bufala margherita pie was just OK -- not in the same league as a margherita DOP I had at Delfina a few days earlier. The crust had a sour taste and gummy texture, and the tomato sauce was a bit watery and lacked depth of flavor.\n\nFor me, a pizzeria is all about the pizza. As a restaurant, Del Popolo was OK, but I doubt I'll return.", "author": "Comensal A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "Del Popolo makes excellent Neopolitan style pizza, comparable in quality and style to Tony's in North Beach and Una Pizza Napoletana in SOMA. The crust is nice and chewy and slightly sour - tasting slightly fermented. The sauce and toppings are excellent. \n\nWe weren't able to get reservations at a reasonable time on Sunday (the earliest reservation for 2 was at 9:30pm) so we decided to walk in just before 6pm, and were promptly seated at the large communal tables in the center of the restaurant. The place was completely full by 6:30pm, so go early if you don't have reservations. \n\nWe started off with the sauteed Monterrey Bay squid, which was excellent. The squid was lightly battered and was served atop cranberry beans (similar to pinto/Canelli beans) with a tangy ripe tomato. \n\nI had the housemade sausage pizza, which was excellent. The pizza was topped with a generous amount of Italian/Fennel sausage, which complimented the tangy crushed tomatoes and mozzarella cheese perfectly. \n\nOverall, we had an excellent experience at Del Popolo and would definitely want to visit again.", "author": "Allen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "WOW. Del Popolo is everything I expected it to be and more. It's just as trendy and clean cut as the pizza oven truck that frequents Off the Grid. Del Popolo served up a huge wine selection, abundant appetizers and several badass pizza options (props to the dairy-free marinara)!\n\nIf you've been thinking about coming here-- get your reservation at least one week in advance-- and show up. You won't be disappointed in Del Popolo's first location.", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Our group of 7 had a reservation and were seated right on time (which is always appreciated). Waters were served, and then we ordered a bottle of wine for the table. Since there were several mouths to feed and we were all pretty hungry, we ordered a ton of food!\n\nTo start, we had the crispy broccoli, which was AMAZING. We ordered four pizzas, which were just enough. The Margherita di Bufala was my favorite. I also liked the Salami Picante - it had just the right amount of spice. I didn't really care for the flavor profile of the Anchovy pizza (I'm usually a fan of anchovy) because it included olives and capers, but others in the group liked it. Our table was also mixed about the Wild Nettles pizza. The crust on all the pizzas was hands-down perfection.\n\nWe were celebrating a birthday (okay, mine) and my friends surprised me with a big slice of Panettone and a chocolate pot de creme. Everyone loved both desserts!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Wow, this is the best artisan style pizza I have ever had.\n\nEverything was great about this place, the staff was super nice and let us sit down about 15 minutes after I reservation because we were running late.\n\nThe place isn't too small which I really liked as well.\n\nWe had a group of 4 and ordered 3 pizzas, they cut each pizza into 4 slices! On point.\n\nWe had the Margarita, House Made Sausage and some other one with some buffalo cheese.  Pizza here was the bomb.  \n\nOnly thing I was bummed about was that they didn't have that Nutella Ice Cream that someone posted a pic of.  I was looking forward to that.  Their drink selection was pretty dope too.  I'll defintely be back to try some different pizzas! \n\nGood job Del Popolo.", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "Solid 3.5 Stars\n\nCame here for date night dinner after a movie at the AMC on Van Ness. On our walk over we called and were told there wasn't a wait for a table for two. We got there about 10 minutes later and the wait was 30 min.\n\nFortunately, they have a place to wait inside the restaurant and you can order drinks. It's not at the \"bar\" which is a semi circle place to sit and eat around the oven, but off to the side a bit. I ordered their red wine on tap and the beau got their cane sugar soda. Both were good and it actually took only about 10 min for a table to open up.\n\nThe menu is pretty short so we knew what we were going to order when we sat down: grilled peaches with goat cheese and the sausage pizza. The pizzas are four slices and personal size but we got one to share and it was definitely enough food with the app. \n\nOn the night we went, the sausage was the only meat option and the rest were veggie. I've been to their pizza truck and they offered a really good pepperoni and I was missing that here. The pies are not cheap (a dollar or two too expensive considering they are personal pizzas) so I was hoping for more variety in toppings.\n\nThe grilled peaches app was my favorite bite of the night. Really fresh and nice char from the oven. Definitely something I'd like to recreate at home! The pizza was just OK. Again, it was kind of expensive for the size and quality. The middle was a bit soggy as well. Wish the crust had a bit more salt. Beau and I agreed that we had had better.\n\nWe looked at the dessert menu out of curiosity and it was very limited. One type of ice cream (Mr and Mrs), one type of sorbet and a pot de creme. We passed and went to Shakedown instead. \n\nService was great! No complaints in that Dept at all. The restaurant had a steady stream of patrons while we were there and lots of families/tourists. I was actually surprised how many children/teens were dining there. Space is open and airy--dark blue, high ceilings, random paintings of people on the wall. \n\nI can't say we'll return. Didn't really leave feeling like we had a special dining experience and again, for the price, we were expecting more.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-08", "description": "I am a pizza-holic. A thin-crust fanatic. I LOVE that chewy, fluffy Neapolitan crust *drool*.... and I had high hopes for Del Popolo's new brick and mortar store because I love Flour and Water. \n\nIf you've been to the Del Popolo truck, it's much the same - overpriced, and a bit disappointing, and slow. \n\n- BROCCOLI - 2 STARS: You could make this at home. Steamed chopped up broccoli topped with cheese. \n- WINTER SQUASH PIZZA - 4 STARS: This selection was a panic order - it didn't sound great, because it was a white pizza but the combination of cheese and squash was surprisingly amazing! \n- ANCHOVY 2.5 STARS: Anchovy and kale? Sounds great! Unfortunately, it was sooooo salty, and the bottom of the pizza was mostly burnt and it was impossible to ignore bitter char.\n- SAUSAGE PIZZA - 4 STARS: This was just as delicious as the winter-squash, it was meaty, satisfying and very spicy. I found it unusual that all their pizzas had inconsistent thickness, which could explain why some were more charred. \n- POT DE CREME: MUST ORDER\n- ICE CREAM (Mr. & Mrs. Miscellaneous): I love ice cream from this local spot, but I was just not a huge fan of Pistachio. \n\nTheir restaurant is really cute, but small and loud, and our waitress was friendly but incredibly slow. Like the restaurant, the food is decent (with highlights and low lights); it's a place for thin-crust fanatics to try at least one.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Sit at the counter if you're making reservations! \nSo good, and entertaining. Pizza to go is also great the next day with a fried egg", "author": "Chauntae M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "A winner! Amazingly good pizzas! Prompt and efficient service in very pleasant surroundings!", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Possibly the best pizza I've ever had. Fluffy dough with just the right crunch on the bottom and charred tops. The anchovy pizza had an amazing flavor profile with dark greens, cheese, olives, capers, and anchovies. (I'm not even normally an anchovy fan.) The margarita we had was also excellent. Salad was on point, and they were kind enough to let us have the dressing and cheese on the side. \n\nOur waiter was amazingly nice. He let me taste a few wines before selecting one and was just very attentive and thoughtful.", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-11", "description": "Came here with my partner last night. We ordered a salad and carrots as appetizers. However, they accidentally gave our carrots to another table, so we ended up waiting almost an hour for our pizza. When I asked the waitress why the pizza was taking so long, she didn't apologize, but instead said she  pushed our order back because our carrots would be arriving later than expected. This is understandable but very bad customer service. You should ask me if I want my order pushed back because you wrongly gave my appetizer to the wrong table. Perhaps, I don't mind having the pizza first. Instead, I watched as the table  next to us that arrived after us had both appetizers and their pizza and check before we got our pizza.\n\nWe were pleased with the food but were very unhappy with our service. Not sure if we will come again.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "I really liked the broccolini and beets appetizer with puffed wild rice and radish vinaigrette! It was quite pricey at $14, but it was even better than the pizza in my opinion. The vegetables were grilled to perfection and the vinaigrette was very complementary to the beets and broccolini. The puffed rice really just pulled everything together and added that extra something. \n\nWe tried the anchovy pizza, which was not bad, but not that good either. The menu says the toppings have 'bitter greens', but it was actually chard and not that bitter, so don't be turned off by it! The pizza was also quite small for the price, and would probably only serve one not-starving person. I had expected more ingredients, but the ratio of crust to center was actually quite large. They also used a sliced up anchovy that was unexpected. It wasn't as salty as some other places, but the flavor was also slightly different. I'd go back and try a different pizza next time - perhaps the bianca pizza with salami added on top, which the waiter recommended!", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "I was so looking forward to this meal. I was pretty disappointed as there is better pizza elsewhere in the city. The starters were so good and dessert was really delicious, but the pizza was the least impressive part of the meal (but is why we came here). It has a very pillowy, soft sourdough flavor. Not my cup of tea. \n\nWe also felt very rushed. Weren't given much downtime to review the menu. I didn't have time to get up to use the restroom between them clearing our starters and the pizzas being brought to table. We were not asked how the pizzas or desserts were; just given the check. \n\nI prefer Il Casaro's pizza and will be going there from now on.", "author": "Elle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Everything here is good. Good food, good service, good atmosphere. \n\nOnly downside is it might be difficult to get a table without reservation. Otherwise, one of our favorite spots to eat downtown.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "Our waiter made our girls' night here very fun. We complained about boys, he complained about boys, it was great. He also knew a lot about the wine list and gave good recommendations.\n \nOrdered a couple appetizers to start, the ragu and fried green tomatoes. Loved the fried green tomatoes, and the ragu was good, but not that hearty dish you think of. It was a lighter version made with mushrooms, and was good but didn't stand out flavor-wise.\n\nWe ordered the margherita and potato pizzas to split, and they were both delicious. Perfect chewy but still slightly charred crust and flavorful combination of toppings. The potatoes were a little undercooked for my liking, still had a bit too much of that starchy resistance. But overall, very delectable pizzas. Friends ordered two chocolate pot de creme desserts and devoured those too.\n\nOverall, great fresh Italian fare! I can see the popularity of this brick and mortar version getting up there with Pizzeria Delfina and Zero Zero.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "I got a Margherita pizza here at Off The Grid at the Presidio Picnic and loved it! The crust was the best part because it was wood fired and super authentic. The only complaint I had was that there were only two leaves of basil on the entire pizza which basically made it just a cheese pizza.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "YES! Great neapolitan spot for a pie if youre in the bay area. They two men running the oven run a heck of a show. I went with carry out. they let you sit by the oven, order a drink and wait about 15 minutes for your pie. PRO tip - they sell bottles of wine togo at cost!!! Enjoy the pies my friends!", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "We had a great experience at Del Popolo this weekend and that's tough to say when you have a 2 and 4 year old at any restaurant.  We got there right after it opened and got a seat at a communal table.  The seating wasn't ideal for kids but they brought over a high chair and normal chair so everything worked out.\n\nThey have a limited menu but in a good way so you can make decisions pretty quickly.  We ordered the chicory salad (tasty) and two pizzas.  Margheritsa for the boys and the sausage one for us.  Everything came out really quickly.  We and the boys devoured our pizzas.  We also got a chocolate dessert which was really rich but good.\n\nAll in we were there for about an hour which worked out perfectly.\n\nGreat pizza, really flavorful!", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-16", "description": "Overrated. The starters were really good but it went downhill from there. Pizza was chewy, not well balanced, and overpriced for what it was. Nice ambience though. Might come again for a starter and a glass of wine but would skip the pizza.", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "That was probably the best pizza we've\n ever had, perfectly cooked and very tasty. The service was great, all the waiters were very nice. I'll definitely recommend this place.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Del Popolo's been on my to do list for a couple months but I did wait it out because they don't take reservations unless you have a party size of 4+ and I dislike waits!\n\nSo I found myself here with my sister last night and loved every minute of it! Delicious appetizers, dishes, pizzas and dessert!\n\nWe got the Bufala Margherita ($18) and added Sausage (+$4) along with Burrata ($13), Yellowfin Tuna ($15 for 4 small slices), and the Chocolate Pot de Creme ($8).\n\nThe ambiance is rustic but warm and inviting. The center dining room has two communal tables. The individual private  tables along the walls accommodate parties of 2-4.\n\nService is top notch and friendly. Would easily return to Del Popolo for simply good eats or a casual date night.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "I'm so glad I finally got to try this place as I'm the hugest pizza slut. The pizza here is different from what I'm use to. The crust is chewier and lighter than other pizza crust I've had it. It made it easier to eat because you can just fold it without pieces of the crust falling everywhere. I got the house made sausage pizza and it was good but a bit spicy. It's not too bad though, just a little kick eat time you bite into a ground sausage. Next time I will get the Bianca, which is the pizza with ricotta. That is one of my favorite kind of cheese so I can't wait to go back and get a whole pizza pie. Each pizza is good for 1-2 people. It's your standard size neapolitan pizza and is cut into 4 good slices.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "Would honestly give this place a 3.5 if I could. Pizza was not bad and the salad we had was solid, not note worthy. Service was probably the least attractive part and left us feeling rather unattended. Would visit again in a pinch and would recommend visiting with reservation.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "You know it's going to be a fun night when your waiter starts to unbutton his shirt...\n\nSorry ladies (and gentlemen), it didn't end up like this: http://bit.ly/1TfhuCP. I can appreciate hunky beefcakes but am I the only that finds this hella awkward? Sometimes a girl just wants to get down and get her meat sweats on--those ladies were proper AF. You know if it was in the U.S., those dudes would have been torn to shreds on top of the bbq grill. Thirsty American females. Ok, maybe I should speak for myself. =X\n\nMy friend said that our cute waiter at Del Popolo looks like one of her associates. He ended up posing for the camera and unbutton his shirt a little, all in good fun of course. If you want to be entertained, our server was really fun and a sweetheart--too bad we didn't get his name. \n\nMy friends and I came to Del Popolo (owners formerly worked at Flour + Water) on their 6th night of the grand opening of their brick and mortar. They accept limited reservations for parties 4 or more. Unless you have reservations, I wouldn't come with a party more than 4 as the space isn't large. On Sunday night, we had to wait 45 minutes for a table. They will text you when your table is ready. There's no bar at Del Popolo but there's a bunch nearby (Hopwater is across the street and Stookey's is on the same block). Beware: street parking is a beeeyeeetch so better allot an extra 15-20 minutes for finding parking. \n\nDel Popolo has a small menu: 7 small plates ($10-$13), 7 Neapolitan-style pizzas ($12-$18), and 2 desserts ($8). Beer and wine only. \n\nWe started with Medjool Dates w/ housemade sausage, roasted tomato, bacon ($13): http://bit.ly/1jk4jnb. These savory sweet morsels with the fiery tomato sauce went great with our beer. However, the bits of bacon were really hard and difficult to chew. We also shared the Charred Cauliflower w/ roasted new onions, pickled lime, poached farm egg ($11): http://bit.ly/1Nto4qB. This would have been fantastic had the cauliflower been actually charred as the name indicated on the menu. My friend said, it tasted like citrusy coleslaw. He was right, it tasted raw.  \n\nWe shared 2 pizzas for 3 people are were full but not stuffed (each pizza has 4 slices). We ordered the Anchovy Pizza w/ crushed tomato, red onion, caper ($18): http://bit.ly/1Tfdy4U and the Bianca Pizza w/ mozzarella, ricotta, basil, garlic ($15 + $4 housemade sausage): http://bit.ly/1Ndj9rT. \n\nI've never tried pizza from Del Popolo's food truck but I have tried Flour + Water's pizzas and I wasn't a fan so I was pleasantly surprised at how much I like Del Popolo's pizza. The pizzas were cooked in a wood-burning oven which produced a poufy, leopard spotted rim that was lightly crisp and fluffy. The bottom had a nice char with a soft, \"libretto\" center as they should for a true Neapolitan pizza. If you're a purist, then go for the anchovy pizza as there's no cheese and the tomato sauce had a good depth of tomatoe-y flavor. I love oooey goooey cheese so I favored the Bianca pizza which had both mozzarella and ricotta. Do add the housemade sausage for a meaty bite; I liked that it wasn't overly oily and overly salty. \n\nService was a bit on the slower side but since they're so new I'm sure things will ramp up once they've adjusted into their new digs. As I've said, our waiter was really fun and attentive when need be, and the other staff we encountered were cool. \n\nThe space is smallish medium size with a handful of two tops on each side of the restaurant, two small communal tables, and counter seats in front of the wood-burning pizza oven. If you're on a date, I would definitely opt for those front row seats...in case your date ends up being a dud, at least you can gaze into the eyes of fully-clothed men making your pie.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-22", "description": "3.5 stars. \n\nWe've been watching this restaurant as it was getting ready to open in our neighborhood. We went there on a very rainy and cold day. The interior was cozy yet has a very cool/hipster feeling. I liked the restaurant immediately after settling in. We were seated at the individual tables, which was comfortable, while the communal tables in the center of the restaurant looked cooler. Service was very friendly. \n\nWe ordered:\n\n- cauliflower - The cauliflower is amazing! It was well seasoned with a vinegary sauce, and the cauliflower itself was charred to perfection. The only pity was it was served cold. We would have appreciated something a bit warmer. But it was delicious nonetheless. \n\n- squid - This squid with celery root puree was outstanding as well. Mixing it with celery root gave it a very fresh taste. The squid was bite size which is perfect. \n\n- margherita pizza - I was mildly disappointed at this. First, the sauce was too watery, so picking it up with my hand would make the sauce drip too much onto my plate, I ended up eating with fork and knife. Second, the tomato sauce was slightly too acidic, which could be advantageous for a pasta, but for this small pizza it didn't balance that well. Third, the pizza dough was too charred, making it a bit bitter. \n\n- pot de crème - got this for dessert, it was mediocre, a bit too much salt on the top, could use a little bit of fruit like berries to make it more interesting. \n\nOverall, we enjoyed our meal, but felt the pizza was not as good as we thought. I guess once you go from a truck to a restaurant, it becomes a more serious race. I hope they can pick up the game and I look forward to going back again.", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Delish!  It's Sunday around 6:30 ish and was seated right away!  margherita di bufala was amazing!  \n\nNo wait - yay\nAttentive service - yes\nDelicious food - duh\nChill ambience - yes", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "Ordered two pizzas, smallest 4 slices (each pizza) I've ever seen and paid 46 dollars.", "author": "Lin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "As others have mentioned before me, the crust is everything. I am definitely a 1 st class pizza lover.  I can eat an entire dinner and walk by a pizza joint and ogle the slices on someones plate. You can never have enough pizza and SF has some mighty fine options. I've missed eating here on a few previous trips, so tonight was the night! \nThe restaurant is fairly typical of many casual upscale restaurants in SF and I guess in general. The lighting it nice, a lot of hard surfaces so pretty loud when it's full. The service was exceptional. Here's the run down on what we had.\n\n -Fried Green Tomatoes, were delish,not too breaded, not too oily. Very flavorful. Great Olive    oil. \n-Crispy Broccoli was a standout, so good and ,well, crispy. The flavors were really interesting,mint,tumaric,cashew and had that indescribable charred flavor that's just so dang good. \n-Meatballs in sauce were extremely tender and tasty, the sauce was nicely balanced.\n-Pizza,Margherita De Bufala was really good, not outstanding. Sorry. I don't know if we just picked a meh pizza? and I will say this style of pie is not MY personal favorite, but everyone else seemed to really like it. The the charred crust was awesome,however, slightly salty, nice. \n\nI don't know what possessed us but we had dessert!\n   Rice pudding, rich but not too sweet, and chocolate Pot de Creme, which was super rich like eating fudge, all you need is a spoonful.\n\nThe highlight,absolute best was the bottle of wine my daughter recommended;  BROC cellars Cab Franc COUCOU. OMG SO good, I ran right to their website to find out were i can buy it. Actually a great price on the bottle.\n\nThe price over all was what I would expect for the quality and service (outstanding), but not inexpensive. But if you've read my reviews, I have little tolerance for people complaining about price.", "author": "Ann K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I LOVE the pizza here...it is some of my favorite in SF.  Also, do not ignore the small plates...they are super good!  The ambiance here is a plus!  Super cool and hip.  I threw my boyfriend a big group birthday dinner here too with about 15 people and they made the planning a breeze - super responsive and really accommodating to those with dietary restrictions.  The prix fixe was an amazing deal as well - everyone was happy and full, even including the big hungry men! No cocktails but the beer and wine selection is great.", "author": "Bryce D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "I enjoyed my appetizers, the cured olives were delicious as was our salad and the short ribs with crispy brussels sprouts.  However, while the flavors of our pizzas were good, the dough was raw in the middle. (Mary Berry wouldn't be amused!)  The Bianca in particular  has a totally soggy middle due to the olive olive and cheese leaking moisture.  I had much better white pizzas in Italy. The staff were friendly and the space is tasteful and modern.  Maybe it was an off night?", "author": "Gisela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "from naples wood burning oven truck to brick and mortar.  went for the two meat pizzas at the bottom.  if you the like the soft chewy dough, this one stands out for it's slightly tangy crust but can also turn out slightly more on the doughy side for my liking.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Awesome Pizza and really cozy surroundings. The building is a little unassuming and you will miss it if you blink. The pizza is definitely a good not great but really,really close. \n\nWe tried the Roasted Cauliflower for starters, which was really delicious and had good mix of flavors. There seemed to be these little citrus gems that were the size of raisin which really accented the dish well.\nOur pizzas were The Margarita and the Maragarita w/Sausage. The dough was great and airy with the right amount bubbly-ness to it! One downfall is the crust is a little doughy, so if you don't like that kind of pie (like myself) you may not be as pleased. I enjoyed the cheese, and the sauce was a bit absent from our pizzas but it still was faintly present in the bites.  In all we were happy we went and GREAT SERVICE in our Waitress!!! Cannot thank her enough she really made the difference as we were traveling all -day and just wanted some GOOD FOOD!\n\nThank you for a wonderful end to our day.", "author": "J. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "A fine wood fired pizza spot. Upper casual for sure. But easily under $100 for a date night. I can not eat pizza (celiac) but they whip up some mean smalls that are always in rotation seasonally. Can't wait for carpaccio o come back this fall! Counter seats are my favorite for entertainment value and reservations are a must.", "author": "Ian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-25", "description": "The place is a cool spot, what I didn't like was if they're charging $17 for a pizza they better give me a pizza that I can enjoy, I love pizza and I know pizza they make their crust huge so they can probably put less toppings on, and the pizza is so thing it just melts in ur mouth and u get to the huge crus that doesn't taste like nothing but somewhat of an uncooked dough. \nDrinks: they don't have enough selection you don't have full bar I get it have some more wine selections with decent prices and so\nE more beer selection.\nThe service was about 4 star although the person that greeted us made it feel like a huge deal that we didn't have reservation for and told us it'll be 20 minutes wait then they got us seated in 5 min", "author": "Artin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Great ambience. Great food. Great service. Loved this place for a Friday night pizza fix. They played Kendrick Lamar in the background. The decor was cool and clean and I loved watching the pizza oven.", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "I've had Del Popolo a couple of times and LOVE their pizza. I finally went to the brick and mortar back in early/mid March. We got a seat at the counter, which to me, seem to be the best place to sit. We started off with the Crispy Polenta and the mussels. Both were really good, but we should have asked for bread to soak up the broth from the mussels. I also got a glass of the Landron \"Potion Mama\", which I feel I need a bottle of this at home at all times. As for pizza, we got the sausage, which was great. I think getting two small plates and pizza was plenty of food for the both of us. We each finished off our meal with a glass of cardamaro.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-11", "description": "This rating is based on the service, not the food itself (which was delicious). I had a reservation at 6pm, but was running late and called to let the restaurant know- they said no problem and asked when I would be able to get there. I said 6:15 and arrived around then. We were seated and ordered right away, although the waiter seemed very disinterested as soon as we said we didn't want wine.\n\nWe ordered two pizzas, a dessert and coffee. While we were still having dessert around 7:30 the waiter gave us our check saying \"no rush\". We paid immediately and waited for the waiter to pick up the cards. We got our check back while we were still having dessert and at that point the host came up to us and said, \"I hate to be the one to do this, but you have to leave for the next guests\". Both my friend and I were pretty shocked and disappointed to hear this, but got up to leave right away. \n\n4* food, 1* service.", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-09", "description": "Overrated.  I was really looking forward to this pizza after seeing the great reviews and photos.  Ordered the margherita TO GO due to the hour and a half wait.  Paid nearly $30 for one pizza including an extra $2.50 \"takeout\" charge (???) and the pizza was suuuuuper tiny.  \nPros - it was made quickly and ingredients tasted fresh.\nHowever, I did not feel this was a good value for the price.", "author": "Ann-Marie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "Not a bad environment but it gives you false hope for some fantastic pizza experience you are more likely to get somewhere else, and probably at a cheaper price. Unfortunately, the taste of pizza did not impress neither me nor 3 of my friends. At a place like San Francisco where there's plenty of choices this restaurant would not be on my list.", "author": "Halyna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "Got to the restaurant at 525 before they opened at 530 pm.   Was excited to see there wasn't a huge line because I didn't make a reservation.  I've been here before and it wasn't an issue. We got in and asked to sit at the bar because there were 5 spots open.  There were many communal tables open and a lot empty tables overall.  I was waiting for the hostess to seat us and was shocked to hear her say it would be a 45 minute wait! Seriously?  There's no one here!  Not good business.  I live a block away from this place!  We ended up going to Uncle Vito's down the street.", "author": "Buddy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-22", "description": "I eat out a lot. I mean a lot. Naturally, I go and eat at pizza joints all the time - both for dinner and those late nights. With that being said, I can't say I totally understand the obsession with Del Popolo. The favorite pizza places for late nights are obviously Golden Boy in North Beach or even Arinell's in the mission. \n\nBut what about a proper sit down venue that specializes in pizza? I've had The Pizza Shop on 24th which is amazing, but it is more casual. Del Popolo's (formerly a food truck) is the apparent answer to what we've all been looking for. Modern, dim lit, great for a fancy preparty and of course, a restaurant made for dates. With all these initial positives, I can't say that I'm impressed with the pizza. The dough isn't special and the salami add-on is really just a code name for pepperoni. The wine selection is great and very reasonable, but if I want a true simple pizza eating experience, I am simply off to The Pizza Shop!", "author": "Ray W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "What. Just. Happened.\nThis was hands down the best pizza I have ever eaten. Their House Made Sausage is exceptional and their attention to detail is unmatched by any other in San Francisco. I have visited Del Popolo a few times over the last few months and each time was better than the last. I finally had to let everyone know how phenomenal their restaurant is. The small plates are great, wine list is simple and inviting (with even wine's on tap), and their wait staff is always friendly and attentive. \nIf you are looking for a massive 18\" pizza made with low grade ingrediates just so you feel \"full\" afterwards, this isn't your place. What you will get is the highest quality ingredients packed into the most flavorful pizza of your life on a 10\" and it leaves room for desert - which I also recommend.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-30", "description": "The pizzas were burnt and the service terrible. Never going back there again. The wine was bitter. The choose of pizza pretty small and if you're gluten free just forget about this place. There are olives for you and that's pretty much it.", "author": "Leo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "In town for two night and eating this pizza for two nights in a row.  It's that good\n\nThe staff is excellent , friendly and efficient \n\nThe pizza a happy sourdough tasting crust with perfect fresh ingredients \n\nThe cooks toss it in front of you and then.......wala.....into the oven for a few minutes and then on your table", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Had to try to place after seeing an episode on best food trucks in the nation on food network. I went to the restaurant because the food truck wasn't open. It was great. I had the margherita pizza and added Italian Sausage to it, yummy! I also met 2 lovely sisters, who are also twins, and we all share the same birthday. What an awesome coincidence! Great food, and great people! Too bad I live in NC, otherwise I would be back next week...", "author": "Annamarie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "We had to wait for like 35 min. just to be seated, then the service was slow as heck. I was so thirsty and just wanted a water refill but the lady kept passing me up over and over again.\n\nFinally we get a chance to order after 20 minutes and the pizza takes forever.  My friends and I were really excited about the reviews on this place, but the service experience has us soured. Once the pizzas get to our table I was not impressed. In my humble opinion the dough was \"burnt\" as I guess it's flash baked or some sort of nonsense like that. My friends seemed to like it but this place to me was all hype. Big flashy pizza oven and fancy fancy ideas with charred dough.\n\nI've had better pizza in a bunch of other pizza joints, and will not be returning here. Too long a wait and the pizza is just not that special enough. Too bad. Wanted to like this place.", "author": "Pavle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Small place, when I arrived got seated at bar. Not my first choice and not terribly comfortable but they really have no small tables except outside and it was too cold for that. I did get a good view of the pizza being made. \n\nThey were accommodating enough to offer a half-sized salad (the kale salad). Reflected on changing fashion in food. There was a time, a few years ago, when kale was overboiled smelly greens that no one would order in a restaurant. Anne Frank in her diary wrote with despair over having to eat \"that muck\". Now of course raw kale salads and variations on sauteed kale are everywhere. Perhaps the vegetable has been improved over the years!\n\nBack to business. A lot of choices looked good, got the broccoli/sausage. The sausage was crumbled & mixed with a sauce, not slices. The pizza looked big but I easily ate it all. I think the thin crust makes a difference, with thick crust the bread fills people up. Also, it was REALLY good. The crust, topping, added just a few red pepper flakes. Server recommended a white wine I am not familiar with but liked. \n\nDessert was ice cream or panna cotta. I'd had ice cream at lunch so got the panna cotta and it was good. A nice light cool counterpoint to hot spicy pizza.\n\nNot sure, though, about returning. Maybe if I have dinner with someone who likes pizza. I normally think of pizza as lunch food and they don't serve lunch. Maybe in summer when I can nab an outdoor table. Because there are other pizzas I'd like to try.", "author": "Carol S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Best pizza I've ever had. Their crust is perfection. Definitely try this place if you're a wood fired pizza fan.", "author": "Clive B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-28", "description": "We were staying nearby and came down for a pizza to go.  It was terrible.  We watched the guy make it and put it in the oven, then take it out less than a minute later.  Like another reviewer stated the dough wasn't cooked and the cheese was just beginning to melt\n it was a doggy mess.  The cook? Did, however make a nice show of spinning the peel as if he was a maestro.   He wasn't", "author": "Jerry I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Crust on a pizza is EVERYTHING!!  I saw a late show at the Memorial and it got out late. They happily sat us at 10:30 pm Thank you we were starving , we ordered 3 pizzas and they were DELICIOUS. I loved the roasted broccoli as well and their signature sour drink was great. Great decor!! Cozy wood tables and excellent service!", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "Really enjoyed my pizza last night. Made in a flash, just a few toppings (traditional, not overloaded mush), light, slightly salted soft crust edge and the delight of wood fired flavour. Recommended. Tip: they generally operate on walk ins but it does fill quickly. So choose between 530-6pm or after 9pm for optimal chance for a seat. Not suitable for large groups.\n\n2nd visit the day after. Had the squid starter and then another kick arse pizza,  with a couple of Barberas for good measure. Stuffed. Tim is my all time fave waiter. \n\nCan hardly believe, with a full house less than 45 mins after opening - every night it seems - this joint has only been open a matter of months. The votes are in and have been counted. This place officially rocks.", "author": "Just A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "This is an interesting Place that serves pizza. We started with a crispy broccoli salad. It has cashew, current, turmeric, and mint. This dish was WAY too salty. I couldn't finish my portion ( shared with a friend). The positive thing I can say was the mint gave a nice flavor in a few bites I took. The currents helped to balance the saltiness. I had to search the plate for them! We then had the Charred Savoy Cabbage- braised pork, horseradish and pickled mustard. This dish was fair. The horseradish and mustard along with the cabbage are a nice combination. They go well together! My friend ordered the Wild Nettles pizza, but they were out of it so he went with a mushroom pizza (shiitake) and Fontina cheese. This pizza was very interesting. I wouldn't order it again, but you can always try something once. I ordered the salami picante with added sausage. It was a good pizza. It had some sweet peppers and a spiciness to it. I enjoy spice so I enjoyed it. The pizza dough in this place seemed to have a sour dough taste to me. We also preferred wine. This list was not extensive and their selection was not that great. This place may just be too unique for me and my pizza taste- I prefer the good ol' Chicago, New York, or pizza off the streets of Rome type of pizza! Dessert - I almost forgot! We had this chocolate creme. If you love 85% cacao you will like this. It is not sweet and has that bitterness of pure cacao. We had ice cream as well. The ice cream was excellent! Creamy and flavorful butter pecan.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Had a great NYE meal, delicious champagne and a great time sitting at the pizza bar chatting with the folks coming and going. Plus the celebratory sabering (and free drink) was a huge win for me! Customer service was on point.", "author": "Allison H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Nice trendy pizza night spot. They even accommodated our toddler on New Year's Eve. \n\nThis is more of a romantic, sexy environment though. Would have to come back on date night.", "author": "C N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-09", "description": "I haven't written a review in ages, but felt it was warranted after last night's meal.  My friend and I ordered a pizza and a salad for take-out.  I understand why the pizza took a while, given that they can only cook so many at a time in their oven.  However, I was dismayed to spend $40 on this meal, particularly since the entire pizza was 4 slices.  Moreover, the crust had little flavor aside from being burnt and it was mostly sauce with sparse specks of mozzarella and one miniature torn piece of basil.  The salad was flavorless (despite having a \"charred onion dressing).  Most infuriating, however, is that upon closer review of my receipt, I was assessed a \"to-go gratuity,\" which appears to have been approximately 10% of the total.  I have never heard of this before and actually wonder if it's legal.  Gratuity anywhere is optional, aside from the places that state up front that it is included in the final bill.  We felt swindled and mislead and, thankfully, Neopolitan pizzas are the new trend and there are SO many alternative places in SF.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "If life finds me in San Francisco again,  I will make my way back here to eat again!\n\nThe pizzas we were told were light and a kid could eat one alone,  not so much.  I barely finished two pieces after eating the peach appetizer.\n\nOur server, Sarah, was super nice and recommended the Bianca pizza- which was delicious.\n\nMy favorite thing had to have been the grilled peaches appetizer with goat cheese.  If I could only eat that-  I would do it!\n\nWe washed everything down with a Oaktown Brown Ale and a Cane Cola-  both were great", "author": "Brittany R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "The food is good. Try the mushrooms! The staff is really nice and quick. Prices are a little high", "author": "Brian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "It was my third Italian (authentic) pizzeria I have tried. I got the \"Broccoli di Ciccio\" it was a pizza with Broccolini, Onion, & a Spicy Calabrian Sausage (reminded me of chorizo). It was good but not great. It was not the spice level I expected. It had a good ambiance but the wait especially at a late time was crazy. Small seating area on the inside. If you are looking for more authentic pizza go for Il Casaro in Northbeach, now thats BOMB.", "author": "Arturo D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "This place would have gotten 5 stars but the wait & service was just horrible. I had gone on a Saturday with the preparation that I would wait about an hour! The greeter was welcoming and took my number so she could text me when our table was ready (3 people).. Cool so the wait was to be no more then an hour. \n\nNow the frustrating part!\n\nWe received our text, a table was set for us three girls and as we were walking back just 2 blocks away.. I receive another message saying \"never mind another party came\" ummmmm in what way is that professional? We had to wait another 45 minutes!!!! It was just an horrible experience, though the food was just amazing.. Pricey but amazing. I'd \n\nI'd try this place again but only with a reservation.. sadly!", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "Regular pizza, meh experience. We get there with no reservation (resy did not give any option until the day after). We have to kill 45 mins to be seated, go to the bar next door, we grab a glass and the time we start drinking it, a text warns us the table is ready. We get there after we quickly finish our glass, and we find a table to share with other people. I am disappointed and ask to be seated somewhere else. All empty tables are reserved (didn't we reserve too?) so we will need to wait more for a \"private\" regular table. Never mind. We seat and order a bottle of wine, two pizzas, one dessert. I ask the waiter if the owner is Italian, he barely replies (No!), and leaves. The bill is delivered with a $80 charge for dessert (thanks god I suggested my bf to check the bill before handling the credit card). My bf nicely tells him the bill is wrong, the guy apologizes, and comes back with the right amount. \nThey get our coats at the entrance but we need to figure out ourselves where to find them when we are ready to leave. \nI am totally unimpressed by pizza wine and service. They may have thought we were tourists. Since we were not, I am not sure I'll come back.", "author": "Serena P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "This is the third time writing this review because Del Popolo is afraid of the truth. I will post everyday because we live in a free world. The Yelp community should be a truthful environment to share your experiences with fellow foodies; weather it be good or bad. And my experience here was beyond appalling. The general manger and the owner don't know how to run a business and don't understand the concept of good customer service. This establishment is horrible and the food is mediocre. Please don't support them! From management to service, everything is one star. Please save your time and money! BEWARE!", "author": "Mimi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Excellent food and service!  Everything we tried was yummy.  Chewy crust!  The appetizers were spot in as well:).", "author": "L W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "Well, the pizza was amazing so that's why 3 stars. I observed the girl pizza maker touching her hair, her face, her phone, then eat,  then touch the pizza ingredients with no gloves. This was very disheartening because I had a hair in my first pizza. The waitress was very apologetic, made sure I was okay and brought me another pizza. She was the greatest part of this experience. They really should wear gloves and hair nets when making pizza or learn how not to touch other things or have their hair fall into the food. Great tasting food though. Crust was awesome. I will say I have no idea whose actual hair was in my pizza but this is what I observed after our dinner so I thought I'd pass it along.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "No bad jokes necessary to receive a pie to the face. Just a healthy set of pipes cause their wood-fired pizzas will make you sing Mamma Mía after each bite. My marinara and mushroom pizza winked at me when it arrived. It was so damn hot, I had to calm my nerves with their house red. The combination between the two was flirtatious. The atmosphere set the mood and temptation was all I knew. But there wasn't enough room in my heart for dessert, until next time chocolate pot de creme.", "author": "Ultimate Cheezburgz .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-14", "description": "YIKES. This place is so ridiculous. The food is good but overall it's overpriced and the people are tough. Their focus is not on customer service, all they want to do is cram as many people as possible and turn the tables as quickly as possible. Totally irrational management. Not a recommendation.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "I wanted to make a reservation on Resy for Del Popolo for a Friday night and unfortunately - none available. So I decided to make it out there and see how long the wait would be. Approximately 45 minutes - not bad, but not great either when I was hungry. 45 minutes later, we walked back in and no table? The hostess explained why and it wasn't a big deal. We waited a few more minutes and were able to sit at the bar. \n\nFew things, I do love bar seating especially if they cook fright in front of you. This place they have the bar around the pizza oven so I loved seeing the people making the pizza and putting it into the oven and coming back out.\n\nWe ended up ordering the sausage pizza (crushed tomato, mozzarella, red onion, chili). This one was so good. We also got the margherita (crushed tomato, mozzarella, basil) as well because we needed to know how it would be. Enjoyed the sausage pizza more, but the margherita is a good vegetarian one. \n\nWe also ordered the chocolate pot de creme. It came with whipped cream and a bit of sea salt on top. It was just slightly too much salt but good! \n\nProtip: sausage pizza!", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Del Popolo is a wonderful addition to the neighborhood. I've been there twice: once with a large group, and once for date night. The space is beautiful, with the pizza oven as the focal point of the dining room. The decor is minimal but clean, and they have fun artwork on the wall. \n\nThe first time we went, there were about 8 of us, and were told the wait was going to be about an hour. We went across the street and had a few beers while we waited. When we got sat we were told about an all-you-can-eat option; everyone at the table pays a set amount and you get a certain number of appetizers and then all-you-can-eat pizza (you get to choose three different pizzas, I believe). I'm not sure if this still exists, as I didn't see it on the menu the last time I was there, BUT it was a total crowd pleaser. We love the family style aspect of it, and that we didn't have to fight over slices; the pizza just kept coming! We tried the margherita (classically simple and tasty), the butterball potato (surprisingly full of flavor), and the anchovy (loved the ricotta + anchovy flavors). \n\nThe last time I ate at Del Popolo, it was just me and my husband. We didn't have a reservation, so we showed up right when they opened and hoped for the best. Thankfully, there was a table available and we were sat immediately. They have a well-curated beer and wine list, and the servers are more than happy to give recommendations. We ordered the cauliflower au poivre with roasted winter greens, and the manila clams with braised fennel, caper butter & croutons. These two dishes blew me away! The cauliflower's creamy cheese sauce was extra decadent and the veggies were perfectly cooked. The mussel broth was so flavorful, I could have drank it straight from the bowl. Our server recommended we save some of the broth so that we could dip the pizza crust into it, which was a fantastic idea. The mussels were super fresh (not a single bad one!). Honestly, I would come back just to eat these two dishes. We also ordered the margherita di bufala and house made sausage pizzas. The dough/crust is fluffy and chewy (my favorite pizza texture) and isn't super floppy. The sausage pizza definitely had a good kick of flavor, but the margherita pizza was a bit flat. I'm a bit of a baby when it comes to blackened crust, and would have preferred the pizza to be less burnt. \n\nWe decided to treat ourselves and ordered the pot de creme and two glasses of port. The dessert was complete chocolate decadence and a great way to end the evening. I'm so happy this spot is in the neighborhood and I plan on spending many futures evening wining and dining people at Del Popolo.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Overall the food and wine were enjoyable. Standard Brick / fire oven pizza. The pizzas are not very big, I would recommend ordering one per person or a few for the table and a few appetizers.  The appetizers were good but really small, we ordered the wedge salad and it was big enough for one person.  Definite make  reservations ahead of time, it is a must here.", "author": "Mandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Popped in here for an early dinner after finishing a fun filled and tiring day at the Color Factory. Placed a resy on resy for 5ppl at 5:30 when they opened and there were already 4 parties in front of us as we got to the door. Looking at the menu it is one page, short and sweet. you have different pies to choose from and appetizers. We started with the trumpet mushroom, new potatoes, and burrata w/ grilled grapes. All were amazing and we ordered another round of the trumpet mushrooms. I need that recipe, or find out how to make it at home I am craving it now. It had some sort of eggplant? puree under the seared mushrooms and a garlicky green sauce (maybe chimichurri?) anyways I would go back for mushroom on everything. As for the pizzas we got the bianca, sausage, & cherry tomatoes. My favorites were the cherry tomatoe with pancetta and the bianca. Then they had McConnell's ice cream (from SoCal) so good and the pote de creme dark chocolate so good", "author": "Jenelle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Delicious wood fired pizzas in a quaint space with a European setting. You can see your pizzas being made ! The place gets packed pretty quickly so plan to wait before you get a table. Theres a huge communal table which is cool. They also have a good selection of wines.", "author": "Reema B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "3.5 stars.\n\nTrendy pizza joint with long waits. Make a reservation in advance if you have a party of 4 or more. Seating is pretty limited with a few small tables and 2 larger community tables in the middle. The large oven is the centerpiece here.\n\nAfter hearing so many good things about the pizza, we ended up not being that impressed with the pizza but instead with the small plates.\n\nSMALL PLATES\nMusk melon salad ($13)- proscuitto with fresh and sweet melons and finished with creme fraiche and roasted peppers. A great pairing of sweet and savory flavors. The dish was pretty small, but so delicious.\nFarrotto ($14)- farro risotto with wild mushrooms, sweet corn, proscuitto, and raw egg yolk. Modern take on risotto and loved the addition of the egg, which reminded me of tartare.\n\nPIZZA\nBianca ($15)- mozzarella, ricotta, basil, garlic. Server said the staff favorite by far is the bianca with added sausage. I found this one to be pretty plain.\nButterball potato ($18)- potato, leeks, fontina, hot honey. Sounded more delicious than it actually was. All you end up tasting is potato, cheese, crust, and some honey. The leeks didn't have a chance to shine through, and it just felt kind of boring.\nOverall- the pizza crust is chewy, kind of like naan, but the toppings were really limited, so I felt like it was mostly cheese and crust.\n\nStandard portions would be a pizza per person plus 2-3 small plates to share, which adds up pretty quickly. We weren't terribly hungry and found 2 small plates and 2 pizzas enough for 4 people.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Best pizza in town! Real Italian pizza!\nI will definitely be back soon!\nThe service was also very good!", "author": "Gloria S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-03", "description": "Our second \"experience\" at Del Popolo.  The first was first class.  Great food...great service...great vibe.  Our second (tonight) 8/2 was the opposite.\n\nWe had a 5:45 reservation.  Were seated at as nice banquet table.  We could not hear each other talking!  The wait person was VERY busy and after ~10 minutes we left.\n\nI do not understand the appeal of restaurants that encourage/allow such rowdy talking (shouting).  I'm afraid it has become too frequent as evidenced by the Bell  and Bomb ratings given to restaurants.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-21", "description": "I have had Neapolitan style pizza before and was expecting to receive the same quality here. The crust was flavored with bitter scorched blackening, with less than satisfying toppings. Overall I was not impressed with the quality or flavor of the food for the price.", "author": "Courtney H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "Loved this restaurant! Came here with a friend and her mom and was very satisfied with the meal. We all shared a bottle of red, ordered about 4 different apps to share, as well as a margarita pizza with buffalo mozzarella. The pizza was amazing and the service was great! There was a bit of a wait once we put our names in, but they showed us to the back of the restaurant where we could wait and order some drinks. We sat at the community table and were perfectly content there.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "Overall, not quite to my expectation, especially the pizza.\nWe ordered two appetizers and both were pretty good. Not so much for the pizza though. It's burnt and tasted bitter. We didn't finish it. Also we waited ages after finishing the appetizers before the pizza came. It was SLOW, and the night wasn't that busy. Service was ok.", "author": "Jiaqi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Best pizza I've had in SF to date. Awesome interior, killer food, and super great value. Told us 1.5 hour wait but was 40 ish minutes.", "author": "Jane V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Last night I went to Del Popolo for the first time and thoroughly enjoyed it. I love pizza and they do a great job. The crust is unreal. I also love their tomato sauce. The reason I'm not giving it 5 stars is it is a bit pricey for pizza and the service. Our server was super friendly. But the woman who dropped off our pizza wasn't. We saw our pizzas and were trying to move dishes aside. My boyfriend made a comment about how she could put the pizzas anywhere. And she sassily said \"I know. When you make room.\" Granted we were in the midst of moving plates out of the way for her. It left a bitter taste in my mouth. \n\n$92 without tip for two people. Had a salad, glass of wine each, and two pizzas. \n\nDefinitely will be back again.", "author": "Gabrielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Not Sure Why I Had Not Discovered This Gem Before\n\nSince a group of six of my friends were attending a performance at The Masonic Auditorium on Nob Hill, we were looking for something close by that was reasonably priced and not a hotel restaurant. I came upon Del Popolo, which is on Bush Street, near Taylor Street, in San Francisco. What a find! \n\nWe arrived a few minutes early for our 6pm reservation, and we were graciously greeted by the friendly staff, who seated us promptly. The atmosphere is \"industrial chic\" with modern touches and an open kitchen, where diners could watch the experts flip and stretch the pizza dough, readying it for the wood-fried oven.\n\nWith six of us, we were able to try a couple of appetizers, three different pizzas, and three desserts. One member of our group wanted to have the roasted cauliflower as one of our starters, which sounded \"just OK\" on the menu, but turned out to be mouth-wateringly flavorful. There was a smoky flavor to the cauliflower itself, and the sauce was delicious. We also shared a couple of orders of the special appetizer of the evening, pork-and-veal meatballs (if I'm remembering the ingredients correctly) with a smoky, slightly spicy tomato sauce. The chef had elevated the flavor from ordinary meatball to a taste extravaganza, to the point that one of our group jokingly threatened to lick the bowl, just to get all the sauce (for the record, he used a tablespoon).\n\nWe had three pizzas: margherita di bufala (crushed tomatoes, mozzarella di bufala, and basil); butterball potato (thinly sliced potatoes, leeks, fontina cheese, and a dash of chili flakes); and house-made sausage (sausage, crushed tomatoes, mozzarella cheese, peppers, and onion). The chef had sliced the pizzas into six portions, so that each of us got to enjoy two slices of all three pizzas. First of all, the pizza crust, is soft and chewy, but still with just the right amount of crunch. All three pizzas were amazing, but I really enjoyed the potato one, personally.\n\nFor dessert, the server (who was professional, friendly, and knowledgeable, by the way) suggested the house-made panattone. Deducing that we all were thinking about those horribly dry, boxed panattone cakes sold in grocery stores, she said something to the extent of, \"Our panattone is nothing like the ones that have been on the store shelves for ages. It's moist and filled with fruit.\" She, the server, that is, had not led us wrong the whole evening, so we ordered a full panettone loaf for the table, as well as two portions of chocolate pot de crème with sea salt and an order of butter-pecan ice cream. \n\nWe had started the evening with a Cabernet Franc (from the Sebastien David Winery), which was much lighter and more acidic than we had expected. A second server then came by to inquire on what flavor profiles we most liked in red wines, and he offered two suggestions, but freely quotes the prices ... and he was not pushing for the more expensive wine, which we appreciated. \n\nAll six of us were nothing short of delighted with the food, service, and atmosphere of Del Popolo. We will definitely be going back there frequently.", "author": "Rich W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "It was great walking into Del Popolo.  Surrounded by a horseshoe bar is the restaurant's centerpiece:  a large, wood-fired and free-standing pizza oven.  And behind the oven is a floor-to-ceiling stack of wood, used to fire it.  The service was great, with a warm, intimate atmosphere.\n\nI wanted to mention two things, however, that make this place not like most other pizza restaurants.\n\nOne is that it's pretty expensive.  I'm not saying it's not worth it, because the ingredients and toppings are high in quality, and very fresh and very flavorful.  But if you get two individual pizzas, share an appetizer, and have one or two glasses of wine, your pre-tip total can easily reach $70 for two people.  If you regard pizza as an affordable, casual meal, this may not be your place.\n\nThe other thing is Del Popolo's crust, which is quite different.  Due to the lower heat of a wood-fired oven, and the very quick baking times used, our crusts were very soft, chewy, and even somewhat wet inside - while at the same time being slightly charred on the outside.  This seems to be DP's style, and it's intentional.  If your tastes tend towards a crisper, drier, less chewy crust (as do mine), this style crust may not be for you, either.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Margarita was airy and fresh. Red wine on tap too light for me but the cabernet franc was rosy and perfect. Would like to come back and try the non pizza dishes. No crispy broccoli was on the menu. Service was friendly and prompt. Solid after work spot. Bit expensive for the wine.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "Came here with a few girl friends on a Thursday evening at around 8PM, and they were bustling! There can be a wait, so make sure to make a reservation! The nice thing was that they gave us some cheesy bread sample pizza slices while waited. I appreciated that as I was starving! \n\nWe tried several pizzas, but I really liked the pizza with potato and hot honey. It worked surprisingly well, and was so tasty! I was really surprised. Between 5 people, we shared 2 appetizers and 3 pizzas. I'd say it was a little on the light side, but everything tasted amazing.", "author": "Cynthia X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Ya I am very sure this is great first date spot or even a night to hangout and just chill \n\nThey got good wine selection and I had to buy the whole bottle (Gamay). Smooth texture that went well with the margarita pizza.\n\nOf course, when you go at closing time , the service is prompt just so they get you What'you want and then close.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "Their brick and mortar location on Bush has a great lively atmosphere, great service and most importantly really tasty pizza. That pizza oven on full display behind the bar is a great showpiece but does a fantastic job creating wood-fired pizza. The Sausage, Asparagus and Margherita di Buffula were my favorite with a perfectly doughy crust. The potato / honey pizza was interesting but not ultimately my favorite. \n\nApparently they over a pretty easy to go option but also sell wine of their menu for 50% off menu price to go...thats pretty cool.\n\nWill be back!", "author": "Derek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "I went to Del Popolo before a show. Service was friendly and thoughtful.  The menu and wine selection was great. They made sure we were served in time  to make our show.  We had pizza and a grilled fruit appetizer. The grilled fruit was amazing. The pizzas had good flavor but the crust was soggy. Soggy crust is the only reason for 3 stars...For me I like a crispy thin crust.  I would go back there again because I'm optomistic they can do better! Maybe they rushed our pizzas to keep our timeline.  Atmosphere was lively but comfortable.   Note, this place isn't cheap.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "I live in the neighborhood and I watched the extremely slow construction process to convert the space from a theater. I believe it went on for over a year. So, I was surprised to walk by one evening and see that it was finally open and had become a restaurant. After a couple of failed attempts, we finally got around to checking this place out. It almost didn't happen though as we were confronted by an initial wait time of 1.5 hours. We were both starving, but, eager to check off Del Popolo, we decided to grab a snack elsewhere and endure the wait. Luckily, the wait time wasn't that long due to a cancellation.\n\nMost of the seating is at communal tables but we got a spot at the bar and a close up view of the food being prepared. I immediately took note of the wood stack that serves as backdrop for the oven. I also quickly became keenly aware of the lack of space at the counter (and in the dining area in general). It doesn't really take away from the dining experience but the staff often had to squeeze by each other while moving around. \n\nSpeaking of the staff, our server was extremely kind, helpful and enthusiastic. My girlfriend loved the wine he recommended. I also enjoyed the glass of Syrah I ordered. It seems that the wine options are provided courtesy of Ordinaire in Oakland. As for the food, we got the Margherita and Winter Squash pizzas: they were delicious. We both agreed that the Margherita was the best. Next time we're going to try the House Made Sausage pizza. It looks quite tasty as well.", "author": "Rodney G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Chewy and blustery crispy crust with the perfectly balanced tomato sauce and buffalo mozzarella. I don't bother with getting seated because it only takes 10 mins for togo orders but if you must then get there early and learn some sign language to talk with your friends. This place is packed and super loud with patrons talking over each other.", "author": "Taffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "This is probably one of the best pizza places I've been to!The crust and the ingredients used on the pizzas were phenomenal. We ordered the salami piccante and the margherita di bufala pizzas as well as cauliflower and beef tongue for appetizers. I'm not usually a beef tongue person but it was delicious. Definitely try to make reservations ahead of time. However, if you end up having to wait, there are a couple of great bars around the restaurant you can get a drink at before dinner.", "author": "Lucy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "After reading about Del Popolo for awhile, I was excited that they had opened a B&M.\n\nThe wait was pretty long, but drinks at Stookey's (less than a block away) helped pass the time.\n\nWe were a group of 3, and we all ordered different pizzas, and a few apps.\n(We had leftovers.)\n\nEverything was good, but given the competition for this style of pizza, it wasn't as amazing as I had hoped.\n\nService was pleasant , food came out at a good pace, and prices were comparable to similar style spots.\n\nHonestly, there's just so many similar places, we can afford to be much more picky.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "I love Neapolitan pizza. There's something about the doughy, slightly burnt crust that just hits the spot. So, Del Popolo makes REALLY good Neapolitan pizza. Two girlfriends and I came here last night and split two pizzas (Margherita and winter squash) and brussels sprouts. \n\nWe all agreed the winter squash pizza was BOMB. The slightly spicy bacon and squash and rosemary made for such an interesting combination that worked well. The Margherita was a bit watery, but still very tasty.\n\nAnd I know the toppings are important but the crust was everything.\n\nSo far, Del Popolo has my favorite pizza in SF. (I've only been here for a month, but still.)\n\nThe restaurant itself is quite spacious, but it was already packed by 6:30pm on a weekday. You can only make reservations for groups 4 and up. We had to wait about 15 minutes for a table, but it wasn't a big deal.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "The good: the first courses were actually really awesome. Shockingly good. And the ambiance is nice (despite very tight seating)\nThe meh: I really am not a fan of the pizza. But my date was more positive than I was. She thought it was ok, but I honestly would never order it again. \nThe bad: service. Yikes. And the wines. Not a good wine list (at least by the glass). \n\nI was so impressed by the starters that I'm going three stars.", "author": "Amjad S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Limited menu but that's not a bad thing. You're here for the pizza! Staff is friendly, place is nice and clean. With that said, the pizza is _ok_. Not bad by any means, but nothing to write home about. Many better pizza spots around sf.", "author": "Bassam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Delicious pizza.  Classic Neapolitan style with excellent chewy crust.  We ordered 2 pizzas and they came out super fast.  The home made sausage on the sausage pizza was great!  The pizza had a good amount of kick to it because of the gypsy peppers.  We ordered a bottle of the wine they have on tap and it was just ok.  Overall though, I would recommend this place - great atmosphere and pizza.", "author": "Heather C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Food was amazing, servers very knowledgeable and friendly with recommendations for drinks, starters, and mains.", "author": "Dan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Just ate here for the first time and it was great.  The servers were attentive without be obtrusive.  We had 4 different pizzas, all delicious, but the best was the cherry tomato.\nVery fresh and tasty.  We had 4 of the starters and they were the stars.  Olives, both mushroom offerings & the cauliflower.  Husband doesn't usually like cauliflower but loved it here.\nNice wine selections by the glass or bottle.\nWe will definitely look forward to many return visits.", "author": "Gran F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "The pizza was pretty good. Nothing to be that excited about, but decent. The service was good once we actually got seated. The wait was 2.5 hours so that's why I'm giving this place 3 stars. They said an hour and 45 min then suddenly turned into waiting another hour. It was sort of a mess. Pizza was a little doughy for me. Not sure I'll go back :/.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-10", "description": "what i loved most about del popolo is the super duper friendly service. fast and attentive, and so friendly! we arrived at 8 pm on wednesday with a reservation and were seated immediately in an intimate window spot. fun pillows too! plus points.\n\nwe ordered - squid appetizer, the winter squash and house made sausage pizzas.  pizzas came out really fast, and man they looked great!  awesome char on the crust and theyre pretty generous with toppings. however...i wasnt as impressed with the taste.. i found both pies to be slightly bland. the crust was great and chewy around the edges though.. beers are half-pint, and thus overpriced.  dinner for 3 was over 100 bucks, which i found to be a bit crazy since it was pizza..\n\ni'd probably give them another shot a while down the line..", "author": "Christina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "An off-the-mark service on Saturday evening. Another party went to the hostess to inform them that one table had been cleared off for 20 minutes and they hadn't seated anyone -- despite the number of people waiting at that narrow counter near the restrooms, standing around in the small entrance or outside.\n\nWe were waiting for about 30 minutes, and watched. and watched. tables not cleared off or people not being seated at tables that were open for awhile. One of our dining companions who visits SF multiple times a year dismissed it as \"a San Francisco thing,\" but I don't know. Isn't it just an inadequately trained thing? \n\nAfter being seated, we began with a few apps, which while flavorful, we didn't think was out of this world. The trout with lentils, smoked purple potato and hard-boiled egg was my favorite. There was a lot going on but it was the most unique when compared with barbecue carrots.\n\nThe four of us then split three pizzas. The wood-fired pizzas are great. Can you really mess it up?\n\n- The unanimous favorite was the sausage pizza, with crushed tomato, mozzarella, peppers, red onion and chili. If you're looking for a kick, this one's it. \n- For pesto fans, the brussels sprouts with both mozzarella and Grana Padano cheese is flavorful and light. \n- While my dining friends thought the butterball potato with leeks, fontina and chili flake could've used more cheese or even sauce, I thought the butteriness of the potato was enough for it to be a decent slice.\n\nThe somewhat unsettling thing? They brought out the wrong pizza to us at first. And I don't really know how this happened but one of our knives fell on that pizza that wasn't ours. They did take it back into the kitchen, but I sincerely hope they got rid of that pizza instead of re-serving it.\n\nFor dessert, there was a rich, salted chocolate with chantilly cream.", "author": "Esther G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-10", "description": "I really wanted to love this place because it's right down the street and always packed.  But this just isn't the best wood-fired pizza.\n\nFood: Ordered the Margherita & Winter Squash pizzas, 2 was perfect for 2 people.  The Margherita was nothing special, I've had way better versions of this elsewhere; I should have paid attention to other Yelp reviews about ordering this.  The Winter Squash was delicious and the highlight of the meal. \n\nDrinks:  Beer is overpriced for half-pints, and the wine is all natural and tastes a bit fermented/vinegary.  \n\nService:  Really friendly!\n\nAmbiance:  Really loud.  The large tables in the center seat multiple parties and feature stools attached to the table.  It's not comfortable, there's no where to put your coat but to sit on it.", "author": "Sona P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "I've been wanting to try Del Popolo since it was a truck.  When you walk in, the first thing you see is the giant pizza oven in the back and people hand tossing the dough.\n\nReservations are a must (via Resy).  There was a long wait list for a Friday night. One of the people trying to get a table was super rude and insulting to the hostess, but she took it with stride and was immediately very pleasant when helping us. Also - we needed to change our reservation time last minute due to traffic, and she was super helpful with this.\n\nWines: actually much cheaper by the bottle than by the glass.\n  - N2 wines Barbera blend: smooth, easy to drink\n  - Fausse piste Oregon syrah: not as full bodied as your usual syrah, but it was good with pizza\n\nStarters: \n1. Winter chicory salad: I liked the thinly sliced persimmon. The honey and the Jersey milk ricotta helped cut the bitterness of the greens\n2. Barbecue carrots: very interesting - good smokiness and a bit of char, along with pistachios and buttermilk at the bottom (I was fine without the buttermilk)\n3. Rye battered broccoli di ciccio: this was too fried for me - there was more batter than there was broccolini, and when I took a bite of a leaf, I could feel the oil from the dish\n4. Seared Mount Lassen trout: with a soft cooked egg, lentils, and smoked potatoes; I liked the garnish at the bottom a lot\n\nPizzas: we got 4 for 4 of us to share (no leftovers)\n1. Margherita di bufala: could have used a bit more salt in my opinion, but the crust texture was amazing \n2. Eggplant: the eggplant ended up being a little too oily, but the early girl tomato and marjoram made it interesting \n3. House made sausage: great flavor, gypsy peppers, mozzarella - more like a traditional comfort food pizza \n4. Anchovy: if you like anchovies, you would like this. It's not overly fishy unless you eat a piece of anchovy. It's definitely the most savory and salty of the pizzas. I thought the mix of bitter greens and calabrian chilis was interesting \n\nI like that the tables are big enough to fit all the pizzas, and they were really nice about helping us course them out, since the pizzas really are best in the first 3-5 min after coming out of the oven. The crust texture was really good - a bit chewy but still thin and light.  Service was great.\n\nTips:\n  - ask them to course out the pizzas so they don't all come at once\n  - make a reservation on Resy if you can since the wait list seemed crazy long\n  - wines are much cheaper by the bottle than by the glass\n  - you can also buy bottles to go for 50% off the menu price\n\nStarters are interesting, but I'm happy eating only pizza since that's what their known for.  I would definitely come back for the pizzas.", "author": "Marilyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Pretty good apps and pizza. Nothing really blew my socks off, but still a great spot. My favorite was the Bianca pizza. They do update their apps regularly, so I'll definitely come back when I'm in SF to try some newer items.", "author": "Stephen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Went here last night with a small group and was ushered immediately to the side bar for a drink while we waited. The hostess was so friendly and accommodating and even took our soaking wet jackets to hang by the door.  Within minutes we had a cool seat at the pizza bar where we watched the chefs do their thing as the pizza went in and out of the amazing stone oven. \n\nOrdered the Brussel sprout salad, winter squash pizza, and spicy sausage pizza. The salad was one of those small fancy plated things that sometimes irks you you've paid double digits for, but it was still delicious so I can't complain! But the pizza was the highlight for me. The outer crust was crispy on the outside with a doughy soft inner. The spicy homemade sausage was so good I don't think I can eat any other sausage for a while just knowing it won't taste as good. Then for the butternut squash pizza.....wow. The flavors were unexpected and crazy good. I highly recommend this pizza as you won't find anything like it elsewhere. \n\n5 instead of 4 stars because I would've liked a crispier crust on the pizza's bottom center --other than that, amazing and I will be back.", "author": "Rachael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "Very good dough but pizza is a bit wet. Syrah is great wine. Generous servings of wine. Party needs all to be present to be seated.  Brussel sprouts would have been better a bit crispier, and didn't understand the peanut or other nut butter that accompanied it.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "We love this spot! We lived on Bush so became regulars quick. After moving we are here much less but it's a total fave in the city. The pizza oven is incredible as the center piece to this place. We have always had the same server and I wish I could remember his name because he's just the best. We always have a great wine pairing with the perfect salad and pizza. I highly recommend getting there before or as they open as the wait can get crazy.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-15", "description": "With so much competition when it comes to pizza, I'm not sure how this place can stay open.\n\nWe got seated at the center community table. We were the only ones there at the time. We started off with the Cream Ale and the Peach appetizer with an order of the Homemade Sausage Pizza as the entree. Let me tell you about the Peach Appetizer. The table next to us against the wall ordered this as well. The waitress brings it to their table and sets it down. The table eventually waves her down and lets her know that they didn't want it since they didn't know it had nuts in it. She then takes it off their table and brings it over to our table AFTER they didn't want it! You do not do this, especially in any dining establishment. You can keep your $13 peach nonsense. \n\nSo two separate parties sit down at the community table with us and she takes their orders. After about 20 minutes she brings out their orders of pizza. Ok, we had a good 10 minutes on them. What gives? She then comes over and says that our pizza will be out soon. We didn't cause a scene or anything, we kept quiet throughout the dining experience. We finally get our pizza and honestly it was very bland, slimy and basic. Whether you want NY style pizza or artisan style, there are at least 20 better options in the city. Good food is always worth the wait, this wasn't worth it.\n\nThink of it this way, they take food off of another table and gave it to us in front of everyone. Imagine what they do when nobody is looking...\n\nSo not only was the service awful, the food was beyond subpar. I do not recommend coming here. Don't be fooled by the line at the door, which would usually give the illusion that the place is in high demand, the people just haven't had the chance to be disappointed yet.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Pizza is good, but make sure you order and share starter or side plates... they are excellent", "author": "Robert P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Just honestly my favorite pizza. My partner claims to have had slightly better in Italy and I believe it, but still. Service is good, nice beer selection for me, the pinot noir on tap was great, and nice other entrees to fill in the other courses. Pro tip: get both the chocolate dessert and the strawberry sorbet. They pair together fabulously.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Om nom nom nom. This place is GOOD. From the ambiance (cozy--I love the deep green walls and oil paintings), to the service (friendly and attentive), to the food (just so, so good), Del Popolo nails it.\n\nWe ordered the ribs appetizer (which were fall off the bone, melt in your mouth quality) and two pizzas, the sausage and the blanca, while sitting at the bar. My favorite was the sausage and my husband preferred the blanca. I saw every pizza on the menu come out of that oven while we were there, and every single one looked perfect. Can't wait to go back and try more.", "author": "Audrey A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Ok. I liked the pizza. Crust was awesomeness.  Very salty though. I was also quite irritated when they kept trying to take away my plate when I was not done. They took my drink away and I was not done. Unbelievable.", "author": "Susan V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-26", "description": "Likes: quick walk from the Ritz, quick service with pickup order\n\nCons: Margarita pizza was pretty dry, didn't like thin chewy crust,  not tasty.  Pricy and not that great.  Do not plan to try again.", "author": "Harp B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "The space is cute! We luckily didn't have to wait, but would recommend either reservations, or coming by early. \n\nWe ordered: \n- Roasted peaches: great balance of sweet and savory. really really well done. \n- Bianca: delicious, until I got a mouthful of garlic that I couldn't get away from :( I would order it again, and just be more careful of the pockets of garlic. \n- Eggplant (sans sausage): delicious, but a very (very) light sauce\n- Butterball potato: too sweet for my taste (it has honey), but unique and liked by others with sweeter palates... \nPizza dough: Amazingly soft and fluffy. It is floppy, but it's so good. \nPizza sauce: one of our pizzas had it. It was a bit weak, but not bad. \n\nAmbiance: 5\nNoise level: well spaced and not loud. Easy to carry a conversation", "author": "Dimple B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-04", "description": "The white wine we had was delicious, no doubt. The pizza however, was only above mediocre. We split 3 pizzas between the 4 of us (worked out perfectly):\n\n1. Margherita w/spiced salami - my favorite of the 3. If you're looking for something close to a traditional pepperoni pizza, this is it.\n\n2. Bianca w/sausage - nothing much to say about it. I had my first white pizza in New York and the taste of this one was not even close.\n\n3. Brussels Sprouts w/Anchovies - The waitress recommended adding the anchovies. Unfortunately they were WAY too salty and ruined the flavor. I think it would have tasted great without the seafood.\n\nI do not recommend the red peppers, or at least use a very small amount. I don't know what it was, but to me it changed the flavor of the pizza and I did not like it.", "author": "Miguel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-15", "description": "It was Meh. This is not Tony's. If you like pizza, you won't love this place.\n\n1. The dough wasn't cooked through so the pizza was floppy and soggy.  \n2. No crispy crunchy crust, it was like pulling apart string cheese.\n3. A lot of money for a very small pizza. 2 pizzas left 3 of us hungry.\n\nCool space, nice staff, meh food.", "author": "Patrick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "I had my birthday at Del Popolo this past Saturday and rented out their lovely private back garden patio for the event. It was a sit-down dinner for 24 people and could not have been better. \n\nThe space is lovely. Private, cozy, backed by trees, and warmed with a canopy and heaters. Valerie, who coordinated the dinner for me, was incredible. I had never been the restaurant, and was coming sight-unseen. The table arrangement was beautiful. Candles, flowers, tartan throws on the back of each chair in case guests were cold. Conroy helped serve throughout the night and was amazing. \n\nEverything we had in the three-course meal was incredible. The grilled peaches with burrata, the pizzas, the rib roast. All excellent. \n\nI couldn't get over how perfect an experience this was. I'd go there again in a heartbeat. My guests were raving. People said it felt like a wedding reception. Valerie, Conroy and the staff made it one of the best meals I've ever had, and definitely the best birthday I've ever had.", "author": "Ray L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "The food was excellent!! The service was amazing too. If you sit at the counter you can watch them cook your pizza. Truly authentic!!", "author": "Nadia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Food: awesome. Had the app with squid. Best dish of the night actually. Had the pizza with sausage and ... Veggie and honey? You don't think it's good but it's really good. A tiny bit of sweetness really does it. \n\nAtmosphere: ok. The seating with swivel tiny round seats are not that comfy. But food was good and it wasn't too packed together so I dug it.", "author": "P L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "Snobby and pretentious hostess.  Pizza crust very soggy despite it coming out of wood fire oven within minutes. Very disappointing.", "author": "David J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "Del Popolo was very solid - especially the pizza. Salad was decent if a bit salty. I think overall it's a great option for the thin-crust, vegetable-centric pizzas that San Francisco tends to be good for, especially if you're near Union Square where there are many tourist traps. However, it probably won't replace my favorite A16, which has such a spectacular wine list and a bit more extensive menu.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Great neighborhood spot. We came after work on a weekday and shared two small plates, both delicious, and a salami pizza. The dough was fluffy and not overpowering. The dessert made out of fresh blueberries was a perfect finale to our meal. Definitely recommend and look forward to returning.", "author": "EG P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "I had a nice efficient dinner here.  My friend and I arrived around 8:30pm on a Wednesday night and were immediately seated at a communal table.  We quickly decided to share the  margherita and butterball potato pizzas and it literally took just a few minutes before our pizzas appeared on our table.  The best part was the crust - super chewy and glutinous with a blistered charred top crust.  The toppings were simple and fresh.  Just note that the pizzas are not cheap - a $15-18 pie is only enough to feed one person so be sure to order your own.", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "Visiting from our of town, and must say, was very impressed with the fresh approach and classy vibes of this restaurant. From custom art on the walls to the original take on wood fired pizzas, this place was awesome for a date. The only reason I'm giving it four stars is because of the wine selection. I was pretty disappointed to see almost entirely European wines in a boutique restaurant in San Francisco. While European wines are wonderful, since the menu was a fresh take on pizza, I would expect (somewhat) local and creative takes on wine. However, I had N2 Wine blend and it was nice the Bianca pizza (with homemade sausage of course). Not really a dry, a tad sweeter than I expected, but actually very good. Nice table wine. Maybe that's what they were shooting four.", "author": "Levi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "The pizza was really good, I had the House Sausage which had some really nice heat to it. The only thing I would change is to make it crispier. \n\nI was able to sit at the pizza bar which is fun. If the food was free I could sit there for hours watching pizza being made.\n\nPrice wise it's a little expensive, but the quality makes up for it.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "bianca pizza is probably my favorite pizza that I've tried from Del Popolo - their fried squash blossoms are also delicious!", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Awesome pizza and a cool vibe! We sat at the communal table with a good view of the super cool pizza oven. I had a mozzarella di bufala pizza,\nMy companions had the potatoes to start, the spicy salami pizza / mozzarella so bufala with added sausage, and the pot de crème for dessert. Lovely crust, quality toppings, and generous portions.\n\nThis place has almost no nuts / shellfish so that was great for my allergy situation, for my mushroom allergy our server was very careful to write it down and assured me they would make sure there was no cross-contamination.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "I thoroughly enjoyed this place!  Our family tried both the House Made Sausage and the Margherita (adding pepperoni) pies, and each one was delicious. These are not your buy-for-the-masses, buffet worthy Dominos / Little Caesars type of pizzas--nope, Del Popolo serves only individually crafted, artisan, wood fired pies.  The sausage pie was unexpectedly spicy, but it was a welcome surprise.  One of the nicest surprises, however, were the prices--only about $15.00 to $18.00 per pie, which for San Fran I thought we found a bargain.  The service was delightfully quick, and pleasant too.  Oh, and though we had no intention of getting dessert, we splurged and had the chocolate chip cake and some kind of chocolate creme something or other.  Just so you know, I am not a fan of any kind of pudding-like creme dessert, so I did not even try the later (but I am told it was both rich and delicious).  The chocolate chip cake, however, was in my personal opinion quite simply amazing.  I'd go back just for the cake!  If I had to report a chink in Del Popolo's Italian cuisine armor it would be that they only serve an off-brand soda variety--no Coke (and not even Pepsi) products here.  But that's a minor hiccup for this otherwise completely enjoyable dining experience.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "I tried this place a couple months ago and the pizza was so delish. I love how you can also see the Pizzas are being made right then and there :) so cool", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-15", "description": "3rd day, opening weekend. A lot to like, some things to improve.\n\nFirst off...the pork rillette is was something of a wonder kid. Pork shaved, perfectly salty and with persimmons and fresh herb including mint and tarragon.\n\nAnd let's not forget the soft brownie that was sprinkled in crispy perfect toffee crunch bar brittle. It needed more brittle because let's face it I'm a toffee truffle pig.\n\nAnd Simon...he was great. He beared with us through something rather challenging wine dilemmas. \n\nI say challenging because the red wine list needs some real work. Heads up that it's either \"all natural\" or organic wine. Every single red was entirely too sour and too fruity and very few wines date before 2013.\n\nNo one should be served a wine made before 2013 at this point in time. We've had some rough years globally and 2013 is not ready yet. The Californian wine, the Italian, The French...it felt like I was drinking sour beer. The Chianti was close, the bottle we ended up ordering blind after Googling the vintner trying to get some sense of what his wines were like, but still too sour after the first glass. The problem with organic wines is they tend to be more tart to being with - whoever the wine sommelier is he must have a tart or super fruity palette going on. Simon did his best to make our selection go smoothly, but rarely have I had to taste more than 5 wines to make a selection in a restaurant.\n\nAs for pizza...ours was charred too much on the bottom on one side. We also only got 2.5  pieces of basil for our 4 slices. I'd suggest not getting here first thing as the pizza oven is not ready. Our Magherita needed slower cook time - came out way too fast compared to our dessert - and not to be blackened on the bottom.\n\nWill be back, that I am certain. Will likely BYOB though, depends on what happens overtime with the wine list and I'm not a beer drinker.", "author": "Alita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Can't get enough of this ZA.  Recommended by a friend.  Made a reservation online for Friday night dinner in SF.  Was staying in Union Square, so location was great for us.  Ordered the Margherita di Bufala and the Salami Picante - tried both, and the Salami edged out the Bufala (granted I'm particularly partial to spicy).  Being used to NY pizza, the Salami Picante reminded me of Roberta's Bee Sting.  Ambience was great, low-lit, lots of groups and dates here.  Can't wait to go again when I'm in town.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Charred leeks appetizer: very good. Tempura fried butternut squash: excellent. Margherita di bufala pizza: excellent Neapolitan style (not perfect, but nearly so). Tables are elbow to elbow and it's very noisy, but the food is worth it.  Be sure to get a reservation.", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Cozy and comfortable with an upscale vibe. But not pretentious or expensive. Just handmade pizzas and a sweet beer and wine list. We ordered the basics - Margarita, Bianca and handmade sausage. The sausage has a good kick to it and the others were good. The crust is thin so you do end up with a bit of a \"watery\" pizza in the center. The dough for the crust is also a bit bland. The flavorful ingredients make up for it. I would maybe order some of their more unusual toppings for a change. \n\nI would recommend visiting here though for a nice relaxed place to have pizza and meet up with friends. Just don't expect the big hearty pizza style here.", "author": "Martina Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "Cute space where the pizza oven takes center stage and random painted portraits of dead men line the walls. We ordered a bunch of pizzas and small plates and generally enjoyed the meal. It's good pizza and plenty of options, but you'll be a bit disappointed if crispy crust is your thing. Of the three we split (margherita di bufala, anchovy and eggplant), the winner was the margherita by a long shot. Small plates were pretty good - we enjoyed the carrots - but could've used a few more salad options on the menu to complement the pizzas.", "author": "Noah G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "I went to Del Popolo for dinner on a Saturday night around 7 p.m., with my husband and two friends, during a short visit to San Francisco.\n\nWe did not have a reservation, so we expected a bit of a wait. The wait was well over the time we were quoted by the hostess (more than 45 min.). We didn't even have the opportunity to check in with the hostess during our wait, because she seemed to also be bussing tables or alternately disappeared in the back, with no one attending the front of the restaurant.\n\nOnce finally seated, we ordered PEACHES ROASTED IN THE WOOD OVEN with goat's cheese, salsa rustica & seeded cracker; Pizza MARGHERITA: crushed tomato, mozzarella, basil; and Pizza EGGPLANT: crushed tomato, mozzarella, 'Nduja, Ricotta Salata (warning: this was very spicy - which was not mentioned in the menu description). \n\nAll of the food was delicious, but the pizzas are quite small for the price (plan on one pizza for every one or two people, depending on how hungry you are). \n\nThe real disappointment was the service, which was just oddly SLOW! We were all flabbergasted by the mysterious slowness. Even when the server was right in front of us, I felt like I was watching a slow motion parody of a server. There was a line of people out the door, so you would think there would be at least be a little fire under the servers to be efficient, but no. Just freakishly slow and unenthusiastic. \n\nI have sympathy for the chefs at Del Popolo, because their skills are tainted by the lackluster waitstaff there. \n\nMaybe try this place on a week-night or for take-out. Definitely not worth the effort if you a actually hungry, if you have places to be, or if you expect friendly service.", "author": "Rae S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Gorgeous Space\nDelicious Apps.\nNeapolitan Pizza..\nAwesome Staff...\nGo check them out....!", "author": "Evan E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-14", "description": "Torn on this one. I had higher hopes for Del Popolo. Having heard great reviews over the years, I was ready to experience the goodness myself. Their new brick & mortar on Bush street is conveniently located but I found the interior layout quite the headache. From the moment you walk in, the place is really cramped. I had a hard time getting in and out of my seat to get to the bathroom, and it was an elbow to elbow situation at the hostess stand. \n\nMoving on to the eats. We tried the brussel sprout and fried green tomato appetizers. The brussels themselves were good, but I felt like there was too much going on. Could have used more brussels too. The fried green tomatoes were tasty and well-seasoned, but our group of 4 was served 3 tomato slides. Come on. For a $12 appetizer, the least they could offer is a slice of tomato per person.\n\nI'm pretty easy to please with pizza, if I know what I'm getting myself in to. I so wished this pizza was cooked longer to offer a slightly crispy, yet still chewy crust. We tried the squash, and sausage (+ salami) pizzas. The squash pizza to my surprised really lacked in flavor. Both pizzas arrived luke warm and way too soft/mushy. Le sigh. \n\nMissed the mark on this one. I'd give it another try, pending a bit more variety on the menu and some price adjustments. We had good service especially considering the packed house.", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Lovely little restaurant in Bush Street. While dining in, it gives you the feels of city-living, with dim lights giving a classy look. They have amazing coal brick oven pizzas with fresh ricotta cheese and the best marinara base. Cons : The portions are fairly small and overpriced.", "author": "Aswin V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "I loved my visit to Del Popolo! The food was amazing, we split two pizzas, chopped salad, the mushroom small plate, and the braised short ribs. The atmosphere was both hip and cozy at the same time. Our waiter was knowledgeable on all of the wines and menu items. We never felt rushed and could easily get a reservation for a small group. Highly recommend!", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "I live right around the corner from Del Popolo and I couldn't be happier about it. The pizza is always amazing (my favorites are the bianca with pepperoni and the mozarella de bufala). Their apps are always changing, but I love the grilled cauliflower and the squid. I am not the biggest fan of sitting at their communal table because the chairs are pretty uncomfortable, so if you can get a table i would recommend that. Everyone is nice and friendly and has still maintained a quaint neighborhood feel to the restaurant.", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-23", "description": "Got there early at 5pm and we were told to come back at 5:30.  Came back at 5:30 to be told: sorry last walk in table was just taken. You couldn't have given us a heads up to just wait outside or else we get booked?  We hadn't been here before and the folks at shakedown ice cream suggested to come here.  Pizza places are a dime a dozen and we won't ever come back here.\nPoor customer service. Your pizza can't be that great when the service is like that.", "author": "nursesrock f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "BEWARE the billing practices here are extremely greedy, possibly illegal.\n\nThere was an hour wait one night, so we decided to get it to go to avoid the long wait. First off, when we place the to go order, instead of presenting us with an itemized bill as is customary, the host just asked us for a credit card and disappeared back with it. When she returned, they had automatically added on a 10% \"to go gratuity\" on with the bill! I'm not contesting leaving a small to go gratuity (it's only fair, and I usually do anyways), but the fact that they just added it without any mention of it is completely illegal, as there was no mention of this anywhere on the menus, and since she didn't give us an itemized receipt (just asked for a card), we had no idea what the charge would be. I know there are some other automatic charges added to the bill, like the 4% healthcare tax, or auto gratuity for large parties... but those are always stated on the menu, and you would get an itemized bill saying show before your card is swiped.\n\nYes, I love the brocolli app and winter squash pizza... but this billing practice has spoiled my affection for the restaurant, and I will not be returning anymore.", "author": "audrey k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "We had folks from Honduras visiting, and my coworker was talking about how he had Del Popolo over the weekend with his wife. After showing them a picture of the place and the food, one of our visitors said, very seriously, \"This is where we would all like to go, please and thank you.\"\n\nI will say that they have really weird chairs. They freaked me out. I'm kind of a small person, and I was truly afraid that this thing would break, but these strange chairs were well-engineered. Worry not about that. Worry more about getting to this place as soon as it opens for dinner so you can actually get a seat to freak out about.\n\nIf you're someone who likes eating many slices of pizza, please note that one pizza is probably enough to feed two people who are on a date trying to impress each other. If you're someone like me and my boyfriend, you'll probably want to order one pizza per person in order to be properly full. Sure, you can split one, but you'll just be somewhat satisfied and wishing you had more pizza.\n\nFor a size reference, I think one Del Popolo pizza is about equivalent to 1.25 slices of a Costco pizza (the kind you can get from the window when you order a single huge slice). The crust is super delicious. The Margherita is where it's at, and the potato pizza thing is really weirdly good. If there were two I'd pick, it's either two Margs or a Marg and a potato and split 'em. I don't know much about wood ovens, but if it makes pizza this good, please, let me have more. The crust is thick but the place where the pizza and toppings live is on the thin side.\n\nThey also serve Bruce Cost ginger ale, which is good stuff. I'd definitely come back again!", "author": "Robbin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "Excellent pizza, our squid starter was amazing. Fun dining experience sitting up at the bar watching the chefs prep. Definitely recommend!", "author": "Jim O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "AMAZING PIZZA! But poor service.\n\nSplit 2 pizzas among 3 people, which was enough. We got:\n- WINTER SQUASH: mascarpone, spring onions, house cured bacon, rosemary ($18)\n- YELLOW FIN POTATO: leeks, fontina, hot honey ($18)\n\nBoth were amazing. The Winter Squash was savory, and the Yellow Fin Potato was subtly sweet (the honey is a great touch!) and they balanced each other out well. The crust was slightly sour which went especially well with the sweetness of the Yellow Fin Potato pizza. Overall, the pizzas we ordered deserve a 5/5. I enjoyed them more than Pizzeria Delfina!\n\nSo why does it get a three? I think the service needs refinement. When we first sat down, our waiter didn't bring us water or acknowledge us for the first 10-15 minutes which I thought was too long. But I could understand that given how packed the place was.\n\nThe real issue is that they're for some reason really strict on where you're seated. We were at a communal table in a group of 3 at one end of the table. Another group of 3 was sat up against us so we were kind of in a Tetris block situation and in each other's conversations, which I can also understand at a crowded place. But when an individual table opened up next to us, and we asked to move there, the waiter said that the next party had reserved, which I kind of didn't believe because if it had been reserved, I think the table would have been left vacant for a longer time prior to the \"reservation\". Then, the opposite end of our communal table opened up, so the table of 3 in the middle moved to the opposite end so both our party and theirs would have space/privacy. The waiters wouldn't allow them to move seats for some reason, and they argued for quiiite a long time about it and finally forced the party to move back next to us. The waiter said that the next group coming had been waiting for 1 hour and 45 minutes, which didn't make sense as a reason because 1) the new party is not waiting for those exact seats at the end of the table... in fact they would probably have preferred an individual table to a communal table and 2) after the new party arrived, they said they had actually only waited for 10 minutes, so the waiter flat out lied.\n\nOverall, I think the wait staff needs to try harder to accommodate customer preferences - I felt that they were unreasonable about the seating situation. Yes, they have great pizza and are always busy, but they should still treat every customer with respect.", "author": "Jeffrey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Believe the hype. Del Popolo's storefront is even more delicious than their food truck.This statement is affirmed by their delicious, scrumptious small plates menu, in addition to the pizza menu.\n\nWe were part of a 7 person party, which seemed easy enough to accommodate and make reservations for the week-of. Our early dinner was started with a bottle of sparkling Rose wine, which wasn't too sour of a wine as mentioned by other Yelpers.\n\nWe ordered and shared as a table:\n\nsmall plates:\nwinter citrus salad: 4/5 Light and refreshing.\nbroccoli roasted in wood oven: 5/5 One of our favorite small plates! Such a  delicious & toasty flavor these had.\nwild mushroom ragu: 5/5 This was a runaway hit. I'm not a huge mushroom eater, but these were sumptuous, earthy, umami-goodness. \nwarm persimmon salad: 5/5 sweet and savory, with a dollop of yogurt for creaminess and tartness.\n\npizza:\nmarinara: 3/5 good for your vegan or dairy-free friend. otherwise, skip\nmargherita: 5/5 simple and delicious. the toasty crust lends a nice flavor to this pie.\nbianca: 4/5 good if you like creamy pies (no tomato sauce), nice fresh herbal flavor from basil with luscious ricotta.\nwinter squash: 5/5 definitely get this one!! the sweetness of the squash paired with the smoky bacon and fresh rosemary is out of this world (no tomato sauce to compete with the flavors either). we ordered an extra one sans bacon for the vegetarians in our party and even without the bacon it was YUMMY.\n\nIf you're a pizza connoisseur, definitely make Del Popolo a place to stop by.", "author": "Liz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Ah, this place is sooo good. It has this a great atmosphere and is kind of busy though, so do expect to wait or be willing to sit at a communal table. Caught up with a friend here one weeknight and we shared the cauliflower fritters and the winter squash pizza. So gooood. The winter squash pizza was a tad oily, but besides that it was great. However, don't get the sparkling water here....unless you like not too sparkling water.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Was in San Francisco for a week, and tried most of the places nearby. This wasn't far the best", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Fantastic, trendy space and a cool front-and-center pizza bar to watch the magic happen. We had been excited to try this place as we are die-hard fans of Anthony's at Una Pizza Napoletana and couldn't wait to visit San Francisco again to make the comparison. For us, it was good, but didn't live up to the hype. They have a WONDERFUL dough....If they would just stop overstretching and manipulating it, then burning it by air-finishing it in the oven. We got the impression that Del Popolo is more about the \"show\" (like a Japanese Hibachi restaurant), and less about the finesse of the dough and the simplicity that makes Neapolitan pizza so special. That said, we have to say his flavors are on-point and, if you prefer your pies to be a little less on the charred side, with a more lightly leoparded appearance, just ask. They're happy to accommodate.", "author": "TwoIfOverland -."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Absolutely amazing in every way. The pizza is outstanding but so are the starters which change almost every week. Try the calamari. Pizzas Bianca and Marinara are incredible. It's all love", "author": "Kathleen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "This place was a gentle reminder that pizza can still be mind blowing and when done a certain way, can be unlike any other pizza you've ever had. The crust had a nice crunchy exterior and had a soft, airy chew that I love most about good pizza crust. I found out from the pizzaiolo that they use sourdough for their crust! I also really dig that they use what looked like wood shavings as tinder. I was very happy by what tasted like the repeated process of getting a pizza right through dough and perfect oven conditions. Bravo!", "author": "Nate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Definitely good pizza in a hip scene, but not mind blowing. \n\nI read some hyped up reviews and articles about this place. We ended up waiting almost two hours (thank god for Hopwater across the street) for dinner, which would keep me from coming back on the weekend. The pizza was very good, but nothing too unique.", "author": "Haley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Worth a stop anytime you're in the area. Every time I'm in SF I go here. The menu is great and they have a good wine selection. The pizza is bomb and the pot de creme was awesome last time I went.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Exceptional! Who knew they did ribs as an app? Wish they had a full bar, or full-pint beer pours, but the food was most excellent, and the crust was crisped exactly as I had requested.", "author": "James L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-27", "description": "Beautiful space, friendly staff, but they haven't nailed down a good-enough pizza to warrant the premium prices. \n\nThe crust was nicely charred, redeeming the edge without sauce and toppings. But the rest was wet and gummy - not chewy and crisp like you would expect from a brick oven fired pie. The broccoli appetizer was also oddly cold, when warm or even room temperature would have been welcome.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "We would highly recommend dining here!  We had the Brussel Sprouts & Sweet Potatoe Risotto for appetizers. Each were uniquely blended with an assortment of fresh vegetables, flavorful and a perfect beginning. The pizza was the highlight. Dining with four in our party, we shared  3 pizzas; Sausage, Bianco & a Squash. All were excellent. We especially enjoyed tasting the fresh ingredients in the pizza, tomatoes,  fresh basil. The pizza crust is right on. \n\nNice neighborhood atmosphere, the pizza oven is center stage, seating is tight like italy, give it a try. Perfect escape from the Union Square tourist crowd.  We'll be back.  Keep it going Del Popolo!", "author": "R Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Cool small restaurant with a wood-fired pizza oven. Make sure you get the in-house made sausage added to your pizza. We had the blanco and the Margarita Pizza. Reasonable prices and great ambiance. I shall return.", "author": "Missy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "I couldn't wait for Del Popolo to open! \n\nLoved everything about it and look forward to going back over and over! The wood-fired pizza was delicious, the service was wonderful, and the ambiance is warm and inviting. Can't ask for more...", "author": "Bogee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "We wandered into Del Popolo on the later side of Sunday night in serious need of a snack pre-cocktails. \n\nWe ordered the margherita di bufala...the pizza was sooo good! Thin, soft crust with the perfect amount of char on it! I generally like a little bit more crisp on the crust but liked that it wasn't overly salty. Next time I will ask for extra basil :) \n\nPretty space and friendly service. Can't wait to come back!", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-30", "description": "A little over-rated, we thought. Crust had a nice sourdough flavor but doesn't measure up to Delfina's. Pizzas were small, only 4 slices, and not much flavor. We had margarita with anchovies (what happened to that flavor??) and a white pizza that was truly bland. Edible, but boring. Disappointed in Eater 38.", "author": "Ileinie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "My friend and I only had to wait 15 minutes for a table on a Saturday night, and the hostess seemed really nice--they texted us when our table was ready. Our waiter was attentive, and he recommended the wild mushroom ragu and winter squash pizza to us--both were super delicious! He also recommended the chocolate pot de creme for dessert, but they ran out, unfortunately (it was like 9pm). Definitely coming back to try that and some of the other pizzas! My only warning is that this place gets LOUD--probably because of the high ceilings. Something to keep in mind when you are dining in here... Be prepared to lean in and shout your conversation... Otherwise, a really awesome place! Really glad they are close by!", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "A new pizza restaurant you say? Well of course! We watched with anticipation as this new place opened up near us and aimed to get there as soon as they launched. That day eventually arrived and we visited towards the end of November for a birthday dinner. While the place was busy and we were walk-ins, it wasn't difficult to get seated right away.\n\nFair warning: if you're a walk-in, you will get seated in the centre area which tends to be large communal tables with these strange swivel type stools that are a bit difficult to balance on. Out of the entire evening, I would say that this was one of the only negative features. Future visits here will definitely be done with a reservation to get seated at a personal table with proper chairs instead of these weird stools.\n\nWhile there were several options on the menu, we were there for the pizza! We ordered two different pies as one is a tad too much for one person but is definitely not enough to share between two. We also each ordered a glass of wine since it was a celebration... and wine+pizza just goes together!\n\nDespite the crowded seating, there was decent enough room for the two pizzas, plates and glasses. Our food came out within a decent amount of time given the number of people that were there at the time and we dove in, both of us having several pieces of the margherita and the bianca. We ate until we were full and still wound up taking some of the pieces home for later. \n\nThe pizzas were delicious and definitely a contender for being one of the higher-end and better quality options in the city. The crust is some sort of sourdough mix though so it wasn't as crispy as I would have expected given the thinness. Still though, delicious and awesome pizza was had by all and we left very happy with our birthday dinner choice.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-08", "description": "Probably one of the best pizzas I've had. The kale salad has a great dressing. Love the ambiance, perfect for a wine + pizza date night. Wish the center tables had chairs with backs on it though.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "The citrus salad was amazing. Super flavorful and definitely above and beyond what I expected. The pizza was also delicious. My only criticism was that the beer glasses are small and the communal table chairs (more like stools) are not comfortable for adults.", "author": "A I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Great service. The host was kind and invited us in and offered to take our coats. He gave us many options on where we could sit, and gave us a seat at a communal table. At the end, I asked about their music, and he wrote down several artists for me to check out. Our server was great - he came to us quickly, and found that my partner had several dietary restrictions, which is tough in a pizza restaurant, especially when the restrictions include gluten. He jumped through many hoops and found an option for her that satisfied her taste and her restrictions. He checked on us a few times throughout the meal, and was friendly and personable. It wasn't crazy expensive, and tasted great - even the next day. Their gluten free dough is good too. Their atmosphere is cool. Accent walls, big wooden tables, good music playing. They have it all figured out. I will definitely recommend Del Popolo to anybody traveling to San Fran. They took great care of us.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "Pizza is so awesome! This is a 4 and a half star review. Only qualm is that service is a bit slow for my liking. \nSuper simple pizzas. So nothing crazy. Flavors and straight forward and minimal, the way pizza should be!", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Think this is now the best pizza I've had in San Francisco.  Came here with three friends on a Sunday night and and waited 45 minutes to be seated.  We got two appetizers and two pizzas between the four of us.  The squid and persimmon appetizers were both more \"really nice restaurant\" than \"pizza joint\" - intricate balance of flavors and textures, but on the dainty side.  The two pizzas we got were fantastic.  The sausage pizza's sauce had the perfect combination of sweetness and acidity which, along with the nice gluteny dough and the right amount of cheese, made for a delicious slice.  I'll bet their margherita pizza is awesome as well, since I barely remember the sausage.  The squash and bacon pizza was also great, between the sweetness of the squash and the saltines of the bacon.  Will definitely be coming back here again!", "author": "Simon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "It's dangerous that this is so close to my workplace. It's the perfect way to end a long workday.\n\nThe pizza is great. It's fun to watch the process and feel the warmth of the super sweet pizza oven if you can score a counter spot. I've had four of their varieties (Margherita, Bianca, Anchovy and Sausage) and they were all great. I recommend getting one with crushed tomato and one without (or more if you have more than 2 people). \n\nI also really enjoyed the appetizers I've tried in my two visits so far. The broccoli is as good as other reviewers say, sauces with the well-crafted hushpuppies were delightful, and the winter citrus salad is a refreshing way to kick things off. \n\nIf you have room for dessert, know they are all great. I'm a huge ice cream fan so debate between the pistachio ice cream and tangerine sorbet, but also liked the pot de creme - with a nice hint of sea salt.\n\nIf the food weren't enough, it's a great spot in a pretty central location with, most importantly, great service! Everyone is friendly and working hard to make it a fun, casual, tasty experience.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "I'm not a huge pizza fan like some of my friends are but their house made sausage pizza is AMAZING. I still think about their pizza whenever I am craving piiiizzaaa.\n\nI am subtracting one star because of the price. I think it is a little bit too overpriced for my taste. Sawy.", "author": "Jessica Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "This is taste... A small menu with nicely paired dishes and very good pizza from fire!... Nice environment with friendly (not overbearing) staff. Food to enjoy.\nI will be checking in more often.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "I live in the neighborhood and I have now had the opportunity to try Del Popolo out a few times, for an intimate meal as well as a large group meal.\n\nFirst off the burrata brushetta, proscuitto pizza and the Monarch cocktail are all out of this world, dream about level food.  The fritto misto was pretty good but could be stepped up a notch in size for sharing.  The wine list was fantastic. \n\nThe service may need a bit more refining for large groups, the food came out and went to the wrong people each time, individual orders were served as group appetizers.  The servers seemed to lack experience, some of our bill was done as a group and then some couples served checks individually, it was a bit strange.   It  would be great to see service stepped up a notch and Del Popolo could easily be five star.\n\nLastly the pricing was very reasonable and this is certainly a neighborhood spot that I will be frequenting.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-20", "description": "Pizza was ok - far cry from the best neapolitan pizzas out there. Service was not very customer friendly - refused to customize pizza only after insisting due to dietary restrictions. Waiter was a civilized asshole.", "author": "Arzhang S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "Came here on a friday night- had a reservation, but things got a little messed up with the res by accident, regardless we got seated quickly at the communal table. the hostess, manager and wait staff were all incredibly nice and helpful, so apologetic about not having a normal table for our party, but the communal table was just fine! really nice ambiance- high ceilings.\n\nwe ordered: charred Brussel sprout (really good but a pretty small portion), the smoked sweet potato (amazing!!!), and for pizzas we got the sausage and the buffalo margarita. \n\nWould definitely come back for the sausage pizza and the sweet potato with poached egg appetizer. Perfect place for groups 4 or less.", "author": "Kelli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Came here on a Friday night. There was a wait outside but we were able to get 2 seats at the communal table. Ordered the sweet potato app, Bianca pizza and the sausage pizza. Dough is great. Sausage pizza was on the salty size though.\n\nComparable to Delfina but think I still like Delfina more.", "author": "Dana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "My girlfriend and I really like the quality of pizza from Del Popolo.  We were first introduced to them at one of their food trucks during Outside Lands a few years back.  Once we learned they were opening a restaurant, it was definitely on the list of places to check out.  I recommend eating at the restaurant to get the freshest flavor.  We have done take-out, but the pizza is usually cold by the time we make the 10 minute walk home.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "We went on their second night open, which was a bit before their official opening. The preview they hosted in the Dogpatch had set expectations high, but they readily fulfilled them at the brick . We ordered prosciutto, a salad, and the Margherita pie. They were all excellent. Everything was super smooth (service, timing, seating) despite only being open for dinner one prior night.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "The pizza dough is pretty incredible, but the ingredients topping the pizzas left something to be desired. We ordered an eggplant and an anchovy pizza. The eggplant was good, the anchovy was a bit saltier than expected, even when you know what anchovies are offering. We liked our pizzas, our beer, our glasses of decent red wine. This place gets most of its credit towards the atmosphere. It is a pretty nice spot with good ambiance, decor and show (pizzas made and baked at the counter).", "author": "Brianna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Love this place!! Tried three pizzas - Margherita , Bianca and Achovies. All were great but our fav was the Bianca w/Achovies but with sausage would prob be even better!!! The Anchovies comes w/chili pepper flakes so it can be in the hot side. The wood stove made of cement that burns almond wood (burns very hot & clean) is so cool.", "author": "Laarni-Lyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Incredible, simple choices, tasty food, the best ingredients.  Sit at the bar and chat with the pizza maker about the oven.  We ate the pizza margherita and the squash dish and cauliflower dish.  So good you want to order them twice!  Then the pot de chocolate for dessert will send you over the top.  We are coming back!  Great service, attentive and friendly.  Relaxed ambiance too.", "author": "Kevin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "It's a really small, cozy place, but it's really cute and doesn't feel crowded. We made reservations so we had no wait. The food was really good. We shared the Bianca and Margherita pizzas ($15 each). The pizzas are pretty light and two was perfect for the two of us to share. For dessert my boyfriend had the butter pecan ice cream ($8 for four scoops) and he really liked it. I had the chocolate pot de crème ($8) and it was so good and very rich. This was honestly some of the best pizza I've ever had and if I ever find myself back in San Francisco I will definitely come here again.", "author": "Taylor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "I can't wait to go and try the outdoor spot as it looks so neat! Really good pizza. I am so glad I eat gluten, nuts-all food! Stay home if you don't! Service is really great and I can't wait to go back again!", "author": "Sunny K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "Ahh yelp, I guess third time is a charm. I can understand the removal of my review for this place, but why remove one from another place that was made 3 years ago? A little vindictive, don't you think? You're like a scorned bitch\n\n\n* Your trust is our top concern, so businesses can't pay to alter or remove their reviews", "author": "Charles F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "It is a good place in general. The pizzas are quite good. It could be a bit expensive. Better reserve before arrival. The ambience is optimal with a cool decoration. I would repeat.", "author": "Edgar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "The food truck to restaurant conversion was done right. It's hard to find a good napoletana pie in the Nob Hill/Union Square area and this one hits the spot. The pizza bar is awesome to sit at if you get a chance... I was in a trance watching them put together those pies. There may be a bit of a wait, but it's pretty convenient, they take your number and you there are a few bars around you can hang at until they text you that your tables ready.\n\nThey have a friendly service staff who are knowledgeable about the menu. Beer menu is top notch. Wine is different... it's \"natural\"ly\" fermented wine similar to how their dough is made. I found one that I liked but it limits the wine selection a bit. They have a rotating appetizer menu all with solid options the 2 times I've been here. The hush puppies with homemade chili sauce was bomb.com. Also the broccoli with goat cheese, red onions and vinegar is something I might have to attempt to recreate... that was insanely good.\n\nAs far as pie goes they might have the best dough in the game. I'm usually a sauce kind of guy who puts that a lot into my pizza judgement, but this dough is something else. I've had the margherita with piccante salami, the Anchovy, and Sausage. All really good. I'll be back again for sure.", "author": "Nicky T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-25", "description": "Horrible experience. We tried to go here for pizza since it was close to our hotel and looked interesting. We showed up an hour and a half before close and were told they couldn't accept any more walk-ins, despite the fact there were multiple open seats. The girl at the front door was rude and almost seemed happy to turn us away. Bad business.", "author": "Shane R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "Love the space and the crispy broccoli---but the pizza crust was soggy.  Won't be going back for pizza", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "Pizza dough had amazing texture! Chewy and airy, somehow seemed substantive but light at the same time, baked to perfection! Pretty unique and selfish. The wine selections were a little strange for my palate. Organic and natural wines with tiny bubbles or slightly tart/young taste profiles.", "author": "Vicky S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-02", "description": "The food was really good but the host was very rude. We got to the restaurant towards the end of the night. They had no tables open no problem we left our name on the list and went across the street for a drink. They texted and we showed up about 10 mins later right at around 10 when they close. The host didn't want to seat us. He talked to his manager and came back and his words \"I guess I can seat you but you better order fast\". The waiter was okay but you can tell we were rushed. We get you close at 10 but if you seat us please don't be so rude or make us feel guilty for coming in towards closing. We weren't even the last table to leave. We won't be back.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-19", "description": "1) their seating chairs are very uncomfortable, especially the ones in the corner.\n\n2)it is definitely a little overpriced for just pizza. One pizza pp.\n\n3)I had the magherita pizza, it was tasty. \n\nIt's good, but a little overrated.", "author": "K S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Everything I had was outstanding. Eggplant pizza, delicata squash starter, and two glasses of unique wine. I was at the bar seating which directly overlooks the pizza creation, and the chef was meticulous in making sure every single pie was at his standard. Ranks with some of the best pizza in NYC.", "author": "Anne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "I went he first week they opened and the food and service were excellent. The pizzas are cooked to perfection! I live a block away and live that I can get good pizza so easily. The wait can be long, so try to make a reservation.", "author": "Kim O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "How does one review this without using all of the typical cliches; amazing, delicious, great service, mouth watering.. you get the point. Won't disappoint", "author": "M L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "Horrible service. Long wait for take away and 10% gratuity - Really Del Popolo? We've been fans since your food truck days and taken so many to taste your pizza. Disappointed.", "author": "Aisha V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "WOW...normally all I care about is what the food tastes like. I ordered 2 pizzas and 2 salads to go last night. Total was over 64 bucks. Expensive but fine. I had to pay 7 dollars in to-go gratuity for some bearded hipster to throw my pizza in a box. This place charges a 15 percent mandatory gratuity on to-go orders. Who the hell do they think they are? As a hard working owner of an SF small business, this kind of BS offends me. If you want to gouge your customers, just raise the price of the damn pizza!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Have had Del Popolo on my \"list\" since way before they had a brick and mortar spot.  It was \"A-OK,\" just as Yelp describes a 3-star rating.  We ordered two veggie starters, a roasted mushroom dish, and a roasted cauliflower dish.  Both were fine.  Also ordered two pizzas, a margarita with added sausage, and the anchovy with bitter greens.  Both were tasty, however I was surprised at the doughiness of the crust after the waiter had described it as \"light and airy.\"  I liked it, but it wasn't as light as I was expecting after the description.  Nice and chewy, and very, very sour.  Now, I can cross it off the list!  All that, and 3 glasses of wine, and tip, and we were out of there for $150.", "author": "Corrie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-23", "description": "My friend and I were disappointed with this place. Del Popolo had rave reviews but we didn't have high expectations. We simply thought we'd have really good pizza but instead we had average pizza and crappy service. However, the Smoked Sweet Potato appetizer of sweet potato with cumin, pecan salsa verde & poached egg was delicious as was the Winter Citrus Salad with rose, fennel, black olive, sesame & poppy seed. Our server was nice until he messed up. He seemed to understand we wanted two sides and a pizza. He said we couldn't have a half and half pizza so we agreed on the Margherita Pizza with the addition of House Made Sausage topping for a few dollars, which he had recommended as a pizza selection to the table next to us. But when the manager brought our pizzas out, there were TWO, a Margherita AND a House Made Sausage pizza. After we said that's not what we ordered, he offered us two pizzas for the price of one or he'd make us what we wanted. We ended up keeping both and our server never checked on us. He didn't come by to apologize or say anything but he did glance over when the manager was talking to us. He didn't even see if we needed refills later in the evening. The service really sucked. For the great reviews out there, one would have expected spetacular pizza with at least average service. I won't be back.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Went at sat at the counter overlooking the pizza production. We started with the baked peaches which were awesome. When we ordered we were asked if we had any food allergies which was very considerate. Our two pizzas' were prepared to perfection. For dessert, we had the Panettone by Roy's  which was over the top delicious. The service was very attentive and considerate. My measure of how enjoyable it was is based on the fact that on the way home we were already planning on when we'd go back and who we'd like to share such a great experience with.", "author": "Gary H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "Oh San Francisco. We just spent $40 for two \"pizzas.\" While the edges were crispy and the taste of the Brussels sprouts pizza was good, these pizzas were excessively doughy, and had very little going on on top. $40 for two small slabs of dough and a beautiful hipster atmosphere.", "author": "Lupine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "Great little neighborhood spot! We went at 8p on a Tuesday and there was no wait for the communal table setting. We started with the roasted peaches with goat cheese, which was delicious. We got the sausage pizza which I thought was pretty comparable to most brick oven pizza places. The meal was finished off with a pot de creme, topped with sea salt and perfect to share! I live nearby and would definitely come back. It didn't feel too touristy despite the proximity to union square.", "author": "Larisa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "I have been a Del Popolo fan for years and am so excited to see Jon (owner and head pizza chef) get his own brick & mortar place -- so excited that I invested (a small amount)!  I've eaten there twice now -- pizza is awesome as always, but the other items on the menu is what blew me away, especially the broccoli.  Desserts are also incredible and really inventive / thoughtfully prepared.  The space is really nicely done but comfortable and communal tables are perfect for a family -- we had six adults and two kids, and it was just an awesome time.  Service was also great.  Highly recommended, especially for Neapolitan-style pizza fans!", "author": "Josh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "I really enjoy the pizza selection, the tasty and fresh ingredients and the cool popping atmosphere. Wish they were open later.", "author": "Jeremy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Fantastic pizza! My wife and I are no doubt coming back here next time we're in San Fran. I would recommend the artichoke appetizer also! Only reason it was 5 stars was our server was a little abrupt and not super welcoming. But he wasn't pushy on anything which was kinda nice. The pizza is 5 stars though for sure!", "author": "Ryan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Del Popolo's trendy vibe and wood fired oven make this the hot place to go to, especially on a Saturday night. The dough is silky smooth, the sauce is tasty, but something was missing, making me reluctantly to give it my stamp of approval. Great date spot, but not the pizza spot that will blow your mind.", "author": "Brad W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Awesome pizzas and small plates, house cured meats... Wine and beer only!", "author": "Kali F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "Great atmosphere and location.\nThe wood fired oven in the middle of the restaurant is awesome and the seating counter around it great if you want to see how they make their pizzas.\n\nFor an \"Italian\" restaurant - wine list is very poor. Good beers on the tab thou!\n\nOk, so they have that great oven... I don't understand why the pizza is so doughy and not crisp at all! Went there twice and was disappointed both times.\nFor good pizza check out Beretta in the mission or classic Tony's Pizza in little Italy!\n\nAtmosphere is great !", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "A solid Neapolitan pizza spot with a nice ambiance...actually loved the potato pizza...others were less memorable but a delightful experience. Server was awesome and friendly, which is my preference (and too often not)! Hah. Was a friendly, smart casual vibe were one could feel comfortable enjoying a tasty meal.", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "SOOOO GOOOD!   The space is super cozy.....and the wood burning pizza oven (which is the focal point of the dining room), makes everything smell amazing!   We started with the prosciutto dish and the squid, both were fantastic!   We then ordered the margherita pizza and the winter squash pizza.....both were cooked to perfection with really fresh ingredients!    We will definitely be coming back again soon!", "author": "Garret T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "I was really disappointed by this pizza. We ordered the eggplant, potato, and margherita and none of them had a lot of flavor. The dough wasn't crispy and all I tasted was dough. I would recommend skipping this place.", "author": "Lindsay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "The best service I've ever had. My boyfriend and I visited Del Popolo twice one week and ever since, even after months passed the manager still remembered us. Sincerely nice staff and delicious pizza. I'd go every week if I could!", "author": "Madison T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "The pizza was fantastic.\nGreat service and nice to see pizza prepared in front of us.\nMany drink options available \nTo finish the chocolate desert was great", "author": "Thomqs G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "We loved Del Popolo!  The food was fresh, the service was excellent and the pizza was great!!", "author": "Steve R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Delicious pizza dough and premium meats. However the wait on a Thursday night was ridiculous. 45 mins for a table for 2. No reservations for parties less than 4. Bar and shared seating are potential options you'll get. Good thing is Hopwater is across the street so you can grab a drink while you wait the long minutes before your table is ready.", "author": "Alias A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "So delicious - amazing pies and great drinks. I especially enjoyed the sparkling wine that tasted like a cider. Pizza delfina watch out! There's less of a wait here !", "author": "Natasha N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Best pizza I have ever had! The butterball pizza is unique and downright incredible. Also has the bianca with salami, bangin! The staff is super sweet and helpful as well.", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "We grabbed pizza here our first night in San Fran.  It ended up being a bit of a walk from our hotel, which turned out to be a blessing on the way back when we needed to walk off all the delicious pizza we consumed.  There's a wood fire oven in the center with counter-style seating around it, with additional table-seating in the surrounding area.  Also looked like there was a downstairs area, but we were more interested in eating than exploring.  The pizza was all very solid.  We didn't get the chance to try much else.  Try any of the pizzas with their homemade sausage, but be warned.  It has a good amount of crushed red pepper so anticipate the burn.", "author": "Mr. C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-17", "description": "Food was good. BUT when we asked the waitress if there were in any nuts in the peach salad we ordered she responded no. Allergic family member found walnuts throughout salad. Could have ended in a very dangerous situation. Please be aware!!", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "First off, San Francisco has great pizza..The only thing it's missing is real buffalo Mozzarella. This is a fun place to sit at the bar and watch the action take place.  The pizza was delicious, and if you are eating Italian style, go for the whole pie.  Great appetizers too.  Try the charred brussels. I was with my daughter, and the only downside was the waiter was a bit impatient with us, but not so annoying to not come back.  If you have to wait for a table, there's a great beer bar across the street.", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "I can't commit to the 4 stars, but it was tough between the 3/4.  I enjoyed the uniqueness of their pizzas (like the winter squash, and the sausage one that had an extra kick!), and their appetizers were pretty delish too (we got the wild mushroom something and hushpuppies--that honey butter, mmm).  But yeah, I gotta say, price wise just doesn't add up. And I was slightly drunk and starving when I got here, but I still wasn't blown away by the pizza (I definitely enjoyed it, but no WOW factor), so I guess to get 4 stars out of me you gotta at least wow me with those enhancement bonuses.", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Absolutely delicious pizza, farm fresh vegetables, beers, and ambience. Highly recommend for anyone looking for a fun meal with friends.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "We were to be seated in 30, it was more like 55mins. We get it, they are new, only complaint. Our server, sweet and funny gentleman, name unknown, sorry. Squid dish was cooked perfectly and the Anchovy pizza was flavorful and Delish! Cute set up. Good luck!!", "author": "April H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "I've been here twice since it opened and it's seriously incredible. Pizza is one of those foods that is generally good no matter how bad it is, but when it's done right, it's out of this world. Del Popolo has got their pizza down - the appetizers are good but I would just save my stomach for extra pizza instead! The winter squash comes with a slightly sweet and creamy white sauce, making it the perfect balance against a traditional margherita or the sausage pizza with red sauces. Best part is, you can put your name down and they'll text you when your table is ready, typically giving you just enough time to get a drink or two across the street at Hopwater Distribution.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Very quirky restaurant that we went back to for a reliable bite after two days of traveling. Staff remembered us and looked after us great. Love the atmosphere, love the arrangement and love the pizzas. Had to wait 50 minutes for a table but because we were only staying around the corner, they sent us a text letting us know our table was ready. Excellent way to keep you informed. Just overall funky, hip and fun place to eat. Didn't like the stools that swing out from under the tables so you sit a tad awkwardly. But don't let this deter you visiting. Food, drink and atmosphere great!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "A pretty terrible experience here after the manager accused our table of not tipping our server because he 'heard our accents' and assumed we did not tip her. Instead of asking her first he decided it would be better to embarrass me and my husband who had friends in town from overseas. So tacky. The food was mediocre as well. Compared to Delfina or Regazza they have a lot of work to do. Never again.", "author": "M F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-23", "description": "Raw sliced garlic -- just awful!   We ordered a white pizza and made the mistake of ordering extra garlic.   Little did we know our pizza would be covered with thick sliced RAW garlic!   Since the pies cook a very short time, the dough also does not crisp up, unlike NY style -- it is chewy, somewhat undercooked.   Could be some of the worst pizza in the city -- we will never be back!!!", "author": "Jim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Yes! It has a location., great quality pizza! Seating (so far) seems to be accommodating to small @ large parties. Rad spot certainly one of my favorite pizzas in SF.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "Ridiculously overpriced. Preface - I'm Italian and grew up in Rome.  That being said, starters: had the squid which was savory and overall good. Then we ordered the eggplant pizza and it was just ridiculously ridiculously overpriced (as are all the pizzas on the menu). Quality was OK,  pretty decent but not worth the arm and a leg that they charge for it...", "author": "Leon V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-03", "description": "We were disappointed in the pizzas after reading so many good reviews.  We ordered 3 pizzas and all of the crusts seemed undercooked. We checked with our server to inquire if our pizzas needed just a little more time in the oven, but he said that's the way they serve them.  So disappointing!  We expected exceptional pizza but the soggy crusts were a real bummer.", "author": "Lilikoikitchen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-16", "description": "Food great, service terrible. This was said by the party sat next to us but was true for us too. As we put in our name, we were told 45 minutes and I wanted to confirm that was accurate so we could go grab a drink elsewhere. We were assured it would be 45 minutes based on the wait list, but 20 minutes later were texted and asked to quickly arrive to ensure our table wasn't given away. We arrived quickly and were sat awkwardly in the middle of 2 parties. As soon as the party next to us left, we moved over for more space. The hostess quickly came over to tell us we needed to move back because a party of 2 needed that space. We were uncomfortable and asked to keep the space but the manager said there was a wait of an hour and forty five minutes and the waiting party would not be comfortable in the space. We tried to explain we had waited but again were brushed off and told we could wait for a larger table even though we had already placed our dinner order. When the party next to us was sat, we asked how long they waited, and they said 10 minutes. Because of the managements reaction, we asked for the check, and in fact we asked to speak again but the manager said \"we're not having this conversation\" so we opted to be done at that point. I live in the neighborhood and will not promote this place, it's great to back your employees, but they had no intention of hearing the customer. So unfortunate and I hope ownership evaluates management.", "author": "Kristin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "It was okay Pizza. Overall I felt Pizza didn't had enough cheese or toppings. It tasted too plain. Not much choice on dessert as well. But the service was awesome.", "author": "M E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-15", "description": "It kills me a little to write this review, but I'm still feeling a little miffed by my experience last week. First off, I've been eating these awesome pizzas from the truck for years so naturally I was excited (no thrilled) to hear that a brick and mortar restaurant was opening close to where I live. \n\nThe reason for my review. I think our order was forgotten because our pizzas took a long time to come, and tables that sat after us got their pizzas before us. This was fine, I was enjoying the place. When the pizzas did come, the sausage one was underdone. Not only was the crust gummy and underdone, but the sausage was raw on top. Scary considering I took a big bite before realizing it. It seemed like they were trying to get our pizza out asap and took it out of the oven too soon. The waiter agreed that the sausage was raw then quickly took the pizza away and said he'd order another one, although really we didn't want another one. He walked away before we could say anything. The manager did come over to ask if we were ok. The waiter didn't really seem at all concerned. After he dropped off the 2nd sausage pizza not once did he check back in with us to see how things were. Not jumping at the opportunity to go again soon, but I will say the margarita is delicious.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-14", "description": "I am sadden to say I will NEVER go here again. I am a regular customer here however I went o get a pizza not long ago and was turned away saying they were not taking to go orders because someone called in sick. The front desk girl told me they dont have enough time to take my order yet since I have gotten to go orders here many times and know that it takes approximately 60 second to take my order, another 6-7 minutes for the chefs to make the pizza and another 60-120 seconds for the waiters to bring me my order. I cannot believe I was turned away from this place. It takes less time and money to serve me and still make the same amount if not more than a customer dining  in. I will not go back there I was treated so poorlu and the front desk girl was extremely rude.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Have been an ardent fan of the pizza truck over the years and the brick and mortar location is just as great. The pizza is phenomenally good. Service was super friendly and well-timed. Not a huge fan of the bio-dynamic wine list, but that's a small drawback. The starters were all delicious, but the star here is the pizza, and the crust, sauce, and toppings are all spot-on.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Besides being hard to get a table, this is my favorite pizza place in the city. I have been a fan of their pizza truck for years and ecstatic when they opened a restaurant. Their service is amazing and everything on the menu is great!", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "Came here on a Saturday night around 6:45 with no reservation looking for a table for 3.  Told the wait would be over an hour... no problem as they took down my cell phone number and we went to the bar across the street.  After about an hour, they texted me they almost had a table ready for us, so we walked back and waited maybe another 10-15 mins... really popular place... I saw lots of people standing around and also some people getting pizzas to go.  We finally sat down and it's a limited menu that just has pizza, wine/beer, and some uninteresting antipasti dishes.  We got three pizzas and some beers... the sausage pizza had some noticeable spice to it, the margherita pizza was pretty standard and the potato honey pizza was actual not memorable at all.  The pizzas were the doughy-chewy type and I dunno, maybe I'm just done with all the dough chewing.  I mean it was good, but can't say it was special or super tasty... maybe we should have ordered something other than pizzas.  Service was great, and everything was smooth and easy once we sat down... well run business...just a long wait, slightly overpriced for pizza that didn't blow my mind.", "author": "Easter E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Holy. Heck! Amazing pizza with a great environment and friendly staff. Came here with my husband for a quick bite and a glass of wine & it didn't disappoint!", "author": "Brianne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Very good pizza and good service.  The salt cod fritters were good and its accompaniment of sliced avocado with chili oil tasted fantastic.  Personally, I am not a fan of pizza as a food, but if you have to put on a brave face and endure a pizza meal for the sake of other interested constituents, this is probably about as good as it gets.  The anchovy pizza and margherita pizza were good, but the bianca was a little too cheesy and slightly bland.", "author": "Richard P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "Del Popolo has found a permanent home. I'd always heard about the roving Del Popolo brick oven pizza truck and on a visit to SF was able to get in on one of the first nights in the new establishment. The salads are all different and delicious, and the pizza is the best! Four pizzas for five people was about right--I was partial to any pizza using the spicy tomato sauce that the chef favors-- particularly given that we ate more salads and other apps than we should have. Desserts were also sublime. What could be wrong? Nothing. The decor is suave and cool and not over the top. This is a must-visit. But go soon because I would expect that when the word gets out it'll be one of the toughest tables in the city.", "author": "daniel w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Went here for an early dinner on Friday night, and I am glad that my friend and I arrived early(5:30pm) because this restaurant filled up fast! Already when we arrived, the only area available was the communal table, which we were happy to sit at. If you are not interested in sitting at the communal table, I would highly recommend making a reservation. My friend and I split the short ribs and the margarita pizza. Oh my god, the short ribs. The parsnips and crispy brussel sprout leaves will forever be in my dreams, so tasty. The ribs could have been more tender, or we could have used a steak knife to cut them, but we made it work with a butter knife(wait staff was not around for us to ask for steak knife). The pizza was also delicious, I really enjoyed the dough and sauce was a good tomato flavor. We ended our meal with the chocolate pot for dessert and we were both quite glad we did, it was creamy chocolatey heaven. Would recommend this restaurant to others for the great food. Restaurant is on the pricier side.", "author": "Charlene R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "This place is alright, if you're just looking to get some pizza in a somewhat more fancy environment, this is a decent place. I liked the rustic style decor. The big party middle tables though are uncomfortable. They have small stool-like chairs that are attached to the table, they're uncomfortable and have no back or anything to hang your purse/belongings on. As far as food goes, the pizza was tasty, I liked the Bianca. It's extremely thin though, you can only eat it with knife and fork, and somewhat gooey. Wasn't a fan of the charred dough part. Beer is a rip off for a small glass. Overall I think this place needs to either step up their food and menu game, or lower prices a bit. 2/5 to the hostess with glasses, she was rude.", "author": "Keepitreal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Del Popolo is nothing short of amazing. Both the small plates and pizza are incredible. I am in San Francisco for a week for work and have already been in twice. I highly recommend the fritters!", "author": "Emily N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-23", "description": "We had the pizzas which were very good. I especially like the Bianca pizza. We went early so we didn't have a wait.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-05", "description": "I have come to this place two times hoping for great pizza.  Both times my margerita pizza has arrived soft and mushy, and lukewarm ... not hot with a crispy crust as I expected.  It was just surprising, seemed it needed longer in the oven.  Plus, there isn't enough tomato sauce on it.  Totally disappointing and I really hope they step up their game - this should be on par with A16, Delfina pizza, Beretta and Serious Pie in Seattle ... but it's so not.  The first time I almost asked the waiter to ask the chefs to pop it back in the oven - wish I had because I see another reviewer had the same issue so they've heard this before.  The second time I almost asked for more tomato sauce on it.  It almost seemed like there was water on the pizza instead of tomato sauce.  Service was excellent and I love the overall atmosphere/decor.  But this food disappointed royally not one time but two times.", "author": "Christin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Love love el-u-vee the new spot. Been waiting for this pizzaiolo to set up permanent shop for years. Glad he has his own space. If you missed him at Flour and Water, check him out now on Bush St.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "it was pretty great.  i've always liked the truck, but wasn't sure how it would translate into a brick & mortar.  and i'm really glad it was great, really great.  our server was friendly and fun, without being over the top.  he walked us through the wine list to make sure we enjoyed the bottle we were ordering.  we went with a bunch of small plates and two pizzas (for 4 people) and everything was really flavorful and delicious.  the squid starter and the squash blossom pizza were highlights.  make sure to save room for dessert - the nutella ice cream was sublime.  well done del popolo.  i wish you much success!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "This was my second time a Del Popolo and I have to say that I am incredibly impressed. The staff is the nicest and most high caliber group of people. Oh and the pizza is the best in the city. Thank you Del popolo for a wonderful meal and experience!", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "Ate here tonight and was really excited to check it out. A simple but inviting design with a large pizza oven as the focal point of the restaurant. We did not have a reservation but they were able to seat us at one of their communal tables. Note, they have these \"swinging\" backless seats that can get a bit distracting to sit on. Had their house cured bresalao which seemed good but the zatar was a bit overpowering. We then ordered a sausage pizza. The crushed tomato sauce was quite watery and light without much of a bold tomato flavor. The sausage could have been a bit more flavorful too. We also ordered a bianca pizza with salami picante (authentic Italian pepperoni). The ricotta was too subtle to taste like a good east coast white slice. Overall, the major drawback of both pizzas was the dough. While the crust had some decent chew and burnt bubbles, the majority of the dough, particularly that under the toppings was soggy and extremely chewy without any crunch whatsoever. The pizza tasted like something heated up in a pan. It was not at all what we were hoping for. My partner who cooks a lot indicated that it appeared to lack sufficient time to ferment as no hint of yeast flavor was present. The wine we ordered the Frank ... was an unfiltered wine and it was young and a bit steeply priced at $60 for what it was. It was also served a bit cold. Not sure we would return to this spot as the pizza dough was lacking in what we had hoped for.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-01", "description": "i was there with my family, party of five a few days ago. i thought since it is a wood burning pizza, it has got to be good. was i disappointed?  absolutely. three things. the pizza dough was too charred. the topping was unflavorful and very little. the pizza with the seafood topping was extremely salty, the price was a bit more than it should have been in my opinion. i would not recommend it.", "author": "Havin Chila G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "good food, love the small plates...really cute ambiance...a little loud though! but to be expected for a friday night but i had to scream to hear my table mates...", "author": "Anna S."}
