{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Damn best spare ribs ever. \n\nNow this is the epitome of hole-in-the-wall eats. It's a no frills, no nothing kinda establishment. But what attention isn't spent on the decor or customer service is spent on the taste of the food. It's one of those places even I don't like to sit and eat at but will buy their spare ribs just so we can eat it at home. They sell them frozen in Ziploc baggies too for you to steam up at home. No where else can you get this delicious flavor. \n\nNow I saw a review here on how there's no line or attentive service. Well that's the way it is man.  Have you not been to any of the most popular bakeries here like Napoleon/Na Po Lun 拿破仑? That's how we do it here in Chinatown. Now get yourself a back bone and get yourself some food. I'm getting hangry just thinking about it.", "author": "Lily F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-05", "description": "Overall - food was tasty but wasn't great. The thing that caught my eye the most was the sanitation. As soon as we sat down, we noticed the table had black grime all over it. The auntie came to wipe it down a bit, but I wiped a second time with a napkin and it was disgustingly black. All the tables looked to be in similar conditions. Overall, I would not come back based on the sanitation alone - if the hall is this dirty, I don't want to imagine what the kitchen looks like.\n\nPros - relatively cheap (~$26 with tax to feed two hungry and hungover people and still have some leftovers), Siu Mai had a very strong and delicious pork flavor, Ha gao was tasty, and the chicken feet was good as well. The chicken in the lotus wrapped rice was a bit salty for my taste but the dishes here were a bit aggressive overall (neither good or bad).\n\nCons - sanitation was a huge no no. Definitely not coming back based on this alone.", "author": "Jaesung J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-01", "description": "As everyone knows. Parking is almost impossible so take Uber guys!!\n\nCash only kinda place. You walking and there full with old Chinese folks I'm happy about this already. \n\nI only want to try shumai and shrimp crepes (white flat noodle wrap around shrimp and sweet sticky sauce on top) so I ordered those. Pork shumai is better than shrimp crepe that what I think. \n\nCleaning is not their strong suit. I guess, they gave me a pair of chopstick and they are sticky AF (some people will call it gross but idk I just clean them up with napkin) \n\nWell overall this place got 3 stars from me. Will I be back? yes. But it gonna be take out more than sit and eat there. \n\nPs. I might come by here in thanksgiving and buy some dimsum here if I host a party", "author": "Fah Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "A huge disappointment, one of my worst dim sum experiences in the world. I came to visit Chinatown with my family, and we expected there to be good Chinese restaurants for dim sum. I looked on Yelp and this was one of the few restaurants with a good rating, so we decided to come. We didn't want to fight crowds so we came for a later lunch, around 1pm.\n\nWe were immediately seated at a table directly at the entrance, where it was very windy because the door was kept open. We ordered several items quickly because we were hungry. I couldn't believe they actually served COLD dim sum to us. Not even warm at all. Including baked BBQ pork pastry (叉烧酥)! It was so bad we couldn't eat it. It might've tasted good if it was hot. A few other dishes were also cold but I don't remember which ones. The only one that was hot was 纸包鸡, which was wrapped in foil.\n\nOverall, we were disappointed by SF's Chinatown and especially by this restaurant. We are a family that have lived in China, HK and Australia, and we definitely know what's good Chinese food. A restaurant that serves hot food cold is just disrespectful.", "author": "Monica K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "Big mistake. Why did I even bother to eat dim sum here? \n\nAlright so I was visiting San Francisco and being the huge dim sum lover I am, I decided to try Chinatown's dim sum. I mean, it's freaking chinatown. Where else would I go for amazing dim sum other than getting it from the Chinese, right ?!??\n\nSo, I enter this establishment with my wife. Yuck. Dirty ass floor. Dirty ass tables. Sticky chairs. Chopsticks they gave us were still greasy and unsanitary. Gross right ?\n\nNow the food. Hai gow and siu Mai. The two Staples. Ordered them both. Threw on some of that sate chili sauce and some soy sauce. They were both eh. I swear something I ate had msg all up in it. Maybe the sauce? No idea. But later that night, I did not feel well. Yes, the toilet bowl had a taste of what I had, and it sure wasn't pleasant. \n\nFood sucked. Place was dirty. Parking was expensive as heck. Not coming back. Rarely do I give 1 stars but man this place is 1 star or maybe even zero. Don't bother guys.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Any place that's cash only can only get 4 stars from me because that's just selfish. I ordered the fried shrimp dumplings and the shrimp and Chinese chives dumplings. Both of them were really delicious but definitely need some rice or vegetables to go with it. They are both very salty so it was kind of hard to finish both plates. It would probably have been better if I was sharing it with someone, as you are supposed to do with dim sum. \nThe hours for this place suck but I guess it's meant to be a breakfast/lunch place even though I think I'd consider the food dinner food. \nOverall, the food was great and you should definitely try it", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "I love Dol Ho, I didn't know why I only put 3 stars before.  Over the years, I have bought dim sum to go, this is cheap dim sum we call it, rustic and not the fancy pretty plated ones you see at Yank Sing.  Nonetheless, it is absolutely delicious and with these kinds of cheap pricing, it makes me feel even better.  This the first place I had rice in metal jars, other spots have grown to add this item, but Dol Ho may be the first in chinatown and definitely the greasy durty best.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Summary: One of the best and cheapest dim sum places I have ever been to. Would recommend. We signaled to a woman that we wanted a table for 6. I think we got lucky with wait times because we waited less than 15 minutes.\n\nFood 5/5 - Some of the best Dim sum I've ever tasted. Large portions, unlimited tea, with water and other beverages on request. We ordered items like pork and shrimp dumplings, chicken feet, turnip cakes, etc.\n\nPrice 5/5 - the price was $63 without tip and it was a group of 4 guys and 2 girls and we ordered a lot! \n\nService 5/5 - Everyone was super prompt with service and we got a lucky seating right next to the kitchen. To pay the check all you have to do is walk up to the counter \n\nMy only qualm is that the venue was a little cramped and old fashioned but there were so many pros about this place I did not include that into the rating. A little background, I have only had dim sum in the San Diego area and it's crazy expensive and less tasty.", "author": "Liangcheng R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Don't expect to be bedazzled with shiny cutlery and modern furniture. This is a local experience, and you will be surrounded by the Chinatown elderly - usually alone - getting their morning fix. \n\n* Spareribs over rice A++ : Plentiful and flavorful! First time seeing the over-rice version, which was served in a tin \n* Cha siu bao: Just ok, have had better elsewhere. Lacking meat \n* Fried tofu with shrimp: Scrumptious! \n* Shrimp rice roll: Thicker rice skin, which was VERY unique and delicious\n\nEverything is $3-5. Can't beat that.", "author": "Vickie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "I don't know what I was expecting when I walked in, but this was not it. My family and I came in and we were very confused about where to sit. The tables are communal and the place looks a bit dirty. \n\nWe didn't know what they had to offer because we were never given a menu, so we just looked around us and asked for things from people pushing the carts. Speaking of carts, these were the most jankiest carts I've ever seen in my life. \n\nAll of that aside, the food was pretty average, but on the good side of average. I would just order what you normally get at dimsum restaurants because they seem to have all of those. \n\nI don't think this would be a good place to go if you don't speak Chinese because I didn't hear an ounce of English in there. I'm not sure if I would recommend this place, but if you're looking for decent dimsum at a sit down restaurant and don't mind a little grime, this could be the place for you.", "author": "Alexis T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-11", "description": "Avoid this place! See pic. Pork buns had very little meat! I bought a dozen and 10 of the buns had barely any filling!", "author": "Peter A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I came to Chinatown wanting dim sum, and wanting something authentic. Oh boy did I get that at Dol Ho!  Firstly, they accept cash only, so come prepared. Secondly, I noticed that I was the only non-Chinese person in the small cafeteria-like space, and it seemed like most of the patrons were elderly folk. Finally when I requested a seat for myself, the lady working the counter quickly looked around; and at the first sight of someone barely ready to go, she quickly tried to shoo them out the door. I took these all as signs that I found what I was looking for haha. \n\nApparently here they try and fit you wherever is open, so I was seated at a table with 5 other people. I've been to a couple dim sum places in Atlanta where the carts weave between tables and you pick what you want. I'm honestly still not sure how their syterm works here. I saw a cart come out with some food, and people swarmed it and pointed and picked what they wanted. Afterwards I was given a menu. \n\nLuckily another cart came came out with the pork and shrimp dumplings I wanted. I asked if she had shrimp toast. She didn't, but eventually she came out later just to bring me one. So I guess you can put in orders with any of the workers there. \n\nAs for the food, I got the dumplings, shrimp toast, and a bowl of white rice. The dumplings were fantastic. The shrimp toast was pretty good, but not really crunchy/toasty how I like it. Rice was a little overdone. I would give this place 4.5 stars of I could. Truly an authentic experience with mostly delicious food. \n\nAlso I wanted to take pictures of my shrimp toast, but after I took a picture of my dumplings, I could feel one of the grandma's across from me judge me (trust me, I know that look!) Being the dutiful Asian that I am, I didn't want to disappoint grandma again. So no pictures of shrimp toast :(.", "author": "Alfie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-06", "description": "Honestly, I only came here for the fried shrimp balls but there were many things that bothered me.\n\nMAKE SURE TO WASH YOUR PLATE, CUP, & CHOPSTICKS WITH THE HOT TEA. Things are very dirty here.\n\nLet's start with the positives: MUST GET FRIED SHRIMP BALLS. They're cooked and seasoned well. If you're a tourist and really want different, just get the fried shrimp balls. This is my only positive. \n___________________________________________________\n\nNEGATIVES\n\n(1) Poor Cleanliness. The waitress used a dirty, wet towel to wipe the old bones and food off table. She didn't bother making an effort to wipe it. IF YOUR FOOD FALLS ONTO THE TABLE, DO NOT EAT IT. \n\n(2) Poor Service. We ordered about 4 or 5 places of dim sum. It took a longer time for each dish to come. \n\n(3) CASH ONLY. Very inconvenient. I find it shady that businesses do cash only to avoid paying tax.", "author": "Mandy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Delicious things come in fours instead of threes!  Total fan of this place, hole in the wall but DELICIOUS!  Will go back!", "author": "Denni P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "Came here and got a variety of dim sum. To be fair, we came here and a lot of things were gone like chicken feet, sticky rice, and some buns. However still tried a bunch of things like dumplings, spareribs, tofu.\n\nAll in all, nothing spectacular. I came here hungry, and left a little under content because I wasn't very motivated to eat the food. It's nice that you can sit down, but the food is just plain. It's like the minimal amount of flavor you need to make the dish pass. My favorite was actually the sesame balls. Probably won't come back again, better options for cheaper like good mon kok", "author": "Victor D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "Cheap dim sum can be found, but not the best quality. I came in on a Friday morning around 9:45am, and they were busy but there was only a short line. They have a menu in English posted, so you can order from there or point at the items that you can see in the display case. I tried:\n\n-Fried Meat Dumpling (https://www.yelp.com/user_local_photos?select=nM-xmq-vJ7JZblmdkH9tPA&userid=76vIFZcC7owykCBjMfGVXg): Ok overall- Nice and crispy on the outside, and the filling had good flavors. However, the taro was very heavy and I was pretty full after only eating one. I probably wouldn't get this again.\n-Shrimp Crepe ($4.00, https://www.yelp.com/user_local_photos?select=3_r7cxpOszF1gFYaEjDcDQ&userid=76vIFZcC7owykCBjMfGVXg): The rice crepe was surprisingly soft, but this roll has a lot of crepe versus shrimp. It was a good portion for the price, so I would get this again.\n-Shiu Mai (https://www.yelp.com/user_local_photos?select=pF0JrPRilz36kUlBbIx-Ng&userid=76vIFZcC7owykCBjMfGVXg): Pretty good, and this had good flavor. However, the pork was a little chewy.\n\nI wouldn't go out of my way to come back here for dim sum, but would come back to pick up a couple items to go if in the area.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "Food was 2.5 stars. Service was 4 stars.\n\nI came in and there was a good amount of people eating and waiting in line to order for take out. There wasn't much of a line and I felt like I was at a bar trying to order a drink. Chaos I tell you!\n\nA bunch of older ladies cut in front of me, but the one lady who was running the show knew I was there first and saw I was lost and asked if it was to go or for here. \n\nShe sat us down because we were going to eat there and we were promptly given a menu after she told the waitress we were eating there. I wanted to try an array of dishes. Prices were so good!\n\nturnip cake\nDefinitely not what I expected. Texture was that of gelatin, more than a cake. Nice sear on the outside but it was room temp. Maybe because we got there 30 min before closing.\n\nshrimp dumpling\nTaste fishy, and not fresh\n\ncrepe with cilantro\nIt wasn't what I thought it was. I was expecting a flour egg crepe but it was a rice noodle with soy sauce dressing. It was actually pretty good but the noodle was a little over done\n\nBBQ pork pastry and bun \nDefinitely liked the bun better than the pastry. Maybe because the bun was nice and warm\n\nwell reviewed pork over rice\nI was very disappointed in the one. The pork wasn't tender. It wasn't cooked long enough. The cartilage was still hard.  The sauce was thick and mushy. There was one rib that I ate that tasted rotten. As if the pork that was cooked wasn't fresh. Then while my bf tried one while he was poking around, there was a purple dot thing on one of the ribs. Maybe the pork wasn't fresh? I've never seen anything like it. I didn't have time to take a photo of it because I was turned off by it and the rotten rib I had tried.\n\nI guess this is the type of fast food locals like to eat. I did come because of all the rave reviews. But I didn't feel like there was cook for quality. More for cook for the mass. \n\nThey also aren't very keen on keeping the place tidy. We asked to get the chili sauce wiped off the table, and she just came to use a napkin to smear it around the whole table. \n\nThe bowl the rib and rice came in was sticky on the outside like it hadn't been washed.....this place is very sketchy.....\n\nIt is a local place, it is cheap, and I don't mind giving those small shops a try. But I wouldn't be surprised to see a health inspector come by to say this place wasn't sanitary.....\n\nI would shop around for other dim sum places as there are a ton in chinatown", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-27", "description": "If price were the primary concern, then Dol Ho would rate at least 3 Yelp stars. The prices are cheap here, but you get what you pay for. \n\nAs for nuanced, balanced flavours and chefly technique & competence, you won't get it here. The dim sum at Dol Ho may be closer to home style cooking made without much finesse or sparkle by a favorite aunt who is culinarily challenged, but her heart is in the right place. \n\nStaff is friendly enough toward non Cantonese speakers although there will be some communication faux pas. Food may be closer to 2 Yelp stars, but I would like to give my favourite a one star up to 3- Yelp stars.  \n\nDefinitely for people who want quantity & rock bottom bargain basement prices. Whatever happened to such formerly excellent places such as Ton Kiang of the early 2,000's???", "author": "Gary I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "Excellent BBQ pork buns and sticky rice and chicken in leaves. Dumplings look good but as they all contain shrimp (which I'm allergic to), I had to skip them. We ordered 6 plates and the total was less than 25 dollars.", "author": "Vivienne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "CASH ONLY!!!!!!!!\nI'm no dim sum connoisseur but I thought Dol Ho was pretty good given price and barely having to wait (I'm so used to loooooong lines for dim sum places in the Richmond district)! I liked the steamed bbq pork buns (which you order at the front rather than wait for a cart to come by) and the spare rib rice. Careful when you chew the spare rib rice! I chomped on a bone and my teeth felt weird all day. I came here with Chinese friends who did all the talking/ordering, and I would've been lost without them. Something that surprised me is that one of the servers just started putting 4-5 dishes on our table when we hadn't ordered anything... it's on you to tell them which ones you don't want so that they take it back.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "I love me some authentic, hole-in-the-wall feel type restaurants. If these old people are eating at this joint, and they don't speak english, you're in! LOL. Just my recommendation....don't come alone cus they'll stare at you and judge you for wanting to try like 10 things since you're not from this city. Yes, I was that one girl who had like 4 different dishes... I mean, it would have been like 8 different dishes but like I said, they were staring at me like \"girl, why you alone and eating all that?\" in my mind, I was thinking, \" i aint' gonna eat this all. Can a tourist just taste what all the hype is?\" LOL. Yeah, yeah. \nSo for starters, DO try the spare ribs over rice. Tender, succulent spare ribs in their tasty black bean sauce over rice. Yes, it comes piping hot! Definitely enough for 2 people too. Next came the sui mai and the chicken feet. Soooo good of chicken feet. Definitely hella succulent and fall off the bone, melt in your mouth tender. Loved the flavors. The pork sui mai was okay--it reminded me of stinky pork, so that was kind of a turn off. But it had a decent taste to it. It definitely wasn't my favorite. The fried stuffed taro though... that was amazing! I loved how the filling had curry flavors in it and the taro itself was crunchy and had amazing textures. I loved this one the most!! Did not get to try the beef balls, but everyone was ordering that and the shrimp noodles.\n\nThey greet you, give you a menu, and you sit where you can fit! Food comes in different rushes, but they always remember your order. The chili oil is good (nothing different than other restaurants, in my opinion), so eat it with that. Otherwise, I had a good experience for the most part. I loved how authentic it felt. Hella cheap, and really fresh!!! Cash only! :)", "author": "Tan Lo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Dol Ho is my absolute favorite place to get dim sum in San Francisco. This is the real deal: Everyone speaks in Cantonese, you will share a table with an old Chinese grandma/grandpa, the atmosphere is nonexistent, the wait staff does not wait on you, BUT you will leave having had some of the best dim sum in your life.\n\nI grew up eating dim sum, and they have some dishes here I haven't even seen before. I don't even know the name of some dishes. The MANDATORY items: Steamed taro wrapped in vermicelli, spare ribs over rice, and the marinated chicken wrapped in aluminum foil (clearly don't know the names!!) \n\nIt's cash only, so come prepared.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "My aunt told me there's nothing great to eat in chinatown and I had to prove her wrong! A party of 8 of us came to this little dim sum place and found this hole in the wall. It's definitely an old school dim sum place as all of its interior decor and furniture is super run down. But that's how you know it's legit! The best thing here is their chicken feet and rice noodles! Their rice noodles are definitely house made because it was so thin and soft! None of that super thick processed rice noodles you normally get at the fancy dim sum restaurants. We got 3 different types of rice noodles - cilantro, shrimp, and beef. The cilantro one was very refreshing and is perfect for my vegetarian friends. I usually don't like beef rice noodles but this was REALLY good. \n\nThe reason why it got 4 stars is because the standard dim sum items such as Har gow and siu Mai was sub par. I wouldn't come here for those items as it doesn't seem too fresh.", "author": "Chi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "Unbelievable spare ribs over rice.  You. Must. Get. This.  All the locals do.  Big portion, gear price.  They serve the spare ribs over the rice so the oils and juices get into the rice.  A mazing.\n\nThe chili sauce they make in house is equally awesome. My go to in china town now", "author": "Joshua T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "If you have an Anthony Bourdain sense of adventure, this place is worth a try. Dol Ho appears to be very authentic, set right in the heart of Chinatown.\n\nCraving dim sum, me and my boyfriend ventured out on a Saturday morning.  Food is available to go or for dining there. We decided to wait for a table as it was fully packed.  It appears to be a local favorite, with many elderly patrons.\n\nWe weren't sure whether to order off the menu or wait for the girl with the steaming bowls of food to come by.  As we were deciding what we wanted, she came out with Crispy Shrimp Balls; Stuffed Bell Peppers; Shu Mai; regular Shrimp Balls; and Paper (actually foil) Wrapped Chicken. I couldn't get the foil off the chicken to eat it, so I skipped that and ate the other items, which were delicious. A steaming pot of black tea was served to us without asking, very welcoming on a chilly December morning.\n\nThe atmosphere here is very casual and basic.  Tables are very close together. Various guests would wander back and forth from the kitchen, making the restaurant feel like a real neighborhood hang.\n\nBy the time we left, we were stuffed. For five small plates filled with food and tea for two people, the bill came to just under $20.  It is cash only here, so come prepared. Tips are collected and stored in a large steel pot for sharing amongst the restaurant staff.\n\nWhile I'm not sure whether I would go back, dining here was a very interesting experience, and a very authentic taste of Chinatown.", "author": "Lynda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "Authentic place for dim sum and apparently a favorite for locals. We tried\n1. bbq pork bun: the buns are very sweet\n2. Custard buns: same as above\n3. Spare ribs: everyone loves it\n4. Sticky rice with chicken: it came with two portions\n5. Chicken feet: great!\n6. Salty dumplings: very good! On the sweet side as well\n7. Tofu with shrimp: average\n\nEverything tastes good and the service was great as well. I will highly recommend this place.", "author": "Sunny X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-08", "description": "Food was very tasty.  We got so much dim sum here and it was so cheap too.  We got the hagou, shrimp paste in pepper, shrimp paste in eggplant (not as tasty), deep fried fish ball, and some other stuff that I can't remember.  It was all very very tasty.  However, I quickly lost my appetite when I found a curly thick hair embedded in the deep fried fish ball.  I dare not to think where that hair came from... yuck.  How gross.", "author": "Grace W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "We were staying in SF Chinatown and were in the mood for some HK style cart dim sum. I've tried carryout dim sum from Good Mong Kok Bakery the last time I was in SF and wanted to find a place where we could sit down for once. Came here after reading the recommendations on yelp and was unfortunately very disappointed.\n\nThis place is very popular with the locals and it seemed as though their specialty item is the \"pai guat fan\" which translates to steamed pork ribs over rice. Didn't get a chance to try this but it comes in a metal pot and is doused in some sweet soy sauce.\n\nBeef steamed rice rolls - ok\nBeef meatballs - same meat as the stuff they put in the rice rolls. Would prefer to get it with the rice rolls to balance out the saltines\nHar gow (shrimp dumplings) - way too small, not enough flavor, and doughy sticky wrapper\nShiu Mai - chunky greasy pieces of pork gristle, not my favorite\nEgg custard bun - large chinese sweet bun with egg yolk custard. Was ok.\n\nI can't help but use the word \"okay\" throughout this review because nothing stood out. It was relatively cheap, nothing impressive.", "author": "Alvin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "My husband and I are new to the Bay Area and wanted to give this place a try for dim-sum. This place is one of the most authentic dim-sum places we have ever been. \n\nYou walk into the restaurant and wait in a line. (People occasionally cut the line to order dim-sum to go.) No one is there to seat you, you basically wait until seats open up. A gentlemen behind me pointed us in the direction of two empty seats. We shared a table someone else, it seemed to be that many people shared a table. \n\nThere were no menus just a woman who would bring out a cart with different food selections. Because the tables were so close she would make her way through and would ask what we wanted from the cart. Once she gave us the food she would make a tally mark on our order sheet that was left on our table. The gentlemen we shared the table\nWith was very kind, he must have told one of the waitresses that we wanted water because she cane back with two glasses and a water pot! We were doing fine with the house Tea but had some water since he so kindly asked. After our meal we thanked him for sharing the table and he simply smiled and waved.\n\nTips:\nIt's cash only\nBe patient because the food comes out in waves\nBe ready to get cozy and make new friends\nGo with the flow and enjoy\nYou can get some pastries to go at the front!\n\nNext time we will most likely take our dim sum to go, the food was delicious and well priced! We had about 6 items from the menu (shrimp dumpling, shrimp roll, shrimp/fish ball on green pepper, shrimp ball, beef balls, and pork with rice) all for $24.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-16", "description": "Would really give no stars if it was an option. My 3 friends and I waiting a long 20 minutes just to get our own seats. There is NO customer service at all. There were no organization or \"real line\". The line to order \"to go\" and \"dine in\" were mushed together. The people behind us were getting seats before us, so we decided to sit ourselves as soon as customers paid & left. We sat for another 10 minutes while customers around us were getting food and tables got waited. Our table was messy from the previous customers and they paid no attention to the mess or us. No one greeted us or asked if we wanted anything to drink or better yet, offered to clean the mess. The lady with the cart never made it past the first two tables by the exit from the kitchen anyways. After sitting for awhile we decided to leave. \n\nWe did not get to experience the customer service nor the amazing food other Yelpers were raving about. However, I found a better place down the street for similar pricing and better organization and customer service. I will not be giving this place another chance. Go to Great Eastern Restaurant instead y'all.", "author": "Brenda V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Delicious food, but questionable service. Typical of small, local Chinatown eateries like this, but service was so slow for us and it'll probably be a little more difficult for those who don't speak Chinese (but not impossible). The food itself was pretty good though, one of the yummier dim sum places I've tried!", "author": "YL L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "If you're prissy, the kind that wants to be treated like kings and queens, stop reading! This place is not for you. If you're cool and just want good tasting food, proceed!\n\nSuper good, Cheap, and Authentic Dimsums. So authentic, you'll think you're in Hongkong or mainland china because you really can't rely on a good service or clean place. If you need or want something, ask! They won't offer anything. Lol. But food wise, everything taste good. I love the Shu Mai, Spareribs, and Ha Kaw the best! Love the sesame bun too but they run out of these fast!\n\nFor the price, We had 10 dimsum orders, 2 rice meals and 3 soda. All for about $40+\nBest time to go is after the lunch time craze. Or else you'll have to wait and find a table on your own. \nOh and good luck with parking! We always do garage parking on the street before Dol Ho.", "author": "Anne D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-30", "description": "Came here after 12 on a Saturday afternoon for dim sum - it was packed so we had to wait a little bit for a table. Ended up at a shared table with two other people. It's a hole in the wall - lots of Chinatown locals and it's the type of shop where you can eat in or order to go.  Place seats about 30 people. \n\nService is definitely lacking - workers barely made eye contact with us. We semi sat ourselves - this nice old lady customer told us to come take her table as she was getting ready to leave. We lingered there wondering if it was ok to take the table and we just sat down since no one really acknowledged us. \n\nOrdering also took a long time - again, the lone cart lady barely made her way to us and it was hard to flag anyone down as eye contact was avoided. Once we did get help, had no idea what the lady was saying. I still don't know if we are supposed to order from the menu or take what we could from the cart. \n\nOnce we finally got food.... Portion size was great. Quality ranges from so-so to decent. Some dishes were room temperature which I didn't fancy too much. Pricing is about $3/$4 plate (mostly $3). \n\nOverall, this place offers large portions and is budget friendly. Unfortunately, the lack of service plus the mediocre food cancels that out. I don't feel compelled to come back again.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "We stopped by the other day in the morning and it was packed with old Chinese people.\n\nOnly non-Chinese speakers were us... LOL\n\nLiterally, there is no parking. Streets are all packed and so much construction going on.\nWe found a parking garage one block south from this place. It was $3 per 30 minutes.\n\nYou will be sharing your table with other customers which is common in SF Asian restaurants.\n\nTheir menu is very concise. $3.25-4.25, very reasonable.\n4 dumplings come on 1 plate.\n\nThe way they call is different from how I know, so they call the shrimp look fun \"crepe\" instead.\n\nI had to ask the waitress to find out.\n\nAnyways, we ordered most basic dimsums: shrimp dumplings, shrimp and chive, fried shrimp ball, stuffed eggplant, and shrimp crepe.\n\nThe taste was ok. Not great. \nI have had better dimsums.\n\nSome came kinda cold. They were serving plates that were sitting around instead of just cooked ones.\n\nHence, I give 3 stars.", "author": "Toshie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-09", "description": "While my friend and I were visiting SF, she wanted to try out the dim sum there to see if it's any better than NYC. Short answer: DEFINITELY not.\n\nLong answer:\nWe were looking for a sit down place and Dol Ho had some really great reviews. So we went in on a Monday at around 10 in the morning and we to one of the last tables. Looking around, there were quite a few older Chinese people, so we assumed the food would be good and not a tourist trap. Sadly, we were mistaken. Everything we tried (shrimp churng fun, shrimp dumplings, chicken feet, shumai) were all just mediocre. The only thing that I actually liked was the meatballs. Their chili oil definitely made everything else better tasting so I ended up smothering everything in that.\n\nService is pretty much what you would expect at a Chinese restaurant. Only, it does take a while to get your food, unlike the cart-pushing places in NYC. They don't have carts of dim sum here. Somebody will come and take your order of the dim sum you want.\n\nMaybe next time, I'll just try one of those 'to-go' dim sum places.", "author": "Mel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "I dont comment much but for this spot i have to. Dol ho is definitely the best dim sum spot in san francisco. Service is a lil weird but you'll get over it. \n\nRecommendations are;\n- beef crepe \n- shrimp toast \n- BBQ pork pastry (my sister's to die for item)\n- steamed pork ribs over rice \n- pork and salty fish over rice\n\nOver and out.", "author": "Mu C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Can you hang with the locals? Not intimidated  or frustrated not being able to speak and understand Chinese, but you can read a menu in English, then you're good to go. Just point at the menu and the waitress will know what you want without even writing anything down. Most things are made to order and brought out to your table steaming hot. Everything was tasty and I would definitely return.", "author": "Gary W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "Do come for the spare ribs over rice (to go version). That's it. \n\nOverall food quality is barely ok. You can expect dirty food crumbs on your plates. Dishes are either $3 or $4. Service is minimal. \n\nDo yourself a favor. If you're going to have sit down dim sum, go elsewhere. If you're only craving spare ribs over rice, then come here.", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "Talk about a hole in the wall. You have to come here with a local who's not afraid to vocalize their wants and needs, preferably in Mandarin.  My dad took us here on a recent visit because the line at The Great Eastern was way too long.  \n\nThis place serves up authentic dim sum and communal tables.  We waited about 5 mins before seeing a group of 4 get up so of course we pounced over there hovering while the other patrons were still gathering their belongings.\n\nOnce seated tea and table settings are quickly produced and then the waiting game. We sat fairly close to the kitchen so we were able to wave down the one lady with the carts as soon as she stepped outside of the kitchen. There was only one cart at a time in the dinning room but it looked like she made quick work of the rounds.\n\nThe servers speak extremely limited English.  The dim sum was delicious if not somewhat standard. I don't think they had juicy dumplings. Skip the restrooms. \n\n3.5 stars for the authentic Chinatown experience.", "author": "Han D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Dol Ho is a wonderful little restaurant in the heart of San Francisco Chinatown that serves up the basics of traditional dim sum!\n\nI came here with a group of four on a Sunday for a nice dim sum lunch. We were able to get a table promptly though the place was quite packed. It seemed like a lot of people come here for take-out though. Dol Ho is not your clean, modern style dim sum spot, but more so a simple, dirty, and traditional place very fitting of the Chinatown area. This gives the place its own charm in a way. The dim sum here is all very good and I found myself enjoying every bite very much. I typically am not a huge fan of the meatballs at dim sum restaurants, but I found the ones here to be exceptionally good. One other item I found interestingly good is their mini rice bowls which come with various items such as pork spareribs and chinese sausage. They come with a sweet soy sauce which mix in with the rice very well.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "I was always skeptical about this place but my fiancé always has a way of converting me & making me a believer.\n\nThis place is a hole in the wall like everyone else has stated. I do wish they'd clean up a little bit more but it is what it is, there's no frills and thrills here, only good & cheap food!\n\nDon't expect good attentive service here, you're lucky if you get a greet. Majority of the time, you are expected to come in, find a table and seat yourself. Don't expect to have the whole table by yourself because someone will always be joining you in the empty seat next to you, it's the whole Asian communal table way aka \"dop toy\", which translates to stacking tables, which really isn't that bad. I love watching and studying how other people adapt to this place, their ordering style, what they order, what do they do while they wait, etc. Trust me, the OGs that come here are some of the most interesting folks you can watch & study! \n\nIf you're a noob to this place or not the regulars, the server come over and ask you what kind of tea and what food you'd like. The OGs aka the old grandparents that come here often actually just get up and make their own tea and servers have memorized what their regulars order. \n\nFor the two of us, we would usually only spend under $20 on dim sum here, which is a steal, considering that we've racked up $100 tabs elsewhere. My absolute go to is the spareribs rice, it's freaken amazing! They have the most flavorful spareribs I've ever had and they've mastered the rice and soy sauce. It's comfort food for me, it really brings back childhood memories of my mom always bringing my sister and I sparerib rice plates after school.\n\nTry a bit of everything here, it's all good food and it's very friendly on the wallet.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "MY husband and I were looking for authentic dim sum.  We found it here.  Small hole in the wall place gets busy in the morning.  Communal seating is here. The servers here are dominantly Chinese speaking.  Luckily, they had a small menu of what you can order.\n\nThe food is good and the real deal.  All so tasty and legit.\n\nGotta stop by when you're in the mood for good Chinese food.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "CASH ONLY!!! This dirty hole in the wall dim sum shop is really good. The steamed items are fresh and at least the items we tasted were good. The best item IMO is the salty fish with pork patty over rice. It's a very asian dish so you should probably already enjoy eating salty fish before ordering this.  Also, don't expect much in terms of service. This place caters to the locals and if you want something you go and get a wait staff and tell them what yo bring you. It may be a little difficult for people who do not speak Chinese to eat here.", "author": "F H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "Great service, even for our party of NINE.  It was a nice dim sum experience and very affordable.  Fed nine people full for $80 with tip!  The food was good but not great.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "It's a small, definitely no fuss place, but we thoroughly enjoyed our dim sum meal with lots of delicious shrimp and pork options. Great foil wrapped chicken. We ate well and the total cost was under $10 a person. Will definitely return!", "author": "Colleen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Best Dim Sum I've had for its price. Better than some restaurants. We keep coming back. Pork ribs with preserved black beans are a must. Their char siew paos and puffs are the best I've had at this price point. In all $23 for all this food. The shrimp used are large, sweet and juicy.", "author": "Wei Lin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "This is a locals spot that specializes in steamed spareribs and rice ($4.25). Everyone gets it to go or if you want to fight 89 year old Chinese ladies, be my guest. As a Chinese person, the food is decent, but not for the faint of heart if you don't know what you're doing.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "Cheap. Poor service. Decent dim sum, but not a large variety. It's always filled with Asians, so you know it's authentic. Caveat emptor, unless you order in Cantonese. If you don't, expect to order by pointing and gesturing at the cart they roll around every five to ten minutes.", "author": "Yves L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Yes yes yes!!! The real deal is here. They do not speak much English But they will understand you. \n\nFood Great. Wow the best and original dishes ever. \nService Super. All the servers are so sweet and nice. \nPrice super! \nLocation wow!\n\nPlease visit this please you will love it. \nOnly cash!", "author": "Cris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "Shrimp chive dumplings were the best thing on their menu I think. The environment was full of loud, Chinese folks.", "author": "Kissy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "I didn't have enough time on this last trip to contrast multiple dim sum places, but I want disappointed with this one. It was pretty much what I was expecting: loud, busy, chaotic, not terribly clean, not particularly focused on customer service as many Americans have come to expect it, but tasty and relatively authentic culturally.\n\nThe other folks who were with me....uh, maybe it was a little more authentic than they'd expected. Tough cookies, kiddos...eat up!", "author": "B. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "After going to a nicer, expensive dim sum restaurant in SF, I was eager to check out the opposite side of the spectrum. Dol Ho is a gritty hole in the wall in Chinatown, packed with locals. I ordered three dishes to go: steamed hum bao, har gao, and short ribs over rice. Each cost ~40% what I spent at the other place, though with a bit of a dip in quality. The short ribs were questionable, but the har gao and hum bao were perfectly serviceable. I'd love to come back and power-eat my way through the menu on the cheap with some friends", "author": "Abdullah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Cheap, fresh, tasty. Not a fancy place, mostly populated by Chinese regulars chatting away and reading the newspaper.  You sit at communal tables but don't expect too much chit chat from them if you are an outsider. We had shrimp flat noodle, har gow, chimp chives dumpling, and shrimp crispy ball, and shark fin dumpling -- bill was $23!", "author": "Mary K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "DANG! This place is the real deal. I suggest you come in with a group of four or more so you can try more. It was just two of us and we filled up too fast. \n\nIt was packed on our visit. We were the only white people there and clearly novices. The conscientious server brought us hot tea and a plate of delicious pork pot stickers to get us started...figuring, I'm sure, that everyone likes pot stickers.. and of course we do and did. Next came the cart and we picked out the fried shrimp balls and the stuffed eggplant. Both were amazing, but each plate had four servings, two more than we needed. Next we ordered the steamed beef crepes and the pork buns. The crepes were lovely on the plate in a small pool of soy/brothy goodness. As for the buns, we've had versions of these that we preferred at other restaurants, we thought the filling to bun ratio was off.  We left too much food behind, we probably had enough for four people to eat and the total for our meal was under $20.  Such a deal.", "author": "Diana D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-04", "description": "Service was horrible. We were seated all the way inside a longer table with other people sharing the table, an older Chinese couple sitting next to us, sharing the table saw how even when we try to get the staff's attention to order everyone ignored us, they kindly got up and informed a staff member for us that we need to order. \n\nWhen the staff came to take our order, she kept telling us literally everything we tried to order that they are out of it. We tried asking her what are we able to order? She then just talked to us in Chinese although we do not speak Chinese. We kept seeing the food she claims they are out being served to people in the restaurant, and when we asked how come they get the food, she just said \"last one\", assuming she's saying those are the last orders available for those dishes. \n\nAt any rate, as we already wasted 40 min just trying have someone take order just to be told we can't order anything because everything is \"out\". We just left the place to grabbed dimsum at another place nearby in which the food was great and staff were kind and welcoming.", "author": "Jihye J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-16", "description": "We came in for a quick snack Monday afternoon. The waitress barely said three words, threw a menu at us and literally piled plates/silverware/cups/tea/chopsticks/napkins on our table and was a bit rude in doing so. The menu is small so we ordered two dumplings and the bbq pork buns. The pork dumpling wasn't good, my fiance said the shrimp & chive dumpling was tasty and the bbq pork buns were good as well. Everything came out right away so that was nice.", "author": "Terah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Their dim sums are great!! I love their shrimp meat ball, so amazing! I think they ground the shrimp meat and then deep fried it. OMG, first time in my life having something like this. It's crunchy outside and so soft, so juicy inside. I would give this item a 10 stars review if I could. \n\nHowever, you do need to bear in my that the restaurant itself looks pretty low end. If you need to eat in a nice environment, this is probably not something for you.", "author": "Christian W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "This place was packed with their regular customers who were mainly an older generation of Chinese people. Tables are shared with other parties. The regulars were seen going to the kitchen and getting their own tea & cups. The popular dish there was the spare ribs over rice for $4. The chicken combination roll was the best thing we had. Fried stuffed tofu had no flavor.", "author": "LC M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "This is Po Po and Gong Gong's playground. All of Chinatown's elder folks come here and rule this joint. We were waiting for a table and next in line. A table opens up, and I'm hesitant on whether I should seat myself. Two g-mas barrel over me and take the seats for themselves. Dannnng son, no mercy for outsiders. \n\nI came here because of their sparerib with rice combo. For $3.75, it did the trick. All the other dim sum is really cheap- around $2.50 a dish, say whaaa. Their daikon cake was a bit too thick for my liking though. \n\nTwo Tips:\n- Peak hour is 12-1pm on weekdays. Chinese elderly are VERY regulated on when they eat (my Gong Gong is living proof). So, it will be very crowded then. Come around 11am or after 1:15pm to miss the crowd. \n- Service is VERY slow during peak hour. One person rolls out the cart and moves around very slowly. So slow that people from other tables get up, walk to the cart, and grab dishes for themselves. \n\nCome here for a unique cultural experience. Dim sum hole in the wall, chyeeaaah.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "It's kinda ironic I grew up across this place and my family never ate there. But back in the day there were more dim sum places and as with passage of time  there are only a couple left. But about 5 years ago my mom started going there to get their dim sum and it's not bad. Sometimes a bit too salty I guess depending who's making it. I love their haw gar, beef noodle crepe & law may guy (sticky rice with chicken & mushroom not the chinese tamale) It's a tiny place I never eat in b/c my Mom's place is near by. It's pretty cool to walk across & get a bunch of dim sum to take back & enjoy with the family whenever I'm visiting my Mom every week.", "author": "Jo K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-24", "description": "4 stars for food but 2 stars for service.\n\nCame here on Saturday as a group of five having never dined in a Chinatown restaurant before. The moment we stepped in, it was chaotic. Tons of people standing around for the take out counter with no sense of order or a line. We stood around hoping to be seated only to realize that it's a first come first serve communal type set-up.\n\nWe finally managed to grab a table but had to wait for it to be cleared and waited even longer for any food carts to come out. Any questions asked and you'd get barked back at by the staff. If you have to use the bathroom, hold it. You have to walk through the kitchen to get to the disgusting bathrooms and back out. It's better you save yourself from finding out what the conditions are like back there. Ignorance is bliss, right? The longer we sat there, the more unsanitary it seemed.\n\nThe food is decent...comparable to other dim sum joints I've been to in the past. The only thing that really stood out was the shrimp dumpling. If you want anything specific, order via the staff and they'll place an off the cart order for you.\n\nPrices are really reasonable. We ordered about 10-11 dishes and it was ~$33. \n\nBased on the overall experience, I probably won't be back.", "author": "Claudia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Cash only ! Foreigners welcome but may be put off by non English speaking workers . Most of the clientele are age 60+ OG Cantonese geriatrics who sit around read the paper, drink tea and chit chat to each other for 6 hours . Because of that a table is hard to snag (even with communal style seating) . It took me three tries to finally see the restaurant not packed full.. I came before 10 on a Monday morning . I didn't have enough cash to try a lot of their dishes but many ppl were getting their spare ribs with rice. Their prices are very reasonable compared to other dim sum restaurants and they give large portions . Just don't be shy and tell the workers what item you want they have a menu in English . But you need to be familiar with what dim sum items you like as there are no push carts nor pictures . It's definitely a hole in the wall place so don't expect to get catered to the workers probably will not even acknowledge you when you come in .. you're supposed to seat yourself . Out of all the dim sum places I tried I liked this one the most .", "author": "Thang S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Soooo good! We had a TON of dim sum. I've had good Dim Sum before, but this is by far the absolute best! Their fried taro had a beautiful depth and umami to it that I have never tasted in other restaurants. Also, the staff was very friendly and helpful. Small place, though, so get there a little early, and leave yourself time to stop by some of the awesome markets nearby.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "Came here as a backup due to my normal spot being closed. The food was pretty good, nothing special. Food came out very fast and the waitress was nice, although no one really speaks English. Overall not a bad experience.", "author": "Bryson G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "A no muss, no fuss eatery at proverty prices.  This is a real old school Chinatown place to fully appreciate the local scene.", "author": "Dennis Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Felt like an authentic Chinatown experience. The restaurant isn't upscale, so if that's your thing, you will be disappointed. Instead, this seems like a place the locals hang out... we were the only non-Chinese speakers there at the time.  We tried a few different dishes. Loved the dumplings and spring rolls. And our family of 5 ordered a lot, but I surprised the bill came to only $32! Amazing value.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "My grandma always takes me here. This is some good dim sum lol. And it's always fun sitting next to Chinese grandmas.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Been here a few times......one of only a few dim sum places open early. We have always been the only gringos in the place and the food has always been good. Cheap, too.", "author": "Arom A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Besides great dim sum, this shop has excellent steamed bun products. I am especially fond of their mantou. Whenever I am in Chinatown, I buy half a dozen (cold) or more to-go to devour in my leisure at home/work. Just zap in the microwave for 40 seconds, spread with peanut butter. Try it. Have a great day!", "author": "Landlubber L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "They have the best dim sum!!! Everything is done fresh and. Their shrimp fried ball is the best!! It always fresh off and tast good! They are normally pack do it is best to go early to grab yourself a table to sit at. Nice people who work there and they give good recommendations if it Your 1dt time there!", "author": "Calvin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "One of the best foodie adventures I had during my stay in SF! We were staying near Chinatown and decided on dim sum for a late lunch. Luckily, Dol Ho was open till 3pm! \n\nThis is one of those hole-in-the-wall's you hear of that lacks cleanliness but has excellent food. Every one is a local, they walk in, grab their own dishware and tea and find their own seating. So if you're coming in, better grab seating before someone else does! \n\nWhat made this experience so fun was the ordering process. You can order specific dishes but most of the time, whatever they decide to make in the back, they bring out on the wheel cart. You take it or you don't. It's kind of a chef's choice style, it's a little slow but makes it an adventure! Otherwise, you can order what you want from the one lady server. \n\nWhat we ordered and liked:\nSiu mai - so meaty! \nHa gow - wrapping is so fresh\nHa gow with shrimp and chives - must get\nShrimp ball with fried tofu\nSpare ribs over rice - fell right off the bone\n\nWe also ordered steamed buns to go, which weren't bad and were quite cheap! Our tab was less than 30$ for 3 people. This was a cool experience to get away from touristy restaurants and get to eat with the locals. They speak canto, mandarin and some English. I always do the point and numbers thing with my fingers, and it works without fail! Must try if you're visiting SF and you're looking for some authentic dim sum.", "author": "Joanna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Dim sum was sooo good here! As well as the spareribs with rice. It was a long wait though until we were finally seated, but as soon as three seats opened up we were seated. My friends and I sat on a table with other people, but we didn't mind. Basically if you fit there, you sit there lol.", "author": "Kira Lynn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Dol Ho's beef ball and black bean spareribs is the best in SF. This place is lit and a diamond in the rough. I'm a hole in the wall kind of guy and I love this inexpensive and large portion servings.\n\nBlack Tiger will not lead you astray. Come and feast.", "author": "Teason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "The best spare rib over rice dim sum dish you can get!\n\nThis restaurant is open early to local Chinese uncles and aunties who want a cheap, delicious bite while reading the morning Chinese paper. In the morning, it is seat yourself, communally, at any of the small tables. You have to order with the 2 waitresses/cashier. The language barrier was an issue, but between my sixth grade level Mandarin and my boyfriend's third grade level Cantonese, we managed to order a few of our dim sum favorites. \n\nAs mentioned above, definitely get the spare rib over rice. They are generous with the spare ribs and the sauce that seeps onto the white rice is fantastic. The daikon cakes are also delicious!", "author": "Swan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "If you want to experience traditional cantonese dim sum (food and atmosphere).  This is the best place in chinatown, if not all of San Francisco. For the unfamiliar, you share tables with strangers, similar to cafeteria style. I personally prefer the spareribs over rib. It has a very good balance in the fermented beans with the seasoning. The rice itself is special.  This place is one of the few places left where they steam their rice compare to just boiling it. This creates a delightful texture in the rice where its fluffy but also not mushy. \nAnother must try item is the beef balls. They are so tender but also bounce, which is a must for beef balls. Not too much fillers mean you get your worth of beef. As with the spareribs, they are perfectly seasoned. If beef is not your thing. The deep fried shrimp balls are a good substitute. \n\nOverall. If you want good cheap cantonese dim sum dol ho is great choice with an experience that anyone's grandparents will call legit", "author": "jed x."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Quite possibly the best \"humble\" dim sum in all of San Francisco. By \"humble\", I mean the old tea-house type of dim sum where you have chopsticks in a canister in the center of the table and the prices are low while the conversations loud as opposed to the Yank Sing variant of dim sum which includes white table clothes and is fit for a business lunch. It's mainly frequented by the local elderly Chinese which is great because if anyone knows good dim sum and a whale of a deal, they sure do. It is also very useful to have some working knowledge of Cantonese to communicate here--you ask the waiter pushing the cart around for what you want or else point to what's on the cart, but it's very useful to be able to ask. The service is brisk and can seem a tad bit rude at times, but this is not uncommon for this type of restaurant.\n\nThe stand-out dishes tend to be the fun guo, har gow, shaomai, and steamed ribs. The turnip cake normally is ok, too. Like many dim sum shops, if something was made earlier in the day it may be cold or rubbery or lumpy. It's not possible with so small a kitchen and the way they operate to keep everything piping hot and seemingly fresh like Yank Sing can do, however never have I ever had anything I suspected was spoiled here, either. I agree with other reviewers the place could be cleaner, but it doesn't seem unsanitary and again, the prices are so low you feel in some sense you're getting what you pay for--the food portions are quite generous, so if the place could use some cleaning and even redecorating maybe, so what?\n\nI would certainly recommend Dol Ho for 1) good and authentic dim sum at very fair prices and 2) a glimpse of how Chinatown remains today--not fully touristy but very much an immigrant enclave.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "You know a dimsum place is legit when it looks pretty janky. When I walked in, I definitely got the impression that I have been to an identical restaurant in China with the exact same layout. It's not the cleanest or the best service I've had for dimsum but the food was amazing. \n\nSome of my favorites were definitely: spare ribs over rice (the sauce is super tasty), har gow, and the pork bun. If you're looking for something a little bit lighter, don't go for the fried shrimp dishes because they were on the greasy side. \n\nWe got A LOT of food and it turned out to be $11 a person and that's after tip! Definitely can see myself coming back.", "author": "Cassie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "What an experience coming here. The service is completely lacking but you really can't beat the cheap price for this delicious food. It came out to just $7 each person including tax and tip! Reminder that it is cash only. I recommend coming here in a small group. It took us half an hour to snag a table for 4 at a peak hour but there were plenty of seats for 2 people that share a table with another group.\n\nThe service was so inattentive of us it was almost entertaining to try to handle everything ourselves. The server doesn't help you get a seat so it's a free for all hovering over the tables that look like they're about to finish their meal. When we finally got a table we had been sitting without a server come to us for so long my friend went into the kitchen to grab plates and chopsticks for us and I walked up to the only cart across the room and picked out my dim sum.\n\nHighly recommend the spareribs over rice. It lives up to the hype. Super cheap for the serving size and is so tender. The other classic dim sum items like shumai, shrimp dumplings, and shrimp rice noodle rolls were all great. You should order off the menu if there's something you really want because there's only one cart that comes around at a time and it might not bring what you are hoping for.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "On a recent \"Tour de Dim Sum To Go\" in the Stockton/Jackson/Pacific Street area, this obscure place ended up being the best of the bunch.  Yes, the service was a bit abrupt and it helps if you can speak some Chinese, but their dim sum delivered!\nThe har gow, siu mai, shrimp & chive dumpling, and sticky rice in bamboo leaves all received high praise and top marks - especially from my daughter who is a bona fide dim sum connoisseur.  Also impressive were their hom sui gok (fried dumpling made w sticky rice flour) - which maintained a nice crispy interior and had delicious filling with the proper thickness of the shell.\n\nThis place is a keeper.", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Visiting SF over the weekend from OC. Was nursing a hangover on Sunday morning and had a sudden craving for dim sum. Found this spot on yelp and decided to take a walk to order some takeout. Ended up with 4 items: turnip cake, shrimp dumplings, chive and shrimp dumplings and the fried Mochi (meat fillings on the inside). Everything tasted authentic and better than any spot in SoCal. Price came out to be a whopping $11.50. I have a feeling I'll be craving this place for some time to come.", "author": "Jesse L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "I haven't ate at this place in over 15 years but I still remember their steamed rice with spareribs. DROOOOOOL! I always crave it but I'm hardly ever in San Francisco and I don't know it's location.. Until recently. My mom wanted to check out the Asian Art Museum for their Taiwanese exhibit so she asked me where I wanted to eat afterwards. I asked if she remembers the dim sum place with the spareribs over rice and she told me to look it up on Yelp. \n\nStill as tasty as I remember! We ordered some other dishes like shao mai, shrimp dumplings, chicken feet, rice roll with shrimp, taro cake, etc. We had about 10 dishes including the 2 rice with spareribs to go and the bill was about $35! SO cheap! \n\nOk the cons.\n1. Hole in the wall type of place so don't expect to wine and dine.\n2. Not so great customer service. There's no one really there to seat you so if you see an open table, run over and claim it!\n3. There's only 1 lady pushing the cart (she does not look happy) so you have to get her attention before everyone else or else no food for you. \n4. Cleanliness is questionable.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-06", "description": "Hole in the wall sit-down dim sum place. This is not a fancy place with lots of large tables for big parties. It's quite small, and I only saw one dim sum cart moving around the place. If you're a small group, be prepared to end up sitting at a shared table with other small parties. If you're a large group, be prepared never to get seating during peak hours. Made the mistake of coming at noon on a Friday, and we were never able to get seated and ended up getting food to-go.\n\nShrimp dumpling (har gow)- good\nShrimp dumpling with Chinese parsley- note that the parsley is pretty much cilantro. This is not the same as shrimp dumplings with chives.\nPork dumpling (shu mai)- good\nPork and vegetable bun- too much bun, not enough filling\nBBQ pork bun- too much bun, not enough filling. BBQ pork is more on the sweet side.\nSesame ball (dessert)- filled with mung bean not red bean\n\nAn order of the dumplings or small dishes is about 4 pieces for $2.75. We were able to eat for about $10pp. Far from great dim sum, but it's cheap and fast.\n\nCASH ONLY (of course).", "author": "Alice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Delicious and a great experience! Dumplings were perfect. Friendly and welcoming and so inexpensive. So glad to find this for lunch today!", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "The food was cheap and delicious. Definitely got the job done. A no thrills restaurant, definitely lacking in professionalism as they start handing you plates of food without asking.", "author": "Brian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "I usually don't give five stars but this place will be a place I will forever frequent when I'm in the area. It's a small little joint only patronized by locals. Tourists usually just get something to go at the counter.  If you're expecting top notch service do not come here. If you're willing to step in the kitchen real quick and pour yourself some tea, then this is the place for you. \n\nThe food is spectacular. HUGE portions for half the price of typical dim sum in Chinatown. They literally have to cut your pieces of dim sum in half with scissors because it's so gargantuan. One of the few places left that cart out their dim sum. Fresh, fresh, fresh is all I can say. \n\nGet the spareribs over rice. Get it. At $3.75, I don't know what else on this planet at that price can be that fulfilling. If you know something, PM me. But until then..... Pour your own tea.", "author": "Yace H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Very quick, easy, and affordable dim sum! Highly recommend to everyone coming to the Bay Area and Chinatown! Place may be crowded at times, but it's worth sitting down as It is a a very traditional dim sum restaurant!", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "Great value for what you get. Strong taste and flavors with bigger size of dim sum. The server was very curt and quick with no patience but she had an amazing ability to memorize our 8 item order while remembering other the orders from other tables too. Food was 4 stars the cleanliness was 2 stars. Still a great value", "author": "Ron-E H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "The most versatile dim sum catering in SF.  Scrumptious ideals at an inexpensive expenditures.  Always welcome with a fresh hot pot of aromatic tea selections.", "author": "Angela T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "This place is interesting.  dark and dingy.  We didn't go with anyone who could speak Chinese, and our waitress didn't really speak English well, so it was a little hard to communicate.  I tried a few things, including the spare ribs... and I'm not a fan.  It was really fun though, an old Chinese man took my hand and showed me that sometimes I'm using my chopsticks wrong.  He didn't speak English either, but he kept smiling, and holding my hand and showing me how to hold it, and how to control different items.  I feel quite grateful to him, as just a few days ago, I went to a Chinese restaurant with a few friends, and my Chinese friend kept commenting on how I'm not holding the chopsticks like the other \"white girls\" in our group. lol. \n\nI guess, I might be too much of a dim sum snob.  or maybe, I just don't know good dim sum.  Either way, this place wasn't truly my favorite, just for the simple fact that I didn't leave thinking I definitely need to be back soon.", "author": "Moozhan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-16", "description": "Food is pretty okay. SO CHEAP OMG.\nThe service sucks as usual with dim sum places. Would recommend bringing someone that is able to speak because it is hard to get any food to your table. \nRestaurant is not the cleanest but not too bad.", "author": "Ori N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "This is a cash only restaurant! It was great though.\nWe went on a Tuesday morning and it was quite busy.\nThe buns were huge and I could tell they were fresh made which naturally made them taste that much better.\nThere is no ambiance, just good food. It was also hella warm in there, but that might have been the pot of scalding hot tea.\nThe service is at most dim sum places but they were very accommodating of us non-Chinese speaking folk.\nWe had a couple shrimp buns, pork and shrimp shumai, bbq pork buns, sweet egg buns. All were the best I've ever had.\nWe'd definitely go back.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-27", "description": "Two hairs in my food. Some dishes were served cold. Very basic restaurant but seems to be packed with locals.", "author": "Linda W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "Decent dim sum place in SF Chinatown. I used to come here pretty frequently with my family for early morning dim sum.\n\nBy far my favorite item at Dol Ho are their beef balls: they make the beef tender and juicy. Their pork spare ribs are also pretty decent, though a tad on the fatty side. Their other items were rather average.\n\nOne downside: the place is rather dirty.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Nothing beats great dim sum to start off the day in the city. The food is really cheap, but doesn't lack in authenticity. I love the pork rice, and I have to get it whenever I'm in the area. Just thinking about it makes my mouth water. The fried taro is pretty good too, but you really can't go wrong with anything here. \n\nI do have to warn you that service and cleanliness do not meet typical standards. You might have to share the table with strangers if you end up at a bigger table. To say the least, the atmosphere is the opposite of pretentious. As long as you come here with lowered expectations for customer service, you'll be rewarded with yummy food.", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "I used to wonder why my mom always pick to eat here over those fancy restaurants like New Asia but now that I'm older I know why... Not only is it delicious it's also cheaper. It may look raggedy. It may look cheap. It may look hood. But for the price and taste it's a good bargain! They are known for their raw spare ribs. I see a lot of people buying it to go. I ate a few dishes here and my total was so cheap. I ate a few dishes somewhere with a fancy ambience and the total was so much. Now that I'm older I'm more than glad to come here with my mom because I appreciate the food more. I hope this place stay the way it is. I don't want them modernize and be all fancy. There is no need for that. I like everything old school. The way it is gives it more of an authentic feel. Definitely one of my favorite spots for cheap and authentic dim sum!", "author": "Jan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "My GF and I wanted good, authentic Chinese food. While walking through Chinatown we Yelp'ed this place and decided to try it. We were definitely not left disappointed.\n\nIt's a bit small and when we walked in there was a large crowd - we were lucky we got a table. Once we sat down we were promptly given hot tea, which was amazing.\n\nWe've never done Dim Sum before and because of the language barrier, it was a bit harder than we'd hoped but eventually we got the hang of it. We got pot stickers - some of the best I've ever had -, BBQ pork buns (some of the freshest I've ever tasted), and spare rib with black bean sauce. All of the food was amazing and the quantity was large enough that we actually got full. \n\nAfter all was said and done, our total was $11.75! Amazing food at great prices. I definitely want to return here next time I'm in SF.", "author": "Ana A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "This place has amazing dim sum but for a foreigner that doesn't speak any Mandarin it's very difficult to order. P.s. bring lots of cash", "author": "Jonathan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "The previous comments are so true... you do get what you pay for here.  I'm sure all the regular customers here are just because it's cheap. The service is horrible and so are the food.  The food tasted so blend and the facility is so dirty.  The seating arrangement is horrible, they squeeze you in this little table with everyone else in the world.  \n\nYuck!", "author": "Jinnie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "This place used to a hidden gem for dim sum if you didn't mind sharing a table with strangers, getting your own tea refills, or less than pristine bathrooms.  That being said, it was still my favorite place for dim sum in SF, for over 10 years.  My last visit was in August of 2017. The prices had really gone up and the selection was less than what I recalled from past years.  Skipped in this past week and instead picked up great tasting BBQ pork buns and Shu mai at Good Mong Kok.", "author": "Seong M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Amazing dumplings. Feels very authentic. I'd recommend the shrimp with parsley and the pork dumplings. Sparerib was very tasty but it's quite oily for my taste. Would definitively recommend this place to my friends", "author": "Felipe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Great find, minimal service. 4 of us found a nice shared table about 12:46. Full of mostly regulars. No obvious menus. There is only one cart, with rotating types: steamed dumplings (shrimp, pork, others); fried; vegetables (stuffed eggplant, stuffed bell pepper); specials - today was braised pork ribs on a small bucket of rice.  Did not realize the steamed pork buns were up front and you had to ask. Best serving was potstickers, should have ordered more. Cash only. We had at least a dozen dishes, maybe more, for $32.", "author": "Dave Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "I came here at dol ho a few years ago with my mom in the late afternoon after a long day grocery shopping , we bought some steamed beef balls siu mai including ha gow we both ate in the car before going home the food is not bad ,besides that I love seeing authentic minced steamed beef patty minced steamed pork over rice and oh my goodness steamed spare ribs over rice ,I have not yet eaten them but hopefully next time . I wish more mom and pops dim sum shops sell them in Chinatown coming out steaming piping hot !", "author": "Kimmie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "TL;DR: Hit or miss. \n\nMy first time at this place was fantastic. It was extremely crowded on a Saturday morning and the food was piping hot and delicious. Service was great and it was very cheap. \n\nMy second time there, however, was a different experience. Despite visiting again on a Saturday afternoon, the restaurant was kind of empty. That should have been our red flag from the start. The lady at the front manning the cash register asked what tea we wanted, and my mother asked to give us a second to decide. When we flagged down that lady a few minutes later, she exclaimed \"You weren't ready when I asked, and now I'm busy and you want your tea?\" Damn, rude. \n\nYou'd think that a well-known place that lacks in customer service would make up for it in quality of food, but that day's selection was quite meh compared to last time. Some of the dumplings were cold. The shrimp rice rolls were lukewarm and kind of pasty. \n\nThis place doesn't function quite like a normal dim sum place. You need to constantly ask the server what you want because the place is so small, the cart won't physically get to your table. Where you get your food depends on what type of dish you want. The Wu Gok (taro balls) or Cha Siu Bao (BBQ pork buns) are actually pulled from the front counter where they are continually made for to-go orders. Fresh steamed dumplings come from the carts, if the cart is carrying what you're looking for at that moment. Random things are, I think, made fresh from the kitchen. \n\nThis place was fairly cheap considering the quality and service. Before the new year, it was around $20 for 6 dishes. Apparently they raised their prices after the new year, so the second time around, it was $24 for around 7 dishes. \n\nNot sure if I'd come back for a third round. After the poor quality and service, I think I'm going to try another dim sum place in Chinatown.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "Really great Dim Sum for really good prices. Chaotic, yes! What do you expect? It's a San Fran Dim Sum place with sub-2 buck sticky buns! But it's where the locals go so it's worth a visit. Will be back!", "author": "Justin E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-14", "description": "Just ok. \n\nMostly toothless old men patorns who talked way too loud. \n\nThe ribs with black beans were a disappointment, picking the bone shards out of my mouth. \n\nThe bbq pork bun filling was bland and sparse. \n\nHar gow, just ok. \n\nSteamed beef wrapped in wide rice noodle was the only dish worth mentioning. Tender, the filling was subtly seasoned with cilantro and water chestnut. \n\nNah. The only benefit was being able to sit at a table rather than no where to eat, resorting to carrying around a lot of bags from the tiny bakeries.  But I'd much rather go to those tiny bakeries.", "author": "Wendy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Um... is this place for real? Three of us ate our fill of delicious dimsum for just $17.75. I shit you not. We started with potstickers which are typically pretty boring for me, but these were pretty damn amazing. The shao mai was great. Xia Jiao was great. Meatball thingy was good. Every single thing we ordered was excellent. Love!\n\nThis is a real hole-in-the-wall. Knowing Mandarin came in handy. There were some items on the menu that weren't available, which was too bad. I had some trouble understanding the process involved... Took me a while to figure out whether they were regularly bringing carts around or if you had to order off the menu. I still don't think I have it completely figured out, but I believe it's a mixture of both.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Dol Ho is a small dim sum restaurant where locals come to eat. My friends and I (6 in total) came here on a rainy Saturday morning just before 11am. We were seated at the large round table in the back and were soon joined by three others. Sharing a table with strangers is the norm here so don't be alarmed. The restaurant had a few tables available when we arrived but by the time we were leaving, new customers were at our tables ready to swoop in for the seats. I recommend coming here early (before 11) to grab a table.\n\nThere is one cart in the entire restaurant. The woman parks the cart in the middle of the restaurant and will go to each table asking for their orders. Especially if the restaurant is busy, I recommend ordering everything at once (4-6 dishes) because it will take a long time before you'll be able to get your food. My friends and I ordered 12 dishes which totaled at $60 with tip. While we ordered many dishes, I greatly enjoyed the pork short ribs over rice. The dishes are cheap so go wild and try all the different dim sum dishes.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "The best dimsum I've had my whole life! Exceeded my expectations. Dimsums and dumplings are fresh and simply mouth watering!\n\nIt gets busy here though and since you only order noodles while the rest of the items you have to wait for from the cart form the inside, the wait will kill you! :) that wait is worth it though and every 5mins or so, they take out the cart and you get to grab your food! So yummy!\n\nJust be careful, they only accept cash! No cards!", "author": "Katrina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "Came here for dim sum with the boo. It's a no frills kind of spot complete with: lots of old people eating dim sum, little English, confusion about where to sit (pro tip #1: find any open seat and sit there--quickly!), and people not really paying attention to you (pro tip #2: stand up and walk to the cart, or wave people over or you're never gonna get any food). The food itself was good, not the best dim sum I've had, but gets the job done and at a good price. They don't always have everything on the menu, so good luck waving down the cart ladies!", "author": "Joanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Came here for lunch with family craving dim sum. As a tourist looking in, I had a feeling this place would be good seeing how it was full of locals even though it was a definite hole in the wall. Dim sum was excellent, ordered the Hargow, Shu mai, pork ribs and pork dumplings to name a few. Don't expect the ambiance to be the greatest but if quality dim sum is what you're looking for, this is it. On an additional note, you have to pass through all the cooks and the kitchen to get to the shared washroom in the back which was an interesting experience to say the least.", "author": "Cliff V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "TL:DR - Dirty tables. Not a lot of food (especially if you sit far from the kitchen) Loud. Cheap. \n\nSmall place close to Stockton street easy access. The restaurant is a small area with about twelve tables each table holds four people. front there are some dim sum that you can take out but if you eat those food in the restaurant ITs A Different Price. It's also very loud.\nThis place is dirty, flies everywhere, the tables they wipe with the same dirty oily towel and my table is still dirty. They push out a cart at what feels like forever and by the time the cart goes around all he food will be gone so closer to the kitchen the better chance you'll get food if you sit near the door you might just starve to death. And they don't let you go get the food. But why is there so many people here always full, because it's CHEAP. Foods alright though I didn't eat much cause I sat near the door... all the good stuff if any were gone.", "author": "Herman X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Decent food but terrible service as expected.  Good dumplings and spare ribs and chicken feet.  Shu mai and BBQ pork buns are not good.  Spare rib rice is okay.", "author": "Alison D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Authentic Dim Sum!!! Hit this place .. Don't expect something fancy restaurant here !!!but food wise .. You won't regret it .. It's like bringing Hong Kong to the Bay Area..for $ you'll be a happy camper after 3 small plate ..", "author": "Donovan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "So this place will put you out of your comfort zone, it is noisy, crowded and no frills. At the same time there is A palpable energy to the place. When you come in you have to try to find a seat as quickly as you can as there is no seating service. Once you find a seat waitress shortly comes up and gives you chopsticks and plates and starts bringing food. There are no menus. You wait and the waitress brings you different dishes and you decide if you want them or not. We tried spare ribs and shrimp dumplings before seasoned perfectly and came piping hot. Don't be afraid to be adventurous year as you may not know exactly what you're ordering but don't be afraid.\n\nA quick tip this is cash only so make sure you have some when you arrive, also you may end up waiting in line because there is a line out the door.", "author": "David A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "The food is okay but some of them are cold.\n\nThey have an okay selection of dim sum. I like the pork dumpling because they put mushroom in it. The shrimp dumpling is okay.\n\nAll fried items are not freshly fried so they can be cold. I also don't like their taro cake because I think it's too doughy and they should put more taro in it.\n\nThe service is fast and friendly. The place is relatively clean and they have bathroom for customers.", "author": "Tiratat P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "So, you're here. Come in and find spots. Smaller groups (3-4) will almost always win out over large ones and pairs are the ace in the hole. If you need to just find random spots at a table and sit and wait til people finish eating or wait by a table for the same reason. No one's gonna shoo you away for being annoying, this is all communal so release your fears of sitting next to someone you don't know. The staff will figure out they're gone, clear it out and give you utensils and a pot of tea. Carts will come around, yes it helps immensely if you speak Cantonese but you can honestly get by pretty easily if you just wave down the cart as it comes by and point at random things for her to open and show you. Eat well, the food is GREAT. Once you're done, take your bill to the front cashier to be rung up and head on out. Prices are decent but obviously if you order a lot, your bill will be high, but no more than $30-$40 on the very high end (for 2 at least). Even if you do somehow, I think you'll reconcile that with how happy your stomach is.\n\nRecommend getting the spare ribs + rice, shrimp balls, rice noodles. (Siu mai, har gow implied as everyone orders them)\n\nAnd so I dislike most uses of the word authentic. I feel that authenticity is incredibly relative to each person's experience and that while it can help when properly framed, a lot of people put too much emphasis on it. Regardless, I grew up frequenting the old school classic dim sum restaurants of Old LA Chinatown and 626 (San Gabriel). Take that as you will, I've had a lot of dim sum in my life and to my point, while I can say that this has been the most difficult place to ever order in, that doesn't take away from it at all and it's somewhere I plan on going back to 150%.\n\nAlso as a final note, I'm always a bit confused when I see long lists of dissent against lackluster service and atmosphere at Chinese restaurants. The onus is always on the food and especially so here as it's meant to be a fast joint for locals. Don't hate it for that, respect the fact that it's a place that remains true to the community through the years and celebrate that you are able to be a part of that history.", "author": "Charles M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-11", "description": "Ate here in early November 2017. Interesting experience, fun, a little challenging to figure out what on the menu we wanted to eat. Hole in the wall, authentic dim sum experience, popular with local older Chinese folks.", "author": "Jake G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Best, Cheapest Food in ALL OF SAN FRAN, cuz San Fran will suck out all your money out of your wallet!\n\nBut seriously as an asian growing up in ny, i've had my fair share of dim sum. Heck I don't even know why ppl think San Fran Chinatown is all that great, Walking up and down hills is silly and annoying, and i was only here for a few days.\n\nHowever this place is awesome, really grungy place, not grimy, just feels \"old\" cuz all the patrons are old grandmas and grandpas. I came in here expecting to be seated and a grandpa went right past me and sat down, guess this place is it!\n\nGrandpas and Grandmas know good food, heck, they've been eating it longer than you, they also know good cheap food!\n\nGet the usual Dim Sum fair, make sure to the pork and rice. Obviously come early before 12.", "author": "James W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-20", "description": "Very small dim sum place in the heart of Chinatown SF. The sparerib with rice and cilantro fun with shrimp was okay. But I really liked their ha gow (shrimp dumpling). \n\nService was fast. I was a bit skeptical about how clean everything is...definitely one of those hole-in-the-wall places!", "author": "Eva L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-28", "description": "I will preface this review with the fact that 1) I am horribly picky when it comes to dim sum and 2) My friend and I showed up at 2:15, 45 minutes before they closed shop and 3) My only comparison is NYC because I was visiting the area for the first time. Also, I'm fluent in Chinese and know my Chinese food.\n\nWith that being said, this place is gross.  It would normally only get 1 star from me but because of the reasons mentioned above, I'll give it a benefit of the doubt. It's cheap enough, regular dishes are $2.50 and large/special dishes are $3.50. \n\nOut of 7 dishes, 6 were reheated and I suspect more than one. The protein had been cooked to the point where the texture and wrapping around it had changed. This means one thing to me - it was left overs for the day. Now out of the 6 reheated dishes, only about half as actually warm.\n\nMy only complaint is this - either stop serving early or do it well regardless. If I was the owner, I would be  ashamed to serve this food of this quality. My friend and I were hungry and desperate so we ate most if it. However, I will not be returning in the future with so many other options down the street.\n\nThe restaurant itself was your typical dingy Chinese place. Somewhat sticky and uneven tables. I guess you get what you pay for.", "author": "Joey R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "I was on the fence whether to give 4 or 5 stars, but overall went for the perfect score because there really isn't much that disappoints about this place, as long as you go in with low expectations on ambience/decor/service. I know that sounds like a contradicting statement but you'll see once you go. And yes -- if you're ok with a totally no-frills type establishment to get great food at an exceptional price -- you should absolutely GO.\n\nYou walk in and it seems like you've taken a wrong turn and wandered into some community center cafeteria or something. There are a few ladies meandering through the tables looking expressionless (or bored out of their minds) wearing aprons, these are your stewards for the Dol Ho experience. Grab a seat, pour out your dipping sauces, and ask for a menu. \n\nThe food is not particularly fast, but it all came within a reasonable time. Plenty of interesting people watching in the meantime. This place is frequented mainly by Chinatown locals and regulars, most of whom are old and ain't got time for any nonsense. You will hear Chinese spoken throughout the room. Once you order, you will get a pot of hot tea which will be your best friend as you slurp down delicious dim sum dumplings and buns.\n\nMost menu items are well prepared, delicious and very simply flavored -- nothing over complicated, experimental, frou frou, or designer farm-to-table here. A few faves: the deep fried shrimp balls, steamed pork buns (very abundant with tasty, flavorful filling), shrimp and chive dumplings, chicken nests (a chunk of chicken wrapped in a nest of clear cellophane noodles). We're talking solid, old school, traditional dim sum. And if frugality is an Olympic sport for you, you will be scoring gold medals here. It just doesn't get any cheaper than this for really solid dim sum. Period.\n\nMake sure to bring cash, use a bathroom before you head over, and prepare to stuff your bellies.\n\n*PARENT ADVICE* Doesn't seem like they had any highchairs for little ones.", "author": "M. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "Old school with one cart that they reload so if you want dibs, as with all dim sum joints try to sit closer to the kitchen (on the left side of the restaurant looking inside from the street).\n\nLots of standard fare and if you have something you want (like a noodle roll) you can just ask the waitress for it. Also don't be offended if you're in a party of 2 and they move you to a shared table when a large group comes in. This is the way of the world and we all get to eat more when we're flexible about stuff.\n\nThe most unique dish I saw was this pork spareribs over rice bowl where I think the whole thing is steamed together, letting that sweet pork juice get in to the rice. It's not the best for splitting but tastes great.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Wow, this restaurant is definitely an experience! We walked in thinking we were gonna get our order taken and be served like in a normal restaurant, right? Wrong! \n\nA lady appears, coming around with hot trays on a cart and offering different dishes you can accept to have or not. We were lucky as the two first dishes we would have ordered anyway: pork and shrimp dumplings. Great portion sizes for two to share (about 2 pretty big pieces each), very fresh and tasty and unbeatable prices (2,50$-3,50$ per plate to share!). \n\nAfter a few minutes wondering how we were gonna order specific dishes we had seen on the menu, we asked for BBQ Pork Bun that happened to be on the tray and got it immediately. Best bun ever!! (see picture). We then decided to try the ribs over rice which were okay (lots of bones and very tiny pieces). We finished with huge fried shrimp dumplings. Very particular but I liked it! \n\nWe were very full coming out of there and the prices were so cheap: 17$ for all of that and free tea served right when we got there. I would recommend this place for having good dim sum and an original lunch where you won't leave hungry!", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "We stumbled upon this place while on a short trip to San Francisco. This is a pretty simple and humble restaurant in the middle of Chinatown, and it is cash only. From the moment you walk in you can tell that it's one of those places that's frequent by the same people everyday. The service was mediocre at best but that's pretty normal places for Asian restaurants. The food was pretty good, i didn't think it was the best meal I've ever had but everything was fresh, flavorful and authentic. It was also pretty cheap, 3 of us basically stuffed ourselves for $30.", "author": "Mery R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "[UPDATE] I heard Dol Ho is open again, woo hooO!!", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "Definitely wouldn't recommend you to come here if you're into nice ambience and doesn't speak any Chinese. It's an authentic Asian dim sum place, the food is delicious and really cheap! They only have one cart going around, so it's easier to order off the menu if you know what you want. It's also cash only!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "This dim sum place is just awesome.  People said their spare ribs over steamed rice is best, but i live the chicken over steamed rice.  Price very reasonable.", "author": "Denis Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Best dim sum served ever with free fragrant hot tea!  We ordered:\n- standard shrimp (har gow) and pork (shumai) dumplings but there was nothing standard about it!  Super flavorful with such thin and slightly chewy wrapping paper that you can see right through the filling! \n- spareribs over rice was pure heaven in a small tin bowl. The ribs were cooked perfectly and juices laced through to the rice packed in the bottom of the bowl. So good that I was secretly battling the urge to order an extra portion to take to-go!\n- stuffed eggplant.  Looks very unassuming but just packed with flavor and perfect ratio between filling and eggplant. \n- chicken feet..omg, juicy fat chicken feet...nom nom nom\n- stuffed bean noodle dish that I've never had before.  Bean thread noodles filled with ground chicken, ground pork, mushroom and tofu. Deliciousness!\n\nNo soy sauce needed just top it off with housemate chili paste in oil - not usual standard chili paste but chili paste on steroids full of flavor a such as black bean sauce and garlic. \n\nThis is a HOLE-IN-THE-WALL place smack in the middle of SF Chinatown. Don't expect a lot a fancy ambiance with waitstaff that can speak English. We sat community seating with a table of 4 older Chinese people that cannot speak English well. Signs of good restaurant people - old native diners!\n\nRestaurant was so busy that they literally sat us at the table and cleared out dirty dishes as we are being seated...barely wiping the table clean. But the dumpling is so amazing that it more than makes up for the ambiance.  \n\nSuper tasty food but set your expectation correctly in the decor and lack of English speakers. Lucky it's a dim sum restaurant so you can pretty much point at what you want when the cart is pushed around :)", "author": "Diem P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Food: 5 stars. The dim sums very tasty here, especially for the price. \nService (waitress): 5 stars. There was one poor waitress was running around, working hard, waiting on the whole restaurant. \nService (owners): 0 stars. The owners were manning the cashier and bussing. I felt bad for the waitress, and left a hefty tip, which one of the owners promptly scooped up and put into his own pocket!  Doh! Lesson learned, don't tip in Chinatown, the cash doesn't make it to the staff!", "author": "Andy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-12", "description": "Came here because a friend wanted their spareribs and rice. So as I waited I see the lady up front picking up some dim sum for the older lady while the kitchen is bringing out the spareribs. The taro cake when sliding back ended up falling and hitting the glass. As the waitress pulled the tray back the cake dragged across the glass some more. And that's all she did, just to resell at a later time.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "If you want authentic dim sum...this is the place. It's like a hole in the wall full of people all the time. We went there for lunch on a Friday at 11.30. You have to be really outgoing to go to this place vacate if you are not Chinese good luck not looking out of place. We were definitely the back sheep in this place but we were sat immediately and treated with an awkward but welcoming smile :) \n\nThey brought out different types of shrimp dim sum. One was just shrimp wrapped in rice paper and the other one was with scallions. We also had the bbq pork buns and the sticky rice. This was probably the freshest and most authentic tasting dim sum my fiancé and I ever had.\n\nYou really get a feel for Chinatown in San Fran and the authentic flavored of the east. They even make their own spicy chili sauce. Overall delicious and a must if you are feeling adventurous and inspired!", "author": "Henry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "I can't believe it took me this long to find out about this place.  Don't expect a gorgeous extravagantly decorated dim sum restaurant.  This is the ultimate definition of a functional eatery that only needs to serve the best food-the surroundings are superfluous.  \n\nWe were craving dim sum in the area of chinatown but didn't want the touristy spot as most people would lean towards.  I was skeptical of this place due to the subpar reviews, but the chinese in me said 'maybe the best ones aren't reviewed.' Sure enough dol ho made that cut.  \n\nWe go in and notice most of the elder diners there looked like they eat here on a daily basis making themselves quite at home.  Not many young folks but us.  I'm all for changing the motto.  First thing--we scour and spy on neighboring tables to see what's thee dish to get- turns out it tin can with spareribs over rice.  Well then we have to get that.  Such a simple dish and it was satiating.  it has the perfect balance of flavor with tender ribs.  Since we sat right by the kitchen opening I got to ooooo and aaahhh at the dishes being made.  The one dish constantly churning out were the ribs over rice.   Most of the dim sum dishes are requested since there is one cart lady catering to all the tables.  You better know the dishes you want.  Every dish was perfectly seasoned- turnip cake, shrimp dumpling, rice roll, steamed pork bun and rice crepe.  I can't remember a bad dish and believe me there usually is one at most spots.  \n\nI'm so happy they open at 8 in the morning.  I will definitely be coming back for more of that rib over rice.  Plenty of people came in to only buy that.", "author": "Dee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "This place is literally a hole in the wall. If i didn't know about this place, I would never walk in and eat here since it looks so old and dirty. However, my mom has been coming here for spare ribs and the chicken leaf wrap to go. This place has the best spareribs. I have tried so many spareribs from other dimsum places but nothing is even comparable this one. Everything is cheap and i definitely recommend everyone to come here. I have yet dined in, but one day i will", "author": "Allie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "I was seeking out a dim sum experience like one I had a few years ago in Seattle - where the workers bring out a cart stacked high with bamboo boxes containing fresh dim sum. I found it here. You are seated at a shared table and served tea. Most often dim sum places do jasmine tea and that's what I poured out from my individual tea kettle. There is no doubt this is a traditional sort of place and it didn't take me very long to realize that with all the locals dining and chatting in Chinese around me.\n\nThe woman first came around with Ha Gow and Pork Dumplings. The Ha Gow (shrimp) was perfectly made and didn't need any soy sauce or seasoning. The pork dumplings were equally as perfect and the meaty, oily juices leaked out when I ate them. Both dim sum were served piping hot.\n\nAfter I savored my dumplings, I told the woman I was waiting for pork spare ribs with rice. I waited for 5 or so minutes when a huge cart of the stuff was brought out. The sauce was amazing and the spare ribs I chewed off the bone. Everything was again piping hot, including the metal bowl the spare ribs were served in (so be careful)!\n\nFor this filling meal, I paid $10.60. Cash only!", "author": "Beth P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Dol Ho has been around for over 24 years & they serve authentic, good dim sum at very reasonable prices.  \n\nBEST CHILI OIL IN THE WORLD: \nDol Ho makes the best Chinese chili oil/sauce in the world that I've ever had. (There is a Chinese restaurant in Melbourne, Australia that makes the 2nd best.)  Dol Ho's homemade chili oil is so tasty, but it's hard to describe. It's the perfect balance of spicy & savoury (from pickled radish or something?) & it's a wonderful accompaniment to fried rice. Dol Ho's chili oil alone is worth the trip. And I do mean this literally -- I was in SF on a stopover & went to Dol Ho especially to buy some chili sauce to bring home.  I may have booked my flights/stopover with this chili oil in mind.\n\nDIM SUM IS ALSO GOOD:\n\n1. Radish cake: Very prominent radish flavour, which is as it should be. Most places make their radish cake with too much flour filler but here at Dol Ho, it actually tastes like radish. The texture was mushy (not good), but on the whole, this was still good & comforting.\n\n2. Braised chicken feet (fung zao) was braised to tenderness and flavourful.\n\n3. Chicken drumsticks cooked in tin foil is pretty tasty, with a nice sauce.\n\n4. Shrimp dumplings (har gao) was solid. Not the best, but not bad.\n\n5. Stuffed eggplant was not very good. It was okay but just not as flavourful as other dishes they make.\n\nThe dim sum cost around $15.  It was enough to feed 2 at lunch.  I spent another $20 on chili oil to fly back home.", "author": "Shereen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "This place is terrible. We came at 2pm on a Friday. The server not only didn't wait for me to finish my order before leaving but also served us cold food. When we complained she disconnectedly said that it was all they had left. The food was incredibly mediocre and we were very disappointed especially given how many raving reviews there were.", "author": "Allen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "The food and prices here are unbeatable. Their spare rib rice is what they're known for and its only $3.75! Did I mention how delicious it is? It was so good I had to come again the next day. On the first day, we dined in and everything was fine. We received decent service, especially for Chinatown. As for the second day I wanted to order to go. I walk in there and the worker is sitting behind the counter staring off into space. I asked her for two spare rib rices to go and she quickly runs to the kitchen to get it and comes back in about 2 mins. (They always have their rices ready cause it's basically all anyone orders). I then asked her for extra soy sauce cause I didn't get to ask before she ran off. This was where the lady looked pissed and said \"There's already soy sauce in here, why didn't you ask me earlier?\" Like are you serious? You're sitting there staring off into space and your mad that you have to walk an extra 5 ft to the kitchen to get me more soy sauce? You should be grateful a paying customer is giving you something to do. But this is Chinatown, and I know better to rate based on service. \n\n5/5 for food and price \n3/5 for cleanliness \n2/5 for service", "author": "Lushi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Locals dominate the patronage here. It is a little hole in the wall with very good dim sum. One has to be a little aggressive to get your food and possibly a seat, but it is worth it. Good food, great prices. We shared a table with a couple of older women. They even shared some of their choices to encourage us to try authentic dim sum. If in San Francisco again I would return.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "We had the fried shrimp rice ball, pork dumplings, and chicken in foil. It was amazing - the best dim sum I've ever had. Even the tea was phenomenal! A truly authentic experience everyone should have!", "author": "Jacquie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "There are many dim sum places in Chinatown, but none are like this one. \n\nI went with my family for lunch. It was crowded with people. We ordered some dim sum and an item from the main course. Although the dim sum was easy to get, it was hard to get the main course. Had to ask for it twice. Overall, nice place to eat needs a bit of expansion.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "One of those hole in the wall restaurants in Chinatown. Dol Ho has been around for decades and is known for their Spare Ribs. I usually get their Spare Ribs Rice and the Vegetarian Rice Rolls. The Spare Ribs Rice is steamed and topped with Soy Sauce, this is a must get for everyone and is one of the most popular dishes. The Vegetarian Rice Rolls has cilantro with a soft texture. There is no service at this restaurant, meaning customers seat themselves at a table and pay at the counter after their meal. This restaurant is always busy year round and is packed with regulars. There is a laminated English menu for those who do not speak Chinese, but I would bringing a friend who can speak Chinese. The owner of the restaurant is the chef that you see walking around serving the customers. He used to only work in the back, but now runs the entire restaurant himself after his wife went into retirement a few years back. Again, most of the customers are regulars at this restaurant, where the staff would remember their orders and what kind of tea they would drink. All the tables are usually occupied during their peak hours and sharing a table is a must. Not the cleanest restaurant, but they try their best since it run down from being around for decades. They did remodel the restaurant in the recent years and cleaned the dirty fans along the wall. Hopefully they stay around for the years to come. They are one of the last restaurants in Chinatown that actually still uses carts to serve dim sum. This rating is for the food, I can care more or less about the cleanliness of this restaurant. I have been coming here since I was toddler with my grandpa and have never experienced a problem with their food. He is a regular at Dol Ho and has been coming here every morning 365 days a year. Please do not come here with debit or credit cards, they only take cash.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-08", "description": "Not your typical Cantonese dim sum. Variety of food is limited. Not the best but also not the worst. There are way better dim sums out there!", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Dol Ho is back open again!  Looking nice and fresh. So happy my favorite dim sum spot is back again", "author": "Dean L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "My fellow coffee enthusiast friend from HK and I have this unspoken tradition whenever I'm back in town where we spend a morning doing yamcha and then visiting some up-and-coming coffee joint in the City.\n\nWhereas our last few iterations have been at a certain well-established dim sum restaurant in Serramonte, my buddy insisted we give this one a try, mainly because his \"non-Asian friends don't want to eat some place this dirty.\"\n\nTo clarify, Dol Ho is not dirty in the sense that one should worry about the hygienic integrity of its food, but in the sense that it's quick and dirty, kind of like the 7 AM Cha Chaan Tengs in Yau Ma Tei -- that being said, any review that complains about the \"service\" or the lack thereof, should promptly be ignored and its writer possibly scrutinized and beat over the head with a burlap sack filled with soap.\n\nExcessively violent images aside, Dol Ho is, as aforementioned, like one of the many dim sum quick stops that line the side of Nathan Road and Kowloon; the moment you set foot in the store, you're ushered in to sit at their communal tables (I hope you don't have an irrational fear of sitting next to strangers!) after which they bring the food out to you as soon as they're prepared right out of the kitchen, and you order simply by either saying \"I want that\" or I guess pointing at it.\n\nThe quality of food you get here highly outweighs the price point -- the spare ribs w/rice seems to be the popular pick here for a quick bite; their cheung fun, har gow, siu mai, and various char siew offerings are all excellent and well worth the parking adventure downtown you will most likely have to take to eat here.\n\nAll in all, a great option for dim sum downtown.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Upon a fellow Yelp Elite's recommendation, we tried this place out. \n\nIt was filled with locals which is always a great sign. It's very unassuming and no frills. There is a counter at the front which you can order to-go items from, which seemed to be pretty popular. The place was packed with elders reading the newspaper, some solo and other catching up with old friends. It has a homey feel.\n\nYou can pretty much seat yourself, but since the place was packed and we hadn't been there before, the server cleared out a spot for us. The tables are all kinda joined together, so you'll probably be sitting next to others. This doesn't seem to be a place to linger. The tables turn over quickly. Plenty of people just come in for one dish, read the paper, drink some tea, and leave. However, service was friendly and we did not feel rushed.\n\nThey were quick to give us tea, and our chopsticks and plates, so we were ready to go. There was only one woman with a cart, but she was regularly coming out with fresh new items. You can easily see into the open kitchen, so you can see them preparing all the new dishes to bring out. \n\nEven though the two us ordered at least two more dishes after we were already stuffed (and took home our leftovers: 2 large fried shrimp dumplings, 2 turnips cakes, and 2 pieces of beef crepe), we left so stuffed and it all cost less than $20 total. This place is cheap! \n\nSomeone helpfully posted pictures of the menu on here, which was nowhere to be seen in the restaurant, so although, they don't serve a huge variety of dishes, I still thought this place was solid. It's super cheap, service is quick, and the dishes were good. There were no super-amazing dishes that were memorable, but everything was solid. \n\nAs everyone mentions, the Rib Rice was a good dish that I'm glad we ordered. Watch out for the bones though. \n\nI'd definitely come back here again.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "This place was ridiculous...ly amazing. I took some friends here for dim sum, and we spent a total of $5 each for possibly the best dim sum I've ever had. The pork ribs are so flavorful. Everything was delicious. There is only one woman pushing around a cart, so the service is a little slow, and the selection isn't HUGE but the quality and price of the food makes up for it. I will be back the next time I'm in the SF area. \nAlso note: I tried a different dim sum place the day before (apparently where Obama and Stephen Hawking are) which was more expensive and decorated but it has NOTHING on this place.", "author": "Hao Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "I don't remember the last time I was here, but for some reason I have vague memories of spareribs over rice being served in metal bowls. Looked tasty. Unfortunately they've been closed by the Health Department.", "author": "Henry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "I have has dim sum at quite a few places, from NYC to LA to Houston and San Fran Chinatowns.  The best dim sum at local mom & pop, non tourist trap restaurant.  The Steamed Stuffed Bean Roll, Spareribs over Rice, the Chicken Feet, shrimp dumplings, pork dumplings, chicken stuffed eggplant are heavenly tasting!  The Spare Ribs over Rice tops it all!!! And it's cheap!!! And they have their own spicy chili oil where you don't even need soy sauce!", "author": "Janet T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "Good food.  Speaking no Chinese, the woman working helped me navigate the menu.  It wasn't the cleanest (I saw an elderly woman spit on the floor and keep on eating), but I wouldn't say it was out of place if that makes sense.  Pork buns were good, so were chives.  Many people on Yelp raved about the ribs but I think I ordered the wrong thing, as it was mostly bone and not very good.  Overall, if I was headed back to San Fran and wanted dim sum I'd stop by again.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "This was my favorite place in ctown. Came down today for my bday lunch. This place closed due to sanitary issues. I had no problems with it. This place was old school. Not going to find anything like this anymore. Don't think they will be coming back!! \n\nDedicate this song to you guys up in Dol Ho!\n\nhttps://youtu.be/ywmNcVh7lsE", "author": "RICKY C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-17", "description": "It was not crowded, the food was mediocre. The dumplings here are good, the spare ribs over rice was pretty tasty but none of the food made me feel over the moon. There's definitely better places than this place in my opinion.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-21", "description": "i think my experience would have been INFINITELY better if i spoke cantonese or knew exactly what was available to order at dol ho.  with that said though, everything i has was pretty good - i was just confused as to what was available! this joint is PACKED with locals and elderly canto folks (with a few hipsters here n there), so you know the stuff is legit.  will be back next time with canto speaking people!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Best bang for your buck.\n\nDim sum quality is pretty good here. Don't be surprised when you get there and you end up sharing a table with strangers. Went with my friend and we ended up sharing a table with 5 other people.\n\nThe food comes out from the kitchen on a push cart fresh and they go from table to table. The cart is small but has a lot of variety. Let them know what you want. Much easier if you speak the language, but if you don't, just point at what you like. \n\nDownside I would say is not very clean and you lack privacy. Place is small and stuffy. Food is good and well worth the price though.", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "Cheap, cheap dim sum. So cheap you get up and get your own tea if you're not willing to wait for a server, and no one will be offended.\n\nSome sort of rice or rice noodle dish is very popular here, but we didn't know what it was called and never got around to finding out. The pai gut fan (pork sparerib over rice) is also hugely popular and is quite good considering how cheap it is.\n\nDeep fried shrimp ball, har gow, shu mai are all just okay-- cheap and adequate is the order of the day here. Taro balls were HUGE and a little too cool inside, but the sesame balls were superb.\n\nInside, cheap tables, a horde of old Chinese men and women, shared tables, fans on the walls, reminded me very strongly of Hong Kong. Heck, about as strong a resemblance as I've seen to HK short of going there... for a legit HK experience, this is about as authentic as it gets in the states.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "My favorite place to get their spareribs with rice dish! Out of the many chinese restaurants that I have been to, this is by far the best for their spareribs! They offer it cooked and raw and marinated as well. If i want to eat it some other day, for a quick meal that I can place in the rice cooker to steam, I buy it raw from them. If I'm eating it on the spot, i usually get it cooked and it'll come with rice too! Definitely affordable and tastes amazing!", "author": "Bailey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Good food for good price. Especially liked the ribs, crepes, and pork buns. Only thing that was kind of disappointing was the pastry-ish foods (sesame balls, fried taro, etc) were cold because they're kept in the front. Service might be a little hard for non Chinese-speaking people", "author": "Betty H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "Delicious dim sum.\n\nNot very English-friendly.\n\nCome with a Cantonese-speaking friend for best experience.\n\nThings to try:\nSpare ribs over rice\nBean curd roll\nTurnip cakes", "author": "Ananya M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-01", "description": "What is everyone raving about? The place is dirty and the food average. Also they run out of everything and the service sucks.", "author": "Gryffin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Weird and lovely.\n\nOne cart at a time, and it's a sh!tshow. Don't bother ordering anything else because its futile, unless you want a pork bun from the window, but the pork bun isn't anything to write home about. \n\nWe ordered about 7 dishes and the bill came out to $18.\n\nJust grab what you can and enjoy.", "author": "Rod A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "This was a great experience and about as authentic as you can get. \n\nWe stumbled in on a cold Saturday. Space is tight and the restaurant was packed. We ended up sharing a table w/ another party which worked out well because he told us what to order. The food was delicious. The clientele is overwhelmingly Chinese and most of the people seemed to know one another. \n\nAll the staff does not necessarily speak English but they are happy to accommodate you. Just hang back for a bit and watch the locals...you sometimes need to approach the dim sum cart because of space restrictions...you will be able to get food and be glad you did. \n\nWe stuffed ourselves (2 people) for slightly more than $20.", "author": "Mary Beth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "A true hole in the wall.  The place is well used, a little tattered around the edges and legit.  The black bean spare ribs are worth waiting for.  I found the pot stickers a little thick on the wrapper/dough, but, the filling was super flavorful.  It was fun to see the hoards rush up from their table when a new cart of goodies came out of the kitchen.  Very interactive dim sum.  I suggest go early because the place was packed solid.  Bonus points because the little old lady near me was amused and (I hope) impressed at my chopstick skills.  They do a large, somewhat disorganized to-go business.  The place is busy, disorganized and the food was very good.  Would totally come back, we need more people with us because we ate far too much.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Our cab driver recommended this small restaurant for the best dim sum in San Francisco and he was absolutely right.  It's small,  loud, crowded with \"ok\" service but the food was amazing.   Highly recommend this place to anyone looking for authentic dim sum.", "author": "Shauna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-23", "description": "CASH ONLY!!!!!!!\n\nYou know a Chinese place is a great place when it's filled with nothing but Chinese people.  My bf was the only white boy in there the whole time.  The place is dive-y with not much of a decor, faded awning outside and super busy inside.  Not the cleanest walls and windows.  \n\nI speak Mandarin and I even had a little trouble ordering.  The lady that pushed the cart around didn't speak Mandarin nor English... and I made the assumption that she didn't speak Spanish either, I pulled out my best point-and-nod skills.\n\nNot really a fan of their har-gao (shrimp dumpling), the dough was really thick and I've had better in Denver.  The foil wrapped Chicken was awesome!  Saw a lady walked in for a take-out order and she got 3 orders (3 pieces per order) of those foil chickens.  I think it's the top segment of the chicken leg, wrapped and cooked in foil.  It's got awesome flavor throughout the whole chicken and super tasty!  I'm so glad I got it even though she couldn't tell me what was inside.  \n\nHad pork spareribs, their most famous dish.  Most of the older Chinese crowd gets it over rice, we just got it standalone and it was delicious!  A little fattier than what I'm used to, it has great flavor with the black beans.  Also ordered the beef meatballs and they were delicious as well with chopped up water chestnuts inside.  Fried stuffed tofu triangles were delicious as well, just wish they were hot when we got them.  \n\nLove their homemade chili sauce, not very spicy but it's different than anywhere else I've ever been to.  They used dried daikon (white radish), black bean and chili flake to make it.. not sure if there's a little garlic in it too.  Yummy!\n\nFor all 5 dishes with oolong tea came out to $16 after tax.  I don't think the waitress there gets tipped because when I handed her $2 she quickly grabbed it, smile and nod at me, and shoved the money in her apron as if that was the first tip she's got all day or that she didn't want others to see.  I know older Chinese people don't usually tip and that's the majority of the customers there.  \n\nI would recommend if you tip, give it to the person that took care of you directly and not just leave it up at the front counter when you pay.  The lady behind the counter is not the nicest person and people have a tendency to cut in front of you.  If you give the tip to the lady upfront she will take it and not sure if she even distributes it to other workers.  Waiting in line is not really the best qualities of Chinese people and it shows at this restaurant.  \n\nOverall, knowing what I was getting myself into, this place is awesome.  Been here 4 years ago when visited San Francisco and now coming back again for more.  And if you don't want people sharing tables with you, this might not be the place to try.  However, this is the cheapest and the best dim sum in the area with the best prices!", "author": "Sara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "I often stop by here in the mornings before work for some quick breakfast -- usually a pork bun or vegetable bun, so I never got to try their famous pork over rice. \n\nBut their har gow and other vegetable/chive dumplings are amazing! The rice layer on the outside is thin and delicious and the insides are full of stuffing! \n\nWould definitely recommend if you're looking for great hole in the wall dim sum!", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Authentic and well priced. A real hidden gem, and the dim sum is excellent. Will definitely be back for more", "author": "Gannon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "I recommend their sticky rice, pork, and buns. I should try their pottage and soup next time.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "Dol Ho is as legit as it comes. Located in the heart of Chinatown, DH follows the old-style dim sum tea houses, minus the birds in cages and spit buckets, but keep the 70+ year olds and brusque service.\n\nSeeing that it was a large group of 20s and 30s somethings, our hostess* asked the 2 older gentlemen (who reminded me of my grandpas - RIP) in the only large table to move to a smaller table. We felt bad and absolutely didn't mind sharing the table, but the gentle and kind grandpas assured us in Toisan that they were more than happy to move. Naturally, we helped them with their plates. \n\nThe service is an acquired taste. If you're not used to the abrasiveness that older Chinese restaurants offers, you'll definitely be turned off. But hey, my friends and I grew up in the mean streets of Flushing and Chinatown in NYC. If we can't appreciate this, we might as well swear off Chinese food forever. \n\nFood is great! It's only 1 cart with 1 lady pushing the cart, so they try to fit as much as they can on it. And you never know what they come out with, but feel free to put in orders! Reading Yelp, we did see that the marinated meats over rice were the must-gets. So we tried the spare ribs over rice, chicken over rice, and pork patty with preserved fish over rice. All three gets the thumbs up. So good that we each ordered the spare ribs & chicken versions to go for our flight home. Would've gone with the pork patty w/ preserved fish as well, but not everyone appreciates the aroma and goodness of this dish.\n\nIf you're in SF, please go! Set your judgments aside and enjoy the old-style charm and the food! \n\n\n*Hostess is used very loosely here. You pretty much have to fight for survival once you're seated.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Authentic canto style dim sum, best spare ribs and salted fish steamed over rice. The location was a bit of hole in the wall but so worth it. Great price and quality, will return.", "author": "Yayan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "Basics apply here. Yes, it is economical. Early in the morning it's full of local business men and retirees from the apartment towers nearby. Black bean sauce pork ribs with rice is the overwhelming favorite: so good! The hot chili oil is very flavorful. What else, besides tea, could one possibly need? As the day winds forward, items appear in the display shelves. Example: I cannot describe how wonderful the cha-su (BBQ pork) in puff pastry is when they bring it out. So.good.and.so.cheap.", "author": "J.Fred D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "Definitely authentic and bare bones. We were confused by the system since many regulars go into the kitchen and get their own plates and tea. We waited and eventually the waitress brought out a cart stacked high with steam pans and we grabbed what we could. Turns out, many of the buns are at the front counter and you need to ask the waitress or go up and get those. We got the wrong sparerib dish-it was greasy and tasteless. The beef dumplings and shrimp dumplings were good and the BBQ pork buns were unbelievable. We got two of those to go after devouring the first order. Two people stuff for $20 total, including a small tip.", "author": "Dawn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "The siewmai and the shrimp har gao were really delicious! The black bean ribs over rice is sooooo tasty. The chicken feet was good too. The rice crepe w shrimps is not the best one i've had, the crepe was too sticky and a bit thick. The food came quickly. Dont expect it to be a nice neat clean place becos it's not. But for the price it's great value for money and they serve great food!", "author": "Thuy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "The dim sum here was good quality. Had shrimp shumai, chicken feet, and some other items. \n\nThe only concern I had was that the cart didnt come by as often as I would like. The servers were nice and polite as far as things go. \n\nFinding parking was not pleasant but that is common for the area. There was a bus stop right in front of the place so if you use public transportation, you are in luck.", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-15", "description": "San Francisco's Chinatown, the largest outside of Asia, provides streets of restaurants, grocery stores, and shops for a whole afternoon of fun. Which is exactly what we did.\n\nRoaming around the streets trying to find a dim sum place for Sunday lunch, we crammed ourselves in with other locals (and tourists!). Dried goods line almost every grocery store, fresh produce just right beside, and the smell of BBQ pork everywhere!\n\nWe ended up finding Dol Ho, a small dim sum restaurant that offered to go items. Definitely a hole in the wall place, with minimal seating but packed to the brim with locals aside from one group of confused tourists seated communally with a group of seniors. As we entered, we increased the tourist count, and likewise, were seated with a couple of elderly ladies, happily chatting away and eating a bowl of rice and spare ribs.\n\nWhen we were seated, we quickly became confused as well. Items coming in from the back kitchen were lost in translation as none of the servers could speak English! Although we're both Asian and had a rough idea of what we wanted to eat, we had to go with the tried and true method of \"look, point, and eat.\" Time to experiment! Our first dish: a shrimp batter nested inside sliced eggplants. Normally not a fan of eggplant, this dish was actually well done. The shrimp batter was nice and light and the eggplant added quite a bit of substance to the dish. It surprisingly held its shape during the preparation and wasn't mushy at all, contrary to a lot of eggplant dishes that I had tried.\n\nOur usual dishes started to roll out at this point: dumplings! The traditional pork siu mai dumpling, along with variations of shrimp and vegetable dumplings. Delicious! The couple sharing our table smiled at our selections and nudged the soy sauce and chili condiments towards us. Not that it required any of it, as they were all well seasoned.\n\nBy the time we finished our dumplings, we were in a bit of a lull. Not knowing what else to order from the carts and definitely craving to try something other than dumplings, we waited. When a different cart pulled up, our chatting tablemates pointed to a steamed rice and pork dish that they previously shared. Taking the cue, we nodded and tried it out. Pretty good! And although I had no idea what the pricing was on any of these dishes, I imagined this was the cheapest because it was not a seafood dish. Bang for your buck? Knowing the elderly Asian population, that's probably why they urged us to try it. It filled the rest of our bellies up and we called it a day!\n\nMy thoughts? Although not your tourist trap, and trust me, we saw them along the streets, Don Ho ended up being pretty decent dim sum. It's nothing particularly special, just some home-style cooked food, freshly steamed dumplings, and a chance to try new dishes at the suggestion of your new San Francisco friends. The price? For the two of us, it ended up being a tad less than $20. Bonus! No wonder the two women shared a rice bowl and left smiling!\n\nWashing down our dim sum eats, which can be a heavier lunch than most, I opted for some guava bubble tea down the street. A nice relaxing day! Highly suggested if you've finished your tour of the Wharf and the piers and want to check out what else San Francisco has to offer.", "author": "Cindy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "The food was ok and service was ok.  The food was better than the service.  Don' know if I would try this place again.  Typical dim sum, but we were the only non-Asians here.  \n\nLack of seating and this place was busy from beginning to end.  I would try this place again, but not before trying all the other places.\n\nP.s.  The bathroom was clean, but it was weird...you have to walk through the kitchen to get there.", "author": "Heidi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Great! Excellent shrimp dumplings", "author": "Jeremy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "No frills and legit. By no frills, I mean there will be old grandpas coughing loudly and rustling newspapers while you chopstick pick your way through delicious food served on mixed and matched dishes.  The food is good and fast.  I strongly advise that if you come, bring someone who knows the name of dishes and that everyone in the group is cool with hole in the wall places. I can imagine a tourist giving a bad review if this were one of their first dim sum experiences, bring them to a \"cha lau\" restaurant with decor, waiters in vests, and dim sum carts instead.", "author": "Siu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Solid Dim Sum, service is decent and workers speak little English. But authentic place in China town, I'd come again.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "This is the place favoured by old people who like blackbean spareribs and rice. It can get noisy, and the staff may seem a little frazzled by lunch time, but this tea house is serious business. Real and down to earth. Good food. \n\nThey've been around a long time and know what they're doing.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "Hole in the wall place in Chinatown. Please do not come here if you are afraid of bad service and needs a 4 star restaurant. I will be up front with you, you don't feel like this is a clean place when you walk in. You will mainly see old folks who will sit there with the spare ribs over rice(those silver looking bowls) and their newspaper. You will also walk in and notice there is a big crowd on your left.(don't worry, most of them are taking food to go) And be ready to wait for about 5 minutes without anyone coming to greet you. So if you don't mind any of that and do care for some good food with AMAZING hot sauce(not really spicy, it's the flavor), then please come try Dol Ho.\n\nFood: You should DEFINITELY get the spare ribs over rice. Almost every table will order at least one of these. They also have a great variety of fried deliciousness like fried shrimp balls. I've tried their shrimp dumplings(Ha Gaw), all I can say is I definitely had better. But whatever you eat, please try their hot sauce!! It'd nothing like you thought it'd be. They put a lot of stuff in it and it taste great! \n\nWARNING-- you might not want to use the bathroom here. You will have to walk through the kitchen and you will most likely not have a good time. \n\nOverall, if I did not scare you and want to have a \"chinatown experience\", give this place a try!", "author": "Sappho C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "If you like dim sum and are on a budget, this the right place.  All locals and Chinese tourists.  We liked everything we tried and lunch for 2 was twenty bucks.", "author": "Cris F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "There are numerous hole in the wall dim sum places in chinatown. On yelp if you do a search you see the famous ones like Good Mong Kok bakery. Why is this place not at the top? My family comes to the city about once or twice a year and I never knew this place was here. What a pleasant surprise! We just bought some deep fried meat dumplings and fried taro root dumplings to-go. We ate them in our car about 10 minutes later. It was cold, but my husband said it was the most delicious ones he's had even when it's cold, it's better than the hot ones in other places. And this place actually have quite a few tables to sit down! Too bad our trip was quite short this time. I look forward to going back to eat at the restaurant next time.\n\nIt's not a 5-star because it's a hole in the wall place. But if you just want great and cheap food, this is it.", "author": "M R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "A small, 25 year old, locals hang out for dim sum.  Very reasonably priced, cash only.  Traditional Cantonese dishes only, no fancy creations.  Good solid dim sum, but language may be a problem.", "author": "John J O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "I absolutely enjoy eating dim sum from this place. I really like how fresh their food is. Some of the dishes I enjoy eating are the shrimp and pork dumplings along with the shrimp rice rolls splattered with soy sauce. The staff here are knowledgeable, friendly and courteous. I'm still loving their spare ribs rice plate, sometimes I come here to order these rice plates to go when I don't feel like cooking dinner.\n\nWi-Fi:\nThe Wi-Fi signals in this area aren't very clear since it is SFHAwifi. Want clear Wi-Fi signals? I suggest going to the library or Quickly on 1135 Powell St and 1170 Powell St.\n\nPayment: CASH ONLY!\n\nParking: Mostly Street  and Metered Parking\n\nI suggest parking your car at Portsmouth Square, North Beach or Vallejo St Garage if you plan on driving here. It's very nice if you can find yourself a spot to park your car. Be prepared to have spare coins or an SFMTA parking meter debit card with you since most of the spots here are equipped with parking meters. The DPT staff can appear anytime in those carts, via bicycle or by walking through this area.\n\nTheir Business Hours were originally from 8 am - 3 pm Monday-Tuesday and Thursday-Sunday but they are probably revising their Hours of Operation or something.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-05", "description": "Food excellent. But they were out of 50% of the items on the menu and they said it was too busy to push the cart around - we were hoping for that experience :0(  Busy and service spotty but obviously popular with the natives - no English spoken here.  Cash ONLY!  Walk through the kitchen to get to the bathroom. Rat traps everywhere in there. No toilet paper.", "author": "Kimberly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "Knocking around the big city and got a hankering for some dim sum.  Stumbled across this place and loved it.  It is somewhat small and crowded but the food is great.  Better than most and priced on the cheap side.  Been to other dim sum places that are bigger, fancier and higher priced and definately not as good.  \n\n\"Typical\" dim sum with the carts that roll around.  English is definately a second language there, so bruch up on your manderin.", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "This place is a small hole in the wall lined with small tables packed with people which is a good sign. We were lucky enough to be able to grab a table since a large group just left before us. Love the fact that the have a big ol containers of hot chili oil already at the tables so you dont have to keep bugging the servers for more. Everything is served piping hot straight out of the kitchen on the traditional dim sum cart just like how it should be. The dim sum here is absolutely amazing because its super fresh nothings been sitting around in their steamer containers. They pack up all the cold dim sum that no ones ordered and sell it at the counter in front of the window. Everything was super good but my personal favorites where the shrimp and cilantro dumplings and the shu mai. The chicken feet were by far the best I've had since moving to the Bay Area here. No frills good dim sum for super cheap. To feed 7 people cost under 70 bucks! What a steal! Will def be finding our way back here soon.", "author": "Mercedes R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-30", "description": "Kind of a hole in a wall, you aren't here for service or cleanliest, food is mediocre at best. They push dim sim plates out on carts and you get to pick your items without having to order. My sisters liked the Siu Mai, Pai Quat and har chueng the most. We were actually on a mission to find the best mini egg custard filled buns only to find they sell gigantic ones, I bought one anyways and thought the bun was good but the custard was too artificial and sweet tasting.", "author": "Darling M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "This place is by no means amazing but it is great for cheap Chinese food. My mom loves this place and she is a pretty picky Chinese eater. She loves their spare ribs over rice bowls. I don't like spare ribs but everyone else seems to love it. It is cheap and hearty! If you have a regular size stomach one bowl of that and an item of dim sum is enough to last you the rest of the day. Probably cost you 5 bucks including tip! WHOA! \n\nSometimes it is a hit or miss though. My mom said they got rotten shrimp before. The shrimp today was fine. They have stuff you don't find at legit dim sum restaurants. You don't have to eat here. They are more like a fast food joint. A lot of people order to go.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Excellent food. First-timers may be slightly uncomfortable - I had a Canto speaker with me to take care of ordering - but service is friendly and expedient (again, first-timers may be off put, but don't confuse expedience with being rude or standoffish -- the waitresses are very busy!)", "author": "Alice J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-27", "description": "Very basic  dimsum place and the servers were very nice. They brought the shrimp dishes when they felt that we were going to order the seafood dimsum. I also requested the tofu dimsum which was quite greasy and not that fluffy. It was an interesting dimsum experience but I had super great company. Each dimsum entree was approximately $2.50. We had the shrimp balls, crispy shrimp balls, pork shamai, tofu with shrimp, and hot tea. We were the only nonChinese in the restaurant that Sunday.The dimsum was sort of salty as well.", "author": "Kitty D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "IMPORTANT: First of all, if you are not of (South) Chinese descent, you will have a different experience than me and maybe should disregard this review as it will be biased but if that doesn't bother you then keep reading! \n*not biased paragraph\n\nChinese name: 多好茶室 \n\nThis has got to be one of the best places in the City and Chinatown which is not saying much because most of them are alright, bordering on gross. This place serves comfort food more than anything else (although I only tried spareribs over rice and steamed salted fish & pork paste over rice). I think anything over rice is basically comfort food lol. I wonder how I've never been to this place; it's so good! We ordered 2 (orders of) fung zao [chicken feet], 2 siu mai, 2 nu mai gai [sweet rice with chicken] (jumbo size!), 2 ha gao, 2 chiang foon [rolled rice noodle], 2 pai goo't fan [spareribs over rice], and 1 ham ngui ji fan [salted fish & pork paste over rice]. Probably the best 'Mom n Pops' place I've ever been to. \n\nI came here with my grandma and 3 of my aunts so they did all the ordering for us. They also didn't give a menu (probably assuming we know what we can order, which is correct) but I basically memorized all the basic dim sum items I really like. The staff was really helpful when I spilled my whole cup of tea on the table which was embarrassing to say the least. I'd say you can't go wrong with any dishes they serve because it got the rural mainland China taste. Kind of hard to come by outside of China.\n\n*They serve their stuff (dim sum included) in metal so don't be too surprised if it's really hot. The plates and tea cups are ceramic. They also have soy sauce and the spicy mix that's served in most Asian restaurants, which is the bomb diggity even though it looks weird. I saw in one of the reviews for this restaurant that the customer was complaining that the spareribs have tiny bones. Well duh, this is Chinese cuisine, not the [awful] American Chinese stuff so take that into account if/when you eat here.", "author": "Victoria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "The definition of the hole in the wall restaurant. Unlike some of the other reviewed Yelp restaurants nearby that have no seating, this is a real restaurant. \n\nSpartan to be sure but the food that comes out of the kitchen is fantastic. Someone else recommended sitting by the kitchen since the single cart that comes out needs to make the rounds of the whole place. \n\nWe feasted and had two beers to boot and the bill was $21. Oh yeah.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "I just read this place had a food safety warning, but to hell with that.  The Dim Sum here is fantastic.  What is life without a little bit of danger amiright?  It's cheap, its delicious, it has zero ambiance, and there is nothing wrong with any of that.  P.S. I ate here with three people and none of us got sick.", "author": "Enrique F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "MUST-TRY, especially if you're foreign to yum-cha.\n\nI have been having Sunday morning yum-cha's since I was 0. I know what good dim sum tastes like. And this is good dim sum! It deserves so much more credit, although I do admit it is hard when they are so small so it always looks super-filled and kind of intimidating in a weird way. I used to be embarrassed to come here with my family because it was so cramped, and I would be all \"why don't we just go to New Asia\" or somewhere basic. But this place is yummy AND cheap. \n\nIt is a true hole-in-the-wall gem.", "author": "Michelle Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-29", "description": "First off: dirty dirty. This place was not clean and it seems like a long time since it was cleaned. \n\nafter combing yelp for a great Dim Sum I landed on Dol Ho. It seemed like it would be great. Authentic, no tourists. Food right from China. \n\nThe place was packed with all Chinese. It was very busy. I felt like no one spoke English. I thought it was cool and novel until I tried to order. Ugh. They just brought me stuff which I didn't know what it was. I kinda lost confidence in whether the undercooked chicken was cooked at all. Actually it could of been fine but I was kinda grossed out by the experience. \n\nThey showed me to a small table that was being used by an old Chinese man I sat across from him and he was very nice. He tried to help but the language barrier was too great. \n\nI don't recommend.", "author": "J K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-09", "description": "3.5 stars!\n\nUnless you're with a friend that speaks Chinese... it's a little hard to order. There's only one server and she is very intimidating haha. Overall, nice vibe in the restaurant. Seems like a lot of local people come over and eat. The food was 3.5 stars.. Not warm enough and some were overly greasy. But all plates were reasonable good and very large portion! I might come back to get some other menus.", "author": "Sue K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "OMG, where to start? Well, first, while I'm an eclectic white boy, and while my wife is an eclectic Filipina, we are definitely familiar with the dim sum offerings in LA's Chinatown. Having said that, San Francisco's Chinatown is at least ten times larger, and far more bustling. On the recommendations of Yelpers, we gave \"Dol Ho\" a try. And we're sure glad we did! This precious hole-in-the-wall is the real deal. Authentic to the core. And don't worry at all if you aren't Chinese and don't speak a word of Chinese. We had perfectly fine service, and language was no barrier at all. Point and you shall receive! The total tab for two very satiated diners: $21.25. The best dim sum experience of my life. Damned good! Can't wait to return on my next voyage to The City. This place was incredible.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "Great dim sum experience and my favorite is steamed spare rib. The waitress are always busy and can be unresponsive from time to time, but considering its price($40 including tax and tips for 4), it is a pretty good deal.", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "Oh yeah, easy like Sunday morning, ordered the shrimp balls and fried tofu. Still waiting on the beef patty as we walked in at 0737. The place was 90% packed already as everyone was just sipping tea.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "3.5 stars. Dingy hole in the wall with tattered awning, we were the only non- Asians in the place.  I liked it!  Good shrimp balls, sesame balls, my favorite was a shrimp & parsley steamed dumpling.  Somewhat limited selection.  I really wanted some greens though, the only vegetable I saw was a green bell pepper.", "author": "Art-Suzanne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "The food here is pretty good and reasonably priced. I like the fact that they bring the food out in carts although they only had 1 cart out at a time, and there was a 5 min wait between carts. This place gets really busy on the weekends, they don't lead you to your table, you have to just take a table when it frees up. As a result you have to be aggressive when taking a table or else someone will cut in front of you and take your table.", "author": "Guorui W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Excellent dim sum. Clearly appreciated by the locals, as this place was packed soon after I arrived.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "Food was decent, no wait when i came at 9:30ish. \nPrice is not bad, everything ranges from 2.75 - 3.75\nFor two people, we ended up spending $19. \nThe steamed rice and pork square was very delish.\nCompared to Good Mong Kok though, the hai gow and siu mai's aren't as big.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "The shrimp dumpling (har gao) here are stellar. Thin skins (unlike the overly stuffed gummy ones at Good Mong Kok) and nice filling. The shiu mai I wasn't as big of a fan of because it erred strongly on the meatier side. Shrimp dumplings with cilantro are exactly that and very similar to the shrimp dumplings so just pick one of them to get. Prices are reasonable and if you get it to go, it's cheaper than if you eat it there.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "That little place reminds me of the Hong Kong old style tea house where the locals goes to every morning for breakfast and tea. The older folks would sit around reading the morning paper while some catch up with their friends in between their market time. Many people stream in and out of the café to buy take-away breakfast.\n\nWe sat by a table near the entrance and watched the on going action in the café while enjoying our dim sum and tea. \n\nThe one word I can describe the dim sum in this café is 'down-to-earth'. No frills, a hole-in-the-wall place where you rub elbows with the locals. As we sat down the hostess promptly delivered a hot pot of Chinese tea and the freshly prepared dim sum varieties on a cart. \n\nThe dumpling was steaming hot as I bite into it. I can taste the freshness of the meat and shrimp, no MSG and somehow the texture was not oily like most dim sum does. Not that I mind if the dim sum is oily since I love eating fat. But I guess that's what most people would like. It was delicious!\n\nWe enjoy eating the 3 different types of steamed dumplings and decided to try a bake item. I picked the BBQ pork pastry puff. When the plate landed on our table, my first impression was the puff was too big. I begin to imagine the texture to be thick and firm with very little BBQ pork fillings in it.\n\nAs I break open one into half with a pair of chopsticks, the whole puff fell apart easily. The pastry was thin and soft, and filled with plenty of BBQ pork cube fillings. I took a bite. The BBQ pork was not too sweet and the pastry just melts in the mouth.\n\nIt was one of the best tasting BBQ pork puff I ever had. If I want to burn my carb count for the once in a while treats, this could be it. I estimate it to have about 15g of carb per puff.", "author": "Kelly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "I live in North Beach and I've been eating at this place for a couple of years. I love it because they serve old school steamed bar-b-que pork buns from the '80s and nobody else does and they taste awesome. \n\nLately, I've been ordering two orders of shrimp dumplings with vegetables and a bar-b-que pork bun to go for 5$. \n\nBeware the bones in the ribs rice. Beef rice is an awesome choice. It's a big old meat ball with rice and a nice soy sauce. It doesn't have bones and it's a serious lunch for about 5$ or less--with tea if ate in.", "author": "Avram K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Even better than i thought it would be.  A total hole in the wall place with delicious food. Very satisfying.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-05", "description": "The food is inexpensive. The service sub-par, but you get what you pay for.", "author": "Sherman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Dol Ho is no lavish Yank Sing but if you want legit Dim Sum this is the real deal. If it's not in the carts you can ask for it to be made fresh. Yes you might have to share a table with a stranger but that's part of the experience. \n\nThe spare ribs over rice is perfection! Apparently you can ask buy a bag of the pre-marinated raw ribs to make this at home. One bag costs around 4.25 and enough to make 4 servings of the little bowls or 1 family size bowl.", "author": "elle f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Went to this place to try their dim sum on our recent visit to San Francisco.  This place is absolutely ridiculously CHEAP!  One of the cheapest places I've ever had dim sum at (I've gone all my life as I'm asian).  There were three of us and we ordered 8 dishes - total was $24 after tip. Ridiculous. Oh how I wish I lived in San Francisco.\n\nAnyways, as people have previously said, the place is hole in the wall but it's not really dirty. It's essentially your typical asian restaurant - very bare and minimal.  We came here on a weekday around 1pm so we probably missed the lunch rush but there were still lots of old asian grandma's/grandpa's.  Looks like they constantly come here all the time.  We did see one caucasian couple and the person in the front was nice enough to help them order (think she may be the only one that speaks english).\n\nFor the food, we ordered regular dishes that we normally get when we go for dim sum (har gow, siu mai are staples). There was 4 of them per dish which was nice! We also tried the har cheung fun (shrimp rice noodle rolls), their famous pai gwut fan (rice with spare ribs), shrimp fried balls and the wu gock (taro dumplings/balls), the last two dishes came in 3's and were enormous.  We also tried two other dishes, not sure of their names but they were steamed dumplings with shrimp and pork.  The only bad dish we had was the wu gock as it was cold.  Food is a bit on the salty side but that's what hot tea is for! Haha, the best was my dad went into the back to re-fill our tea. We'd fit in perfectly with the locals!\n\nParking is INSANE.  One thing I would definitely recommend for tourists is to park at the Portsmouth Square (it's underground parking for $3/hr which is reasonable). The address is: 733 Kearny Street, write it down and put it in the GPS.  Trust me on this, you'll save lots of time and headaches of trying to look for street parking which is ridiculous with the hills and constant people crossing the street.  If you do street parking, there is the ones with yellow parking meters (only for 30 minutes max) vs. black meters (1 hour parking max) although maybe you'll get lucky and find 2 hours?\n\nAnyways, I know there are lots of places to get dim sum in San Francisco but if you want something cheap and good, this is a good bet. Make sure you bring CASH as that's all they accept.", "author": "Jonny M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-25", "description": "One of the better Dim Sum spots. Hygiene is questionable as the tables stay oily and banged up but the food is good. We went during lunch and got the assorted trays of Dim Sum portions delivered to our table. Most of the dishes I expected and enjoyed (Chicken Feet, Shui Mai, Har Gow, Meatballs, etc), some were new and weird (Bell Pepper Meatballs, Taro And Pork Noodle Beds, etc). Overall, it was a good quick bite to eat", "author": "Alex K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "We scraped the bottom of the barrel and it was so damn delicious!!!!!!! I wish we had more dim sum to eat but unfortunately, we came at 4:00pm and the dim sum was basically out, but we still managed to eat some shrimps and buns. Best experiences of my dim sum life. Will be back if we're in SF!", "author": "Loan-Anh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "Do you like cheap dim sum any day of the week?  Do you like when they bring around the little carts & you try to figure out what's in each of the dishes?  Do you like eating in dingy restaurants where you may be literally rubbing elbows with older Chinese folks?  Then Dol Ho is for you!\n\nThis is your typical divey, no frills, hole in the wall Chinatown restaurant.  The servers are loud & not terribly friendly.  The food is cheap, but it's very good.  I would recommend the shrimp har gow.  It was the best I've ever had!  It tasted very fresh & melted in my mouth.  The shrimp & chive dumplings and pork shu mai were also delicious.  It seems like everyone in the restaurant was eating the spare ribs over rice but when it came around on the cart it looked like a pile of raw meat.  Not very appetizing so we skipped it, but it seems like this is the most popular dish in the restaurant so obviously there must be something good about it.\n\nThe only disappointment for me was the lack of vegetable dishes.  I asked for an order of Chinese broccoli & was handed a dim sum menu with no vegetable options.  Strange.  Don't come here if you are a vegetarian!\n\nWe left more than satisfied and paid a measly $20 for lunch for 3 people.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-11", "description": "Poor service, some food are cold and not fresh. Bad experience for Chinese dim sum.  Do not choose this one,same price you will have better choice.", "author": "Zoey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "Everytime i walk by dol Ho i always are plenty of old grandmas and grandpas inside eating little pots of black bean spareribs with rice. \n\nThe black bean spareribs with rice is cheap! At $2.50 a bowl, no wonder all the grandmas and grandpas come here for lunch. Dol Ho also has giant beef balls that are unlike any you'll find at a dim sum place. And their crispy shrimp balls are to die for! Each order comes with 4 pieces so there's plenty to go around.", "author": "Jess s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "Don't let the faded awning fool you, this place makes the best deep fried savory dumplings (ham sui gok). They also have the sweet kind that's filled with some kind of sweet bean filling. I only like the savory kind, but both varieties are fried to a crisp, golden brown. So delicious! These aren't like those limp, greasy fried dumplings that you find at other dim sum places; I tell you they can hold their ground. The sweet sesame ones stay perfectly round even if you let them sit around. That's how crispy they are! At 55 cents a pop, these are a steal! Whenever I find myself in Chinatown, which is rare, I make it a point to stop here! \n\nBtw, the ladies who work behind the counter are rude, but that comes with the territory.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "Amazing dim sum, great spare ribs, pork dumpling, shrimp dumpling, shrimp crepe, tea is amazing. Came in a party of 6 and had a visitor from Singapore also. Love the service and food.", "author": "Jonathan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-24", "description": "Disappointing.  Any dim sum in Chinatown should be held to higher standards than the unfortunate offerings that Dol Ho provides.  I've always considered midwest and east coast dim sum to be inferior to what we can get in California, but I can definitely say that you can get better dim sum in St. Louis or Salt Lake than what they serve up at Dol Ho.\n\nWhile the restaurant was nearly packed, the food was generally bland and mushy, the tables and plates were sticky, and the service was, well, let's just say that it wasn't really provided.  The char siu bao, which is always my favorite, was one of the worst dishes we ordered; I couldn't even tell if there was any actual meat in it, since there was just some not-quite-char-siu-flavored goop inside.\n\nI'm used to the different standards of Chinatown businesses, but at the very least, the food has to be good.  And it wasn't!  I'm going elsewhere next time.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "This is my favorite place to eat in Chinatown. I love the pork spare ribs over rice. \n\nIt's really hole-in-the-wall and run by older Chinese people so don't expect to receive great customer service, but if you can come with someone who speaks Cantonese it really helps. Even if you don't speak Chinese, it's worth a visit just for the ribs!\n\nTIP:  I buy the pre-marinated bags of pork ribs they sell and freeze them when I get home. When I'm craving spare ribs, I defrost a bag in my fridge and cook them over rice in my rice cooker. I literally just pour the whole bag of meat over the rice and press cook. It turns out great and it's delicious!", "author": "Phoebe Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "The food is awesome... All shrimp dumplings were so fresh, the \"crepe\" with Chinese parsley was delicious. Stuffed eggplant was also yum. However, the service is terrible - we had to make a scene to get someone to take our order, and every time we ordered something they acted like it was a huge imposition.", "author": "Ro A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "If you are not concerned about fancy atmosphere or decor, don't care too much about the service, but want to experience the true offerings of what Chinatown has, i.e., good, tasty dim sum, this is the place to come to.\n\nDol Ho seems to cater to locals more than tourists. There were lots of elderly folk enjoying a couple of dishes and a pot of tea. We ordered steamed chicken over rice, shumai, har gow, eggplant stuffed with shrimp, pork and mushroom dumpling, turnip cake, chicken wrapped in rice sheet, beef wrapped in rice sheet, steamed chicken feet. Nice portions, more than enough food for everyone. Don't bother asking for veggies - no gai lan here. \n\nTheirs is definitely comfort food. Prices are outrageously reasonable - our tab for four including a generous tip, came to $30. \n\nI would definitely make my way back to Dol Ho on my next trek into the City!", "author": "IM M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "We went to this place because of the yelp reviews. It has great food and is very cheap. Fed 3 people fully for $24 on a weekend. The place on the outside looks horrible but the kitchen is clean (large door by seating area that you can easily see inside). Totally worth it. Don't bother going to a large place, go to the hole in the wall. :)", "author": "Megan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-24", "description": "Tasty dim sum takeout.  If you're not familiar with this kind of authentic Chinese food experience, you may take it to be a bit lacking in service, but I say, it adds to it's charm.  Crowded at times.  Go with someone who speaks Cantonese, if you can.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-16", "description": "Walk in. Look around. Find a table by a Chinese granny. And order what she does. They are the ones with sage wisdom at Dol Ho and know what's good. \n\nI've walked by Dol Ho so many times but never thought too much it until I had a friend visiting and he wanted a more \"authentic\" dim sum experience than City View and Yank Sing. Thanks to Yelp, we ventured in to this modest nook that serves fresh and cheap afternoon delights. \n\nWe had the mandatory spareribs over rice that was so raved about (and next-table-granny gestured us to order it too). It was alright - the spareribs had good flavor and were tender but overall nothing that special. I think the standout for us was the radish cake. It had a great consistency and a nice crispiness around it. Other dishes we tried included the staples - Siu Mai (pork dumpling), Har Gow (Shrimp Dumpling), Har Cheong (Shrimp in rice noodles) and fried Yong Tau Foo (Minced shrimp stuffed in tofu). They were all decent and satisfied our Dim Sum fix although I found myself reaching over aforementioned Granny's table to get more chili sauce. \n\nI think the real charm to Dol Ho is it's lack of pretension, take-it-or-leave it, just-for-the-townies experience. That and the price is hard to beat. Our total was less than $10 a person and we were quite full I must say. For simple, unadulterated fare in a setting that matches just that, Dol Ho is worth at least a visit.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Went here on a whim when a friend came to visit and we really lucked out! Great dim sum for a very cheap price. We ordered about 8 dishes to share and cost $25. The only thing I would caution is that if you don't speak Chinese it's hard to order. But the servers are great and if you ask them to open up the dim sum before you order, they will. Also, you have to ask them about the steamed pork buns if you want an order and they will get them from you. Overall ambiance is okay. It's pretty clean but pretty basic. Don't go here if you want a fancy sit down restaurant, but if you want a quick fix of delicious dim sum, this place does the job. Also, be aggressive and just sit down at the first available table. Otherwise, it can get to be a long wait.", "author": "Viroopa V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-24", "description": "Let me be as straightforward as possible. Don't have high expectations for this place. If you want cheap dim sum this is the place. When you walk in, it's literally looks like a shack, just basic table and chairs. Even though this place doesn't have a wait, it's very limited seating and you most likely have to share your table. When we were seated there was a guy sitting there eating quietly by himself and the other side of the table still had the empty plates from the previous guests. You just have to push it aside and someone will clean the table off. You have to be aggressive to get service here, like previous reviewers, it's normal to walk to the back and get your own tea. There is only one cart that comes around with different items every 15 minutes or so. Make sure you get their attention, they also don't speak much English. The best food was the short ribs over rice. Other than that, the rest of the items weren't as memorable. I feel the major turnoff of this place is the cleanliness and unconventional setup of sharing tables. If you're willing to be open minded and not picky about its appearance, this could be for you.", "author": "Van N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-18", "description": "We tried this place today on the Yelp reviews.  It's a true hole in the wall.  They were out of most of the things we wanted to order and the waitress ended up just bringing us a tray of random things and handing them to us.  The tea was delicious.  The sticky rice/meat item wrapped in a banana leaf was good, some sort of beef meatball looking thing was terrible.  I'm giving it two stars because the place was filthy.", "author": "Stacey J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "One of the best dim sum my boyfriend and I ever had. You don't even need soy sauce on the siumai. That good. We had 6+ orders, and it came up to $18.79!!!! We felt out of place because almost all the customers there are Chinese, which was a good sign for us; that means the food is good. Props to Thrillist for getting us here.", "author": "Diane D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Great chili oil!  Hau gau was full of shrimp.  Siu mai so so.  Loved the beef fun.  Came too early for the spareribs but when they came out the waitress put them on all the \"regulars\" tables -- the Asian men reading newspapers.\n\nHad some trouble ordering but can't beat the prices.", "author": "E. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "Dim sum was really good. Got a little bit of everything, and everything was pretty good and flavorful!", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "I absolutely love this place. I grew up going to Chinatown every weekend with my family and my Grandma would always buy us a to-go order of their spare rib over rice or their beef balls over rice. It's just the right amount of food and it's so cheap! I love the spare rib sauce they pour over the rice and if you eat it right away, you'll notice that the rice is cooked really well. I would eat here everyday if I worked near. \n\nThe rest if their dim sum is pretty cheap too. The best part is that its authentic. I'd recommend the thick rice noodles over beef or shrimp. \n\nYum. Ok I'm hungry now.", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Once you see the decor (and lack of tablecloths) at this place, then you know that you're not going to get 1) good \"service\" and 2) very very clean tables and dining ware.\n\nWith that said, the dim sum was delicious and it came out so fast that I was full about 5 minutes into eating! And everything was so cheap that our bill for 6 items was less than $13. Can you believe that? I don't think I can get dim sum that cheap on this side of the Bay!\n\nIf I'm ever in the area again, I'll definitely stop by this place. =]", "author": "Diana T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "Solid HK style dim sum.  Not the best place for those only used to \"American Chinese\" and there is very little in the way of service there.  However, the food is superb - be clear and respectful to get what you want.  If you have a hard time ordering this isn't the place for you.\n\nGood steamed buns, pork spare ribs, and dumplings.", "author": "C D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "If you are used to Hong Kong style food places where the place is not exactly as clean as tidy as most of the restaurants in the US, I'd recommend you to give this a try.  It wasn't really crowded when we got there, but we had to share a table with strangers  (this is very usual in HK). \n\nMost of their dimsum are really good.", "author": "Archie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-05", "description": "Absolutely great place. Here you can eat Dim Sum like in Hong Kong! Love it!! Come here every Sunday. And it's really cheap, two people can eat here for $15!", "author": "Cathrine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-26", "description": "They added salted fish pork patty over rice to their selection!  This is soul food at its best.  You don't get a lot of salted fish but the aroma and flavor are definitely there.  The pork patty is tender and flavorful too.  \n\nWe came here late around 2pm and there were no crowds and we had plenty tables to choose from.  Instead of the 3 carts (rice, steamed items and fried items), you order what you want and it's steamed for you.  We had shrimp rice noodle (ok), sparerib (delicious, this is a must), beef ball (again, another must), beef tripe (very nice garlic flavor), and cilantro shrimp dumpling (tasty).  All this and 3 rice to go (one each of sparerib, chicken and the salted fish pork patty) for a little over $20!", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "This has got to be one of the funniest dim sum restaurants I have been to. The quality is decent for the price you pay. It is no upscale restaurant, more run down than anything. We came here knowing what to expect after reading the reviews so we were just anticipating some decent dim sum and we got that. The service was quick. The server doesn't know much English. There is no menu given unless you ask for it and I think its just their items on an 8x11 piece of paper with no price. They reuse this piece of paper fairly often too. Every time our order came out, instead of marking the item on the sheet, she would just pull out another used sheet which had the designated amount of dishes that came out. It was hilarious. There are a lot of the older local Chinese gramps sitting around in this restaurant as well, but a lot of other locals dropping in to pick up take out.", "author": "Emy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "In the heard of Chinatown, next to the busy markets on Stockton where everyone is selecting the best and fresh produce.  In between Pacific and Stockton street there is Dol Ho!  In front you can barely see the inside because of the large tray's that are steaming to keep the buns warm.\n\nThis place is full of senior citizens and old folks from around and far.  Mostly just having Dim sum and enjoying tea.  In translation of Dim Sum to Chinese, it refers to drink tea.  Majority of the folks here are reading the newspaper and  having small bites of their food.\n\nUsually one or two people run a cart of food.  The first cart usually is a variety of Dim Sum.  Har Gow, Shu Mai, Fung jao etc.. From shrimp to park dumplings to the delicate of chicken feet.  A lot to choose from and cheap.  Then another cart rolls out with these stainless steel pots full of goodies.  Spare rib over rice or pork cake over rice.  This is the entree of this place, famous for their spare rib over rice.\n\nA small stainless tall bowl will surprisingly fill you up easy.  At $2.75 a pop is fair game and enough to fill you up.  Majority of the time its a self service place here.  All the folks who finish their hot water in their tea pot will go self service to refill hot water because the people working here are busy.  Right, i know bad customer service? It's a tradition and the people who enjoy coming here don't mind and just want to get more water and enjoy more tea and eat.\n\nOverall this is a family run business, over decades literally.  Still the same good stuff and hope this place will stay open forever.  Everyone always order the spare rib over rice.  People order more than one order of this goodie.  They also sell raw spare ribs marinade and ready to steam at home.  They sell it by the zip lock bag.  \n\nThis place is a hole in a wall and great.  This place have so many regulars that if there is a chair open and table half empty someone will sit across or next to you so they can enjoy their food and not have to wait.\n\n**parking**\n\nThis will be tough, best bet park far or park in the parking structure at Portsmouth square or Vallejo street garage.\n\nCASH ONLY CASH ONLY CASH ONLYCASH ONLY CASH ONLY CASH", "author": "Kenneth Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "Hole in the wall.  Went here because of the yelp rating which did not live up to the rating of why we went in the first place.  Very difficult to order if you are not Chinese speaking.  Service was terrible and rude, but she was rude to everyone so at least it wasn't because we weren't Chinese (and the only whites in the place).  The food was ok, but not great.  We're from Hawaii so we can get way better dim sum then this place had to offer.  The price was good considering the taste was ok.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "It scares me that I'm giving this place a 4 star just because it's a crappy hole in the wall, dirty, smelly Chinese restaurant and yet they have the most delightful $1.50 spare ribs over rice!!  \n\nWe came here after our 10k for the Chinatown YMCA run and at first i was REALLY hesitant to eat here.  The crowd, the smells, the service... SIGH.  But, who am I to be such a snob about GOOD FOOD?  There were 8 of us and they happily accommodated our large group when it was pretty obvious that this is usually a solo, max 2 per group type of restaurant.  Yes, expect to be seated on a round table with a bunch of random strangers.  It's that kind of restaurant :)\n\nOverall, a very good experience.  no frills but good and cheap food.  i will be going back the next time I'm in CT!", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Chinatown was crazy busy with everyone shopping for Chinese New Year....we had to get off of Stockton! Fortunately, we walked West on Pacific and found this tiny restaurant with lots of locals. We glanced in and as we were standing in the doorway a Chinese gentleman on the sidewalk told us that the food was very good and we should go in. Three stars, not five. Well, we appreciated his advice and went in. Take a seat anywhere. There may not be a menu handy, but they will bring you one.\nOur waitress did not speak much English, but would point to an item and say pork or fish or chicken. We could also select off the Chinese/English menu and got BBQ pork buns that were never on her tray. From her tray we selected a chicken with parsley dumpling, a pork dumpling and best by far was the stuffed Egg Plant (unknown fish and shrimp filling). \nWe enjoyed our lunch and did not have any second doubts while there, or after our visit. Grand total including hot tea for two.....$11.75.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "This place is a dive of a restaurant and the service is poor, but the food is outstanding.  If you can get past the dirty windows and floors and poor service you will want to eat here everyday. Yes it is that good.... p.s. you do not want to use the restrooms either.  But damn the food is good.", "author": "Doug G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-18", "description": "whoa, i felt like i was literally in China.\n\nShared a table with a few strangers and had some delicious pork spare rib over rice. Had an awesome time, but geez does it get packed.", "author": "dan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-19", "description": "I usually try to shy away from places like this. It's small, cramped with people, and by the looks of it is hard to talk with the waitstaff unless you know Chinese. Good thing the only bit of Chinese I DO know are the names of dim sum food items. \n\nMost memorable:\n*Spare ribs over rice - comes in a tin can and apparently is what they're known for. Spare ribs laid on rice that's soaked in the rib juices. YUM\n*Foil-wrapped chicken - a large piece of chicken on the bone with sauce wrapped in foil and fried that way to cook. Unhealthy but oh sooo good\n\nFor a table of 8, it was pretty hard to score a table since there's only one large round table that could accommodate us. But overall, we ended up paying $6/each to be stuffed. Lucky for us, the table was right next to the kitchen and first to be offered food. If you're looking for dim sum in Chinatown, this is a safe bet.\n\nTips:\nParking is nearly impossible\nWait time can be long if local Chinese are entrenched in the seats\nHealth score as of Oct 2011 was in the 70s", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "This place has some of the cheapest good-quality dim sum in town. With a kind of run-down feeling, it can definitely be a little intimidating, especially if you're a first-timer or not familiar with Cantonese. The tables filled with old pau paus and gung gungs (Chinese grandmas and grandpas) should give you an indication of the typical clientele. \n\nOnce you're seated (and be warned, you may be seated with strangers if you have a small party or are by yourself), most usuals get up and grab tea from the back room, as service is minimal here. Pushcarts with ha gao and siu mai come around periodically but when the pai gwut fan, or pork spareribs over rice, comes out, the usuals will run up to the server and take a couple of the silver bowls of goodness. You better be on your toes if you want a chance of eating it cause it seriously goes fast. \n\nStop by Dol Ho for an authentic cheap meal. Bring a Cantonese translator if at all possible.  \n\n\nP.S. Their \"lat jiu\" or spicy chili oil condiment is RIDICULOUSLY addictive. It's homemade and different from any other lat jiu I've had, with some sort of minced picked veggies in there. I usually buy a jar to keep at home with me...under my pillow.", "author": "Rayna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "Went here for a quick bite of dim sum before leaving Chinatown. It's definitely a hole in the wall and we had to compete for attention with people buying stuff for Chinese New Year two days later and with the shouting back and forth from the front counter and the kitchen, but that's part of the charm.\n\nWe had shrimp pot stickers, pork dumplings and steamed pork buns all of which were as good as I've had anywhere and the full bill came to less than $8. This is the real deal.\n\nOne word of caution is that you should not expect your interactions to be perfectly fluid in English, it took me a few minutes to understand what each thing was and to order the pork buns which didn't get brought out at first.\n\nEven so, if you're even just a little adventurous, you'll love it.", "author": "Colin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "They are closed at the moment, probably until end of Nov. I wished someone had said something since we went there this morning just for that!", "author": "Yan Wei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-12", "description": "This is my favorite dimsum place due to the fact that their dimsum is fairly cheap and portion is pretty generous. I usually just eat their Pork ribs rice and their shrimp dumpling. Any other items are just alright, not my favorite. I think I am happy enough just to eat 1 order of pork ribs rice, especially when they are sizzling hot (yum!). You have to share table with other people and I think only few people there can speak english, and they speak a broken english but they do understand what I am saying.\nBest bang for your buck.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "This is how it all started.  The Yank Sing, Koi Palace, Cityview, and Yet Wah have all originated from this mom and pop type establishment.  Before the glamor and glory of the fine dining dim sum houses, there was this place, Dol ho.  \n\nDol ho has been a Chinatown icon since I was growing up and trust me that is a long time ago.  The decor, tables, chairs are probably the ones that were around 40 years ago.  The people serving the food is also the dishwasher, the front counter person, the water refiller.  They do it all.  At one point when I went into the kitchen to refill my teapot.  The employee actually pointed to where the hot water dispenser was as though they were doing me a favor.\n\nI just love the old school places.  This place is not for the faint of heart nor the people who require a certain level of service.  This is just down home Chinese soul food.  The dim sum is good not great but the true feel of  the history of how dim sum houses were is best illustrated in this hole in the wall in Chinatown.", "author": "jason g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-03", "description": "I was in my mood for something extremely salty and doughy at the same time and since I was in the neighborhood with a friend, I made them wait for me while I rushed inside to grab a few nibblies for our walk back to his apartment.\n\nAt the counter, I ordered my usual: puffs with shrimp inside, Har Gow (I'm a sucker for the tasty shrimp enfolded in transparent outer layer), Shu Mai (large ones, bigger than a walnut with a savory filling of pork, shrimp, mushrooms, steamed) and their Beef Balls.  \n\nService is quick and I am already nibbling on a puff by the time I hit the door.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "Cheap dim sum. One of the cheapest places in Chinatown. It's small, cramped, and looks dingy, but it's a good place. Main reason why?\n\nThe spareribs over rice. When my mom wants to grab a quick, cheap, filling lunch for 5 (count: FIVE), she orders spareribs over rice. It's good, cheap, and doesn't break the bank. Go go go!", "author": "Betty T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "Stay away! I don't know what everyone is raving about this place is unacceptable in service, taste and hygiene. First the table was dirty we asked twice for the server to wipe it, there was a hair on the plate when the server brought the dishes out, she just brushed it off with her finger and threw the plates at each person around the table. When we asked for hot sauce she grunted and grabbed it off a nearby table and slammed it on ours.  The dim sum itself was beyond disappointing the sui mai was filled with mostly just fat the rice wrap was soaked with water and extra soggy. If you prefer rude service and awful food this place is for you.", "author": "Grace T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-13", "description": "It's fine. It's regular, ordinary dim sum. There's nothing special about it. I would go here to read the paper and eat breakfast over some buns and tea, but not to bring someone to try dim sum.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-29", "description": "AHH! I LOVEEEEEEE THEIR FOOD. THE PRICES ARE UNBEATABLE. for reals. frickin like... 3-4 bucks for their kickass black bean sparerib rice.. the BEST i've had period... 1-3 for normal dim sum plate... spend like 30 bucks for a family of five... and we always leave happy and full.\nall their dim sum is HELLA good, i recommend all of them... to DIE for. holy crap.\n\nhoweverrrr. this place is hella janky and dirty and old and disorganized. and service is sort of rude. they might even seat you with some other people in the same table. can you say AWKWARDDD?\nbut .... overall, still 4 stars because the food is that damn good.\nGO THERE. you do not come here for service or atmosphere... you come here for the FOOOOD!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "Love it!  My go-to place for dim sum in SF!  Small, strictly old school, but fine and cheap!  Taro pork balls : my favorite.  Har gow -usually good, although today mine were a little cold. Lots of older folks  enjoying their tea and a little something.  Been going here for 30 years in its various incarnations.  Still good. Not a dim sum palace and service is brusque, but get over it.  The food is worth it.", "author": "Manya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-16", "description": "I LOVE dim sum...\nI LOVE cheap dim sum even more!!!  \n\nGranted there isn't much to choose from, but the stuff they do have are sooooooooo good...shark fin dim sum and black bean spare ribs over rice...phoenix claws, shrimp & chive dim sum...leaves me & the man feeling stuffed with few leftover pieces for snack later.  The grand total...$12.00.  Yeah, I feel like there is a mistake in the calculation, but when in Chinatown.\n\nPick up a giant sesame ball on your way out.  Try not to shove the whole thing into your mouth.", "author": "Je C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-07", "description": "Dont be fooled by the decor and the mean looking workers!\n\nThis place has the best black bean spare rib over rice in San Francisco! Hands down. Its only $2.50 and its a good ratio of sauce to meat to rice (to grease)unlike some other places on stockton. It comes in a smaller take out box but it left me really full. Oh and ask for the hot sauce! Its more sweet than burn your tongue off spicy. \n\nIts a sit down dim sum place where they wheel the food in the carts. The food comes out really slow since theres not that many people working there so I usually order mine to go. FYI they have an english to go menu thats taped to the glass counter so you can just point if they have difficulty understanding you.", "author": "Stacy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-22", "description": "I walk past Dol Ho on a daily basis- once in the morning, and once at night. I think we all have those mornings where you just can't seem to pull yourself out of bed and don't have time to make yourself a good breakfast. I often have those days, so I've stopped at Dol Ho a few times to pick myself up some cha siu bao (bbq pork buns) for my trek to work. Meh- it's ok. The bun part is a bit too crumbly and the meat could be more substantial. I wouldn't come here otherwise since there are better bakeries just around the corner. But on those late mornings, it will suffice.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-11", "description": "The spare ribs over rice are delish!  Definitely worth coming back here.", "author": "Robyn F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "[ Food: 3.5/5 ]    [ Ambiance: 3.5/5 ]    [ Services: 3/5 ]\nPrices $$ (avg $12/person) \n\nDown rigth home cooked style dimsum, nothing special, just simple. The chicken rice is the most popular and I belief is their signature dish, it was good and comparable to the way my mom's made with less ginger.\n\nThe dim sum portions are huge and being me, I ordered too much for the both of us. So we ended giving some away to couple old ladies... The siu-mai was a little blend and the stuffed eggplant was huge and only lightly seasoned. This is the typical Hong Kong style dim-sum where they keep everything lightly seasoned... so I used a lot of the chili & soy sauce dipping.\n\nThere's so many choices and it all depend on if you want to have your dim-sum sitting down or to-go. I was recommended to check out this place by a fellow foodie who swear by it but am sorely dissapointed. Houston's Kim Son @ Fountains is way better!", "author": "Peter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "This place might be kinda sketchy...but it's fantastic! Don't even let the appearance fool you! The worker ladies are kinda mean...but they're Chinese, so you just get used to it. You'll regret not eating at this place! The little bowls of rice with black bean spareribs are SUPERB! I have never liked these little rice bowls so much in my entire life! AND THEY'RE LIKE SUPER CHEAP. $2.50 A BOWL?! SAY WHAT?! This is all I need at this place. I'm happy. I'm definitely coming back when I visit San Fran again!", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Was introduced to Dol Ho by a friend who's been going there for 15 years, maybe longer. I've been there 2 times and I can honestly say I haven't had anything there I didn't either really like or love.\nNothing fancy by way of decor, but is full of Chinatown locals, which says a lot.\nYesterday we stuffed ourselves for around $10 each.\nThere is a little tea shop across the street you can sample teas at too.", "author": "Tammy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-25", "description": "Skkketchy. I'd go for NY dim sum any day over this place.\n\n   First of all, the whole cafeteria-looking restaurant fell silent when three of us walked in. Yes, we know we're Caucasian. Thank you for confirming that. Yes, we do know that in order to be Caucasian we are thereby not Asian. Thanks, again, for making us uncomfortable about that. \n\n   The food was much more greasy than I've ever had with dim sum dishes.... and the lady serving us was so impatient that she'd just wheel her cart away if we didn't jump at the first option or two. \n\n    The only reason I liked this place was the little 80-something year old woman we shared a table with, who spoke no English and nearly toppled over with amusement at the fact that we sat with her. We carried on a nobody-speaks-each others' language/ signing conversation for the duration of the meal, and by the time we left I received a hug and a few kisses blown my way from my new Chinese grandmother.", "author": "Mo S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "Rumor has it there is a restaurant where the servers are mean to you. I hate to break to news to you all but unless you are an elderly Asian SF local, the servers will be rude to you. It's part of its charm. Honestly, why would you come here then because the dim sum is AMAZING and the price is so cheap. You will have leftovers unless you have a bottomless pit or am a teenage boy. It is the place to go for out of this world dim sum. Don't expect any fancy schmancy twists, its the classics but done right.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-27", "description": "I've been here many times and the prices have gone WAY up since the first time I've been here. The portions have shrunk and quality dropped. I would have given this place 4 stars a couple years back. \n\nIf you are non-Chinese, Non-asian, \"touristy\" looking, you'll get the best service, the deep fried foods will start rolling out one after another. It's cheap, but there are other places that offer more bang for the buck in Chinatown. Not sure why people still come here, even the homemade hot sauce they make don't taste as good as they used to.", "author": "Felix L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-10", "description": "Delicious pork buns! Come for the food, not the service or atmosphere. Little English is spoken here. They seem to prefer you ordering the dim sum you want rather then bringing out items to choose from. I prefer dim sum restaurants with more frequent cart visits and more variety.", "author": "Chad S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-28", "description": "Good experience. Totally no frills. A Minimum Viable Chinese Restaurant (MVCR) definitely. Great dim sum, though some like the shrimp balls were too greasy. The spare ribs on rice were not great but the sauce and the rice were good. Foil wrapped chicken was perfect and the green tea very good.", "author": "Mikko J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "Dol Ho would be better spelled phonetically as \"Daw Ho\" in Canto.\nIt literally means \"a lot good\" For those of you in Rio Linda, \" it's all good\".\nThe setting is real old and tired. I wouldn't call it charming or nostalgic.\nTheir food is definitely genuine old school and legit. Cheap, but not rock bottom.\nIt must be pretty close to the bottom because a lot of limited income locals eat here.\nI think a lot of the customer base is simply loyalty and unwillingness to change.\n\"Been coming here for decades and it's my hangout.\" My family had to wait 20-30 minutes for a table to open up. Once we got it, we settled in and vegged. The place is tourist-friendly. They speak enough English to make the experience passable.  So how's their food? It's slightly above average. It's how they would make em in the village. Don't forget your newspaper. Half the patrons remembered theirs. When the food cart rolls up to your table, grunt alittle and make a hand gesture like you're saying,\"Yeah, gimme some of that\". We had around 10 dishes. 3 were $3/pop and the rest $2.20. The bill. $35. Hey? wait a minute. the bill shoulda been closer to $25? Did I get ripped off? I don't think so. i think my wife told me the wrong number of dishes. I doubt that they charged us for tea. My wife is real good about checking the bill as all asian wives do. I would of be happier with a $20 tab but we ain't in LA. Yes...there are even cheaper dim sum places in LA if you know where to look. Will I come here again? $35 can buy you a lot of food action in Chinatown. I'm gonna roll my dice on another table.", "author": "Winston W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-19", "description": "Aww mannnn I was hoping for more chives and stuff for my veggie dumplings. If you like a lot of shrimp in your chive dumplings and what not this place is for you.\n\nI use to come here when I was in Chinese school so I thought it'd be awesome but those were in my eat-an-x-amount-of -meat-cause-im-not-going-to-die-if-I-do days.\n\nI prefer You's dim sum in broadway for my veggie dumpling needs but it's kind of greasy.", "author": "Margaret S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-01", "description": "I'm still in disbelief that 5 dishes only came to $12. \n\nI didn't love everything, but it's great hangover food, i must say. Like most authentic dim sum places, there weren't many vegetable dishes (.. actually, none-- the closest was the vegetable dumplings).\n\nIt's definitely a great cultural experience. I wish I could order in Chinese like everyone else here.\n\nThe very simple decor didn't bother me-- i had read some reviews that said it was dirty, but it wasn't dirty at all. Just a simple little room.", "author": "Saori E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-14", "description": "Great local Dim Sum. Cheap prices and good food. Talked to a local Chinese woman and her tip was if you look into a dim sum place and see a few old guys at a table and each one has their own teapot they are all on their own. And if your an elder single Chinese man you don't waste your time at a so so dim sum place! Great useful tip one that I never would have thought of myself.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-22", "description": "This place may be the closest that I ever get to the real Kowloon...\n\nPopular with elderly locals, the food here is pretty tasty, even if the decor is lacking...\n\nI made the server smile when I asked for a fork.  That may be the only time she's smiled all month...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-07", "description": "This is my favorite spot in the city, but it is not for the faint of heart, and they have many things that are excellent and many things that are mediocre. To be clear: this is \"old Chinese man dim sum\" as my wife calls it. It is the sort of place that you can imagine the old men sitting around reading their papers would be smoking if it were 15 years ago. \n\nDon't expect good service or clean tables - that's not why you're here. If you want white tablecloth, go to Yank Sing, though you WILL spend 5-6 times as much as at Dol Ho. 3 people can eat very well here for less than $20\n\nIt is VERY popular for lunch. You basically need to seat yourself next to anyone who has a spare seat at the table. The locals/regulars will actually go into the kitchen for their own tea. There are two teas: black and jasmine. The waitstaff (don't speak English, of course) will generally give you jasmine unless you know enough Cantonese...\n\nThey do have a \"menu\" but I suspect it's actually from a different dim sum joint, as I don't think they have half the stuff on it, and the best stuff they have is not on it.\n\nWhat to order: pork spare-ribs over rice (all the locals eat this), or beef or chicken if you don't want to deal with the bones.  It's the only place I know of in the city to get dried shrimp rice crepe (Xia Mi Chow Fun), though this is not on the menu and difficult to get if you're not a regular or don't speak cantonese. The steamed beef balls are awesome - light and fluffy. The shrimp dumplings and the shrimp & veg dumplings are great - nice thin wrappers. The fried taro cakes are good IF hot, but in general the fried foods are to be avoided if they're not right out of the fryer (they tend to push them around all day...)\n\nFinish up with their steamed custard buns. If you want custard cups or baked goods, you're out of luck. Go right around the corner to Wah Li bakery for their custard cups.\n\nThey close for one month of the year to go to China. It's so popular that they are absolutely packed the day they get back!", "author": "Aaron N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-21", "description": "Filthy....dirty tables. Tables were outdated and need to be replaced. Not a pleasant eating environment. Nobody handling the take-out orders. Needs to be on Kitchen Nightmare.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "Great prices and good food.\n\nCleanliness is another matter.  To be honest, I wouldn't bring your \"American\" friends to Dol Ho.  This is more of a local's joint where they don't care if the waitress wear slippers while they serve food or if there is a thick coat of grease on the walls or there is dust accumulating on the fans mounted on the walls because there is no ventilation.\n\nI would have to say that I like the food here.  They are known for the black bean spear ribs over rice.  You'll see a lot of old timers here enjoying this dish everyday!  \n\nIn summary....come here if you have a strong stomach and if you want a \"true\" village dim sum experience.\n\nPlease keep in mind the English Language is limited here.", "author": "Henry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "I really like this place.  I love dim sum and i'm not afraid of holes in the wall places not even the ones in China Town.  \n\nThe place is small with lots of elderly chiness people who have no problem going to the kitchen to get their own tea.  It's greasy, somewhat dirty (you always have to wipe down your utencils and your table) but the dim sum is good, fresh and very, very cheap.  It's an experience!", "author": "chloe b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "Closed on Wednesdays.  Cash only.  Just order the pork spare ribs and rice - to go!  I heard you can get the spare ribs raw to cook yourself at home but why bother?  Spare ribs and rice is $3 an order.", "author": "Sandy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-26", "description": "Amazing value.  Great food.  I've been to china/southeast asia a few times, and this definitely compares to what they've got over there", "author": "Charles C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-06", "description": "Many of the reviews touch on the clientele, the staff's inability to speak English, the decor, and the prices. These reviews are very accurate.  Before I go into my experience with Dol Ho, let me date myself a bit.\n\nWhen I was a kid, this was the location of Tung Fong. TF was a part of the weekend Chinatown dim sum circuit that included Hong Kong Tea House across the street on Pacific (now another restaurant) and Canton Restaurant on Stockton (now a grocery store, RIP).  Tung Fong had the most amazing foil wrapped chicken, and it was my absolute favorite dish. The closest current reproduction I could find to TF's foil wrapped chicken is the overpriced one offered at Yank Sing.  That is, until today.\n\nDol Ho is definitely not the same restaurant, and no trace of Tung Fong exists other than the take out dim sum counter to the left of the entrance. The interior is very basic, even canteen-like.\n\nSpare ribs with rice, foil wrapped chicken, steamed beef meatballs, and a pot of tea was $8.70, not including tip. The spare ribs with rice was good and the foil wrapped chicken took me back to my childhood.  I wouldn't order the beef again.", "author": "Eating Sleeping T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-11", "description": "One of my old favorites.  In fact, I afectionately refer to this place as \"Old People Dim Sum\" due to all the old Cantonese folks that frequent this joint.  And while I've moved on to better dim-sum pastures, I come back here every now and then for the atmosphere and simple tasty selections at decent prices. \n\nA word of caution.  Despite the large senior crowd, this place is only for the brave.  Meaning, you must be comfortable being stared at if you are not Chinese, and not much English is spoken.  Luckily staring does not bother me, and my child-like Mandarin gets me by.  This place is not for tourists and Caucasians, or anyone else expecting to be pampered.  Learn Chinese and the culture. Don't bring your expectations here.  Just enjoy the food.\n\nTheir limited selection means that they make a few things pretty good, including the ha gao, fried taro, and pai gu (pork ribs).  I also like to purchase their homemade chilli dipping sauce. \n\nThree and a half stars for this old-timers favorite.", "author": "Gregory C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "Now that Lychee Garden is out of the dim sum trade, Dol Ho is my new default dumpling destination. Seasons change. Big, big thumbs up to their perfect har gow, sui mai and nicely done turnip cake. Shrimp with mixed veggie dumplings are great too. Not a huge fan of their spare ribs unfortunately...just a bit too fatty for my comfort zone. \n\nNo sight of their char sui bao when I was last there so can't compare unfortunately. It's busy, bustling and no frills for sure. I had to ask 3 times for hot mustard, but hey, that's part of the authentic charm.  It's cheap, it's tasty and I'm happy to have it near by. Great for takeout too. I'm gung ho for Dol Ho.", "author": "wendella a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "I grew up in Chinatown and I barely come to to this place. But when I did, I wish I came here more often. This hole in the wall may seem like nothing on the outside but once you get inside you will see a lot of locals enjoying their dim sum and newspaper.\n\nWith my dad I only spent $12 for about 4 plates of food that made me full. It has no menu so you have to just know what to get. the bad thing is you have to know some type of Chinese. With that said this place has amazing dim sum and food. It maybe old and outdated decor but it is not what I'm there for anyways.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-10", "description": "this barebones eatery on pacific off stockton is full. the take out counter contains the only menu  for the takeout. usually, a lady customer is leaning on the counter and her hand is right over the menu and it's prices.\n\nmenu: most dim sum 2.00-2.50\nentree:shrimp crepe(2.50) siu mai (4/2.00) char siu bao(3/2,00)\n\nshrimp crepe-small bland crunchy shrimp in a semisoft rice noodle skin. not that  great  but acceptable\n\nsiu mai-big pieces with a lot of meat and not much flavor.\n\nchar siu bao- fluffy delicate exterior with dried up char siu filling inside. pork filling unacceptable. \n\npros\ncheap, good value for some items\nfast service\n\ncons\n-a bitchy saleslady who doesn't listen carefully to orders, even in cantonese, and who scolded a customer for asking about the availability of an item twice. same saleslady doesn't know know to add (i.e. 2 + 2  + 2.50=6.10) i  didn't want to correct her or she would scream at me also.\n-msg use is evident.\n-parking, you know how it is in frisco!", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "This is a review based on one dish alone: spareribs on rice.  Dol ho serves this up to the old school Chinese in the neighborhood seemingly by the ton.  I didn't see a single table that did not order this and smartly so.  Their spare ribs are tender and the rice is perfectly cooked.  Add in the soy sauce and the ever perfect tin can container and you have an instant classic.  \n\nYou are hungry.  You are poor.  Go eat here.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "CHEAP. not particularly great dim sum (although i did love the black bean sparerib rice and some other dish with pork or beef over rice that comes in a metal bowl), but CHEAP. like, eat your fill and pay $7 per person cheap. it's a small place so you may have to wait, and yes, they do seat you with other people if they need to make room, but it's worth it for cheap dim sum! they also have a take out counter if you're so inclined.", "author": "Clara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-14", "description": "Terrific place for a cheap bite in Chinatown. Somewhat decent dimsum, and the spare ribs rice bowl is seriously the best frickin' deal in town.", "author": "Guillermo K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-08", "description": "Once, as recently as seven years ago, this was my favorite place for dim sum.  Now, 2011, the prices are still as low as you can expect ($3.60 for 8 pieces of shrimp dumplings & pork shumai), but the quality is no longer there.  I did go back a second time just to make sure it wasn't an isolated, bad day.  Would love to hear in the future that things have improved; the loyal locals are still there which was always a big plus.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-06", "description": "My grandparents have been taking me to this place since I was a wee little boy. The waitresses still remember me after returning from college. My 4 star review is pretty much for their spear ribs and black bean sauce over rice. I say it's the best in the city. If anyone else knows a better place, feel free to message me about it. What makes it even better is that it's only $2.50! \nI find the rest of their menu only mediocre. I agree with everyone else that the place isn't the cleanest, but when I was younger, it use to be even dirtier. I still didn't mind.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-22", "description": "If you don't like massive-scale dim sum places like Koi Palace, and just want the basics, this is the place.  It's delicious!  And tastes just like my grandmother's cooking.  Interestingly, I found it in \"The Slow Food Guide to San Francisco\" ... just in case you care about slow food practices  :)  By the way, nothing in this book has failed so far...\n\nBUT...\nif you like dim sum places for the fun of seeing tons of steaming and delicious, or weird-looking, or unimaginably deep-fried, or smelly, or unpronouncable dishes (... or, while i'm at it, chicken feet...) whirl around, this might not be the place, as the variety is not as huge and they don't come out as fast.\n\nBUT... \none time my friend didn't know the name of the thing she wanted, and it wasn't too busy, so the lady in the picture up there (she is awesome) asked my friend to describe it and got it made to order for us!\n\nBUT... \ndon't use the bathroom.  It is sometimes said in New York and London that the quality of the bathroom is correlated with the quality of the restaurant.  I think for Chinese and a few other types of restaurants there may be an inverse relationship.  Hasn't been cleaned in a month + no soap = great food.  \n\nBUT... \non two separate occasions the bill came to $12 for three people!  I'm frugal.  Five stars!", "author": "Jen X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-09", "description": "I came here with 2 friends, and we ordered a couple of basic dim sum to try. The waiter/owner spoke very little English and was a little rude, so it was hard to communicate with her, but overall, we had a great meal. Just don't take the rudeness personally because it seems like their Chinese customers don't mind/care. The price was pretty cheap. If you're on a tight budget, the spareribs would probably fill you up and it's only $3.", "author": "Pete B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "You certainly can't beat the price or the authenticity factor at Dol Ho. $24 for a stuffed to the rim party of 6- check; no other white people besides our group- check; giant carts of steaming hot fresh dim sum- check.\n\nThe atmosphere is not great, but then again it  certainly isn't trying to be. I thought the variety was a bit lacking- especially in the category of buns which was non existent. But what I did eat was fresh, delicious and really on the mark. The service is what you would expect in a joint like this- hurried, non-english speaking and a bit on the rude side.  If you're in the area come to Dol Ho for a quick bite of tasty dirt cheap dim sum- but don't expect to linger.", "author": "Jess M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-28", "description": "I'm always concerned when we go to a Chinese restaurant and none of the patrons are Asian.  Not a problem at Dol Ho,.in fact, it was quite the reverse which I took as a sign that we had made the right choice.  And what a dim sum feast! Immediately the waitress brought over su mai, hargow and sharkfins.  We followed up with tasty eggplant stuffed with shrimp, egg rolls, and a few other varieties of dumplings.  Given all the food, I expected the bill for 3 to come to $30 of so, but we were all shocked when the total was $14.20 for 3.  \n\nThis is definitely a no-frills hidden gem.  But would you have a dim sum restaurant be any other way?  They also do a swift take-out business and you can buy frozen dumplings, wrapped rice and other treats.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-19", "description": "I have been eating here with my mom and dad since I was 11 years old... again I am 28 now... Dol Ho has a special place in my heart... We would park about 3 blocks away, and en route to the restaurant I always had the opportunity to take in the whole Chinatown culture with busy crowds, people who never followed the street signs and continually crossed the streets even with moving traffic, butcher shops with frogs and turtles and boxes for sale, trucks wide open with dead whole pigs ready for delivery, and of course that Chinatown \"scent\"...\n\nEating here was always an experience... although it is a hole in the wall where your neighbor is close enough to breathe or cough on your food, the Dim sum is amazing and authentic... A lady in the street once told me that you eat where everyone else eats, or else \"they no good\"... and she was right, Dol Ho is crowded from opening to closing, but we never really had to wait for seating.\n\nIt was usually me, mom, and dad eating there and we'd order a lot of food and only pay around $16.00 and have enough to take home for brother to eat since he didn't wake up for breakfast with us.\n\nChicken feat, Spareribs over rice, Shrimp Balls, Tripe, Beef Balls, Shu mai, hargow... YUM!", "author": "Chrysantha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-14", "description": "OK, we got the name of this place out of a guidebook that said it was cheap if perhaps of questionable cleanliness. And I have to admit, when we walked in, we were the only white people in the place, it was noisy and chaotic, tables hadn't been wiped down, no one offered to serve us, there was nowhere to sit.. and we stood there looking dazed and confused and anxious for a minute or two.\n\nBut then this very happy (ok, drunk)  man started waving to us with  a big smile on his face and gesturing wildly to the spots next to him at his table. So we sat down, still nervous, and he began telling us, in limited but enthusiastic English that we had to try the shrimp balls. \"it's very good, this place, it's very good, you like!\" he said. \n\nSo we started ordering, tentatively, including the spiky fried shrimp balls he recommended. We had some kind of fish concoction on bell peppers, some pork thing.. and truthfully I have no idea what else we were eating, no one could tell us. Btu it was all quite tasty, if greasy, and we filled up fast.\n\nNow, we had been told it was cheap, but nevertheless I could see my dining companion starting to eye the pile of plates uneasily and mentally tally up the bill. So we stopped eating and he went up front to pay-- and came back with an enormous relieved grin on his face.\n\nOur meal of something like five different dishes.. Came to a grand total of $7.80.\n\nHe was so pleased he bought us some extra mango custard pies for dessert. Talk about a cheap date! So just remember-- seat yourself, don't bother asking what you're eating and go ahead and order that extra dish: you can afford it!\n\nOne last note: Not a place for vegetarians, I think the bell pepper under the fish was the only vegetable I saw while I was there.", "author": "Sara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-08", "description": "I think we ordered the wrong things. The dining room was packed, so we just ordered a few of the items in the front case. That was probably where we went wrong. \n\nThe pork dumplings were okay, but hard. The deep fried bun with chicken had a fantastic flavor, but after one the consistency of the bun (really doughy, almost undercooked) got to be too much. The doughy pancake stuffed with some kind of bean was far too sweet and way too doughy for me. \n\n$4 for 10 pieces of dim sum is great. I just wish I would have liked it more. \n\n- - -\nWe ended up wandering down the street and trying dim sum from another place (don't know the name cause there was no sign in English) that we liked much better. There we got a chicken bao and barbeque pork bao for $2 that were awesome and exactly what we were looking for.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "Best dim sum I've ever had.\n\nThey don't really speak english much.\n\nQuite cheap.\n\nPretty disorganized.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-31", "description": "Cheap, good food.  Be open minded.  Try the turnip cakes and the spare ribs on rice.  Try the chickens feet, even!  \r\n\r\nEvery time I've been there the staff (and other customers) have been helpful in ordering.  Even if the servers don't seem that helpful, they will show you what they've got before you take it.  Just ask, but then if you don't want it shake your head firmly and say no.  Don't smile politely and nod, saying \"looks good but no thanks!\" Too complicated for their level of English, and they'll think you are ordering what ever it is you're being polite about.  Not a good place for vegetarians or non-pork/shellfish eaters.\r\n\r\nThe kitchen seems clean to me, and I've not seen the egregious sanitary errors here that I've seen at CERTAIN VIETNAMESE PLACES PEOPLE ON YELP SEEM TO LOVE!!  IF you get my drift.... :)\r\n\r\nEating at Dol Ho is a rich experience.  I'm usually the only white person there.  Occasionally a daring, but confused looking tourist will wander in, but otherwise it's all oldsters enjoying the dim sum they are used to.  That's a good thing.", "author": "Bruce S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-10", "description": "Best dim sum in the city.  The ladies working the cart there are very friendly.  Be sure to tip them and they will remember you.  And feel free to get your own teapot from the kitchen.  That's how you roll there.\n\nRidiculously cheap and good.  How can 4 people gorge themselves on $10?!?\n\nThis place ain't for clean freaks.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-25", "description": "I thought that this place was pretty good, but my girlfriend (who knows dim sum much better than me) wasn't all that impressed. Their selection is limited, but it's a fairly small place.\n\nIt's definitely a dive. Not very clean and very cramped. They do serve the dim sum from carts despite the cramped space. Don't count on getting your own table. The six of us sat at a table with 2 other diners.\n\nYou can't complain about the price. 4 adults and 2 kids ate for under $20.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-27", "description": "Ah, my peoples.\n\nNow THIS place is how I envision Chinatown dim sum eating to be.  \n\nThe waiters are rude.  Well, it was one lady and she was turning 15 tables like tricks at the Sundowner in Reno.  Sure, she was missing teeth and frankly, she gave us no more attention than your average cat.  \n\nBut dagnabit, the food was good.  Sure, it's not your high class Puff Daddy dine on 5th Ave type place, but hey, there were chairs.  There were chairs.  The tables were sticky, but not uncommon for this side of town.  The cups and plates were clean, at least by the looks of it.  But we had a cracked teapot, which I thought was funny.  It was AARP up in there - I think the average age was 89.  And that's including us youngsters pulling the average down.\n\nBut wow, they got this one thing on lock.  The steel bowl black black bean short ribs over rice.  It looks a little intimidating - something out of a Terminator movie, but man, one bite and you're in salty swine heaven.  The long noodle with sweet soy sauce and meatballs was very good.  The chicken bun was ok.  The chicken wrapped in foil was like bbq chicken.  The shrimp ball squeezed into the eggplant was ok, but the eggplant was a bit undercooked.  They had the chives dumping in the translucent casing, but it was cold.  Get this, they nuke it.  HHAHAH.   The Chinese matzo ball thing was pretty delicious.  It was the size of a tennis ball.  Three of them.   There were a lot more things they were slanging but I can't remember.  \n\nI think I feel the MSG kickin in.  Wow. Thirsty.  Tired.  But very very satisfied.  It's really a place to get your fill on some Chinese tapas.  It's not a place to host anything, but grab your 3 best eating buddies and go to town.\n\nOh, and it's SUPER cheap.", "author": "Isaac L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-18", "description": "This is the type of place where, if you aren't Asian, the record stops, and people stare.\n\nBut once you get over that intial few seconds, grab any available seat and wait for the dim sum to start rolling by. Not to worry though--the cart ladies were friendly and patient as they explained and waited for us to choose our dimsum. Same rules of dimsum apply, however: do not order your entire meal from the first cart that rolls by. Look around at what everyone is eating, and wait patiently for that to come around.\n\nThe beef balls (or were they pork) and the spareribs were popular here (and tasty). We also had all the dumplings (pretty good), as well as tried chicken feet for the first time (surprisingly decent). For the amount of food we ate (which is a lot), we ended up paying maybe $30? Maybe it was $25 with tip.\n\nThere are a ton of dim sum places on this street--a lot are larger and fancier, but this one definitely has spunk. Flourescent lights, metal chairs, and an all Asian crowd means the food must be good.", "author": "Sabine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-06", "description": "I first fell in love with the chandeliers at Dol Ho. Honestly, what other place in the city has chandeliers like these? No one. \n\nThat would have been enough. But then, over the course of the last five years and consistent returns, I've slowly and surely become obsessed with the waitress. \n\nIt's all true. If you want something, you're going to need to get it, and, yes, the best way to get tea is yourself, but once you're in, you're in. This is one of the few places in any city I can walk in to and have a smile returned. \n\nAnd that's not to mention the food--foil wrapped chicken is probably my favorite here, closely followed by the rice noodle with cilantro and dried shrimp and, well, really everything is pretty amazing.", "author": "C-Lo J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-22", "description": "Man, I love this place and literally grew up on the food.  I still remember going to chinese school (yes, that exists) on powell and running my ass over here after school or sneaking out during my measly breaktime (whichever came first) to buy my noontime snack.  This place has been here for EVER, at least since I can remember it far back as when I was a wee lass!  You won't find any english speaking dimsum ladies or cashiers here; expect tons of old cranky chinese men with serious loogies and strange hats in the winter, but FEEL the chineseyness ooze out of the cracks of the wall, tiny and always packed, but where else can you get full as hell for 5 bucks?  \n\nYah, don't expect a whole lot of \"service\" here because mostly everyone who comes here knows the drill. You flag a server down or grab them lightly by the ear (kidding :D) and say, I want (insert food name here).  Most likely they'll just grunt and point at an empty table or take your order.  I love it!\n\nMan, I miss this place so much...", "author": "Linda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-20", "description": "Dirty, noisy, loud and bad service.  Yup!  It's Chinatown!  However, great trad'l dim sum, wonderful on Sundays.  Try to \"go to the bathroom\" before you get there, and don't use theirs.  \n\nGood to go items and cheap, cheap, cheap!", "author": "A W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-18", "description": "I would say that my dim sum experience here today was average.\n\nThey were very accommodating, even moving people to seat our larger party (though I would most likely be upset if I were on the other end of that deal). \n\nI had a relatively authentic experience - we were the only white people in the restaurant and the waiters spoke close to no English.\n\nThe food was pretty good, particularly the dumplings and rice noodles, but I would say that didn't have a huge variety (no pork buns makes me sad). \n\nBe prepared to point and have hindered ability to make special requests unless you know the authentic names for things. \n\nFor 6 of us it was $24 which makes it an amazing low cost option.", "author": "Alicia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "This is really a hole in the wall dim sum place.  But it is a very good dim sum place.   Very inexpensive.  Their black bean sparerib rice is very popular too. \n\nI usually come here and get dim sum to go and eat at home.  They don't have a lot of tables and service can be slow if you eat in.  I see people who must be old timers that get their own tea and clean their own tables.  However, trust me when I say their inexpensive dim sum and very good dim sum makes up for it all.", "author": "Stella C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-10", "description": "It's true, this place is cheap... but regardless of pricing, I will never come here for dimsum again.  My friend raves about it and even brings first timers to dimsum here... but I hate that he does that.  It's not good dimsum, and can leave bad first impressions on people.  The food was fresh, but it doesn't taste the same... I had their siu mai there, and it was nothing but beef.  WHere's the shrimp in it?  It was also very greasy.  True, you can order a crap load of food for $6 between 12 people...  but you're just filling yourself up with crap... Some of their stuff is decent... but you can definitely find better dimsum even at the To-Go places.\n\nI refuse to come here, no matter who's going.", "author": "Diane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-09", "description": "Staff was very friendly, and my sister and I had more than enough food for $12. \n\nThere was one time when there was a potsticker type dish that we asked our waitress what it was - her reply was along the lines of \"I don't know how to say it in English.\" So if you're picky, this might not be the place for you. But I enjoyed it.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-08", "description": "It's the real deal, and my regular Saturday lunch spot.  It's a tiny hole in the wall, kind of shabby, this place seems geared toward locals who are just there to EAT and eat well.\n\nThe food is so cheap it's crazy.  And the food is delicious.  I find the service to be perfectly fine. My tea is hot, the food comes out regularly, I'm happy.  \n\nThe staff is pretty good about explaining what is what, to the best of their abilities.  This is my favorite cheap eats place in the city.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-26", "description": "Scott - Well it was between this place and the New Asia for Dim Sum.  I didnt check what new asia got for reviews on yelp yet, but i took a look at the carts going around and it looked like a bad dim sum restaurant over in the OC called Kim Su.\n\nThe seating was pretty ridiculous.. we were waiting to get seated but no one came, so we decided to talk to the person and we were seated with a complete stranger who was reading a newspaper.  There seemed to be one of these guys at every table in the restaurant.  \n\nThere were no carts around for about 5 minutes or so then one rolled out with all the dumpling stuffs.  The shui mai was pretty good and the ha cao was really good (Both the shrimp and the vegetable one).  Patty didnt enjoy the chicken feet that much.\n\nAfter we finished all the dumplings, we waited another 10 minutes or so till the next cart rolled out, this time with all the fried stuffs.  The sesame ball with yellow bean was really good.. it had a nice thickness to it and the bean curd inside wasn't overly sweet and was very smooth.  We also got the fried shrimp ball and the egg rolls.  The egg rolls smelt weird... not something you would normally smell with regular egg rolls.  They tasted alright though.  The shrimp ball was good.  I liked how they made it look kind of like a fireball.  After we finished those dishes, we asked the waiter for the shrimp in rice noodle rolls (I dont know what its called in canto, just viet haha).  The noodles were thick and killed the texture of the dish itself.  We were pretty satisfied in terms of how full we were, but i really wanted a cha shiu bao, but i didnt want to wait for one.\n\nWe spent $30 for the whole meal, which isnt bad for 5 people (3 being heavy eaters including me and patty).  It seemed like there were 4 dim sum places at every block in chinatown haha, so i probably wont come back here again.  At least we were joking around with the old guy reading the newspaper.", "author": "Patty L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-24", "description": "Decent. As a visitor to SF where everyone raves about the dim sum, I was expecting more. But, this place does have the old hong kong feel as far as being somewhat dingy, not so well lit, and the perfect place to grab a seat, have a few tins of dumplings, and read the morning paper. These aren't dainty dimsum bites as many of the dumplings are pretty hefty and it's tough to come and eat as a party of 1 or 2 and get to try everything you want (because you'll be full). Most of the filling used in various dishes was very meaty which, just as the hefty portions, can be both a good and a bad thing with dimsum. At the end of the day, I've had better and nothing was particularly memorable.", "author": "Manesh P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "When people ask me for the quintessential \"hole in the wall\" place for dim sum, this is it.\n\nThe middle-aged women serving you still push around the dim sum in carts.  However, the space is really small (and not the cleanest place), so if there's a large crowd, you may have to wait.  But the wait is well worth it.\n\nIt is WAY cheaper than Gold Mountain or New Asia and the food is definitely fresh, made right out from the kitchen.  The ambiance (or lack thereof) definitely plays a big part in making you appreciate the food.  The service isn't that great, but it's authentic Chinatown dim sum; none of that touristy stuff should be found here so ignore the glass cases at the register and sit your butt down for lunch.\n\nDol Ho is the spot that the locals know, visit, and most importantly, EAT at, but recently, more touristy folks have been coming to try the \"pai gwut fan\" and the dim sum, so get there a little earlier if you want seats!", "author": "Connie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-28", "description": "GREAT Dim Sum ! so far the best Dim sum I have had to date in this city. Love their shrimp dumplings and pork dumplings. Their Steamed BBQ buns are great as well if you get them fresh. Do not expect stellar service..walking in here is like walking into old school Hong Kong. everyone in there was over 50 and Chinese but thats how you now its traditional and good! :)", "author": "Mike P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-02", "description": "Dol Ho is a delightful little hole-in-the-wall dim sum place serving some of the best dumplings and buns I've ever eaten. While the staff doesn't speak a ton of English, they can cook up a storm though. Grab a glass of water, get some yummy buns and pig out on these amazing and cheap dim sum plates.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-17", "description": "This place is disgusting.   It needs negative stars.\n\nTheir offerings made my gf have a sad, betrayed face as she stared at the 8 inedible (purportedly) dim sum dishes in front of her.  \n\nI've always liked dim sum (though mostly in boston chinatown) and my gf grew up on it.  Neither of us have run across something like this before.\n\nAs one example: the initially normal sized chicken feet were inflated to godzilla proportions with rancid grease and then allowed to become tepid before being placed in front of us, where they lurked malevolently for the 4 minutes it took for us to summon up the breach of ettiquette to leave the resturant despite doing little besides push the food around and stare silently at each other (and getting stared at silently by the whole resturant while doing so).\n\nGoing here was a huge mistake.  We didn't trust yelp again for a long time after that.", "author": "D E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-14", "description": "Do not go here!!!  After reading the reviews, this place seemed worthwhile to grab some cheap dimsum.  It is cheap alright, but you get what you pay for.  We were seated next to the loudest guy ever, screaming in chinese to this other table about how to cook some type of chicken stew.  He literally gave me a migraine.  It was almost 90 degrees outside, but this place is so cheap that they didn't even turn on the stained and dusty revolving fans that they had on the walls.  We asked for ice water and they came back with tepid water straight from the faucet; they have no ice they said.  We had the usual dim sum affair: har gaw(terrible sticky thick wrapping), sui mai (awful chunks of fatty pork), bean curd roll (again fatty chunks of pork rolled in greasy tofu sheet, soaked in grease), chicken feet(just inedible), beef rice roll (gritty thick rice roll with unflavored beef).  We were trying to wait for the notable spare rib bowls, but after waiting 20 minutes for them to cook it, between with the deaf guy next to us screaming and the sweltering heat and atrocious food we already tried, we decided it was just not worth the wait.  We paid our $25 and went on our way; leaving Dol Ho was the best part of the experience.", "author": "Helene H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "Despite its difficult location - right in the heart of traffic-unfriendly Chinatown - this is a goto dim sum spot in the neighborhood.\n\n\n Why?\n\n\n It's good, but above all, it's CHEAP.\n\n\n If you're in a group of 5 or 6, you can stuff yourself with shrimp dumplings, shark fins, foil-wrapped chicken, shu mai, cha shu bao, or whatever else strikes your fancy for way less than a tenner each, including tea, tax and tip.\n\n\n In traditional style, everything is brought up and offered to you on carts - half the fun is trying something random you've never eaten before, the other half is trying to figure out exactly (or vaguely) what it was.\n\n\n For the less adventurous, you can simply ask for your staid favorites over and over again, but you have to admit, one of the reasons to go out for dim sum is for a bit of variety.\n\n\n Just remember to accept their offer to cut larger items up for your, unless you like getting squirted with hot oil on your first bite", "author": "Omid T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-26", "description": "Spareribs over steamed rice is a must try, so is their house-made chilly sauce, which is not very spicy but delicious!", "author": "Renee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-11", "description": "I give this small hole in the wall, dim-sum dive restaurant four stars because what you get for the price is very worth it. I find Dol Ho to be honest home-style dim sum. I've been going here for years and typically stand out as the lone gweilo... the mostly Asian clientele is a fascinating socioeconomic mix prime for people watching. The chili sauce on the table is \"home-made\" and excellent. The steamed rice noodles are very popular with one particular style on nearly every table contains chives and shrimp (wish i knew the name) these must be ordered from the waitress and are not n a menu. The pork-filled sticky rice packages wrapped in tea leaf can be found  in the steamer located at the front window are very tasty. Many regulars order the small rice bowls  topped with meat (Chicken, ribs or steamed meat balls). I've never eaten anything here I did not enjoy.", "author": "Deno M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-09", "description": "One of my favorite dim sum places.  Dul Ho is a little hole in the wall place, and the clientle is mostly Asian.  The staff don't speak much English, but if you aren't daunted by this, go for it and take your pick of delicious, cheap dim sum.  There are jars of some sort of oily garlic concoction at each table, and it is a must-try.", "author": "Asteridae A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-08", "description": "This is a solid 3 star place.\n\nThe often praised black bean spare ribs over rice that comes in a stainless steel bowl was \"OK\" but not praiseworthy. The portions were small (at least for me).\n\nThe dim sum was \"OK\" too.\n\nA locals place for sure and always crowded but unfortunately that did not mean great tasting food in my experience.", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-19", "description": "Don't get me wrong, the food is incredible, probably the best dim sum I've had in a while. But honestly if you don't speak cantonese, don't bother going. This restaurant exists to serve the old cantonese people in Chinatown, it is always packed and you can hardly get the waitress's attention. They will look at you funny even if you speak mandarin like they don't really welcome you there. The price is great, but I'm sure you can find another restaurant in Chinatown with better service.", "author": "Jack Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "This is one of my favorite dim sum places to go to in the city. Dim sum is pushed around in carts and served to you. The food is really good here, esp the spare rib rice, shrimp crepe, ha gao, etc. Most of their items are really cheap too, for a dim sum tea house place. The only con is that you may have to share your table with strangers, but for me, once i get my food, i dont even notice the others anymore. Trust me, the awkward table seating is worth oerlooking for the dim sum. Also,  dont be offended by the ladies serving you because that's just how they are. I've gotten used to it.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "delicious dim sum for take out! skip the decor and enjoy the food without the distractions.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-06", "description": "The food is always good.  The service is-well-I don't mind filling my teapot with water from the kitchen.  There is not as much variety as some Dim Sum places-but they are experts at the dishes they serve.  It is so cheap too, which makes it taste better!", "author": "Gillian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "This a good place for those who like to have good dim sum.  It's cheap and the portion is relatively big, the food is not bad, of course not great either.  The choices is not as much but mostly what you expected.  With this economy, cutting expenses is a way of life.  $12 for 2, what do you expect?  Expect to chase for the cart as they may not go from table by table, plus you may need to refill your own tea pot and not to mention sharing table.  This is not a place to be impressed or pampered but if you do, you should go Yank Sing but expect $50 for 2.", "author": "P. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-27", "description": "Went there on a packed Saturday morning and really had a blast. The Dim Sum is out of this world. The place looks a tad funky, a mixture of \"we don't have money for furniture\" and \"Red China says Hello\". Friends of mine titled it as a \"hole in the wall\", but the food is awesome. Go there, have tea eat the dumplings and enjoy!", "author": "Roger W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-08", "description": "There are times when authentic is not desirable.  Our visit to Del Ho yesterday is a case in point: the place is dirty, the service is nonexistent, and the patrons bark at one another and the staff alike.  The dim sum was decent, although the pork shui mai was sub-par.  It also cost $9 for two.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-29", "description": "A local favorite for dim sum, but if you're an English speaker don't bother asking questions about what food is what.  *Ridiculously* cheap!", "author": "Rego S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-11", "description": "A lot of old timers come to this place and eat their ribs & rice. It is pretty good here and it is only $2. The service is kind of bad. I do not get how the food system works, sometimes a lady would come out of the kitchen saying \"who wants thins rice roll?\" and someone would say \"bring it here\"  the food is pretty good here, but this place needs more tables because I hate sharing tables with people I do not kno!", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "Good dim sum. Don't speak much English there.  Be prepared to split a table with complete strangers.  Inexpensive.", "author": "jamie j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "Good and cheap.  Parents seem to love the 'pai gwut' w rice and that comes with some kinda soy sauce over it or they leave it on the side. A little too much rice i say and not enough 'pai gwut'!! Usually get the usual dim sum stuff and egg rolls whenever we come to buy stuff from here (the egg rolls taste different each time i get it now, dunno if it depends who's preparing it, they put have/add/subtract stuff inside it) It will fill you and your friends up easily.\nI've never eaten at the place, but every time i go buy stuff from here, its usually packed with people.\nThey messed up the order a few times already.  I order to go and because I order too much and they probably don't remember everything I told them.  But its cool i guess", "author": "Jason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "Ran across this hole in the wall place last week while visiting San Fran. Cheap, fresh and VERY tasty dim sums. At $2 a portion for steamy (albeit slightly greasy) dimsums who can complain Home-made black bean chili sauce on the table to DIE for. Bought a jar to take home to Nola - my friends are lapping it up. Wish I knew what was in it - I could try and make it at home. Does anyone know what is in it...or can send some heavies over to get the rough recipe?", "author": "Tracy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "Definitely an experience, and a different kind of place. I might have been less thrilled, but I appreciate new things and more authentic culture. A very simple place, shared tables depending on space, would probably get the best out of it if you knew Cantonese. Seems like an excellent local place for residents to drop by for a bite to eat and a newspaper read. Good tea. Limited array of food, but it'll have most of your standards. Very homemade feel, and pretty good although not the greatest (or just not as much to my taste). Because food circulates without great frequency, it's a nice place to take it slow and easy. I think we got about 8 dishes and tea for 20.", "author": "Lassie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-08", "description": "How was the food? Hm...I DON'T KNOW! Do you KNOW why I don't know? Because I went in there, with my coworkers, stood there for about 15 minutes, and nobody served us. We wanted to get dim sum to go, and they didn't even help us with our order. Plus, I don't like the fact that you can't see the food before you get it. We went to You's instead, with a big fire in the pit of my tummy. I hear this place has good food, but how would you know if you never even get served? Cheap, good food is one thing, but bad service is a big NO NO.", "author": "Pika C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-01", "description": "A little greasy, but generally good hand-made dim sum. Liked the har gows and deep-fried shrimp balls. Was surprised this place was listed in Lonely Planet, though, as there were no menus and the old ladies just did a show and tell when taking orders.", "author": "Ethan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-13", "description": "Super Cheap, really good. I don't know too much about dim sum, but I have eaten it in several SF locations and I'll bet this is one of the more authentic places around. I would avoid looking into the kitchen, but I have yet to get sick. They tend to push some of the more typical stuff at people who don't look like 'native eaters,' but that's par for the course. \n\nI highly recommend the shu mai (apologes for any misspellings); the steamed pork buns I had were good but we a bit too chewy. (There are better bakeries for that sort of stuff nearby.) But for cost and taste, this is a great weekend morning.", "author": "Vivek T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-11", "description": "The Worst Dim Sum, Ever!\nThe steamed items were bound the paper underneath and to the steamers. They had to have been sitting there overnight. The dough is thick and like paste. The flavor of all the steamed dumplings was flat. Any of the dim sum houses around surpass it. Even the frozen dim sum at Ranch 99 easily surpasses it in quality.\nFurther, the place is filthy.", "author": "Kent H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-08", "description": "Definite hole in the wall. No frills here.  But it's the cheapest  you can find almost anywhere in the city and decent when you need your Dim Sum fix.", "author": "Jason T."}
