{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "The Good:\n\nNice, modern interior\n\nPrime location\n\nHomey feel, I think the cashier is the daughter and the cook is the mom.\n\nThai iced tea\n\nRoasted Duck Banh Mi - Hella Good!\n\nRoasted Pork Noodle Bowl - Hella Good!\n\nThe Bad:\n\nYou will see some interesting characters passing by. ^_^", "author": "Nikki V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "\"...Because no great story ever began with a Salad...\" - Anonymous \n\nI just had my annual from my Doctor in the area..\n\n\"Eric R...\nBlood Pressure - perfect!\nHeart Rate - wow!\nYou must bike the Himalaya's or something...\nYou're like an Olympic Athlete!\"\n\n\"But...\nYou need to eat more fruits & vegetables. Less carbs in your diet might help reduce that rash...\"\n\nSigh. I admit I've been carbing on the heavy and probably eating too much sugars & salts (donuts, evil stuffs). Since diabetes runs in my family I'm aware to eat healthier to live a quality life. In fact, my bestie, Shelley H., encourages me to eat like a rabbit every chance I can, lol, kidding aside, she's my main guru filled with vegetarian & vegan knowledge, so she convinced me there's more to just rabbit foods in eating healthy! Sure enough...\n\nYup. Basically all ancient cultures eat healthy if going back to eating raw and organic. It's nothing new! The processed foods, heavy in salts & sugars is what destroys Americans, hence all the fast foods and bigger arses. And no, Mr. Trump, Taco Bell is not Mexican lol. Back to eating healthier... \n\nSo advice from my Guru and Doctor led me to the nearest Vietnamese spot. A cuisine known to eat fresh, with little empty calories. As I peruse I notice a bookmark from a year ago... DragonEats it is! Located on Haight it is a café style eatery with modern decor... as I walk in I notice how modern and clean it is, good chi, good flow, this place looks like a win! I am greeted immediately by a young lady w/ Ariana do, and even though the Bahn My Sandwiches looked good w/ good prices, I craved Rolls today. Three choices of Shrimp or Chicken Breasts or Tofu. I opt for the Chicken Breast. Three choices in sauces of Soy, Fish, or Peanut. I opt for the Peanut Sauce. Only $7 and change and complimentary lemon water. As I pay, I notice the older lady (her Mom?) already boxing my Rolls. So my wait time was zero lol. I dine in at the counter. \n\nI immediately notice how heavy these rolls are, and I mean a good heavy, meaning the rolls are packed with good stuff! First piece dipped in the Peanut Sauce... oh my! Heavenly! Two giant rolls cut into six big bite size pieces equals a healthy lunch! It was so fresh, and the Peanut Sauce took it up a notch. I'd order it again, and again. \n\nIn the end, I recommend DragonEats to all. It's a cute little café on the Haight with a straight forward Vietnamese menu of Bahn My (Sandwiches), Bowls, and Rolls. Next time I might add a homemade Lemonade. So maybe I didn't turn into a magical Dragon, but it was a nice healthy lunch for this Olympic Athlete who needs more Veges, and less processed foods to help reduce that rash... Oh my!", "author": "Eric R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "I liked how the rolls don't fall apart when being held using chopsticks. Vegetables and shrimp tasted fresh to me. This is probably just my own preference, but the bread rolls used for the banh mi were a little too hard.\n\nThe Vietnamese iced coffee was a little too sweet.", "author": "Albert Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "Came here for lunch on a Sunday. A nice clean spot with a nice simple menu. Very cheap prices but the portions are a little smaller. The Bahn Mi was ok, not too flavorful though. \n\nIf i came back i would try the bowls which looked very good and more filling.", "author": "Drew F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-19", "description": "Had the roasted duck banh my and roasted chicken bowl. It doesn't specify on the menu what the \"bowl\" is; it is actually a vermicelli bowl (as opposed to a soup bowl).\n\nI think it's important to first mention that this place is by no means authentically Vietnamese -- it is clear that it caters mostly to the taste buds of the local community, thereby lacking a lot of authentic Vietnamese flavors and roots. More accurately, the restaurant merely draws influences from Vietnamese cuisine but that is about it.\n\nRoasted chicken bowl: Chicken was dry and hard, and it lacked flavor. The bowl derived all of its flavor from the fish sauce. The vermicelli noodles were not fresh and they stuck to each other. Vegetables included red cabbage shavings and celery.\n\nRoasted duck banh my: Duck was chewy and contained a LOT of fat. In fact, the meat was mostly just fat. I'm not sure how much real protein was actually included in the sandwich. Cucumber pieces were mushy and pickled. Besides that, the sandwich overall contained good flavor. If you must visit this place then I'd say get the banh my but not the bowl.", "author": "Lillian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Best cheapest lunch in the haight.  All of their sandwiches are amazing.  I absolutely love the five spice chicken.   They also have good soup for like three bucks.  I've had the iced coffee a couple times and it is also good.", "author": "D D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "\"All the Big Trees\"\n---Jonsi & Alex song from Riceboy Sleeps by Sigor Ros vegan Icelandic frontman & his partner Alex Somers\n\nDragon Eats in the Haight has a clean & spacious interior. It is a nice spot to get an affordable Banh Mi (pronounced b-ah-n me) Vietnamese Sandwich. For vegans your best bet is the Teriyaki Tofu order w/o mayo to make it vegan. \n\nIt comes on a French baguette, daikon, carrot pickle, fresh cucumber, cilantro, & sliced jalapeño w/ seeds (omit if you don't like it spicy).\n\nThe only caveat is they close at 6pm so for dinner if you arrive late & weather permitting it might be best to get yours to go to have a picnic at nearby Golden Gate Park under all the big trees like I did recently.\n\nThe Teriyaki Tofu was fresh & flavorful as the soft silken tofu hit the spot. Other vegan options are the bowls & fresh rolls. The bowls are made of rice noodles, salty roasted peanuts, crispy shallots, daikon & carrot pickle along w/ lots of veggies w/ a soy sauce dressing.\n\nThe fresh rolls are made of rice paper, rice noodles, red leaf lettuce, mint, peanuts & soy sauce.\n\nVegan mayo would be nice yet was fine as is as kudos for fresh produce & tofu. Great spot for lunch inside or picnic dinner in Golden Gate park. \n\nI'll return!", "author": "Shane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "DragonEats was enticing so I dropped by to try. I found the prices reasonable and I had duck banh mi. I bought a water and returned it because they have a water dispenser. I thought it was cute spot, but the service was not warm.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Tofu banh mi is out of this world. The teriyaki marinade really perks up the tofu perfectly, which is cooked, not fried. Also enjoyed the shrimp rolls with peanut sauce. I got both for lunch, but it was too much good. Next time I'll get one or the other.", "author": "Alyssa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Tasty, reasonably-priced, fresh food! I would recommend coming here for a quick lunch or for grabbing a to-go order. \n\nI got the Chicken Salad over a bed of shredded cabbage and green papaya. Delish! The flavor of the chicken is incredibly savory, sweet, and smokey, though the texture is a little tough, like jerky. The fresh herbs and combo of other crunchy veggies makes this the perfect light lunch. Definitely coming back here.", "author": "Robin N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-20", "description": "Come in here sometimes, teriyaki tofu bowls are good for the price. I went in and grabbed a plastic spoon (didn't buy anything) and on my way out a woman in the restaurant told me \"next time can you ask?! this isn't just a walk in walk out type of thing\". I apologized... just needed a plastic spoon. Maybe people steady come in and steal their plastic cutlery? idk. Definitely not coming back here to get yelled at.", "author": "Mary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "I love the pork one and the butter chicken one. So tasty and cheap! Will def full you up unless you are hella fat; in that case get two.\n\nThe kale ginger lime soup is also really good and makes me feel healthy.\n\nI like this place; they are very consistent.", "author": "Auza A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Best banh mi I've ever had! Ok, ok, it was my first banh mi. Crazy, since I'm a pretty avid pho-slurper. No frills, cheap, quick, and very fresh. The bread is toasty and crunchy, the chicken filling was warm and saucy, if a little bland, and the veggies were crisp. Just throw some sri racha on top and I suppose that's what you're going for when you order banh mi. The daily soup looked stellar as well. $7 with tip and I'll have the other half of my sandwich later. \n\nAlso, honorable mention for all the Cafe du Monde coffee cans as decor and storage... even though the nice Viet gentleman at the register had no idea what Cafe du Monde is lol", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "I loved this place, great food and great prices. My friends and I stumbled upon this place and safe to say we will be back", "author": "Jason O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-24", "description": "Walking around Haight area thrift shopping sure does build up an appetite, thank goodness for all the food nearby!\n\nLong story short, I've been wanting to try DragonEats and glad to see I did\n\nFlavors are there and its packed fairly well with fresh ingredients. WIth that being said, I still prefer Saigon Sandwich on Larkin or Munchboxx in chinatown \n\nOverall Thoughts\n\nWell worth the try without breaking the bank", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Really, really yummy Bahn Mi sandwiches. Great options for vegetarians. Very reasonably priced as well. I'm sure I'll be coming back here", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-22", "description": "Quick service. I was feeling under the weather--really craving the Asian soup cure and this was the only place that had something simple that didn't have noodles. I ordered the Soup of the Day (kale soup) and a green papaya salad. The two items were complementary and made a great light meal. I don't usually order food with kale, but I needed some Asian soup. The soup was surprisingly flavorful, without the bitterness that I dislike in kale. I will be back.", "author": "Shizuka L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Best banh mi I have had hands down!!! Everything about it, the bread, the fresh veggies, the pork, was so good!", "author": "Shabnam E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "Portions seems smaller then the last few times I ate here. Sadly I won't be eating here anymore.\nToo expensive for the small sandwich.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "I love this little place.The Sandwiches are yummy and filling.Lots of meat and tasty.  The bowls are yummy too.  They do not skimp on the ingredients.  Super convenient and they are on Doordash for delivery.\nCheck them out!", "author": "Susie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "B E S T E A T S\n\nI'm such a fan of this branch, as well as, the one in SOMA. I took my friends here after raving about it and could tell they were like so whatever idc. I still believe this place is the best for a quick and pseudo-healthy lunch. \n\nViet coffee, not that great.", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "This place has hella good salads. Get the chicken salad w/ half papaya half cabbage and mix in lots of sriracha. Their duck banh mi was also pretty good, it could've been bigger but that's okay. \n\nThe interior of the store is also very clean and aesthetically pleasing and their menu is quite simple and easy to understand.Overall would recommend.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Ingredients are fresh, Sandwich size is OK. service is great, price is high. Only three stars because this is an Americanized version Banh Mi. Carrots and radish lack the tangy pickled taste, fish sauce is virtually undetectable and overall the taste is bland. Tried the five spice chicken since they were out of the duck. Probably perfect for the Haight Ashbury tourist crowd but if you want the real deal try Eternal Springs on Clement Street.", "author": "Ann B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Overall rating: 4.5 / 5\n\nWhat I ordered: \n- Roasted Pork Bahn-My ($6.75): \n   - Rating: 5/5 - this is my favorite kind of bahn my! Plenty amount of vegetables (carrots, cilantro, cucumber, jalapenos) \n- Garlic Butter Chicken Bahn-My ($7.00) \n  - Rating: 4.5/5 - this was also really good but I loved the pork bahn my more :) \n- Shrimp Fresh Roll ($7.00) \n  - Rating: 4/5 - there wasn't anything unique about the fresh rolls (the same as any other fresh rolls that's available in any Vietnamese restaurant)\n\nPros:\n- Best Banh-My in SF (authentic Vietnamese Bahn My)! Super Crisp and high quality. \n- Interior of the store is really pretty and good for photos :) \n\nCons: \n- They only ice cucumber water available so if you're not a big fan of cucumbers, you should bring your own water to drink!", "author": "GrapeOolong W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Freaking delicious banh mi at an incredible price. Hip and clean decor. They had orange and basil infused water for free which was so refreshing. I got the meatball banh mi and it was really filling and flavorful.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-19", "description": "I went there for lunch on President's day. In my opinion, the place is way too overrated and overpriced.  I had a roasted pork bowl and a roasted duck sandwich. The bowl was ok, it tasted fresh and original, but the sandwich was lower than average, it had a stale taste.", "author": "Oleg K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "So far this is the best Bahnhofstrasse Mi I've had in the San Francisco. I've had more expensive sandwiches in other parts of town, but they were no where as good as this place. I ordered a second to go for my husband, that's how good it was.", "author": "Andrea Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Hands down the best banh mi I've ever had! I got the duck banh mi and was blown away.", "author": "Erika N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "Yesterday, I was around the Haight area and found myself craving a really good vietnamese sandwich. I then found this place. The place is pretty small (there were only 4 seats available) but I thought the layout was really cute. The workers were really friendly. They finished making my sandwich in less than 3 minutes :) so that was great. I ordered the roasted pork banh mi. It was cheap and a good size for a sandwich.\n\nIt honestly tasted a little bland to me. I love really savory and juicy vietnamese sandwiches and this sandwich did not fully hit the spot for me. It didn't satisfy my cravings. However, everything was very fresh :) I can see myself coming back for their good service and cheap sandwich though!", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Wow, probably one of the best banh mi sandwiches I've every had. 5 stars for flavor, decent pricing and exceptional speed of service. I got the pork sandwich, pork is served warm in a cold sandwich. Great flavors and my order came out within a few minutes. Clean, simple menu. Space is slightly small, with limited seating and no restrooms. Other than that, great food, drop in!", "author": "Angel K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-29", "description": "DragonEats is super convenient, I go here for lunch sometimes when I need something quick and at a low price. Can't go wrong with any of the their banh mi (Garlic Butter Chicken Breast is the best in my opinion). They also give you a neighborhood discount if you work in the area which is a plus. \n\nThe only con I have is that they gyp you on the Vietnamese coffee by filling the whole cup with ice.", "author": "Joshua H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Had the pork bang my.  Everything as so fresh and tasty .  Price is so reasonable.  Makes me wish I lived I San Francisco.", "author": "Pat G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I live a few blocks away and this is one of my favorite lunch spots in the neighborhood. Reasonably priced, fast and really really tasty. Usually get a standard bahn mi, pork. So good. Wife loves the chicken roll.", "author": "Venus H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Very good food at an incredible value. The service is always exceptional and the food is ready very quickly. Highly recommend if you are looking for a quick bite on Haight St.\n\nThe Pork Bahn Mi and the Chicken Rolls are my favorite!\n\nThe only downside is the seating space. There is a small counter with a few stools but this is more of a grab and go type place.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "This place was okay. Saw it as we passed by and figured we'd share a sandwich. \n\nIt's a pretty small but cute little place. A few stools inside with seating against the wall but mainly an order and take to go kind of place. \n\nThe place seemed pretty authentic with everyone speaking Vietnamese. The food looked authentic as I watched them make the sandwiches. \n\nWe got the grilled pork. Overall it was decent but the one surprise was it had pate. I hate pate; although it wasn't a large amount on the bread. Usually when I order from Lee's sandwiches (where I normally go get my Banh mi sandwiches) they don't come with pate on the chicken and pork ones. We also got the Vietnamese coffee but I don't think it's condensed milk they use; or if they do, they also use some type of artificial sweetener (at least it seemed like it) since it had that super fake sweet taste. Couldn't drink more than half of it before having to toss it.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Always in search of a goog bahn my sandwich.\nFound a great one here.  Had 5 spice chicken killer.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "Pretty good. I got a \"bowl\" which I think most would assume was a rice bowl but it was a vermicelli bowl. Kind of disappointing but it was still good. Not a lot of food but it also somewhat cheap. I'd probably go for a sandwich next time.", "author": "Doran I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "Food is fine, they have the good bread, but floor was very dirty with what was obviously food from the day before, kinda gross.", "author": "Alexis F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "the butter n pateu is taste good.... i got the roast pork... it wasnt that great... the sandwich was so dry... n hard....  but their sandwich is huge though.... its a bit pricey here for a sandwich.... but we can understand its SF...", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Stopped by this restaurant while strolling through Haight-Ashbury. Seating is bar-styled and a bit cramped. Ordered the pork and (5 seasoned?) chicken banh mi sandwiches, and my siblings ordered the bowls. Food came out very fast. The dishes are Americanized but still really tasty! The water jug at the front needed to be refilled. Other than that, we enjoyed our visit :)", "author": "Amy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "Went here for banh mi and vietnamese coffee. I tried the five spice chicken.. but the xiu mai meatball sandwich got me hooked!", "author": "Yennie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "One of, if not the best banh mi I've had. Amazing. Cheap too! Definitely worth a lunch stop after shopping in the Haight", "author": "Josh C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Omg this place went way over my expectations. Friendly staff, fantastic food, and cute atmosphere. I got the roasted pork bowl which was really good and so well priced. Good proportion of meat, veggies, and noodles. Spices and flavor was phenomenal.", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "I'm pretty cynical about SF's Bahn Mi scene after trying all the highly touted places (Saigon, Duc Loi, etc.) and leaving disappointed. So I approached DragonEats with skepticism when I saw this chalkboard sign off of Haight St. advertising Vietnamese Iced Tea & Bahn Mi's & Noodle bowls. \n\nLike at least 1 other reviewer, I've only gotten the teriyaki tofu bahn mi's, but have been blown away every time. The ingredients are incredibly fresh, authentically prepared, proportioned well, the bread is just right, and if I wasn't eating vegetarian I'd devour the pork & pate sandwich. Prices are also reasonable (all things considered). \n\nMy new favorite Bahn Mi spot in SF", "author": "Andres B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "I came here to grab food for my coworker, and decided I'd give it a try myself! \n\nThe food was definitely delicious, but on the pricier side for a banh mi. I'm used to paying around $4.50-$5.00 for a banh mi, but paid almost $7.00 for one.\n\nIt is much cheaper than other food places in the Haight, and I think this is the only place to get a banh mi, so it'd definitely worth it! Their rice bowls were also pretty good!!\n\nFood: 8/10\nStaff: 9/10\nAtmosphere: 8/10\nValue: 6/10\nOverall: 7.75/10", "author": "Evan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-21", "description": "Stopped in here for a light snack since I was in the neighborhood. I saw it had good reviews, especially for the bahn mi, but I was looking for even lighter fare. I ended up getting the teriyaki tofu roll. \n\nIt looked beautiful, but it tasted just ok. I didn't tast the teriyaki flavor and the tofu was uncooked. I think a little sear on the tofu would have gone a long way flavor wise. The saving grace was the peanut dipping sauce. My roll turned into a tool to eat as much of that as possible. Lastly, the pieces were way too big and with sticky rice paper, it was really hard (and rather unattractive) to have to take bites out of each piece.", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "Super fast and delicious bahn mi and spring rolls! This is a tiny space, so plan to carry out your food or eat quickly as people hover around for your spot. Space was cleaned quickly by staff between diners. Free water dispenser (you might need it for the spicy jalapeño). Really reasonably priced for the portions, too!", "author": "Carly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Absolutely love this place. How had I not discovered it back when I lived in the Haight?! Quick, healthy, simply delicious food served here in a clean, minimalist, albeit small place. \n\nThe 5 spice chicken blew my mind. The flavors were amazing and worked so well together. I was so full from the first half that I took the second half to go, which my fiancé had the next day and loved as well. You know you're doing something right when the food is great the next day too! I also had the chicken broth with kale and lemon and ginger, which was perfect for warding off my incoming cold. It was warm and flavorful, and the ginger flavor did wonders for my nose. \n\nLastly, I had the Vietnamese coffee. It was good but not my favorite - a bit too sweet and too much ice for my liking.", "author": "Mio W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Pretty good banh mi. Had the tofu. It relied pretty heavily on the sauce. Not quite five stars but definitely worth the stop.\nPairs amazingly with sriracha.", "author": "Stuart A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Best banh-mi I have had!\nJuicy meat\nCrisp, and substantial vegetables\nZing in the jalapeños \nHigh quality baguette\n---\nNow, 30 mins after eating, do not feel like I ate some factory farmed junk\nAt approx $7/sandwich, that is impressive.", "author": "Zhou S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "THEY CLOSE EARLY! 6PM! \n\nDelicious banh mi sammies. The kale soup was good too. Yummy Vietnamese iced coffee.\n\nVery reasonably priced. Vegetarian/vegan option available for sandwiches or spring rolls - teriyaki tofu!", "author": "Maria E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "I really want to like this place. But it's just not even really edible. Yesterday, I got the 5 spice chicken bowl, and the green part of the salad was great, with cabbage and bits of fresh mint and basil. But the chicken was inedible, like shards of overcooked cardboard. Not even full pieces of cardboard-- more like shredded cardboard. I really couldn't eat it. Shame, because it's convenient, and the salad ingredients were good.", "author": "Lilah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "I like a good fresh shrimp spring roll. \n\nAs a vietnamese foodie / snob, I approve. It is not the most \"authentic\" but the crispness and presentation of food, and general ambience is lovely. They have always been reasonably prompt. The banh mi (for sandwich lovers) and fresh rolls (for health conscious, gluten sensitve folks) have always been thoughtfully prepped. This is now my go-to for not-too-heavy, fresh food on Haight.", "author": "Lydia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Got the roasted pork bowl, which was pretty good ... but I'm looking at the pics of the bahn mi sandos and kicking myself for not ordering that. Luckily I live a few blocks away. Will report back and see if their bahn mi can hold a candle to Bahn Mi Phuong in Hoi An!", "author": "Whitney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "These bahn mi sandwiches are amazing and fast! I was hungry and I was about to sell my clothes at Wastelands so I needed the fuel to do this dirty work. I have had many bahn mis in my lifetime as I am 41 years old growing up in the city. These are one of the best I've had. I had the pork sandwich packed full of pickled vegetables and delicious marinated meat. As I was eating I was sad that I was alone and no one to share my joy with. So after I was done at Wastelands I went back to get two more sandwiches. Another pork sandwich for me and a 5 Spice chicken for my girlfriend! So here we are 4:45am just finishing the sandwiches as a late, late night snack. They also have noodle bowls and ice tea etc. I will come again thank you! These bahn mi sandwiches are love mi sandwiches.", "author": "Anna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "The Banh Mi Sandwiches and Bowls here are super delicious.  I had the 5 spices chicken bowl and my mom tried the garlic butter banh my.  Both are outstanding and a very fair price.  Just a word of caution that this small restaurant only offers like 5 chairs to sit on so its more of a to go place.  Also, the vietnamese coffee is a tad bit sweet.", "author": "Monica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "They recently renovated the place slightly, so more seats! Roasted duck banh mi is a must have.", "author": "Albert N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Dragon Eats is the best spot for natural, delicious, and quick food in Upper Haight and surrounding areas. \n\nThe menu is simple (Bowl, Roll, Sandwich) but the food is consistently perfect/delicious and lightning fast. \n\nFood comes prepared for easy travel, and the space itself is cramped and hot (Yet clean and efficient) so I'd suggest enjoying to go.", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Best damn Vietnamese iced coffee I've had! Perfect pairing with the pork bahn mi. This is a great place to grab a quick tasty bite.\n\nSimple & straight to the point...or should I say straight to the belly. Would definitely recommend this place. You can taste the love in the food and the music is great!", "author": "Ed A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Great little spot for banh mi sandwiches! Food comes out super quick, like 2-3 minutes. Lots of protein stuffed in these little sandwiches at great price and they taste great! Excellent value, you won't be disappointed.", "author": "Qyon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Love their chicken banh mi and also love their kale soup. The bowls are also good but you don't get much so I recommend the sandwiches.", "author": "Mira B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Excellent vietnamese sandwiches (reasonably priced) and the soup is a must. \n\nHere's the scoop:\n\n-BAHN MY (or MI - the menu says MY..): \n5 spice chicken: \nClassic, lots of flavor, dark meat and white meat, you can taste the love gone into that chicken to get it here.\n\nGarlic Butter chicken:\nAll white meat, made with chicken breast...highly recommend. This was my go-to before having the 5 spice chicken. Naturally, a little drier BUT the garlic butter gives it lots of flavor. Can't go wrong with this or the 5 spice, but if you like a little dark meat (and more flavor and juiciness) go 5 SPICE. \n\nRoasted Pork:\nTHE MUST have according to my entire office that frequents dragoneats weekly in the SOMA. Will be trying this next time, but i always like to play it safe with some chicken to start off.\n\nTeriyaki Tofu:\nReally well executed tofu banh mi. Lots of flavor, tasty, BUT i wish there was more tofu. \nVERY Comparable to the Bi-Rite Tofu Bahn Mi if you've had that one... Definitely top 2 tofu bahn mi's i've ever had.. (okay ive only had two, but still both were bomb).\n\nSOUP:\nGet the soup of the day. \nGinger chicken - delicious and flavorful.\nChicken + Kale -\" \" \n\nBoth had great broths, clearly used from their in house chickens that they use for the sandwiches. \n\nEnjoy.", "author": "Naveed B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Efficient friendly service, simple menu with still plenty of choices, good food. Our cabbage and papaya salad with chicken was very good.   Plastic cups for water are too small.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Holy smokes this place is so freakin good. The pork bon my just literally blew my mind and there 5 spice chicken bowl rocks my world. Thank you for existing, Dragon Eats.", "author": "Jennie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Probably some of the cheapest eats you can get in the Haight. Pretty decent food, though a limited menu and very limited seating. Definitely a good spot for take out and a cheap lunch!", "author": "Fiona F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Great authentic banh mi. I enjoy how saucy the sandwiches are.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "What a lovely place! Super fast service. Really! perfect for take away!!! Veg rolls, tasted good! But bad music playing inside :(", "author": "Jayla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "I got the 5 spice chicken Vietnamese sandwich, let me just say AMAZING. Definitely worth the $7, being as its in SF, definitely on the cheap side. \n\nDefinitely a try!", "author": "Jaime D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "Great place for lunch. Tofu bowl are best. It's very fresh and flavorful. Prices are very reasonable and service is fast.", "author": "Charles O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Wonderful place for lunch. I really enjoy the tofu bowl. It's very fresh and flavorful. Prices are normal and service is fast!", "author": "Adalynn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "The menu in this small shop is a reasonable size with enough choices to please most people but not overwhelm. Prices are very reasonable and service is fast.", "author": "Eve W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Ordered the chicken bowl and a tofu bowl for the spouse. Fast. Friendly. Fresh. The veggies were crunchy. Need to go back and check out other items. Good prices too.", "author": "Steve W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "I was walking by my hood last week when I came across a clean, pale wooden shop- at first I thought it was some minimal tea/coffee shop.  But it wasn't.  Glad I stepped in there, because I saw signs about Bahn Mi, and Noodle bowls, ginger broths and thai iced coffee.  The best part of it?  Old Vietnamese women doing the damn thing in the back- ya know it's legit.\n\nSure, it's $6.50 for Bahn Mi, \"I can get this for cheaper and better in the TL, BLAH BLAH BLAH.\"  O rly?  Then go to the TL, get your 3 dollar sandwich with a side of crackheads taunting you.  This is Haight, a neighborhood that pays for tourism and high real estate.  I also didn't see the amount of meat to be a problem.  It wasn't lacking, it just wasn't massive like those 3 dollar crackhead Bahn Mi's.  Besides, the bread was crunchy, meat was tender (I did have a slightly fatty piece, but was only a small bite), vegetables crisp and fresh.  Overall, solid sandwich with flavor, texture and...damn. I think i'm gonna walk over there and get one now.  \n\nThe ginger chicken broth was perfect as a side on the rainy day.  I sat in their seating area while some little vietnamese women chatted their way to making my sandwich and soup, and the cashier filled me a cup of iced coffee.  I was just so stunned this place popped out of nowhere. For ambiance-  it was brand new.  Not super comfortable, but I didn't plan on staying their the entire day, so I wasn't complaining- music was not loud and annoying like previous yelper had described. \n\nUnfortunately, local establishments here need to raise their prices for the area.  That day I ran across the new Dragoneats, I had seen a  local clothing shop's \"10 dollars on entire store\" sale.  That store had been there for at least 5 years on Haight;  it's sad to see a local establishment disappear.  Going back to my point, the food sold at Dragoneats is not expensive, nor outrageously priced.   Support a decent joint, especially 1 week into their soft opening.  Welcome to the neighborhood!", "author": "Cat A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "Quick, clean friendly place to grab a banh mi in the Haight.  Very delicious.  Highly recommend.", "author": "Ducky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "I think I'm in love with my new neighborhood Vietnamese place. LOVE the soup and pork meatball Sammie too good and AFFORDABLE! Super tiny, it's best to get stuff to go.  \n\n- Roasted Pork Sammie is a little fatty (no pic), after I picked all the loose fat off it was yummy. \n\n- Garlic Chicken Roll is amazing. \n\n- Pork Meatball Sammie is the BOMB!\n\n- Chicken Broth / Soup is delicious and light. \n\nSee pix. \n\nAlso, please tell VERY RESPECTED grandma, mother, and auntie that \"the nice young man at the register can only listen to one person at a time. Ssshhhhh when he's taking a big order\". He's too sweet and respectful to tell you, so I will. Sshhooooshh! \n\nPlease don't raise your prices, your food rocks!", "author": "B K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "I was shopping on Haight street and was feeling hungry so I picked up some spring rolls. I think it was two shrimp spring rolls for $6. The rolls were chopped into thirds very conveniently and served with the peanut dipping sauce. I think they made the spring roll perfectly, exactly the way I was expecting it to taste.", "author": "Kathy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Fresh, delicious and tasty. The bread was piping hot and the service was super quick. Highly recommend.", "author": "Leena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Delicious Vietnamese sandwiches , I demolished the garlic butter chicken , if you lift and burn calories fast you need 2 lol but seriously tasty stuff", "author": "Jake Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "I got the chicken bowl and it was very good and super filling. The service is also really fast; I got my food like less than 3 minutes after ordering. Very clean and cute looking place as well, though probably best just for casual 1-2 person dining as there aren't many seats.", "author": "Susan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "This is a high quality banh-mi sandwich. The price is higher than you might expect relative to other banh-mi, but still a great price point for the quality and quantity of food you are getting. Recommended.", "author": "Derek F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "This place makes a really good banh mi! It's not quite at the level of some of the places in the TL (Saigon sandwich et al), but their food is good and flavorful and it's a price conscious option compared to a lot of other choices in the 'hood, and it's always nice to be able to grab and go. \n\nMy biggest complaint with this place is the 6pm close time. I walk by it every day on my way home from work... which is ALWAYS after 6pm. Even a bump to 7p would get me in here way more often.", "author": "Courtney A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Yummy, quick lunch spot on Haight. I've only tried the Teriyaki tofu rolls, but let me tell you -- they are BOMB. Particularly good when you're looking for a really light lunch. Each time I go, I call about 10 mins prior to order, and its always ready by the time I get there. Good stuff. \n\nThey also have vietnamese sandwiches and bowls, which I have yet to try! If you're in GGP, or strolling through Haight, I would def recommend this place.", "author": "Mel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Excellent bahn mi in upper Haight. Quick, good buns,I like buttered chicken breast, roast pork,and 5 spice chicken best. They also have a nice light soup of chicken broth,lemon and kale. They make anything as a sandwich, bowl,or rice paper wrap.tiny, so..take it to Zam Zam or Hobsons Choice to eat it...or golden gate Park if the weather is good.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "We are tourists from Cleveland.Had a 5 spice chicken bowl and a duck bahn my (sandwich). Both were excellent with very fresh ingredients. Only a few seats but if you are visiting \"The Haight\" a great place for lunch.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "We just got back from Vietnam and we were craving some Vietnamese food and this spot did not disappoint. We got the chicken fresh roll, a pork bowl, and a chicken bowl. Oh yes, and a Vietnamese iced coffee. The fresh roll was the best I've ever had. The bowls were as good as anything we ate in Vietnam. And the Vietnamese coffee was as good as the probably 10 iced coffees I had there. This place is also very affordable, as food should be. $25 for all of that.\n\nCheck them out, you won't be disappointed.", "author": "J P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "Best Vietnamese sandwich I've had in years. Only $6.50. I will never forget this delicious experience. This restaurant gave me a taste of pure bliss.", "author": "Caroline W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Pretty good place! Stopped by when we were in the area for a quick dinner. Boyfriend and I both got the roasted pork banh mi, and he also got an iced coffee. \n\nThe ice coffee was nice - tasted like it had condensed milk in it. It was a nostalgic taste for me. \n\nThe banh mis were really good as well! My only qualm with it was that the bread was a little hard so it scraped the roof of my mouth, but it was definitely worth it since I live so close to it. \n\nLooking forward to coming back here!", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Just down the street from the H&A intersection, it's unassuming and easy to walk by-- but don't, don't walk by, walk in and treat yourself. \n\nI had the 5 spice chicken Bahn My, and was asked \"with jalapeños?\"  \"Why yes, yes I would like them.\"  \"Good choice\". This such a flavorful sandwich and the jalapeños were thinly sliced and not to over the top heat wise. The chicken was tender, and whatever those 5 spices were, were great. \n\nVery little inside seating, and I think for the most part this a walkable, sidewalk eating sandwich. \n\nI defiantly will be back.", "author": "Jim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Good bahn mi, super close to my office. The prices are reasonable and the staff are nice. I prefer the 5 spice chicken out of the 4 I have tried.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-29", "description": "Got the bowl with chicken. Mostly salad, tiny bit of noodles, and dry chicken with a hint of seasoning. It was a joke compared to any authentic Vietnamese spot in the city.", "author": "reza n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Wow! I am so glad my boyfriend and I stumbled on this place while we were hanging out in Hayes Valley. This adorably chic Vietnamese place blew me away with its ridiculously cheap prices (for sf of course) and the delicious food they served us. It is a tiny, order at the counter kind of place with the option of a salad bowl, noodle bowl, fresh roll, or bahn mi made with chicken, tofu, or shrimp each for around $6.50. Simple,cheap, and delicious! We had the salad bowl with tofu and the fresh rolls with shrimp, and each was refreshing and delicious. I will definitely be coming back to try the other options as well.", "author": "Simona K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "My go-to lunch spot, since it right down the street from my work. I crave their teriyaki tofu spring rolls at least twice a week, and the peanut dipping sauce it comes with is so delicious! If you're down for a banh mi, try their garlic butter chicken one. \n\nDefinitely one of the better food spots on Haight without making a dent in your wallet.", "author": "Alexis G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "Okay, you've got to be crazy not to like this place. \n\n5 Spice Chicken Bahn My. Light sauce, no jalapeños. Came with a ton of shredded carrot. $6.50!!! I ate half for lunch and was full enough to save the other half for later.\n\nBoyfriend got the Duck Bahn My, which was actually notably smaller than my sandwich. I think his just had significantly less carrot (mine had a ton).\n\nAlso, there is no restroom on site. BUT this place has some outlets right at the eating counter if you gotta charge your device.\n\nFree cucumber water!!\n\nI first discovered DragonEats at its Hayes Valley location and have revered it as one of the only affordable lunch options in that area. When I walked past its new Haight St location, I was overjoyed! As someone who lives up the street, there are so few good lunch spots in the Haight if you're eating on a budget and this is definitely one of them.\n\nWill be trying the ginger chicken broth next time with my meal.\n\nUPDATE: Just ordered a bowl for the first time from here and the portion size didn't really justify the cost. I'd stick to the Bahn Mi here. Chicken broth was solid, though!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Stumbled on this place randomly,  and tried the roasted duck banh mi. Really juicy and flavorful.  Will definitely be back next time I'm around the Haight. \n\nService was quick and prices weren't bad either.", "author": "Derrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "I literally eat here once a week. This place is seriously so good for the price and convenience. I hardly ever review anything but felt the neeed to give this place it's due credit. I have DragonEats on speed dial. Just eat here and get the roasted pork banh mi with a shrimp roll. You're welcome.", "author": "Cameron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "I don't really write reviews, but I love eating here! Cheap delicious banh mi sandwiches. Used to eat the pork before being vegetarian, but love the teriyaki tofu!!", "author": "Andres P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "We got the duck banh mi and the grilled pork banh mi. They were great!! I liked the pork better than the duck but they both were up to par. I was a little skeptical at first - I always seem to think that if it's not a hole in the wall Vietnamese deli, it won't be what I'm expecting but kudos to this place, I would definitely go again and recommend it to others. One sandwich costs about $7. I also got a lemonade that was ~$4. It's expensive for a banh mi but pretty good for SF, I suppose. There is a self-serve water pitcher with mint and cucumber in it. The water cups are small though (I could finish the cup in 2 gulps) so it was kind of inconvenient for refills since the place is tiny and the water is set up right by the register where people are ordering or looking at the menu. Overall, great place to stop and grab a sandwich for the park.", "author": "Susanna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "I'm so happy this place opened. It's a great addition to the neighborhood.\n\nTheir soup is delicious - chicken broth, kale, cilantro, ginger, and shallots. Yum!\n\nMy two other favorites are the Bahn Mi and Green Papaya Salad with Shrimp. \n\nCheck it out, great take out spot.", "author": "Caitlin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "The Tofu banh mi is a FIVE!! One of the best that I've ever had in the city. They use the highest quality ingredients, more expensive than some of the great spots in the TL BUT no upset stomach after...pay the few extra dollars, the better ingredients are so worth it. I've also had the spring rolls, good but not amazing like the banh mi! I eat here at least 3/ month, it's that good :)", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Walking home through Haight St, my tummy grumbling, I was fiending for a slice of pizza when a sign for banh mi, bowls and rolls caught my eye instead. I could tell the place was new, and decided to try it. I got the roast pork banh mi and a Vietnamese iced coffee. The sandwich was so flavorful, bread was so crunchy, meat was soft, and none of it was too heavy. Really hit the spot.\n\nPros: friendly staff, delicious food & coffee, lightning fast service because I was the only one there ;D\n\nCon: sandwich could have been hotter, I personally like the contrast between a piping hot bun/meat and cold pickled veggies, but maybe that's just not their style.\n\nI would have missed this place entirely if not for their sidewalk sign, so I'm glad they put it out there. Excited to have a banh mi place in the neighborhood! Next time I'll have to try the other sandwiches and the noodle bowls.", "author": "Connie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Absolutely love the shrimp spring rolls! And their peanut sauce is to die for. As for the salads and bowls, they're okay. They just don't have enough protein in them and need more flavor. It's just a bunch of noodles and lettuce. \nWhen it comes to the pork banh-Mi it's very delicious and super messy but satisfying if you want a good sandwich for lunch. \n\nTry it out and you'll love those spring rolls!", "author": "Leah N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-05", "description": "Good food, but everything else is a little off/weird...\n\nSo this Vietnamese restaurant has sandwiches, rice bowls, and some other random things like coffee and lemonade.\n\nFirst off, the food: Came here with a friend and we split the pork banh my and duck banh my. Pretty good sandwiches, for a decent price. (Sandwiches are all around $6.50 or $7). Although the sauce was a little too sweet and sometimes overpowering. Also the pork sandwich was super greasy and some parts were just fat...not meat. But like just pieces of fat.\n\nEverything else: This restaurant has NO BATHROOM. (LIKE WHERE DO THE EMPLOYEES GO TO THE BATHROOM OR EVEN WASH THEIR HANDS)\n\nSo after sitting here and catching up, we had to use the restroom. And there wasn't one. Not even for customers. Not even to wash our hands. The employee told us to use the coffee shop next door's bathroom and specifically told us to go in through the back. We didn't quite understand his instructions, so we tried to clarify. We even asked if they had a deal with the other store, since we were confused, so we could just ask their employees when we got there. But he was vague and they don't. In the coffee shop, we asked the barista if we could use their bathroom and she said they didn't have any agreement with the restaurant next door and that we needed to buy sometime to use the bathroom. So we spent $3 buying a bottle of water.\n\nAlso, the employee standing in front of the cash register was quiet through all of our interactions with him. We asked him about how the restaurant seemed new, the menu, what items were popular, and also the bathroom issue. He was not particularly helpful and gave us vague and short answers. He wasn't friendly and was very cold. After our bathroom adventure, we kindly suggested how they might want to make a bathroom somehow available for customers in the future, but he just said no.\n\nDecor is pretty modern and very plain. My friend even commented that it didn't seem like they were done building the place. There's limited seating. And with the seating that they do have, there's no leg room. Like the tables aren't real tables, they're more like cabinets.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "I live in the Haight and have always struggled finding healthy lunch options besides a $15 salad from Whole Foods. DragonEats nailed it. Their menu is simple: refreshing flavors paired with your choice of protein, in the form of a salad, a noodle bowl, or a sandwich. (Their seasonal soup is delicious too!) \n\nIn addition to the delicious food, the friendly staff, clean storefront, and low price point have made this my go-to lunch spot. Highly recommend!", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "As an extreme Bahn Mi lover and Haight resident, I couldn't wait to try this place out. However... I was a little apprehensive because Thai food seems to be the only Asian cuisine that the Haight does well. The new sushi place is OK, but it pales in comparison to Ebisu in the Inner Sunset and other options in the city. The closest Pho place is a 25-min walk from Stanyan. Forget about Chinese. (unless you have recommendations!) \n\nSuper pleased with Dragon Eats. Their roasted pork bahn mi is excellent and I can't wait to try the rest of the menu. The place is clean, they play nice music, the staff are nice enough while being respectful enough to let you eat in peace. I am a fan.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "What a great find!! So fresh, so good!! Perfect fast food and killer coffee to top it off! I got the pork bowl and it was delicious! I can't wait to go back and try everything else.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Hidden gem among other curious to crazy things in the heart of the Haight.  Very nice Vietnamese lady preparing quite tasty banh mi sandwiches.  Comparable to those sold in Little Saigon in San Jose.  Definitely worth trying when you are hungry for quick, inexpensive, real food while walking around the Haight.", "author": "Mikey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Noodle bowls are great, good for eating in or taking out. Service is friendly and usually pretty fast, even when it's busy.\n\nThe main reason I love this place though is that somebody here has excellent taste in house music. Every time I come in, something tight's playing on the speakers. Good food, good vibes.", "author": "Ruairi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Affordable and delicious. We tried the pork bahn mi sandwich and the shrimp spring rolls.\nSolid on both ends. Interior is modern and tiny so your meal may have to be taken outdoors if it's busy but delicious food is worth it.", "author": "Kay E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "So I have been waiting with baited breath for DragonEats to open, hoping that their presence on Haight St means a trend toward better food options.  They did not disappoint.  7 hours into their opening day and the staff was kind, quick and the food was so so good.\n\nI ordered a duck bahn mi for 7 dollars and for that price I got a ridiculously tasty, crunchy, flavorful sandwich.   They have bowls, rolls,  bahn mi, green salads and I believe a soup of the day.  I cannot wait to go back and have lunch on Monday.\n\nThe most expensive item was the duck so you are looking at lunch for less than 10 bucks!\n\nSeating is limited and a little cramped in front, but the space is nicely done and easy to maneuver.  \n\nWelcome to upper Haight.  Please please stay a while...", "author": "Monika S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "I really like DragonEats Bahn Mi. I really like the fact that they don't put in all that freaky, discolored chicken that you see at some Bahn Mi spots. \n\nTeriyaki Tofu Bahn Mi- Delicious. I thoroughly enjoyed this. Lots of flavor, the tofu isn't bland at all. Love the crispy shallots on it as well. This is a good contender to Bi Rites Tofu Bahn Mi. \n\nGarlic Butter Chicken Breat Bahn Mi- This is fantastic as well. I like that you can get all white meat. I am not a huge dark meat person. The flavor is delicious and buttery.\n\nSoup- I love their soup. It is fantastic. I believe it changes from day to day, but is usually similar. When I went, mine was a chicken broth soup, with ginger, lemon, and kale. It was so good. I will never go to DragonEats and not get the soup.", "author": "Gabrielle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Haight street location was excellent. Got the Five Spice Chicken \"Banh My\" and the Shrimp Rolls. So delicious! Highly recommend extra veggies + jalapeños (not spicy at all, I'm super sensitive).", "author": "Celie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "So simple and delicious. Classic Bahn my sandwiches with pickles carrots and diamond and jalapeños. Bread was very fresh. I had the teriyaki tofu Bahn my and it was delicious.", "author": "Arianna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Best sandwich I ever had.  One of the good place to have sandwich in San Francisco. And they are really quick and save lots of time.", "author": "Surya R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "Only had the roast duck bahn mi. Came out fast and flavors were pretty good but the duck was so fatty that the grease seeped through my bag. Oops. However the prices were right and the sandwich was good enough for me to want to try the other items on the menu.", "author": "Ming L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "After our hike, \"need...food...NOW\". my fiance said.\nStumbled into DE and was greeted by the owner. Very nice and sweet guy.\nI wasn't really hungry so we ordered a roasted pork banh mi (recommended by the owner) Vietnamese coffee to share.\nThe roast pork banh mi was delicious \nCoffee wasn't as strong as I expected but it was a good balance of coffee and condense milk.\nOverall, good price and great service.", "author": "PreciousSwt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Most affordable lunch spot on haight. Quick, easy and bomb Banh Mi's. I've had every flavor and they're all good. If you've never had a Vietnamese sandwhich this is a good place to start.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "The duck bahn mi is to die for! The other ones have been good too but the duck is the clear winner. Worth the extra $1\n\nThe place is tiny, only seats about 8 people. I usually get mine to go and eat it while walking around Haight street.", "author": "Gina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "Very tasty banh mi, has veggie options.  Short menu but all good.  Biggest complaint, place is really cramped and always seems to be busy. But great for a quick lunch and good value for SF.", "author": "Osama B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "I had the sardine sandwich and added pate.it was just exquisite. A slight french flair to the sandwiches here. Must visit if you want something light but tasty.", "author": "Awasi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "We went yesterday after we hopped of our tour bus. The space is nice and clean -- almost like an Apple Store. The menu is simple. They sell rolls, rice noodle bowls, and sandwiches. I got a duck sandwich for myself, spicy chicken sandwich for my parents, and teriyaki tofu rolls for my wife. We all thoroughly enjoyed them. The sandwiches had just the right amount of crunch in the bread and with the fresh veggies. There was a nice kick with the jalapeños as well and a nice sweet/sour flavor with the fish sauce. My son even tried them and approved.  The rolls were fresh and light with a yummy peanut sauce. \n\nAlso if you have room, the iced Vietnamese coffee was a cool and sweet treat!\n\nWe are glad to have found this on our visit to SF.", "author": "Sri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "I LOVE this place. Vietnamese food is already my favorite, and this place delivers the basics quick, fresh, and deliciously. The only thing I haven't tried is their soup, and I'm willing to bet it's awesome. This is a go to spot for a quick lunch, and it's priced exactly right as well. Don't forget to try their delicious coffee!", "author": "Beckie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Perfect for a quick meal in the neighborhood. Their service was very fast and friendly. Their dishes were fresh and full of flavor. We tried their duck banh mi and pork bun. Both were wonderful. The banh mi especially. We will definitely go again to try more on their menu!", "author": "Diane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Great place, easy walk from GG Park, báhn mì was delicious--tried duck and pork meatball--both excellent, friendly and fast service", "author": "Christa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-23", "description": "I got the teriyaki tofu chicken bowl. Not much flavor to the tofu but the rest of the bowl was good. There were crunchy, bitter, sweet and spicy (cuz I added the spice) flavors. Not a fan of the lettuce but loved the red cabbage. The bowl made me full so I'll have to eat the shrimp roll I got a little later.", "author": "Devin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Best bahn mi in SF! I have been here several times for lunch and have had the roasted port bahn mi sandwich and the chicken bowl, both very delicious. They have limited seating, so I recommend taking it to go.", "author": "Christina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Best thing that happened to us after B2B was the crazy drunk patrons in line and refusing to relinquish tables after they were through eating at our fave taco place. We decided to go elsewhere and found Dragoneats right up the streeet. Huz had 2 bahn mi (pork and duck), and 5 spiced chicken bowl and ate all of it instantly after we walked the 2 blks home. I did the same with my enormous shrimp roll. Food is excellent quality/taste and the cost is very inexpensive. So glad they're only 2 blks away. Don't wait for the next drunkfest on Haight to give it a try.", "author": "Cydney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "This place is bomb!!!!!!!!! Me and my boyfriend were looking for something light and healthy so we saw the cute little sign outside and they were not playing when they said healthy and fresh. So bomb, we got the 5 spice chicken banh mi and the fresh chicken breast roll! So satisfied and the inside is super cute, if I could give more stars I would!! Love it", "author": "Chantel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "Such a great addition to The Haight. Love the sandwiches and the ginger chicken broth soup is excellent.", "author": "Marissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Tofu banh mi sandwiches are my favorite handheld food item, so my standards are very high. DragonEats met and exceeded them! This place is small and unassuming, with a chic little interior and a sparse menu. I had the tofu banh mi of course, and it was soooo good. The tofu was flavorful, the pickled veggies were crunchy and delicious, and the bread was perfect banh mi quality.", "author": "Gaby K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Yummy cheap Vietnamese sandwiches, perfect for eating in the Panhandle.", "author": "Acnalb M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Great addition to my hood. Bahn Mi is on point and everything is still reasonably priced.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "I walked by this place and was stopped in my tracks by this amazing smell of deliciousness. I went back to find out what it was and found this place.  I ended up ordering the pork banh mi sandwich and it was to die for.  The guy at the counter was super friendly and helpful. I highly recommend this place.  My new fav spot for vietnamese sandwiches.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "This is our delicious go to Vietnamese food take out spot in The Haight. Have had their shrimp fresh rolls and pork bahn mi many times and they are always consistently yummy. So happy to have them in the beigh", "author": "Ajj J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "They have super tasty bahn mis and shrimp rolls. Their ingredients are fresh and the shop is clean. Great addition to the much needed food options in Haight. We get weekly takeouts and it's always spot on!", "author": "Didi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "I'm a big fan of Bahn Mi's and this newly opened place hits the spot perfectly! From their warm bread to fresh rolls I've tried the roasted pork and pork meatball 'Bahn My's\" and they are absolutely delicious. Most places don't warm the bread before making the sandwich but this place does - with ample Sriracha in reach and a nice clean atmosphere this place is great for a quick bite or late lunch - you won't regret it! Don't forget your employee discount if you work around at local business on Haight street - and grab a iced coffee before you go. I've visited this place 3 days in a row and can't stop, I'll see you here next time thanks Aaron!", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Best 5 spice chicken sando ever.  Loaded, zesty, savory, and filling!  Fast as hell service, too!  Can't wait to try more stuff here.", "author": "Drew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Quality sandwiches at a cheap price. I usually get the Garlic Chicken Banh Mi which is super delicious and only $6.75! You don't see those prices very often in SF anymore. The sauce in the sandwich is very sweet and butter which goes very well with the garlic chicken. Ambiance is clean and minimalist. Great place to grab a bite for lunch if you're doing weekend shopping in the area.", "author": "Marie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "The Duck Banh My is God's Perfect Miracle. Spicy, savory, unctuous and fresh, parked on a quintessentially light and nutty baguette. This sandwich is The Truth.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "I was on my way to another restaurant on yhe Haight and was luckily shortstopped by this place. I got the 5-spice chicken sandwich, to which I agree with everyone else: it was one of the best I've ever had. Spicy and super tasty, less expensive than everywhere else around it.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "Delicious sandwiches! We had the 5 spice chicken and shrimp rolls. Super filling and really good! Can't wait to try some other items on their menu.", "author": "gretchen p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Fantastic bahn my for lunch today - pork with perfect fresh crunchy julienne carrots and jalapeno (just a touch of heat) and cilantro- yummy- and on a perfect crunchy role- very simple menu in a small location - dont miss it!", "author": "Chris F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Delicious tofu bahn mi worth 5 stars. Then I watched the woman working there take the restaurant trash outside and throw it in the recycling bin, worth -1 star.", "author": "Charles D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-15", "description": "After trying several times, we finally got to try Dragon Eats on the weekend(their week hours are a small window). We tried their pork bahn mi. We also tried the spring rolls. They were both average. Compared to other places around, the bahn mi was on fresh bread which I appreciated. Wish they were open later and offered pho!", "author": "Zoe S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-19", "description": "I was so excited to get a new Vietnamese joint in the hood...but i have to say I was quite disappointed today.  First of all correct the spelling of the Vietnamese sandwich.  It's not Banh My but Banh Mi.  So here's my two cents that I have shared with owners /managers who were very nice and appreciated the feedback:\n-Very small sandwich for the price (if you go to the tenderloin in little Saigon you will get the real deal for half the price and double the portion.)\n-the sweet sauce they use kills the flavor of the duck (I love duck and had the duck banh mi today)\n-the place is very uncomfortable and there is no leg room when you sit\n-the music (annoying generic pop tunes) was way too loud, bad for digestion...\n-the hours are strange, they close at 6pm.  They need to stay open later if they want more business.\n-the inside of the place is a bit cold and uninviting, they need to make it more cozy somehow.\n\nOn a more positive note: it is nice to have an alternative to pizza, burgers and burritos for an affordable lunch and the people working there seem very nice.  Service was great.", "author": "Monkey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Fresh, delicious and reasonably priced. I ordered the chicken breast rolls (rice paper rolls) and received two large rolls, each one cut into three pieces. The filling was generous and the inclusion of avocado was much appreciated! Every item on the menu sounds great, and the banh mi looked delicious. I will definitely be coming back.", "author": "Gemma B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "Decent flavour to the 5 spice chicken Bani mi, but we've had better in DC (where we're from). Good customer service.", "author": "Neha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "The chicken breast Ban Mi is delicious and our new lunch craving. Fresh spring rolls were also very tasty. I didn't care as much for the papaya salad, but that might just be because I was stalking my husband's half of the chicken breast Ban Mi during our first visit there. \n\nFresh and a good deal for the Haight. Please visit DragonEats so they do well here. My lunches depend on it!", "author": "Lisa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "having really nice experience about Vietnamese sandwiches in this spot , their duck sandwich with sweet and sour sauce is killer , little spicy but really yummy , great feeling , you ve got me !!!", "author": "Stan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "The duck is out of this world. The jalapenos give it a real kick!", "author": "Jamie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "I had the five spice chicken bowl. It was fresh and tasty. Unlike most Asian restaurants this one doesn't seem to use MSG .  Good portion size but might feel small for ppl used to supersized meals. Minus two star for cramped seating, no bathroom (or even a place to wash hands), and grossly unkept saracha bottles. Would eat ther again in a pinch....", "author": "R Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Tried the butter chicken banh my and it was delicious! The chicken was soft and tender with a great butter sauce, the bread was fresh and crunchy, and the pickles were just the right level of sweet and sour. Not really a place to eat in as there are only four or five seats, but I was able to nab a seat as it was a bit past lunchtime", "author": "Yuki T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Great addition to the neighborhood. Very fresh and tasty vietnamese classics. I think the banh my is more flavorful than dinasaur!", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Just tried this new vietnamese place on Haight street. Got the grilled pork Bánh Mì with fillings. It was delicious. Great customer  service too. I highly recommend!", "author": "P. C."}
