{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "What an awesome place. We got the cottage pie and the burger and both were quite good. The service and the general ambience were just great and I loved it that there was a fire in the hearth! Definitely coming back here whenever we can!", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Time: 10:06pm\nPlace: Durty Nelly's\nDate: 12/31/17\n\nThis review is LIVE\n\nUnlike the Durty Nelly's one would see on a regular day, the Irish bar right now is raging. Instead of old timers playing bar side GM for the Giants, young handsome men in dressy button downs are drunkenly singing along to Mr.Brightside. Pretty ladies are slinging bottles with skirts and dresses short enough for the occasion. There are carry over christmas decorations to keep the holiday feelings alive, and for tonight only, a party of balloons are bobbing joyfully on the ceiling.\n\nThe alcohol pours graciously from the bar. Big shoutout to the two warriors working behind the counter. Unperturbed from the volume of work and the task of working NYE, their smiles and patience keeps the walkway of Durty Nelly's a makeshift dance floor for the inspired and the spirited.\n\nIt's 10:16pm and group selfies are evident as brief flashes are scattered here and there. Hugs and shaky hands, sips and mouth-to-ear whispers, outside pizza and outdoor smokes. No one seems to understand each other, but it's an understanding fit for tonight.\n\nThe ups and downs of 2017 are forgotten in this one last hurrah. It's a heartfelt way to ring in 2018. Foggy memories and a slight hangover are all anyone will take with them. From one degenerate to another, few experiences are more beautiful.\n\nIt's 10:25, and i'm going to call it a year for Yelp. Thank you for reading and Happy New Years!", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "I'm giving Durty Nelly's five stars because it's our new (to us, since we just moved) neighborhood spot and has something for everyone in the family (specifically beer and veggie burgers for my husband, cheeseburgers and french fries for my son, and fish and chips for me). Yay! \n\nOn my last visit with my son (which happened to fall on Super Bowl Sunday, which I had forgotten about...!) it was understandably loud and boisterous, still I felt comfortable with my seven-year-old sidekick and we enjoyed our intimate meal in the corner. It was perfect! \n\nAdam enjoyed his specially made for him lemonade -- thanks a bunch.", "author": "Camille L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "We went in to watch a college football game & it was the best choice we made. The bartender is really nice, will sit down & talk to you. The food is amazing also. Try the DURTY BALLS!!! Super good!!! Coolest Irish pub I've ever been to.", "author": "Salvador C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "Nice friendly bar with good Guinness (3/5 green stars)\nQuick review today: Durty Nelly's has perhaps one of the most welcoming storefronts (Barfronts? Facades?) that I've ever seen. Bright yellow and blue with window boxes and a red door. Sounds a bit garish but it works. We had Guinness and a few local beers (Anchor, I think, and an IPA), some garlic fries and a cheese toasty with more fries (!). Friendly barman and good atmosphere (although too many TV screens for my liking). \n\nI'm also giving them 3/5 Green Stars for social and environmental impact, based on these reasons:\n* My main problem was that, while Guinness was served in a proper glass, the Anchor and IPA were served in plastic cups (with Bud Light logo). WHY?? Update from owner, Odie: it turns out that they only use plastic on their two busiest weekends (Hardly Strictly and Outside Lands). \n* The barman was helpful in explaining that the curry sauce was not vegetarian, so we ended up with the cheese toasty and fries, being almost the only veggie things on the menu. There's plenty of vegetarian food in Ireland these days, so why not serve more in an Irish bar? There's no shortage of vegetarians and vegans in SF.", "author": "James K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "When friends asked me to meet them here for brunch, I was all :-\\. In all my prior experiences, the food and service were... not good. Despite its proximity, I just didn't bother visiting.\n\nWhen I got there, I was stunned. The menu looked great. The food was great. The service was great. Someone had transformed the place! \n\nThe owners have created an oasis of comfort food and booze. Very tasty, homemade everything, very good value. They work very hard and care about their customers. Good music and local sports on the tube are a bonus.\n\nDurty Nelly's is a gem of a neighborhood bar. So glad they're nearby!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "The lady behind the bar was quite rude and made us feel unwelcome. She was obviously upset about something else and taking it out on customers, unless that's just the way she always is. Horrible!\n\n*In their response to this review they are trying to say that I was mad that I got carded. Nothing like this ever happened. I'm in my thirties, I'm used to getting carded and I've never made a big deal about it. So I don't know where that comes from, unless they are mistaking me for someone else. The reality is that the lady behind the counter was just plain rude and it came out of the blue, and it had nothing to do with getting carded or anything like that. But it shows the attitude, doesn't it? Rather than apologize and offer to make amends, they accuse me of something that never happened. All the more reason not to go back.\n\n**Now the owner won't stop sending harassing messages and calling me names. Boy was it a mistake going in there! I'm surprised they're still in business with that kind of piss-poor customer service.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-05", "description": "This is a necessary dive bar in a mostly Asian commercial\nNeighborhood.  Chess event food in a cozy intimate environment close to beach, so the fireplace helps at night as that breeze blows. If you're in the area, it's perfect - but I wouldn't make it a destination. Service OK.", "author": "Bob B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Favorite local Irish Pub with trivia nights & live music.  Try the  Durty Balls  & Curry Fries for bar bites, Shepherd's Pie or Fish & Chips are also great options!", "author": "Jon R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-21", "description": "Went in for scotch, walked out sober with a pretty expensive tab. The pours were well below standard shots. I would expect more from a neighborhood bar.", "author": "Mase S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Bartender is a fine lad but the full Irish breakfast didn't live up to the hype. Very salty meal, beans are good. The pudding is good. Bread, fries, ham, sausage are all way too salty. Couldn't finish the meal. Irish coffee was ok. Bloody Mary wasn't the best. \n\nThe bar it self is cozy and nice. Would go fork a drink but not for some Irish grub.", "author": "Brandi P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "My first negative experience here was after work with colleagues. We sat down, ordered food and beer, and then when the food and beer came out, they asked for our IDs. At the time, we were all ladies in our mid-20s, arguably pretty young looking, so this was clearly valid and in good practice. However, when he saw our IDs, the bartender accused us all of having fakes so we offered to show him our teacher IDs and a corresponding credit card to validate our identities. He refused and said he was still going to charge us for the beer because he had already poured it, but not serve it to us. What. So we ate, tipped him on the food (why? we shouldn't have since he charged us for drinks we didn't get to drink), and left, vowing never to come back.\n\nFlash forward: I come back. Everywhere is worth a second chance, and the food *was* tasty. So my friend and I order, over the course of a night, 2 beers each and 1 mixed drinks each. We close out. The non-itemized bill is over $60.00. What? We know we didn't drink that much. We ask for an itemized, but the bartender ignores us until we put a card down. Upset that she won't show us the itemized, we tip $6 ($1 per drink, which isn't The Best, but is also somewhat standard). Two days later, I check my email and see a receipt from Square. We were charged for two extra drinks that we didn't order AND the bartender tipped herself a total of $16 (MORE than 20% on a bill that was already over-charged). \n\nTwo strikes, this bar is out. Unfortunate, considering the food is good, the atmosphere is pleasant, and the clientele are *super* friendly.\n\nUpdate: As you can see, the owner threatened me privately because I left a one star review. He made false accusations against me regarding illicit drug use and told me he would send video footage of me drinking and doing drugs to my boss to have me fired. As someone who has never used drugs recreationally, I'm not sure why he thought this was a way to get me to remove my review. \n\nI also have a picture of my receipt, written trying to get a near dead pen to work, and the picture the owner showed me does not match mine. It's unfortunate when a business can't handle a $10 dispute with professionalism. \n\nThe security footage also apparently shows my friend and I drinking \"30 glasses of water,\" which is certainly hyperbole. But yes. We did drink a lot of water because one drink should always be followed by one water. I'm sorry this was viewed as \"belligerent.\" Happy to share screenshots of the direct messages he sent to me.\n\nAlso, please do read my other reviews. I've given a lot of 4 and 5 star reviews for places in San Francisco that I would highly recommend! I even stated in this review the positives of Durty Nelly's. I won't be back, but new clientele is certainly welcome to. :)\n\nDay 29: The $10 still has not been refunded, despite claims from the owner.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Everyone who gives Nelly's less than five stars are just plain wrong.  The bartenders are all friendly, they serve great pub food, and the atmosphere is super good.  Great pub.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "We had a pretty good experience... \n\nAside from the obnoxious 40 something year olds who were congregated by the bar smh. They wanted to be sooooooooo cool so they made sure everyone knew they were there. They were slamming cups and hollering and cursing up a storm -__- \n\nThe owner/Bartender was nice.  He made sure my husband was happy with the tv that was facing us. He played his music loud and sang even louder lol!!\n\nThe food was delicious. We ordered curry fries as an appetizer. I got the Golden Gate burger and Hubby got the Bacon BBQ burger.. patties were moist and flavorful. The fries were perfect and crispy!! \n\nIf my husband were writing this review he'd probably give more stars but I wasn't digging being there. (It was Hubby's restaurant pick)", "author": "Miracle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Dirty balls were great!   Cottage Pie was excellent!  Friendly atmosphere that I would definitely return to!", "author": "Tim W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "A nice, neighborhood pub ... some might refer to it as an Irish Pub but the clientele was pretty diverse when I was there.\n\nMy friend from out of state, an unofficial judge of hamburgers, told my group that theirs was \"one of the three best burgers\" he's had in the U.S. and he's been around.\n\nOurs was an afternoon visit. The food and drinks were all good and the service was very friendly and helpful. I plan to return.", "author": "Gary K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "A fine place for a burger.\n\nDropped in Saturday, October 22, 2016. 12 noon ish.\n\nOrdered the burger combo with choice of cheese: blue, swiss, mozzarella ; comes with fries.\n\nIt tasted damn good, juicy tender and flavorful. The bun was moist and the tomato, onion and lettuce were fresh. Fries were tasty as well. $11.99\n\nAdded a pint of IPA , $6. Satisfying.\n\nMy friend had the chicken strips and said they were good.\n\nWhen I walked in , everyone turned around and stared at me; a few seconds later, my friend, a cute blonde followed up and everyone turned back around. Just telling it like it is.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Amazing place!!! The music was awesome and the environment and atmosphere was great! If you are looking for a relaxing but fun place I would recommend this place, great people to be around.", "author": "Kat H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "New to the neighborhood and was made to feel right at home at this cozy little pub. I enjoyed some beers and a delish grilled cheese and tomato basil soup. I'll definitely be back.", "author": "Tara R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "Stopped in here after spending the day at de Young museum in Golden Gate Park. I heard the Sunset has a contingency of Irish bars and wanted to check one out. We initially stopped in for a drink but ended up eating too. I had the cottage pie and my girlfriend had a veg burger. Both good. What we really loved though were the garlic fries we had as an app. In total we had three beers, an app and entrees for about $50. Not bad for SF. Bartender was pleasant and decor was what I would expect from an Irish Pub along with a cozy fireplace. I'll stop back in when I'm in the area.", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "I've gone to Durty Nelly's for years and have seen the same blonde woman working the bar every visit. She is never the friendliest but from this most recent visit her behavior was not only RUDE but also outright WRONG and ILLEGAL. We paid our bill with no tip due to the level of disrespect we received this time and found out days later after looking at our card statement that she ADDED IN A $20 TIP FOR HERSELF AFTER WE LEFT. How drunk did she think we were?! Yes it's only $20 and boohoo she must be frustrated with her job but she CANNOT ADD MONEY IN TO A SIGNED BILL. Thankfully the bank voided this charge altogether but I'm writing this review as a WARNING to anyone else who goes here.", "author": "Cassandra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Looked liked a good place for a bite after hanging out in the Haight all day. Place is cozy with a fireplace going and a few booths along the wall opposite the bar. Owned and run by Irish it's worth the trip for the ambience and definitely for the food which is a mix of American and English and Irish fare. The menu sports bangers and mash, fish n chips, mincemeat pies and nice huge burgers. The special when we went was pork chop dinner. We had the Durty Balls appetizer (yummy), Cottage Pie (screaming good), and the fish n chips (perfect). It looked like everything was good, it was hard to decide what to eat. We will definitely be back.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "This place is a true neighborhood gem. \n\nFood is great. Beer selection is good. Booths are cozy. It's our favorite place to spend a rainy Saturday afternoon.", "author": "Caitlin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "Was looking for a place to get some food on a Sunday afternoon and Durty Nellys had good reviews.\n\nFood: 4/5\nI ordered a Nellys burger and it was pretty big with a decent portion of fries (which were super crispy, just how I like them!) My friends ordered the fish and chips (which were two HUGE pieces) and chicken strips. Taste-wise, it's good but nothing mind-blowing. \n\nCustomer Service: 4/5\nWaitress/bartender kinda took awhile in the beginning but was nice. She also let us know ahead of time that she'll get busy once it's crowded (she was the only bartender on shift) but we should feel free to come and order at the bar if we need anything else. \n\nSeating/Cleanliness: 5/5\nWomen's bathroom was very clean! Dining area was also nice - we ended up with 8 people sitting around a booth and we all fit pretty comfortably!", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Came here to watch game 6 with some friends. Bartenders are awesome and drinks are cheap. Great atmosphere! Food was good too, only sad thing was that they ran out of fish for fish and chips but other than than, would highly recommend", "author": "Emily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Pub food was something my friend couldn't stop talking about so I decided to go with him to an Irish pub since he kept hyping about their fried food!\n\nATMOSPHERE:\nThe pub had a very pub feel to it. We decided to sit on the bar. The place was dimly lit which kind of bothered me at first but got used to it. There were some tables and some booths. What I liked was that there was a fireplace and they lit it during our stay.\n\nFOOD:\nWe ordered the curry fries and the durty balls.\n\nDurty balls: 4/5 - I thought these were amazing! It's mashed potatoes in a shape of a ball and deep fried. What made it taste better was the sauce that it came with. I failed to identify it, but it had a bit of a spicy taste.\n\nCurry fries: 5/5 - Their fries were amazing! With and without the curry. It had so much flavor I highly recommend getting this!\n\nI also ordered a Guinness, which was very smooth. It was a bit bitter, but smooth. As someone who prefer sweet drinks, this was totally manageable. It got worse towards the end though so I stopped drinking it.\n\nCUSTOMER SERVICE:\nThe service here was average. I was going to rate this place a 3 but the food definitely compensated for it. The guy in the bar just didn't seem like he liked his job and he seemed annoyed that we kept asking for things which totally brought the vibe down.\n\nWould I come back here? YAAAS! Would I recommend this to a friend? YAAAS!", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "This is a good pub, nice and quiet. We had the fish and chips and curry chicken chips. Both very good. Small portions but still filling. I would definitely recommend this place for a good small bite. Also very good for watching sports!", "author": "Genesis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "One my favorite dive bars in the area. I do go to this bar often and it's always a good idea.Very friendly crew and awesome food. I definitely recommend the dirty balls and any of the burgers as well.", "author": "Yas J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-03", "description": "They don't have chicken strips anymore - it's now chicken bits (mini nuggets). Too little food for $10 and the fries were very soggy.", "author": "Olivia H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "Always have enjoyed this lively place for karaoke night.. However I was disgusted to see an extremely racist photo posted near the men's bathroom. It is an old school photo of a white baby eating bread with an Afro baby clearly begging for the smallest piece himself. \n\nCome on now!! Even if it's a \"historic\" piece of art, it represents a racist ideology and a time period of blatant Jim crowism.. Today we live in a world where the legacies of slavery are still present and having this racist photo up in a bar in SF of all places is completely unacceptable.\n\nI will not be giving any more of money to a bar that promotes the institution of white privilege.", "author": "Marry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Stopped in this gem after work on a Tuesday afternoon. Nice community pub to wet the whistle and such. Great staff, great cliental and would recommend this place to watch a game for sure. Also, they have a fire place that actually works! Real wood, real fire burning! Smells like home!", "author": "Paul G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "I can't believe it's taken me this long to write a review of this place. No seriously. I'm not joking... \n\n10 years ago my now husband and I were looking for something to do in San Francisco. We had just move to the outer sunset a week before we stumbled upon this place. Our first interaction:\n\nGuy gets kicked out of the bar. Lights up a smoke and we walk in. Not 3-5 minutes later comes back in and orders a pint. We look a little puzzled but went with the flow. The guy that kicked him out said \"he just needed to cool off\". From that point we were intrigued. Not knowing it was a cash bar we ordered beers and shots. At the end of the night they said it was a cash bar and as my husband was going out to the ATM, the bartender said something we had never heard before in the history of bar hopping. \"Welcome to San Francisco your drinks are on the house\".  We had at least 3-4 shots with beers. \n\nFrom that point on we were loyal customers and going out almost every weekend, we got to know the owner and the head bartender well. There were nights that were just crazy there and then there were nights where it was a nice chill environment. \n\nThe one thing that sticks out to me the most was at the end of the night everyone sings the Irish national anthem and somewhere over the rainbow. I hope they still do this because it was an awesome tradition and one we talk about to this day. \n\nOut of all the restaurants and bars we visited this place sticks out the most with some of the best (and worst) memories. I'm glad this place is still going and I may have to come grab a pint again my next trip to SF.", "author": "Chrissay z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Interesting and friendly place. But watch what you order, it adds up quick. A couple burgers and beers will set you back about $40, which might be a surprise.\n\nLamb burger was very tasty, as was the regular cheeseburger with bacon. But the outstanding thing here is their fries- just amazing. Hand cut and cooked perfectly.", "author": "T J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-04", "description": "I dropped in here with a buddy last night for a drink and ordered two Makers Mark manhattans. It took a few minutes for the bartender to notice me (it wasn't that crowded). Wasn't the most friendly service nor welcoming to a new patron. To be honest, it was a nice little Sunset neighborhood Irish pub and a nice atmosphere, but I had to admit that I didn't feel particularly welcome in here last night. The manhattans were ok other than the pours of both drinks were uneven and light (in my opinion). It was an almost all white clientele in a heavily Asian neighborhood. Just an observation.", "author": "Norm D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "There are three places I've been going to in the city as long as Durty Nelly's and none with such a warm place in my heart. \n\nMy co-worker met her husband here. My uncle came to the bar that was here in the 80's. I've escaped here more times after Midnight Mass, Bay to Breakers or Outside Lands than I can remember.\n\nI've had more close-calls, lock-ins, missed-connections, epic adventures and nights I'll never forget (although my liver might prefer to). \n\nIt's home. It's a party.  It's a friend (love you Odie). \n\nIt's everything you ever wanted and more, and what's best, the location eliminates the Marina D-baggers, Mission Hipster-WannaBe's, Tech-no-brats, and Bridge and Tunnel (yes, we technically have ONE tunnel and of course, it has a rainbow over it) crowd.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "I walked into this place with my friend on a whim because it was freezing outside- it was incredible - there was a crackling fire, and Christmas decorations -it seemed like everyone was Irish too, I felt like I was in Dublin ! I highly recommend their Irish coffee - they have homemade whip cream and don't skimp on the whiskey , even the bartender was drinking one", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "Needed a place to catch up with a buddy, we decided to skip the typical boba thing that is prevalent on Irving in favor of a cold beer. Knowing of only one place in the area, I walked over to meet my friend in front of Durty Nelly's, a staple dive in the Sunset.\n\nI got my regular, a snakebite, which didn't seem that common or popular in this bar as the bartender had to confirm with me that I wanted the Guinness and cider version. I know some like it made with different brews, but this version is definitely my favorite. Luckily they had some cider available and I could kick back with my favorite cold one and do some catching up and talk shop.\n\nThe bartender was super friendly and it's a fun place to hang out and enjoy a beer during downtimes, but not the quietest place once things pick up. Prices are reasonable though there are certainly better deals. It's a welcoming place at most hours so I'd definitely recommend it for a good time. Stop by for a pint!\n\nFood: 7/10\n\nService: 8/10\n\nPrice: $\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Love this place. Great food and entertainment.\nThanks Odie and Carolina for all the good times,\nBest Irish bar in SF by far.", "author": "Julio J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "Perfect Pint alert: one of the best Guinness short-line taps in the city yields a memorable pour.\n\nDurty Nelly's is a delightful reminder of the Sunset's Irish heritage! Friendly, fun and the perfect place to watch the game. The activity level in the well-worn bar can range from quiet (Sunday afternoon) to off-the-hook-why-is-this-bearded-stranger-hugging-me raucous (Sunday afternoon with 49ers or Giants in the playoffs).\n\nBartenders and wait staff are attentive and dive-bar efficient. Food is standard bar fare and it's good!", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Fun Karaoke on Thursdays, they're very close to the park so they make a great pit-stop.\nFood is great, especially the burgers and fries. Ill have to come back on a Wednesday for trivia, sounds like fun. \nEdit: I tried their food special, pork chop dinner. SPECTACULAR!!! Kudos to the chef making such great food in such a small place.", "author": "Cliodhna R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Bartender with multi colored hair never looked up in the 5 minutes it took her to make 4 drinks.  6 new patrons walked in during that time, she never asked who was first, just helped the most convenient customer closest to her..  Had to walk out, doubt she even noticed.", "author": "Bill G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-06", "description": "Food was so-so.  The full Irish breakfast had squishy white-bread toast, French fries and a dollop of out of the tin beans, the rest was fine though the serving was rather small.  Fish and chips prepared better but still small portion for price.  Oh, well - live and learn.  Looking at the other reviews most of those folks may have been ossified and most things are good in that state.", "author": "Mariah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "Great neighborhood pub. Trivia on Wednesday nights and karaoke on Thursdays. The bartender is really nice and fun. Great place for a drink or two or to catch the game!", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Home of the \"Lamb Burger\"... As soon as I saw the place from the street where I parked, I was drawn to it :) There is a sign hanging on the outside above the window says: \"Come in a stranger, leave as friends\".... And they mean it! I had lunch there. \"Lamb Burger\" by the cozy fireplace... I loved it. Don't miss out on this place and the Lamb Burger they offer here, if you are in the area...", "author": "Oya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-01", "description": "Small Irish Pub.   Smallish menu.  Mostly burgers and hot sandwich selection.  Burgers were very good.  A generous portion of delicious french fries came with the burger.  We seated ourselves next to the door since it was the only table available.  The man checking ID's smoked right outside the door and the smell constantly lingered in during our stay.  Otherwise it was a pleasant experience.", "author": "Dennis J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Came here for late night snacks and drinks. Great atmosphere and loved the warm and cozy fireplace. I had the curry fries, and it was delicious. A little on the salty side but pairs well with beer.", "author": "Chrisy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "There are a few times in life when you just haven't eaten all day long and then you have a big fat hamburger w fries- the original hamburger. \nOrder it. Thats all I have to say. It's only $10\n\nThe Moscow Mule? Not so great. Get a beer instead", "author": "S L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Classic place! \nGreat little hole in the wall Irish pub. Limited tap selection, but it has the basics to pair with the burger and fries. If you're looking for a cozy booth and great pub food to catch up with good friends, this is the place! The original burger with mushrooms, jalapeño, medium rare- delicious!", "author": "Shelby B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "This place sure is cozy - they even have a fireplace going all night! It's a tiny little nook out in Outer Sunset. It has a nice dark, warm appeal to it. There is a small bar area and a few tables. I came in with a big group but we were able to pull a few stools and crowd around one of the booth areas. \n\nDRINKS\n-Irish Coffee. Good size of warm coffee + whiskey. \n-Snake Bite cider/beer blend. I've tried this once before and noticed they had a sign up for it at Durty Nelly's. Crisp, refreshing, and easy to drink :)\n\nPROS\n-Good for medium sized groups!\n-Not too crowded since it's all the way out in Sunset", "author": "Grace J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "Terrible service. Its a \"no tip no service\" bar or so the female bartender says.. Very rude and everyone trys to fight each other in this bar", "author": "Joey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-04", "description": "Durty Nelly's has undergone an ownership change. long time bartender, Odie, has taken over ownership. saw the \"perfect pint\" guiness claim after i asked him if the guiness was any good. YES!  Odie showed me the short lines from the beer keg to the tap. long supply lines dilute the brew.\n\nperrused the menu: burgers(lamb too) , fish  & chips, chips, and irish entrees are all in da house..\n\npour: guiness(6)\n-twas a perfect pint,\n-even the foam was tasty.\n\ndrips:\n-irish and chinese people go back to transcontinental railroad days (1863)\nrailroad connected east and west coast, trip took 6 days instead of 6 months overland. \n-reported 1200 chinese deaths(dyanamite and avalanches) and 100+ irish deaths \ndisputed by Central Pacific historians.\n-Odie has a pleasing irish accent.\n-bar is small with a few tables and a long bar,\n-many flatscreens\n-just a few draughts.\n-cool ambiance.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-02", "description": "Chill Irish pub; friendly staff and I like the decor, even the bright yellow paint of the building's outside! Seems like the perfect little neighborhood bar.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Came here for dinner at the end of a long day spent in Golden Gate Park.  Very chill place, no nonsense service and food.  Drinks and food came quickly.  I got the Moscow Mule, which was alright -- a little heavy on the lime but still good.  Ordered the Nelly's Burger, straightforward cheese and bacon burger, also good.  Ketchup at the table tasted like it was made with wine? Also good!  Shoutout to whoever was queuing up Hot Hot Heat songs on the  jukebox.\n\nWould come again!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Great, friendly, no-nonsense bartenders.\nDelicious, juicy, reasonably priced burgers.\nChips could be a bit crispier but tasted delicious with a dash of vinegar.\n50 cent wings on (I believe) Tuesdays?!\n\nYes, yes, yes. Good solid Irish pub to mind your own business or rub elbows with your neighbor. I also really enjoy the fire place burning away and the big booths all up against the wall. They also have 5 large TVs which makes it a prime spot for Giants games- just gather some buds, a booth, a burger, a brew, and BAZINGA *", "author": "Sophie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "Craving a burger lunch in a cozy pub, we made our way to Durty Nelly's. Upon entering, we were greeted with a friendly hello by the bartender. She was welcoming and helpful and handed us a couple of menus letting us know that she could come around to us if we wanted to have a seat at one of the booths, or we could order at the bar. We opted to save her the trouble of walking around to us and ordered directly - a couple Guinnesses, a burger and a grilled BBQ chicken sandwich (requested without the bun). \n\nI was impressed there were *five* TV's - three were above the bar, one above the back of the pub, and one above the front area - I figure they're gearing up for the Big Game tomorrow. \n\nOur food came out in good time - the burger tasted fresh and delicious and came with a decent amount of fries. My grilled BBQ chicken sandwich also came with fries and was crisp, tender and lovely. Good sauce.\n\nThis pub has a convivial, locals vibe where folks of a broad range of ages (over 21) mix and mingle. When we arrived in the early afternoon, there were a small handful of patrons and a nice crowd gathered shortly after.\n\nDurty Nellys - a pub with good food, drinks and merriment!\n\nIf you're curious about who Durty Nelly was in Irish lore: http://www.durtynellys.ca/who-was-durty-nelly.php", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-05", "description": "The durty balls are good mashed potatoes. The burger was good. I've seen better Irish pubs before. The bartender was attentive and nice but the girl who delivered the food was extremely rude.", "author": "Will D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "What the? After reading all the great reviews on Yelp, I decided to try the food here. I wasn't expecting much, but I was clearly wrong. The burger I ordered was, if not exceptional, truly excellent, and far better than I might have expected from a neighborhood bar. In particular, the meat was flavorful and perfectly cooked. I'm not much of a drinker (exactly what, then, was I doing in an Irish bar, you may ask), but the Guinness we shared was fresh and Guinness-y.\n\nThe service, I have to add, was  -- let me just describe it as \"matter of fact\" -- with a bit of East Coast attitude (\"I might be your friend for life, but first you gotta prove you're not an a-hole\").  I liked it.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Worth it! 3days before st Patrick's day and we're in an Irish pub. Food didn't disappoint we had the beef and Guinness stew and the Durty balls. Guinness and lagunitas ipa on tap. Bartender was super friendly and the tiny place was pretty damn busy. Go!", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "What a fun place. Great little fun bites that were so much fun to try with my kids. Favorites were curry chips and battered sausage. People here are so friendly. Loved the experience. Have to try it.", "author": "Tam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "It's refreshing to walk into a bar and automatically want to cozy up in their welcoming booth seating, situated right by their charming fire place (which was unlit at the time). Durty Nelly's is a real pub  - bursting with character and hospitality. There are no loud garish TVs mounted on the wall here. The place has a rustic feel about it and is decorated accordingly. The place isn't dim or dismal - and instead the lighting is warm and refreshing. The bartender is genuine and personable.\n\nYou can actually hear yourself speak and while we were too late to try their food menu - their curry chips are lauded as a winning dish. Not too late in the evening  - a beaming bachelorette party stumbled in and even offered up slightly obscene cupcakes to us and the bar staff.  One of those rare moments - where women by far - out-number men at a Sunset pub.\n\nI was on a quest to discover a bar/pub in the area that truly resonated with me - and Durty Nelly's was the true standout. Intimate and unassuming. Pure delight for a mellow Sunday evening.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "I love this place.  Authentic Irish bar with a fantastic vibe. Although I'm not a irish, they make this Asian porkster feel at home. Good simple bar food. I give this place two curry fries thumbs up!!", "author": "The Chubby Asian .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Awesome food and really nice employees. My favorite part was watching a 50 year old drunk woman repeatedly drunk dial her ex. Very fun place!", "author": "Julie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Pretty much the best pub in the City! It is in the Outer Sunset, so, it is freezing a lot of the time. But they always have the place nice and warm with the fireplace and the food menu is pretty delicious. I have never had a bad experience here!", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-23", "description": "Easily the most random and strange night of my life.\n\nMeet up with 2 friends from decades past. Decide to get a beer. Can't find parking (SHOCKER) in Lower Haight, or anywhere within a 10 block radius. Decide to drive... and just keep driving. Debate getting 40s and drinking them on the beach. Nixed because we're too old. End up parking in the first available spot surrounded by tiny restaurants selling bubble tea and noodle dishes. Eh? Where are we?? \n\nStumble upon a bunch of smokers. Decide we must be at a bar, especially when we see the Irish flag waving in the foggy breeze. What divey-dive of all dives have we here?? So durty it's spelled with a \"u\"?? How wonderful!! We got a table smack in the middle of the fray and ordered a few brews. A long-haired man in sandals was wailing into the microphone, playing jams on his guitar that included \"Purple Rain,\" \"Proud Mary,\" and John Mellencamp. The crowd was a mix of college girls (high school girls?), sloppy too-old-to-be-frat-boys, PDA couples, and elderly drunks who may or may not come sit at your booth. Some people danced. Some had their dresses accidentally tucked up into their panties after visiting the loo. Others spontaneously bust out with what appeared to be choreographed tap dance moves up and down the length of the bar, even when the guitar player was on a break.\n\nSaid friends and I sat in our booth - sometimes pinned in, other times simply afraid to leave - laughing 'til we cried at the show that unfolded before us. \n\nSometimes a dive is just a dive. And then sometimes it's Durty Nelly's, and you're planning an Anniversary Date for your return.", "author": "Ray J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "What a great spot! Dingy enough to be a rustic Irish pub, and clean enough to feel comfortable eating their delicious hamburgers (best in the Sunset, hands down!!). If I'm craving some me time with Guinness, this is where I go.", "author": "Matthew F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "Lots of locals....  commence with the drinking, arguing, yelling, dancing on chairs, etc.\n\nDrinks = beers, beers and some hard liquor.  I stuck with their beers... and a car bomb.  lol  \n\nCash only!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Durty Nelly's has been the local bar I've been looking for forever, great burgers, drinks, and they show MotoGP!!! Been coming here months: love the music, atmosphere, and vibe. Looking forward to my next pint.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-11", "description": "Terrible, rude bartender. Came in for a burger at 10 and got kicked out. Maybe I just got unlucky, anyways I'm not coming back.", "author": "Sydney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "I really liked this place. I don't suppose there is really anything special about it, but it feels like home. The service is friendly-but busy; there is only one bartender on at a time and the bar gets pretty full, but you still don't have to wait very long. I feel like most people need to learn a little patience anyway.\n\nOrder at the bar and bring cash. There seems to be a few traditional items that aren't on the menu so don't be afraid to ask what they're hiding back there. I got a burger and it was delicious. It tasted exactly the way a burger should. I can leave satisfied on that alone.\n\nAt the same time, the Guniness was good, a solid 8.5/9.0 out of ten. The bartenders on the other hand... well I just have one thing to say about them... they were great! Rory and Carolina will get whatever you need with a smile. Don't be \"that guy\" anywhere you go, though and remember to enjoy your night!", "author": "Jaime W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-16", "description": "I really wanted to like this place.  I really did.  The service was good.  The ambiance was, well, drab, dreary, dull.....and always with that ONE oddball at the bar, that looks as if he didn't take his meds this week.\n\nBut after a couple of visits now, I just can't get into it.  The chicken curry with fries is okay, but when you get a few bites that taste like industrial cleaner, you just wonder wtf is up in the kitchen.  Maybe I just got spoiled with all those terrific Irish pubs in Northern Virginia.  Big, clean, great food, ambiance, decor and vibe.  Not to mention a plethora of draft beer selections.\n\nOh well, at least I gave it a try.  Go check it out and decide for yourself.", "author": "Anthony D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-27", "description": "First time here and the bartender was really rude and completely rushing our order. Bad first impression but hopefully next time will be a better turnout.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-02", "description": "Looking for a place to with a Cheers vibe where everybody knows your name? Well durty nellys is the place, where people are friendly and drinks are cheap & simple. The food here isn't too bad either. It's pretty clean for a dive bar and the bartender is always cool. There's usually an obnoxious drunk hanging out at the bar but they are harmless and the bartenders are good about regulating them. Great place to just hang out with some entertaining people watching.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "A neighborhood institution with hilarious Irish people, trivia and karaoke to keep us entertained, and good food when the kitchen is open.", "author": "Carrie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "I have yet to find a bar in SF with such reasonable prices.  The crowd was an odd mix, but I loved it.  \n\nDO NOT come here if:\nYou'll be offended by an old drunk guy humping your leg\nYou expect to meet hot models in heels\n\nDO come here if:\nYou're looking for just some nice people who don't give a f*ck about anything other than having a good time.", "author": "Michele S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-15", "description": "Really lively place with a lot of room to dance. Kitchen closes at 9:30pm, so I can't say too much about the food. It's pretty much always busy here, so you'll be standing at some point. Tap list is short, and they've got your standard liquors. Fake fireplace is going, a few tvs are on. It's definitely a place in the outer sunset that stands out because every other place is closing at 12am due to serving food along with alcohol, or it's a dive bar. Service is friendly, and you can get drinks pretty quickly here. This place has karaoke on some nights too. They used to have trivia night, but I didn't see any indications of that when I went last night.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "Excellent place. Had the Steak & Kidney Pie special which was delicious. It's only two blocks from my place, and though I don't go there often, I always see it alive and buzzing with people. \n\nCozy atmosphere, very friendly service. \n\nHighly recommend!", "author": "Tim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Love this place.  Great people.  You can't beat the location in the high outer Sunset.  The fireplace is a marvelous bonus. Food awesome.  Unlike so many pubs in America, you don't need to be drunk to appreciate it.  Neighborhood feel.  Real Irish. Real. Period. Curry and chips!", "author": "D.J. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "So a few months have passed and I've visited a few more times... and Durty Nelly's has continued to be AWESOME.\n\nBut could you possibly be more awesome?\n\nYES.  YES, YOU CAN!\n\nAnd how do you ask?  By introducing me to the lamb burger and a nutty Irishman.  The lamb burger smells intoxicating to the point you just want to sit there with it and not ruin the moment by eating it.  Alas, starvation kicks in and you take your first bite and it's like a gyro perfected in burger form.  DEEEE-LISH!\n\nI came in a naive Sunset-er and learned the deliciousness that is a Nutty Irishman (which the bartender was kind enough to introduce me to the shot and the drink... both delicious!).  And if you're not in the mood for something creamy, a black and tan will go just fine with that tasty burger!\n\nCONTINUE WITH YOUR AWESOMENESS THAT IS THE LITTLE BAR ON IRVING STREET AND GO VISIT!", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-08", "description": "Super fun, small neighborhood bar. \n\nLoved the vibe and the food! \n\nCame for the Niner's/Seahawk's game a few weeks ago and everyone was super excited and it was def a fun lively crowd. \n\nOrdered the fish n chips and they were delish! \n\nWas kind of difficult to order, but it was a crowded day. Come early on game days to ensure a seat! :)", "author": "Alison N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "I love this place. It is close to where I live and everyone is very friendly. I like the atmosphere, the drinks aren't overpriced, and they have fun things going on like karaoke. On a weekend it'll be pretty crowded, but in a good way. It's warm and inviting, and I love the new paint job as well. Haven't actually gotten a chance to come here in the \"light of day\" and try the food, but hopefully that's next!", "author": "Elise S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Great bar! Every other Tuesday night, they have a folk music night and my friend played the fiddle. The music is great and the group is really good! They were also playing the Australian Open on 4 out of 5 TVs. That's a win for tennis in general! The bartender supported my extreme fandom of Rafa Nadal and kept refilling my water to cool me off during the close match of 2014 against Dimitrov. I love a great bar, with great tennis, and a fabulous bartender who also knows his tennis! The beer selection is good and the bar food is also delicious. Now if only they took card...\n\nThe bar is very cozy for bar seating or restaurant seating. There is a fireplace to make you feel right at home. It's especially nice during those cold SF nights! The N-Judah stops right in front of the bar so you can always jump right on the N after a good night of drinking, sports, and music :)", "author": "Leena B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "Their Durty Balls are delish! Deep fried mashed potatoes with corned beef and cheese! So good. Also had the burger with really good fries. The burger was cooked the way I liked, it wasn't bad and it wasn't amazing. Also tried some fish n chips, which was made with good fish. The curry tartar sauce tasted fishy in a weird way, much better to not use that sauce but other than that it was good.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "-got an update from someonefrpm the pub and found it very professional so I'm giving them back a star. It's not their fault that some people are drunken idiots. I will have to say that they need to filter out the crowd that tries to come in.-\n\n\n Came here on St. Patrick's Day. The bar was nothing special. A mini pub with no character...the crowd was... subpar and honestly DIRTY.\n\nPeople were falling over each other, a girl fell off a booth and knocked down a table... this place had crazy written all over it. I guess when you come on their most \"prideful\" day of the year, this is what's going to happen.\n\nStill, the bartenders were authentic and fun and the decor was true to an Irish pub. Come here for a quiet drink on an off day.", "author": "Hemang S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-25", "description": "Place is okay, but certainly been to better. \n\nCame here on my birthday because I wanted to drink. Figured, might as well eat dinner here too. So we walked in, 3 Chinese guys into an Irish Pub and of course, everyone started staring us down. \n\nPlace is a lot smaller than some of these pictures would lead you to believe. There a booths but seemingly no servers so everything has to get ordered at the bar. Bartender told us to make the people at the booth behind us leave because we were eating....lol. We waited until the food came out (about 20-25 minutes-ish) before doing so. \n\nBangers and Mash...looked pretty mundane but my friend gobbled it up with no complaints. Shepards pie...potato overload. Along with the mashed potatoes normally on top of it, they gave me a lot of fries with it too. Pie was tasty though. Peppered steak....yikes. Tough steak, friend couldn't take it anymore but he liked the sauce. Garlic fries....was okay but was the first garlic fries I've had where it was actually bitter if eaten naked. Needs ketchup badly. \n\nBest part of the night was our encounter with what my friend could only describe as a \"happy racist\". Could tell he was a regular and was well past drunk, after his friend left he decided to talk to us. Took one look at me, asked me if I was a samurai....lol. Then he called us Japanese because we don't have Chinese eyes. After that he mumbled a lot with his Irish accent and we couldn't make out much of it. \n\nDefinitely an experience and I could see coming back for a pint and to watch the game. Nice part is it's past the part of the Irving that usually is super busy and so parking was not much of an issue. So what did I learn here? \n\n- I am a samurai. \n- My friends and I might be Japanese. \n- The Irish are funny when drunk. \n- Tough steak. \n\nGood times, not great, but hopefully they do better the next time I stop in.", "author": "Alfred D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Great little local, good crack and 'Gator games on the telly. We were visiting San Francisco, and friends dragged us out to the Bluegrass festival at Golden Gate Park. At four, we sprinted across the polo field, desperately seeking a sports bar. Apparently, there are a few Yelpsters in San Francisco, and they led us to this little outpost", "author": "Tom Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-29", "description": "I pick Brendan on my team for whatever...drinking, fighting, even dodge ball...he's one of those cool guys that just gets along with everyone.\n\nWhen I walked in, I felt like I was transplanted to Farrington's Pub in the Temple Bar district of Dublin.  I heard lots of \"Slainte\" and \"What's the craic\" being tossed around, and that's how I knew it was a traditional Irish pub.  Irish music also plays at night, adding to the atmosphere of old Dublin.  I hear the burgers are not to be missed, and I'll be hitting that up on my next trip, along with a dozen pints of the black stuff.\n\nIrish Pub in the middle of Irving's Chinatown...yeah, it fits, and if you have a problem with it, bring it up to Brendan.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "Love this place. Makes me wish I still had thursday nights off so I could hit up the karaoke scene once more. Bartender is a nice lady and Ken, the KJ, is great.", "author": "Alexandra R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "Fun little bar I recently get to know from friends and not too far from my neighborhood . We went trivia night on Wednesday and it was a lot of fun.", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "My girlfriend and I were out on one of our weekend walks in Golden Gate Park and decided to venture out into the Sunset before we headed home, thinking we may find someplace nice and new to have dinner before the week started. We almost walked by Durty Nelly's but I pointed it out and we headed in. \n\nI instantly loved the ambience of the place. There's a TV, lots of dark wood, and a fireplace that wasn't lit when we were in, but Sunday nights are pretty slow and I hear it's on most of the time (it looked like it was, too). I grabbed a Guiness and she a cider, and we grabbed a table and ordered almost immediately. The service was great and incredibly friendly. \n\nThe food was phenomenal. My lady had the fish and chips and I ordered the Sheperd's pie. I've been thinking about Sheperd's pie since we had it back in Maine over the summer, and have never just up and looked for a place to find it or even ordered at a place that did serve it. So glad I decided the bite the bullet and try it, because I absolutely cleaned my plate and could probably have done another (because of how delicious it was; the portion size was perfect). Overall, I'm looking forward to going back and trying the rest of their menu, and maybe even getting cozy by the fireplace in the near future.", "author": "John T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "You know that treehouse you always wanted as a kid? Where you could hang out with your friends, chat, be silly and get up to no good? That's Durty Nellys! \n\nExcept with booze....and trivia, and karaoke, and live music.....random out breaks of sing-songs and dance parties....And,well, booze. \n\nGreat bartenders, really delicious food, and did I mention booze?? Seriously, it's...what do the kids say these days?...It's \"the bomb\", it's \"hella cool yo\", it's \"totally rad!\" And I kid u not, they serve....great food....(you thought I was gona say booze)", "author": "Allison F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "Loved Durty Nellies. My wife and I were driving to the airport after a fun weekend and decided to have lunch near Golden Gate Park. Looked on Yelp and found DN.  It was a Sunday afternoon so it wasn't too crowded but I think we were the only people of the 12 or so in there that didn't have an Irish accent.  The bartender was great. The food was above average for a pub, got the Nelly burger.  Very good burger, couldn't get enough of the garlic aioli. Awesome spot.", "author": "Patrick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "I come here for Trivia Nights every Wednesday. It's a good ole time. Never packed, but still really lively. The bartender is very attentive and gets your order quickly. I like that about the place. Drinks are also pretty cheap, so I can get tipsy without hurting my wallet. The food seems good, I've never gotten anything, but it looks decent.\n\nTrivia is cool too. It gets progressively hard each rough though. I like that it's not crowded and that I can hear each question clearly. My team has won second place several times, which is pretty cool too.\n\nI like this place for the ambiance and that it's not too crazy packed, even on a trivia night.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "I had a great time; no wait besst time at this Irish bar, I recommend you go to trivia night on Wednesday. It is a lot of fun, the bartenders were cool and the beer was cold.", "author": "Brandon P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "Sliders are equivalent to Fuddrucker's. Yum yum good with beer, laughter, music and good company. \n\nThey have a fireplace here which makes it homey like.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-20", "description": "I want to like this bar, I really do. The ambiance is lovely and it has that authentic Irish pub feel. But it's WAYYY too small so it gets crowded fast and hard to get a drink.", "author": "Anastasia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "Freaking sliders- some of the best around. Only better is homemade or Fud Ruckers. \n\nGeneral side salad with vinaigrette is SO good! The garlic dressing is def garlic-y so women/men be careful.\n\nBLTA- solid, proportionate. Next time I'm going to request no garlic aioli. Too much for this sando. Reg mayo will be better.   \n\nCurry fries, everyone is curious about them, they're good, I love curry, and I love fries, but not together. \n\nService- so friendly, so helpful. Owners are Carolina and Otie. They are Irish and they do a fantastic job at tending bar. \n\nWednesdays have trivia and Thursdays have karaoke, both are phenomenal. \n\nAtmosphere- hard to beat, good vibe, people sing dance and act a fool without being obnoxious. \nWhen watching major sports games you can usually find a nook to call your own. Not a possibility at Underdogs up the street. \nThe regulars like soccer and Irish football, so we baseball/football/basketball fans are lucky here. \n\nRestrooms are TINY, and not all that clean.", "author": "Kortni S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "Charming Irish pub. Low key, great atmosphere. Love the fireplace!", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "Nifty little spot .. cosy, small ... New food menu looks good - I will try it soon.  I love Trivia night there.  Bartendar very friendly ... One thing, please turn down fire or open window ... it gets so overheated.  Especially when crowded - and a 'crowd' in this small spot is about 20 people.  It was painfully & uncomforatably warm there  last Wednesday.  I melted.  \n\nOtherwise, great spot .", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "Came here on St. Patty's Day. It was the first Irish Pub we've been in. I was with two of the most obnoxious, awful human beings this city has produced. We even placed bets on who would get beat up first. Ironically, the only person we (and when I say we, I actually just mean Obnoxious Friend #1) pissed off was the only other Asian guy in the bar.\n\nAnyways, lively, friendly crowd that just want to have fun. It had all the characteristics of an Irish Pub that I've imagined, WITH FISH 'N' CHIPS!\n\nNot going to lie though, I was a little disappointed by the fact that a big, angry drunken Irishmen didn't beat up any of my friends. I guess there's always next year...", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "What I have to say is simple. You want an excellent hamburger? Durty Nelly's is the place to get it. And I don't know how they do this: I always ask them to make it medium rare and they do. How do you do that? I've never been able to figure out how. Lucky for me I live almost right across the street from them. I was doing last minute taxes, was completely stressed out, depressed, headache and sick to my stomach. My wife said \"go across the street and get yourself a hamburger\", so I did and now I feel much better.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "As a Briton I was a little unsure about this Irish pub, since most of the pubs back home that call themselves that are just using it as a way to weasel out of doing good food or drink. I was very pleasantly surprised to discover an actual, honest to God pub just like they have back home. If you read the part of the menu \"Nelly's Favourites\" you wouldn't be able to tell you weren't in Ireland or Britain enjoying a meal at your local.\n\nHowever, I came here on a friend's recommendation for the burger. I had Nelly's Burger which was fantastic, with good meat and garlic mayo and real bacon. The fries are pretty damn good and the half pint I had went well with my breakfast.\n\nThe reason I'm going to say four stars is twofold. Firstly the real pub atmosphere extends to the restrooms (toilets), which are as disgusting as the toilets back home would be. Given I wanted to wash my hands after the burger this was unwelcome. Secondly, the service was somewhat impersonal, with a bored-looking barmaid serving somewhat begrudgingly.\n\nThe business has just put up signs announcing new management, so I don't know how long this review will hold true. Hopefully it does for a while yet!", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "Guinness served in a proper pint glass by a real irish person. This is a crowded but enthusiastic place to watch a giants or niners game on the weekends. The beer selection is limited, but this is more than made up for by the lively crowd and tasty fried food.\n\nI came here for a friend's birthday to chill and it was the perfect environment to have a few drinks and catch up after a few months.", "author": "Palash A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "There I was, stranded near Golden Gate Park without a car, hungry, accompanied by a hungry, impatient girlfriend, surrounded by Asian cuisine, which we weren't quite feeling.\n\nAnd what's that? An Irish pub? That serves BBQ chicken sandwiches? SHUT UP AND TAKE MY MONEY.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "The Chicken curry & chips were sooo good. Pair it off with a cold cider and call it a day.", "author": "Jango L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "So... if you put \"Full Breakfast\" or \"white and black pudding\" on a menu, I'm probably going to wind up there. I had my eye on this place for a while so I was super happy when my friend suggested that we go here for dinner one night. \n\nIt's a loud and rowdy bar, which you think I'd shy away from but they're jolly and kind (talking about the customers here) and the bartenders were great. I somehow decided to go with the curry chicken with fries, which I enjoyed with my glass of red wine. I think we all enjoyed our meals and drinks -- so pair that with good service and it's good all around.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "I try to go back here every time I am in town. And every time I am in town, I scarf down one of their burgers so fast, my friends just stare at me, slack-jawed, that a human can eat that fast. I feel bad though. I eat so fast that I don't have time to really savor the burger.\n\nThere is a solution to this though. Drink a couple pints and order another burger.", "author": "Blair M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "YES THEY HAVE A FIREPLACE. \n\nDo I even need to say anything else? What else could you do on a chilly winter night in the bay besides warm your insides and your outsides with flames and one of the devil's favorite brews. \n\nYour mind will be tickled by the real Irish accents as well. I maintain it gets no better than this. \n\nBUT the curry fries were disappointing. Get something else and enjoy the blaze.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "First time stumbled into this pub on a bored Saturday night and it was crazy experience. Sunset neighborhood has its share of few laid back pubs. But this place came as a complete surprise. The decor is nothing special, dark wood and has a few sitting booths. The crowd is mostly a weird mix of locals - mid-aged regulars, totally wasted drunks and wandering youngsters alike. But the surprising part was the music and the atmosphere. Was so fun to hear the latest club numbers playing in an Irish pub in the far Sunset! It immediately pumped everyone's spirit;  the crowd went crazy dancing on top of seats,in the floor and everywhere possible! Everyone was just having a good time. Didn't care must about what we drank as came out buzzed and rock and rolling.\n\nThe second visit was on St.Patty's Friday and hell , surprised us again! This time there was live music playing. The singer sang a good mix of popular classics to romantic numbers and song requests kept flowing all night. In between breaks were club numbers that got us dancing again! Made random friends, danced with the neighbors sitting beside and got free jagerbomb shots from the bartender, ohooo this place rocks Sunset! \n\nThis place has its own crazy nights and if you in on one such night expect a few drunks stumbling around or in their crazy acts, the jolly Irish singing aloud, locals in their dancing shoes and no one here cares about anything else! Just come and have a good time.", "author": "Payal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-23", "description": "I went in to check out my local pub. Being new to the neighborhood, I wasn't sure of the welcome I'd receive - would it be the \"local's only\" vibe? Does food at a pub mean microwaved burgers? \n\nTurns out its a welcoming place with more than decent pub fare. The bartender pulled a great pint of Guinness and told us to stick around for the music later in the evening. The World Series played on one of two screens. Perfect!\n\nLookin forward to trying other items on the menu. I'm really excited this is my local pub!", "author": "Naomi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "What a great place to have some beers and a bite. Super amazing staff, inviting atmosphere, killer grub, and a properly poured Guinness! Dirty balls (delivered by Dan the Chef himself) are a must, the fish and chips are on point (those fries are so good), and the Shepherd's pie will have you licking the plate. Put this in your life if you are into this kind of thing. Btw, Dan does BBQ for specials and he makes his own bbq sauce for the pulled pork or whatever the special is.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Where to begin? I've gone in three times now and the bartender is already predicting which beer will suit the day. \n\nThe food is decent for pub grub. The atmosphere feel plucked directly from Ireland. I only gave it four stars though because on a weeknight this place shifts from ideal neighborhood pub to jam packed skeeze central. So I'd never recommend it past six, but it is a fantastic place to spend an afternoon with friends.", "author": "Ruth R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "Awesome! Live the feel of the place. Great bartenders and the food was delicious! This place reminds me of the Emerald Isle! Thank you for such a great treat!! Also, good luck to Roisan in your job! Your in great company because it's your family! Thank you for the shots as well!!!!!", "author": "Diane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "So i have to say when i first arrived I was immediately greeted by the bartender, quick service, ordered the Durty Balls....this amazing glob of cheese, bacon and potatoes that had been deep fried.  DELICIOUS.  There was a shift change.  And in that time frame it was clear that a large local crowd was at the bar.  We felt kind of ignored for a bit and when the new bartender approached us, after having empty drinks for 20 minutes, the inquiry was \"are you guys waiting on something?\"  I don't really feel like that's how you treat a customer who's been ignored with empty glasses for 20 minutes.  Not \"can I get you another ....or get you something?\" This was the only factor that kept me from giving 5 stars.  The atmosphere is very quaint, fireplace and Irish decor.  We both ordered Fish & Chips and IT WAS AMAZING!  So as we sat there we jokingly decided that because the first bartender was a rock star and the food was so amazing that we would ignore the secondary service we received. We then ridiculously over tipped....and ta da.....everything was suddenly overwhelming friendly.  So we chatted some more....I think it was because we weren't locals or regulars...and maybe the second bartender was just taking care of the regulars....and I certainly can't blame her for that.  Either way....we both highly recommend this place for delicious food and a nice local not loud atmosphere.   We will go back....and I'd anticipate with a few repeat visits I'd be able to change this from 4 stars to 5 stars.  Thumbs up for Nelly.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Love love this bar. Despite living in the area hadn't been and after reading reviews decided to drop in on a random weeknight. The atmosphere is great, it's a sports bar with an authentic small Irish pub feel. There was a very assorted crowd, from youngins to old Irish men, and the vibe was very laid back and welcoming. The bartender was super nice. Ordered a BLT with avocado which had the most delicious bacon, and a few pints of beer. They have awesome happy hour deals for food and beer too. Will definitely be going back, left feeling great in a content and happy mood.", "author": "Liz W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "Nice bar. Dave was a gentleman! Irish white pudding was too die for. No compliamts! Very good!!", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Very great neighborhood pub. Good food. Lagunitas on tap. That's pretty much all I want in a pub.", "author": "Sal F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Durty Nelly's has great hearty food, stiff drinks, music, and a friendly crowd. Morning, day and night. Plus walking distance from the house! What more could you ask?", "author": "Irina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-11", "description": "Stumbled upon this place on a Saturday afternoon, and at first, we weren't really sure what to make of it. From all the food reviews on Yelp, we thought it'd be a bit like Parkside Tavern (with a bar/restaurant feel). This place is definitely just a bar which happens to serve incredibly baller food. \n\nIt was pretty empty, so we just stood there awkwardly until we were sure it was alright to grab a table. The bartender will come over and take your order when he gets a chance. And then you wait...and you can smell those curry fries before they even hit your table. HOT DAMN, those fries were worth the wait. Sadly, I had to share them with my boyfriend, who was lucky to get a few bites in, I was shoveling them into my mouth so fast. \n\nWe also got some of the traditional pub dishes - bangers & mash, and a full Irish breakfast for me. I could barely move when I was done eating, but I was sooooo satisfied. This is definitely a laid-back, informal environment when it comes to food service, but the food was so awesome I would definitely come back for more.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Initially I went to get a haircut at my friend's salon and afterwards went to DN on 10-24-13 8:30pm'sh (since it was nearby, also I was hungry and wanted to sing karaoke).  I ordered a BLTA with fries (the food was surprisingly good, in this instance I did not use ketchup for the fries). Also had lagunitas ipa($5),guiness ($6) and two kamikazes($5 each).   I'm glad they didn't crank up the heat at the fireplace and also the bathroom doesn't stink as bad as before.  When the female bartender increased the volume of the music, the patron beside me told her to lower it----thank god it's not too loud.  Since Kendo was throwing a karaoke gig, that's the primary reason why I'm at this bar.", "author": "Jer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-04", "description": "Okay, I have to admit ... if I had not yelped this location there is absolutely positively NO WAY I would have guessed this place was where it is. I mean, I usually go down this section of Irving for boba tea, not a fun Irish bar.\n\nWe were pleasantly surprised that we found parking easily. We quickly found out that this place only takes cash, and were even more pleased to find a major bank across the street for ATM access.\n\nWe ate before we came, otherwise I would have loved to try the curry chicken. The menu is small but covers all the normal pub food basics.\n\nWe also appreciated the true Irish accents in this place.\n\nWe all ordered Guinness on tap. Usual price of 5.50.\n\nWe were there mid day on a Monday, as that is when we happen to be driving through the city. So as expected it was quiet and relaxing. The service was prompt and friendly. A sure thing to bring us back for many times to come.\n\nOne day I'm sure we'll make it for a loud evening, but till then we are quite satisfied with the relaxing experience.", "author": "Marlene T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "I love this place! I first came here last year right before the Bay To Breakers celebrations with friends and bumped in the owner on my way to the restroom. Reading my sweatshirt that proudly proclaimed \"ILLINOIS\" he asked what I was doing so far from home. When I told him I was here for a job and my oh my it entails pouring a drink one in awhile, he promptly escorted my ass to the bar.\n\nI LOVE THAT MAN!\n\nI get behind the bar, pour a beer or two, have a shot of peppermint schnapps and leave with a couple phone numbers. My friends look at me from the other side of the bar and just look at me dumbfounded. \n\nGOOD TIMES ARE HAD HERE...God bless Durty Nellys.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-08", "description": "\"Sometimes you want to go where everybody knows your name.\"  Especially if your name begins with Amanda.  Thanks to Manda B. for introducing this place to the SBC.  Our experience was first-rate.... thanks to Brandon.  Cherry bombs were exploding (in a fun way) and the curry fries were rockin.  I tasted their steak burger also and it looks, I mean tastes like I'm going to have to come back for more!  \n\nThe few times we stepped foot in this cheery bar, I noticed how cozy yet rowdy this place can be.  I think we took it to another level when the SBC, EB, and SF collided here just recently.  Awesome staff, smooth drinks, good food, and great atmosphere would facilitate my return.  Too bad it's a little too far for me to visit more often.", "author": "Bobby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-06", "description": "Aaaaargh.....avast and ahoy there matey!!! I spy Durrrrrrty Nelllllllly's on the horizon. Sorry for the piratitude....I saunter by Durty Nelly's often and a pirate always takes over my brain. An Irish pirate. The crunkest, most smokingest kind. \n\nI got nothing but love for a place where the guy in charge encourages the invasion of Yelpers from several Bay Area counties, helping to whip them into a frenzy with Cherry Bombs and smiling at 'Manda Bear dancing on the bar. You KNOW the regulars were NOT AMUSED. But I'll bet the cash register was.\n\nNow that I know how nice and cozy and friendly this neighborhood watering hole is I'll stop sliding by and stop in when it's....umm.....quieter.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-17", "description": "A easy to like local pub. The bartender is super Irish and the drinks are affordable. It looks like they have decent pub food, but we only came for drinks.\n\nAnd like thomas m. says it's really clean, except for maybe the bathroom (and what kind of well-frequented bar has a *clean* bathroom?)\n\nI compare it favorably to The Chieftain in SoMa, except it's much, much cheaper due to its NOT being across the street from the Intercontinental and the Moscone Center.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Just do yourself a favor and go.  At least once.  Thursday night or a weekend.  Get a beer, enjoy live music and local color.", "author": "Courtney D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "Was meeting friends on a Friday and just chose Durty Nelly's for the convenience of meeting up. The staff were friendly, I enjoyed my cocktails, the food was Irish pub food and good for all that- the prices were reasonable- but truly we happened upon a trivia fundraiser for the Riptide and though we intended to just pitch in and head out- we stayed to the end and had a great time. Glad we ended up there.", "author": "Kat F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-10", "description": "This is a little warm Irish oasis amid the sea of Asianness in the area. \nOnce I walked in, and  my Irish genes fluttered  and woke up a bit, my hair seemed redder and more curly, I could feel all my freckles and desperately wanted a heavy beer. \n\nIt's cozy, warm, they have real fireplace. Most of the other patrons are Irish-like from the homeland- I couldn't understand a lot of what they were saying. \nThe menu looked pretty decent and I decided to go with fish & chips with curry fries. \nDecent food. Although, I dont think the Irish palette can make out a very good curry for the fries. It was more like a curry, cumin soup that you dip your fries into. No flare, no spice, no heat. Eh.", "author": "Tasha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-14", "description": "If I had a choice to be one person for a day, I would be an Irishman. I would like to drink Irish whiskey, car bombs, and say the word fwuk whenever I damn well please.\n\nI would like to patron a bar like Durty Nelly's and order a pint of beer, while talking with another patron about the local baseball team's chances in the playoffs.\n\nI would like to try the Cherry Bomb, a shot of Absolute Mandarin with a splash of cranberry dropped into a glass of Smirnoff Ice. I would then want to say, \"What the fwuk is this girly drink.\" But I have to admit it does taste pretty good and it does hit the spot!\n\nOf course, I really do not have to be Irish to drink at Durty Nelly's but I'm just saying this for the sake of this review. Also, this bar is located in an Asian strip of the neighborhood. Personally, most of the times I would like to be discreet but some other times, I wouldn't mind being the square peg to the round hole.\n\nThat is not a knock on Durty Nelly's. It is a refreshing change of scenery for the area.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-14", "description": "Friendly pub. Bartender was wonderful!   Just will not be back for karaoke.  Got one song in, in 4 hours.  Kareoke guy has a special line for his friends.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-27", "description": "I stumbled on Durty Nelly's during one of my dive-bar safaris through the Outer Sunset.  The only problem I have with it? It isn't a dive.  It's actually a *very nice* pub. Management has pulled off a delicate balancing act by making the place clean and tastefully accented, and has done so without sacrificing the authentic, old-world feel that all too often winds up a casualty during a poorly executed pub re-model.\n\nA massive wood map of Ireland graces the East Wall to the rear of the bar.  Artwork that is both tasteful, elegant, and appropriate adorns the other walls.  Particularly intersting are several large scale pencil drawings in the back.  \n\nThe patrons here seem to be a pretty reserved lot.  They aren't the rowdy, hard-drinking Irish.  They aren't the bubbly, congenial ones either.  Talk amongst the patrons is quiet and civilized...foul language is rarely if ever heard. Regulars have a tendancy to sit in circles at the bar, making it difficult for strangers to slip into a conversation.  I met an Irish woman later that day that filled me in on the different cultures of Irish drinking establishments.  She told me that Durty Nelly's was \"Very Cork\".\n\nNice place.  Cute barmaids.  Authentic, tasteful decor unrivaled by any other pub in the city.  What's not to like?  While all these blessings may appeal to many, the place is a little too smooth around the edges for me.  The insularity of the patrons was a little tighter than I could handle too. It's a nice place, and a great spot to pop into with a date if you're in the hood.  But drop in by yourself, and be prepared to drink alone....", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "Found this place on Yelp, what a great find. Small Irish pub with great food, great bartender and server. Not for the faint of heart or someone easily offended by cursing, but hopefully you wouldn't be in a bar if you were that person!\nGreat ambience, fun!", "author": "Suzy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-03", "description": "Came here for lunch with my Grandparents.  Wasn't even weird.  \n\nThe food was so good, way better than I expected.  The french fries are now the spice of my life.  I want to eat them every day.  \n\nThe bartender gave my Grandma a shot on the house, and for that reason alone, I will always come back.", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "I came here a a couple months ago. the food was fine but its smaller than pictures.", "author": "Gokhan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "Fantastic new menu!\n\nIt doesn't get much better than an evening of banter with the friendly staff and regulars at this neighborhood institution.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "One of my favorite bars in the city! A tiny place with an awesome atmosphere. Staff and patrons are funny and friendly. Thursday night karaoke sessions are spirited and so welcoming. Every time I visit Durty Nelly's it is a night to remember.", "author": "Jasmine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-22", "description": "Really durty nelly's? Me and my friends were at Golden Gate Park and wanted a nice beer to end our lovely day. We came to durty Nelly's because it was close by and had good reviews on yelp. But wow. I ordered four Stella's on draft for my group (which by the way tasted pretty damn flat), and we also ordered two baskets of regular old fries. I paid for the beers and we sat at a table.  ( my friend was going to pay for the fries and possibly get another round on his tab) Started talking, and soon enough 30 minutes had passed by with NO FRIES. Are you kidding me? fries take at most 3 minutes to cook. We started to look towards the bartender who was periodically leaving the bar to sit at a table herself with some friends, completely ignorant of the fact that we had yet to receive our food. She even was taking shots with the Irish men at the bar. To top it off the cook had served other people their food and was standing by the bar, either on her phone or watching one of the TVs. Either they completely forgot we ordered food or the service is horrible or both. The place was gross, table was sticky, bathroom was horrendous ( and it was only 445, 5, not late at night. Booth cushions were ripped and quite old. The place looks like the name tells.. it's dirty and a bad service Irish Pub. I will never be back Durty Nelly's.", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Great authentic Irish bar in Outer Sunset. My friends and I just ate there and all agree it has to best Irish breakfast, hands down, in the city. Dan is an amazing chef.. Bartenders top notch. Great local bar. Check it out.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-13", "description": "This is a rather standard Irish pub. They have all of the beers one would expect (and nothing else). I decided to pass on the food as everything that was ordered at my table looked unimpressive. The quizzo took forever and we ended up winning a round of drinks, by the time we were done I was in no mood for another round and we ended up giving our prize to another table. I think there are better bars to go to close by and I'd rather go check out one of those.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-19", "description": "I love this place.  It's the closest bar to my house and I wouldn't trade it for any of the other bars in the inner or outer sunset.\n\nIt's a full Irish bar that's full of Irish people, seriously!  I've been in there on nights where the place is packed and I'm the only person with an American accent.  That being said, I've always felt welcome and the bar staff is really friendly and cool.\n\nI've tried the Irish breakfast, Cheeseburger, Curry Fries, and Fish and Chips here.  All were excellent.  My two faves are the Irish Breakfast and Cheeseburger (weird, right?) tho.  The Curry Fries are awesome to share at a table.  It's that thicker brown curry over thick steak fries... yum.\n\nYou can wash it all down with a good selection of whiskeys or beer on tap.\n\nI think  Smithwicks and Cheeseburger w/ fries cost me about 13-15 dollars and was worth every penny.", "author": "Joseph H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "\\basically judge a place (bar or restaurant) based on their restrooms.. cuz nothing is worse than a good restaurant with a bad restroom. This place has a great restroom..it was a pleasant surprise. Live music was good here too!:)", "author": "Carla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "Best burger in the outer sunset hands down. \n\ncan place an order for pick up so you don't always have to eat in a bar environment. \n\ntheir grilled chicken sandwich is really good if your trying to watch what you're eating. \n\nService is a hit or miss depending on when you go and most times you have to order  at the bar. Kind of confusing sometimes.", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "I love this bar and I lust the bartenders!\n\nWhy do Irishmen have so much charm?  I know they just tell you what you want to hear, but I am OK with that because they do it with an accent and a wink.\n\nOn to the actual review.  This is the kind of bar you can go to all day everyday  and never have to leave.  They serve food and drinks and what else besides air do you need?  Nothing.  Exactly.  So, I went with a girlfriend and we sat at the bar and ordered some Magners and fries.  We sat and talked to Rauiri (bartender) and he was fun.   Then, he got off work (we were there THAT long), and his cousin Odhran came in as the next bartender.   I lust Odie so much, but unfortunately I spotted a wedding ring after about 2 minutes.  Wedding ring means I can't take him home with me, but doesn't mean I can't be friendly and gaze at him longingly!  \n\nI am pretty sure that my friend and I were the only 2 in the bar who were not Irish.  All the people in the bar are super friendly and most are super Irish.  So many regulars come in throughout the day/evening and although I have never been to Ireland, I consider this the closest I have been.   I live in low pac heights, so it isn't exactly my neighborhood bar, but they always have parking and it is totally worth going to!\n\nGreat drinks\nGreat bartenders\nGreat prices\nGreat bartenders\nGreat fries\nGreat bartenders\nGreat regulars\nGreat bartenders\nGreat parking\nGreat bartenders\nGreat music (live, ipod, and jukebox)\nGreat fun!!!  Oh, and I almost forgot...great bartenders! \nI'll be back, probably this week, and next, and the following, etc, etc.", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-18", "description": "Bartender working right now is very rude and offensive. I walked in and get no acknowledgement. Being the ONLY female in there I would have that a would have stock out. I ordered a burger through one the people dropping off the food because by now I had been there 15 minutes with no recognition. I ordered a bacon cheese burger med rare. 25 minutes later which I thought was strange seeing as there was no other food coming out of the kitchen so why should it takes a med rare burger to come out of the kitchen, I receive my burger. At this point I am so starving I'm beginning to start drooling of the thoughts of food. I byte into the center of my burger. Dry and well done. Oh noooooo. It's not often I send back food but over cooked beef is a deal breaker. I finally flag down the bartender who then makes me feel very uncomfortable and not welcome.  But I understand how she might value her male customers but I am a paying customer. Showed her the over cooked burger. She then responds condescendingly \"so do you want him to make u another one\". I have been serving/ bartending for the pat 10 years. And u shouldn't make your customer feel uncomfortable or judged because my burger is over cooked. I say yes but ask if I can keep my fries because at this point I wanna grab a snack box from quicklys while I wait another 25 min for my refired burger.  She just gives me a look and then takes the whole plate, fries and all  about 15 min later the chef comes out and asks what was wrong with the burger.....WHAT?! you havent even started making it yet?  how difficult is it to get a well-cooked burger around here?!  i then ask him as i hear my stomach start to growl if he would bring me back the fries, which he did, which were now cold and gross.  The burger came out about 15 min later and was cooked correctly.  This whole time i have not been offered a water or other beverage.  The only time the bartender came over was to hand me my check and rushed me to pay her,  i was int he middle of put the money on the bar when she scoops it up when i hadnt even paid in full  I dont remember the last time i felt so unwelcome and offended by someone that works in a restaurant, i mean this is my industry, these are my people, but not this place  i will not return", "author": "Lizz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "I was looking through Yelp for places to eat at when I was on vacation in San Francisco and Durty Nelly's caught my eye. How can a 4.5 star pub be bad? This place exceeded my expectations. It's an Irish pub and the people working there are Irish (which is nice to see). The food was pretty good. I got fish and chips and I liked that they gave me limes instead of lemons, just something a little different. \n\nWhen one of the bartenders brought our food over, she accidentally knocked over one of our beers which spilled all over my friend. She apologized and brought over a new beer and offered us all cherry bombs on the house.\n\nThe bartenders are all really friendly and their Irish accents didn't hurt either. One of the regulars came by our table often and told us jokes and to tell us random things. I enjoyed coming here and will be back the next time i'm in SF and want to go to a pub.", "author": "Tina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "Great food, great beer! I wish there were more servers to assist the bartenders- staff is very friendly and helpful :) but you usually have to go to the bar to pick up menus and on a busy night it may take a while for your order to be placed.  \nI've had the Fish and Chips and Nelly's Burger- I highly recommend them both!!   YOU MUST TRY THEIR (non traditional) AIOLI SAUCE!!!!  I am not a mayo fan, but their (non traditional) aioli has won me over on their fries and burgers!!", "author": "Bobby P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-08", "description": "Lots of fun. The staff was a lot of fun but the locals ranged from really great to kinda weird (not in a good way). Cash only.", "author": "Lance C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "I just moved to the neighborhood and I've been trying to find a bar that I can feel like I can just hang out at. I've been to a few around the area, but none that seemed to have that \"homey\" feel; then I walked into Durty Nelly's.\n\nI love this bar. The bartender is very friendly and the people that hang out there seem to be regulars. I like that. The crowd seems to be a vast collection; there were kids, twenty-somethings, and people 40 and up. Everyone seemed to be having a good time.\n\nI have only had one meal there, but I definitely plan on going back to try the others! My meal was great; but I don't think anyone can screw up a grilled cheese sandwich.\n\nCheck it out! The beer is cold, the meals are hot, and the atmosphere is thriving. I've found my new hangout spot!", "author": "Angie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "Its fine for a bar. We tried the curry fries which were inoffensive. I think ordering food from the bar tender is a little awkward. I wouldn't come back to eat, just to drink.\n\nIt feels like Ireland in there: men in soccer shorts.", "author": "Catt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "Very fun. They have a juke box so you can pick what you want to listen too. Well priced drinks. Bartenders are very friendly and personable.", "author": "Jena D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "Was pleasantly surprised by my first visit to this local pub. Great laid back atmosphere and good food. Had to wait awhile for a place to sit, but glad I staued. Will be back soon!", "author": "Nichole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "Yelpers, you are not wrong.  The burger and fries are absolutely stellar!  I only popped in for food so I can't really comment much on the ambiance, but the service was friendly and prompt.  And that burger...  mmmmmm...  I can't wait to go back and have another one.", "author": "Lorelei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "Worth every star and more. I'd give it six if I could. The fries are always perfectly crispy. The burgers, when ordered rare, actually arrive RARE! I don't mean pinkish in the middle. I mean soft, red, cool and bloody, the way meat is meant to be served. If that's not your thing, they will cook to order and ACTUALLY GET IT RIGHT!!!!!\n\nI have never had a bad experience here, and I go often. The aïoli is phenomenal. The curry is perfectly spiced. The shepherd's pie is fantastic. The full Irish breakfast is more than filling. \n\nWhat's more, the menu just expanded to include all your Irish favorites! These are real family recipes made the way they were meant to be. The entire menu is no-fail. Beer-battered sausages, fried garlic mushrooms, beef and Guinness stew! Wash it down with a beverage, strike up a conversation, and find a complimentary cherry bomb next to your empty plate.\n\nThis is the most generous staff I've encountered in San Francisco. They have the best food, two screens where I can usually catch soccer highlights or sports playoffs, and -- the best part -- completely absent is the ubiquitous SF look-at-me douchebag. This is the place where you walk in the door and feel at home. Five, six, seven. Give me more stars so I can dish 'em out!\n\nTHE BEST SPOT IN SF FOR FOOD OR DRINKS.", "author": "Nick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "needed a place to hang out after the yearly fam dinner (moon cake festival) for some etoh. sunday night. gf and i did not have work the following day. so wine or beer. it didn't matter. of course, used our handy dandy yelp app for the surrounding area and Durty Nelly's pops up on the top search for multiple entries. \n\ni loved it. an irish bar with an actual irish bartender (who is also the owner) and irish patrons.  odie was really sweet and so was one of his regulars, D. everyone there was just relaxing and having a good time. sportsy stuff was playing on the multiple flat screens, not sure if anyone was paying attention to that cuz i sure wasn't. drank dudes were belting out tunes from the juke box. seating is at the bar or booths on the opposite side of the room, but everyone was at the bar. a pretty chilled spot.\n\nwe both enjoyed a few things of blue moons. and odie introduced a brandy-cherry-7up shot to us. damn, it was yummy. was introduced to a few other things that weren't so yummy- some licorice shot, and some very dark irish beer. yeee... but we live and learn. \n\ndefinitely will be returning. and when we do, i'm gonna get there earlier so we can get our chow on. simply cannot wait.", "author": "Uliej O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "This is a great bar! Great food, bartenders/staff, interesting and fun clientele, and a very cozy ambiance. They always seem to have the fireplace going when I go, which I love!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "I love this place! so much fun and tons of Outer Sunset craziness.  Bartender are super nice and friendly, and there's always a riot of laughter here.", "author": "Mel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Great bar with awesome bartenders! I've been here a few times and have never had a bad time.  Good for watching 49ers and/or Giants games or just for having a fun night out with friends.  And the fries here are amazing, just saying.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-21", "description": "It's a dive-ish bar, but it's pretty nice. Friendly, and comfortable. Gets packed really quickly. The right kind of irish carbomb. shot of Jameson, touch of bailey's, dunked into half a glass of Guinness. Fastest and tastiest way to inebriation.", "author": "Raymond H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-07", "description": "Cozy little spot that made me feel like I was in Cork. It seemed like everyone had an Irish accent and I had a fun time playing pub trivia with the locals. \n\nDon't recall the beer selection because once I saw Smithwick's on tap I was done looking for the night. \n\nI heard great things about the food here but I had the fish & chips and it was not good at all. Tasted like something you could find in the frozen section at Safeway. Fries were okay. \n\nI would give this place another shot if I lived close by, but I don't so I probably will not be back. If you stroll by and feel like kicking back to watch some soccer, check it out.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "Friendly Cheers atmosphere & yummy food . Just enjoyed a great $9 beer marinated Italian sausage sandwich with a huge mound of excellent fries ( the kind with the skin still on, my fave). Roll was soft & warm, grilled onions& peppers were melting& sausage was full of beer flavor & juicy. johnny Cash on the jukebox, anthony Bourdain's No Reservations on the TV & other bar patrons laughing appreciatively, easy street parking & a sunny day = one of the nicest afternoons ever.  A great place to hang out.  Plus the BEST Goodwill is just one block down.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Ah yes Durty Nelly's!  They have some awesome people inside and the atmosphere is nice.  I have yet to try the food here but I bet it's worth a shot.  I'll write another review, but based on my experience with this bar so far, I love the deals they have and the bartender was very friendly.  The people here are very friendly as well so the overall culture of Durty Nelly's is quite pleasant.  It may just as well be the Blarney Stone of Outer Sunset.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-22", "description": "+ The bangers and mash were the bomb.\n\n+ The bartenders were friendly and no one flinched when I ordered a soda (Call me crazy, but I prefer not to drink and drive while borrowing my friends car.)\n\n+ They seem to have some kind of satellite/cable 24 hour soccer channel hookup.\n\n+ Everyone sounded Irish, which of course lends itself to the authenticity of the Irish Pub.\n\n+ Someone actually came up to the bar next to me, handed the bartender $15 and said, \"This is for the other night, I was so gone when I left here I forgot to tip you.\" After all, the least acknowledged factor that makes a decent place are the patrons, and that clinched it for me.", "author": "Gabe S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-04", "description": "2 Pints Magners down in my tummy\n 1 mandarin vodka and Soda\n 1 cherry bomb on the house!\n Bangers and Mash\n curry fries\n and a bite of chicken pot pie. \nAlcohol was fab of course! haha\nBangers were real good, don't expect a large sausage it's like 5 little breakfast sausage size ones but VERY tasty! MASH- uhh ok not awsome.\nCurry Fries- I don't like\nChicken Pot Pie- Stay the hell away from this thing! Horrible! Tasted like left over chicken mixed with lots of peas and it was all stuck together with dried up sauce, it was BAD!\nBartender- Awsome! and cute but married haha. \nPlace- relaxed and cool\nPeople- Casual and nice mixture old and young.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-19", "description": "Nice in the afternoon when it's not too crowded.  Authentic-style pub.  Plus for food, booths, and bar. Minus for having only one stout on tap.\n\nWill have to return to sample whiskey...", "author": "Ken B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "I moved away from the Sunset years ago but I miss this place. I spent two happy New Years there. The food is excellent. However, the thing I miss the most are the cherry bombs! I am a no sugar and frills, gin/beer kind of girl (I also dislike vodka and Smirnoff ice), but my goodness, the cherry bombs are GREAT, when made correctly by staff (usually Brandon).", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "Love love LOVE this place!!! Great food, generous drinks, fun bartenders. Enter a stranger....leave a friend ;)", "author": "Cyd P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-23", "description": "Came here randomly on a walk to the bus today, and I'm so glad we did. The bartender was super sweet and the other patrons were all very friendly locals. We only had time for one drink, and ordered Jameson and gingers. They were made perfectly. We spent about a half hour drinking our drinks and had a great time. I'm sad we weren't able to stay longer, and I look forward to coming back to try the food sometime soon.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "I love this place. Laid back, and everyone is so nice. We got served instantly and the drinks were decently priced. I think that it can be one of our new hang outs :)", "author": "Kristin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-29", "description": "I like Irish pubs, probably because I like Irish men. (It's more of a love/ hate thing really). In some ways, Durty Nelly's is a more than decent Irish pub. The building is cute, the atmosphere is relaxed, and the bathroom isn't disgusting. But something weird happened when I was there. The music switched from cheesy 80s (which I like) to country-ish. Everyone spontaneously got up and began pseudo-square dancing at a frenetic pace. It was as if everyone was vying to be the craziest, quirkiest dancer. I really didn't understand. Is this what always happens at Durty Nelly's on a Friday night? Also, I don't expect people to be dressed to the nines to go to a pub, but I also didn't expect to see people under 35 wearing either a sweats/pyjama top/ flannel shirt combo or jeans that were manufactured sometime before Wham! broke up.\n\nThere were also the smells, but I'll give Durty Nelly's the benefit of the doubt and just blame that on some customers with some hygiene/ digestive issues.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-08", "description": "Great place! My local go-to bar in the neighborhood, and they make great burgers and fries at lunch. I'm a fan of the small but homey fireplace on those foggy days in the sunset.  Best of all-  the warm, unpretentious, homey vibe of the place, with great staff who recognize regulars and are super friendly with everyone.", "author": "Maile H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "Durty Nelly's will always have a special place in my heart - I met my husband here! \n\nA tall, dark Irishman and I met eyes across the bar! 8 years later, two kids (and a dog) we are still happily married.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-27", "description": "There really is NO BETTER Irish Pub in San Francisco!", "author": "Cyd K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-10", "description": "I've walked past Durty Nelly's probably hundreds of times in my life and I never thought I would set foot in here. It was a Saturday night and my friend from out of town wanted to pay a visit to Durty Nelly's since he enjoyed it the last time he was there. It's pretty dark inside and from my recollection, decorated with a lot of wood. There was a live guitarist there that night. He sang so loudly that it was difficult to maintain any sort of conversation. I had a cranberry vodka, which was on the small side, but strong and cheap ($5). Not really my crowd, but I wouldn't mind going back..on the guitarist's nights off.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "This place is an awesome chill & hang out bar.  It gets super crowded some nights if you're into that sort of thing.  Bartenders are friendly and great.    Food is good  too--especially their burgers.\nLess typing more drinking...", "author": "Billy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-19", "description": "Cozy atmosphere and good service. One of the better Irish bars in the Sunset.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-01", "description": "I went here with a good friend, an Irishman of some repute.  We both liked the ambience although he would have preferred some more wood panelling, I guess that's an Irish thing.  The drinks were good and the staff friendly and pleasingly Irish, plenty of brogues going around which was enjoyable even for someone of German heritage such as myself.  \n\nThe only problem was they started doing trivia night on the Wednesday we went, which I found annoying since we just wanted to chill and have some ale.  Our own fault for going that night, should have read ahead.  I look forward to going back on some quieter night.", "author": "Alan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "Legit little place. The food and drinks are cheap, the vibe is good, and real Irish people work there. I ordered an insane ham and cheese sandwich and fries for like $7. Stop in, it's a nice local place, highly recommend. Not sure the nighttime vibe, but I was there in the afternoon and it was relaxed (I'm told it gets a little wild when the sun goes down)", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Must say I love the feel of this place, I find it cozy. I had a great experience here a few days back with a very friendly bar tender. Made me feel like a regular even though it was only my second visit.\nPlace was clean, bar staff were very professional & I felt comfortable here.\nI'm sure when I'm in that area again I will pop by for a beverage or two.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-20", "description": "I had such an great time here when I last visited SF! It's a small, cozy place full of locals and true alkies ;-) Had some locals buy us a round of drinks, danced with a cute guy I met there and met some really awesome people. Such a fun night!!!", "author": "Anna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-23", "description": "I have found my new favorite watering hole. \nFrom the moment me and my buddy walked up, the bartender was outside smoking and made us feel very welcome! I, being half-Irish myself, found it comforting to see and ACTUAL Irish pub, vs a douchey sports bar with Guinness signs and clovers.\nThe BLT I had was great. They take their time pouring your beer, like it should be, and the atmosphere was great.\nBig plus for having a great guy/girl ratio as well! \n'Erin Go Braugh!'", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "We love this place, super friendly staff, delicious food, fun, convivial atmosphere. Totally made us feel welcome in our new neighborhood.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-12", "description": "I have been eating and shopping at places on Irving since I could walk, and I never gave this place a second glace other than to admire their colorful seasonal and sports-affiliated flags hanging outside.  This has changed since I turned of age.\n\nLaid-back, no pretense, comfortable vibe, Gigantes were on the screen, delicious fish n' chips.  Charming, friendly and helpful bartenders who suggested we try the Magners cider (refreshing.  mmm.)  Left happy, full, and with that warm fuzzy feeling I get after watching a favorite team with other fans, Or after other things.", "author": "Jaclyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "This place is so cool\nWhen you come in you understand what is a real Irish pub and they have great food like the Irish breakfast and the cheeseburger \nThe stuff are really nice and every time I go there I feel so welcome like is my own place\nAlso the people that come there are really nice so it's make it even better\nSo if you want to go to a great Irish pub go there and I promise you that you will enjoy", "author": "Boaz H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-21", "description": "This is probably the closest you'll get to an Irish Pub without actually flying across the Atlantic. This ain't no touristy downtown pub with $6 pints of Guiness and $15 fish and chips. There are actual Irish expats tending the bar, Magners on draft, cheap and delicious eats and occasional live music. If you're lucky you'll stumble in when a local old dude is celebrating his 80th birthday, dancing adorably with his smiling wife (and every other girl in the place) and playing the harmonica.\nThe menu here is limited, but everything is tasty. Did I mention that I've never once paid for their signature cherry bomb?", "author": "Melanie V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-13", "description": "I've been here a couple times when in the area, and I had a surprisingly good beef sandwich one time for lunch.  The blonde bartender is friendly, but... I hate to say this, her service lacks.  She does a good job of chatting up the numerous local regulars, but both times I was there I would go 20 minutes or more during which she was engrossed in a conversation and not even checking to see if I needed another drink or whatnot.  I don't expect nor want conversation, but I also don't want to wave my arms or have go to over there to flag someone down for a drink... While I'm already sitting at the bar with a long empty glass in front of me.  So as much as this place is decent in other ways, I have to give the service a pass.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-01", "description": "Guys, guys. There is nothing 5 stars about this place. A handful of beers on tap, a few booths and 2 tables. Two very small, highly reflective screens for ESPN, and that's it.\nThe food is just plain awful, and uncooked. Floppy fries, boiled bacon... Just don't eat here.", "author": "Carlo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-24", "description": "I was born and raised in Northern Co. Kerry. As a kid I loved the opportunity to go to Shannon airport to pick up or drop off a relative or friend. Not because I like airports you eejit, but because it meant we could go to Durty Nelly's six miles outside the airport. What a great place to eat and drink.\n\nLo and behold when I heard of an Irish bar in SF of the same name, sure I had to go and check it out. What a treat to find such a warm, welcoming little pub in our often too hectic city.  I have been to just about all the Irish pubs here and none compare to Durty Nelly's.  While I can find something positive to say about all the other places, only Durty Nelly's can transport me home for a brief respite. \n\nI don't say that lightly, and to be honest I would rather be there now than writing this stupid review.  I went to the pub last month and returned there tonight.  The barman, Brandon is quite the Irishman and a great character. He was attentive, funny and professional.  It is quite obvious he loves his job and that is one of the most important factors in having a successful business.  He was running around doing a hundred things at once, all of it seamlessly. Kudos to you sir.  \n\nBut wait, there is more..........\n\n....... Bacon and Cabbage!      Thank you Jesus for Daniel and his culinary talents.  I don't mean the corned beef garbage often passed of as bacon and cabbage here in the U.S.    I mean real cured back bacon just like my mother made every Saturday for dinner in Listowel, while we all waiting for dad to come up from the pub.  Absolutely delicious.  Thank you Daniel for going to all the trouble of curing the bacon and offering it on the menu as a special. What a nice guy to talk to as well.  \n\nYou should call to see when it is being served next, and then go get a nice piece of bacon and a real taste of Ireland at Durty Nelly's.  My friends ate the fish & chips & BLT, they loved their meals and said they would order them again. The menu is short and sweet, just perfect. We had a great time here again.\n\nI am not going to describe the interior, furnishings, fireplace and all the other trimmings because they are unimportant in the grand scheme of things.  Anybody who knows Ireland or an Irish person will understand that it is the people who make a place and you will find the spirit of our great country right here in this little pub.\n\nSo if you are looking for a real Irish bar with real Irish food head over to Durty Nelly's. If you are looking for a fake, glossed over, stage version of an Irish bar then go downtown SF or perhaps back to the Marina.    \nGo raibh  maith agat!", "author": "Cheeky Monkey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-03", "description": "The first time I was at Durty Nelley's I watched Cody Ross \"Cody Ross\" the Phillies in the NLCS.  Once the bar erupted in Guinness soaked adulation, I knew I'd picked a winner.  My only gripe is that their cash-only rules frequently end up \"Cody Rossing\" me.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "It's a pub! With amazing burgers and fries and a nice vibe. It's cash only", "author": "Monica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "Great hole-in-the-wall. Love the real Irish accents.\n\nI apologize about the public showing. I really am no exhibitionist.\n\n*shakes head disapprovingly*", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "Durrty Nellys is a awesome little Irish Bar/Pub or whatever you would like to call it. \n\nEnded up here after an UYE and since I was late I needed to catch a bite to eat here too. First off the place is small but not too small, the set up is intimate but if you pull back the booth curtains you can make it more conversational. The decor is typical of an irish bar but the part I love the best was that it came complete with Irish accents as well!!! WIN.\n\nFood - I ordered fish and chips and they were spot on...not too greasy but maybe that is because all the grease leaked out the bottom of my basket LOL...\n\nThe Bartenders are friendly and attentive and the drinks are well made, they dont hold on the liquor. \n\nOverall definitely a place Ill go back to!!!", "author": "Sheila C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-11", "description": "What do you say when you leave this place??\nTop of the morning to ya.... cuz once you get there, you don't want to leave till you close it down in the morning. \n\nI would like to pay homage to Brandon the barkeep. Brandon my cherry bomb makin, cider pouring, last minute food takin Irishman..... if you don't know him then you don't know Durty Nelly's. \nBTW- do you now Michael H? XD\n\nWhere else can you get a great medium rare steak sandwich and curry chips in the predominantly chinese neighborhood while listening to Irish acoustics in a throng of yelpers where Amanda is downing cherry bombs like it's going out of fashion.  Here, that's where! And don't forget that in the wee (lil) mens bathroom it is normal to find three grown ass men sharing the space of a closet.\nOdd, I don't remember leaving....", "author": "John-Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-11", "description": "Good spot. Served both our food dishes differently to what the menu said. (chicken pot pie, and ny steak)", "author": "Barry G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-08", "description": "Not sure what we did wrong, but my husband and I moved to the neighborhood 6 months ago, tried DN's 3 or 4 times and couldn't get a smile or a drink. \nThe bartender ignored us. It seemed like you had to be a regular to get service. \n\nWe are friendly and good tippers. \n\nIt's disappointing because there are so many positive reviews. \n\nWe gave up trying and won't go back.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-07", "description": "Holy! This is the best french fries I ever had! Tasty and all freshly made.\nAlso they have Chicken Curry Fries which also was pretty unique. \nThe hamburger looks amazing but I haven't had the chance to try it out. \n\nI'm glad to see an Irish Pub in the middle of an Asian-dominated area can pull out food this good and not just pushing out beer and liquor like most pubs I have ever been to.\n\nI came here with several Yelpers, parking could be a problem since this street is filled with old restaurants and banks with no parking structures around, most places in the streets are typical SF homes so either park a block away or so. We managed to get one in front of Coco's Crawfish which is just in front of the pub. \n\nNow I'm not much of a beer or liquor drinker (long story) so I only go for white or red wine and usually some people will look at you in a funny way if you order wine, but Brandon who was behind the bar just pulled out a chilled bottle of Chardonnay and filled my glass every time I hung back at the bar. Three cheers for Brandon! I believe he's known for the Cherry Bomb drinks that Amanda B ordered for all the ladies in our group.\n\nI rarely go to SF for drinks but this place makes me want to come back.....\n\n\nAs long as someone drives me back if I get tipsy. :D\n\nSo uh... who's Nelly ?", "author": "Dennis O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-29", "description": "Brandon is one of those 6'2\" Irish guys that you need in your neighbor community - cool, funny, has great stories, lived in Hawaii, knows all the locals, the locals know him, makes the best Cherry Bombs and Irish Coffee, and looks like he'll bail you out off an Asian street brawl.    \n\nTonight the Brotherhood had a chance to drink up with Brandon and enjoy his Irish Pub in the middle of Asian town's Irving Street.    We shared our plans for next week's event and has agreed to collaborate with us on the first ever SBC and SF UYE! \n\nYes... its OFFICIAL - Friday, December 5th, 2008 in San Francisco!\n\nUYE Collision Course:  SBC & SF at Durty Nelly's!!!\nhttp://www.yelp.com/events/san-francisco-uye-collision-course-sbc-and-sf-yelp-at-durty-nellys", "author": "Walter P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "Came here for Manda bear's UYE party after eating at Coco's craw fish. I came here a few times with my buddy James c back in the day when he ran So restaurant, the original San Tung on 24th and Irving. Brought back memories. Shots of hennessey and coke backs after having lunch at So's was no joke. \n\nI came here two Fridays ago. I actually had the food here as well because we were still a little hungry after all of that drinking at Coco's. Brandan did a great job of hosting the bar and it was packed. They had a live band there as well and they were great. I am very impressed with their menu. It can get a little stuffy in there. I would actually come back here for the food and a pint. This place makes me want to drink beer.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-07", "description": "Let's see Chinese joint, Chinese joint, Chinese joint, Nelly's.  Not being from this area and fearing the parking situation, I parked a few blocks down, so got a lay of the land.\n\nFirst thing I do is order a couple of pints and ask for a menu.  I hear the kitchen is closed, but they still hook me up with fries.  That's cool.  I would have understood if they didn't try, but Brandon made the effort.  Which is good, since I was rolling in on an empty stomach, wasn't sure the Guiness would be enough to feed me without turning me piss drunk assaholic.\n\nProps to the guy singing everything from Beastie Boys and Outkast to Violent Femmes and Talking Heads and just about anything in between.\n\nOutside we were talking to Brandon, Elvis, the Phantom and a guy telling dirty jokes steeped in an Irish accent, would that be called brogue?\n\nThe lady outside who unwittingly got caught up in this was pretty offended, which was kinda awesome.", "author": "Ed H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-04", "description": "A nice place to spend a quiet weekday afternoon with a Guinness, while contemplating thoughts that have no place within such walls: \n\n-How the slightly cracked window let in a refreshingly cool breeze, felt only on the most laid-back of days.\n\n-How the incoming sunlight lit the weathered bar, softly accentuating the wood stripped after years of loving abuse.\n\n-How I was able to use a bathroom twice without having to pretend to rent something from Blockbuster.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-30", "description": "One time, at band camp.....\n\nyes, I went to band camp, and outdoor adventure camp, and art camp, and church camp, and this strange camp where we learned to shoot things like rifles and slingshots and bow and arrows...but anyhow, this is about band camp. It is, in no way, about how my parents thought it a good idea to send their kid off to learn to shoot guns in order to have some peace and quiet every summer. No it is about band camp. No, wait, it is about Durty Nelly's......but whatever! \n\nThough church camp would appear to be the logical first choice for worst experience, it comes in second to band camp. The reason being the people I was surrounded by, who relentlessly teased me for \"being where I don't belong\" and actually going to a camp to play flute, when clearly I had no fucking idea what I was doing. As if this was my choice. I should have brought my violin....but I hadn't started playing it yet, so I guess that would have been just as bad. \n\nWe had a camp counselor who was a drunk, who would sneak out of our tent at night to drink with the boy counselors, and who had a general disdain for us campers. Since my fellow campers had a general disdain for me as well, it was a fun summer all around. Which brings me to the clientele at Durty Nelly's.\n\nLast time I was here (interject useful part of review) at this somewhat run down, dark wood, occasional DJ in the corner, average priced, Guinness and Magners heavy, often crowded bar with some booth seating, I heard someone talking about the awful time she had as a camp counselor. She was drunk, she was surrounded by boys. She reminded me of my counselor. Had she been 10 years older, and not Irish, I would have thought she was my counselor back in 82, or whenever it was I was subjected to the hell of band camp. She may have been my counselors younger Irish sister...maybe.\n\nIn addition, I am pretty sure that my fellow campers at \"Camp Nelly's\" had the same disdain for me as my former camp pals. I assume this because they made comments to the effect of me \"being where I don't belong\". This time it wasn't about my lack of musical talent though, it was about my being American. Strange, I thought California was in America. But, I also thought it was okay to try to learn an instrument at band camp. What do I know!!!??", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "Really cool local place. I stopped by for a single beer and ended up spending a few hours. If I lived by here I would be here everyday. Awesome bartender and good music.", "author": "Robert I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-06", "description": "Robbie with the ZX-9, served us. I don't remember much more after having 3 cherry bombs.\n\nWhat does Durty Nelly's mean? Is it like a Dirty Sanchez?\n\nBob's your uncle.", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-30", "description": "Decent Irish pub with REALLY GREAT curry fries. Wow.. \n\nBut the beer selection SUCKS.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "Great place to hang out on Irvine.  \n\nLots of neighborhood regulars, who didn't seem to mind the Yelp invasion from SF, East Bay, and South Bay.  Thank you regulars!\n\nNot a particularly large bar, the kitchen was sadly closed by the time we got there.  They did still have curry sauced fries available, and these were just fantastic.  \n\nAs an Irish bar, my biggest disappointment was that there was no Middleton, a whiskey some would say is the best that Ireland has to offer.  They did have some Scottish whiskeys available, but not Talisker or Cardhu or Craggenmore or Oban.  Oh well.  \n\nThe bar is fairly small, but has a great vibe, and Brandon and the other bartenders were exceptionally attentive and fast until the final invasion crew doubled the number of folks in the bar.\n\nIt may be against some sort of city code, but a few chairs and tiny coffee tables would have been a nice touch, especially to get out of the sardine crowd in the bar for a bit.  But it was all good.\n\nWill I be back again?  Definitely.  But since I won't be back often because of the distance, it's hard to give a perfect score.  Couple with the lack of several whiskeys I like, this place gets a solid 4.\n\nYou know what that means, right...Yay!  I'm a fan!", "author": "Tetsu N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-18", "description": "What a night?!! All I remember was meeting this awesome girl and drinking heavily. \n\nIt was after all St. Patricks Day. \n\nThe drinks, the music, the dancing that took place almost everywhere in the bar, and the sticking floor from all those bottle spills made the night memorable. Probably one of the best St. Patty's day, I've experience. \n\nIn the end, an Irish Bar wouldn't be an Irish bar without a fight. Yup, a fight....no surprise. And yours truly Stanley K went home lucky.", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-06", "description": "Had a great time here and the place is rocking! I loved the music, atmosphere and of course good beer and jameson. I tried the curry chips and really loved them and my mate wants to go back next weekend\nwhich we are. The bartender and the patrons were so sweet to us and fun and the prices are right!", "author": "Nadia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "Going to Durty Nelly's on Saturday night made me feel like I was in one of my favorite movies \"Shaun of the Dead\".\n\nRemember that scene in which Shaun and Ed find a girl in the garden, and they think she's drunk, but she's actually a zombie?  Shaun pushes her hard and she gets impaled on a steel pole, but then she gets up and starts walking towards them again, while Shaun and Ed stare at her wide-eyed.  \n\nThat's what the drunk people are like at Durty Nelly's.  It's absolutely hilarious to watch.  I saw two people nearly pass out, and then five minutes later they were ordering another drink.  Incredible!   One girl saved herself from hitting the floor by holding on to my purse.  I couldn't move, and she didn't move for about 10 minutes until her friend grabbed her by her waist and propped her up on a stool.  Time for another pint!\n\nThe bartenders here are excellent - I have never seen drinks poured this well or this fast.  They are working so hard, there is no time to clear the bottles - it's like that game \"100 Bottles of Beer on the Wall\" but they are on the tables and bar.  The bouncers have their hands full with the  people who do cross the line (but some of them make their way back in...just like those zombies, you can't keep 'em down!).  Really, though, everyone here is just fun-loving and harmless and there to have a good time.\n\nAt one point, some folks were standing on one of the tables, and the bartender just threw a towel at them to tell them to get down.  It was awesome - like disciplining animals.  And it reminded me of this scene, where Shaun and Ed are throwing old albums at the zombies:\n\nEd: \"Purple Rain\"?\nShaun: No.\nEd: \"Sign o' the Times\"?\nShaun: Definitely not.\nEd: The \"Batman\" soundtrack?\nShaun: Throw it. \n\nWell, unlike our heroes in the film, we were bitten and soon participating in the rowdiness all around us.  There is nothing more fun than an entire bar singing along to a live rendition of \"Dirty Old Town\".  Young and old, male and female, arms around each other and singing their hearts out, present company included.\n\nOhhh, that was fun.  But through the mayhem, I also recognize a great bar when I find it, and I  will definitely be back during a more quiet time to enjoy a creamy Guinness and some pub grub.  \n\nI'll leave you with this bit of wisdom:\n\nShaun: As Bertrand Russell once said, \"The only thing that will redeem mankind is cooperation.\" I think we can all appreciate the relevance of that now.\nLiz: Was that on a beer mat?\nShaun: Yeah, it was Guinness Extra Cold.\nLiz: I won't say anything.\nShaun: Thanks\n\nIf the world is ending, I am going to make a beeline for Durty Nelly's.  Because when it comes down to it, all you really need is a pint, your friends, and some good music.  And perhaps a little bit of wisdom thrown in.  Good times.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-19", "description": "I came here during my lunch break because i was hungry and depressed about my work life being bleak. Stormiest day ever. Saw that it had food and beer, so I was sold.\n\nHonestly, the people in here are amazing. I ended up getting wasted from cherry bomb after cherry bomb, not going back to work, and wondering how I got home. I literally wrote in my notebook \"i love this place and going to sleep with this bar and everyone in it, including the girls.\" Robbie also let me smoke a cig out the back so I wouldnt get pelted by the storm. I think it's true love.\n\nIf you loooove cherry bombs, irish accents, or all around really welcoming friendly people (or are a youngish blonde chick by herself), go. You'll love it, until you realize you've left your computer at work and your car is stil parked in the boondocks the next morning.", "author": "Kristen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "The lamb burger is awesome! The regular burger is awesome! The shepperd's pie is OK. This bar has an easy, feel-good ambiance. It's not too big, nor too small. The bartenders are really friendly and Irish! I had a great time and would definitely recommend! We're for sure coming back for seconds.", "author": "Ana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-26", "description": "We used to call D.N. our \"Regal Beagle\" since it was just a block away from our old place.  Our local standby - even all of our friends had at one point and time been there with us.  When we first moved to the area, we were there so often that we became labeled \"the girls\" (like being \"Norm\" on \"Cheers\"!).\n\nYou almost feel like you're in a foreign country with all the fresh-off-the-boat Irish movers and construction workers (whose speech always gets a little harder to understand after a few pints.) I don't know, sometimes I'd wonder, \"They're still speaking in English, right?\"\n\nBrendan is the best - like a big 'ol teddy bear offering you peppermint schnapps shots (which you have to take along with him).  Orin is usually always there too (sorry, I know I spelled his name wrong - it's some weird Gaelic spelling).  He does an awesome version of Elton John's \"Your Song\" - get him to sing it on karaoke night.  Who knew the boy could sing?\n\nAhh... I miss this place...Where everybody knows your name, and they're always glad you came.", "author": "Van Ness D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-23", "description": "This is a very cool neighborhood Irish Pub.  I came here for the first time because it is just around the corner from my new place.  Let's just say I have been a repeat customer.  \nThe first thing you will notice upon enter  Durty Nelly's is that it is small, with some booth seating and a very cute fireplace.  It is just the place to warm up with a drink here in the Sunset.  This is especially true since they have awesome Guinness.  I am very particular about my Guinness.  A few years back I took a month hitchhiking around Ireland and developed what I would call quite an appreciation for the stuff, but only if it is good.  I would have to say that Durty Nelly's has the best Guinness I have ever had in the USA.  \n\nOverall, this is a great place to have an excellent Guinness and hang out in a really comfortable, chill environment.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "If this place lacks anything, then its \"Durty\"ness:  the place is clean!  Spotless!  And very well lit, which is weird for a bar, I must admit, but really--its not Durty 'tall.\n\nI've only been in here once though, so maybe it was a fluke.  The beer selection isn't that great, though, and thats something that doesn't change often.\n\nOtherwise my only experience with Durty Nellies is the INSANE amount of noise that comes from this place every Thrusday - Saturday nights that I get to enjoy since I live really close by.  A couple weeks ago, I got to hear an Irish rendition of Doris Day's \"Que Sera, Sera (Whatever Will Be, Will Be)\" sung with think Irish accents and replete with profane lyrics.  It was beautiful.  Even if it woke me up at 2 in the morning.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-14", "description": "An Irish pub in the outer sunset?  What's going on here?\n\nActually, apparently the Sunset does have a substantial Irish expatriate population (see the Shannon Arms).  Anyway, one of the things that sets Durty Nelly's apart, aside from its location, is its great pub menu, particularly the Irish Breakfast.  Irish bacon, sausage, eggs & beans, perfectly buttered toast, and of course the delectable blood sausages (if only there were bigger!).  If you're not hungry, still a great laid-back place for a pint.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-21", "description": "This is The Irish Pub of San Francisco - not kell's or some trendy bar.  This is Ireland.  I can't understand anything anyone is saying until I have 2 Guinness'.  The music is awesome!  There is a musician that has been paying at Nelly's for years who is unbelievable.  Last time I was in there he had everyone singing before 10pm.  This is one of my favorites...it is a dive - but a dive with love...Everyone I've taken there has had a blast.  There has not been a time I've been where I haven't.  Be ready to sing, smile and get dizzy...\n\nOne of my Favs Fo Sho!!!  Do it!", "author": "Siamak S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Excellent place with great service and good people!!! Best bar I have been to in awhile :)", "author": "Tiffany B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "Guinness with the 2/3s pour, then fill.  Just the right amount of foam.  A slight ($0.50) discount compared to many other bars, too.\n\nI've yet to try the food, but I'll have to try Durty Nelly's again sometime.", "author": "Jin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-22", "description": "Now this is my kind of place.  Drinks are freezing cold, food is blazing hot, good and tasty.  True Irish ex-pats here so you know it is not some cheesy Irish knock off.  Located in a small neighborhood way off the tourist path, this is where you want to relax and have a drink.  Even as a new face, you will be welcomed like you have been there for years.  On a cool, foggy night, the fireplace makes you feel at home.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-10", "description": "Got good and drunk here last week.  Food was awesome.  GREAT Fish & Chips.  We went for lunch and stayed for dinner.  Yeah, you're jealous.  I'll vouch for the shepherd's pie, and the burger, too.  \n\nNothing not to like.  It's hilariously placed in the middle of a chinese market area.  There's REAL, from-Ireland, Irish people there, and I mean all the bartenders I've met and all ten people at the bar the last time I was there.  \n\nExcept for a really freakin funny older lady who told me my '73 SuperBeetle is probably the one her friend used to own because it sounds the same and was the same color, then delighted my tipsy roommate and I with stories of running from the Nevada highway patrol during her racing days.  I wanted to keep her.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "The most authentic Irish Bar in San Francisco...by far!!!!! You will have the best nights craic here and hear lots of Irish accents and enjoy tasty wholesome food. The pub quiz on a Wednesday nite is great banter and come on the weekends and hear live Irish music.!!! This is def a home away from home :)", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-10", "description": "This place looked great on paper - authentic, fun, and mellow. In reality I have mixed feelings about this place. \n\nThe plus:\n    probably one of the only bars in this Sunset area\n    drunk Irish people\n    drinks are fairly priced\n\nThe negatives:\n    overly drunk Irish men who accost everyone - including guys and girls\n    music - eh\n    crowd - eh\n\nThis place is a good place to come get drinks with a group of your friends if you  just want to drink and talk. This isn't a great place for insane party atmosphere. The place is nice just not my vibe.", "author": "Sasha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-20", "description": "THE PUB. \n\nCrowd is the CRAIC. Brendan the barkeep is freaking awesome...but don't cross him and don't break his glasses.\n Darcy will unhook your bra, turn a barstool upside down and play bagpipes for you, or rip a napkin in half and give you his version of Phantom of the Opera. \nMarc will dig you a hole (the BEST HOLE you've ever seen), and karaoke Lady Gaga with you. \nFamily away from home, for sure.", "author": "katie b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "I luv this place... Straight up Irish Pub just how you want it.. The place is quite small but cozy & got a good ambiance... \n\nThe best Irish Pub in that whole strip I must say... Quite interesting with their variety of drinks there... The Cherry Bomb is a must try... Got it all buzzed a few times but my friends & I still come back for more ;-)\n\nBrandon is the best bartender there.. He's a big teddy bear & so happy always :-)\n\nBeside the drinks, the burger is so yummy & only $9 with fries & pickles, now that's a steal!\n\nThey also have happy hours... Well, we always happy when we go there so nuff said ;-)", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-19", "description": "For me the best thing about Durty Nelly's is that it is a 5 minute walk from my house.  Now if you are not lucky enough to live so close to such a cool bar, then there are plenty of other reasons to go to Durty Nelly's.  It has a good pub atmosphere, with friendly bartenders and fun patrons!  \n\nLet me tell you this, there is always something interesting going on at Durty Nelly's.  Every time I go there, I leave with an awesome story.  The last time I was there, this regular was telling me how the woman at the bar is a prostitute while a group of drunk guys pretended to bobsled on one of the barstools.  Good times had by all.  They also have some pretty good live music on weekends.  \n\nI haven't really had any of their food...but once when I went in there for an early drink, I saw some people finishing their meals.  They looked pretty happy.", "author": "kim l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "Coming from a seasoned service industry worker, I tell you that this is a must hit spot whether you live in  SF or are just visiting thus awesomely epic city. I had  the opportunity to eat here recently , and I tell you, one thing I do know is that the cooks they have in the back of house are passionate about the food they cook, and view the establishment  not as just a job they have to pay the bills, but rather a way of life. That culinary art, is quickly becoming lost with thus day and age, and it is good to know they are striving to keep the art alive. I assure you that the creative mind in which  drives chef Daniel, is always something you want to put in your mouth, like just gobble on.... I'm saying, you could eat here everyday, and still have a pallet that gets blown away on the daily. Want some knowledge dropped on those taste buds of yours? Come to this fuggin place! I give this place 5 stars W/O a doubt. And,  there is also a guy with a rad Mohawk in the kitchen... reminds me of Portland Oregon. Anyways,  If you are visiting California, and enjoy good food, then skip this spot and go to In N Out burger... If you want food y'all will want to confess your undying love for from the top of a mountain, go to Durty Nelly's. Then to Alaska, because that was the only location in which I could find a peak high enough to match the epicness in which Durty Nelly's embraces on a consistent basis. Since", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-20", "description": "Way way out in the Sunset, hidden in a foggy sea of Asian restaurants lies an Irish oasis called Durty Nellys.\n\nOn the weekends an Irish band plays to a small but lively crowd of drunk Irish expats. Expect some serious tabletop dancing when Sweet Caroline and American Girl are played.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "I remember it's a Wednesday night. Tons people very knowledge answer all kinds of questions about American culture. (I barely remember names and other stuff... Shame on me! Can't help my pp) I believe their final price after rolling the snowballing, will be over $200! Although I don't have a chance to win... But anyway, it's a small nice place hang out with your real friends. Very comfortable. Friendly folks. Bartender was really nice as well. \nPS. if the lighting wasn't that bright on the Wed. I think i will give 5 stars. lol", "author": "Flora F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-08", "description": "I live about 2 blocks away from this pub - a genuine Irish pub with a geniune Irish bar-tender who, if you happen to be a couple girls who've already had a pint will pour some shots for everyone and do one with you. \n\nOh yes. It's that kind of place. Since it's in the Outer Sunset it seems to balance between being really busy or really quiet. Busy because it's one of the only places around or quiet because - well. It's the Outer Sunset. Either way, it's a great place to be 2 blocks from. Make's the journey home so much shorter.", "author": "Megan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "Lively bar, but not too large inside with maybe 4 booths and a few small tables. Good place to hang out at night, especially around this area on Irving. The night we came here, the entire floor was covered in sand, couldn't feel the floor. Festive.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-02", "description": "I really enjoy Durty's.  if you come here, you will find:\ngood music\ngood people\ngood service\ngood beer\n\nbut the real reason i go here is for the chicken curry fries.  wow.", "author": "Charley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-06", "description": "Love this place. After moving to the Sunset we were looking for a bar in stumbling distance from home and we found it. The selection of booze is great, the food is very good and the staff is awesome.\nThe best thing is the majority of the patrons are Irish and they will take you in and not make you feel like an outsider.\nWe love to drink with the Irish.", "author": "Cassandra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "I'm a regular at the Sunset bars and this one is, in my opinion, the best.  It has the best atmosphere (a cozy living room vibe with a fireplace), excellent musicians (there's not much room to dance but people make it work), and a good crowd; by the time the bar closes, you will know 80% of the people in the bar and will keep most of them as life-long friends.  \n\nThe price is about the same as other Sunset bars, maybe $0.25 more a beer, but much cheaper than downtown SF.  I haven't tried the food yet but it looks absolutely delicious.  Parking is kind of rough around dinner-hour (there are many Asian restaurants in the neighborhood), but you'll always find a spot.", "author": "Elisabeth G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-20", "description": "Hate to do this to ya Nelly's but ya struck me wrong one too many times.  Lived in the neighborhood and just couldn't make this place click despite several visits.  I've found it much easier to dig in at other bars in the area, but for some reason Durty Nelly's always made me feel uncomfortable - like I didn't belong there.  Several times I sat at the bar for ages waiting for the bartender to step away from his crony's to even say hello. The taller guy was the stinker - sometimes, would even help the guy right next to me then walk away.  Met some cool folks at Durty Nelly's and the place always seems very fun, but like I said, just didn't happen for me.\n\nThey have live music which is often fantastic, they have their own kitchen but I've never tried the food and noticed that a lot of the regulars buy food down the street and bring it into the place.  Overall, the atmosphere is incredible, perfect lighting, great decor, but maybe I wasn't Irish enough to be there.  Maybe you need Carhards on to make this place work - not that I ever wore a tie or even slacks.  Dunno what it was, just never settled in - too bad too cuz it was a block from my house - and it wasn't for lack of tryin.", "author": "Jack S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "Irish style pub with great grub. I prefer dark beers and the only dark beer they have on draught is Guinness, their selection of draught beer in general is a bit lacking with only a hand full to choose from. Despite the lack of draught beer, I continue to patron the place for the food and close proximity to my house. My favorites on the menue are: The Nelly Burger, Fish and Chips, Shepard's Pie, and the daily soups.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "My boyfriend and I lived in the sunset for as long as I can remember and this is the first time we've ever been to Durty Nelly's. For our first experience it was awesome! The bar tender gave us free shots just for wearing green! The bangers and mash was awesomely delicious! I loved how they put mushrooms and onions into the dish, and the gravy sauce for the mash potatoes were absolutely yum! The sausage was cooked just right too! I am soo making him take me again, next Friday! hehe. \nThis place has great food! great people! and awesome drinks! \nKudos to the bartender who gave us free shots!", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "great food and drinks, nice place to get out of the cold weather, the food is awesome cooked in a little stove in the back like homemade.  i reccomend the mushrooms appitiezer.", "author": "Louis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-29", "description": "Absolutely love this irish pub!!!!!! Brendan is an awesome lad and if you become a regular, will cut u you a break on beers big time! The other bartender I've only seen once when there was live music...he is a younger lad, very nice and upbeat. Very fun place! Drinks are a bit pricey but the crowds are generally cool and my hubby and I always have a great time. Great variety of ages.", "author": "Maddy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "Awesome atmosphere, very cozy, great music and food. Would def be a local here if I lived in the area.", "author": "Natalia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-24", "description": "durty nelly's is similar to the pubs in the smaller towns and country parts of ireland. it's quite cozy, the patrons are friendly, the bar staff are personable, and it is without the glitz and glam of modern day bars. there are comfy booths and tables, walls adorned with photos and artwork from the emerald isle, and ample space for standing room and dancing. \n\nthere were two regulars; a very cute japanese couple who are in their golden years. everyone appeared to know them, greet, and toast the couple. they warmed my heart as the husband took the hand of his lady and led her to dance to the live band's tunes. they were the only couple dancing that evening. as they exited the booth before their departure, he twirled her around for the last dance of the evening. they were applauded as they left. a prime example of the pubs in ireland where the young and people in their golden years can cohabit ate, and enjoy and imbibe together.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-19", "description": "I don't get it.  the whole left side of this pub smells like pee.  i might understand it if it were like 2 am on a friday but we're talkin about dinner time on a weekday night here.  \n\ni got here with my buddies and we sat down at the first booth.. 3 minutes later we realized that the familiar odor we were smelling was most likely urea.  \n\nwe then left and ate at gordon biersch.. which was also disappointing.  \n\nstill since i was only there 5 minutes i'm giving them the benefit of the doubt and giving them 3 stars.  \n\nplease disinfect your establishment for the next time i come.  thank you.", "author": "William S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-26", "description": "Here is how hard I searched to find something wrong with this place.... I didn't get why they had the singer sewing machine on the wall.  That's it.  That is my majour complaint.  I couldn't find anything to bitch about.\n\nI don't normally bitch.. really, I don't.  But I just thought, a place called Durty Nelly's is setting itself up for misery... but NO!!!!  I walk in and we had a local football game, and an across the pond FUTBALL game.... Newcastle versus Leeds.  I think.... but SOOOO GOOD.  College and premier league at the same time?  So good.\n\nSmall.  Simple.  I got whiskey and a guinness.  They seemed to like that.\n\nGreat gal barkeeping.... quick, attentive... rad.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-27", "description": "I love this place.  I have some friends who live around the corner, so when i go, i suppose that i get the 'local' treatment.  that said...\n\nCurry chips..  HELLS YEAH.  fish and chips...  HELLS YEAH..  regular chips..  HELLS YEAH.  Drunken Irishmen (literally ) playing the bag pipes (upside down bar stool...), at 5PM...  HELLS YEAH.\n\nSeriously, they have live music at nights, damn good food for an Irish pub, good drink prices..  and the owner/bartender is known to just come around and pour shots of peppermint schnapps for no reason other than you look like you have a nice face.  \n\nWhat's not to love?", "author": "Robert R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-22", "description": "I love this place! Stop in for a Guinness and a lamb burger and share some fries on a sunny afternoon, when the door and windows are open. It's impossible to feel you're in San Francisco when you're surrounded by all the wood and Irish locals. Or stop in early on trivia night and have a steak first. Outstanding and worth every penny! Soups are delicious, salads are great and extremely fresh, breakfast is so yummy and huge you can almost feed two. I've ordered more than half the menu over the course of time and have never had anything that wasn't fresh and delicious. Not just good - delicious.\nI feel very comfortable and relaxed in this pub. I've never felt like a stranger. The bartender makes it look effortless and treats everyone like we've always been patrons.\nBut, please, don't go there. I don't want to get there sometime and not be able to get in because it's too popular to hold everyone who really appreciates it for what it is - a great neighborhood pub that welcomes one and all. It's not a fashion show, not the place to be seen, not a place to wheel and deal. Just a nice little pub that welcomes me whenever I show up.", "author": "Marilyn V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "This place knows how to pour a Guinness! Plus trivia night on Wednesday, a friendly crowd, and great bar food!  By the end of the night I thought even I should be speaking with an Irish accent. That is, until I was told I sounded more like Borat.", "author": "Beth J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "Great place to go on a rainy winter's night.  The fireplace (and booze) warmed us right up.  Totally cozy!  The pub food is good.  Fries are great!  The people working there were VERY nice.  \n\nLook for the Irish flag in the middle of all of the Chinese places....", "author": "Summer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-14", "description": "I was here to watch one of the last GIants games of the regular season. It wasn't crowded at all until much later, so the boys and I were able to sit at the bar with little wait. The chicken curry fries are pretty damn good, though maybe could use a little bit of vegetables in it to give more flavor. They only take cash, but that's all made up for since they don't have tax.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-21", "description": "Ah, where to go for dinner on a work night in the Sunset?  Hmmm... we've done Thai a bit too much recently... Chinese?  Nah.  Durty Nelly's?  What the hell, right?\n\nTheir menu is tiny, but it's what you'd expect from a pub.  We had the fish and chips and it was pretty standard.  I don't know what it is about fish and chips; I'm never totally satisfied, but I order it time and time again anyway.  Not much of a beer selection on tap, but they've got a few good choices as well as the ubiquitous Guinness and Smithwick's.\n\nMmm... Smithwick's.\n\nI'll definitely come back here for more than a meal and a beer next time.\n\n...but what's up with Irish pubs and all the old instruments and luggage up on the shelves as decoration?", "author": "Zach P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-10", "description": "HORRIBLE SERVICE!!!  I am 27 years old, I went in with my 2 co-workers, and the manager of the bar wanted to refuse me service claiming that I had a fake ID.  Not only that, he threw my ID on the table laughing saying it was fake, and then to some of his regulars starting complaining that I had a fake ID.  I had to take out my work ID to \"prove\" to him that I was of age.  My two other coworkers who are younger than me were not denied service, just me. Not only that, we ordered fish and chips, and there was a hair in the fish....... What a shame.", "author": "Margaret Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-24", "description": "Love Dirty Nelly's! It is cozy, it is clean, and it is full of good people. They have good food, they have music on popular evenings, and they can really throw a party. I have been going there for years and the only change is that it is more popular now than ever. As far as bars go in that area, this one is a winner!", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-06", "description": "Random dancing abounds in front of, behind and on top of the bar while good music is dj'd, the bartenders keep the drinks flowing and Irish Curry hot. \n\nUnlike most, I was dragged into Nelly's by my new roommates. Though the deal wasn't sealed until I'd downed 3 Magner's, 2 Peppermint Schnapps, and a Cherry Bomb - in the span of 2 hours. I was then told any other pub was dead to me. \n\nSo, I could hang with the big boys and was allowed to rent the small room in the back of the house and \"share a few gud laughs with the lads\" all the while getting completely scottered before being gentlemanly walked home to be dumped in my yet to be paid for room so I could snooze off the booze before stumbling to work the next day. \n\nOh how the coworkers loved the smell of stale liquor exuding from my pores.", "author": "Carrie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-10", "description": "I love it here. I think of it as my neighborhood bar, even though I live in SOMA. I go at least once a week, especially on Trivia Night. My team has won once and we actually have a shot at winning every week. Just the right amount of teams with questions that are challenging, but not impossible.\n\nBoth the beers and questions are served by genuine Irishmen: accents and all. How can you argue with that? I'd give this pub 5 stars on the beer and crowd alone, but to top it all off, the food is fantastic! The fries are an obvious choice, perfectly seasoned and with homemade garlic mayo dip. Mmmm. I also recently had the chicken strips (which also come with the dip!). The batter was super light and crispy and the lime wedges to squeeze over top of them were a pleasant and delicious surprise.\n\nSpell durty any way you want- I will be sure to come back again and again.", "author": "Jennie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-04", "description": "Popped in here randomly one Saturday afternoon. Twas mellow and comfortable.\n\nWe just stopped by for a drink but the food menu actually looked pretty good. I'm not a fan of bar grub but I bet I would enjoy a few things off their menu with a good buzz.\n\nGood place, nice staff, good vibe. \nGood day!", "author": "alexa c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-01", "description": "It is said that San Francisco has the most Irish Pubs per capita in the United States. I'm not sure if that's true, but I could believe it. The problem is, almost every Irish pub in SF is a caricature of an Irish pub. Sure, they have the Guinness, and sometime the Harp and Smithwicks, and sometimes the right whiskeys. But most pubs in this town are so kitschy and outwardly glowing about their \"Irishness\" that I just can't take it anymore.\n\nThat's where Durty Nelly's comes in. THIS is the trust, most justifiable and most honest Irish pub I've seen, not only in SF, but anywhere in this country. THIS is what an Irish pub is. This is how an Irish pub should act and function.\n\nNow, on this street, which is 95% asian businesses, you wouldn't expect this. But I'm fairly certain Durty Nelly's predates those establishments and remains a fixture of old San Francisco. The neighborhood is not conducive to pub crawling, drinking, or even fine dining. I would never come out here if it wasn't for this place. But, it's worth the trip and it's worth the struggle for parking.\n\nSo what's the big deal? Durty Nelly's has every element that is required of a true Irish pub.\n- Owned and operated by actual Irish people\n- Frequented by actual Irish regulars\n- Proud of Ireland but not in a brash or \"St Patty's Day\" kind of way\n- They have Guinness, Harp, Smithwick's, and a Cider on tap\n- They pour your Guinness properly, giving it the 120 seconds it deserves\n- They serve everything else \"Irish style\" such as serving a glass with ice along with your cider (this is one tradition I did now know prior to visiting)\n- Customers mingle with each other and buy each other drinks...regularly\n- They have musicians sitting in the corner, by the fireplace, playing music (some Irish, some U2-type pop)\n- They serve everyone with an equal amount of general interest and disinterest\n- They serve Irish pub food, which I've heard (but haven't confirmed) is pretty good.\n\nAgain, THIS is what you want from a quality Irish pub. Durty Nelly's delivers.", "author": "Tolga E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "Really cute place! Fireplace and everything. When we got there it was really chill but then they turned up the music super loud. It was a bit distracting but overall It's a super cute hang out for people who live in the sunset.", "author": "Victoria F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-22", "description": "We came here because my friend said she always sees people yelling at each other out front and she wanted to go see if we'd be able to witness a bar fight.  Well, it was a Saturday night -- albeit a bit early -- and it was fairly mellow.  But it was great!  A great place to sit back with your friends and laugh over a beer.\n\nWe sat at the very back grungy table near the kitchen, bathrooms and jukebox.  At one point, we could hear jock jams-style music (hahahaha) coming from the kitchen and weird 90's music coming from the jukebox, neither of which was expected.  But it was definitely appreciated.", "author": "Tamara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "This is \"my bar\". Authentic, great company, great staff, BEST Guinness...a real Irish pub. It's in my neighborhood, a total gem of a pub...but I would be more than willing to travel across the city to go here. Trust me, it's a cozy bar, nothing bad about it.\n\nI could go on and on about it,tell long stories about experiences I have in this place, good memories and so on---- but i will keep it simple. Its just the best Irish pub in the city. Take my word for it.", "author": "dur A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-09", "description": "As an expat, I am not ashamed to say that I love a good old fashioned pub quiz. Maybe I am settling into my years but there is nothing more pleasant than going to your local bar and sitting down with a bunch of people to try to guess at trivia you have no idea about. And o, the feeeling of euphoria that is experienced when you 'GET ONE RIGHT'.\n\nThats right folks, ever Wednesday night, Durty Nellie's hosts a pub quiz. And there is no better setting. Durty Nellies has a really comfortable feel - even with my haphazard attendance, I still feel like a local. And for a busy bar, we normally always get a seat. The bartender (Otie?) is really friendly (I too have become victim to the Cherry Bomb) and always welcomes you in with a smile. The regulars are a fabulous mix of characters (Darcy... who has clearly struck a chord with a few). And their food is pretty good - chicken curry & chops, BLT, fish and chips... proper pub fare and done well too. Long may Durty Nellie's reign as one of the best pubs in the city.", "author": "Catriona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-07", "description": "This place was seriously jumpin' after Friday night's Outside Lands fest.\n\nSomehow, friends got a booth, so we were isolated from the crush of people in here.\n\nThe DJ (who was actually just a dude with a laptop) was really cute and played a lot of fun songs to sing (plus requests) so the entire bar, probably mostly music fans, were really singing along. I finally got the \"drinking and singing in an Irish bar\" thing. :)", "author": "Emily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "How many bars can you walk into as a first time patron and be hooked up with free shots of Patron? Probably not that many, but this place is one of them!", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "One of my favorite bars in the city.  Don't come here if you are prissy and afraid of getting your pretty shoes stepped on or a beer spilled down your outfit from J. Crew.  Yancy's is up the street.  This is the kind of place where tables get knocked down on the regular (usually because someone is dancing on it), and you have to dance your way to the bathroom to get through the crowd.  The people are usually decent about stepping aside to let you get to the bar (nowhere is safe from the occasional d-bag).  The bar staff are fun and friendly, and the music is great, whether live or playing off the Mac.  They don't have a huge variety of beers on tap, but they do have a good whiskey selection.", "author": "sara b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-06", "description": "Durty Nelly's is a fun place with live music, it's where we head after dinner at Coco's across the street, but somehow despite the fact that we leave CoCo's stuffed, we always get the Curry Fries at Nelly's, too.  Just watch out if you drink cider, they put ice in it for some reason.", "author": "Crystal B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "Not much to say about this irish pub (i thought we only had these in New York?), except their drinks pack a mean punch! I tried some of Amanda B.'s Cherry Bomb and it was indeed serious!\n\nI must say, extra star for the fact that they let us take our drinks out of this place to Coco's Crawfish across the street!\n\nDrink up!", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "Durty Nelly's is awesome.  I've always walked by it on Irving st. but never walked in.  Well all that changed on Saturday.  It is actually a very nice and cozy place.  With a fireplace, and a couple tables and booths.  Wow, who would have thunk it?\n\nI met the bartender Brendon and also another bartender named Odie.  They are hilarious and super friendly.  Me being perhaps the only asian guy in an Irish bar.  But they made me feel welcome and I had a blast.  \n\nThe atmosphere is just an all around warm and almost homey feeling that made me not want to leave.  Well, after quite a few drinks, and the liquor still flowing, I actually had to get out of there.  But all in all, a great place, and I'm glad to have discovered it!", "author": "Terence P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-02", "description": "Half community center, half bar, half amazing restaurant, half bad with fractions.  This place is really an fantastic place to come for lunch, and quick drink, or a fun night.  The regular crowd are are really friendly people and the service is with a genuine smile.", "author": "Ellis b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "For three years I have been searching for the best Irish bar in San Francisco and finally found it. Big shout-out to Robb for bringing me to Durty Nelly's last Saturday. We spent hours sampling variations of Irish Coffees and hot toddies. Tonight I am going back to try their humble dinner menu. I hear there Irish Breakfast is crazy.\nI have only two small critiques;  1-The jukebox. Looks like it the music selection caters to the college crowd which make me nervous. But at-least there is a healthy collection of Rolling Stones. 2-Not the largest selection of Whiskey. Adding some Bulliet and Eagle would make it complete. Until then, I am happy with Jameson's.", "author": "Alejandro M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "I went to this place to meet some friends the other night.  I was excited because I never go to the outer sunset and it's nice to know that there's some cool hang outs.  Cozy irish bar with comfy-looking booths. I guess they sell food there but I got there at 11pm anyway.  People were pretty cool and friendly too. This was a friday night. I don't know how it is on other nights.  There was a really, really, really drunk girl that passed out at the bar.  She was taken out by her boyfriend.  But repeatedly kept stumbling back in.  I thought that was both annoying and amusing. \nAll in all fun place, good music!", "author": "Liz F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "I've been hanging here on and off with a friend who frequents here. its a little far from home to get my drink on, but... the beers are excellent, food is good, and the bartenders are great. He pulled out some cherry bombs and that basically kept me in my seat for another 45 minutes. always nice to get treated... and its always nice to be in an Irish bar where the majority of peeps are actually Irish. It would be like finding a Chinese restaurant where the majority of the peeps are Chinese.  Its that good.", "author": "Adam X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-08", "description": "I could not be any more pleased to have this as my neighborhood bar. The whiskey selection is plentiful, they have Smithwick's and Magner's on draft and they have great bartenders. I've gotten embarassingly drunk here a few times, but then again that's what you come here for so no one judges you for it. You know a bar is good when the Irish population of the Sunset comes out in droves for it. \n\nBeware of impromptu wrestling matches and flailing limbs during Irish drinking songs.\n\nIf you want to do more than just get hammered they have a nice selection of traditional bar and Irish food. The fish and chips is damn good.", "author": "Don H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "This bar is pretty slick. It has to be one of the busiest bars in the sunset at night. The drinks are decently priced and Ive never had any problems with the bartenders. \n\nThe thing that really wowed me about this place was the good food that they serve during the day. Its not your ordinary bar food. It is really well done.  Ive eaten here about 5 times, and have enjoyed myself on every occasion.", "author": "josh b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-30", "description": "Admittedly, I don't completely recall the night I went to Durty Nelly's.  But I remember having fun.  Vague flashes of dancing on tables and chairs, talking to random people, strong drinks, and people stepping on me.  More or less all of the necessary components for an entertaining night of drunken debauchery.  Except the fact that it took us about a half hour to obtain the drinks to attain the debauched level, which really irritated me while still dead sober.  I got over it though.  And woke up with a scraped knee. I'm choosing to interpret that as a sign of fun-time having.", "author": "Jenny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "So yeah, it's cool there are actual Irish people there, and it's a decent place to watch sports, but why is the Guinness served ICE cold? They should know better....", "author": "Cate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "Durty Nelly's has been my favorite place to go out to since the first time I stepped into inside in December of 2000. Even when I didn't live in the neighborhood I would venture out to the Sunset for the fabulous trivia nights with Peter on Wednesday nights or for a fun night out any day of the week or weekend! Their new chef is a great addition to the Nelly's family and of course I have to mention the fabulous bartenders who I am happy to also call my friends. Nelly's is truly my home away from home!", "author": "Elisabeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-11", "description": "This is the absolute best Irish bar in SF \nIts a bit out of the way (about a 20 cab ride from downtown) but so worth it ..\nplus you get to see the ocean and a much cleaner part of the city\nIts filled with irish people, great juke box, big fire place for cold days\nfantastic and cheap food and great drinks\ndefinately come here when in SF", "author": "maryanncolby"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "Durty Nelly's has so far been my go-to chippie (someone who does fried food, especially \"chips\" and fish) in San Francisco. The key things for me have been having Smithwicks and Magners (Apple Cider) on tap while keeping an orderly house, the bartenders are very good about stopping trouble from having a chance to start. The kitchen is basic but satisfying, but be aware that the portions of some items are not going to be \"steakhouse sized.\" Personally, the Irish Breakfast as well as the fish & chips are my favorites.\n\nThe jukebox is something that KFOG, 107.7 The Bone or Alice@97.3 radio would be fine playing, plus some folk and other mixes, in addition to the staff's ipod. The crowd gets a bit mixed later on the night, but there is a mix of clientele that usually ranges from the late 20s to the 40s.\n\nThis is place that I go to in order to meet up with friends, to have a quiet pint, or a leisurely early-evening dinner. There are a few ATMs in the surrounding neighborhood, so grabbing cash on the way is not much of a hassle.", "author": "William F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-27", "description": "people say koreans are the irish of the east. i think the irish are the koreans of the west. we drink, we fight, and we drink some more. we both have uptight nieghbors which we cant stand, *cough* japanese, british... *cough* and we both are the largest producers and/or consumers of scotch whiskey in the world. \n\nive been here a few times, most of the time with amanda in tow with cherry bombs in hand, so you know its gonna be a fun time. \n\ni have no qualms about supporting the last signs of whiteness in chinatown III. these guys seem like good folks. i loved their curry fries, and the drinks were stiff. \n\nfun times.", "author": "Euge L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "You walk into Durty Nelly's and you feel like you were transported to a lodge somewhere in the mountains.  They have plaid curtains, a wood interior and a roaring fireplace.  There are typically several Irishman around the bar sipping Guinness after a days work and on Wed. they have trivia night - which I still have yet to make it too but, will soon!  Its a very nice Sunset Tavern.", "author": "Kra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-01", "description": "This is my neighborhood bar where I hang at. I will venture across town for fun and games and then stop here for a cocktail or two on my way home. The bar changed ownership about a year ago. It is owned by a handsome young Irish lad now. The cook serves food til 9 pm. He can make some really tastey Irish dishes (Fish and Chips) and he takes requests for specials. The food is what makes this place rock!\n\nso a new cook has taken over- she rocks! Brandon rocks! Live Music on Saturday rocks- Odie or Sabbath- both are great!", "author": "Johnna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-01", "description": "i love durty nellys so much that i hardly let myself go anymore because every time i go, SOMETHING happens.\n\ndon't go on quiz night or any busy night where a buncha white kids are gonna jack your vibes. go during a sunny afternoon and be surrounded by oirishmen and drink endless delicious draft ciders (w/ice, of course). then the bartenders will keep you giving you strange cocktails called cherry bombs to shoot. then suddenly you are very drunk. and your tab is only 5 dollars. but you always get home eventually.\n\n25th ave is the way to go for real. legit.\n\nalso you can get CURRY CHIPS here which is the most important thing. i went to an irish pub here that served me chicken and chips with a side of ranch. horror.", "author": "jessica s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-07", "description": "5 Stars all the way after digging into a batch of Chicken Curry with chips (french fries). Yum! Plus, the cider wasn't that bad either. I just fell in love with the SF yelpers joining in on the fun here. Not a big place to hold more than 20+ yelpers in a small pub...it's okay! I enjoyed brushing up against someone...I mean, nevermind. The music...listening to a guy sing ol' school music to mainstream music you hear off the radio...a big plus because everyone was rockin' it out by singing along with him. The owner was nice enough to give Manda Bear cherry bombs to a couple of yelpers....on the house! woohoo! Love it.", "author": "Fraulein C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "oh shit. this place serves food?! i did NOT know that.   i always thought this place was a bar and only opened at night. \n\ni came here for lunch. no alcohol for me. food only. i cant go back to work smelling like beer. *sad face*  i ordered their BLT. omg, it was sooooooo delicious! probably the best BLT i've had in a while. err, on irving street.  their french fries were really good too. not too greasy. and i think they might have been fresh. it didnt taste like they were from the freezer. anyway, i really liked my meal!\n\nso i got my bill and my total was $7 (which is the price of the BLT). what?! no tax?! o-well. i'm not complaining. i'll be back to try their other food.", "author": "B B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "It's always a good time at Nelly's. Friendly bartenders, happy Irish drinkers, and you won't want to miss out on a conversation with Darcy, a Nelly's regular. He's been there pretty much every time I have, and depending on how drunk he is, his stories and jokes are definitely memorable. The food at Nelly's is also really good, especially the fish and chips! I will definitely go back for those again. My only complaint is that on friday and saturday nights they typically have a guy play acoustic guitar for entertainment, and I promise you he will butcher the hell out of all your favorite 90's alternative songs. But at least everyone there is enjoying it and having fun, and it makes for something you can laugh about the next day. \n\nGo on a weeknight, drink a guinness (or smithwicks), eat the fish and chips, and talk to darcy. I'm sure you'll have a great time.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-07", "description": "I love curry fries.  They are a heavenly combination of the two best things in the whole world (fries, and curry).  Whoever thought to combine them was a genius.  When I moved to SF, I went on a mission to find good curry fries (because driving to San Jose to get them at Trial's seemed silly).  And I was excited when Yelp pointed me to Durty Nelly's.  But Durty Nelly's did not live up to my curry fry expectations.  I was sad.  I will keep driving to San Jose.", "author": "Meghan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "Super friendly bartenders, great neighborhood feel, warm fireplace, open booths, fun quiz night. Only problem is that the draft beers are $5.50 and the tartar sauce is super runny.", "author": "c t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-17", "description": "This place ROCKS!!!!!  I walked in and felt a bit out of place as the bartender knew everyone in the joint except me and my girlie.  However, everyone turned out to be super friendly and welcoming.  The bartender was serving drinks to people before they even ordered (\"they're all regulars - I know what they like to drink\" the bartender said with a lovely irish lilt).  We ordered some chips (french fries) which were delicious with our guinesses.  Next time we want to try the curried chicken and chips.  I wish I lived closer to this place so I could just stumble in when I was thirsty.", "author": "Curtis H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "Not typically my kind of bar scene, but it is a rather cool Irish pub. This bar is consistently busy, always with people partying inside and out. I went there on St. Patrick's Day and it was PACKED. But what impressed me the most was the steak dinner I had there sometime after. Everything was done perfectly and went great with my glass of guinness. No complaints, it's a classy bar in the sunset that knows how to party and make great food.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-12", "description": "While the black and tan wasn't properly poured, best bangers and mash I've had in San Francisco, maybe ever, and really nice people.", "author": "Grant M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-07", "description": "Great neighborhood bar.  We recently moved here from Wisconsin and coming here we were warmly welcomed.  Lots of great conversation.  I cannot wait to go back.", "author": "Matti S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-02", "description": "Brendan the bartender is second only to Brian from Martin Macks (now Danny Coyle's) in best-bartender-ever status.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-01", "description": "So I reviewed this bar YEARS ago and complained that it's not a friendly place for people of colour, and, as it turns out, queer people are not welcome either. Avoid.", "author": "Amiee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-22", "description": "I don't live in the bay, but wish that I did so that I could go to this place all the time!  My friend lives in the area and frequents the Irish bars quite often.  Naturally, when I was in town for the weekend we hit up Durty Nelly's.  One of the bartenders, I believe his name is Odie, was playing live music in the corner by the fireplace all night long.  He sounded awesome too!  People were dancing and have a great time, especially an Irishman named Darcy.  He was a dancing machine! Good times, good times...", "author": "Caitlin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "I guess I could consider Durty Nelly's my local, though I don't really go there regularly enough.  It is as authentically publike as you can get in San Francisco.  They have decent pub grub (curry and chips, shepherds pie are both pretty yummy) and, of course, Guinness on tap.  Not a huge selection of beer, but when you have Guinness, what more do your really need, now really?  They don't even seem to mind that my husband is English, so that's a plus for an Irish pub, too. ;) Friendly bartenders and clientele.", "author": "Cami B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-22", "description": "What more can you want from a neighborhood bar?  Friendly bartenders, ever flowing Jamesons, a cozy fireplace and decent food.  The fact that its walking distance isn't bad either, but its worth the trek even for those that live more than seven blocks away - especially on Wednesdays for trivia!", "author": "Jenny E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "This officially became my favorite bar after a group of random people with Irish accents started talking to my friends and I. We shared stories, had drinks, and it was one of the best nights. Since then I returned several time and the trend I see, is the people that come to this bar are so friendly and fun, this includes the bar staff. The service was amazing and the drinks were cheap and strong. The best nights to go are Wednesdays for Quiz night or Saturdays to listen to some live music. I just wish I lived closer, because I would be here all the time.", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "This place is great and I highly recommend it, but it's definitely a $$ kind of place.  I hadn't been here in a while and was looking for good, warm, cheap dinner.  What I got was a delicious dinner that was more than I had planned on spending now that I'm jobless.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-07", "description": "I've been into this bar a few times with the bf and love it.  Friendly neighborhood bar, the staff is attentive.  They remembered us after the first time we had been in.  The drinks are strong, prices reasonable, music is good, and it's a fun crowd.  They had live music the last time I was there which was a nice touch. I've only had the food once and it was good.  I love to drink in the neighborhood and the fact that it's an Irish bar never hurts!", "author": "Dominique K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-10", "description": "Hate is a strong word overused by humans, but I come close to seriously wishing I had a bomb so I could blow this place up. My friend Al said it best when he is like ,\"go to this place and you are asking to get into a fight.\" The music is fun, lots of covers of songs , but the crowd is too sloppy for my liking. My friend almost had a table fall onto her because dudes were wrestling ...and people are dropping drinks left and right. If i wanted an anxiety attack id drop acid again", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-17", "description": "Best bar in the sunset hands down. The Riptide is okay, but this place has a fireplace, and a big wooden Ireland on the wall. Cozy and warm, just the way a neighborhood bar should be. The Irish breakfast is great, especially with a black and tan. Don't be afraid to get a little Durty...oh man.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "i seriously felt like i was in ireland.\n\nevery person i talked to had this irish accent. I LOVED IT!!!!!\n\ndurty nellys im deducting a star because you dont take CARD!!!!!\ni couldnt pay for a full round of drinks because i was short $10 (thank you angela for spotting me) but still thats an embarrassing story.\n\nanyways. i organized my friend's birthday extravaganza and i had everyone come here and what a joyous occasion it turned out to be. everyone had a glorious time.\n\nthis guy was in the corner with his guitar singing songs and he let one of our friends take the mic to toast to our friend and everyone was into it. i met this old lady granny omally and she was wonderful, throwing drinks back like it was 1954! bartenders were quick and so chatty. i think the guy who owned the bar bought all my friends (there had to be at least 15 of us) a round of shots.\n\nnicest people ive ever met here. everyone was talking to everyone. GREAT ATMOSPHERE.\n\nbe careful though...it may be super freezing outside BUT its HELLAAAAAA hott inside.", "author": "A. V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "This place is sweet!  Came here during the day on a saturday and it was decently full of people.  Seems like a lot of Irish people hang out here, and everyone was really friendly.  Nice staff, and the food is actually really tasty!  If you're looking for a good pub out in the sunset, then I would definitely say stop in for a pint and a burger.", "author": "Kristine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-12", "description": "Nice bartenders, laid back local crowd, cold Smithwick's, warm fire, amazing chicken curry chips. What more do you need to know?", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-09", "description": "Local little Irish gem in the heart of the residential area. Discovered this randomly, and totally love the atmosphere. Am looking forward to the next trip. It's not too big (part of the charm), and you'll be lucky to get a seat. =)", "author": "Sue Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-02", "description": "My fiance and I were looking for a good fish and chips place and found this pub on Yelp.  Now, it's not the proper chippie I was looking for, but figured we'd give it a try since we were in that area.  The Guiness I had was GREAT-- poured the way it's supposed to where it's stop, settled, and then topped off with the proper amount of foam.  I wanted to try the chicken curry chips, but I went ahead and did the fish and chips even though my fiance was already ordering that too.  It wasn't so bad that I didn't eat it, but it definitely was not the best fish and chips I've had.  They used tilapia for the fish, which I've  never seen anybody use for fish/chips.  It was on the overdone side-- a little too crispy and a little bland.  Despite my lack of enthusiasm for that dish I would probably go back and try other items from the menu and have another good beer.  It was early and pretty quiet in the bar, but I'm sure the vibe there later on is good.", "author": "LyraM45 H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-28", "description": "This place is worth the walk into the Outer Sunset. It's a more intimate pub than the Blackthorn Tavern, so you can carry on a conversation. And the fireplace is quite cozy. I highly recommend the food; their chicken curry and chips is to die for, just like the curry'n'chips truck in auld Oxford.  B had the Shepherd's pie, and it came with little delicious fried mushrooms (who knew those existed?) and the pie itself was decent. I will certainly  return.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "Went on a random monday night with my boy---yes, i know what youre thinking, semi alky status. Walked in and there were definitely a sparse amount of people inside, but they all looked like regulars. comfy, cozy space---and even a fireplace!!! The bartender was amazing; he gave us a sample of the beers before we decided on what to get. I of course had to settle for my renowned Guiness, and the boy settled on a Blue Moon.\n\nWe bought 3 songs on the jukebox for a buck, I was groped by a random Irish drunkard who asked me if I had been 'blown in by the northwest wind?', had a conversation about how being a samaritan resulted in another drunk patron's broken leg, and scored a free hot toddy by the bartender who was cherry bombing it up with the rest of us lonely monday night drunkards.\n\nfive stars.", "author": "Nicholas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-06", "description": "This is hands down, 100% my favorite pub.  This is where my friends take me for my birthday.\n\nThe chicken curry and chips is fantastic.  Think about it: take the deliciousness of chicken curry.  Throw away the boring rice.  And serve it on freshly made frys.  Perfect.\n\nAlso, Durty Nelly's wins for fastest buy-back ever.  First time there my friends and I got a round of Guinness, dinner with beer, and then a third round.  Then, magically, more Guinness appeared in front of us courtesy of the house.  My jaw dropped.  (Ladies: This is really good for three ugly dudes.)\n\nAnd I love that this pub feels like an actual public.  It's cool to see family's having dinner there before my fellow drunkards show up.", "author": "Dolla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "I discovered this place running through the rain in the sunset with my new gentleman caller a few weeks back. We ducked in and were met with a roaring fire, an atmosphere straight out of the homeland, and the best Guinness I've had since I don't know when. We curled up on a booth and ordered wonderful food, all bready-buttery-warmth, within 5 minutes we felt like it was our own private hideaway. We've been back and feeling hasn't dimmed....this place is what an Irish bar should be.", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-09", "description": "Oh man, what an awesome night.  Durty Nelly's totally erased the bad taste in my mouth that Balboa Cafe left earlier that evening (my god that place was awful).  I walk in and people are shouting and cheering and ripping off each other's shirts and dancing like crazy, and immediately all the Marina grossness faded away.  Got a Guinness and put on my figurative dancing shoes and had an awesome time.  And what Irish bar would be complete without two guys completely passed out at the bar?  They were funny to watch--it's a real feat for an unconscious guy to stay upright (and keep his drink upright) while passed out on a small bar stool. Music was great, people were great.  The drive out to the Outer Sunset was NOT great, but I'd do it again just to get to Durty Nelly's.", "author": "Gina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "I love Durty's!!! Not only is it a rad and pretty authentic Irish bar, but it has amazing food too! Bangers and mash, chicken pot pie, and an EXCELLENT steak sandwich. This is a really cozy bar, with a small fireplace, a locals feeling, U2 often playing over the speakers, and friendly bartenders and service. The bartenders have offered me free shots a few times when I've been there, and that is always a really nice gesture. Overall, a great place to grab some brunch, drink a Smithwicks, and listen to some tunes or watch some sports.  Cheers!", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-19", "description": "Had a post bday, st. patty's day celebration here. It was packed as you can imagine. Fun DJ, nice crowd. My only complaint is that the bathrooms have been sub-sub-standard here any time I go - whether middle of the day, no one else there or packed on St. Patty's. I know, it's a bar, but still. Otherwise, good bartenders, good service, decent prices.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-01", "description": "Went out exploring and ended up at Durty Nelly's.  We certainly could have done worse!  There was a one-man band rocking out in the corner with some U2 covers and other classic (apparently) Irish tunes, and the crowd ranged from 20-somethings out for a fun Friday night to 50-somethings hitting on those 20-somethings.  It was nice to see that inter-generational bonding.  Strong showing by Durty Nelly's.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-08", "description": "A diamond in the rough...No...an Irish bar in the middle of an Asian block. That's not terribly unique in the Sunset, but Durty Nelly's is. A neighborhood bar with international appeal. Trivia Night (Wednesday's around 9:00) attracts folks from everywhere, as it did the night I won with a tourist from Chicago. Pay a visit. Nelly's is a small, friendly bar with tasty pub food and a welcoming fire.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-05", "description": "I love this place.  Its everything an Irish pub should be.  There's good food, good beer and I don't feel like someone is going to call Child Protective Services for bringing my kid.  There's even actual Irish people.  Who could ask for more?  I love their Chicken curry and chips or Shepherd's Pie.  Perhaps its because I usually go here on a weeknight or early Sunday, but its never too too crowded or rowdy and the service is fast and friendly.  And its loud enough for no one to hear my toddler yelling at everyone, or they're too drunk to notice so its a win-win situation.", "author": "Farah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-04", "description": "i have had a lot of fun drunken nights at this place.  Everyone is always friendly and i am always able to get a drink quickly even when the bar is full to capacity.\n\ndefinitely recommend it for a casual night of fun", "author": "callen a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-06", "description": "Sweeet sweeeet irish breakfast.  Yum blood sausage.  Bartender and patrons very friendly... one of them bought a round of CA Lotto Scratchers and I won $7 with which I bought him a pint, thus enriching my karma.", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-22", "description": "When I used to go to this place, all of my friends lived in the Sunset and I used to live right around the corner from this place. Granted, we weren't going 5 nights a week, but we'd give it a shot once a weekend, and no matter how many weeks in a row we'd go, we'd always get those \"looks\" from all the diehards. It is definitely a neighborhood bar. The bartender is awesome, I've met some VERY friendly Irishmen but overall, not good enough to overlook the awkward intro and the extreme overcrowdedness.", "author": "Sachi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-22", "description": "Had a craving for a Guinness, and some Irish stew,  so I head over to Durty Nelly's for the first time to scratch that itch.  Unfortunately, they did not have Irish stew,  but they did have fantastic fish and chips, and a pretty good shepherds pie.  The pint of Guinness washed down the meal perfectly, and the atmosphere was quite nice, which draws the local Irish crowd from the surrounding Sunset area. Now, if I could just find a place to get myself some Irish stew.", "author": "Lucas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-06", "description": "Another great Irish bar in the Avenues!  Cute, cottage setting with great artwork and wonderful people.  Drinking with Vivian, the owner, cracking up with Finnebar, the comedian, taking shots with Maria, the adorable barmaid... it's hard to even think you're in SF until you notice the Chinese folks dancing to Irish music and the multi-national med school table drinking Guinness.  But that's the beauty of it all... everyone loves the Irish!   Maybe I like this bar a little more because my family is \"very Cork\" but I'll be back in when I need numerous laughs, countless pints, and unforgettable nights.", "author": "Tara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-06", "description": "Very friendly bar staff and patrons! The food looks good too, but I haven't tried anything yet. I will definitely return since it's in my remote hood.", "author": "Megan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-28", "description": "This place may be the Michael Jordan of people watching spots, especially if you have a fondness for Irish-style drunkenness. Do not drink with the 10-year-olds underfoot -- they will drink you under the table, and then grab your wallet. The bartenders are inventive, generous and your friends. Unless you're not friends to them. Bonus: my bank is across the street. ATM trips with no service fees for the win!", "author": "Arsenio S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-25", "description": "cozy placed tucked between a bunch of chinese restaurants.  cheap drinks, cozy atmosphere and a bartender with a true accent.  \n\none star short from a perfect neighborhood bar because despite being 5'8\", the urinals in the bathroom were still nailed in a lot higher than comfortable.  \n\nbitter?  nah.  embarrassed?  a little.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "I'm kind of torn on this review because on the one hand we came here to hang out with a friend's Gaelic Football team and the club said drinks were on them all night so my fiancee and his friend got tanked for free which is always nice. There were also quite a few rowdy Irish footballers here and I'm talking seriously rowdy. One of them was swinging around what looked like an ornate metal door handle he'd torn off something which let's face it is kind of awesome. But on the other hand the people were a little too crazy for me and there were like three girls in the bar out of like six total girls that were obviously drunk and being passed around and manhandled amongst all the guys which is frankly kind of gross. I think I'll give it a middling three stars.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "my friends and i yelped about for a place to meetup and drink before outside lands.  when we got here, half the N train car we were in were here too.  bartenders were super nice and on the ball when attending the bar and though we didn't get food it looked/ smelled pretty damn good when we saw it stroll by.\n\nat one point 3 of us looked around, looked at each and than said, there's a lot of good looking people in here- this is a really good looking crowd.  not 23 and hipster but 30 and well, just flat out good looking. there were even groups of good looking people.  can you imagine living in a world like that. i guess its right here.\n\ni'm coming back.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-03", "description": "I have been frequenting Nelly's since 2000 and it still remains one of my favorite bars in San Francisco! Maybe I am a little bit biased since I know most of the bartenders (well, all of them actually) and get awesome treatment while there. I stopped going for awhile after moving to the east coast, but what I love about this place is that you can go back after 4 years of being away and all of the regulars remember you, and welcome you back with open arms! I also love trivia night, their food (steak sandwich, fries, everything!) and best of all the bartenders and the Irish lads and lassies (and non-Irish people too!) perched on stools, dancing on the booths, or just sharing intimate chats in the booths as the fire place glows in the background. Ahhh, there is no place like a bar that feels like your living room.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-10", "description": "how can i not give 5 stars when i walk in to a bar where there's a hawaiian guy singing hawaii songs and dancing couple who's combined age equals more than me and my 5 friend's combined ages!\n\nawesome bartenders\n\ngreat decor (for a dive)\n\nnice location\n\nfun times.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "Pretty sweet neighborhood bar. Food, beer, bartenders all good, nothing to complain about. The burgers and Irish breakfast are satisfying. Chicken sandwich was bland, don't bother. Obviously you're here to drink though, and they do their alcohol and beer well. There's usually a fun crowd, and if not you can entertain yourself listening to U2 and people's Irish accents. Definitely worth checking out.", "author": "Jasmine O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-15", "description": "I got a free birthday drink so that was good. Unfortunately I cannot go higher than 2 stars because the smell was unbearable... even for a dive bar. I'll never go back there again. I'm sticking to the Dubliner.", "author": "Ruth R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-09", "description": "I haven't tried the food (although I hear it's decent), but the second I parked outside and saw dudes with flipped collars, ridiculously stressed jeans, and ed hardy hats smoking outside trying too hard to get in some girls pants, I began to regret inviting all my friends. Beer was fairly priced (Smithwicks on tap always wins a few points for me), but everything else was a nightmare. The DJ couldn't stop blaring typical bullshit like Journey and Akon and the bathroom was literally the size of my closet. Trust me, there are MUCH better pubs in the area.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-19", "description": "Stumbled upon this place in yelp and must say it's not so bad. I don't think it deserves the 5 stars it has gotten, but it's a good irish pub. Drinks were so-so, I wouldn't rate them as any better than other pubs but the atmosphere was great", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-18", "description": "Great fish and chips, plenty o' beer, plus a fire place for those foggy San Francisco nights!", "author": "rebecca c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "Sweet spot!  one of the first couple spots I went by in Frisco... And Brandon the barkeep IS the man...  had plenty fun there...  plenty shots there...  and plenty crazy nights there...  do have to say that from time to time the mix is pretty one sided...  and it can get crazy hot in there too...  like BO and too much cologne...  it gets stinky...  haha... anyways...  still an awesome spot though and looking forward to the next time I'm there...", "author": "Anthony Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-14", "description": "My husband and I are quickly approaching regular status at Durty Nellys.  This is because it is such a cozy and normal bar (which is difficult to find in the Sunset).  The food is good too.  I'm a big fan of the chicken sandwich with a few Stellas at the end of a long week while enjoying the warm fire place.", "author": "melissa o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-14", "description": "Great food, excellent service, and a cool atmosphere.  The location is perfect for me (as I live down the street) so I can't complain.\n\nThe food here is no ordinary bar food.  It's actually the best American food around.  The burgers are crazy good -- throw an egg on top for a good treat.  The steak sandwiches are actually made with steak.  The curry fries give you a unique lunch.  The fish and chips are crispy and to die for.  Everything comes with \"chips\", which I guess are just really tasty and fresh french fries.  As a bonus, everything's cheap.  If anything, the food is a bit of a downside because it's so good, people are bringing their families here.  You will usually find 2 or 3 kids running around this place around dinnertime.  :(\n\nThe service is totally spot on.  The bartenders quickly make you a regular and have your next drink ready before you can ask.  The prices are totally reasonable for the city and are lower than more populated areas.  The owner is an awesome dude known to buy rounds for the regulars.\n\nInside there are enough booths that you can usually get one.  It turns into a club type place on the weekends, but I prefer to come here in the middle of the week (if not the middle of the day.)\n\nDurty Nelly's -- the Cheers of the Sunset.", "author": "Dean A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-09", "description": "Nelly's is an enduring element of the Sunset around Cal 1.  Yes it is an Irish bar, for better or worse, however it is a great place to have lunch or a late dinner.  The food is better than most pub fare in San Francisco.  The chicken sandwich, in particular, is phenomenal (yes, in terms of pub fare).  Late nights can be a bit iffy, especially if the lads who frequent the establisment are hot-blooded; still, it's always interesting to hear the songs they sing at 2am.\n\nDurty Nelly's has both beers on tap and bottled beer, they also have an extensive bar.  One has the impression, however, that much of the hard alcohol has been sitting untouched for years; well, the alcohol that isn't whiskey anyway.  The clientele are VERY Irish, and the bartenders reflect this.  There is live (cover) music most weekends; the choice of music reflects the Irish clientele.\n\nThe bar is packed on weekends, and it is a local gathering place for the Sunset Irish.  On weekdays it is rather less busy, and a good place to grab some grub if you have time for lunch.  The kitchen closes rather early but given the crowds at night it is completely understandable.\n\nIn all, a great place to have a pub-style lunch during the week and a must for anyone who wants to get a taste of the Sunset Irish culture.  Weekends in particular have a good crowd, full of songs and great stories but relaxed and safe, as far as San Francisco Irish pubs go.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "The very tasty $10 chicken curry fries are big enough to feed 2-4 people. Plenty of curry sauce, lots of moist, white meat chicken on a mountain of fries make this a winner. Not the most complex curry, but very very tasty bar food. I liked that an older couple (in their 70s maybe) came for a few beers and appeared to be regulars. I wasn't expecting the music though! A few of the bartenders and customers started singing the Black Eyes Peas when they came on.", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-07", "description": "why cant there be an irish pub like this in my city or san mateo county hahaha....i came upon this this lil shack while cruisin the aves~which i should do more often....it for sure had a very irish feel to it..every1 @ the joint (including the bartender) have the accent...the previous yelpers said they serve food =(...maybe sum fish/chips wouldve went well with my couple of glasses of guiness", "author": "elmer d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-05", "description": "beware of the racist assholes at the bar!!  i couldn't believe it.  never in my life have i been confronted with such an ignorant and racist lowlife at a bar/pub/restaurant in san francisco.  it was very disappointing.  the jerk just told me that they didn't like my kind (i am asian) and that i should leave.  i found it particularly offensive as i am actually from the sf bay area and he clearly was not.  thankfully he left instead and i enjoyed the rest of the evening with my multi-cultural group of friends.  there were some friendly people there as well, and the bar staff was cool.  not at the top of my list for a revisit.", "author": "melita s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-04", "description": "ugly Betty just called. she's found a new place to bring her chickies", "author": "Prima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-09", "description": "It is literally impossible to come out of Durty Nelly's sober. I've gone in for fish and chips at lunch only to come stumbling out after dark. The bartenders are great and they really get to know the locals. I've probably paid for all of three drinks since I started coming here last year. They have live music on Saturdays, and oh if only I could pay homage to whomever invented their cherry bombs. The best part? This place is about 5 minutes from home.", "author": "Michele L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "we came here for a low-key, monday night celebration on my boy's 21st birthday. there was barely anyone there but we had fun nonetheless. the bartender bought us a few songs on the juke box so the boys could air guitar to pink floyd. a very drunk irishman who we couldn't understand did a bono impression for us for no reason at all. i will be back to bring out my quarter irish-ness, drink more guiness, &, based on the other reviews, try some of their grub.", "author": "Lizzy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-27", "description": "heard about this place for a long while and decided to check it out.  friday afternoon i was tryin to beat the fog and popped in for a pint, robbie the bartender and his highlights served us with great speed and focus.  it was a great night except for the constant interruptions from this drunken guy who looked suspiciously like tori amos! he obviously left his sense of humour home that day! will go back though staff and punters totally awesome!", "author": "dan m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-22", "description": "If this place was closer to where I live, I think I might go here once a week.  A great little Irish pub.  They pour a perfect Guinness.  I had the Shepard's Pie and loved it.  My buddy had the burger w/ cheddar and said it was \"better than Polker's\", which means pretty solid.  The atmosphere of the bar is awesome -- I think the fireplace really adds a lot.  Granted, I was there on a Sunday night, but the clientele was not a real selling point -- a little older, but that shouldn't be too surprising given the neighborhood.  Also, while the girls they hired to greet were pretty, I found the whole putting green beads around my neck a little annoying.  It was Sunday night, not Mardi Gras.", "author": "Luke P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-11", "description": "Very nice pub with great atmosphere and loads of Irish expats.", "author": "Elise U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-04", "description": "This place is great! I went on a Saturday night to meet up with a bunch of my Irish guy friends --- clearly, the right crowd to be with at an Irish  bar, I was given a free shot as soon as I stepped up to the counter! But apparently that's a common practice, which is uh, amazing? Great bar tender, busy but not overcrowded atmosphere... and a fire place?? If you ever want to meet up with me, well, now you know where to look first...", "author": "Etta A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "I'm not much a pub/bar rat, but I love living near Durty Nelly's - Irish or not, it's just a warm, friendly place to stop in for a drink.  We've gone on weeknights, weekends and holidays - and there's always been room at the bar for us, although I prefer the booth by the fireplace - esp on a classic foggy SF eve.  Big booths on one side, bar on the other, jukebox in the back (healthy supply of Irish bands, natch), and smattering of tables/stools in the front.  Wandered in on Halloween last year not in costume - snagged a table for 6 and had a super fun time.  Heads up that it's a cash-only bar, but there's an ATM at the corner of the block...  Haven't been for food or game night yet, but the menu looks tasty...", "author": "Joan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-13", "description": "i ordered a vodka tonic here last night and when it was served to me i could have sworn it was soda water and not the tonic i asked for!  i know what that taste like and i also know it's one of my least favorite tasting things! the bartender insisted it was tonic and i sat there with looking at my foul tasting cocktail knowing that i had to be a nice girl and drink it no matter how much i didn't want to. the bartender comes back and must have read my mind or the look of sadness must have been obvious because he apologized, took my drink and served me a fresh one. he should have said, \"ta da\" when he served it because he gave me a glass of magic! you know that happiness you get when you reunite with a long last love? Yup, that's what it tastes like! it tasted just like i wanted it to and he was so nice about it too! i was hoping to not become that high maintenance bitch patron they all talk shit about right before i came in or behind my back when going to the bathroom. \nso why just 3 stars? well next time i'm going to order fish and chips to see if it deserves 4! \nalso, i'm convinced that all Irish pubs have a steady soundtrack built into their jukeboxes furnished by U2 and the Cranberries!", "author": "Alexis D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-29", "description": "Cute place, felt like I was back home again :) It's intimate and comfy.  The rum and coke was mixed just to my liking.  The owner is really sound and he remembered me from like a year before!  Great little place no fuss just nice drinks music and fun people.  I have not yet had the pleasure of eating here so I can't review that aspect.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "I wouldn't have believed anyone could improve on a BLT.....but Durty Nelly's BLT is by far the best I've ever had.   It goes down nicely with that ice cold Smithwick's", "author": "Joyful Jenny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-09", "description": "came here this past Wednesday night. my brother suggested durty nelly's as he needed a drink after a long day at work. when we arrived, there wasn't anywhere for everyone to sit ( our party consisted of 3 guys, 2 girls). we saw an open table for 6 except there was a backpack on the far end of the bench so we thought someone may be sitting there so we waited for someone to sit there, no one showed. so, i sat down at the very far end, upon doing so, this woman who was drinking at the bar turned around, saw that we were about to sit down and, raced to sit at the table. she grabbed some coasters from the bar and meticulously laid them out, showing us that she was waiting for her party to show up (?) i got up and  we all sat at some loose small bar tables, ordered some drinks and finally another table opened up. during the entire time we dined, this lady's party (at the biggest table in the place) NEVER SHOWED UP! WTF. oh well, it was really more funny than anything.  so once we sat down, we ordered our food. the only veggie option on the menu was a grilled cheese sandwich, so that is what I ordered. my bf ordered the Grilled Ham and Cheese and the rest of the table ordered the following: NY Strip Steak (which was well received), Shepherd's Pie, and Fish and Chips (which got rave reviews about how amazingly moist it was) and they all ordered salads (which all 3 didn't have enough dressing). I ordered a snakebite and a guiness, boyfriend a couple ciders, the rest of the table ordered a bombay Sapphire martini (up), a couple smithwicks and another 2 Guinness's. after we were all full and happy, we got the bill which was over $100 (but not too bad for 5 ppl. and drink orders). We decided to put it all on one card and upon paying the bartender was very snippy and said that they only accept cash. 2 ppl. in our party ran out to the bank, we payed the bill and left. Overall it was good food in a nice small locals bar atmosphere with some excellent food and beers, but you have to  get there in time to procure and table and bring plenty of cash. so, because there was no apparent sign age stating that they did not accept cards, i give this a lower rating.", "author": "Robin H."}
