{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "If you're in the outer sunset/parkside area, you know how hard it is to choose which local pizza to deliver/pick up. I've ordered from Eagle Pizzeria a few times now and I can honestly say that I have made it a habit to order from them as a first option!\n\nFood:\nSimply delicious. I really appreciate the quality that goes into each pizza. From the hand-formed dough down to the fresh toppings, You don't feel like you're eating pizza made from some teen at Domino's who's just there to earn a check. Pizza is definitely a passion at Eagle and their pies are very delightful to eat. My go-tos are Eagle Special or Meat Lovers. \n\nAmbiance:\nNever dined in, but the place makes me feel like I'm in a little league team who's celebrating a win. \n\nService:\nNever had a problem with service.\n\nParking:\nManageable, but might have to park a block or two away.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Customer service was excellent, very attentive and caring. The garlic cheese bread is my favorite! \nHighly recommend this place", "author": "Vivian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "The three of us got two medium pizzas to share and we each had another meal to take home.\n\nAmy E - comes with sausage, jalapeños, mushrooms and onion\nThis was my favorite out of the two choices we got. The jalapeños add a spicy kick to the pizza and the onions give it crunch. The sausage also gives it flavor, but it wasn't too salty which I like.\n\nMeat lovers - comes with pepperoni, ham, and sausage\nIf you love protein, you're going to love this one. The ham was really tasty and juicy. Not as flavorful as the Amy E pizza but still a good pizza.\n\nUsually I don't eat the crust but it was enjoyable on both pizzas. I ate three slices and finished the crust for each slice. The crust was perfect -- crunchy to perfection and not hard.\n\nService was great. The owner asked and made sure we were doing alright, but of course we were... everything tasted delicious so how can we complain? We were honestly extremely impressed and satisfied. Will be back when I have pizza cravings!", "author": "Julian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Very good fresh juicy pizza here.  I happens to park right in front and can't help but to smell the good smell of fresh hot pizza!", "author": "Tony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Favorite pizza spot in the city! They are very generous with the toppings, especially mushrooms. The crust is perfectly thick and delicious. \n\nThe owner is awesome!", "author": "Raisa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-02", "description": "This place used to be great. Quality pizza that justified the prices. Sorry to say the establishment has gone down hill. First the pizza. Very basic and with VERY limited quantity of toppings. Ordered pepperoni and sausage and there was hardly any sausage at all. Also, the pizza was decent but basic and not very flavorfull. Next the drinks. $2.50 per soda, not the biggest cup, and they have the audacity to charge another $2.50 for a refill! I would not have accepted the waitresses offer for another soda if I knew they were going to be cheap and charge us for another drink. Next the napkins. We were given one napkin each without another to be seen on the table or offered. Greasy pizza often requires more than one napkin. Give extra napkins when the pizza comes to the table. \nPositives were nice employees and very nice sports memorabilia on the walls. I hope this place can get back to the way it was years ago but things are not looking good.", "author": "Evan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "First off I gotta kick off this review by saying Ken and Amy are honestly the two best pizzeria owners in the city! I came here for the first time when there was a magic the gathering tournament next door and wanted a quick bite. I ordered a simple pepperoni pizza and boy was it delicious. I gotta say the crust was by far the best part as it is fluffy and doughy, the way I love it. When you bite into it you get a good ratio of dough, cheese, and pepperoni. Their energy is superb and they're both always smiling! Will definately be back!", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "My daughter and I checked on Yelp for this great pizzeria with 4 stars review. Ken the owner is very friend greeting us with big smile and got us the best pizza we ever had. Check this out. He made special toppings with clam, shrimp, meatball, garlic, basil.  \nWow,  we love the pizza , pasta dishes, cleanness, services, hospitality.  \nThis place deserves 5 STARS for BEST CRISRY CRUST and VERY ORGANIC toppings.  \n\nWe sure will tell all friends and come back for more.", "author": "Sera E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Ken & Amy are great people and make some pretty good pizza too!\n\nThe Cesar Salad is super garlicky - which I love.   Normal salad is good too - has kalmata olives which are yummy.\n\nGet the thin crust pizza - it's really quite good.  And get the pesto sauce - it's also awesome.  In general it's a really good balance all around of sauce, cheese, toppings. \n\nIt's a great place to go watch a game, or hang out or have a get together.  Relaxed and homey.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "Charged me for 3 sides of ranch then did not bring any. Pizza was very dry and cardboard like. Ate 1 slice then threw the rest out.", "author": "Zachary S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "\"Sorry, I was busy talking to my boyfriend.\" That was the explanation for why our order was wrong. They didn't fix the screw up either. And that is where it starts with this place. \n\nAfter getting our order, we presumed any place with service that bad had to have amazing food. How else would they stay in business? That is where the real kicker came in. The food is mediocre at best--there are at least a half dozen pizza places in the Sunset that are better. Perhaps this place was good once upon a time. But it's empty on a Saturday night. That is all you need to know.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "I ordered Delivery from Eagles Pizzeria and the driver was very nice and the pizza came in the estimated time frame. I ordered the Amy's pizza and I felt like the dough was very plan and the sauce was bland. The topping was abundant so if you like lots of toppings this is the place for you. From what i've read the owners seem very nice but I personally would rather order from a pizza chain because IMO they taste better.", "author": "timothy n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-03", "description": "I live two blocks away and wanted to try it for years, but always kept going to my favorite places.   Finally decided to take a chance on this gluten free pizza.  Delivery guy and person who answered the phone and took our  order were very friendly but I can't speak to the building itself.\n\nThe pizza was ooookay.   The same league as Irving, Noriega and North Beach down Taraval but better than Taraval and Seniores  4 star? Definitely not.  The cheese was piled on with no care, maybe to disguise the scant use of topping.  The toppings that were there, were tasty though.  The sauce was on the dull side, but I liked the thin crispy crust.  HOWEVER, all of the above was negated by the night sweats I had from it and the heaving my friends did later on.  Hence the 2 stars.  Not sure if it was unsanitary conditions(since we had it delivered), or that it was room temperature when it arrived, OR it was whatever gluten substitute they used.  But we were sick as dogs from average pizza.\n\nI'll stick with my go tos.", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-18", "description": "I just ordered from them tonight for the first time. I ordered double toppings and it looked as though it was single toppings. Also.... I called and the woman that answered (I think it was Amy) actually said she wanted to 'argue' about the toppings!! I told her I wasn't calling to argue at all but just wanted to confirm my order. Now comes the fun part, I'm extremely bloated and uncomfortable (I'm not gluten free) and another guest had some stomach issues. Still hours later after eating and I feel I've grown 3 dress sizes. Not cool!! I gave 2 stars because the pizza seemed fresh, even though it was a bit bland.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "This is the second time we have had Eagle Pizza when we have been here.  Both times they delivered to the house ahead of the time they said.  Excellent each time, my wife ordered online with no issues.  Great pizza, salad and cheesy garlic bread.  This is the pizza to get if you're in the Sunset!!", "author": "Nick B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Eagle Pizza has become my second home! I come in regularly for their home cooked pizza. \n\nMy favorite pizza is their gluten free margarita. I am obsessed with the touch of garlic. My boyfriend and I come in regularly and we spend our anniversaries here. \n\nIf my friends haven't tried Eagle pizza, I bring them in because they are the best pizzeria in the city! I am proud to support small businesses in my neighborhood. \n\nThey also have free delivery (which is a life saver when I don't wanna leave the house haha)", "author": "Elvis Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Ken, the owner of this place is absolutely the best!!!! I wanted to have a pizza party on Sunday at 1:30 pm, and in spite of having operation hours start at 3pm on Sundays, Ken opened his doors for my party at 1 pm, even earlier than we originally planned. He called me several times to customize my order, to discuss the details. This, I call true customer service!\n\nTheir Cesar salad was great, chicken wings, garlic bread, pizza, everything was delicious. And Ken accommodated all our requests. Thank you!", "author": "V G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "The pizza is great and the service was excellent!\nTry the Caesar salad too - Their house made dressing is really good. Tasty domestic and craft beer on tap too.  Prices are very reasonable - Good value for the money. \n\nIt was a surprise bonus to find toy sets against the wall that our toddler enjoyed while we waited for our food. \n\nI Definitely recommend for casual pizza and beer experience.", "author": "Gabe F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-03", "description": "Ordered a plain cheese pizza for delivery. About the best thing I can say about it is \"it was hot.\" Crust was too soft and doughy, sauce was bland.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Accessibility (Parking / Wait Time)\n\n1/1 Star: I walked here. No wait.\n\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n1/1 Star: great service! \n\n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n2/3 Stars: pizza was good.\n\n_____\n\nOverall Experience\n\n4/5 Stars \n\n_____\n\nLast Words\n\nGreat place! I love being able to play Magic the Grathering at Versus Games and get pizza and beer delivered to my seat!", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I love this family run pizzeria. I've been coming here since I was a kid, and my parents before I was even born. Ken and Amy, the owners of Eagle Pizza, are really great and friendly hosts - I say hosts because it always feels super homie when my family and I stop by. Hey, it helps that their pizza is so delicious too. The bottom is crispy and the inside dough soft with the perfect chew. The sauce they make is awesome as well, hardy, not too sweet, and just the perfect amount as to not be overpowering. My go to is the mushroom and sausage pizza. I really like that they cut up the sausage into small pieces so that every bite has the perfect mix of ingredients. Every pie here is great, but for some reason tonight's was exceptional. I definitely would recommend Eagle's to anyone looking for a yummy pizza, cold beer, and a sports game delivered to you by a friendly family. Love this place!", "author": "Adriana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "I wanted order eagle special and clam. \nI asked half and half. He made it. Owner was very kind and good person. \n\nI ordered small eagle special and clam half and half. it was very delicious pizza dough was crispy sauce and cheese so tasty. \n\nRecently my favorite pizza is clambake and classic margherita half and half. \n\nDraft beer is also very good combination.", "author": "Nishigami T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "Customer service, communication, appearance of restaurant and staff, is the worst. I ordered via eat 24. They just didn't care and the food and customer service was reflective of that.", "author": "Carlee M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Order got screwed up the first time we tried. But we have them another shot. Pizza was a little late but it was very delicious. Worth the wait", "author": "Paul M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "I chose this place because they have gluten pizza which ended up being okay. Other pizzas were decent, but had few toppings and super crunchy crust. Specialty pizzas were typical flavors, nothing special. Delivery was extremely slow. I had to call to see if the food was coming. Okay experience", "author": "Tori Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Eagle Pizzeria has awesome pizza and great service for 24 years!!  They were my 2008 Small Business of the Year when I was in the State Assembly. Say \"hi\" to the owner Ken!", "author": "Fiona M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "Now, I ordered delivery and the guy was a bit confused but it was a rainy night, I didn't feel like cooking and Eagle saved the night. But I did read other reviews that this is just a basic homemade pizza - yes, it is. It's plain dough with real cheese and ingredients so no bells and whistles, but most of it was gone the first night and it was all gone the next day - so maybe it isn't the most appealing pie but it sure is tasty. \n\nNext time I'll try dining in so I get the full experience.", "author": "Christine V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-30", "description": "Skimped on the toppings, not good overall. Barely any pepperoni and I couldn't even tell there was sausage on it -_- the owner asked me to tip since my house is \"pretty far out here\" but it's a 15 minute drive from my house ? If that's too far, then you should update that in Yelp... solely based on the pizza, don't waste your money.", "author": "Mariah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "Yummers! Super easy to order here from yelp and the delivery was fast! \nPizza is very good little puffy but not too much. I love the name ;)", "author": "Tere C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "Delivery was great! The driver was so nice and fast and a great communicator (they set expectations up front for delivery timing - really appreciated it) - but the pizza wasn't all that exciting, will keep looking for a good pizza spot that delivers to SF Zoo area when we can't get Pasquale's.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "This place serves a quality pizza. Love the crust, and the toppings. They even deliver. I haven't tried the gluten free pizza yet, but you have to love a place like this that offers it.", "author": "Jason P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Great pizza, tiramisu, and even better service. I'm assuming the gentleman that helped me out was the owner. Super friendly. What a great local pizzeria. Next time I'm in that area, I'll be back. Thanks", "author": "David B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "I'd give this place 3-1/2 stars.\n\nThe \"Medium\" pizza we received was 13\", not 14\". Pizza itself was decent quality. Bottom of crust maybe slightly tough.", "author": "Ross W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Pizza is great, filling and they don't skimp out on the toppings. They have great beer selection and they are well priced. Awesome local spot, been coming here over 20 years. Ken and Amy are the best!", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "You guys totally made my day.  Went home sick and hubby had a late meeting so I decided to order delivery.  Not only do you deliver a pipping hot pizza to my starving sick self but the box is decorated by Emma. The box totally made me smile. I feel better already. Thank you, Eagle.  We love your pizza. It's always crispy crusted and delicious!", "author": "Marie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Fantastic evening at Eagle Pizzeria!  I am new to the Parkside neighborhood and tried Eagle Pizzeria for the first time.  My experience was so enjoyable.  The owners Ken and Amy were both so friendly and helpful.  They gave me great tips about the neighborhood and recommended other restaurants in my new hood.  I had the ceasar salad that was excellent, great dressing.  The pizza was light and crispy and delicious. They even made different toppings on each quarter of the pizza so I could try different flavors.  The greek style toppings were my favorite!  Even my 3 year old loved the place because the have a toy section. Can't wait to bring my friennds.", "author": "Annette M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Thank you fellow Yelpers for helping me find this excellent pizzeria. We like all the variety of pizzas they have to offer. The Eagle meat/deluxe combo is good, with lots of flavorable and tender meats. The gourmet vegetarian has all the veggies we like including artichoke hearts. We also like the clambake and request for just mozzarella cheese, and no cheddar cheese on that. And the margherita cheese and tomato is very good. The extra large pizza is a generous size. I like that the crust is thin and crisp on the bottom and the crust on the edges, is lightly crisp on the outside and light and tender on the inside - like a good French bread. Prices are reasonable and you are bound to have leftovers. The antipasto salad is delicious and I highly recommend it.  Comfortable and casual interior. Nice selection of beers in bottles and on tap. Soda machine available. Very friendly service, in a hospitable neighborhood setting.", "author": "Lucy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-30", "description": "First time ordering at this place. It took over an hour for delivery (we live 5 min away) and when the pizza came they forgot the sauces we asked for so they offered to drive back and drop them off (which was nice). We said sure and thank you (thinking they were so close won't be a big deal). But 35 minutes later they show up with the sauces. My boyfriend came to the door and said that the kid delivering them didn't apologize or say anything at all just handed him a bag and walked down the stairs. Then we open the bag and there's ONE marinara and ONE HALF filled ranch. Seriously? You forget it, take forever to bring it to us after YOU offered, and bring us the bare minimum. Obviously we had already eaten the pizza (which was not great, crust was chewy/hard) by the time they brought the sauces but still. Wtf? Won't be ordering here again. \n\nJust go to The Pizza Place on Noriega, that way you  won't waste your time or money.", "author": "D T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "After a long day this place was a godsend!! Dare I say one of the best crusts I've had and I'm pretty snobby about my crust! Fluffy inside with thin crispy outer edge. Really glad we found this joint!!", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Ordered a large pepperoni pizza with jalapeños and pineapple (don't knock it till you try it!). The bread on our pizza was very well made. It was crispy on the outside but soft and fluffy on the inside. We could tell that the cheese used was very fresh and didn't dry out when the pizza cooked off. \n\nOverall very good pizza!", "author": "Caroline S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "New fan of Eagle Pizzeria! Went to them on a whim because they have FREE DELIVERY (on orders over $15), making my total at least $0.33 cheaper than all the other pizza places in the area. I was initially disappointed when I opened the box because the pizza looked smaller than others I've ordered. BUT, they were not stingy with their toppings and sauce, and the slices were much more filling than I expected (as opposed to other local pizzerias with large but unsubstantial slices and two cubes of chicken on each slice). I usually don't like crust, but I found myself devouring Eagle Pizzeria's crust before realizing what I was doing. The delivery was also on time and the box had my name and cartoons decorated on it -- cute.", "author": "Kaitlyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Our go-to pizza delivery spot in the Inner Sunset.  The veggie pizza is top notch.  Small is a perfect size for two people.", "author": "Liz H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "TERRIBLE customer service. If I could I would give 0 Stars. \n\nThe staff team is very nice but the manager is extremely rude, called me again to harass me after I resolved the issue.", "author": "Celine H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-17", "description": "Short version: A 4-STAR RATED FARCE. A disgrace to pizza. Shit-quality, unsanitary, and expensive! Good for soda. That's it!\n\nLong version: Was visiting and yelped this place that was near the beach. Was rated 4 stars (WTF?!?) Decided to give it a try. Cool place if you love sports. Lots of Giants/49ers stuff on the walls. The place smelled though & the plates/eating utensils were all out on the table to be breathed on, sneezed on, etc. No one greeted me when I came in. After my order was taken and my food delivered I could of gotten up and left cause no one was around.\n\nBut fuck all that, to me it's about the pizza.\n\nPros: It was edible.\n\nCons: The cheese was piled on. Like the cheese you can burn and doesn't melt kind too. Garbage.\n\nThe sauce didn't taste fresh. Canned and had a odd aroma. Shit.\n\nPepperonis were as good as flavorless red pieces of construction paper. No lie.\n\nLarge pepperoni pizza & pitcher of soda = $27\n\nFOUR STARS?!? The fuck?!?\n\nSo much potential. But this place barely takes itself seriously. Will not be back, ever!", "author": "Ayeron D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "I dont usually write reviews but i just received my delivery and the quality was very disappointing, plus the pizza wasnt even cooked all the way smh...trash", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "Good cheese and meat topings. The owner, Ken, has a great welcoming personality and is honest. Next time I am in the area, I will not hesitate to revisit this joint.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "I've been trying to find a pizza home for my family and I may have found it. Ordered a pizza to go with 5 toppings and pesto ravioli. First, the owner was very nice and called me to tell me my order may be a little late bc they just opened. I didn't mind, I was at home anyway so an extra 20 minutes didn't matter, but I appreciated the phone call. They called me to tell me when my pizza was ready, which again was nice of them. I sent my husband to pick up the pizza and he met the owner. He talked to him, said he was really cool, and the restaurant is very kid friendly. I saw some pictures and I love how Mom and pop it is. I will try eating there next time instead of ordering take out. As for the pizza- I think they forgot one of my toppings (so sad), but it's alright, the pizza was still delicious. The ravioli was pretty good as well and my son loved it! I will definitely come back here again!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-20", "description": "I decided to order delivery from Eagle Pizzeria - haven't eaten their pizza for over 15 years.  I usually order from North Beach pizza or Pasquales.  I was disappointed with the pizza.  I ordered several toppings for it but you couldn't tell if you saw it.  Prices were similar to the above mentioned pizzerias.  Will stick to the other ones.", "author": "Paula Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "This pizza is OK. Nothing special about it (unless you need gluten-free). I've been ordering for over 4 months now, and once I got a big piece of plastic inside the cheese. It seemed like a piece that had broken off from some McCormick pepper bottle because it was white. But God knows what it was, and thank goodness I didn't get sick. The delivery service is average, and only once it's been 15 mins. late, and the pizza was already cold. Yet, I have to say they have the most pleasant and well-mannered delivery guys.", "author": "Lyon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "First off - to be honest, more like 4.5 stars, but because the service was so great - i'm rounding up!\n\nWe (um, like 35 of us) came here for a post party pizza dinner. I called earlier in the week to reserve the spot. Ken called me back the evening before to confirm & have me preorder a few pizzas to start so our group would have food on the table quick & wouldn't be starving. They were super kind, so accommodating & totally on it. \n\nThe caesar salad was delicious. The pizzas were great. They weren't the best (hence could be less than 5 star), but they were better than good. (We had a couple of meat combos, veggie combo, margherita, and cheese.)\n\nI'll return for sure.", "author": "lynn t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "I wanted to treat my friend to lunch as she was doing me a huge favor, so decided to give this spot a try. It is in my neighbourhood and I've been eyeing it, the name is interesting to me and I always found it odd for a Pizza Place.\n\nWe showed up right when then opened and we were the only people there, picked the Prime Table by the window and were given menus. We scanned the menu, decided what we wanted and our orders were taken right away.\n\nPizza came out fairly quickly and it was YUMMY, the crust in a little crunchy with we both LOVED. Toppings are generous, not too much sauce, I hate when places over sauce!\n\nThe decor is cute and a little random. I like the family style tables they have, but also the smaller tables for single or doubles. \n\nI'd totally come here again.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "I called this pizzeria from Orange County, CA asked them if they could make me a special pizza for my daughter who is at SFSU. The owner was the best. He was kind and you could tell he cares about his customers. The customer service I received was on another level. He went out of his way to make a tough order a smooth and easy one. PS ...my daughter said the PIZZA WAS AMAZING.", "author": "Valerie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "We came here after our son's basketball game at St. Gabriel's. We wanted pizza and a place to watch the GS Warriors game. This place was perfect. They welcomed our large group with open arms. The food was delicious. Must haves: Antipasto and Eagle Special pizza. Staff was very friendly and stayed well after closing time for us. If we're in the area, we'll definitely be back.", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "First time customer.... pretty good pizza... delivery right on time...Nice friendly employees... Our granddaughter liked it, so that's good enough for us... will call them again...", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "We haven't ordered from Eagle in a couple of years. Pleasantly surprised at how really good the pizzas and wings were. It was a likely busy Saturday night but delivery was sooner than expected at 45 minutes. We had a 12\" clambake specialty pizza and an 8\" pepperoni & mushroom. Both were hot, fresh and tasty. The wings were just spicy enough. Will definitely try them again!", "author": "Sue R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-17", "description": "The Eagle special pizza is delicious! The deluxe vegetarian is also great, although a bit oily. \n\nThe owner is very welcoming; he's there everyday working hard. \n\nIt's never busy in there, but it deserves to be.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "This family owned and operated pizza joint is legit.  They definitely make the best pizza on the southwest side of town.  If you like breadsticks you'll love the crust.  Toppings are tasty and the pizza sauce is excellent.   You won't be disappointed and I dare you to name a better spot to get a pie from.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "It's really disappointing to have to give just 3 stars, but it was a bummer eating a pizza I was so hungry for that was, just not good, at all. The first couple times it was great, crispy on the bottom but just enough doughy goodness, not too much sauce, not too much cheese, nice golden brown color on the cheese.  But then one night, I got a mound of un-cooked cheesiness with toppings that were almost absent.  So I tried again and it was almost good as before.  This last time though, it was inedible.  Figure out who is making these awful messes please!  When it's good it's sooo good.", "author": "Ems G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "After a favorite closed down and another favorite's quality dropped off, was looking for a new pizza joint and found it here. Pizza is amazing, delivery is fast and price is very good. This is a Sunset District mainstay and now my go to pizza restaurant. Give them a try, you wont regret it!", "author": "Val T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-19", "description": "The pizza is decent but the atmosphere of the establishment is kind of uncomfortable. Might come back, might not.", "author": "Myrna F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "The only good thing about ordering delivery from here was that I didn't overeat. The pizza is below average. Crust to topping ratio is very high.  Pepperoni is artificial tasting, like the kind on pizzas sold at carnivals or fairs...and very stingy with the pepperoni. Worst of all they left off a topping.  Ratings here leave me scratching my head, maybe it's just from loyalty to a neighborhood joint. Total waste of calories.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Eagle pizza is the bomb! Best pizza in the sunset hands down. Do yourself a good service and enjoy some pie with Ken at his long lived establishment!!", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Great place to catch up with friends with some decent pizza. Just came here earlier to catch Game 1 of the World Series; was a really good experience and time. \n\nFamily owned restaurant, so do expect for them to take time on baking their pizza... don't expect quick frozen pizzas. \n\nHighly recommend.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "The best Damn pizza delivery in all of the outer Sunset! Really nice employees too. The pizza is great and is loaded with cheese and sauce. The crust is just right, thin but not to thin, just how I like it!!", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Food was excellent and served in a timely manner. This is, what I assume, a family owned business, since the owner is a father with a couple teens. I totally support local businesses who are friendly and provide good service. I had the eagle pizza which was the most popular and it was delicious. The place itself is quite large so it's good for parties. \nIf you're in the area, give them a try.", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "We went here for the first time after a kids baseball game (we'll my first time...my husband has been many times growing up). I called at 4:00pm and said we'd have about 20 people coming in at 7:00pm that night. The owner, Ken, didn't even flinch. They were so accommodating! The kids and adults each got our own tables, so it was win-win! Kids loves the candy/baseball card area. They also had a play area which was an awesome distraction for the littler kids. After the Giants game ended, they put on Incredibles. The food was also great....shout out to Amy for her amazing dressing on the Cesar salad. Delicious!!", "author": "Stacy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Wonderful pizza and you can request a thin crust if you like. The antipasto salad is also tasty. The owners Ken and Amy are hard working but take the time to greet and talk to their customers. Lots of sports teams have their end of season pizza dinners here so it's a great place to bring children.", "author": "Gail N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "The pizza is fair...a bit doughey for my preference.  However, the great thing about this place is how kid friendly it is.  We have been coming here for years.  Ken & Amy have toys for young kids, and a large screen TV with whatever game is on.  They will accommodate almost any request and it is generally a given that it is ok for the kids of all ages to run around.  Great place for teams after the game and definitely if you want to eat with a little less need for kids needing to be overly well behaved, enjoy your dinner and let the kids play.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-17", "description": "I recently moved to the area and was excited to try some local pizza rather than play it safe with just dominos. I went in after work to order a very simple medium pizza. I waited for 5 minutes before I received an acknowledgement of \"I'll be right with you\". The woman then very coldly took our order and said it would be 20-30 mins. In that time not once did we get a smile or a simple hello. But I should mention that all the familiar customers that came in were greeted very warmly and friendly. I'm not asking for you to kiss my behind but you don't need to be rude. How do you expect to make loyal customers when you are so rude. Maybe if they were busy I'd understand but it was DEAD in there .\n\nOn to the pizza, it was O.K. Nothing more and nothing less. Not worth 20+ that's for sure. It upset my stomach but that may have been because after 30 minutes of waiting I had lost my appetite. Definitely will not be returning and it's a shame because I live down the street and could have become one of her \"regulars\".", "author": "Dalia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Vegetarian pizza was on point. Ken and Amy are friendly and great to chat with. Laid back atmosphere and easy going seating makes this a great place for crowds.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Great pizza!  Nice community spot.  Lots of kids toys. Good for groups.  It's a family run place and the proprietor is very active in the community.  I've never had an issue with delivery or pick up.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-20", "description": "So I was surprised that this pizza was rated 4 stars because it is not good.  The pizza crust reminds me of pre-formed crust from Pizza Hut only it wasn't even as good as Pizza Hut...which is pretty bad. The pepperoni was so off tasting and the cheese was not like real cheese. My boyfriend and I were actually laughing at how bad this pizza was, it reminded me of the SNL skit where the mom tries to serve her family 'almost pizza'. (See skit https://m.youtube.com/watch?v=IHSRKU8XKIs ). The only way to describe this pizza is like aliens from outer space heard about pizza and then made an attempt at replication but it doesn't taste, smell or even look like real pizza. I wish I had taken a picture so I could share it here but we threw out the rest of the 'pie' after we had a slice each. I will say that we ordered a Greek salad and that was ok.  Basically, my recommendation is that, even if you are super hungry and desperate, you are better off making Ramen noodles at home than ordering out for pizza from this place.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "Friendly staff, good pizza, beer on tap. I'm a fan", "author": "Jane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Eagle Pizza is so accommodating and family friendly!  Ken and Amy are great!  They will go the extra mile for for your dinner visit, or your get together.  Kids can have a little freedom, with a play area.  Following Rocky and Ariadne Coku's tradition of attention to guests, and hearty portions, this is the place to take your family or group.  The food is good too, and the wine is actually good for a pizza place.  Other foods on the menu make it great for every appetite, dieters also.  I recommend visiting Eagle Pizza.", "author": "Beverly P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-28", "description": "First time visitor. Read reviews prior to visit and the concerns regarding service are spot on. Went around 5 to beat crowd. There were a few customers which included a party of 10. Took a seat and had to wait 10 minutes before acknowledged. The server said that he was the only one and said that he is expecting a party of 20 in a few minutes. \nFinally got to order and pizza took over 30 minutes. It was decent pizza. Ingredients are fresh. After sitting for close to 2 hours I received my bill. I was a bit taken away as I was charged for each soda pop refill. Without asking, The guy (owner) serving me had no problem refilling my glass. Any why not. $2.95 a glass for coke. \nI mentioned it to a friend and he told me that the Eagle is known for add-ins without your approval and charging for them.\nWon't return.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Very nice staff and great food, had the Eagle pizza special,  2 mini pizzas and the pesto ravioli,  all were great. Will definitely come back when in the city again.\nOh and the French bread side with the pasta was amazing!!!!!!!", "author": "ron t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "Ordered a plain cheese pizza. Not my style of pizza but was pretty good. The sauce is really tangy and there was a medium amount of cheese. Tasted fresh. Delivery time was decent", "author": "Emma M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-16", "description": "I've tried ordering pizza delivery from them four times, but no more. The food is good, or would be if it was warm. But I'm forced to conclude their delivery problems are not an isolated incident. It takes over an hour to get the order one mile. This last time, it was over two hours, it was cold, and they delivered the wrong pizza. At the one hour point, I usually start calling to find out what the problem is, and the answer is always the same: \"we're busy tonight, he just left, he'll be there any minute.\" It's not true, it's just a brush off.", "author": "Anna L. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Went there this past weekend for a group pizza dinner (with lots of kids). We were a BIG party. Despite that and despite us being full of loud kids, the restaurant staff were fantastic. I mean, beyond fantastic. They were helping us with our orders, coming to our tables, always polite, etc. And the food was really good!\nI really got to hand it to these folks - it's not easy being a restaurant in SF and even harder being one that serves to large groups (and kids) and they did both terrifically.", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "This place is a solid 4 stars!\n\nAlthough we came in on a Saturday night around 8 and the place was pretty much empty (which is a little scary at first..) that was no reflection on the pizza - which was bomb.\n\nI reduced one star for the crappy ass wings. Pizza places should have fresh (not frozen) wings.", "author": "Maple S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-02", "description": "Come for the friendly neighborhood pizza joint vibe and friendly staff. Pizza is fine but not worth a trip just for that.\n\nThis is a great place for kids/family.  They have toys for the kids to play with, all kinds of high chairs and booster seats to fit every little kid from babies to toddlers, and a couple of big screens for the grown-ups.  \n\nAlso seems to draw a young neighborood crowd too, though.  I chalk that up to: Super friendly staff, good selection of beers on tap and a great selection of 22oz craft beer bottles.\n\nMenu is just what you'd expect for a pizza and pasta place.  No surprises, no omissions.  The Caesar salad was really big and very flavorful.  Kid's mini pizza was what you'd expect.  The only down side was that the combo pizza was disappointing.  Plenty of toppings but crust and sauce were just meh.  Nothing BAD about it, just kind of flat (flavor, not shape).  It was a perfectly fine pizza, just nothing to write home about.  Let's put it this way: I'll go back to eat there with the kids, but it's not going to be my take-out place.", "author": "Timothy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-10", "description": "Tasted like frozen pizza. Server completely disappeared after serving us. Had to flag them down after waiting forever.", "author": "Nelly P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-28", "description": "Do not go here.  The owner is rude and condescending.\n\nThis review is based solely on customer service.\n\nWe bought a Groupon that said dine-in only.  When I called to see if there was flexibility to that (ie, if we could get delivery or pick up), I got lectured that anything other than dine-in is not possible because \"the pizza tastes better fresh out of the oven.\"  I probed to say that I was willing to accept the loss of taste if we picked it up, and again got lectured that the details were on the Groupon at the time of purchase, and quote, \"that is our prerogative.\"  \n\nYes, the Groupon says dine-in only, but I do not feel that it's an unreasonable request to see if there's flexibility on that.  I called back to ask for a manager, and when the same lady (the owner, it turns out) answered the phone, she said yes, the manager is here.  She made me hang on, and then came back on to say that she was, in fact, the manager.  Weird.  I gave her the feedback that I didn't feel she handled the call with a high customer service orientation, and she proceeded to again lecture me, and then hung up on me.\n\nI don't care how good the pizza is, the customer service breaks this place.  There are plenty of great pizza places in the city that I don't need to tolerate her attitude.  Neither should you.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "Another fine reason Sunset is my favorite area. Nothing beats a family owned restaurant full of personality and cheer. The cherry on top: best service and food! A must see restaurant.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "This place is still good. Even though Ken and Amy look exhausted, they still put effort in what they do and the food is still really good.\n\nI've been eating for at least 5 or six years. They are super nice and very accommodating. I remember when night my boyfriend and were eating dinner their and we were missing our TV show. We asked if they could turn a TV on for us to watch while we eat and they did. (Well, the restaurant wasn't too busy yet either.) Still appreciated it though.\n\nTheir are pizzas are good and love their crust.", "author": "Kathryn Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-08", "description": "First, the pizza crust is amazing. Thin, light, fresh, chewy just like a fine pastry. And that's why Eagle gets three stars. Second, these folks are very nice. Third, they understand plain English on the phone. Huge plus.\n\nThe cons: (1) not at all generous with toppings... even when ordering extra cheese seems like less cheese than most good pizzerias standard cheese topping; all other toppings also very thinly applied; (2) Eagle is not cheap, coming in at around $35 with tax for an 18\" pizza with 5 toppings. For that price I would expect much more.", "author": "The V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "Definitely a hole in the wall.\n\nI didn't even know about this place until a friend asked me to catch game 1 of the world series here. It has a cozy, \"homey\" atmosphere, which is a good thing.\n\nThe pizzas usually take a while to get here so if you're hungry, order some appetizers first! Honestly, there's really not much to say about this place. \n\nTo summarize, solid pizza, fast friendly service and overall just great atmosphere!\n\nGreat place to drink a few beers and catch up with friends while watching sports. \n\nWould definitely be back!\n\nCash/Credit accepted.\n\n***Parking***: Residential or metered.", "author": "Johnny G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "This is my \"go to\" pizza place. I enjoy the Amy E (sausage, mushroom, onion and jalapeno) and kids get the garlic bread and cheese pizza. It is family friendly, so hipsters beware. \n\nThe service is neighborhood friendly and very personal. This is a very nice institution for the Sunset.", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Had dinner here with pizza and wings.  A nice small pizza joint meant for enjoying company and talking.  Great for kids and adults alike.  The pizza was good with an abundance of toppings and was not dripping in oil like other place.  The wings were tasty and spicy.  Far better than any chain pizza, but also don't expect fast pizza by the slice service either.  You can also enjoy the  historic memorabilia on the walls.", "author": "Dennis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Really enjoyed our pizza! Ordered delivery via Yelp app @eat24 - fast delivery (35 min), nice delivery person - ordered Eagle Special, cheese pizza, and classic margarita- all fresh and yummy!  Margarita had a thin crust while Eagle had a thicker crust - sauce was really good with a nice tang.", "author": "Lena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Wow that's some good pizza!\n\nIt tastes better than anything I had in the city, and even with only 2 toppings it really filled me up. They also have a small bar you can drink at while you wait for your pizza. Just be careful, I got 2 beers and a pizza and it came to $37 after tip. It would get 5 stars if it was a bit cheaper, but you gotta try this place! Looks like it would be good for small or large groups, there is plenty of seating and football memorabilia on the walls so I'm sure they would have the game one. Really like this place!", "author": "Chris I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-19", "description": "My first bad review, sorry guys!\n\nI called and ordered a pizza for pick-up, girl on the phone seemed nice enough and took my order, telling me it would be ready in 30 minutes.\n\nI arrived just over 30 minutes later, and walked up to what I assumed was the counter (No-one around to help). I stood there dodging screaming kids, no help in sight for around ten minutes before someone came out of the kitchen to take my money and give me my pizza. I got my pizza home and ate the first slice before noticing an odd odor, the pizza being otherwise flavorless I tossed it and made mac and cheese.\n\nLesson learned. Look, I get who goes here and gives it five stars....people with kids. I  can sympathize, you're tired and you've got 15 screaming people-in-training to deal with, this is a place you can take them and let them run around and fill themselves up with moderately priced pizza. That being said, if you don't have kids and genuinely want a tasty meal, look elsewhere.", "author": "Jon J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-15", "description": "Great place to hold team or kid functions or events. Staff is friendly and very accommodating.\n\nPizza was good, salads were good.  They have a big tv to watch games as well.", "author": "JJAMZ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "I've been going to this place for years and I love it! My personal favorite: make-it-your-own pizza with pesto, chicken, and mushrooms! The pesto is delish! (And don't forget cheesy garlic bread!)\n\nIt's an all-around family-friendly, classic pizza place right down to the red/white checkered tablecloth. There's sports all over the walls, a TV for sports fans, some toys for kids, and amazingly friendly owners. \n\nThe owners are so relaxed that although the service is great, I've stayed there for 2 hours on a medium-busy night because they really take their time giving you the check, giving you change, etc (but that could also be because they don't want to rush customers). \n\nOverall, it's a great place for groups/family dinners/dates. Just if you're on a date, prepare for loud kids/families eating there as well. However, there are some nights that it seems completely empty in there which is particularly peaceful and enjoyable.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-21", "description": "Overpriced pizza and lame atmosphere. However I do love the abundance of cheese they put on the pizza. This is a place to bring your kids after soccer games.", "author": "Anastasia P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-17", "description": "First time customer at Eagle Pizzeria. Pizza is decent, very salty crust but very cheesy which I like. Customer service was terrible, the lady taking my order seemed miserable but yet she was full of enthusiasm when it came to dealing with regulars (based on the use of first name). I will not be returning due to the poor customer service.", "author": "James F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "This is for delivery.\n\nA friend highly recommended that we try Eagle Pizza. So of course we love pizza and had to try it! I called and placed my order &  tried to order the special i usually order form another pizza place. The owner laughed and was so nice I let him know we were trying it for the first time he told me a little about their business and helped me figure out how much pizza I needed without overselling me. Since the World Series was going on I expected a long wait. That was the fastest pizza delivery ever!\n\nWe got the combo and let me tell you they are not stingy with the toppings at all. The pizza was amazing nice thick crust & tons of toppings. We also ordered the garden salad it was good (can't really go wrong with that).\n\nThe only drawback would be their prices, higher than some but well worth it!\nI can't wait to try it again makes me hungry just thinking about it!\n\nNext time we will eat in the restaurant and I have no doubts that it will be just the same great food and service as the delivery.", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-06", "description": "Pizza was tasty I guess, but the most delicious was definitely the crust. The service wasn't so great, the two people there just kinda eyed me until I asked to pick up my pizza, handed it to me and just went back to a table of a family. Although the pizza was 4 stars the service brought it down to 3. I'm not going back.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-04", "description": "The pizza served here is alright. I've had better pizza, but i honestly prefer family owned pizzerias. They take the time to make the pizzas look nice and appetizing, but the way they arrive and the taste doesn't add up. The prices are, i suppose, fair, the workers are really nice and the inside is very decorative and nice. Family Friendly. I always see a bunch of families in there as i walk by. Their schedule is also VERY weird. Can never tell when they're open.\n\nIf you want better pizza, try Taraval Pizza. The only decent thing you can get out of Eagle Pizza is friendly staff, and a welcoming atmosphere.", "author": "Cody A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "We went to  Eagle Pizzeria Saturday night for the first time with some friends and it was great! We got two mediums, both split half and half. I got mushroom and artichoke hearts on my half and boy were they generous with the toppings. It was so good! I hate when places overload the toppings but then there isn't any cheese on the pizza. Nope, Eagle Pizzeria did it just right :D The crust was fluffy, a little crisp on the outsides, and delicious. \n\nThere was lots of sports themed decor and a large TV for watching games. I'm sure it's great for sports fans, especially those with kids. They serve beer but the place is in general very family friendly. It's cute, cozy, and spacious. The owners, Ken and Amy are very nice and chatted with us for a bit at the end of the night. \n\nI also hear they're serving slices now since VS Games just opened up right next door. Overall, Eagle Pizzeria is great and I can't wait to go back!", "author": "Madhu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "I received a $10 credit from Groupon and saw a $12 for a Large 2 topping pizza and Eagles I couldn't resist! It cost me a whole $2. My friend and I got there as soon as the doors opened, and by the way they opened at 2pm not 3pm like their website shows. Got a pepperoni and olives pizza and it was super yummy! Perfectly cooked crunchy and chewy crust just how I like it! Perfect amount of gooey cheese and toppings. The owners were very nice and attentive also. It was 2pm when we arrived so we had the place all to ourselves, peace and quiet.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "My son is allergic to nuts and peanuts  and was going to eat there with his friends. We called Eagle pizza ahead of time to find out the ingredients on the menu. The owners were very aware of food allergies and even found the ingredient labels for us when I asked about pesto sauce because of pine nuts. She even  texted the labels image to me to reassure me the pesto pizza is without pine nuts. She even call the company to make sure nothing was cross contaminated. My son ate the pizza there without any anxiety. It meant a lot to us to have a safe place without being worry and also for my son to be included with his friends. I am so happy with their customer services and how personal and caring Amy and her husband are  since we have been to other places where we were treated badly to even ask about food allergies. We will definitely go back as a family!", "author": "anne l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "Went there w/ a Groupon deal of a salad, large specialty pizza and couple soft drinks.  The chicken cesar salad was terrific.  We ordered the Eagle special pizza fresh, tasty, and big.  The place offers a great atmosphere w/ excellent service.  \nAnd 'Yes', like other reviews said, it's a real cozy place to spend with friends and families.  Highly recommended!!!", "author": "Denis Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Community style service!! These people go the extra mile. I business that wants your business by delivering quality food, quickly with a smile.\nI love it. Moms Note: got the good ole cheese pizza for my four-year-old and we are both loving it!! I will order this again!", "author": "Christy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Family-friendly restaurant...really good service too.\nVisited my parents who live by Eagle's and I ordered delivery, and they said it should be there in 40 minutes and the order in 30 minutes.\n\nFood is delicious, and the service on the phone as well as the driver was good.\nPrices are great too.", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "Ken and Amy are fantastic!  I don't know if they deliver, but if they delivered, Eagle would be our go-to pizza in SF!  We threw Robert his 1st birthday party here.  They were extremely attentive.  I have no idea how the two of them made all the pizzas, set out place settings, served drinks, tended the bar, etc. the whole time.  I was even willing to help out, just in case, but they had everything taken care of!  \n\nThe local sports decor pretty much tipped it over the top for us.  Giants and Niners - YEAH!  AND Seals memorabilia was plastered all over the place.  Helmets, newspaper prints, signed images - they all help create a really SF feel to this family run establishment.  \n\nWe had 6 different pizzas, and they even made a tiny sauce and cheese pizza for Robert!  The dough is crunchy and bread-like: perfect!  The cheese is gooey, like mozzarella should be.  The toppings all tasted good and fresh, too!  \n\nNow, the beer.  OMG, the beer.  They put me on Moylan's.  I'm seriously a fan of their beer now.  The blueberry beer is like nothing I'd ever tasted before.  If you've never tried it, you must.  They still had some bottles of Orange&Black Congrats Ale.  Pure awesomeness.", "author": "ROB L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-07", "description": "I love Eagle Pizzeria. In fact, I'm ordering from Eagle Pizzeria. Right now. There are a couple great things worth noting:\n\n1. They have roasted garlic as a topping.\n2. They have blueberry beer.\n3. They deliver that beer.\n4. The service is incredible. \n\nIt makes me sad that it's not always bustling when I go in because it deserves to be. \n\nI discovered it one night when I was looking for a bite to eat in my (then new) neighborhood. Every pizza has been consistently delicious, and every beer consistently chilly. You KNOW they're happy to have your business because they're friendly and warm whenever you come in, and even when you order over the phone. Just in case you're not a pizzatarian like me, this kind of service is rare for a pizza place, where they usually just trying to rush you off to get to the next call. \n\nOne con: It seems a little pricey for pizza, but I guess you have to remember, this isn't Dominoes. Oh yeah. And that they DELIVER BEER.", "author": "Kristen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "Tried a new pizza place!\n\nBest thing about this experience:  Delivery was super fast, just a smidge over 30 minutes.  We usually wait an hour or more from our favorite pizza place, so this was a happy surprise.  The person who took my order over the phone was cordial and helpful, and the delivery guy was nice too.  Excellent!\n\nThe pizza itself is pretty good for SF pizza.  The sauce is rich, and the amount of cheese was just right.  The toppings could have been a bit more generous but they were tasty.  The crust is thick, pillowy and chewy, PLUS it has a lovely crunch on the bottom.  It's not extra-flavorful but I give it full points for texture.\n\nOverall this was a good experience.  I'll definitely order from these guys instead of the usual suspects next pizza night.", "author": "Lorelei S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-09", "description": "We were at Eagle Pizza the night the little league team (or whatever) decided to have their pizza party/awards ceremony.  It took a while for us to get seated and our order in, but no worries, we were in good company.\n\nWe had a pitcher of the IPA, then buckled down and ordered the cheesy garlic bread, the buffalo wings, and a pizza that I now forgot about.\n\nBottom line: great neighborhood place, nice place to kick back with pizza and beer.  Just don't walk in when there are kids running around.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "Love their crust. Sauce is delish . We usually call in our orders and pick them up. A family owns it, they're always in there working together. It's hard to find a business where family is involved. It's great for large groups, and they have a big screen tv in case you wanna stay and watch a game. They also offer SLICES now!", "author": "Roxanne O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "we love you ken- the owner. you rock don't ever change. hags- 2cool2b4gotten\n\nbut 4 real- gluten free pizza is hard to find *cries*", "author": "Zoe V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-31", "description": "I really hate to give a bad review when the service was so wonderful, but I must. We chose this place because they offer a gluten-free crust. \n\nWe (2 adults and 1 child) went out for dinner and had 1 small salad, 2 small pizzas (1 gluten-free, 1 thin-crust), and 2 beers. The salad was so bad we almost left, but I was hungry and wanted to give it another chance. Once the pizza came my 3 year old wouldn't even eat it. What saved the place was the man who served us, he was very friendly and we had a good time. The real blow came with the bill,  $60. I expected to pay more for the g-f pizza crust, but when we looked at the bill my friend's pizza was more -he was charged over $6 extra just for answering \"thin\" to the question \"would you like thick or thin crust?\". It was disappointing to spend so much money on such low quality food. There are other pizzerias in the city with delicious gluten-free pizza that don't over charge. I will not go back.", "author": "Seatyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Great for groups! Our soccer team just had a 40-50 people party here, Ken and his staff were great.", "author": "Guillermo L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "Ordered for delivery online and turns out they don't deliver very far (we are 2.5 miles away). But their site said they did. Bad service. Wasted our time.", "author": "Shanna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-21", "description": "I remember coming here with my cousin's volleyball team and thinking \"Eagle pizzeria? Really? It should be Giovanni's or Luigi's or something more Italian\" \n\nYou wouldn't glean a good feeling from \"Steve's Sushi palace\" would you?\n\nPROS: The pizza was actually pretty damn good and so is their selection of beer. Our food came out promptly and all the combos were really good. \n\nCONS: The location is a bit difficult for people with disabilities and most importantly, the price of beer is THROUGH THE ROOF!\n\nI would like to say I'd come back here but I'm not quite sure. I dont come to SF very much anymore and even splitting the tab amongst us, I remember shelling out quite a bit because of the beers.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-28", "description": "DO NOT EAT AT THIS RESTAURANT!!! \n\nThey have terrible customer service and the pizza is not good enough to overcome the rude management. Spend your money elsewhere!", "author": "Dale A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-18", "description": "I wish I could leave a better review.  Unfortunately that will not be possible.  The only thing pleasant about this place was the phone conversation when I placed the order.  The gentleman was patient, courteous and helpful.  I ordered a small pizza and a full size of wings.  The pizza was burnt as were the wings.  I ended up throwing the whole thing away.  The food was terrible.  It wasn't cheap either, about $34 for that order plus tip.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-24", "description": "Love Eagle Pizza!!!\n\nGreat Ceasar Salad, and the pizza is an 11 on a scale of 10!", "author": "Jim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-09", "description": "Unless you have kids and need a place for their soccer team party, head to Seniore's or even Taraval. This place caters to the family, with kids toys in the corner and classically cheesy red-and-white checkered table cloths. Thankfully I got my order to go.\n\nA few nights ago I ordered a greek salad and a medium pizza, half cheese and the other half mushroom and pepperoni. The total was a little over $35, which seems really expensive to me. It was also kind of weird because it took the guy forever to run my card, then even longer to get me an itemized receipt.\n\nThe salad ($10) was bountiful and the vegetables used were pretty fresh. The dressing was kind of weak, seemed like a modified Italian dressing, but it wasn't awful.\n\nThe pizza (~$22, apparently) was a mix of good and bad. I really like the crust and sauce, but I think they could stand to use higher quality cheese and toppings. Like with most places in SF, it's thick crust, which isn't my preference but is still appreciated when done well.\n\nThe food here isn't bad, but it's not good. It's also expensive and gimmicky. I can't imagine that I'll get eat here again.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-08", "description": "I know... everyone had written 4-5 stars for this place. I'm sorry but, well, this is my honest experience.\n\nWent to Eagle as it was highly reviewed on Yelp for the best gluten free pizza. Ordered a pie and the owner convinced me to get the Caesar salad (his wife had made the dressing that morn). Left $38 bucks later with my to-go order (for a medium pizza and a salad). And bummed I tested this out on friends.\n\nThe salad dressing tasted (and smelled) of garlic. Nothing else. No anchovies or creamy, just garlic. The lettuce wasn't crispy and had some brown edges.\n\nOur pizza was, well, not the best. I've had gluten free pizza from Amici's and, altho the owner of Eagle talked it down, it tasted better. The toppings were average and the crust, which I was told is from back east and the best in SF, was both undercooked and kinda gross tasting.\n\nI love small family owned places but want to warn those who are looking for a gluten free pizza that this isn't your best choice. Will let you know (I promise) when I find it!!!", "author": "Missy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-14", "description": "Terrible pizza, horrible.  Won't order from there again.  Delivery took about 45 minutes.", "author": "timothy m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Great neighborhood spot. Been here forever. This isn't gourmet or hip-just great pizza for a fair price. Excellent crust! Ken (owner) is VERY accommodating, especially if you have kids. They have a kids play area, toys, and a changing table with free diapers in the restroom. Big screen TV and they let you change the channel if you want to watch something special like kids shows, etc. Good beer on tap.", "author": "Tommy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "Eagle Pizza is the best kind of neighborhood restaurant. Ken & Amy are the best, great family friendly atmosphere & the best pizza around!", "author": "Courtney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Really like going to Eagle Pizzeria. The pizza is good, but the atmosphere is why I keep coming back. Just a great family friendly place to enjoy a game and grab some pizza. Very friendly people as well. Thanks for being my go-to spot in the Sunset you guys, keep it up!", "author": "Will D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "A very good neighborhood pizzeria, good pizza and good beer.\n\nGluten free pizza, life saver.  Went there on a Sunday afternoon with family.  The gluten free  stuff isn't on the menu yet (8/29/10) , but the sign in the window was clear enough.  The owner was working the front room, so he explained that they are getting ready to update the printed menu to reflect the gluten free crust. \n\nOne of us had to have the gluten free crust. And this person has become a bit of an expert on gluten free, and loved the crust.  Also ordered was a regular combo with most things on it.  Both pizzas were very good.  The toppings were very good quality, the crusts were crisp.  Not doughy, not soggy.  It held up well.  \n\nAnd they serve the Racer 5 IPA, which appears to be a cult classic.  \n\nFinally, some pizza theory.  I've noticed, when searching for pizza places, that there is a certain arrogant all or nothing perspective.  If aint from 1)new york, 2) Boston, 3) chicago, 4) Naples, or 5) Joe's at the corner, then your pizza sucks.  Come on, there are all kinds of interesting and great pizzas out there. Explore and enjoy.", "author": "PAUL K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-21", "description": "It is easy to describe every pizza at Eagle Pizzeria: rubbery and salty.\n\nThe cheese on the pizzas slide off during the initial bite in one, rubbery chunk, and exposes the salty, one-dimensional tomato sauce on the slice.  The toppings were few and far in between, which was especially disappointing for the pizza we created, since additional cost was added per topping.  I have had better freezer pizzas.\n\nThe buffalo wings were below average in both size and taste.  Some of us even experienced some wings that were still cold inside.  If there was some doubt on the freshness of the pizza, there is definitely no doubt that the wings are from the freezer.\n\nThe most stomach-wrenching part of the meal was the cost.  At Eagle Pizzeria, the cost of four small slices of pizza that I would like to remove from memory is almost the same as going to Round Table Pizza's lunch buffet twice.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "I like this place.. I've eaten there with my nieces and nephews for family night and have also picked up pizzas here to take home.  I like the neighborhood..I used to live there for about 7 years.  Good beers too.  I think it's kinda pricey if you go there with a few friends for pizza and beer, and I would probably go more often if it was a bit cheaper.  \n\nOverall, good pie, good people and good times at Eagle.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Had a good experience with both eat 24 and Eagle after a bungled order.  They called to ensure that the error was theirs and re delivered our correct pizza(outstanding) within a within a reasonable time. Definitely worth it!", "author": "Carolyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-05", "description": "Something about the pizza just isn't right. \n\nI'm not sure if it's the sauce, the cheese, or the pizza dough. It's one of those. I almost felt like the sauce was from a can or bottle, it definitely didn't taste authentic. It almost tasted cheap and rubbery. The cheese wasn't fully melted on our pizza, so that was definitely a negative. And the pizza dough? Hmm, I just can't explain it. It was slightly tough, and it wasn't fluffy or soft and chewy. It was just...tough. \n\nOn a more positive note, it is a neighborhood joint, and it's a place where you can just hang out with your friends to grab a quick bite to eat. It's super relaxing, dimly lit and has a few TV's to watch a sports game or two. Plus, the people here are super nice. I just wish the food were better, it would definitely up my review by one or two stars!", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "Best ravioli in town, so far. My only complaint is it's a little out of the way for me (which of course is no fault of theirs). Places like this seem almost impossible to find outside of San Francisco. A nice family owned restaurant with good food. Especially in the pizza business.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-03", "description": "the best place for pizza on the foggy side of SF. Ken and Amy have a nice little shop here. quality product and friendly people.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-09", "description": "My sister, a regular here, says the Eagle Special is consistently good. My eight carnivorous dining companions wolfed it down last night, so I believe her. It had pepperoni, sausage, and veggies, and was a bit light on the cheese. My friends said they really liked it. \n \nBeing the lone vegetarian in our party, I had the Greek pizza. The pesto sauce was tasty, but unfortunately its flavor was overwhelmed by the abundant cheese (a strong feta).  I did like the crust though --  it was crispy, thick, and firm without being too chewy.  You can hold the slices in your hand, they're not floppy at all.  \n \nWe called ahead so our party of nine didn't have to wait for a table. I noticed the place had a very laid-back, kid-friendly vibe.  The energetic staff skillfully delivered pizzas and drinks with children underfoot, and they even tolerated those kids in the corner, performing some sort of experiment with pepper.", "author": "angela n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "I went here for the first time Friday. I have to say I was surprised at the quality of the pizza and toppings. The pizza crust had a good crunch to it. The toppings seemed fresh. Most of all the prices seemed very reasonable for San Francisco! \nInside what can I say, a sport lovers delight! The place was clean, and offers an area for kids to play while they await their food. \nOnly negative is that they could use a hand in the dining room. They seemed short staffed at the time of the visit.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-11", "description": "1. Cute restaurant.\n2. Personable service. \n3. Back of restaurant appeared sloppy. I noticed when I went to use the restroom. \n4. Pizza was below average. Red sauce was sweet and tasted like pasta sauce from the supermarket.\n\nBottom Line: I won't go back.", "author": "John W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-07", "description": "I ordered the Chicken Parmagiana for take-out, which was listed under \"Pasta Dishes.\"  When I opened the box at home, it was just chicken and a side of garlic bread.  No pasta.  Felt pretty duped.  Would have been nice if the online menu indicated \"no pasta included.\"  As for the chicken, it was OK.", "author": "Edward B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "I came to Eagle Pizzeria not knowing what to expect, but got a $10 for $20 voucher via homerun.com, so I figured it would be worth trying even if the food wasn't great.\n\nWhat a pleasant surprise!\n\nThe Greek pizza was SOOOO good. The flavors worked together really well, the pizza crust was perfectly toasted (a little crunchy on the outside without being tough or too chewy), the cheese was just slightly toasted on top, OH.. and we asked for the pesto on top instead of on the inside of the pizza, and it was perfect. They had just the right amount of tomato sauce inside the pizza so that it wasn't squirting out and scalding your mouth with every bite, and the entire top of the pizza didn't fall off when you bit into it (I hate that). There was plenty of feta to give it a nice flavor without being over-powering, and there weren't TOO many olives (I'm not a fan of olives, but the other flavors of pesto, spinach and feta were the main flavors, so the olives were more in the background.. which I liked).\n\nThe service was good, the owner was very friendly, and I think I'm gonna have to come back to this place soon... though I may need to buy another homerun voucher first b/c money's tight, and the pizza is a bit pricey.. but this place is totally worth going to again.", "author": "Laura L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "Love this traditional medium thick crust pizza! The sauce is perfectly spiced, just the right amount of cheese. Highly recommend plain cheese pizza here for kids, it's a crowd pleaser! And ready in about 15-20 minutes!", "author": "Ce Ce M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-05", "description": "Pizza overpriced and way too salty.  Woman that works there was  rude.  Having a a post soccer season party there and she complained that the kids were too loud.  We were the only people in the restaurant on a Wednesday night, the kids were having fun and behaving themselves and we spent quite a bit of money.  She then puts the TV on Cartoon Network.  This place has tons of toys and sells a lot of candy.  And you want them to shut up? Real nice - get the kids to zone out on TV instead of socializing and having fun.  First and last time there.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "I want to be as helpful as possible to my fellow Yelpsters. Here's the deal.\n\nThis place is great for three reasons.\n\nFirst, if you have kids. This is the restaurant to bring a softball team. They cater to this clientele.\n\nSecond, if you live in the neighborhood: Parkside, Central Sunset. Fits the area exactly: quiet, not flashy.\n\nThird, if you are gluten free. They have GF options and they are very good. My wife is GF. So we come here every time she has a craving for pizza.\n\nNow here is what you should not expect. It is not the best pizza in San Francisco, nor the cheapest. It's just good, decent, ordinary food. Don't bother coming here if you're thinking it offers the latest trends in gourmet dining.\n\nI've said this in other reviews, so you know my bias. It's a bias I am proud to have, not some invidious prejudice. I like places that are mom-and-pop operations, not big chains. And that's what San Francisco is about, too. So this is the place you've got to like if you have that same commitment: the proprietors are a married couple who are decent, friendly, hardworking. \n\nHighly recommended on those terms.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "Great food and the owners were great to talk to. We must have talked with them for about 20 mins after we ate. Great family and mellow vibe there. We got the gluten free crust and it was really good and crispy.", "author": "Jim L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-21", "description": "We ordered delivery from Eagle tonight, being new in the area and interested in trying local pizza. It wasn't the worst pizza I've ever had...but it was pretty bad. The entire pie was over-cooked, the crust was hard (not crisp...hard), and my husband wouldn't even eat the wings. We'll try a different place next time, and every time after that. It's just not good.", "author": "Sunshine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "I like Eagle Pizza.\nThe pizza isn't the best in town and sometimes the service is slow, but the beer selection is good and the owners are nice. It's a good place to take kids who don't exactly know how to sit at a table for an entire meal. Missing one star because of the pizza. It's still good, it's just not the yummiest, ever.", "author": "Andrea L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-23", "description": "It's a solid pizza joint - not the best, but I've definitely had worse. \n\nWe ordered an XL, thin crust, cheese pizza for two people. I didn't think we were going to finish it, but I guess the thin crust makes it take up less space in your stomach. Everything was just OK - there's not a whole lot more to say about the pizza. \n\nService was great. We were the only ones in the place, which made it kind of nice.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "A long-time friend of mine and his girlfriend returned to the Bay Area to visit and we decided to chat over some fine pizza on a Saturday afternoon. Feeling a bit adventurous, we got never-before-tried anchovies to go along with the sausages and mushrooms on our large pizza. All the ingredients were small and thinly sliced, which is great for me because, having a distaste for mushrooms, I couldn't taste the fungus with all the bread and cheese I ate. Eating the anchovies was different--in that it wouldn't be my first choice of topping, but that's just me--and juice squirted out when I bit into it and definitely had a fishy flavor that was not outright unpleasant. My only disappointment is the size of the sausages. I expected the typical small-to-medium, round meats, and what we got on our pizza was difficult to distinguish from the anchovies.\n\nAlthough it's on the pricey side, I would recommend Eagle Pizzeria to friends and acquaintances for its fresh ingredients and warm and friendly service. The place is spacious and has plenty of seating, though its decor could use a little updating. By the way, I know Ken, the owner of this place, and both he and his wife are good and honest people, always having a smile.", "author": "Cliff W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-08", "description": "I worked in a bustling pizza delivery joint for 3 years and so I know about preparing and cooking a good pie. \nI got delivery- ordered a small 4-topping pie, green salad, and a can of soda\nStrong points: \n-fast delivery (about 35 minutes)\n- very very good crust: airy and light with a good crunch on the outside, not chewy at all\nWeak points:\n- pizza was missing the Zuchinni I had ordered (and paid for)\n- roasted garlic was in big hunks, needed to be cut up a little more and evenly distributed\n-  the lettuce in the salad had brown pieces (I work making food in a cafe and if I see brown lettuce its in the trash bin immediately) \n-asked for light cheese and the pie was saturated (more cheese than toppings) \n\nIt's the little things that count. While there were the few good points, overall it was a sub-par meal- this place could be really good if they iron out the kinks", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Pizza was good.  Crust was nice and crunchy.", "author": "Ernest Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-02", "description": "Back in high school I always heard about these pizza nights at this place. I saw pictures of the delicious pizza with the cheese all melted and oozing..\n\nSo finally I decided to go down there...and of course I brought my lady with me..  AND OMG this place was like chuck e cheese!!!! This place was swarming with kids...man it was like 70% kids and 30% adults...wtf?!!??! \nNow I dont really hate kids, I love kids...as long as they are not mine that is.\n\nAnyways, so we were seated immediately which was great. A 2 person table next to the wall, away from the door. Unfortunately the table was next to the demons from hell. The table next to us had like 12 kids!!!@! 12 kids who started off by throwing popcorn around, then started throwing pizza crust around. A crust of a pepperoni pizza was thrown and hit the way 4 inches away my head. I gave that little pipsqueak the craaaaaaaaaazy eye and he shut up and looked at his plate.\n\nKIDS SHOULD BE KEPT UNDER CONTROL DAMNNIT!!\n\nOk, on to the food. Now the pizza was not bad, it was pretty good. We had the eagle special or something. It wasnt greasy and the cheese didnt pull off all the toppings when I was eating. Also decided to try out their meatball with spaghetti, that wasn't really that great taste wise. I was craving for some meatballs and yea...I dont think I will order those for a while now.\n\nSo even if the kids were not there this establishment would still get 3 stars. Its not the owners fault that he had these demon spawn of hell dining here, but as an owner he did the best he could and I could tell he was working his ass off to make sure everyone was happy.", "author": "phillip w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-09", "description": "I'm confused.\n\nWe ordered the pre-made, shipped from CT, gluten-free Hawaiian pizza for delivery. The crust was good. The mozzarella was rubbery. The ham and pineapple were funky. The red bell peppers were random.\n\nYou're know you're in trouble when gluten-free crust tastes better than cheese.", "author": "Katherine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-05", "description": "The last time I was here, it was over six years ago (I call that time \"pre-kids\"). I remember that the service was good, pizza was great and the price was right (coupon from the Entertainment Book). \n\nYesterday, the whole family went here after an exciting time at the remodeled California Academy of Sciences. I tell you, nothing has changed, which is an absolute good thing. \n\nService: \n\nThe owner sat us down promptly. There was a birthday party going on at the time, but it looked to me he had things under control. This guy is exactly how I remembered him - \"happy go lucky\" attitude and very friendly. Made my family feel right at home. Never missed a beat and we really didn't have to ask him for things such as refills on drinks. \"Accommodating\" is the word I would use. \n\nFood \n\nOnce again, we had a Entertainment Book coupon (50% off pizza - up to $9.00 value). We had a four-topping pizza with mushroom, pepperoni, sausage and ground beef. When it came out (piping hot) and I had my first bite, I had completely forgotten how Eagle Pizzeria makes their pizza different than anyone else. Dough is made fresh every day (according to the owner) which apparently helps with making the crust just right - pizza holds up (doesn't start folding in half) and it doesn't get soggy from the sauce. They do not use a lot of cheese either - just barely enough to cover the top (I'm used to a ton of cheese from other places) and not overpower the other toppings (or make you feel full quicker). \n\nCleanliness \n\nPlace looked clean. Bathroom surprised me - not just the fact it was clean and stocked, but that it had baby supplies! Baby supplies! You know - diapers and wet wipes! LOL! What a relief for parents! Also, it took only him and his coworker 15 minutes to clean up the place after the birthday party crowd left (props to the dad of the birthday boy for offering us TWICE their birthday cake cupcakes for our kids, which we politely turned down). \n\nFYI - S.F. Health Dept. requires restaurants to post their scores. I saw the sign when we left and it was a perfect 100! For someone who had retaken and passed the Food Safety Manager's certification class, I was impressed to see the score. \n\nOverall: \n\nThey apparently have loyal customers as another family group came in, apparently getting ready for a Fantasy Football League draft party. The father went right up to the owner like they've known each other for years (which seemed the case). Lots of 49ers and Giants memorabilia! This place is the real deal!  Nice to see that old school neighborhood restaurants still exist.  Come on by for a good time and GREAT PIZZA!", "author": "Mario P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "Eagle Pizzeria deserves 4 stars for their tasty pizza crust, inventive pizza topping combinations, and exceptional service. I have to stress the down right homey feel (red and white picnic-like table cloths, kids running around, complete with a stocked diaper changing station in the restroom) you experience with the friendly service and family oriented vibe, and is the real reason Eagle Pizzeria gets 4 stars. \n\nOur large group arrives and though we had reservations for the large table with view to the large tv, we were seated elsewhere (near the smaller tv) because another large group occupied it. We were told we'd be able to move to the table at a later time which was fine at the time because we were waiting for a few others in our party. 4 or 5 pitchers of beer later, we decided to just stay put at the table, and the waitress accommodated us (added new table) as best she could. Nice that bought us a pitcher for our troubles. \n\nAs some of the other reviews have mentioned, the pizza is not the best, but definitely solid with the crispy crust leading the way. We ordered the Eagle Special and Amy \"E,\" which we were later told are the best off the menu. The Eagle Special is your typical combination with peperoni, sausage, mushrooms, bell peppers, green onions and olives. The Amy \"E\" is simpler with sausage, white onions, mushrooms and jalapenos. I love heat, so this was favorite...simple flavors, and nothing competing each other. \n\nGo to Eagle Pizzeria for the excellent service, and the Amy \"E\"...will not disappoint.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "We first went to this pizza place immediately following a birthday party.  We were excited to see that there were toys accessible for all of the little ones to play with.  My husband and I weren't sure if we would return, but thought we should give it a shot.  Luckily, we arrived long before a post sporting event of 30 arrived.  My daughters were occupied with the play kitchens and it was refreshing to know that there were lots of kids there, so I didn't feel too bad when my youngest started to whine.\n\nThe owner is extremely friendly.  The pizza was absolutely delicious, and their tomato/cream sauce sure is tasty.  We used to go to Pirro's for our family pizza nights, but it was so not clean and kid friendly.  We are excited that we have another kid-friendly restaurant so close to our home.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-04", "description": "Not the best pizza I've had in town - but then again, SF is definitely NOT a pizza town.  Service was great, pizza was so so.\n\nThe dining room was fun with a sports theme.  And it does have a definite local joint feel to it.  \n\nBut perhaps the best part of my recent visit was when the cute young guy with the cap and curly black hair seemed to flirt with me... me?  mmm mm now THAT'S tasty!", "author": "Jim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-20", "description": "I've been to this place a few times, and it's the ONLY pizza place I want to sit at and eat, they do deliver too though. It's kid friendly and being a parent, what's not to like about that!? They even have a toy corner so the kids can go play, after wolfing down their food, so you don't feel rushed. They have Art done by the owners and patrons kids on the walls, as well as an entire wall for San Francisco Sports fans. And the big screen TV is usually set to one of the many games. \n\nMy daughter and I shared a chef salad and small pizza, it's was so good we had to walk home to work some of it off, lol... I love the way they take the sauce and cheese up on to the crust, I'm not a fan of dry crust, blah. The staff is also so friendly it's a FUN place to go out for pizza and I tend to think \"fun\" rather then \"hip or trendy\" when i think pizza, I also tend to think BEER! Boy do they have a selection of beer, almost a flavor for everyone, they also have wine, juice and soda available too. \n\nIf you've got a kid or are just looking for a FUN place to have a slice, and a beer,  besides the comfort of your own home, give this spot a try I'm sure you'll enjoy the friendly service, and delicious food.  And if you feel like staying in they also deliver!", "author": "Ariona E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "I first smell the pie for a few minutes, taking in puffs of tangy sauce, the yeast of the dough and the sweet mozzarella. Then, I take a sip of one of their microbrews while visually admiring the pizza. From there it is a blur....a carbo-licious faint memory. \n\nIf in the mood to get out, we will eat there, starting with a salad. However, most of time we have it delivered on a lazy Sunday afternoon while watching a Warriors game.  There are plenty of other pizza spots that deliver in our neighborhood - but Ken & Amy's is our choice.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-24", "description": "Never eaten there, always got delivery.\n\nB+ pizza, A+ service, so would be 4 stars. Except that they (a) know beer, and (b) deliver beer to your door at midnight at very reasonable prices, which brings them back up to 5 in my book (or 6 if it were possible).", "author": "Uncle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-14", "description": "Very good pizza, and the folks who run Eagle are VERY nice and very friendly.  They work their butts off but are always pleasant.\n\nThe pizza is my favorite in the Parkside.  As others have mentioned, the crust is notable.\n\nI wish they opened earlier on Sundays, so I could gorge myself on a pie while watching the 49ers suck.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "I come here everytime our group finishes a show ! we come here to celebrate. And first of all the service here IS GREAT ! One time when we came around like 10 pm It was about to close. But the owner still took his time out to actually re-open the store for us to eat in . I thought that was wonderful. And the pizza here is great. many varieties of toppings to choose from and they are all not expensive at all ! all i can say is great place ! \n\nThe bad new is just tiny. The atmosphere was kind of dark. i personally like eating in a well lighted place. but thats about it.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "a group i help out with holds their meetings here.\n\ncame in and didn't expect to eat...just talk about what we were gonna do with a fund raiser then leave. \n\ni tried one slice and i loved it.  i can't say its better than my favorite places which I DO NOT GIVE POINTS FOR BEING CLOSE BY though i should.\n\nthis place was just very tasty and i ended up ordering two pizzas to go so i could be sure how much i liked it.\n\nto be sure how much you like a pizza...bring it home...let it get cold and eat it after an hour or more.  if it STILL TASTES GREAT!  ITS A GREAT PIZZA!  \n\nthis place is good and i'm a fan.\n\nIf you want GREAT PIZZA you'll have to look at the other places i've listed as TO LIVE FOR!  those two places are totally different too.", "author": "Bing D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-26", "description": "I find myself passing out stars based mostly on the experience I had somewhere rather than the actual product (in this case food). This place feels good when you walk in. I immediately figured out it was a family owned restaurant. The walls are covered in childrens drawings and sports memorabilia from many different decades of bay area teams. The baby chairs are ones you would buy at any baby store and not those ones that are wooden and look very unwelcoming for a little kid. I appreciated that little touch. It made me feel as though I was in someones house rather than a restaurant. The server, and I presume the owner, sat at our table and took our order. No problems at all with the service. Everything was well done on that front. \n\nNow to the food. We didnt get pizza, which I feel is a little unfair for Eagle's because the food we got might not be the best representation of their menu. Most people rave for their pizza and we didnt get it, but the food we did get was pretty good. I got chicken parmigiana(sp?) and my buddy got penne alfredo with chicken. Mine was good. Needless to say I ate all of it, but it was nothing set apart from all the other times I have had this dish. Eagle pizza gets four stars, well done, I will be back to try your pizza.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "The beer selection was immaculate!  We couldn't believe how great it was to have people care about beer like my husband and I do!  :)  Oh, and the food was great, too.  We had the margherita pizza, which they just added to the menu.  The price of the pizza was great, as was the fresh basil, and crust.  The ambience was really cool--old sports memorabilia & framed \"art\" drawn by little kids.  What we liked the most, however, was how kid friendly they are.  There is a nice changing table with diapers and wipes, and tons of highchairs available.  The owners took the time to come and talk to us and tell us how cute our daughter was.  It was overall a really fun experience and we were really glad we stumbled across it.  We will definitely go back!", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Excellent pizza, not those franchise places.  Excellent services. Great for large party.", "author": "Dee B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-08", "description": "When I walked in here I couldn't decide if this place wanted to be someone's living room or a restaurant. It could go either way.\n\nOn a Saturday night the dining area was mostly empty. I approached the counter area and observed a young man in the kitchen happily sticking his fingers into a pizza from the oven, tasting it, then moving on to another pizza, again deeply shoving his fingers into this pizza as well, before catching me in the corner of his eye only then stopping mid-lick. Disgusting.\n\nI was hungry and not familiar with the area, so I decided to order a pasta dish anyway. A woman served with me with what could only be described as a surprised look on her face- sheer bewilderment that I was there at all, I suppose. I ordered a Spaghetti and Meatball dish, which she returned with in a few short minutes. It was a large plate of food and it resembled something between what I remembered from a school cafeteria and about how I would imagine prison food tasting- bland, uninspired and damp. Think watery tomato ketchup. The pasta was a disgrace- horrible. Come on people, look up a recipe on the internet.\n\nHaven't tasted the \"Finger lickin\" good pizza. I'll leave those reviews to the others.", "author": "Stefan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "Great service from Ken and Amy.  Family-oriented atmosphere with kids running around, etc.  Great for sports-teams, etc.\n\nI actually don't like their cheese, but their bread is very fluffy.  \n\nI MUCH prefer these guys over Seniores or Fing North Beach.  Bleh!", "author": "Dong T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "Pizza was really good, and staff was very understanding and courteous when I mixed up the delivery times. The cheese, pepperoni and greek were all delicious, thick crust and great flavor.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "I owe it to Ken and Amy to write a review for Eagle. I don't understand how anyone can rate this place anything but 5 stars. Since the first day I stepped foot in this restaurant, the staff offered a warm and welcoming atmosphere. They also have a big flat screen TV if you ever wanna go somewhere to watch the game. As for their pizza, eagle is one of my favorites in SF and easily the best pizza on the west side of town. They make their own crust and always use fresh ingredients. I've never seen any grease on any of their pizzas and I'm willing to pay a little extra for this kind of quality. Eagle is a must for any pizza lover in the sunset! You will not be disappointed!", "author": "Joe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "After 3 years of trying to find a freakin pizza place other than Pizza Hut and Round Table, we have found one!!!!!!!!  I picked up the pizza and yes, it is not a gourmet pizza place or an upscale restaurant.  It is a totally local owned, operated and loved place.  Yes it has a sports bar theme.  Yes there are toys for kids to play with. But yet I am NOT A BREEDER (see other reviews) and I like this place!!!!!!  \n\nHubby to be ordered a pizza with veggies and I had cheese-less (yes they make cheese-less  pizzas and don't look at you weird) with veggies.  The crust was crispy (not hard) and thick but not like eating a loaf of bread.  \n\nWhile I am typically a big fan of was producing, huge chain food, I do appreciate local businesses as well.  However, I have a beef with people who complain about chains and then complain that something is \"too local\" or \"low brow\" or what have you.  Guess what people?  A place like this is about as local as you can get.  Get off your damn soapbox and I'll get off mine too and I will treat you to a slice of Eagle Pizza.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Best damn pizza and service I've ever had since moving to San Francisco.\n\nHad I never moved to the Outer Sunset, I might not have discovered this glorious pizza shop.  The owner is just an awesome guy who always remembers me and treats me with respect.\n\nWhat is 5-Star worthy of Eagle Pizzeria is that I called one night, around 10:15pm (they closed at 10) and asked about ordering a pizza.  They recognized who I was as a customer and the owner himself cooked and delivered my pizza by 10:35pm (granted, I do live about 10 blocks away).  He proceeded to thank me for the business upon delivery of my deliciously hot pizza and told me I was a good customer and he was glad to help me out.  I was starved too so this was quite a way to solidify a customer.\n\nI've tried Nizario's, I've been reduced to Seniore's, and then I was blessed by Eagle Pizzeria.\n\nDon't get me wrong though, the aforementioned pizza places still definitely rock way more than your regular Domino's or Pizza Hut.\n\nThanks Eagle!", "author": "James G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-05", "description": "If you love pizza, sports, and extremely friendly service, Eagle Pizzeria is THE place to go!\n\nThe owners are some of the nicest people you'll ever meet in life! Ken is usually my server and he's always fun to talk to. He's so laid back and will talk to you about sports, family, occupation, etc. \n\nOn all four walls, you'll find sports memorabilia. The restaurant is full of autographed jerseys from the 49ers, old photos of the Giants, etc. It's a real joy to look at while waiting for your food. There is also a television that's always playing a Giants game if they are playing that day. \n\nAnother great thing about Eagle is their wide selection of beers on tap and bottled. My dad and my brother love trying new kinds of beer, so this was a good place for that. Ken made a bunch of recommendations and we were quite pleased. \n\nAside from the pizza being really good, it's just a great place to go with yoru friends, family, sports team, etc.", "author": "Allan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "Came here for dinner after work last night and it was awesome. The people who run the pizzeria are all very nice. We got a thin pepperoni and it was fantastic. I didn't feel all stuffed and crappy feeling afterwards. The prices are very good compared to other places in SF.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-14", "description": "The only thing I liked about this place was their chicken parmesan sandwich.\n\nNot only are they over priced, but for being not too far from me their delivery time sucked. They took forever.  I almost didn't want to tip.  But being a past delivery driver myself I could never do that.\n\nGet your act together", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-18", "description": "Came here and every time I've walked in, they've screwed up my order. I must have the \"let's screw with this person\" look on my forehead. However, my friends like it, so I can't bitch about it being crappy. \n\nThe pizza is good, I like the stuff a lot, but order something like Lasagna, and the quality dips a little south. Once I ordered a meat lasagna, and they gave me a vegetable lasagna instead. So how did they rectify this? By just pouring some meat sauce over my lasagna, and then reheating it. Great. So it comes out messy, and crappy. Whatever... everyone needs to save money during the recession. \n\nHowever, it is a really nice place to go eat, and like every reviewer has said, there's sports memorabilia everywhere. \n\nBut don't make me order. They'll probably screw it up again.", "author": "Clinton L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-21", "description": "I don't get why everyone likes this place so much. For me, there are 3 classes of pizza in my life: delicious pizza, mediocre pizza and sh*tty pizza. I classify this as close to the sh*ttier side. Don't get me wrong, the service is a plus but the way the pizza's made along with the ingredients involved..oh man I won't go there. \n\nJust cuz most kids go to lincoln high school and its one of the closest pizza places, everyone from lincoln or in that vicinity goes there to eat. The  toppings were eh..everything slid off my slice before it got to my mouth. The sauce wasn't evenly placed on the pizza and in hawaiian pizza, you add ham. where was the ham?! Well whatever, despite the price, my friend and i ate there just to try it out. we ended up delivering the rest of it to his dog n went to Milano's on 9th n Irving instead. Just cuz its open late and is crowded with highschool hooligans doesn't mean its a really good place. That's my take.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "Pizza was very good. We ordered delivery and it arrived very quickly. The dough is nice fresh and the toppings good as well. A little pricey, but worth it since we were hella hungry.\n\nOverall, I'd say this is the best place to get pizza in the Sunset district.", "author": "Hart B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "This place gets an extra star for being able to accommodate large groups. This pizza was decent. Nothing super crazy special but I would definitely come back again. There really wasn't anyone in the restaurant on the Saturday morning when we went so service kicked bootay. He (I'm assuming the owner) was on top of everything. We also had salad and wings which were a bit too spicy for my weak ass. \n\nOverall a good place with a decent selection of beer and a good pizza.", "author": "Alia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-08", "description": "3 1/2 stars... It feels like you're hanging out at your friend's basement playroom. It has a very home-like vibe. There's sports memorabilia, family photos, and children's drawings on the wall. Plus, there's carpet...when's the last time you saw carpet at a pizzeria? Very kid friendly.\n\nThe pizza crust is light and very, very, very crispy.  Because of this, you eat more slices than you're use to. If there ever was a \"healthy\" pizza, this is it.", "author": "Ezduzit S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-11", "description": "The pizza could not have been better.  UFC on the tv was a nice touch.  More than enough room for the small group of seven I was in on a Saturday night.  The place is clean and well kept by a friendly staff.  Wide beer selection too.", "author": "andrew l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-12", "description": "Haven't ate here in awhile so my review is based on past experiences many years back.  I always remember that this was one of my favorite pizza joints.  The reason was that their crust was extermely crispy and memorable for me.  \n\nAnd for me growing up, I was always a non-crust eater until I came here and said, \"Damn, I ain't wasting this crust! It's Damn Good\"  \n\nSo not sure how good they are now, but I will certainly come back here at some point and judge it for myself.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-15", "description": "Ah memories of \"Sports Bars\" in the frumpy Midwest...the big screen TV's, the thick cigarette smoke, the \"Red Wings\" flag above the pool tables...\n\nWait! I live in California now, so why do I suddenly feel like I'm back in the Midwest?\n'Cause the interior designer of Eagle Pizzeria must have hailed straight from the \"classy\" rust belt. I found myself momentarily searching for snowmobiles parked outside...\nI left the Midwest for many reasons, one of them being the complete lack of aesthetic appeal ANYWHERE. So walking into Eagle was needless to say, slightly nostalgic. Not necessarily in a good way. \nPizza was decent. \nThere is GREAT pizza (little star) and then there is decent pizza. (eagle) Give me a good cold beer(s) and some conversation and decent pizza can suddenly become pretty ok. \nService was excellent. Friendly and efficient. \nIt's just down the street from me, but would I go back? Maybe, but only if they gut the interior. I just hate sports memorabilia, like with a passion.", "author": "D H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "The best pizza in town. The owners are great and take pride in preparing the pizza and serving it. Great place!", "author": "Marina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "Really good pizza place at a reasonable price.  Their seafood pizza is good but so are all the others. Awesome family place. If you have little ones, this is a great place to go. It's just a great family place, the family that runs the place is really nice too. \n\n\nThey have an awesome bottled beer selection at a great price. I had that Alaskan Smoked Porter for less what I paid from BevMo.", "author": "Will U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-08", "description": "Bf was referred to this restaurant by one of his liquor representatives. We were in the neighborhood visiting, so we decided to have dinner here. Inside has a nice, home-y/comfortable feel. It is self-sitting service, so we sat at a table near the window. One of the workers brought us a couple menus. First off, the service was wonderful. The gentleman was very friendly and always made sure to check on us when he was coming our way. To order, you have to go up to the counter and wait for the food to be delivered to you. We had a short wait time...roughly 15-20 minutes. We ordered the gnocci and a medium pizza to share. By the way, their medium pizza was bigger than what we expected. I wasn't a fan of the gnocci, but I didn't mind it. However, I don't think it was home-made. Anyway, I'm not too big of a food snob. The pizza was good. I would definitely come back for the pizza. It was rather dough-y, but I enjoyed it. Additionally, I appreciate that it is a family-owned restaurant. It's something that I admire, especially in SF. When I come back, I'll be trying other items on their pasta menu.", "author": "Marie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-15", "description": "Eagle Pizza is a great place for the family.  The environment is warm and inviting, and very Sunset.  The caesar salad had yummy dressing, and the lettuce was fresh.  The vegetarian pizza had a nice array of fresh veggies, including tomato, bell pepper, olives, and mushrooms.  I love the dough - it's really fluffy, but still has a crunch.  The service is very friendly.  I used to go here all the time in elementary school for victory dinners after volleyball, basketball, or soccer -- and it hasn't changed a bit (in the good way).", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-23", "description": "Meat ravioli with sundried tomatoe sauce was best pasta I've had.", "author": "Katherine O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-23", "description": "I will never return. But let's start out with the OK bits. The wine was fine. The beer was reasonably priced and there was a wide selection. The owner seemed nice and did ask us if anything was wrong when she saw our faces and how we were not eating...but the food was not something I would pay for. Even if it were free, unless I was really, really hungry, I wouldn't want to eat it. However, it didn't make us sick. \n\nGreek salad: Not awful, but the lettuce was strangely much too cold. The olives were kalamata, and yet seemed not as fresh as they should be...they were too soft and had a gross texture. The dressing didn't seem right, either. \n\nBuffalo wings: Really small, almost shriveled. My friend wouldn't eat a whole wing. \n\nPizza: Yuck. I guess you could say \"crisp\" crust, but I think of it more as hard. \n\nThe dining area is weird; on the night we went, no one else was there, but this girl (the owner's daughter?) was watching American Idol, turned up pretty loud. \n\nMaybe I could see going there if you had kids and desperately wanted someone else to cook for you? Maybe? But for us, no. We actually left and ate across the street at the Japanese place.", "author": "Lainunu J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-04", "description": "This is a review for a place that I used to live down the street from back in the late 90's so maybe it's different now but I am giving it 5 stars because every Thursday I used to stop in and get the special Meatball Sandwich.  It was to die for and I had that Meatball monkey on my back for the entire time I lived in SF.  I hope they still make that sammy so when I return I can OD on them....", "author": "chuck p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "I have been on a gluten-free diet since August and I am trying to learn to navigate my way through the world of eating out.  Eagle Pizzeria was the best gluten-free pizza I have had yet, and to top it off I got to enjoy a gluten-free beer with my meal!  I was very impressed with the owner's personal knowledge and friendly nature.  I would absolutely recommend this to Celiacs and those with a gluten intolerence.", "author": "Melanie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "I should've asked the owner the story behind the name, reason to go back. Thank God for artichokes and my two nephews, who lead me to this pizzeria. Opening the door, if you're a San Franciscan from the 80s, you'd be glad you didn't have your pizza delivered. Why? They have pictures don't they, on this website. Well I'll be, Going to this spot more often. The owner bought me a beer, $3.50 for a quickie mug, smart man. 6 beers on tap, and an entire cooler with not your typical selection of pizzeria beer. Put a label on it, there were about 31 bottled beers to choose from. Larry called the 64 inch widescreen Tv, and there was a baby one hanging above the bar. Pizzeria/80s Niners Nostalgia/Topps Card Collector/Chidrens Art Gala. The owner was bullshitting me, like I'm bullshitting you. But he provided the best bull-shitting, to get another bullshitter to wanna come back for some more bull shit. It must be the pizza that has me talking like this. The owner, sweet guy, no sugar coating. Going in there with a monkey on my shoulder, he made me feel like I should've left the damn monkey in the car. Conversation was a conversation, real talk. How was the pizza? Ask Larry.", "author": "Cindy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-20", "description": "Eagle Pizza is the best pizza in the sunset and has a great family friendly atmosphere.  Ken and Amy are terrific owners.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-28", "description": "A friend and I went to this pizzeria this evening. Granted the Giants were playing Game 2 of the World Series and the place was not that busy. The game was on the TV and the owner? paid more attention to the game than to us. It took a while for the pizza to be delivered and it was mediocre at best. There was an odd smell in the air. It actually smelled like a wet dog but my friend said it may be the smell from the cheese. The table clothes were still dirty and I did not want to use the utensils. I had to request the check two times. Even though this pizzeria is within my neighborhood, I probably would not recommend it.", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-11", "description": "Pizza was pretty lackluster...I have to agree with the other helpers about the cheese. It just kinda slides off. Maybe they need to get better quality mozzarella. Very family friendly though.", "author": "Camille B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "Best pizza in city.  My favorite is the sausage and bell pepper on thin crust.  Owners, Ken and Amy, are awesome.  I order whenever I am in the mood for pizza and have most of my group kids parties there as well.", "author": "SF D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-29", "description": "A friend and I went in for lunch one day. Nobody was there when we walked in. We just sat down and looked through a menu. I wanted pizza, but my friend is vegetarian and wanted a salad. \n\nWorst salad she's ever had, but my pizza was very yummy. Probably not going to go back.", "author": "Elizabeth Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-01", "description": "If you have kids and you like to eat good pizza and you want to enjoy a relaxing meal out, Ken and Amy's is the place to go.\nThe Eagle is also a perfect choice for sports gatherings, kid's parties, delivery for school events, etc.\nAnd we love Ken and Amy.\nAlso - the antipasto salad is darn fine.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "Ken and Amy are extremely friendly owners who run a comfortable, family friendly pizza joint.  Our sports teams often go there for our end of the season pizza parties.  Ken is always very accommodating when 30 plus of our kids, siblings and parents invade the place.  The pizza is good, and they have good beer on tap.  They are kid friendly for sure.  We recommend it.", "author": "Rachelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-24", "description": "the crust was great! this pizza joint has a great atmosphere with sports memorabilia on the walls, mostly giants and niners, and the service was great. the owners were very friendly!", "author": "Briana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "Eagles Pizza is just down-home chilla  good when it comes to homey pizza. Sometimes you need to pick your spots to make sure you don't get caught in the team gathering vacuums but Kenny & Amy do their best and I keep coming back and the micro  brewski  hit the spot. These guys are the real deal.", "author": "michael d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-04", "description": "It's probably safe to say I am in love with eagle!!!!! Ive been going there since before ken and Amy owned the joint and it has always been the most amazing pizza ever! It' got a def. home vibe to it and they always greet you with a smile. Have any special requests (like more meet then lettuce on the salad) and they are more then happy to accommodate you. I think what makes this place so great is that its a local joint with local folks who still believe it's okay for kids to be kids and who support local sports teams. Its everything you would want in a neighborhood pizza place including amazing pizza. Try the BBQ chicken and red onion thick crust style..YUMMY", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-31", "description": "Really great Pizza, fantasitc crust as others have noted.  Also I appreciate the hard work - once I called early to place a delivery order and the delivery guy hadn't started yet.  One of the owners brought my pizza over themselves.  Great local environment, their kids and others hanging around as they work the business the right way.  If you have one in the Sunset, you should bring your softball team here!", "author": ".Hazel T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-04", "description": "I would have to say that this place is more for larger families or parties. Not to say that this place is bad because of my somewhat low rating, but more to the fact that it's hard to have good company around when tons of kids are running around. Coming here back in high school I guess I didn't really notice it but after I have tried coming here twice within the past few months both of my experiences were the same. The food itself was good, the service exceptional. The decor was nice and the place had a good vibe. Waiting for longer periods of time while larger parties await simply sucks. Outside of that you need to find a time where there aren't too many kids around and order yourself a nice beer and have a wonderful conversation with the owners/workers. They are great people with great attitudes. It's always a pleasure trying to get to know new and interesting people.", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-03", "description": "The pizza is pretty good. It is definetly what I would call standard american style...same as dominos in style, but with a much better sauce and overall tastier. That said, I frankly prefer a thinner crust, even if this is about as well as this type crust can be made. The sauce is very tasty with a lot of oregano.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-21", "description": "By far my favorite place for pizza here in the city!! It's like CHEERS bar only for food!!! My family and I have been going there since the original owners were there and I have to say It gets even yummier over the years. Ken and Amy are awesome and everything is so warm and fuzzy in there.....Whether you are out with your girl (like we so often are), out with the guys to watch a game and toss back a few or out with mom n dad you will feel like you've just come home again. Ken always makes me laugh and even though I am a picky eater he will always create something special for me that I can eat!! For many reasons, I LOVE THIS PLACE", "author": "Shaunna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "I have been here twice now for the gluten-free pizza and I can definitely say that this place does it very, very well.  They use the same Still Riding GF pizza crust that Amici's does, but they seem to cook it to a more crispy and preferable texture.  They have a big selection of toppings, and the majority of them are GF (all except the BBQ chicken if I am remembering correctly).  The owners are friendly and attentive, and have been very accommodating to my dietary restrictions on both visits.  On the most recent visit, a mistake was made in the kitchen and they sent us out a free salad while they re-made the pizza.  The atmosphere is very homey and they have a great collection of sports memorabilia (Go Giants!) on the walls.  It seems like a popular place for parties and sports teams to eat.  In terms of the prices, GF pizza is not really cheap anywhere, but we have found the bill here to be a less than for a comparable pizza elsewhere.  I highly recommend this place for GF eating!", "author": "L C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-21", "description": "How do they get their pizza so crispy?!? How??? Really good pizza. Cute interior. I've been there when it's just been me and my friends and I've also been there when a couple tables over it was some little kid's birthday party. Comes with the territory and it's the price you pay for good pizza", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-18", "description": "I always order pizza from here. It is just really good. The crust is great. Yum!! Their pepperoni pizza or feta and sun dried tomato pizza are delicious!!! The only thing is the delivery takes quite a while.", "author": "O K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-28", "description": "The pizza is very good.  They make one of the better pizzas in San Francisco.  What makes their pizza so good is their dough and crust.  The people that work there are very friendly and welcoming.  I only wish they had more beer on tap, but their bottled selection is great.", "author": "Jung L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-28", "description": "3.5 stars. A great neighborhood-family place that has lots of character. The owners are great and you can really tell they have a loyal following. Their food is home-cooking delicious. The lasagna is really good. The pizza is pretty good -good crust, tasty sauce, generous toppings- but there's not one particular thing that makes it unique. Red-checked tablecloths on wood tables add charm. They deliver but it can get backed up and be really slow.", "author": "B C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-21", "description": "i give this place 4 stars overall.  the food here is pretty decent & my kids like it.  it personally is not my favorite pizza place but i dine here for my kids sake.  my wife & i do like their salad though, it is pretty good.  the service here however is superb, the staff is funny, friendly & will go above & beyond to make sure your eating experience is a good one.  the place is very kid friendly.  there is a large screen tv there to watch the game if you desire.  \n\noverall, a great place to bring the family for pizza & an evening out.  usually, there is plenty of seating so waiting is never a problem.  the prices are pretty reasonable.  street parking is not too bad in this area.  plus 1 star for supporting our local neighborhood schools during fund raisers.", "author": "larry s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-24", "description": "went there alone for lunch and didnt wanna scarf down a whole pizza even the 6\" one and I was feeling a sub craving. So I tried their meatball sandwich.  It was so good I almost went pack just to tip the owner a dollar.  \n\nThe bread was nice and soft,(not the hard kind that scrape the roof of ya mouth like a window cleaner)  and the delicate meatballs were stuffed all over the sandwich.  Nom Nom. Best Meatball sandwich in Sunset that I know of.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-21", "description": "The pizza here is well worth the visit to Eagle.  The crust is very good...light and crispy yet on the thicker side...just perfect!  The sauce is yummy with just enough kick.  They have a great variety of toppings although I enjoy immensely the five cheese pizza which is fab-o...very \"gourmet\" tasting!  The caesar salad was the BOMB!  The dressing was definitely homemade and the lettuce was fresh and crispy as were the croutons.  All in all it was a very pleasant experience.  I took away one star as I found it to be a little expensive.  We ordered one x-large pizza, a family size salad and four sodas...we had a coupon for half off the pizza and the bill was still over $50.00!  I would go back though, as I felt the quality WAS there.", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-11", "description": "I like this place because they have excellent customer service, quality pizza and yes folks it's true, they do deliver beer!", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-26", "description": "One of my favorite pizza places: I crave their pizza. I love the crunch in the crust: NO SOGGY CRUST HERE!!! (yuck!), the sauce is what gets me: its almost like a marinara, and the sausage is yummy: no frozen pizza sausage pellets here! their hot wings are the best when made by his wife but can be really dry when made by someone else, Ken is always ready to have a conversation, I usually pick up or get delivery, eating in the restaurant can get really busy: very family oriented, local childrens sports team celebration hangout, and really family owned that the floor staff consists of mainly Ken and/ or Amy: so service can be slow when there are big parties in there, but I love their pizza and am always down to support the local businesses: especially Ken and Amy's.", "author": "Jenniflava R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-04", "description": "When we having a craving for pizza, we alway call Eagle Pizzeria.   We like them because they are willing to make a wonderful half (veggie) and half (meat) pizza for us.", "author": "L C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-17", "description": "if you're not one who has or appreciates children, stay clear.  this place not only welcomes them in, they provide an armoir full of toys and let the banshees run wild.\n\nfor those of us parents craving a place where we can sit longer than an hour waiting for our little time bombs to go off, this is your joint.\n\nunassuming, good pizza, box wine (they have some decent stuff too) and great beer.  \n\nand the owners run the place.  all in all, a great spot to have too much wine while the kids are totally entertained.", "author": "ellie s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-26", "description": "Hint...any pizza place that relies on 3-9 year old kid birthday parties for much of their business is not going to serve great pizza.", "author": "Todd K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "really nice and reallllly gooood foooood!!!", "author": "Jacob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-03", "description": "This is the best pizza that I have ever had.  The sauce and crust are perfect.  The owners are the ones working there and they are friendly and efficient.  Yum!", "author": "Julie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-12", "description": "Delicious! I LOVE this place, largely because of the family atmosphere.  The owners are sweet and the food is great - I have tried many pies here and haven't disliked any.", "author": "Jennifer U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-04", "description": "Wonderful pizza, besides being one of the few gluten-free ones in town (it's safe people, I've tried it many times), they use a great tomato sauce and very good mozzarella cheese. The choice of toppings in rather large. They also have a good selection of gluten free beer. The owner is very amicable and she likes to take personal care of her customers. She remembers faces and names, so when we go back it's like being with family. They have a very acceptable corkage fee ($8). It's a small quaint \"neighborhood\" style place. They also deliver rather far away in the city. It's definitely a thumbs up!!!", "author": "stefano f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-26", "description": "we got here at 3ish in the afternoon and the place was empty but i always seen people come in and out... the owner came up and us and greet us... we order the meat lover special and buffalo wings... after about 20 minutes the food finally arrives... we order a meat lover special, it doesn't look that much of a meat lover at all and them buffalo wings were dinky as in tiny... sometime you can't judge by how it looks right?! well here the taste... the crust was thick and hard, where the meat at?! taste like i just bite in a frozen pizza... as for the wings, these thing are tiny i must say... its smaller then wing stop... it taste old, like freezer burnt... no flavor of the chicken, just taste old in general... i only ate here once and i wouldn't come back here ever again... this place just look run down and no wonder them kids love this place cause they don't understand how real pizza and wings taste like... i wouldn't recommend this place anyone... i rather go round tables or domino...", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "Stepping in this place is like stepping into the 90s. You have Smash Mouth playing on the speaker system, an old school 200 pound 36 inch TV, and box of 91' Fleer Bubble gum pack baseball cards for purchase at the counter. The guy working there is nicer than your childhood nextdoor neighbor. Their pizza is pretty neat, clean, and solid. It has a nice crunch that allows the pizza to spring into your mouth... It has a lot of jump. So hop, skip or run to this pizza place and Get a Slice of the 90's.", "author": "Wats C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "While the menu choices aren't entirely creative for a pizzeria, the food is fabulous, and there's entertainment for younger children.", "author": "Jessica Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "Okay, I thought pizza was pizza, but this pizza was super yummy. I had the vegetarian and the crust was so goooooooood. If you're out in the avenues, its definitely worth a try. I also understand the owners are big supporters of the local community hosting events in their space and making donations which I'm also all about. Go, Eagle's Pizzeria!", "author": "Caroline B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-05", "description": "My favorite pizza place. We've been ordering from here for more than a decade. Their crust is not too thin, not too thick - just right. They use good quality ingredients. Recently, they reduced the number of pepperoni slices on a pizza...but I still love their pizza. Note: It's a kid-friendly place so it gets pretty noisy and wild if you eat there.", "author": "Ruby T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-19", "description": "At long last, a great pizza on the west side. The crust is thin but not too thin, with a nice texture (kind of flaky and crunchy on the bottom). Good pizza sauce, flavorful but not overwhelming. I like the sausage 'za - not too greasy. I think they deliver or you can do take out, too.", "author": "Edie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-12", "description": "Hard to find good pizza in SF, but Eagle's certainly beats most of the competition I've tried. Cold beer, good salads, spicy buffalo wings, and decent pizza. Our tab was under $50 and included four beers.\n\nThe owner goes out of his way and he's very friendly. Saturday afternoon brought plenty of kids and I gather that's expected. Two TVs showing sports, plenty of sports memorabilia. I'll be going back.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-25", "description": "Gluten free pizza! Gluten free beer! Really nice people! Yay! All their toppings are also gluten free! Great news for us with Celiac Disease!\n\nPizza is scrumptious also, and the owners are your servers, could not be more friendly or helpful.", "author": "nicole v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-14", "description": "Micro Brew pizza! I don't know why I've ignored this place all these years. Perhaps because its across from our sushi place. Also, I, for some reason, always thought it was too bright inside. Anyway, thanks to Yelp reviewers, we finally tried it out, and I'm glad we did. I've only been here once, but the pizza was good. If you like fluffy crust and fresh toppings, which I do. It's sort of deep dish in quality, but not really. I'd compare it to the pizza you get at Milanos, but I'd give it a slight edge. They have Racer 5 and other micro brews such as Moylans and Marin Brewing  which gets them a huge bonus in my book. (They even have Chimay). Beer is an important ingredient for a pizza place. I wish they had more taps (3), but that's ok. The keg was acting funny that day and the girl gave me an unusually big head on my beer, but I brought it back and they fixed me up with no argument or attitude. In fact, the people are really nice and the customers seem to be regulars. We'll definitely be back. With the beer choice I'd give the place 4.5.", "author": "Rich M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "I remember back when Rocky and his wife used to own this place, he would get MAD at us if we didn't take that last 1/2 slice home!  Not wanting to refuse this offer nor mess with anyone named Rocky, we quickly learned to cooperate.  Simply stated, these guys make the best pizza anywhere west of Twin Peaks.  I often wonder how long the lines would be if this place were located on Chestnut or Valencia streets, but every time I've been there, the dining room was fairly empty -- well, no waiting for a table that way!  I *hate* soggy crust, and these guys have the crust thing workin'!  It's also very family-friendly: there are often dozens of kids running around, playing with crayons and other kids' paraphernalia, so if you're looking for a charming, romantic place for an evening soiree, you may want to look elsewhere.  But if really good pizza - plus a small selection of fresh, cold beers on tap - is your thing, don't even THINK about going anywhere else nearby.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "Didn't know what to eat tonight so we yelped the surrounding restaurants.  Eagle Pizzeria popped up with 4 stars...hmm worth a try.  So we looked at the menu and decided on a pepperoni, artichoke hearts, mushroom pizza with olives on half of them.  Went to pick it up and noticed many sports memorabilia on the walls.  They also had old collectors sports cards for sale at the counter.  The owner, Ken, is quite friendly and converses with everyone.  Seems like they host a great deal of school sports teams parties from the nearby schools.  They also have a big selection of beers...oh, and milk for your kids!  20 minutes later the pizza was ready, brought it home and dug in.  It was pretty delicious.  The crust was our favorite.  It was quite crispy and everything else about it was great also!  One thing that I forgot about was to get some soda before I had left.  darn...anyways, Great tasting pizza...i'm sure we'll be back here next time we have pizza cravings.", "author": "LittleBird 8."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-12", "description": "i'd rather have round table delivered or pick up a frischetta brickoven pizza.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "Went here for the first time a few weeks ago. Decor is OK, more sports theme than anyting else but felt a little odd because the is also a bit of a daycare center feel to it.  I know this is a family owned place but I did not really feel comfortable having what I guess are the owners kids coloring on the next table and then having the child (maybe 10 years old) helping to run my credit card. The owner is very nice and did attend to us very well(Ken?).  Pizza was not bad and had a nice crispy crust. Toppings we OK but my son and I felt it was a bit bland.  Price is a bit high for pizza with the \"everything\" pie in an extra large 18\" going for just under $30.  I think we will return fron time to time, but not the best we've ever had.", "author": "Stuff D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-10", "description": "Just came back from the best pizza I've had in a very long time. The combination of garlic, mushrooms and artichoke hearts was delicious, and the sauce was great!  Ken is really nice about accommodating to special needs.  My daughter asked for the ceasar salad with ranch dressing since she's a vegetarian, and Ken was happy to make it for her.  This is a wonderful family restaurant with friendly service and excellent food.", "author": "Flora K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-21", "description": "one of the ebst places, and is very gopod pizza, and very lirbal owers", "author": "Leigh McInnis Lee G."}
