{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-27", "description": "I got their mango milk tea and my friend got their chocolate milk tea. It was okay with the right sweetness.... but after a few hours later, it gave me a stomach. I know i am not allergic to milk but, their counter area was a mess... im not sure what made me and my friend sick....\n\nJust be careful what you order.\n\nI gave this a 2/5 stars\n\nUPDATE: 10/26/2018\nI went back and risked to order a drink.\nThis time my friend and I did not get food poisoning. I think it could have been the toppings that made it bad. \n\nI noticed that there isn't a cover/lid on top of the toppings area. I feel like that area is prone to get contaminated! \n\nThe wait time still is very slow.\n\nUpdated review rating for the visit on 10/26/2018: 3/5", "author": "See S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-23", "description": "Super sweet drinks.. I tried two separate times to get my drink 50% sweetness but it still tastes like 150% sugar. I got some sort of fruity green tea drink and had to toss half of it out to add water and it was still too sweet. Second time I got the lychee snow and that was pure sugar water. If you can't make a drink less sweet, please tell me so I won't order it. I had to toss this entire cup away because it was undrinkable. They're not cheap either.. 2 drinks were $10. For sugar water!!! Maybe their Eggettes are better but unfortunately I don't think I'll be back to try them.\n\nNote: one extra star for the staff also being sweet both times I was there", "author": "Athena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "Maybe we went at right time b/c definitely better than a 2.5 star rating. Ordered a milk tea and yammy eggette...and a Free Oreo eggette\n\nWhile we waited, another group that order after us got their order first. An employee noticed and checked our order. They apologized for the delay and offered a free eggette for us! Yes please\n\nBoth eggettes had good taste, not overly sweet...crispy on outside and steaming inside. I'll go again for next visits to the mall!", "author": "Vincent N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "Wandering around the mall and shopping for clothes can tire you out! That's what happened to me today and I was ready for a mid-day snack. This place opened up not too long ago so thought I would give it a try as it reminded of the egg waffle when I traveled to Hong Kong. \n\nI ordered the Yoshi Bean eggette which is a mixture of matcha and red bean and also ordered the matcha milk tea (no boba, also comes in a plastic bottle). Eggette was pretty big and filling and I almost was able to finish the whole one by myself. Outside is pretty bland. Occasionally you will get a ting of matcha or red bean depending on where you chew. Matcha milk tea was good. \n\nOverall, not bad for a try for a snack. Others have complained about the wait time and price. Wait time for me from order to pick up was about 10 mins so not too bad as they make it right in front of you behind the glass. Price came to about $10 for both items.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Eggspensive... so the drinks come in a tall thin plastic bottle with their name on it.  So what.  The bottle with a screw cap does not contain much when compared to the regular sized milk tea cups at competitor boba, milk tea type places.  Additionally, you'll have to bend your straw to fit in the bottle if you want to recap your drink.  I like to keep my straw straight and not bent if you know what I mean. \n\nI had the Hot Summer which was watermelon juice with cheese foam and added lychee Jelly.  Refreshing but not enough to quench a thirst.  Sig other had the Four Seasons Cheese Float made with tea and cheese foam with boba.  The boba was spongier than the boba that she was used to.  I liked the boba and she didn't.  The boba was definitely different.  Follow-Up:  the Boba is Agar (Algae) based and not rice based...\n\nShared a Yoshi Bean eggette which was matcha and red bean.  Not bad but could have been crispier.\n\nOverall, okay, but a little pricey on the drinks considering the size of the drinks.  Note - you can also watch them make the eggettes behind a glass partition.  Nice to watch if you've never seen, however, if you've made a waffle at a hotel using the pour and flip waffle maker, then you won't be impressed.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-01", "description": "What a novel idea! Creatively flavored egg puffs? How can I help myself? I couldn't decide on one so I ordered TWO... Oreo star + double yammie = $10.01 including tax. What's great is the price of the waffle and egg puffs are the same. You pick a flavor and then the form. Unfortunately, Eggxotic missed the mark for me. \n\nOreo star -- star cereal gets placed in the egg puff maker followed by some Oreo batter and a generous serving of Oreo crumbs and coconut flakes. Sounds good right? The cereal tasted stale and you couldn't taste the Oreo flavor, which boggles my mind considering there were Oreo crumbs and Oreo batter. Also, the batter is straight black! How'd they get it straight black, like a sharpie? Although it least it was kind of crunchy and crispy where the puffs connected, the texture was off. \n\nDouble yammie -- purple yam batter with loads of mashed purple yams. As I was watching them add the purple yams, I thought to myself, \"Yes, this is great! There's so much.\" But when I ate it, I was not pleased. Let me say, I enjoy purple yams. However, I'm expecting a purple yay egg puff, not straight purple yams, which is basically what I got... ok, maybe balls of purple yams with a thin layer of batter over it. It was mushy, not crispy or crunchy at all like egg puffs should be. The consistency was just all wrong. \n\n(Review not based on the following, but I wanted to share.) The last thing I will say is... my egg puffs were given to someone else! I was standing right there, and I saw my ticket with my ticket # attached to the corresponding egg puff maker. Another employee walks over and gives it to the couple next to me and mine has to be redone, which means more waiting for me. I mean, you'll probably think I'm just being butthurt. Maybe the couple's order was forgotten about and the employee was exercising good managerial skills or something. It really wasn't THAT big of a deal to wait another 5 minutes. But all I could think about in that moment was what could have been will never be! ... I'm really just being dramatic now. \n\nThe employees were nice, like most other employees at any other egg puff or boba shop. Will I be back? Maybe for the drinks, but definitely not for the egg puffs. You'll find me at Eggettes for that.", "author": "Angie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "Hm.. this use to be a Macaron place and then it got replaced with this place, actually I never heard of this place until my cousin mentioned it and since we were in the area we all went to try it.\n\nIt's inside Stonestown so you're pretty much near lots of stores and it's close to the entrance of the mall. It's placement is kinda weird bc the lines get long and then you have a large group of people waiting and loitering around the area lol.\n\nMenu consists of drinks and waffles. Had no idea that they changed their menu from eggpuffs to waffles so really my review is a bit outdated lol.\n\nPros:\n- It's in the mall, so you can go shopping right after lol.\n- Eggpuffs WERE unique in flavors and are appealing for pictures.\n- Prices are decent and cheaper compared to other places.\n- Accepts cash and card.\n- They have cool bottles that they put your drinks in.\n\nCons:\n- LONG LINES. Maybe there's not enough workers working but expect to wait about 20 mins for whatever you ordered.\n- I'm pretty simple when it comes to boba, so a lot of their drinks are some weird concoction and stuff. I just want a simple green tea dangit.\n- Overall, taste-wise is average. Not super great  (Eggettes will always be my favorite eggpuffs!)\n\nGot the cinnamon-raisin eggpuffs and the Matcha red bean one and they're both.. hm.. okay.", "author": "Jerianne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "I luv this place.  Especially their new summer ice drinks/desserts $5.95.  They are so good....looking forward to trying the other drinks before they end.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-07", "description": "Only got a drink today without a waffle because the worker was \"working\" so hard with gloves. \n\nTouch my food after touching your phone? Noway...\n\nEggxotic, please do something...", "author": "Kris W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "TOTAL MEH.\n\nThe macaroon place that housed this area before Eggxotic wasn't very exciting so when news came that a place called Eggxotic was to set itself up in Stonestown I was pretty dang stoked and I finally got my boyfriend to take me here to try it out. \n\nFirst off, the wait is long. Like they have to separate the lines because it's too long and the store next to it probably gets mad, but oh well. Just be aware of that and don't go cutting in between, k. \n\nThe menu isn't super extensive. If anything, I was mostly just impressed with their menu for eggettes because they offered both savory and sweet options with combos that I've never even heard of. Kimchi in an eggette? That's totally wild. Their drink menu is not extensive and since you're not able to create your own drinks as well, you're pretty much left with majority of fruity options and then their regular house milk tea or a matcha milk tea, I believe. \n\nPrices are what they are. I've seen worse for boba so this wasn't too bad, plus they just automatically give you your drink in a bottle which seemed pretty cool since other places would normally charge you extra for that. \n\nI opted for the S01 which was the galaxy drink, can't really remember it too much but that's one of the drinks they put the flashing light underneath to make it look cool for the 'gram. Tbh, too sweet and not impressed. Eggettes were also going to be a 20-30 minute wait around 2pm on a Saturday so my boyfriend convinced me not to wait. Heard a little girl asked the eggette maker what number he was on to which he replied \"74\" and the poor girl was number 89. \n\nOverall, I DID want to try the eggettes, HOWEVER, I am totally content on not trying it as well because the wait was too insane for ordering and waiting to get the eggette .I'm good.", "author": "Venus L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "Ehh...nothing special. \n\nI'm all for trying new businesses and had this bookmarked for a good min. After reading the reviews, I was pretty understanding and expected there to be a hefty wait. \n\nCame here on a whim on a Friday afternoon bc I was in the area and had the time. I think I prolly waited 40 mins total: 20 mins to order and 20 mins to receive lol which is not the worst- compared to other people. \n\nI got the yoshi bean eggette which is matcha flavored with red bean filling. It was pretty good considering I've never come across this flavor combo in an eggette before. It had a strong matcha flavor with bits of red bean scattered throughout the waffle. It could use more red bean to balance out the bitterness of the matcha imo. \n\nThe exotic drink was alright..pretty average. It was only cool bc the bottle lights up and the colors are nice to look at but I would prolly pass next time. \n\nI think the only thing they got going for them is the variation in flavors for the eggettes lol \n\nWorth a try for the one time but that's about it for me.", "author": "Coco L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "There are no traditional \"eggettes\" here!!! What you get is basically a waffle. )= This was pretty disappointing considering they have pictures of actual eggettes on display. I ended up getting the taro waffle to try and it was decent. Lots of taro bits inside! \n\nAs for the drinks....nothing special. Just tasted like sweet fruit tea. I'm not sure how crazy the line is as of now...but the entire process of waiting, ordering, and then waiting for my order took roughly 35 minutes. \n\nThis spot definitely test your level of patience!", "author": "Mary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "Hot and new place - a recent hype that I see photos and lines everywhere. Pretty drinks, sweet egg puff, and savory egg puff, totally bringing the Hong Kong street food to SF.\n\nAs mentioned from other comments, the wait is a little crazy. We went there at 8ish pm, happened to be the last order :) pretty lucky huh! But then still it took us 40+mins from ordering to getting the food, with not much people around. Although they have 4 machines making the egg puff, you can tell that employees are still new and therefore pretty slow on making egg puff. \n\nWe ordered Oreo star egg puff. Super pretty and good for photo! However the egg puff is not even at average - too sweet, and the texture is very heavy (good egg puff is supposed to be crispy, light, and fluffy). Quite disappointed for the quality w/ the long wait. However my friend mentioned that the savory egg puff (pork) was good, definitely will try that out.", "author": "Yuen Yung L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "Eggxotic just opened in the mall!  yay more food choices!   This place has drinks, and egg puffs or eggettes, whichever you like to call it.  An egg Puff or a eggettes is like a waffle. But for this location, they have stuff inside the egg, which is pretty common in Asia.   \n\nThe Egg puffs or eggettes, they have a variety of sweets and savories. For sweets they have the following flavors\n\nCinnamon Raisin=Cinnamon+raisens\nDouble Yammie- Purple yam\nChoco choco Nana-  chocolate with Banana\nYoshi Bean- Matcha + red bean\ndouble taro- taro\noreo star- oreo with star cereal\n\nFor savory the have the following\n\ngarlic Crab- imitation crab with garlic sea salt\nXper- salt and pepper+egg\nkimcorn- kimichi+corn and cheese\nPork kush seaweed- pork floss+seaweed\nChick Yaki- Teriyaki chicken+ fried onion\nJalapeno baconator- Bacon+ jalapeno+cheese\n\nMy coworker and i actually got the Oreo Star one. I didn't quite like it, but maybe because i didn't normally like Crunchy stuff. It wasn't as sweet as i expected ,which was good.  However, it didn't taste as eggy as i wanted it to be.  The wait time was a little bit long because i think today was there first day.   The service was pretty nice.  I remember when i was in Asia I like the savory ones, so maybe next time i'll get the Pork Kush.\n\nFor drinks they have   smoothies and tea flavored drinks.   They have pictures for you to associate the drinks with.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "This review is for *DRINKS ONLY*\nLocated in Stonestown mall right across quicklys and next to blaze pizza\n\nLines here can get real crazy long! First time I went took about 30 mins to order and get drinks. Second time was about 20 mins. \n\nPrices are pretty cheap and you also get a cute plastic bottle with their logo.\n\nMy order was S10 Classic Milk tea with half sugar. Tea taste was there. Milky in a good way. 50% was perfect, not super sweet. Did not get boba because they only have \"magic boba\" which is agar instead of tapioca.\n\nOther drink I've tried is Galaxy drink. Very cute instagram pic type of drink. Bottoms lights up making it look like a galaxy. Got regular sweetness so it was pretty sweety. Tasted like very sweet fruit juice. Not my cup of tea, just looks good for pics.\n\nCustomer service was nice and friendly. Cashier was very nice. They are also pretty fast on getting drink orders out. Takes about 5 mins for drinks to come out after you've ordered. \n\nOverall a solid boba place compared to the boba upstairs or quicklys.", "author": "Michele G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "The main reason that made me want to try this place is because of their cool looking bottle. I got the S01 (Galaxy) and John got the S02 (Rainbow) drink. To be honest, I thought they were okay. It was sweet and refreshing. The taste reminds me of mogu mogu fruit juice drink. We also ordered matcha with red bean egg puff and oreo star egg puff. The matcha with red bean egg puff were a little bitter, I think they put too much matcha powder. The oreo star egg puff were good, I liked the crispy star cereal.\n\nI knocked off two stars because we waited 30 mins in line just to order, then another 20 mins to get our egg puffs, and the drinks and food were just okay. Overall, I think they could do better. Maybe hire more people or add more egg puff maker.\n\nWill probably be back to try the other drinks and egg puffs when the hype dies down a little, lol.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-16", "description": "First off, if you haven't been here before take the time to look at the menu before getting in line. My gf got in line but felt she could of ordered better drinks. My gf order two drinks and an oreo egg thing (lol sorry she ordered it. Not sure what it is called). Before she told me what she ordered, I thought it was burnt lol. The oreo was good but nothing we would get again. Seemed kind of plain. For the two drinks she got a thai milk tea and pink lady. The thai was pretty water down and the pink lady was okay like a strawberry milkshake. Took awhile to get everything. The drinks were quick but waiting for the oreo egg thing took awhile and there was only one person before us. I probably wouldn't get anything here but if we were in the area I am sure my gf would try it again but different drinks. Employees were nice tho and drinks looked pretty (gf words not mine).", "author": "R. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "Two eggette type waffles came out to about $10  kinda expensive and also not very flavorful... ordered baconator and imitation crab -- both needed more filling and punch to the taste. You can see that they try to fill each pod with imitation crab but somehow the end product just isn't all that tasty...", "author": "Cathrin P C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Egg puffs....fresh egg puffs at that?!?!?!!?!? How could you go wrong??!?!!?!?! Then there is a Quickly strategically and conveniently placed right across the way?!?! What?!?!?!?! If this was all you needed to come to the mall for it is even conveniently located at the entrance of the mall so you could very well get in and get out with none the wiser! \n\nSo because I am all about killing two birds with one stone I took my son's order for Quickly and sent him with my order to Eggxotic. I had the Nutella and banana and oh.my.gosh! They make right in front of you so you can see them pour the batter into the \"waffle iron\", add the ingredients and flip the darn thing which of course makes your heart skip a beat because you know you are that much closer to egg puff heaven!\n\nThe line is kind of long so my order of 4 drinks at Quickly had the eggpuff line beat...and that we only ordered 1. They have a decent array of choices for both sweet and savory egg puffs but we had already had dinner and just needed dessert. They also had some milk teas that came in a nifty light up container that made you feel as if you either had a galaxy contained within the bottle or you were about to drink a rave. Cute but a trap I didn't fall into (pats myself on the back). I think it was a 10+ minute wait but it was worth it. \n\nAs you can see from my pictures, the thing was bigger than my face. I think we paid $3.95 and it was worth it if you ask me. It was hot and there were bits of chocolate and banana in each puff. Those egg puff chef's really take the time to ensure a satisfying bite in each \"bubble\". They kind of remind me of bubble wrap, but delicious bubble wrap that doesn't make any noise other than the \"mmmm's\" that were coming from me as I took each bite. Will visit again soon!", "author": "AmErica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "It's pretty good! Inexpensive drinks. I'm happy to stop by! My first time! Definitely will be back again! Also, their cups are so cute! That's what attracted me! Can't wait to come back again. Maybe I'll try the egg puffs! The line was long and I was there close to closing time.", "author": "Sheryl H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "The people working there are super friendly! The HK style egg waffles are pretty good too with interesting flavors.  Wish they had better descriptions or pictures.  The boba we had was good but the bubbles were a little undercooked and hard.", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-04", "description": "The savory eggettes were tempting, but by the time I was able to try this place, they had changed it to only a waffle form, and they weren't that amazing.  I tried the Pork kush seaweed and they were soggy and soft.  There wasn't even a single bite where it was crispy.  Flavor was great though, I mean, pork floss and seaweed and furikake, that's a great combo right there.  \n\nNext time I want an eggette/waffle, I'll probably go to Quickly's instead.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "Don't expect Eggxotic to be one of the best.  What the workers have done everyday in a new bubble tea shop was still the same effort, even though they seem friendly.\n\nI was wondering why some customers love special tea drinks with blinking lights on its bottom.  This may seem strange, so I had to check in to get a close up of what this business is all about.  And indeed, it was those blinking light pads that makes both Galaxy and Rainbow even special.  I ordered a Rainbow and have a female worker peel the pad, stick it on the bottom of the bottle, press the button, and voila.  It's lights are blinking!  All for show; nothing so much fun.  Without the pad, I still drink the yogurt milk tea.\n\nI know I haven't gotten to the egg puffs.  There's plenty of shops throughout my city that makes egg puffs.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "This place is great for kids and something to try if you're into eggettes. They have sweet and savory flavors to try. We got the cinnamon/raisin flavor and the matcha/red bean-- both are unique and interesting. \nThe staff is friendly and polite. They are able to deal with difficult customers and very professional. If I worked retail and had to deal with rude customers I would definitely hire staff from here. Just saying. Lol \nLines are long but the food is quick to make so the wait is not overwhelming. The place is fairly new so you can really expect long lines, especially during after school hours where kids come in. \nWorth a try. I didn't try their drinks but maybe I will reserve that for another time. \nThe staff working are young and you can see them work right in front of you. If you have OCD watching them work will not be fun. (See pictures). \nOverall, give them a try.", "author": "Pinky A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-10", "description": "Waited almost an hour just for my eggettes...\n\nthe drinks were okay, too sweet. \n\ni dont think its quite worth it.. for the wait haha.", "author": "Tiffiny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Tasty egg puffs!  I tried their chocolate chip and banana egg puff, also their savory pork and seaweed egg puff.  I loved them both!  IMO, the former would go well with a cup of black coffee since it is quite sweet eating it alone.  The latter was surprisingly delighted and savory with the right amount of saltiness in the dried pork bits and dried seaweed strips.  The textures in both were slightly chewy, moist in the middle, crunchy on the outside and the edges, and stuffed with lots of yummy fillings. \n\nIs it possible for one to have a bad Friday? Yes sure it is possible.  HK Egg puff has always been one of my favorite comfort foods and HK street foods ever since I was a kid growing up in HK.  I have had countless yummy egg puffs over the years you might say.   And I could tell that the place is putting in efforts in making the legit egg puffs by having the small fan and rack to cool down the egg puff once they were done from the bubble waffle maker.  That is the legit way in HK making egg puffs that are soft and chewy on the inside, but crunchy on the outside. \n\nI am glad that I stopped by today cause these yummy egg puffs here did lift me up from my bad Friday!\n\nI will be back trying their other flavors.", "author": "Toasty H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "I ordered the Rainbow (yogurt flavored tea with butterfly-pea tea). It came with a light at the bottom of the drink, which is pretty cool if not gimmicky.\n\nGiven how limited their menu selection and ingredients are, I was disappointed that I couldn't adjust the sugar or ice level of my drink. My drink came out way too sweet. I could taste flavors of orange and sprite despite those ingredients not being depicted in the menu.\n\nOverall, their drinks aren't really my \"cup of tea.\" They're too sugary (at this point you're drinking liquid sugar juice) and they definitely focus more on the aesthetics of their drinks than the quality of the tea.", "author": "Andrea F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Omg savory egg puffs! I've been saying how good egg puffs would be with savory flavors and some places are popping up with them! I got the crab and garlic salt. So yummy, filled with imitation crab and had a sweet and savory flavor. It does take a bit of time, about 15 minutes after you order. I enjoyed the unique flavor combos and hope to try the others soon. We also got the strawberry tea which came in a cool bottle. It was refreshing but let's be real was mostly cool cos of the packaging. Anyway if you love egg puffs come here to try some unique flavor combos.", "author": "Samantha D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "Super disappointed.  Wait for over 30 minutes and got super bad quality of drinks and eggettes. \n\nOreo star: only light coconut and cereal flavor. No Oreo flavor at all. Disappointed since I'm the fan of Oreo. \n\nTaro flavor: super soft and ugly. They should train their employees how to make a good Eggette. It is okay sometime make it fail, but please throw it away. Don't give to customer.  \n\nMango and avocado drink.  It is okay. Nothing special \n\nS02. Yogurt drink. No flavor. Same as drinking water.  Only looks pretty with the flashing light.", "author": "Tissuebabee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Never had garlic and imitation crab egg puffs before, it was quite an experience. You can surpassingly taste both flavors. \n\nThe galaxy drink was meh, nice little gimmick with the flashing lights.", "author": "Andy V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-11", "description": "I really don't get it why there is a long-ish line for this place (maybe it is still new so people wanna try it out by mostly younger folks). The drinks are below average, a bunch of flavored syrup and water, completely lack of authentic tea. The look is deceiving as it looks very pretty. The name is Eggxotic (really for egg-puff style as in its logo), however, they make it all waffle style to save time (as the cashier pointed out) and short cut it. I was excited to have another place opened up in Stonestown for tea and snacks besides the boring Quickly, but I am fairly disappointed at this place now. It is a bummer because I had high hopes for this place while it was being remodeled.", "author": "Lena H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-11", "description": "Came here on a weekend and the wait to place an order was about 10 minutes, and then another 10 to get your drinks, and 30 minutes for eggettes. \n\nI got the Galaxy drink and it was pretty average. I'd probably never order a drink from here again becuase it just tasted like sugar water. \n\nI got the kimcorn and pork kush seaweed eggettes. The ingridents in each of them worked really well together, but they put so little in that you can hardly taste it. If they put more, it would've brought this to a whole new level and I wouldn't mind waiting around for 30 minutes for one. \n\nGood concept, very poor execution.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "Unique concept, and trendy drinks and food. \nI call them bubble waffles! they have several different flavors anything from savory and salty to sweet, i tried the oreo, and also the bacon one. \n\nI love the open cook area, you're able to watch them work. The cooking process takes quite a while, so don't expect to get a quick in and out\n\nI also had the galaxy tea, which is the colorful one with the light at the bottom. The drink is gorgeous Instagram worthy, however it tasted like food coloring and sugar.", "author": "Roxanna G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "Been wanting to give this place a try for a while, but didn't had any patience for the long line! But was able to get a matcha latte yesterday.    Customer service was as expected from any quick fast food chain, but have to say.. the wait for my drink was decent timing.   The drink itself disappoints; no matcha taste at all and I thought I was just drinking sugared water!   Now I have this extra cylinder plastic bottle to recycle.", "author": "Tiffany Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "It was such a rookie mistake to not glance at Yelp first before ordering my eggettes. Like everyone else that gave this place a poor rating, they're not wrong. I was craving eggettes and super surprised that they opened one in Stonestown. \n\nHowever, their menu aesthetic took more effort than needed to understand how and what to order. It was basically a mess of jumbled words. I honestly wanted plain eggettes but wasn't offered on the menu like the actual OG Eggettes in San Mateo County. Instead, I ordered the matcha flavored eggettes with red beans. They take awhile to get you your order since there's only 4 machines. In terms of flavor and worth, definitely NOT worth my $6. The eggettes essentially tasted more like a thick and dense waffle than your usual crispy exterior with hollow and semi chewy inside. The matcha flavor had a burnt aftertaste, so not pleasing at all. The workers also seemed not friendly and wanted to get the hell out of there. \n\nOverall, please don't come here for eggettes. It is not worth your time and money. You might as well drive a couple more miles south to get the real deal for $4 at Eggettes or even next door Quickly's is probably better...", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "It was just ok.  Probably won't go back....\n\nI was there at 11:15am on Sunday.   There were about 8 people in front of me.  Finally my turn after 20 minutes,  I ordered two eggettes - oreo and purple yam.  The girl was so nice to tell me that probably would take 30 minutes for eggettes.  I asked what was the current number and she said #34 and mine was #42. Since I was free, sure why not?  \n\nI walked around the mall and came back after 25 minutes...the girl told me they just called #37... wow seriously? I waited another 30 minutes for my eggettes (only, no drinks). I guess they only had 4 machines there and took almost 15 minutes to make one.  Nothing much they could do to speed it up.   \n\nRegarding to the taste, I don't taste much different from the two eggettes.  The oreo one had coconut inside which was odd and there was not much oreo flavors.   The purple yam had real yam inside which was good but not too strong flavors either.  The only good thing was not too sweet.\n\nThe line was way too long for eggettes even on a not too busy day.... definitely won't go back.", "author": "Liza T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-28", "description": "I should have read the yelp review first. This place makes speciality egg puffs. I ordered the matcha red bean egg puff. It was bitter. I know matcha can do that, but I was super disappointed when the entire crust of the puff had this distasteful bitter flavor. They tried to balance it out with red bean inside the puff. However, each puff had the stingiest amount of red bean (it felt like one bean a puff) and I could barely taste it. Really wouldn't recommend.", "author": "Melinda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "Honestly, if you put a light in a bottle filled with milk tea, people are gonna swarm all over it.\n\n[Ambience]\nThis place opened up in Stonestown right next to the better Pieology. At a glance, you can see the employees making egg puffs. They have at least 4 egg puff irons. Let me tell you, the stations looked like a hurricane ran through it. I almost wished they didn't make the front of the house so transparent. I guess it was more of an organized mess to put it lightly. At least it wasn't dirty!\n\n[Service]\nWe came around 3-4pm on a Friday. The line wasn't long at all, however, there were a lot of people waiting around for their order. Definitely should've seen our wait time coming based on how many people were there. We waited 35-40 minutes for our egg puffs. That's a pretty long time for egg puffs.. In that time span, I walked to the bathroom, shopped at Sephora, came back and our order still wasn't ready lol.\n\n[Food]\nWe skipped the boba since everything looked like a sugary, glowy mess. The egg puffs were pretty solid! Crispy around the edges and soft in the middle. We had ordered the original batter egg puffs, the yoshi puffs and the double taro puffs. These definitely reminded me of taiyakis! I like how the different flavored batters weren't overly sweet and that all of the egg puffs were filled.\n\n[Worth it???]\nIf there's not a line, go for it! Their egg puffs are actually pretty good. I'd come back for sure. \nIf there is a long line though, just go to Quickly's right across the way for some egg puffs and more of a selection for tea.", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "Ah this place with a long line that can be stretch to miles during weekends. I was intrigued to try this place out but opted to skip out due to long line. First of all, they need to fix their menu. All the names they had in their menu sound so complicated and unfitting. The eggetts are not worth the price. It's just too thick and lost the original eggetts taste. The flavors are overwhelming and sometimes taste burnt. They only have 4 machines hence the long line and crowd. \n\nNOW for the drinks...I used to be obsessed with 'Pink Lady' (strawberry with milk). I had it about 4 times already & nothing happened to me. But my boyfriend had it once and an hour later, he threw up everything he ate. We suspected that it was the drink since all he had was rice & chicken popcorn from Quickly. Today, I bought one for my mother and about an hour after drinking Pink Lady, she became dizzy and started throwing up. There's something about this drink that I would advise everyone to be cautious of. Maybe the milk or the fruit isn't fresh. Avoid Pink Lady from the menu!", "author": "Melanie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-10", "description": "We ordered yam egg puff. There was hardly any yam inside, only tiny pieces.  So different from the earlier yelper's picture.  Very disappointed.   Probably won't go back there again.   When he handed us the puff, we couldn't tell if it was yam or no flavor.", "author": "Wei J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "I came to Eggxotic on a Wednesday at around 4:30ish & it was really crowded. I had ordered the Oreo Star & had waited about an hour for it. The Oreo Star was okay, it didn't really taste like oreo, it just tasted like a regular waffle cone. The Oreo Star did come with coconut which was a surprise bc I don't think it said coconut on the menu. \n\nNot sure if I would come back, maybe if it's less crowded.", "author": "Stacie I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-23", "description": "I went there a bit after it first opened. It was still quite busy at that time since it was \"Hot and New\" so everyone was eager to try it out as was I. I didn't get any of the drinks but did get two of the egg-puffs since that's what this establishment seems to focus on anyways. It's quite unique how they serve some savory ones so I tried the taro one that's sweet and the pork kush one that's savory.\n\nUnfortunately, what I got was poor quality for sure. It takes so long to make one and the line was so long that the employees were for sure rushing and didn't even fully cook the egg-puffs. They ended up having that soggy undercooked felling, especially the taro one. I do appreciate there was real taro paste in it but it was quite sparse. Some pieces had a lot while some had none. Same with the pork kush where most of the pork was sprinkled off to the side and the rest of it was plain original egg puff flavor. The pieces that did have the pork kush were delicious and I did prefer it over the taro one.\n\nOverall, I was sadly disappointed. I'll consider going again once the hype dies down and there's no line anymore. Hopefully the quality will be much improved when there's no crazy crowd rushing the employees.", "author": "Lily F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "There are the best egg puff in town . The most I recommend one is purple Yam's favorite \nIt comes with real purple yam inside. It's so good\nThe drink is so cute . With the light at the bottom \n\nStaff are friendly and professional", "author": "Cath T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Super yummy and perfect for a snack with friends! I tried the double yummy and its TARO perfection! The waffle is baked so its a warm sweet snack if you want to up your pastry game!", "author": "Lola M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "First sip instantly made me want to come back again. I haven't tried the egg puffs yet but the drinks are great. I recommend the galaxy which is great for kids because they have a light shining on the drink and the flavor is fruity and unique. Great price\nAlso a nice bottle to keep.", "author": "Charlene K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-11", "description": "Now, they changed Eggettes style to Waffle style, no good at all, I want to get the Eggettes back, oh, no! Waffle shape was hard to chew, I'm sorry, but this is my unforgettable experience!! \n\nThe good: shorter time, wait about 20 mins\nBad effects: quality down, even though my favorite Eggettes, no more....sigh :(", "author": "Xiaowen Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-05", "description": "The idea it's creative. However, it's the way too sweet and long waiting line. They don't even clean up the counter tops with all the batter mess in the table. It's simply not professional and gross....", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "Save yourself the trouble and go to the boba spot up stairs or quicklys. I thought I was safe with the Thai ice tea but noooo... the drink was so milky like a sh*t waiting to happen after one sip.\n\nNice that they had a cool container cup or whatever but it's such a waste if the drink is horrible.", "author": "Rob V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "Went to see what the hype is about and let me be first first to say don't waste your money here.\nThe regular milk tea drink was ok but the galaxy wasn't it taste awfully sweet with a kick of unknown bleeh. \nI asked whats your most popular savory egg puff she said Oreos or garlic crab.\nSo I ordered garlic crab but that damn thing was salty as my post and do they even taste test their product and measure correctly in how much salt, seasoning they put on that damn thing.\nSalty like you bathed in it. Took a bite and thought maybe it wasn't mixed well. Look another piece in the middle was still overly  salty took last pick of the egg puffs and I'm officially done. Too salty no thanks will not come again. Perhaps this explains why the line is shorter", "author": "Meishi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-14", "description": "This place is a SCAM!!! \n\nCame on Sunday afternoon.  Waited in line for over 25 minutes to find out they do NOT have eggette, only waffles.  Suggestion: change your company name to WAFFLEXTOIC!!!  That makes more sense and less misleading!!!\n\nCommon courtesy - put a sign out and said we do not make eggette.  If you want eggette, go to QUICKLY!!!", "author": "Wally S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "UPDATE: EGGETTES ARE BACK AND THEY'RE AMAZING!! Honestly haven't tried a bad flavor whether it's their sweet or savory eggettes ^^\n\nLOVED THE CONCEPT OF THIS PLACE BEFORE... \n\nWell first off, their milk tea drinks/smoothies were really good and they are priced reasonably. I've also tried a few of their eggettes and I love the different flavors they came with. They have both sweet and savory versions. My personal favorites are the double yammie, the yoshi bean, and the pork kush seaweed. \n\nThe wait time can be quite long because it's a hot and new place, plus it takes some time to cook the eggettes, but I get that, I don't mind. Customer service was also good, so can't really complain about that.\n\nHowever, what's disappointing is that they recently changed the eggettes into waffles. What? Why? Well, apparently a few of the customers have been complaining that the eggettes weren't crunchy enough and I beg to differ because I quite like the eggettes version better. I love the chewy/fluffy egg puffs with the crispy edges around it. It's way WAAAY better than the waffles. I mean it's the flavors are the same, but the egg puffs really makes a difference. I WISH THEY WOULD CHANGE IT BACK TO EGG PUFFS!!", "author": "Camille P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "The wait is crazy but it's so worth it. They have fabulous drinks and snacks. We tried the strawberry and milk, Thai tea, chocolate banana eggette as well as the double yam eggette. Everything took a while but came out fresh.", "author": "Diane M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "This place was pretty busy, i waited almost an hour for just one drink! My friends i heard them dropping something behind the counter. My recommendation? come back another time if someone in front of you orders the oreo star egg thing. that stuff takes wayyy too long. on top of that, they don't do numerical order, there is no way to grasp how long your order light take! am i losing my mind?????????? i can't even tell\n\nupon receiving my drink nearly a year later, i was disappointed to learn that the bottle was in fact PLASTIC and not glass, as i had previously assumed. i think they should change their advertising so it's not so DECEIVING!! S.M.F.H. i had ordered the thai cha, sure it looked pretty, and ate it tasted pretty, but my waiting face IS NOT PRETTY.\n\nmy friend, ordered the egg thing. it was also pretty. wouldn't know how it tasted tho my friend is hella greedy. but after they called his number, they had him waiting up there. his egg thing wasn't even done yet!", "author": "Carina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "TOOK FOREVER...\n\n20 minutes in line waiting to order the drink. Another 10 minutes of waiting to actually get the drink. Eggette order took even longer. \n\nThe cashier takes orders and gives out the drinks. That makes the wait extra long. Come on business owner. Figure something out. \n\nI had the berry smoothie. Drink was pretty good. If they fix the line problem then I'm willing to go back again.", "author": "Rich L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-26", "description": "Went with my girlfriend cause she wanted to try this place out. Worst mistake of the day. We waited AN HOUR for 2 milk tea and a egg puff!!!! We could've went shopping and came back and still have to wait! The drinks and the food was ok. I would've left if I had knew how mediocre the drink and the food was. \n\nI get it. It's a new place and it's getting popular. There is a lot of customers. But ONE HOUR?! There wasn't any chairs around. I had to stand and wait!!! FOR AN HOUR! Like what was the server doing? Even if they make ONE drink every 5 mins, they would've still made 12 drink. There wasn't even 6 people ahead of us. \n\nAtmosphere:1/5\nThe place is inside stone town mall on first floor, so I will leave that to your imagination. No chairs around. You either stand there like a real man, or you sit on the floor like me...\n\nDrinks 1/5\nThe milk tea I got was on the sweeter side. I already have a sweet tooth but even I felt there was too much sugar. The boba tasted like plastic. \n\nFood 2/5\nWe got the Oreo star taro. It taste pretty good. A lot more crunchy than I expected. \n\nCustomer service1/5\nWhen we ordered, everything seems fine. But after asking for the third time about why our order was taking so long, the server started getting annoying or something. But again...ONE DARN HOUR WAIT!! What did you expected me to ask?!\n\nConclusion: Don't do it. It's not worth your time. If there was no line and it's a quiet day and you have sometimes to kill. Try the egg puff out. If there is a line. Literally drive back to sunset or Richmond district, buy a better milk tea then drive back to stones town. Because you will at least have a better milk tea in your hand and have more time to spend on your shopping.", "author": "Jackie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "LONG LONG LONG wait every time. The drinks just look cool, they're actually not that good. Same goes for their pretty egg puffs. I'll just stick with Eggettes next time.", "author": "Ariel J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "It's an okay boba store, but there were thick seeds in my order. I'm not sure if other people like to chew on the seeds, but other boba places don't usually have them, and I don't like them. The line is long because it is right at the entrance of the mall, and the price isn't good for the product. It's the closest boba store to the university, though.", "author": "Gabrielle R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "This place is completely copied Gosu Tea Bar. Their stuff looks beautiful, but I need to wait for an hour. Their hygiene was poor, the spoons were not washed, and when they were finished, they were placed directly on the table. And wash the cups with the hand wash sink, not through health regulations. \nTheir drinks are so nasty that they drink like cough medicine . And pearls are not real pearls, just a round Jelly. They didn't tell me when I ordered them. And they didn't see any of their health certificates.", "author": "Ivy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-25", "description": "The waiting time is crazy! Wait in line to pay and wait again for the food. They work soooo slowly. With 2 out of 4 waffle makers working. 2 stars for the creativity of flavor combinations of their \"egg puffs\" waffles. Flavor wise, just sweet little waffles. The cashier told me they don't have the egg puff shapes until further notice. I ordered the double yammie and the pork kush seaweed. Double yammie was good but just sweet, not much flavor. The pork one is just ok, batter was too sweet for a savory waffle. I also ordered the rainbow drink which is yogurt and pea flower tea. I imagined it as a tiny bit tart like an actual yogurt drink....but it was just sweet as well. I asked for boba and they didn't inform me that their boba is actually the crystal bobas which is not chewy like the black ones i am used to. \n\nWould I go back? Prob not, everything i ordered was just sweet, no flavor. The mochi waffles at quickly's across the mall is much better. No wait too!", "author": "Sophie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-24", "description": "One start because :\n\n1. 20mins wait time (I am writing thus review as I'm standing in line with TWO other people.) the workers are prob high schoolers and I get it.. but dannng, GRAB a Red Bull or something and move quicker. Hella slow! \n\n2. Eggxotic - you think Oh Eggettes but NOPE, it's mofo waffles. Ha! Go figure! \n\n3. ...... I'm still watching these sleepy workers working the machine scrap the side of the WAFFLE maker.", "author": "C .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "I've been here everyday since their opening on Friday 4/20. I've tried something new every time and I've liked everything so far. I'm more into the savory eggettes than the dessert ones but that's just personal preference.\n\nChick-yaki and the pork with furikake are my favorites. Drink wise, I love the four seasons oolong with salted cheese.\nI've also tried the Galaxy as well. The galaxy is very pretty and very good. My only preference is that I'm not too big on fruity tea drinks and the Galaxy is a strawberry flavored tea. I got it for the picture however I can acknowledge that if I was a fruity tea lover, I would like it a lot. Lastly, I've tried the Mangodo and I thought this one was going to be a weird combination between a Avocado and Mango smoothie, however it actually worked out really well together and is now my 2nd favorite drink there.\n\n\nI work as an Assistant Manager at Marugame Udon next door so I know the struggle of opening up and being incredibly busy with an inexperienced staff. Yes it can be frustrating to have to wait a long time for your order, but from my observations, they only have 4 eggette machines and most people order more than 1 eggette so orders can take pretty long to come out. On top of that, the staff has been doing it for less than a week (at least at the time that I'm writing this review) so my recommendation is that unless you're getting just a drink, you should only come here if you have about an hour to spare. \n\nImprovements come over time and while they're still in their growth period, I hope they are able to solve everything in the future to achieve something closer to a smooth and consistent style of service.", "author": "Thien L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "The only thing you really should get are the puffs. I tried the Oreo Star one-which should be renamed to something coconut flavored as opposed to anything related to Oreo. The double yammie one was THE BEST! I liked it a lot and it was hefty. In terms of the puffs being heavy and filling, but I didn't mind because they tasted THAT GOOD. \n\nThe teas are no big deal. I can pass on these drinks. We got the galaxy 1 and 2 drinks. Which are the ONLY ONES THAT LIGHT UP. \n\nWe added lychee toppings that were hard to get to since they sunk to the bottom and the drinks come in twist off bottles and no straws. \n\nTHERE IS A BIT OF A WAIT. So do expect to be a bit patient with them as they are brand new and people are going for the hype. I'm pretty sure it'll die down soon enough.", "author": "Teeds K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Honestly, the food is good, but the service is awful. I've been here twice. Like everyone else mentioned, the wait is long. It took 20 minutes to get my food both times. The first time, I wanted a charcoal waffle but they didn't have it. I got jalapeno bacon eggettes and a milk tea instead. The eggette was good, lots of bacon. I couldn't taste much of the jalapenos. The drink was sugary garbage. The second time I went there, they only had waffles. I finally got my charcoal waffle. It tasted more like chocolate than anything but it was good. Only two of the waffle makers were working. This place needs to have better service and to bring back the eggettes before I will return.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "Where is the phone number of the business. The drink is ok but need that phone number", "author": "Brandon H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-20", "description": "Last night was the first time that I've visited this business so I wanted to give an insight to my personal experience.\n\nI was very excited when I heard of Eggxotic and saw their pretty packaging but was a bit reluctant when I started reading the reviews.  The pictures were impressive but in this case, the picture doesn't speak for itself.\n\nSo last night I'd ordered the following:\nThai Cha\nMilk Tea\nOreo egg puffs\n\nThe Thai Cha was actually  pretty good, which caught me by surprise as I thought it'd be more like the powdered mix which most boba places use.  Maybe because this one actually contains condense milk like how it's actually prepared in Thailand.\n\nThe milk tea was pretty basic.  \n\nNow the Oreo Puffs....most of the reviews said that it lacked the Oreo flavor.  Upon my first puff, I thought it had a distinct Oreo flavor, though as I started picking pieces away from the edges, I can now see that it doesn't have as strong a flavor.  There are pieces of coconut flakes in the batter mixture which I did not care for at all.  I don't think the coconut flakes should be in an Oreo flavored item as Oreos don't have any coconut in them.  Also, compared to other egg puff places, I felt that the batter was too heavy.....it lacks the crunchy outer that egg puffs should have.\n\nIn summary, I'd probably be back again if I'm in Stonestown but it would be mainly for the Thai Cha or to try other drinks.", "author": "Dolly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "I ordered pork kush seaweed, it's crispy and richly flavored!! Love it!! I will definitely be back again!!", "author": "Jenni L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "I ordered a drink and the eggette\n I asked how long would it take for me to get my chocolate and banana. The cashier hopped across to check with the busy bakers and told me around 15mins. That sounded reasonable. The drink was prompt and it looked delightful and fascinating. I waited patiently but after half an hour  I was telling  myself that this wait is ridiculous as I found that with luck I will get it in 15 mins. No such luck. Finally my number came up and it took 1 hour and 10 minutes\n Fortunately the drink and eggette tasted delicious. Much as I would like to come back to try more of the menu, definitely it will not be for a long time till the wait time is considerably short.", "author": "Sally O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "Decided to buy a drink for my daughter after her volunteering and the galaxy with the light, berry smoothie, and Thai ice teas was good.  I only purchased the drinks that came in the bottles, but I saw that they had the waffles with different flavors and decorations.  I would go back again.  My review is mainly on the drinks.", "author": "FG L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "I was really excited to try Eggxotic because of the extremely long line and crowd around the store. I deciddd to stand in line and try something because the menu looks really unique! I ordered the rainbow drink ( I forgot the name, something with butterfly pea tea) and I wanted to try the charcoal eggettes but they don't have it yet. The wait for the drink took 40 minutes which was absolutely insane. I got really excited to try the drink when I got it because it has a flashing light and it was like a rainbow! When I took my first sip I was really disappointed. The drink tasted like warm Sunkist soda with water and sugar. And the boba tastes really weird. TJE price for the drink was decent like any other boba shop however I didn't like the Drink at all and it was not worth the wait. I would not recommend coming here.", "author": "Carissa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "Got the Mangodo and the Thai Chai. Fairly good.\n3 stars because I don't think they clean between egg puff orders. I got a bunch of coconut in my Oreo Star when the recipe doesn't call for coconut. Won't be great for people with allergies.", "author": "Lareine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "I am disappointed because it seems they changed their concept from offering eggettes to instead waffles which in my opinion is not worth it. Their Oreo star in waffle form just doesn't look as appealing compared to previous eggettes form. In fact it looks weird.\n\nThey're called Eggxotic so they really should go back to offering eggettes for the sake of consistency. I loved their Choco nana and was excited to go back only to find out they changed to waffles. The wait is still long and their drinks is just ok. \n\nI'll go back if they change to offering eggettes again.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "I encountered with several comments about the egg puffs being too nasty, etc and the owner took the time to twist and change it to something better - waffles. The waffles are very crunchy and unlike having, for example, the chunks of taro inside the egg puffs holes, they entirely smash it with waffle batter and I honestly love it. However, I've been buying from this place for a long time and the waffles changed of texture and taste. At the beginning it was a perfect crunchiness with a bit of soft parts, but now it is entirely crunchy. I feel like I'm eating chips! The employees should really focus on setting a timer and making the waffles with 1:1 crunch and soft ratio. I noticed they just slightly open it, see if it's sticky, and close it again.\n\nI've also tried the majority of the drinks and the best one from the menu is the classic milk tea. All the other flavors are very basic. The bottle with the lights are way too hyped up. For example the galaxy drink taste like a drink I can get in any local store. Not saying its bad but I wouldn't get it again.\n\nIn regards to the waiting time, expect to wait 30 min to an hour for the waffles in busy hours usually around when the kids are off school all the way until closing time at 8 or 9 if I'm not mistaken.\n\nI'm giving them 3.5 stars because this place really try to satisfy their customers. The only tip I can give them is that they should consider going back to making egg puffs and filling the holes with batter AND the toppings (purple jam, taro, chocolate and banana, etc) and not completely stuff the holes with JUST chunks of topping. More topping doesn't necessarily mean it's better. Balance is key.\n\nReview is so long but I really love this place and they're doing their very best and I see and admire them. Staff is excellent. Very friendly. Waffles, not really.", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-30", "description": "rating: 2.5 stars\ni wonder how much of the cost is made up of the LED lights and unconventional bottle. both are cool i guess but not mind blowing.\n\ni ordered the galaxy with chia (they didnt have tapioca boba) which tasted like grape sparkling water. not bad but is it what i want from a boba tea? no not really.", "author": "Boba R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-22", "description": "Ehhhhhh.\n\nI'm all for more kitschy novelty food stores, but this place really isn't all that.\n\nWhile their drinks are really good (my favorite is the Galaxy) and it's fun to shake them around in the fancy light-up bottles, the egg puffs/waffles are pretty bad. Despite the fact that they're made fresh, they taste pretty flavorless and firm.\n\nOn top of that, the service is really slow, and even though I went in the middle of the day when there weren't a whole lot of people around, it still took a while for me to get my food.\n\nSave yourself the time and just head over to CREAM.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "The double yammie is pretty good and every bite have yam in it. The drink is pretty and good, it lights up.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-20", "description": "I cannot give a review on the food or the drinks. However, I can on the extremely poor customer service. After an early dinner at the mall on a Sunday afternoon, we came across this place which specializes in egg puffs. We were super excited and got in line right away for desserts. When I got to the counter, I was told that I could not order egg puffs OR special drinks because they were getting ready to close at 6pm. I told them that I've been in line for 10 minutes already and no one came to tell us. The girl said she told someone in line already that they were getting ready to close. Obviously she did not tell me, otherwise I wouldn't have wasted my time waiting in line. \nMy suggestion: Give a sign to the last person in line, so everyone knows who is the last customer to be served. Or even better, just serve all the customers in line!", "author": "Mable C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "The drinks and customer service are pretty good. I got the watermelon with sea salt cheese foam with added \"magic boba\" (not sure what it is except it seems different from regular tapioca) which was really tasty. I like the fact the drinks come in reusable bottles - I wonder if there's a discount if you bring it back for reuse? It is a bit annoying that the straws are too tall to screw the tops back on.\n\nI was, however, like most others I was really disappointed there weren't any egg puff-style waffles. I got the double taro waffle and while the flavor was okay, I felt pretty meh about it. Guess we'll have to keep getting our eggette fix across the way at Quickly's.", "author": "Faith C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-21", "description": "AUGUST 21 2018\n\nI'm glad i'm not the only who thinks negative about them. It's Tuesday around 1pm and i was the only customer and still had to wait 5 minutes for my drink.  \nI got the typical milk tea for $4.35 and it SUCKS! I had 75% sugar and i can barely taste the tea. It's so milky and sweet, nothing special. NEVER AGAIN!", "author": "Toni R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Came about 11 am there was no line but a lot of people standing around reading the menu. I ordered the Oreo, Pork floss, and watermelon drink. Watermelon drink was good and creamy from the cheese cream like a smoothie. Pork floss was bomb asked the cashier which savory was best she suggested the bacon jalapeño but wasn't in the mood for spicy and I already decided on the pork floss and she said that was the next best one. Got the Oreo because Oreo yum it looked cute the black with the yellow stars. It was okay. The batter just tasted like regular batter and the cereal star added crunch and texture while the coconut flakes I felt were just there for decoration. None of the flavors of the Oreo came through which was a let down since it sounded so good. Maybe they need to add real Oreo bits? I would visit again but get another sweet one.", "author": "Chloe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "This is one of my favorite milk tea place! It tastes so good and I can see they use milk because it is not watery at all. Price is cheap and you get more than what you paid for.", "author": "Jess J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "love it as a snack, however it's just not me to give any higher stars to an \"unhealthy\" food. It was sweet and it tasted good when I craved for sugar! Satisfied my needs at,that moment.", "author": "Jane D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "I've been waiting for this place to open up! Couldn't wait to final have more variety of egg puffs closer to the SFSU campus. They did just open, so give them a chance to settle in and work out the kinks. \n\nMy friend and I tried their S01 (Galaxy) and S02 (Rainbow), which I believe were the only two special drinks that came with the lights on the bottle. I had my Galaxy drink with the magic boba--a tea-soaked crystal agar type boba that gave it a crunchy texture. Though it was a little too sweet, the ice eventually melted to dilute the sugar. I think in the future they'll start to add drink adjustments. Just because they recently opened and might still be practicing how to make drinks at a high and fast demand. \n\nFor the egg puffs, we ordered the Oreo Star: a black-colored dessert with crunchy star cereal on every puff. Honestly this was great. The texture and quality was consistent with each individual egg puff and was not too sweet, though if you're expecting it to taste like a 100% replica of an Oreo you should only think about tasting more of the cookie instead of the creme. \n\nOur wait time seemed average for a fairly new dessert/boba shop drawing in the attention of customers like moths to a flame. About 15-20min in line to get to order and another to wait for our drinks and food--perhaps a little longer depending on how many people are in front of you. If you're going to get antsy about this pretty normal timeframe, I suggest you wait a few months when hype has died down. Other than that this place seems like it'll stay with us for quite a long time.", "author": "Jelena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "I like the boba there. It's something different from others place :) the cashier is nice, she was helping me choose the menu when I went 1st time", "author": "Arutchaporn J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "Should've checked yelp review before I try this place. The Thai chai was so bland to a point of tasteless. The double taro eggette was just okay.", "author": "Yisha z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-12", "description": "Don't get the hype for wild flavors of eggettes and drinks that take a long time to receive but I guess if folks are into gimmicks and like waiting for things. Would rather stick to eggettes and normal boba milk teas but I digress.", "author": "Shelton F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "Ok.  So I have nothing against the taste of the drinks.  I really like the rainbow \"tea.\"  However, I am not ok with my \"tea\" having soda in it.  I actually don't drink soda anymore and I'm trying to keep it that way.  To know that I've been drinking soda this whole time is really upsetting.\n\nI'll probably get drinks from there again, but I'm not sure if I'll ever get Rainbow or Galaxy again.  It's a shame because I liked the taste of them.", "author": "Yeonjae K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-01", "description": "I got the Hot Summer drink which is water melon with Salted cheese. I love both of these flavors and have had similar combinations are boba places all over the city. The watermelon flavor was subpar and mainly relied on sweetness to have any taste at all, of which I got 50% sweetness and was still a overpowering sugar bomb. The salted cheese was barely salty at all, which ruined that pleasant salty sweet contrast that makes these type of drink wonderful. Finally, the magic agar boba had the texture of rubber with zero flavor, it literally pained me to eat these. There is much better boba in San Francisco, with a more friendly atmosphere as well. Over not impressed with their drink selection.", "author": "Adam A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Didn't plan to purchase one but well...anyway, nice costumer service and good food. I ordered the S03 and K02. The drink was great. It is just hard to drink without a straw cuz you can get full mouth of ice before you can taste the actual drink, so GET A STRAW! I heard that only the S01-S03 had the flashing light thou. The double yammie was fine, not as crunchy as I expected, if you like softer taste of the egg puff, that will be a good fit. I think I might come back for the drink only.", "author": "Camie Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-13", "description": "Nothing special about this place but having a nice Instagram or Snapchat picture of the Galaxy or Rainbow drink. Only those two drinks on the menu come with a light**. All other drinks don't! Ordered an oreo waffle too and had to wait 30minutes as they only had 6 waffle makers working. Waffle tasted burnt and really really hard!! I probably could've made a better one at home. In all, spent an hour here. I think McD still has better drinks than this place!\n5 stars for the workers hard work and dedication, 2 stars for their drinks, 1 star for their waffles.", "author": "Jacob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Hey can you play that song again? it went beep boo boo bop boo boo beep. \nRadio Disc Jockey: Nah man you mean the song that goes beep boo boo bop boo boo bop", "author": "Tricia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Tried the matcha and red bean egg puff. Was really good. They made it fresh and the matcha and red bean flavor really came out. Would definitely recommend!", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "So I decided to try this place since there always seems to be a line or people gathered here. I saw people holding these colorful drinks in a tall plastic container that apparently comes with purchase of drinks. The packaging is on point  definitely grabbed my attention. I got the thai tea drink, and it was just.. disappointingly okay. Like a lot of other reviewers said, it was nothing special. Looks pretty, tastes average. But the price was $3.50, and that's a pretty good price for a drink and the container.", "author": "Shirla S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "Their drinks are alright, nothing special. It comes in a reusable plastic drink container so that's pretty cool. Number 1 and 2 are the only drinks that light up but those drinks doesn't taste that great. Go with the House milk tea or Thai tea or the strawberry one with milk. I'm giving it a 1 star because i wanted their eggettes but after paying for it, it was freaking waffles! I guess they changed it recently. I waited a long a$$ time for my waffles because they couldn't give a refund. Will not be going back.", "author": "Vickiiieee V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Got the Yoshi Bean & Original flavor Eggette with a Mangodo drink. \n    Yoshi Bean is matcha mixed  with red bean flavor, it was more on the bitter side for me so probably recommend if you like more matcha than red bean. \n    Original wasn't on the menu but I asked anyways and they have it, cost  $3.75. If  didn't taste anything special, but overall decent.\n    Mangodo is a smoothie with mango mixed  with avocado, I love mango  and my gf loves avocado. Why not? Haha. Tasted great  and not to sweet. I would definitively come back for the drink again.\n     Cashier was nice, and also gave me a heads up of how long will it take for my order to be ready. :)\n     Overall, first time experience was okay. Nice and friendly cashier. Eggettes wasn't to my personal liking. A great Eggette for me would be more crispy and fluffy in the inside, so with that being said hoping for a different experience next time. Drink was awesome and you can keep the bottle to re-use but not sure if recyclable", "author": "Charlie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "They're egg puff are so so good! I also love their drinks the strawberry is great \n\nSometimes there will be a long line and the drink could take a while but is so worth it\n\nDef grab one on the way in and go on about your shopping!", "author": "Chiu H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-29", "description": "Wow. Just like everyone else is saying- the service is so slooooow. Waffle is ok, but not worth the 30 minute wait. I'll go back to Quickly next time for sure.", "author": "nancy s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "\"Egg\"xotic yet NO EGG PUFFS HERE ‍\n\nLike seriously tho...if they don't bring the egg puffs back the only thing they got going is ok drinks..\n\nSo..with that being said..\n\nI'm pretty sure this place won't last long", "author": "Anna I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-10", "description": "As people said, long lines, waiting time extremely long, especially wait for egg puff. I tried their egg puff two days ago, took me 40 mins for waiting, the drink looks good but...... taste No Good at all, also they use Avocados Powder for making smoothie, not the real fruit, I don't like it at all. No ice & sweet level. I only recommend their snack which is egg puff. But be patient to wait.", "author": "Siuchun K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Service is too slow. No system, needs more people who can work the line. Waited 30 mins for waffle, not sure if they can make it . Management problem.... they are too slow. Never again", "author": "Alison W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "This place took forever to give me my drink. Like how long does it take to make one drink?? And on top of that I was going to get some food but I looked at their food station and it was beyond unsanitary!! And they left all their food out. If you want to get sick by all means go here.", "author": "Joei Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "Just FYI - this place uses a non stick cleaning spray on the irons after each use that should be washed away. The waffles are absorbing these chemicals that are not fit for human consumption. \n\nI asked what the spray was that they were using since it was in an odd container. The staff told me they could not tell me because it was a secret, then it was 100% water, then it was top ingredient water . They refused to show me the label because it was company property!\n\nThen after telling them that this was illegal since I did not want to eat something that could make me sick , the manager came out with the ingredients list. Guess what it was all cleaning ingredients such as silicon, sodium laureate sulphate, a lot of scary sounding hydroxides etc.", "author": "Erendira O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "Came here 30 mins before they closed and they told everyone in-line (about 8-9 people) that their closed and not taking anymore orders. Horrible", "author": "gordon l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "Eggxotic had a special deal from 9/10-9/14 where the milk tea with boba was only $1.79. (Of course I wouldn't miss any amazing deal.) I don't know if it was my inner Asian hyping up the drink, but the drink was stellar for its price! The boba was surprisingly sweet and the right consistency. As for the milk tea, it was a little overpowered by the amazing boba but I'd say it was bearable for it being $1.79. Left a little bit of a chalky aftertaste in my mouth and was a little watered down, but that was probably because I waited too long and let the ice melt. Also, I would like to note that the drink size is pretty big and they use those little ice bits to cool the milk tea, so you're not paying for a cup of ice like other boba places. Overall, I would say their milk tea here deserves a strong 3 stars. Pretty sure it's the last day (today is 9/14) to get your $1.79 milk tea. So hurry before it's gone!", "author": "Connor C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "This would have probably been a 4 for just the oreo egg puff (such innovative flavors that look cool too) but the long was wait for egg puff is ridiculous. You want to know why their egg puffs take forever? Because they don't make them efficiently. Every time I saw one of these teens go through this entire process I just wanted to scream. Ok I've seen a million egg puffs made: eggettes, hk dessert cafes, all over Asia and no one, NO ONE does this excruciating process. First they have all their premade batter in pitchers and then they pour it into a tiny cup, then bring the cup of batter to the egg puff maker and pour the pre measured batter onto the iron and then they use a scraper to smooth over the iron as if it wasn't going to just fill the other spaces on its own because it's freaking liquid and liquid will fill up empty space. Then they wait til it's done and they cut off excess crispy (which I usually don't mind having as it's extra pieces but I guess they want it to look perfect). Then lastly, they use a fan to cool it down -___- not even for just a few seconds but I actually watched mine sit there for 2 mins. That's exactly why it takes 10,000 years to make one as numerous other egg puff places would do it in minutes. Sigh...", "author": "Yvonne L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-11", "description": "Eggxotic opened a few weeks ago and there is always a long line, especially during the lunch hours. I decided to take an early lunch to avoid the lunch crowd and there was no line to order. I got the  Yoshi Bean (Matcha Red Bean) flavored eggettes and was disappointed when they switched to the waffle maker instead of the eggettes maker. The texture was a lot harder to chew when they switched to the waffle maker. The person taking my order did disclose to me that they were not using the eggettes maker, but did not give a reason why they were not using it. The wait for my order took about 10 minutes when there was no line. The menu had a lot of options of eggettes including some that are savory and even flavors like taro, yam and many more. There is also a menu of drinks available that I have yet tried. I really hope the bring back the eggettes maker, maybe it's just temporary to speed up the wait time. It really doesn't make sense for them to not offer eggettes when their logo and name clearly shows that they offer eggettes. Will give them try again in a few months when the hype dies down.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-27", "description": "Let me tell you something. First of all this place is a copy of gosu T Bar. Second of all the drink sucks. Third of all I waited 1 hour for my drinks and food. Last of all this place is not clean at all.", "author": "Kingsley K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "If my kids weren't attracted to the drinks I would not be a customer. Lines are long and they are super duper slow! Do yourself a favor and go to Eggettes same concept. Two times we came they screwed up our order and their menu doesn't take a chef to accomplish. Second, we were number 66 and they were calling 77. When I asked they asked me if I was sure I placed an order, WHY the heck would I be standing in line for?!? Watching a person make waffles is not a my past time. She didn't know how to look at prior transactions to ensure I ordered what I ordered. It was just a mess.", "author": "Vanessa U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-24", "description": "I waited close to 25 minutes for 1 waffle.  There was only like 5 people ahead of me. The food was okay, but the service was so slow that I'll never return.  The workers preparing the food looked as if they were afraid of the waffle maker.", "author": "Kim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "We had one order of a regular egg waffle. It's pretty good actually. Crispy on the outside and soft on the inside. Environment is clean and the workers are friendly. We didn't go for the drinks because it's a bit pricey. Maybe next time.", "author": "Allan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-03", "description": "I got two eggettes: yam and matcha flavored. They are okay; a little on the sweeter side. What made me put two stars was the wait. I went at a time when there was no line and only a few people. And it took 30 mins for me to get both my eggettes. Dissappointed.", "author": "Priscilla K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "This is the first time coming here and was super excited for EGGETTES but they changed recently to all Waffles which was disappointing. \nThere was not a lot of people thankfully. I waited for 30 min for the garlic crab waffle. Then when I thought mine was the next one, but they gave it to someone that came after me. I went and asked them so I'm guessing they gave mine to someone else. \nI give one star because the worker there was very sorry and gave me a free sweet waffle.\n\nThe taste of my waffle is not worth the wait or money. The waffle was salty but not much taste. The waffles were not crispy either. This was very disappointing.", "author": "monica l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-18", "description": "This place let me down TWICE! First time we came here and ordered one egg puff and one drink, we waited up to 25 min but they ended up giving us the wrong orders. They asked us to wait in line again. So we left with two drinks. The drinks look cool but they don't taste as good as expected. Second time, we waited in line for a long time again and they said we need to wait 45min for the waffles and egg puffs, so we lined up for nothing again. We probably won't go here anymore. Got us really disappointed and tbh it is not worth your time to come here.", "author": "Janet W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "We showed up at 8:30PM and they stopped serving egg puffs WTF! Doesn't take 30 minutes to make it.", "author": "Brandon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "place is the best but the only thing that i hate is one of their employee she need to pull her hair back...she's working in gastfood not salon or what so ever....", "author": "Ashlee M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-22", "description": "The name of the store is misleading because they don't serve egg puffs, they serve waffles. I was rather disappointed to find this out and it definitely made the experience a bit worse. While I originally planned on ordering food, I decided to only order drinks instead. I got the House Milk Tea which is an Assam and my friend ordered the Thai Tea. Their boba is called \"Magic Boba\" which is really just agar boba. I was also pretty disappointed when I found they don't offer regular boba. My drink tasted a lot worse than it looked-- there was too much milk and not enough tea. Their Thai Tea is less sweet than other places but I didn't mind.\nOverall, I'd say the drinks are only really worth it for the picture, not for the taste.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "The worst place I've been to. I can't believe I waited ONE HOUR for ONE egg puff. I ordered two egg puffs. Half hour later they told me they didn't have the star oreo egg puff. I was about to leave but they told me they were going to work on my second one but I didn't get it until half hour later and it was raw. I don't normally write reviews on yelp but this was very disappointing. I would recommend you not going there, you are better of going to quickly's", "author": "Yessenia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "First time here on an early Tuesday afternoon and there was still a crowd surrounding this place. I already knew about this place because I would see so many people with the light up cups and that's exactly what drew me in here. I got S1 and it was okay. It was kinda too sweet, which is odd when it comes to me considering I have a huge sweet tooth. It was also kinda watery too but it's okay because it wasn't that bad. The lychee jelly was pretty good though. I haven't tried the egg puffs yet but they look pretty good! I'll probably be back for the egg puffs next time", "author": "Cee H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-22", "description": "Eggxotic may look busy with long line but it's actually due to an inefficiency with the way they do business.  First, they have the customers to form a long line with only one cash register.  After you have ordered, even when your order is ready, they will not give it to you because the cashier is the only one who can distribute it.  With that being said, of course you have to wait again.\n\nIn addition, when the Eggettes puff machines were broken, they didn't post any signs to inform customers but to offer waffle instead.  I saw many unhappy customers after a long wait. \n\nLastly, the Galaxy tasted like Sprite, I don't recommend this place!", "author": "Janey J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "Waited 40 minutes in total (including ordering and waiting) to get my order. I ordered the S2: Rainbow and S9: Thai Tea. Drinks are interesting but the taste isn't that fascinating. It's worth a one time try if you've never been here. But for long term, I will probably go if I happen to be around there and have an extra 30 minute or so to spare.", "author": "Tommy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "This place has a great menu and serve their drinks pretty quick and efficiently. However, their eggette options are what seemed to be an issue to for the workers to push out for their customers. Not going to lie, their menu for their eggpuffs has a great variety but their system is disorganized and at some point while the workers were doing their best to push their last orders for the day, one of the workers didn't care who's order was who's anymore because of how disorganized their system was.", "author": "Chrizelle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "We order the OREO star, taro, seaweed and garlic crab. They all taste great!! The drink is so cool! We will definitely come back. Nice service btw.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "This place SUCKS!! First off, they are waffles, not eggettes. Quickly's egettes are way better compared to the waffles here. Don't be fooled by the drinks too! I thought it looked cool how the galaxy drink lighted up, but it was so disgusting and I could not continue drinking it. If the line is long, I hope you have all the time in the world for your drinks or eggettes to come. Be prepared to wait a little over an hour. Getting my drink already took 30 minutes. The staff are so backlogged on orders, you're gonna have to wait a lot longer.", "author": "Maki O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-26", "description": "The wait for this was really long. The boba is not actually boba. It is really gross. Do not recommend at all. They have extremely bad customer service and bad organization. They took sprite and added color. They also added too much  sweetener and it didn't taste good in general. It was legitimately disappointing and it was worst quality boba that I have ever eaten. In fact, it had the consistency of rubber. If there was a zero star, this is what I would rate it that!!! Didn't try the eggettes. The prices are pretty cheap though, which was a surprise to me.", "author": "Emi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-27", "description": "Ok the eggets are pretty good but DO NOT GET THE DRINKS. They taste like cough syrup and the boba is awful. It's a weird texture overly sweet and just a bad drink experience overall. DO NOT I REPEAT DO NOT GET A DRINK STICK TO EGGETS!!!!!!!!!!!!!", "author": "Joesy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "Why would you changed the egg shape to waffle shaped. Disappointed, the name should be waffotic instead.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "I only tried 2 items here. I love the coco coco nana that's the only waffle I get and it tastes great. The drinks tastes mediocre. I saw a staff member dig thru the trash and didn't wash her hands only changed gloves. Ew. Everybody sees them touching the food and they should wash their hand before putting a new glove", "author": "Russell T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "I tried the galaxy drink with crystal boba and the boba was hard to chew i wouldn't say its good and I wouldn't say its bad, but thats just my opinion. Try it if you're interested.", "author": "Marian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "A lot of people hype up for this place and a lot of people go there but the drinks are not very good.But they are not very expensive and the drinks the lights up are very cool.", "author": "Hla M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-12", "description": "Wait is horrible; take 15 inline and 2i0mins to get the food; the yum one is better than other; but overall just ok; don't think I'll come back; other place has better one", "author": "serena j."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-26", "description": "I thought I'll give this new spot a try with my bf but we were rather disappointed. We came to Eggxotic on a Thursday afternoon at around 6:00pm and it was crowded. We waited for awhile in line to purchase our food and drinks. There were a few people complaining for the wait and tried to get their refunds because they can no longer wait for their eggettes. I have no complains on the wait for the drinks because it was quicker than the eggettes. I literally waited for ONE HOUR for just one order of Double Yam eggettes. If I knew the line was that damn long, I probably wouldn't have purchase the eggettes. It was nothing special and I felt like I wasted an hour of my time. The girl taking order was very kind and sweet, but the girls working at the eggettes station literally look like they were taking their sweet time. I understand that eggettes takes time to cook but the workers look so chill. Like why aren't you guys cleaning up the mess? Not gonna lie, the eggettes station looks like a mess. The drinks overall was a disappointment. The Pink Lady drink tasted like 80% milk and then 20% strawberry. The Galaxy drink was SO sweet but the glow in the dark was very cool. The Rainbow drink was SO sweet too. It seems like all their drinks are very sweet, like 110% or something. Probably not going to be back again because of the long line and how unsanitary they are.", "author": "Jinnie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "I was here on Friday and tried to order their signature Oreo flavor eggette but they said they only have Oreo waffle. I was already disappointment by it. The taste of the Oreo flavor was even worst. It had coconut inside and the Oreo flavor did not taste like Oreo. Wasted my time and money on this place. My first time but also my LAST time here.", "author": "Donna D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "Place is okay, the drinks are mediocre and flavor wise they're i'd say a 5 outta 10. What i don't like is how i was sipping my drink and a fatass lemon chunk flew into my mouth. Yea fresh lemonade is always better but atleast strain it beforehand.", "author": "Nathan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-02", "description": "I was really excited to try this place out and it turned out to be HORRIBLE! I can only say this for the drinks, i didn't bother getting the egg puffs because it was a 50 minute wait. I saw the way that they make the drinks and I can't believe what I saw. I believe they have a rainbow fading drink with butterfly pee DONT BUY IT! Save your money,buy a sprite and add some water. I thought in my head when I tried it that it tasted like a watered down Shirley temple. Once I saw how it was made it really just is . They add water, sprite, and some strawberry flavoring. That was already bad enough then I saw that they use the same mixing spoon over and over leaving it on the counter and using it again without washing it.", "author": "Destini N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "I bought a bunch of different flavors of. Each of them good in their own way.. Got to try the garlic crab egg puff.", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "Nothing \"eggxotic\" about this place that is worth 40 minutes of my time. That's right.. it took 40 minutes to get soggy, barely cooked waffles. I would have finished eating at Ihop in 40minutes. Won't come back.", "author": "Lex l."}
