{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "A fun spot for a good meal!\n\nI came for dinner and was sad to see that they stop serving Cuban sandwiches after 7pm. Fortunately, we were well fed with empanadas, mofongo, and lechon. There isn't a ton of Caribbean food in the area as far as I know, so this was a good opportunity to order something a little different.\n\nThere's no liquor here, but the sangria is tasty. I'd come back for a casual dinner when I don't have a reservation and don't feel like waiting in line. The service was also very good.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "I was on the hunt for some good Puerto Rican food in SF and was excited to try this place out. I've had plenty of mofongo in my life and this is definitely one of the better ones! The sauce was so tasty and good and full of flavor with some nice garlic and sazón. The mofongo itself was excellent, not dry at all and the pork that came with it was very well flavored. \n\nI also ordered the habichuelas (red beans) and arroz con gandules as my sides and this was enough for two people. Both of these sides were really tasty but the arroz con gandules was definitely the highlight. \n\nPicking the dessert at the end was a very hard choice but I ended up going with the tres leches and was very happy. It was a big portion and really nice and sweet and just everything you'd want from tres leches. Put waiter was super nice and patient, especially since we were being indecisive about a lot of our order. \n\nWill 100% be coming back to try the Vaca Frita and a few of the other items on the menu. Stop by if you are in the area and make a trip there if you're not!", "author": "Valeria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "I love El Nuevo Frutilandia. I've been coming here for years, especially for family celebrations.\n\nLet's me just say, my father hates eating out and is very particular of where we go if we do eat out, but yet this is one of the few places he loves coming to. \n\nThe food is delicious and better than the few places around for Puerto Rican / Cuban food in the city. The ceviche, tostones, and mofongo are some of my favorite dishes along with their dessert empanadas. \n\nThe management is very nice and beyond accommodating. And unlike other reviews have mentioned, I've never had an issue with the food quality, wait time, or service regardless of how slow or busy they are.\n\nI will continue coming here and getting my Puerto Rican/Cuban food fix as long as I can.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "My boyfriend and I passed by this restaurant a few months ago and we FINALLY got the chance to try it. We were so excited and the location is beautiful, right in the heart of Mission District.\n\nWe started out with chicken and picadillo empanadas with a side of tostones. That already set the bar high for our entrees, it was so delicious! Filled with flavor and the meats were cooked so well. The empanadas were both crispy and golden, yum.\n\nOur entrees came, he got the ropa vieja and I got the Chile relleno with chicken. They both came with sides of white rice and taro chips. The white rice had a nice kick of flavor, it was a perfect side and so were the chips. The whole meal evened each other out. Along with the great food was friendly smiles of our servers. they were all so kind to us!! Thank you very much for a delicious meal, we look forward to coming back.", "author": "Vanessa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Who knew I could lick a whole plate clean. The Ropa veija  was almost as good as abuelitas!", "author": "Meghan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Second time here and the food was Amazing! \nFrom the pork mofongo, ceviche, and beef& chicken empanadas! \n\nService was pretty slow but I understand there was one server on one of the hottest days of summer who ran out of ice.\n\nFood came out fast and it was delicious! I also enjoyed the white wine guava sangria!", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "My absolute very spot in the mission. I'd go here everyday instead of cooking if I could. My family came to visit from New York and I took them here. They begged to go back every night. Any time I have people in town i take them here. The owner and the waitress Katy are the best!", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Food was excelent and the servers were super friendly. I would definitely recommend this restaurant.\nThis was one of my first times tasting Cuban/Puerto Rican food and I was not disappointed. Me and my party were celebrating my cousin's birthday and although it was super short notice, the owner was kind enough to give cousin a slice of their delicious tres leches cake. Me and my party will definetly return and share this amazing place with our friends.", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-11", "description": "In reading some past reviews my fellow yelpers hit the nail on the head. The food is good, the server / management is suspect to some criticism. \nWe ordered the TOSTONES CON MOJO which were tasty. The \nMOFONGO with shrimp was a bit over priced for the amount of shrimp given. 2 whole shrimp with a small amount of chopped up shrimp.The POLLO A LA ESPAÑOLA had  a nice  house Caribbean butternut carrot spiced sauce. The white chicken was a little dry of the sauce saved the day. The LECHON HORNEADO was a nice  dish with good amount of pork. Both main courses came with Puerto Rican rice and black beans.\nTo begin our meal our server took our order and just left the menu on the table which I though was odd. The sever came back and told us one of our appetizers was sold out but was not taken off our bill . Our food was given to us without plates We asked for  some and was given 2 small appetizer plates for the main courses. \nFinally right before we were about to finish our meal the manager came over and said \"cash only\". Our credit card system is down. Since my credit card company gives double points per dollar I lost out pretty good on a $60 tab. A little annoying since I don't like to carry cash on hand.\nWe were never asked if our food was good or needed anything else. Poor customer service.\nYour not going to get repeat business with that kind of service.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Amazing Cuban food in the midst of the mission. I had the chicken and my friend had the pork, both were off the chain. Add in the Yuca fries on the side and it was a delight. Very reasonably priced as well. \n\nAdditionally the staff was wonderful. Very helpful in their suggestions and very polite. To boot, I left my bag there and we were the last people before closing. They were kind enough to carefully set it aside keep it safe. \n\nWe'll definitely be coming back soon.", "author": "eric k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "I\"ll keep this short and honest:  The food was okay... the service? It was terrible.  \n\nI waited too long to order and then waited even longer for the food to arrive even though it wasn't super busy. \n\nOnce my plate arrived I had to wait for another long while because there were no utensils, even though I told the waitress politely that I needed a fork... it took a long while for one to even arrive - I even saw her serving other people while I waited patiently for her to bring me something I could eat my food with.\n\nAlso...  they forgot my drink - never brought it to me. I reminded the waitress at the end of the meal to take the drink off the tab since I never go it. She did take the drink off but when I checked... there was a surcharge of a $1.00 for using a credit card... even though the bill was paid with cash. wtf?\n\nAt this point I just walked out the door, didn't care any more, but I still left a tip... plus the credit card surcharge... for paying in cash : /\n\nThis place can be a lot better if the service was at least descent, but it was just one bad thing after another.  I can't recommend.", "author": "Christiani C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "This is a great spot in the Mission with authentic Puerto Rican and Cuban food.\n\nTo start we ordered the Picadillo, Chicken, and Veggie Empanadas. All of them were good! Loved the Chicken especially!\n\nWe ordered Pasteles which my Husband loved. For our main dishes we had the Pollo Española which had great flavors. It was similar to the Chicken in the empanada. Completely different than anything I have had but totally yummy! \n\nWe had the Lechón, and shared a side of Habichuelas. The Lechón was very yummy. All of the plates were very generous and super tasty. We had delish leftovers for two additional meals.\n\nI loved the ambiance and the music made us want to get up and dance salsa! Our server was very attentive and even brought out flan to celebrate a birthday in our party. For dessert I really enjoyed the Guava Turnover. It was fabulous, save room or take one to go!", "author": "Caro S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "I REALLY like his space. There was a family party type event going on with tons of music and singing. Since the place is really small customers were sat right in the midst of their celebration. It was great. Food was really good. I'll go again.", "author": "Rodney W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "The food was really good. I enjoyed the ropa vieja, the meat was tender and just right. For appetizer I got the yucca Frita ( It was my first time trying it and it was definitely interesting taste. Kind of taste like fries but it wasn't.) Lastly, I had the Alcapurrias and I would recommend people to try that one also.", "author": "Faith W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Nice little place for very good food and service.  Watched a TV review of this place.  The review was on point!!! Will come back for more! If you're in SF, it's a must do on your checklist!", "author": "Em J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Great service! Good sangria, and delicious tostones and yucca! Stopping here was on a whim and completly loved it!", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Delicious food, friendly staff. Everything I had tasted great!! Will be going back. The plantains were sweet and a desert all in itself. Get the Puerto Rican rice!", "author": "Christine E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Puerto Rican and Cuban food isn't as common in San Francisco as on the East Coast - this spot has a little slice of it. The tostones are prepared well and they even have Malta - one of my favorite drinks from Puerto Rico.\n\nProps to them for also having a Cuban Sandwich - tampa staple and tradition - we do host the annual National Cuban Sandwich Fest after all.", "author": "Carlos H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Sangria sangria, we tried the white sangria and it was really good. You always have to try the sangria in a latin/Hispanic/cubano culture lol, it helps to judge the rest of the night. On a date we ordered the empanadas, which came out hot and tasty, yummy; It was two so it's basically an appetizer. Then we ordered the Mofongo which was fulfilling and cooked with love. Then we had the Ropa Vieja! We shared all three plates so it was the right amount, obviously you can order just one plate for yourself and still have a great meal. I would definitely recommend those 3 to try out, however I have to go back and give the Yuka a try again. Wasn't impressed considering in Mother land Nicaragua they are cooked a certain way. The vibe was welcoming and homey so I'll give it another shot. Recommend for something low key and good vibes", "author": "Santiago E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "This place is truly a gem. Having been to Cuba and Puerto Rico, it was an amazing treat to relive those cultures here. We ordered the mofongo with shrimp and the spinach empanadas. Everything was amazing, but those empanadas were BOMB! The service was also excellent, and the waitress was very helpful with choice selection. There is also music, which creates a nice vibe. I'll definitely be back!!!", "author": "Tish H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "The food was exceptionally flavorful.  Simply delicious. There were four of us and we ordered Mofongo, ceviche, yuka fries, the flank steak dish and the shrimp dish. We all shared.   I can't wait to go back to have the Mofongo all to myself. Yummmmmmmm!!!!!", "author": "Alicia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "An authentic taste of Puerto Rico in the mission. The food is amazing. The prices are more then reasonable dare I say cheap for SF given the generous portions. It's a small cozy welcoming place. Chill vibe with music and a very friendly staff. Despite my dislike of a sunglass wearing bleached blond food network star loving this place, the food speaks for itself. Got the vaca frita, a crispy shredded beef dish with onions wth the Puerto Rican rice. The beef was crispy and flavorful and the rice was the perfect balance to the meat. For appetizers got the yucca frites, tostones con mojo, and alcapurras. All were solid and good. The food here is great and authentic and you can't  beat the price and portions. One of my favorite places in all of San Francisco.", "author": "Peter P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "I remember first trying El Nuevo Frutilandia when they were at the San Francisco Street Food Festival a few years back.  I had their Lechon and it blew my mind (bit.ly/1kKi5zG).  The pork was so tender and flavorful!  So after totally enjoying that sampling,  I was really looking forward to visiting their restaurant.  Well it took a while, but I finally made it over with a few friends.\n\nEven though I was completely set on ordering their Lechon, there were a lot of things on the menu that sounded tempting like their Cubano Sandwich, their Tostones Con Mojo, their Garlic Shrimp (Limon Ajo Camarones), and Chile Relleno.  I still stuck with the plan and ordered the Lechon Horneado, and then decided on splitting their specialty Veggie Mofongo with my friends.  We also ordered a pitcher of their Guava Sangria.\n\nGuava Sangria -- http://bit.ly/29VYBpT\nWhite wine, guava\nVery refreshing!  And it paired well with everything we ordered.  If you're going with a small group of people, definitely order the pitcher!!\n\nVeggie Mofongo -- http://bit.ly/2a49ngu\nHand mashed garlic plantains topped with a tomato sofrito\nThis was really good!  The plantain mash was moist and had some good flavor together with the tomato sofrito  I was really surprised with the portion size because it was huge!  If you're dining here solo, unless you have a huge appetite, I wouldn't order this if you plan to order an entree after it.  This really could be a meal in itself.  Especially if you get one of the mofongos stuffed with meat.  I was definitely glad I was splitting this with my friends.\n\nLechon Horneado -- http://bit.ly/29IaNI4\nSlow roasted pork marinated in garlic, pineapple, caribbean spices.  Ordered with Arroz Con Grandules which is Puerto Rican style rice with pigeon peas, smoked ham and bacon\nFinally!!  And the first bite I had of the pork took me back to when I enjoyed it at the SF Street Food Fest.  Just like I described earlier, the Lechon is so tender and the flavor just explodes in your mouth!  They have it down to a science!  The Arroz Con Grandules is a must order with the Lechon.  It's almost like a ham and bacon paella and just completes the whole pork trinity.  And I must mention the portion size, it's a lot of food!!  Because I had the mofongo earlier, I was only able to finish half of my dish.\n\nOverall, I say El Nuevo Frutilandia is must try in the Mission!  It's a really good spot when you're in the mood for some Cuban comfort food.  The food is delicious, huge portions, and the prices are easy on your wallet.  I definitely plan on returning again to try their Cubano Sandwich, and also all their other entrees since the whole menu sounds amazing.  It will be extremely hard to resist ordering another Lechon Horneado though.  It's so good!!!", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Two locals introduced me to this awesome Cuban joint and I am glad they did! The food here is outstanding. We started with the white sangria which I highly recommend! Soo good! We also ordered the mofongo to start with and split it 3 ways. This is a very filling dish so you do not need a lot of it.\n\nI ordered the chile rellenos as my main course. It was also great! I liked all the fresh veggies and the kick from the peppers. You can order any dish with plain rice or have it with meat and beans added in (Spanish style) which is what I did and was very good.\n\nOur waitress was very friendly and made sure everything turned out how we wanted it. The restaurant itself is not large but I was there on a Thursday for dinner and it was mostly empty surprisingly! I highly recommend checking this place out when in the area or if you are searching for some great Cuban food!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "El Nuevo Fruitlandia was fantastic. I could go on and on, but I won't   Great food, well priced with fantastic service. If we lived in SF we be there weekly, it was that good. Don't miss this gem.", "author": "lee g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-19", "description": "The food was great but a little pricey, trying to find parking was horrible had to park 3 blocks away a bigger downfall was the first time we went there they were closed due to a private party so the owner gave us a business card signed by him and his wife with a 30% discount but when we presented the card to our waitress she went to the back and came back out and told us that another owner said they could only give us 10%, I don't know how many owners there are but the need all to be on the same sheet of music!!!", "author": "Angel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "My mom's Cuban and my dad's Puerto Rican and I actually grew up in Puerto Rico and I can honestly say this place is the bomb. Super authentic and delicious in every way. I went last night in need of some home cooking in the wake of Hurricane Maria and this spot delivered. I had some of the alcapurrias (fritters) stuffed with picadillo (ground beef) and they were bomb. Then I had the vaca frita (shredded flank steak) with rice and black beans and it was amazing. This is my favorite dish my mom makes, and this was up there with hers (actually even a more flavorful). I also had the passion fruit mango juice and it was super tasty. In short, I can't recommend this place enough!", "author": "Ana M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "Great people but not your traditional Cuban restaurant. The Mission location has limited parking and it's normal problems. The restaurant is clean and the staff is great. The place is a mix of cooking styles which for me is not great but it was still good food.", "author": "William F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "A colleague turned me on to this place in the Mission.  It's a classic hole in the wall with little signage out front.  Apparently this Puerto Rican restaurant has been here for many years.\n\nTo be honest I know very little about Puerto Rican food as my only other dining experience was at SOL in San Rafael which I enjoyed.  However, El Nuevo Frutilanda was a much different, at least to my taste, cuisine.\n\nAnd that's a good thing.\n\nWe began our evening dinner with the Ceviche a wonderful mix of shrimp and fish that was marinated with a unbelievable tasty pineapple salsa that was heaven to my taste buds.  Most of their dishes are served with Taro Chips which is a fried root vegetable sliced like a large flat potato chip and lightly salted. I think it was the first time that I've had one and I must say that it was delicious\n\nOur entrees consisted of the Pollo A La Espenola which was nice cubes of chicken breast sautéed in onions and red bell peppers in a butternut carrot spiced sauce. The sauce was both sweet and tangy very delicious actually.  The entrée was topped off with a portion of rice. My partner ordered the Ropa Vieja which was marinated shredded beef in a tomato based sauce with rice and black beans. The sauce was very tasty and was totally different than the sauce that my dish had.  Like in all the great regional cuisines such as New Orleans it has been my experience that the sauces really make the dish and at El Nuevo Frutilandia it is all about the sauce.\n\nOur dinner was topped off with a wonderful freshly baked plantain tart which melted in our mouths. \n\nSan Francisco is a fabulous culinary destination full of multi ethnic cuisines  El Nuevo Frutilandia is a fine example of that - offering up great food, at reasonable prices in a neighborhood rich in fantastic dining alternatives.  We found it to be one of the City's best kept secrets.\n\nWe will be back.....", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "this place has been on my list to try for a while  ...I' just happen to b in the neighborhood  and decided to give it a try. and my taste buds were happy. It was a hard decision trying to figure out what to eat.. I cant want to come back good flavorful food good atmosphere ..the staff was so nice and helpful", "author": "Elisha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "This place is delicious!! Customer service was great, and we tried a little bit of everything on the menu including the empanadas- everything was great!!", "author": "Mel N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-01", "description": "tl;dr -- good food, WORST. SERVER. EXPERIENCE. EVER.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nShowed up a little after 9 last night (Yelp says 10pm close). My GF had been interested in it for some time, so we decided to check it out. We waffled on sitting near the door (my GF gets cold) but a seat opened up near the bar and we took that.\n\nWe ordered, switched to another table by the wall when it opened up, and otherwise enjoyed the meal. The food was really good. I was looking forward to coming back again and trying the other dishes. The ambience was nice too, and, up to this point, the server was friendly (mostly) and accommodating. There was an odd tic from her when we asked about moving tables (makes sense now) but otherwise the service was fine.\n\nThe problems came as the meal was winding down. The 4-top had filled up, so there's a group of 5 there and the 2 of us. My GF is not a fast eater, so we she's hurriedly trying to finish her food. The server (woman in black pants and shirt, with dark hair) started being very pushy. She was grabbing plates with food on them, etc. I was scrambling to push the food onto plates we still had. It was weird -- she made it seem like they had a plate shortage in the kitchen. She was very impatient. Things escalated VERY QUICKLY.\n\n* She asks for our carafe of sangria, saying we should pour it into our glasses.\n* I said we'd do that in a moment (my glass was 1/2 full, the rest was for my GF but her glass was already full).\n* She replied that she needed the carafe and was going to take it no matter what.\n* Stunned by her answer, I said \"no, you aren't, we aren't done with it\"\n* She said \"Yes, I'm going to take that carafe\"'\n\n*insert awkward stand-off here*\n\nStunned, I pour the rest into my glass (leaving none for my GF). Carafe is taken. Waitress comes back with the check.\n\nMeanwhile we're wondering WTF just happened. We had never been treated like that before. She wants a tip? I've never in my life left less than 15%, even for the worst service. I wrote as much in a note on the back of the receipt (with a frowny face) and left 10%. I felt shitty leaving that little. I know servers work hard, but this was unbelievable treatment. I didn't know what do.\n\nI signed the receipt and put it in my pocket, planning to leave it (with the note) as we were leaving.\n\nWaitress comes back and demands the signed receipt. I said I would leave it when we left the restaurant (I didn't want to get into with her if she read the note on the back before we were able to depart). Things escalate AGAIN:\n\n* She said she needed the receipt\n* I said I'd leave it as we left, and asked for a to-go box\n* She said we couldn't have a box since I wouldn't give her the receipt\n* I said if we couldn't have the left-over food then I needed to leave less money\n* She then said she'd CALL THE POLICE since we weren't paying (she'd already run my card, btw...)\n* I said of course we're paying, but I'd leave the receipt as we departed.\n* She then said they DIDN'T HAVE ANY TO-GO BOXES (clearly lying)\n\nThis is just dumb. What if I just hadn't signed the receipt yet? In retrospect, I should've waited to do so. But I'd already signed it so she's standing there demanding I hand it to her.\n\n* She stood there impatiently and awkwardly, then said \"I'm going to have to ask you to leave\"\n\nNow I'm confused. Does she want me to pay or to leave?\n\nAt this point it's clear she's having some sort of power trip. The whole thing is freaking surreal. My GF got up and walked to the back by the bar and asked for a to-go box. She was given one. The server walked off as this was happening.\n\nAs we're hurriedly trying to collect the food, a 300 lb. morbidly obese fellow comes to the table and asks me to \"step outside\". Those were his *exact words*.\n\nWTF? Are they really threatening to _ASSAULT_ me over her bitchy behavior? WTF is going on? Fed up and not wanting to aid in her completely unnecessary escalation, I left and waited outside for my GF to collect her things.\n\nHonestly, we were nothing but polite the whole meal. We just wanted a to-go box and to finish the things we ordered without them being forcefully taken away from us. Either that, or be able to depart with them.\n\nI don't know what her problem was. In retrospect, she seemed to have a chip on her shoulder the whole meal. Maybe it was late and she was in a hurry to leave, but the 4-top was still sitting there, unmolested, with a 1/3 carafe of sangria and half-empty plates.\n\nWe were excessively polite, even as I was being BOUNCED FROM A RESTAURANT and THREATENED WITH ASSAULT and a CALL TO THE POLICE for doing nothing more than wanting to-go boxes and holding on to the receipt until I left because she was so completely rude and unprofessional.\n\nPeople like that should not be servers. Are you kidding me? How can you treat customers like that?\n\nI'm now unhappy that I gave her an $8 tip. I want that back.\n\nShe was awful - ruined an otherwise good meal.\n\nAvoid!", "author": "Iago D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Love this place. A small, pretty and colorful restaurant in the middle of Mission District stolen from Puerto Rico. It made me miss my time in San Juan!", "author": "Ugur O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "My husband and I were staying in a near by Airbnb and it just so happened that the owner of El Nuevo Frutilandia was our host and mentioned stopping by during our stay. I am SOOO happy we did! I had never had never had Cuban food prior to this experience, and all I can say is it was an amazing experience! Delicious food/sangria, affordable, and friendly. I ordered the Picadillo a La Havana and my husband got the Cuban sandwich and we shared a craft of sangria with some empanadas (chicken ones were the best). HIGHLY RECOMMENDED!!", "author": "Brittany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "My family & I went to Frutilandia today, I was our first time going here & out experience was amazing! We got there right before they closed but they still welcomed us in and served us food. The hosts Jennifer was so kind & patient with us, she made our experience unforgettable. She also gave us some free desert. The food tasted amazing I had the empanadas! I definitely recommend this place !!!", "author": "Lorena P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "Don't go there exactly when it opens because sometimes they maybe late. The show was on diners, drivins and dives so it has some good food. We weren't impressed with the Cuban sandwich maybe it's the sandwich, just ham, shredded pork and cheese it's a dry sandwich, but the mofongo on the other hands was great. Nice staff and 20%tip is on ticket for parties of 6. Definitely a pricey joint about $$$ or $$$$ for cost. But try other plates you may enjoy.", "author": "Mace S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "This place is amazing.  I went here for the first time back in 2008 and food was not all that great.  Kind of dry, the alcapurrias were oily and it didn't really appeal to my palate.  Fast forward 9 years later, and under new ownership, the place is awesome.  Food is fresh and cooked made to order, the setting is cute and quaint and displays the flags of Cuba and Puerto Rico adjacent to each other.  We ordered the plantains, pollo a la española, pasteles, yucca frita, and they gave us tostones on the house! The service is soooooo warm and inviting.  Food is great! Can't wait to come back to this beautiful gem on 24th street...", "author": "Jill P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "I randomly walked into this place by chance and it was such a good choice. I ordered the garlic shrimp with rice dish and empanadas to start. As soon as we tried the empanadas we ordered another round they were so amazing. At the end of our meal we ordered a sweet empanada as dessert which was covered in condensed milk. This place is amazing and I will definitely make the trip to eat here again!", "author": "Renee R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "They didn't have bread at noon for lunch. Counters were dirty. Place was completely empty despite being on DDD. Looks like the locals know there's a problem.", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "Absolutely terrible. Let me preface this by saying I have never given a 1 star review before but the service and food I received here yesterday warrants this. They had one server for the whole place. I ordered a glass of wine, waited about 30 minutes and never got it. Then I see her giving other people drinks who got there after me so we flag her down and I order two at once, knowing I will probably never see her again. Then I proceed to order my dinner and guess what? She also forgets to put that in! So after I waited about an hour and a half for dinner and I never even ended up getting it! I did get the empanada appetizer at the beginning which was mediocre at best--honestly more fried dough than any filling. I tried some of my friend's dinner (since I never got mine) and it was so bad that I was actually relieved I didn't get mine. I think this place takes the cake for my absolute worst dining experience, ever.", "author": "Catalina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "A while back I spent three months in Miami and got to really appreciate the local cuisine, especially the Cuban restaurants.\nBack home in SF I had not been able to have the same experience until I found this place.\nThe Vaca Frita was as good as anything I had eaten in Miami, and they even offered Mamey milk shake!\nThe restaurant is jointly Cuban and Puerto Rican, so some dishes are a happy mix of both, Puerto Rican rice with Cuban beef, etc.\nI did not try the Mofongo (next time), but the Tres Leches cake was easily among the best I have had anywhere.\nCompared to the Cuban corner places in Miami, the food here is a little more - for lack of better words - cleaned up, lighter, and the portions are more \"reasonable\".\nStaff is very friendly and helpful, restaurant is comfortable, small enough to be cozy, just a little prone to noise maybe.", "author": "Lars A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Our family has always been looking for a restaurant to feed our culture and tonight we found it. I hugely impressed by the owners and how they paid attention to their patrons. The food was magnificent took me back to Puerto Rico. I will definately go again. \nThank you so much from the party if 11.", "author": "Charon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "This is the best food ever!!! A lil pricy but totally worth it. I got the vaca frita as recommended by the waitress and I loved it. The taro chips are super tasty. Wish I had bought a side of them.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Really love this place   You can't go wrong with the yucca frita and lechón asado. Leave room for dessert and have the pastelito de guava   It comes with a passion fruit sorbet. YUM\nI also love the service.  No pretensions and great refills when you need it", "author": "elizabeth t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Best Cuban in San Francisco. Owner is VERY cool and friendly- always smiling and in the restaurant. The restaurant was featured on Diners, Drive-In, and Dives with Guy Fieri. Food came out shocking quick and was VERY GOOD. This may the only good Cuban place in the Bay- trust me, we looked around. Highly recommend!!\n\nEdit: THE TRES LECHE CAKE IS SOOOOOOOOOO GOOD-- MUST TRY!!", "author": "Theo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "My mouth is watering thinking about Frutilandia! I've never really tried Cuban/Puerto Rican food, but I cleared my plate. The place is small and cozy. Service is awesome. Highly recommend if you're in the Mission District.", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "We heard El Nuevo Fruitlandia had good sangrias so we had to check it out.  My husband had the red sangria and I had the white sangria and they were both excellent.  We use to go to Cha Cha Cha for sangria, not any more. El Nuevo Fruitlandia's sangrias were not only excellent, the atmosphere was quaint and had a comfortable vibe.  The ceviche was also very good, it was fresh and savory and sweet with chunks of mangos and fresh fish. \n\nThe prices were reasonable and the service was good and friendly .  We are definitely coming back with friends and family.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Bruh the food so it don't make no damn sense. That Vaca frita tho . Be on point ever time. My lady loves the ropa vaja or whatever. We even ordered a catering sizes once to bring to a party. Great date place and great with a small group. And them appetizers won't let you down so eat the hell up.", "author": "Alterrique I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "I was disappointed with this place. I was so excited when I got my food that looked good. I had order shrimp also served with rice. My dish was so salty and the rice was a half cook.", "author": "Pinarat S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "I came here because I had a craving for fried plaintains, and they did not disappoint. I ordered both the side dish version AND the dessert plaintains. Both were delicious. With a side of sour creme and a splash of Tabasco, the plantanos maduros were a sweet, sour, and spicy delight to my tastbuds. The empanadas de plántano were flaky and paired perfectly w my café cubano. Mmm. Mmm. Mmm", "author": "Jocelyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "I have been coming to this restaurant since I was a young girl it has been in my neighborhood for many years. It had been many years since I had returned. \nI came in today and I was pleasantly surprised to find out that the food is still outstanding. The remodel also was very cool. We enjoyed the service Nick provided, he was very pleasant, knowledgeable and had a charismatic way about him. \nWe had the Cuban sandwich, tasty, but it needed to be pressed more. We also had both of the shrimp dishes offered, both were very good. I had the ropa vieja with arroz con gandules, the beef was on point, however the rice lacked the sofrito taste and salty pork flavor I am accustomed to. We also had the yuca appetizer, which was bland and needed salt. We were pleasantly surprised by the fried plantains, sweet and nicely cooked. \nAll in all I would recommend it and will return to taste the other dishes on the menu.", "author": "IRMA C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "I have to admit, I came here because this restaurant was featured on the Food Network. I have to admit another thing... I had barely eaten all day because of how excited I was to try this place out - and I wanted to leave enough room in my tummy. I left the place happily stuffed!\n\nWas it as good as I hyped it up to be to my boyfriend (based on the show it as featured in)? Yes... and no. Yes, the shrimp dish that I had (the spicy one) was amazing and you must get their Cuban beans. Yes, the yucca fries were a deliciously fried and the pickled cabbage was so good (I asked for extra). No, the plantain empanada's that I was super excited, weren't all that great. Yes, the service was awesome (thank you Raven - hope you got your lashes done by my girl)! \n\nTip: Ask for their spicy aioli - so good! \n\nWill I be back? YES! And I'll have to get a different dessert so that I can update my review to 5 stars. \n\nSide note - I am dying to go to Cuba and the decor and ambiance of this restaurant made me feel like I was in Cuba for the hour that I dined here.", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-11", "description": "What happened?\n\n( have eaten here at least once a year for the past 8 years )\n\nMeh.\n\nHad the beef with red chile sauce and the pork sauteed dish; both in a similar red sauce. How strange! Each dish comes with a pinch of pickled onions and a large scoop of ok tasting rice. $15.95 and $14.95 respectively. Kinda spendy for what you get.\n\nHad to ask for my water to be refilled. Twice in 30 minutes. There were a total of 9 people in the restaurant.\n\nC'mon E N F ! get your game back up!\n\nFYI,  the Cubano sandwich is now $18.00.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "This place was cute. The ceviche mixto was pretty delicious. Came here with a groupon. The one waitress was very nice, welcoming, but seemed kind of flustered. The food was Okay to good. I wouldn't rave about it, but I wouldn't mind coming back here again. Food seemed fresh.\n\nI got the shrimp with Creole camarones (Shrimp with the creole Caribbean sauce). It was good, but kind of salty. My brother got the Wednesday special Pork chop with mango sauce. The pork itself was not bad, but the sauce was AMAZING to me! My brother thought it was okay, so we switched plates :D\n\nBeans were good. Rice was good. Place seemed authentic and quaint.\n\n-1 star for the wait time. Our ceviche came out right away (within 5-10 minutes), but we waited ~45 minutes for our food to come out, which is a little ridiculous considering we were the second table to be seated right as they opened. We also came on a Tuesday once, and they weren't open. We waited 10 minutes past 6PM and I didn't see anyone, no signs, nothing.\n\n-0.5 stars for it being above average food, but not the best I've ever had. 3.5 stars but will round to 4 because this place is cute.", "author": "Josie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Found this place on Yelp purely by chance and decided to come because it was open and we wanted somewhere in the Mission that wasn't crowded and serving Mexican food.\n\nIf Wendy is looking after you tonight, you're gonna have a good time. She's friendly, funny, and attentive, a winning combination in a waitress! Skills possibly honed through her past gig as a bartender. ;) Anyways, if you're having trouble deciding, you should trust her judgment. Vaca Frita vs. Ropa Vieja? Hands down, Vaca Frita, said she. And we couldn't get enough of the crispy, citrusy pieces of steak or savory taro root chips. \n\nWendy's recommendations turned out to be more winning than my fellow Yelpers. I got the much touted Mofongo (with pork) out of curiosity, and while it was interesting, I wouldn't order it again. It was a mush of plantains and pork in garlicky sauce that wasn't evenly seasoned. A dish that struggled for direction and just sort of collapsed into a heap. \n\nThe portions here are pretty small for what you pay, but there are few places to get a clean but authentic Puerto Rican experience such as the one at Frutilandia. The bright interior is sparingly but charmingly decorated in bright colors and a TV plays soundless channels. Somehow, everything just belongs together, like the coffee can turned silverware container on each table. It's a wonderful place for a peaceful meal before a busy night in the Mission!", "author": "Helen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Well, this would be the first 5 that I've given out.  Heard about the place so of course I had to try it.  \n\nBeef Empanadas-very tasty and cooked perfect. The dough was nice light brown color and flaky. Only wish more came with the order. \n\nVaca frita-was tender and delicious. Cooked perfect as well. \n\nLechon-so tender, flavor was awesome\n\nBeans two different ones, both very good. Yummy. \n\nMofungo-good flavor, very good. \n\nTres leche-to die for. Wth. Have to try it. \n\nOkay enough about the food, the waitress was great with great service.", "author": "Will E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-16", "description": "The only reason I came here is because I saw it on tv. There were only 4 people eating here, including my group. Even like this I waited 40 minutes for my food to come out. The table behind me complained about their 2 Cuban sandwiches taking so long. Not only the food is slow, but the servers are also slow and lost. I waited about 8 minutes for someone to bring me a menu, I finally had to go ask for one and the same problem to order the food. My food was too salty and dried. At the end, they expect a minimum of 18% tip. That guy from the tv show bs me. Will never go back", "author": "Jonh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Service was awesome, make sure to get the carafe of red sangria, ropa vieja and ceviche. NEW fave place in the mission. \n\nUpdate: another 5 stars!", "author": "Rob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Ya know there aren't many Puerto Rican's in California compared to New York or Florida. That being said it's even harder to find outstanding Puerto Rican/Cuban cuisine. Well look no further! You'd swear your beloved  Abuela was cooking in the kitchen when you smell and taste the food here. Outstanding food and service. This is my favorite Puerto Rican/Cuban restaurant in the Bay Area. There are others but none has the feeling of home and family quite like this little gem. Outstanding restaurant!", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "What a great neighborhood find!  After seeing a movie that served Cuban food we found this cool spot.  Great inside space, looks like it could be in Little Havana in Cuba. Ropa Vieja, was spiced just right and even has a small but nice wine list.  \n\nA gem...", "author": "George H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Good service & food was great. My friend recommended me to come here. They're prices are affordable.", "author": "Christina V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-04", "description": "shirmp mofongo twas alright you get 2 pieces of shrimp thats it... parada 22 is way better", "author": "Edwin I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "My first time ever arriving to the restaurant, they were turning away customers 2 hours early before closing on a Friday night because they ran out of food. Never heard a restaurant having to close early because they ran out... disappointing and unprofessional.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "I'm not super familiar with Puerto Rican/Cuban food... however the food was impeccable. A perfect hole in the wall, the atmosphere was lovely. It felt like a delicious home cooked meal.", "author": "Ethan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-03", "description": "Being 100 percent Puerto Rican and having been to my share of Cuban/PR food restaurants I have to this say this place just didn't do it for us. My whole family was here, visiting from the East Coast and it left us all disappointed. All food was missing the typical sabor you taste while eating our foods. One could argue that this place is meant to be more fusion and not authentic then I argue, at least cook your rice correctly because the texture was not just different but \"off.\" I could go on and on. Service was meh. Parking was hard to find. We won't be back.", "author": "Melisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Fantastic.\n\nBeen here twice now and I know I'll be having cravings.\n\nWhat go get:\nPork mofongo \nAny of the entrees although I'm partial to the spicy Camarrones creole\nFlan!!! Done so right \n\nYou can get Spanish style rice for extra. \n\nIf you're looking for authentic Cuban/Puerto Rican food, this is it. Definitely bringing friends here in the future.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "I'm a daughter of Cuban refugees who grew up in Miami and now lives in San Francisco. I wish someone had prepared me for the fact that great Cuban food would be ridiculously hard to come by in this otherwise incredibly international city. I'm talking real, solid Cuban food that tastes just like the stuff I grew up with and not a weird fusion.\n\nAnd that's exactly why El Nuevo Frutilanda is such a treasure. It is one of the *very few* places in San Francisco where I can get my all-time favorite Cuban dish, vaca frita (literally \"fried cow\"), and it's absolutely outstanding here! \n\nIf you've never tasted vaca frita, you're missing out. Shredded, tender garlicy-lime-marinated skirt steak that's been fried until crispy like bacon (mmmm!), served with carmelized onions, rice, and perfectly seasoned black beans. ¡Riquissimo! as my mom would say. One bite and you'll want to start a revolution. ;-)\n\nNot only that, but Frutilandia serves something from my childhood that's even rarer -- mamey smoothies. Not familiar with mamey? Wondering what it tastes like? There's no way I could compare to anything because it's probably a flavor unlike any you've ever had. Just order it, live a little. It is one of the most delectable fruit flavors out there. Frutilandia's version of it is slightly watered down compared to the way my mom made it, but it is so refreshing on a warm day anyway. You won't find this kind of smoothie at any project juice or any Mexican restaurant. In fact, this might be the only place in town that serves them.\n\nI realize that going on and on about foods from my childhood might not necessarily appeal to most Yelpers out there who didn't grow up Cuban, but I really don't think it's just the nostalgia talking. Cuban food is practically designed to comfort and nourish you. El Nuevo Frutilandia captures this so well, I hope they stay in business through the ages. And if the owners are reading, I recommend that you guys market/advertise your Cuban offerings much more openly, especially now that U.S. trips to Cuba are opening up!", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Amazing food; perfectly seasoned entrees,  just like on the island, drink was perfect and dessert was delightful. \nAwesome service; our waiter was polite,  knowledgeable and quick. \nGreat music; classic salsa, bugaloo, bomba, and plena.  \n\nWas extremely satisfied.", "author": "Damian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "We stopped here before attending a reggaeton concert at Roccapulco and had a really nice time! The ceviche was very tender and tasty, and the fried yucca was a new discovery that we enjoyed. I also really liked the sangria. The best part of the visit was talking with the owners, who are wonderfully friendly and entertaining. We had traveled to Cuba a month before going to Fruitilandia, and had a great time talking to them about Cuba and the Caribbean. I'd go here again and would recommend Fruitilandia to others!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "I've never eaten like that different taste of food. It's extremely good. I'm waiting to go again.", "author": "Ayca Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-21", "description": "I had the chicken dish which was not great: the chicken was dry and the sauce was basic. It cost 15$ at lunch and the portion was quite small. The decor of this place is super nice and the service was good. However, I would not eat here again", "author": "Adar G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-31", "description": "Service was good and so was the food.  Nothing crazy good that I would cross the Bay Bridge for.\n\nHad the veggie mofongo which was tasty and the lemon garlic shrimp.  The shrimp was good and cooked well, but it tasted more like Italian fare than Puerto Rican/Cuban.  Portion was small.  Had the platanos maduros which were great, but $6.50 for 6 pieces was a bit much to charge for such a small side.", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Great Cuban food and great service with nice ambiance. Really glad I tried this and I would recommend the vaca fritta but missing a star because I think this dish is missing a sauce that would make it unbelievable. Shrimp and apps were great but the remoulade sauce was uninspired. I'll be back for sure as overall it was great!", "author": "Shariq H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Awesome food and fabulous service! Great ambiance!\n\nWill certainly dine here again.!!", "author": "Jay J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Friendly employees who make you feel so well take care of! Try the empanadas- they're so delicious I would order like 3 plates of them to make one giant meal!", "author": "Kara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Traditional Cuban and Puerto Rican food with fast service. Friendly staff is welcoming. We loved the chicken empanadas, the beef are great too. Owner sat and chatted with us after our meal, and made us feel very welcome.  We are never disappointed with the amazing food, sangria, dessert and, especially, the service.", "author": "Margaret P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "The first time we came here we really enjoyed the food.  The staff was very nice and attentive.  The 2nd time we came here the food was excellent again.  Every dish we had was really good and the Tres Leche is so yummy.  We ordered both types of Sangria ( Guava/white wine) & ( Mango/red wine).  We will definitely be back.", "author": "Alett B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Loved this place!  We have walked past this little gem in the mission, many many times and finally went in after all the good reviews from Yelp!  Well! we should have gone in long ago, because it was a FANTASTIC FIND!  Its a small, homey, space that is very inviting and the staff is very friendly!  We went with our two little children, and all of the Empanadas (chicken, Beef, and the desert Plantain one) were very good.  The black beans and rice are flavored to perfection and if I closed my eyes, I felt like was back in Miami with my family!  We will be back, to try the Ropa Viella and the Cuban Sandwich (which we called Media Noche' in Miami) .  Fantastic place, perfect location, great food and friendly staff.....what else can you ask for?", "author": "M. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "I'm giving this 5 stars because of flavor.\n\nThis is the best PR/Cuban food (Cuba Rican) food I've had away from Miami.\n\nIn NY I found PR food but no real Cuban food, so finding this in SF felt like pure luck.\n\nThe mofongo and pork were moist and flavorful.\n\nThe yucca was good (not dry, not dripping in oil), and the garlic sauce was almost looe my grandma makes it!\n\nWant to try more, but I imagine the sofrito and ropa vieja will be beautiful since the mofongo has a little sofrito on top (sin carne).\n\nDefinitely go here!\nOnly down side: average portions (not large, not tiny) and on the low end of pricey (I usually go to places where main dishes are $8-15 rather than $14-19.", "author": "Ellie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Sometimes I like to keep my favorite places a secret in hopes that I can get a table without waiting in line (sneaky, I know). I went in a couple nights ago and lo and behold I found out the secret is about to be OUTED on Diners, Drive-Ins and Dives! \n\nThings are about to get crazy--I'm going to have to eat here every week for the next month just to prepare myself for the hoards of people that will be lining up. \n\nThe food is off the hook and there's no other place like it. Take Cuban deliciousness and mix it with lick-your-chops Puerto Rican dishes and you have something really special. I'm so happy for everyone there and I hope you read this and love me enough to sneak me in the back door for a table every once in a while : )\n\nCongrats and well-deserved!", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "The service was great, the server was very attentive. Food was ready in a flash. Only drawback was the pricing it felt a little pricey. If you check in for your first visit you get a 10% discount. A plus but most likely won't come back due to the price. My wife ordered a ceviche, she said it was good. I ordered the chile relleno, also good. The mofongo felt a little dry. Let's keep in mind, I'm not well versed with Caribbean food. So I dont think my opinion on the tastyness of the food is valid but, I did enjoy my meal.", "author": "Fredy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "This place is soooo good and great service!!!! Clean and great place to eat. The guava sangria was pretty good! I had the picadillo and it was awesome. And did I say the service was amazing? They're super nice, love the waitresses.", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Wonderful place to eat authentic Puerto Rican food. The staff is friendly and totally love the salsa music in the background. Charming place that you all should definitely visit in the mission. You must try the vaca frita, alcapurria's, empanadas de platano maduro. Happy eating.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "This is probably my favorite place so far that offers amazing yucca frita and sweet plantains. Also their sangria is really good.", "author": "Celeste D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-23", "description": "So we'd come back since 2012, and things had taken a turn for the better. But revisiting tonight showed that once again, things are worse - and worse than ever, sadly. We noticed that the menus have changed - there's no more soup, unfortunately. The alcapurrias were a disturbing orange color (more than just too much annatto) and frankly weren't worth eating. The ropa vieja flavor was heavily dominated by green peppers, was tough, and the sauce was too runny. The cuban sandwich was fine though!\n\nFurthermore, the service was pretty paltry too. We were quizzed about if we were willing to pay the $1.25 for pink beans instead of black when we'd asked for the former (this at a restaurant where the alcalpurrias are now $9!), and when we confirmed we wanted the pink beans and were fine to pay for them, black beans were still brought to our table - and when the situation was remedied, the beans themselves tasted terribly burned! Our \"appetizer\" arrived by the time we had almost finished our entrees. We asked if the platanos could be cooked without the butter, and were told this was impossible - too bad, since they have accommodated that request before. We were pretty sad to see what's going on here.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Great spot! \nSo they have great happy hour deals on tapas and drinks (Wed thru Fri 5pm-7pm & sun 4pm-7pm) and THE BEST SANGRIA. I don't even like white wine and they make a guava white wine sangria and a mango red wine one, which are both to die for. \n\nAs for food, it's a fusion of Cuban and Puerto Rican food. Very good empanadas, ceviche, shrimp dishes with different marinades of rice (as well as chicken, steaks, and pork in same manner), lots of bean sides, and yucca and plantains galore! The empanadas come with a great sauce!! Good portion sizes too and fun, local vibe. My friend spoke highly of the Cubano Sandwich. \n\nGuy Fieri filmed here for Food Network and they are super modest about it, which is cool because I'd brag about my restaurant being on TV. \n\nTotal great date/group place and be ready to share because food envy gets real here.", "author": "Emily R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "Tried this restaurant for the first time tonight and really enjoyed our dinner.  I ordred the Chile Relleno and my brother had the Cuban sandwich. My Chile Relleno was made with a big fresh pepper, filled with cheese and accompanied with a flavorful sauce and rice.  My brother said his sandwich was also very good....  Definitely will be back, but will be torn between getting the Relleno again, or trying something different!", "author": "Frances B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "We had the best service! Miguel was delightful, speedy, efficient and knows his stuff as he helped us with what was best on the menu. We ordered Lechon (which was great) nice and flavorful, and shrimp mofongo which was not a disappointment! We left full and satisfied, absolutely coming back!", "author": "Angelica V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Amazing food! Service was great and personable. Food tasted delicious. Very intimate place. Love it", "author": "Lolo P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-22", "description": "The food was pretty good. I've been craving mofongo, alcapurrias (although a bit overcooked and hard, they were still delicious), and a real deal Cuban Sandwich for quite some time now. I've had pretty bad luck with Cuban Sandwiches lately in the Bay Area. The last one had arugula and tomatoes and no Swiss. It was a hipster ABOMINATION. Cuban Sandwiches are absolute perfection and the ingredients should NEVER EVER be altered. The only thing that should vary is the amount of love one puts in em. And not the amount of arugula like Habanas in Alameda. Yuck!\nWe did have to wait 10 minutes to be seen when we sat down. The young waitress, seemed to be a bit distracted by some young bucks sitting at the bar. She did, however help us a lot after our 10 min wait. The co-owner was super helpful and nice as well. \nWe're from the East Coast and my wife is Boricua, so we know what to look for.\n\nThe mofongo was delicious, but they brought us 3 very, very little shrimp with garlic sauce to add. The cuban sandwich was good, but a bit salty.\n\nHad to drop my review by 2 stars because the restaurant was closed when we showed up at 6 pm on a Wednesday for dinner. Drove all the way from Oakland took 30 mins to find parking and BAM CLOSED for no apparent reason. Sign on the door stated \"Open.\"\n\nStay thirsty my friends", "author": "Themane D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "This is a cute hole-in-the-wall spot for some Cuban fare. I enjoyed my food but didn't love it; then again, I don't think I generally love Cuban food. Our server wasn't completely reliable for a casual meal it's not a huge deal. \n\nTHE WAIT: None on a Thursday night at about 7:30pm.\n\nTHE SERVICE: Not amazing. When our server first came around, she asked me three times in one conversation if I wanted a drink. Either she really wanted me to order a drink, or she legitimately forgot. She would forget little things--for example, she brought our Mofongo out and said she'd bring share plates but never did. \n\nCOST: $68 total for 2 drinks, 1 app, 2 entrees, 1 dessert. A little pricey for the quality. Our dinner receipt: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#jsa9v2WGbdsloXiu0HJg_Q\n\nMUST-HAVES: Tres Leches! The Mofongo was pretty good too.\n\nOut of Ceviche Mixto.\n\nTAPAS, SANDWICHES, DAILY SPECIALS: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#AmMGmTKSA9KMKYDcDCLp5A\n* Mofongo (garlic mashed plantains filled w/ our \"Signature\" roasted pork, topped w/ a tomato sofrito $10) - 4 stars\npic: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#dSuEbtPP887h3bE4-_RRiQ\ncross-section: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#jf6UgPeC9TJKuiTVsW2DLg\npork filling: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#qqrslAHkj0NxfUjCvLcrXQ\nNormally I'm not overly impressed with mashed plantains, but the fact that this was filled with this tasty roasted pork, the plantains had soaked up the meaty flavor, and the pork had soaked up all these great flavors, made this really unique and tasty!\n\n\nSALADS, ENTREES (pt. 1): http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#7z7dSx5OhmVq7libj_0C_w\n* Lechon Horneado (succulent slow roast pork marinated in garlic, pineapple, Caribbean spices $14) - 3.5 stars\npic: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#-jA4oaVrkuxWf5FcYfflsA\nVery juicy, tender pork. For this cut of meat, it's still a little on the dry side. Compared to my pork chops, this was much more moist. It's drenched in sauce, but biting through a thick chunk of meat, you do get to the dryer (though still soft) meat in the middle. Just me being picky. Rice & black beans were good.\n\n\nENTREES (pt. 2), SANGRIA: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#N3MQSz_pOTi4bB1_t4mniQ\n* Chuletas de Cerdo Fritas (pork chops spiced w/ garlic & mango sauce, topped w/ sauteed onions $14) - 3 stars\npic: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#6hlk7Zo3gw5cQfxC1n3ibg\nI was intrigued by the mango sauce, but couldn't taste this at all in the end. This ended up being a very basic pork chop dish, nothing too special. Came with rice & black beans.\n\n* Guava Sangria (white wine, guava $6.50) - 3.5 stars\npic: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#hBXdP8R1BC4DPL6I4LnHjA\nLight flavor-wise, like a tropical sangria. My boyfriend got a glass of this and moved to the Mango Sangria, which basically tasted like a red sangria.\n\nMango Sangria\n\nSWEET TREATS: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#nY5oZV87SJF1MUdHPKlSog\n* Tres Leches Cake (sponge cake soaked in evaporated milk, condensed milk & heavy cream, topped w/ cream cheese frosting $7) - 4.5 stars\npic: http://www.yelp.com/biz_photos/el-nuevo-frutilandia-san-francisco?select=7z7dSx5OhmVq7libj_0C_w#bpTQFcVHPgRVu6w1u1pOsQ\nWow, that was a *thick* layer of cream cheese frosting on top! I love my sweets but that was a little too intense. However, on the cake--I've been on the hunt for an amazing tres leches in SF and I think I've found my holy grail. This was intensely soft, moist, and heaven in our mouths.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "My  experience at Frutilandia, was a bit of a disappointment. Being myself from Cuba, I expected the food to be as good as I have had in restaurants in Miami . We had for appetizers tostones they where typical, the fried yucca; fried as if you where eating french fries with a mojo that was very bland. The mofongo was good for it being Puerto Rican. My Son had the vaca frita and that was delicious! The rest of us had the Cuban pork. It was tender but had no flavor of the common garlic/ cumin mojo as typically expected in chunks of pork at a Cuban restaurant. In fact it had the flavor of what you would expect carnitas to taste at a Mexican restaurant. We also ordered fried plantains on the side, unfortunately they where so chard/ black they where not edible. Unfortunately they made no attempt to rectify the situation, so I merely told our nice waitress not to charge us for that and they didn't. It does make me sad for me to say I will not eat here again.\nGood luck, hope this helps?", "author": "D F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-14", "description": "The food was actually pretty good, at least the lemon garlic shrimp was.  The portion was small, the price was fairly large and they charged an extra $2 for a crushed piece  of bread.  But the main thing was that the place was so extremely loud that we ate a main course and got out of there for the sake of our ears. Service was iffy.  All in all, too bad, I wanted to have a pleasant meal.  It wasn't.", "author": "B W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Hands down, one of the best PRican/Cuban restaurants in SF! Better than Sol and Havana Cuba.  The food was delicious and bursting with flavor! We ordered a little bit of everything. The pork mofongo was to die for.  Soooo much flavor! The chicken empanadas.  Wow.  The ceviche? Yum! We ordered lechon (so tender and loaded with flavor), ropa vieja (the sauce tasty) and shrimp platter, which came with arroz con gandules and habichuelas.  Soooo delicious.  I just can't say enough about this place.  It's a little hole in the wall on the Mission, with beautiful decor of PR and my favorite salsa music playing in the background.  Very friendly and welcoming staff (I can't remember her name) but she took the time to chat with us for a while and getting to know us.  Never have I experienced such attention.  My only disappointment was they ran out of pasteles (my favorite) and flan.  No worries.  I'll be back!  You will not be disappointed!", "author": "Marilyn O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "It's so hard to find Cuban/PR cuisine on this coast, I'm glad i can turn to El Nuevo Frutilandia when I'm feeling like some home cooking. I hadn't been here in a minute, but happily stumbled on it after celebrating Day of the Dead. \n\nOur table of three especially loved the sangria (great deal by the carafe), the creamy, savory beans, and the unbelievably tender pork loin. Prices are moderate for San Francisco. Bonus: the service is super friendly; the owner and his wife are total sweethearts!", "author": "Felicia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "Even though there has been a cafe of one kind or another in this space for over three decades, it wasn't until I passed by during the recent Sunday Streets event that I happen to notice there are new owners who now serve Cuban and Puerto Rican cuisine. That's great news in a city seriously bereft of it. There's Paladar on Kearny, but they don't serve hot food after 3PM. There's Chan Chan west of the Castro - which I've never tried - but am a bit wary because of their constant Groupon deals. There was Charanga in the Mission and Laurel's in Hayes Valley, but both quietly closed. I didn't realize I missed them until they were gone. Gee, I sound like Joni Mitchell. Cuban, when done wrong, can get pretty greasy, a calorific nightmare, but when done right, I've liked it a lot like at the late, lamented Charanga.\n\nMaybe Cuban food is too rarefied to catch on here, but owners Rafael and Tyrisha Frias and their chef Gary Millar are certainly putting their best foot forward in this space. From my recent solo dining experience there, the results are promising. I started with a house specialty, the $4.50 small bowl of Chicken Soup (Sopa de Pollo) which was definitely chock full of vegetables, a bit disintegrated from probably being in the pot for a while. There was also a tad too much oil in the broth since I noticed bubbles, but the soup was hot and flavorful with plenty of shards of chicken to satisfy and pepper sauce on the side for an optional extra kick (see photo). For my entree, I happened to be there on a Wednesday, so I took advantage of the daily special, the $12.25 Arroz con Pollo.\n\nThat was a nice plate of chicken pieces cooked with sauteed peppers and onions, and lots of spices. The saffron rice, which I assumed was cooked with the chicken, was especially delicious when mixed with the black beans (see photo). Satisfying home cooking for sure, although I was hoping the chicken parts were a bit bigger than they were, just my preference. It's a nice casual place, sadly not that busy, and the owners are quite friendly. Rafael is from Mexico, but he, his wife and Millar appear to have a sure hand in preparing and presenting these dishes. The $5 Yelp deal was definitely a good move, though they may want to up the amount like Arabian Nights does if they want to bring in more new business. Some trova musicians could liven the place up, too. I'll be back when I feel like a touch of Habana in my soul.\n\nFOOD - 4 stars...solid home cooking, Cuban style, just needs a tad more refinement\nAMBIANCE - 3.5 stars...pretty low key, maybe a bit more music from the Buena Vista Social Club could help\nSERVICE - 4.5 stars...really friendly and attentive\nTOTAL - 4 stars...I liked it and I think Ricky Ricardo would, too", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Well lucky was on my side bevause i was able to be seated right away. I only ordered tapas and a caraf of sangria(which was sooooo good). Their tapas were  small portions, but packed with great flavor! I'm still dreaming about their flan and tres leche cake. I will definitely return and try their entrees menu. You can't go wrong with delicious food and great service.", "author": "elena g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Jasmine is a shining star. Coolest waitress ever. Keep your eyes peeled cause this little gem is easy to miss, but once you're inside the food is delicious, and very reasonably priced. The service was impeccable. The atmosphere is great too, some good tunes in the background, well decorated. You can't go wrong with this place!", "author": "Alex A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "The shrimp mofongo is fantastic. Good selection of beers. Very reasonable prices. Our server Jasmine was fun and took great care of our table. We would definitely come back!\n\nNot very crowded or noisy which is a plus. But great ambiance and nice Cuban music.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "For a Cuban living in Santa Cruz the trip to the city for this was way worth it.  Had some tostones and yuca frita. Both were great. Finished off with a Vaca Frita with white rice and black beans that brought back some memories of Miami. It's a small location but highly recommend it to all.", "author": "Ruben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "I travel to San Francisco quite a bit for work and I am always looking for new places to try.  I went to this place for the first time two weeks ago because I was in the mood for Cuban.  It's in the Mission/Latin Cultural District.  The staff and the owner were so welcoming and friendly it was like visiting friends.  It is by no means a big or fancy place but the food was solid.  I had the yucca and veggie empanada as starters.  I love yucca and it's hard to find a restaurant that gets it right.  The yucca here was perfectly fried and came with a nice sauce for dipping.  The empanada was also tasty and the crust was near perfection. It also came with a good sauce. I mixed it with the yucca sauce and the combo of the two was even better.  I split the ropa vieja with my dining companion. It was well cooked and with a little hot sauce spritz quite tasty.  Oh and don't pass on the sangria. I liked it because it was a nice fruity compliment to the food and not too much for me since I don't frequently drink.  I definitely plan to eat here again on my next trip to SF.", "author": "Oni B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "The mofongo was excellent. Only wish I had more room to try all their great plates. Small little place that paks a punch with the best type food in the bay area. WOW and at very reasonable prices", "author": "AL P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Came on a Saturday for lunch. Atmosphere was casual and relaxed. Our waitress/hostess was very polite, but the relaxed atmosphere infiltrated the wait time on our food. We ordered the Cubanos and a side of baked beans. The Cubanos was good, buuutt a bit on the salty side. The ham was already salty and then to add a pickle threw it way over the top. The chips that the sandwich came with were very good...And so we're the beans. I would definitely come back (and have a big glass of water to go with it) but I won't be running back.", "author": "Kris Marie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-06", "description": "WORST Service EVER!! It took 45min for my Plantains to come...another 15 minutes for the main dishes..Seriously an hour to serve 3 items.. 1 dish, Cuban Sandwich, and Bananas...  \n\nI expressed my concerns with the owner and in response she said \"Well you walked in and saw all these people sitting\" Seriously..thats an owners response? Wow!! there was a good 15 people..and a few empty seats..and ok..since they are\"so\" busy..  obviously they can not handle their client load. \n\nMy response \"I understand, BUT.. if you knew you were behind and OVERWHELMED..you should NOTIFY the customer, had I known Id be waiting damn near an hour  for a skimpy $16 shrimp dish, bland cuban sandwich and bananas, I would have taken my businesses  elsewhere\" yet...she wanted to debate and again make it out to be my fault since I walked in to people already sitting there..waiting\n\nWhat an experience..and Yes...I did say 45 min wait for platanos without the crema..SMH!! I will NEVER go here again!!", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Great little find in the Mission for great Cuban food! Friendly service, great vibe and very clean!", "author": "Garret M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "Service is slow, server did not greet our table or take our order until 15+ minutes later. I went on a Sunday there was hardly anybody in the restaurant. The mofongo is awesome, chicken empanadas is crispy with a light dressing on the side. The arroz condule rice is dry.", "author": "Arasi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Ignore the overall low star score! I don't review on Yelp often, but when I saw my favorite Cuban restaurant wasn't at 5 stars (or even 4) on here, I had to speak up! \n\nRidiculously good, fresh and authentic Cuban food. I've been coming to this secret Mission gem for years; now that they've changed management and menu, it's even better. I have the garlic and lemon shrimp every time. Perfection!", "author": "L E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Must have mofongo! Exceptional, tender pieces of pork underneath it all, just the right hint of garlic, I was throughly satisfied, quite comparable to the mofongo on the island! Staff was attentive and friendly, and Rafael and Jorge were kind enough to let me see how the magic is all done \"All you gotta do is ask!\" Warm and friendly, colorful environment, reminded me of Puerto Rican hospitality", "author": "Oscar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Very good food. Mofongo is more than recommended, as well as plantain chips (just make sure they're not included in your main dish as a side, we didn't know so basically we had them twice). The only negative thing is that the portions are too small for their prices.\n\nThe service was amazing, both the waitresses were unbelievably kind.\n\nNote: we went there on a Friday with a groupon, but they don't accept it that day of the week...", "author": "Xavier R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "I feel like there is a dearth of Cuban restaurants in the neighborhood, so was interested to give this a try.\n\nEverything was delicious and definitely recommend getting the sangria to go with.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "Loved this place! My first Cuban food and I'm super impressed!! :)\n\nIt is a little restaurant with super yummy food!!\n\nThe service is good too. \n\nI wish I could write more but I don't know any of the food names I ate haha but everything is awesome! I tried a lot of different things. :)", "author": "Peach K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "I have always loved this place.  It is totally laid back.  Nothing fancy, no pretensions, just nice people and great food.   This place is totally my style so I am biased.  I am not the new look that is destroying the Mission.  All the new restaurants are trying to be all upscale with small, expensive plates and reclaimed wood siding.  El Nuevo Fruitlandia is no frills, straight forward great food, great service, and good prices.  I hope that this place survives the gentrification of the Mission.", "author": "Christopher A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Amazing food. Reminded me of my visit to Puerto Rico. The staff was so courteous, ambiance is great, food is delectable. Highly recommend the lechon horneado. I wish this place was closer to my hometown so I could  eat here more frequently.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "Authentic Cuban food. One of the best meals I've ever had. So many subtle flavors. Every dish is mind blowing. Loved it.\n\nTry the Mofongo. So good.", "author": "Harrison K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "This is one of my favorite places to eat at when I visit the Bay area.  They make excellent Mofongo which is very hard to find.  The owners are very friendly and told me they are locals to the neighborhood.  The food is so good, Guy Fieri even highlighted them on his Food Network show.  I HIGHLY recommend them.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "In south San Francisco for business, I ventured to explore what the city has to offer. I walked by Frutilandia as I was checking out 24th street restaurants. Checked out their menu and they had me at sangria y platanos maduros (plantains). Ordered ropa vieja after my red sangria. Sangria is delicious. I could have had maybe 2 more after my third one. Ropa vieja was very good accompanied with my fried platanos. Yum! The owner Rafeal introduced himself & made me feel more welcome in his restaurants. It was like being at a friends house. This place is worth checking out because I'm definitely going to frequent when in the city. Hasta pronto Rafa!", "author": "Ozzy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-27", "description": "I called in a pick up order around 8pm. When I got home I saw that they added cheese to my salad when I requested no cheese and they forgot one of my main dishes and they changed me for it. I kept calling during business hours but they didn't answer. I will be calling again in the morning but only for a refund. The food was no where near as good as Los Cubanos in San Jose. Bad service. Mediocre food.", "author": "R. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "I found this in Yelp... And Awesome service and great food, definitely a plus. I felt \"Home\". Also 10 % off my tab... Nice!!!!", "author": "Ernesto S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "My boyfriend and I were always passing this place so I jumped on the Groupon deal they had! Came for lunch and we were super disappointed their lasagna special was taken off the menu! They apparently had just revamped their menus and took it off. Total bummer since thats what we were most looking forward to!\n\nWe ended up getting the vegetarian mofongo and he got this spicy shrimp dish. Both came with black beans and rice. The rice was surprisingly seasoned but the beans weren't! I usually like beans but I thought theirs tasted awful so my boyfriend ate all of them. \n\nThe mofongo was a delicious! I ate the whole thing and the portion was huge! You HAVE to try it with their house made sauce. It totally makes the dish! One odd thing was the mofongo was different temperatures all around making me think it was reheated in the microwave or something. The shrimp on the other hand came piping hot with a really tasty sauce! \n\nService was super nice and the decor is super cute!!! I felt like I was on vacation or something haha. Definitely fun to try out a place we've been curious about but will not return to.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "They were featured on Food network and wanted to try their food for awhile. I finally did and ordered mofongo w/ pork and salad with guava sauce for take-out. While waiting, ordered a guanabana drink. All great tasting, will definitely come back here again.", "author": "Miel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Veryyyyy gooooood food must go. Especially if u want some old fashion tropical Latin food.", "author": "Nubia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "I saw this restaurant featured on Guy Fieri's show, so I thought I'd take a chance and order the ropa vieja. I was not disappointed: it lived up to to its excellent reviews and exceeded all expectations. I wanted another serving when I was finished. The inside of the restaurant is very welcoming, the female owner greeted me with a big smile, and the music playing in the background makes this the perfect place for lunch, dinner, brunch, whatever. These are good people serving excellent home-cooked Cuban/Puerto Rican food. You will not leave hungry.", "author": "Maurice R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Bought a Groupon for this place. Pretty good food, I enjoyed. I got the mofongo, ceviche and my sister got the chicken.. we also ordered the white sangria which was amazingggg! Small restaurant, had the Salsa music going and the ladies were attentive. We sat at the bar, so it was nice. I def plan to go back.", "author": "Katherine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "I've only had Puerto Rican food in the Bay Area and Miami, and out of all the local restaurants, this one is the most legit. I've never seen it on the Food Network or Check Please, or written up in the Chronicle, and perhaps that's why it's so charming. This is a small restaurant that is easy to miss as you look for parking! \n\nThe food is amazing. It's beautiful without being too structured. Very good portion sizes and authentic flavor. The prices are a good value. I'm not exactly thrilled by the daily specials, because I always want a special that isn't offered on the day I choose to come here! But hey, that's not their fault. \n\nThe decor feels home-y and the ambiance is warm and inviting, though not quiet if that's what you're looking for. I'm so glad that after all these years, I can still rely on great Puerto Rican food in my hometown. It's hard to find a fellow Puerto Rican out here, let alone a restaurant serving our food!", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-14", "description": "So my cousins and I came here thanks to a groupon offer. \n\nPros:\nThe batidos (milkshakes) are delicious\nThe bistec empanisado is delicious\nCute restaurant\nThe music makes me want to dance \n\nCons:\nWe waited a long time ... only cause the joint is understaffed. However, the service was very friendly! So half con.\nThe beans...sigh. I'm cuban, I like my beans to be spicy and delicious like they should be. Pero, no go.\nIt's more Puerto Rican than Cuban. Enough said\n\nOverall, check it out! :) ...I'm probably biased since I'm cuban.", "author": "Carina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "My girlfriend wanted me to try some puerto rican/ cuban food so we decided to come here since we were in the area.\n\nIt was a sunday night after 8, but they still let us come in.\n\nIt took us a while to decide and I ended up ordering the vegetarian mofongo and she ordered chicken empanadas, arroz con gandules, and platanos maduros. We ordered the mate soda and finished off with café con leche.\n\nConsidering I am vegetarian I could only try the platanos and they were pretty good. But let me tell you...I eat A LOT of food and the vegetarian mofongo has been the best thing I have eaten so far! I have never tried this dish before and it blew my mind. The vegetable filled mashed fried plaintain dish was topped with this creamy garlic sauce and served with white rice and beans. The crispy/crunchy/ soft combination of textures of the mofongo and the burst of flavor from the sauce gave me a mouthgasm. Even the rice tasted fantastic and was textured perfectly.\n\nThe service was phenomenal. The owner came over to chat and was super friendly! He gave us some background information on the restaurant and explained to us the food we ordered. The waitress was friendly, patient, and helpful with us ordering.\n\nHands down the best food and service I have experienced. I will be coming back here again for sure!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-25", "description": "The beans did not have any flavor,  the pernil was ok, but did not have that authentic Puerto Rican flavor.\nThe tostones were decent. \n\nThe alcapurrias were burned, but still tasted ok, but why would you serve your customers burnt food,\n\nI ate at this restaurant a few years ago and the food was a lot better. \n\nI was very disappointed,  I spent over $100 and threw away most of the food (ordered the food to go).", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "This spot is a must to visit when you're around the Mission.\nThe Cubano sandwich with extra mustard will be forever my favorite... or is it the Alcapurrias... or maybe the Ropa Vieja, I JUST LOVE IT ALL!! \n\nWhen my boyfriend and I go here.. he always has to order a Sangria.\nThis place is awesome for a modern mom and pop type of restaurant.", "author": "Chelsey B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-25", "description": "Sorry to report: El Nuevo Frutilandia is not even mediocre food at best.  \n\nUnfortunately,  I struggled giving this spot 2 stars. Came here for dinner on 11-25-12; I ordered the Puerto Rico sandwich which was bland and they skimped me on the steak meat (see pics). Also, the fries that came with the my meal were loaded with so much grease they shined.\n\nMy wife ordered the Spinach empanada con queso (1 of 3 veggie options). Ten minutes into our wait, our server informs us they are out of empanadas- grrr.  The server then recommended the only other vegetarian options which were the chili relleno or mofongo vegetariano. Since my toddler son was sharing the plate we opted with the mofongo vegetariano (consisting of plaintains, rice, beans). \n\nMy sandwich came soon after we got my wife's order straightened out which left me in a small dilemna.  Either let my food get cold waiting for my wife's meal or chow down in front of her. Our server saw my hesitation and informed me that I should eat since her meal would be a while. \n\nAs I am munching down on my Puerto Rico sandwich, I realize my sandwich looks nothing like the pics on Yelp and how terrible it tastes. With each bite of my sandwich I taste more bread and lettuce than any meat.  Where is all the savory meat? Did they run out of this also? I decide to take inventory, so I open my sandwich to reveal less than six strips of steak meat (see pic). and for over $10. Verdict: F-\n\nThe second entree (mofongo vegetariano) eventually arrives and that also is not met with satisfaction-- not much flavor, small portions.  \n\nBut a huge plus is in order for the house made sangria (white wine) which I was looking forward to (1st star).  However I was craving a red wine sangria but the white wine sangria was pretty awesome served mixed with apple, orange, lemon slices, etc (see pic). But at $6 a glass... well let's just say, they can do better. \n\nSpace is tight in this restaurant.  My little boy wouldn't sit still and without the availability of a high chair (the only other one was occupied), he had to eat on our lap during dinner.  Tip: Be prepared to wait.  Usually, I am pretty patient when it comes to wait times, but I did observe the couple next to us grow frustrated from the wait, and finally they paid and left without the food they ordered. \n\nIn terms of ambiance/vibe, there was Latin music playing, but with all the yelling and clamor from within the kitchen and amongst staff, it made it hard to have a conversation at the dinner table.\n\nMaybe I came on an off night, but with so many choices in the area, I cannot see myself returning or recommending this spot.\n \nThe deal (2nd star): Used a groupon deal I purchased for $20 that got me two sangria drinks and two entrees.  \n\n(+) Latin music playing\n(-) long wait for dinner\n(-) cramped restaurant\n(-) limited veggie options\n(- -) My Puerto Rico Sandwich was a huge disappointment.  It lacked meat and flavor (see pics).", "author": "Denis A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "My roommate and I came here around 9 PM on a Saturday night (they close at 10 on sat) and about 1/3rd of the restaurant was full. It's a little hidden gem off of 24th that I've had bookmarked for a while and I'm so glad we finally went. \n The ambiance is very San Juan and colorful, the whole place is really cute. I'm vegetarian, and everything on the menu sounded amazing to me. Puerto Rican restaurants hardly offer vegetarian dishes, and this place had tons of options. I ordered the mofongo vegetariano, plaintanos meduros, and a side of white rice and black beans. My roommate had the buttermilk chicken and ate ever last bite. All of the portions are decent sized and the plates are put together beautifully. \nThe food was amazing. 10000 times better than any other Puerto Rican restaurants in the Bay Area (except for a certain sol food in San Rafael). The service was meh, but the food trumped all. We ate every last bite. \nAfter we paid, the chef came out to our table to introduce himself and ask how we liked the food. He said to ask for anything vegetarian next time and he'll do it (;", "author": "Emma G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "I had the Saturday daily special and the food did not live up to the hype. The food was over priced with very small portions. I did not like my rice or my chicken. I ordered from Yelp so I did not have much interaction with the staff. I would not return to this establishment.", "author": "Dee F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "My first-ever visit, 1:30pm Saturday lunchtime. Prompt, friendly service, from start to finish. Still, the food was the real star of this experience. Even my own homemade-from-scratch chicken soup can't hold a candle to their delicious chicken soup. It really is a don't-miss.\n\nI was tempted by the Saturday special, but decided to risk fish, which is so hard to get right and so easy to get wrong. Am I glad I went for it! I ordered Filete De Pargo-- red snapper fillet sauteed in olive oil, garlic, lemon and parsley.  It was the best fish dish I've had in years; delicate, moist, skinless, perfect done-ness. The olive oil, garlic, lemon and parsley were so subtle as to allow the fresh fish itself to shine. Yum. \n\nIt came with a large-ish plate of al dente black beans and steamed white rice, again allowed to shine in subtlety and simplicity.\n\nI'm not familiar with Puerto Rican or Cuban cuisines, so can't draw comparisons with other chefs, or with this same restaurant under previous ownership. Today's food was so spectacular and reasonably priced that I will be back. I'm glad that the new (7 months, he said) owners decided to take it over, to keep the restaurant open.\n\nThe restaurant is tiny, with very \"live\" acoustics, so not so easy to carry on a conversation; one happy family with lots of laughter pretty-much dominated the soundscape during my meal. Family-friendly. Clean little restroom.\n\nI asked how the restaurant got its name. He said it began as a fruit smoothies shop. I'd been expecting a more exotic explanation. LOL!", "author": "Ari T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "I have been going to El Nuevo Fruitilandia for about 25 years! When it was kind of a dive, but great food. When I moved into the neighborhood. Yes, it's been around that long. Shows how old I am! I haven't been there in a couple of years. So I took my niece - her first time to El Nuevo Fruitilandia. As much as I love this restaurant, when operated by the former owners, I really believe the new owners have tweaked some dishes, making them just as good or better. And added some new dishes and appetizers on the menu.\n\nMy niece and I went mostly for appetizers (tapas). We ordered (2) papa rellena, mofongo, alcapurrias, empanadas, and the appetizer combo (tostones, yucca con mojo, platanos maduros). And another appetizer like a tamal, Puerto Rican version. Made with plantains/platanos, tara root, and more! We ordered one main dish we shared - paella. We both ordered tropical smoothie drinks. Like smooth tropical milkshakes. Made with Caribbean tropical fruits. I'm lactose intolerant, so I ditched the milk, and replaced with water. Still so good. All that was mentioned, you're going to have to cross-reference the menu to the pics posted on Yelp! to see the actual plates.\n\nDid I eat everything we ordered? I could have! But I just wanted to sample and gave the rest to my niece to take home.\n\nThe decor hasn't changed much since the last owners' remodel. Actually, some of the same wall decor from the very orignal restaurant, 25 years ago. The restaurant is clean and quaint. They no longer have a guitar player in the front window area, like they used to on Friday and Saturday nights. Would be nice to have. The waiter/server was very friendly and helpful.  We ate lunch when they opened. I know dinner must get crowded.\n\nEl Nuevo Fruitilandia is an even more special place to dine for me. If you want to try Puerto Rican-Cuban cuisine, El Nuevo Fruitilandia stands out! I give them a high-5 rating! They compete well with all the new restaurants on lower 24th St (Calle 24/Veinticuatro). I think they surpass a lot of the newer trendy places. And it still has the flavor of the Mission heritage. El Nuevo Fruitilandia has been there longer than folks know. And I hope it will be there for many more years!\n\nI showed my Yelp! coupon on my smartphone and got the discount. That paid for an appetizer+. So don't forget to mention and show when your first order. And check if they're Groupon-friendly too.", "author": "Roger S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "This is a cozy and casual restaurant in Mission serving Cuban and Puerto Rican meal. My server was Raven and she was very friendly, attentive and provided some great suggestions for drinks and food. I had the veggie Mofongo and it was really good. Very authentic and filling. I will be going back to try other items on the menu. Was very reasonable as well. Under $20 for a drink and meal is a great deal IMO.", "author": "Milesh J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-22", "description": "This reminded me of the food I had in Cuba- bland!! We have been coming to Fruitlandia on and off for 20+ years and have usually had great experiences here\nI LOVE Cuban and Puerto Rican food but this place no longer does it justice at all. The ropa vieja looked like ropa vieja but tasted like salpicon (a very bland version of salpicon). The Cubano sandwich had a slightly sweet but still kind of bland pulled pork in it. WTF? You can't just switch out the roasted pork and still call it a Cubano! On top of that the bread was either stale or over cooked. The maduro had a very strange flavor. How can you mess up fried plantain? On the positive side, service was nice and the habichuelas were good. As i said, I frequented this establishment for 20+ years. We had a great run but it's over now.", "author": "carol c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "The food was truly authentic! I loved the mofongo and I was also seriously impressed with the sautéed shrimp and arroz con gandules. I HIGHLY recommend this quaint but wonderful little restaurant!!!", "author": "DeAnna J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-19", "description": "I give this place one star based on expectations. I haven't actually had any food at El Nuevo Fruitlandia because I bought a groupon hoping I could use it. I should have read the fine print because the first time I went to the restaurant to use my groupon I was told I could not because it was Friday.  Understandable if they were very busy, but it was 5pm and the joint was empty. They could have made an exception. \n\nWhen we left it would have been nice if the waiter had said something to the effect of 'oh, and we are also not open on Tuesdays'. But no such luck.\n\nNor did I have luck trying the food going to El Nuevo Fruitlandia on a Tuesday. Closed.\n\nSo, lesson learned. Don't expect a restaurant to be open on a Tuesday and don't expect to be given full information by staff. \n\nFrustrated.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-12", "description": "If I had a Puerto Rican grandma, I would like to think this is the comforting, no frills fare that she would be slinging out of her kitchen. \n\nFood: \n\nPerfect to satisfy a craving. Went on a Saturday and had the special, which was a shredded pork with rice and beans. The rice and beans were perfect. Rice was fluffy, lightly seasoned, it was hard to stop myself and eat the the rest. Beans were great, I am 90% sure they had meat in them, which in my mind, was awesome. Pulled pork could have been a little juicier, but that's just being nit picky. \n\nCeviche was good but not amazing. Portion was a little small, and the cabbage could of been shredded better. \n\nPlantains were delicious, I wanted to stuff some in my pockets for later. \n\nService: \n\nAttentive and relaxed\n\n\nPro tip: check in on yelp, we got 15% off. Also, if your a vegetarian, check the sides for meat just in case. See beans above.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Very good Cuban & Puerto Rican food and warm, friendly service and atmosphere! Saturday Lechon special was great as was picadillo, chicken & beef empanadas and mango sangria! We'll definitely be back!", "author": "Angelique V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "We recently met a group of friends at El Nuevo Fruitlandia for an early dinner. There were 6 of us and we all had eaten here before it changed hands. The old Fruitlandia served Salvadorian food and it was very good. Now it features Cuban and Puerto Rican food. Where the old restaurant was kind of funky the way it was decorated and it has changed a little. I noticed the photo of my Wife in her head dress costume for Carnaval was missing from the wall. She is pretty attractive so maybe someone wanted a memento of the Carnaval parade?  I ordered a Cuban sandwich and my Wife ordered the Mofongo . We also had lots of plantains/platanos. The food was pretty good and the pepper infused vinegar on the table went well on my sandwich. Overall we though the food was good, but just a little pricey", "author": "Bruce S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Delicious! \n\nWent here last weekend (incidentally, with Patrick T. who left the previous review). I think we all had the \"Saturday Special\" which was awesome. I can't eat spicy food so I love that this place is flavorful but not spicy. Make sure you get a side of the sweet plantains, you won't be disappointed.", "author": "Amy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-13", "description": "GF and I stopped by for lunch on Saturday.  The food was fine - I thought the maduros were really good.  Nice caramelization. \n\nThe only thing off was the service, which was slow.  Not sure if it was the waitress, who was handling all of the tables, or the kitchen, but it took a long time for the food to come out.  I'd guess it was close to 1 hour from sitting down, ordering and then getting our entrees.  \n\nI'd probably come back but this would depend on how full the dining room was.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "Damn, what a joy it is to have another Caribbean joint to go to in SF. The shortage of Caribbean and South American food in San Francisco always drives me crazy and Frutilandia capably fills a giant void. Before you balk, let me clarify, Mexico is in North America and El Salvador is in Central America and the cuisine in both is very different from what is common in other regions of Latin America. The only other Caribbean spot in the city that is as authentic being Parada 22. Frutilandia is Caribbean in multiple ways, one of them being that the place is very casual and unrushed, you never feel like you are expected to eat and leave. The emapanadas here are perfectly done, perfect texture and flavor. The lechon horneado (oven roasted pork) is incredibly flavorful and juicy. I highly recommend having a side of yuca with your entree. Be aware, the sangria here is very sweet and fruity which is exactly how I prefer it. There are so many items on the menu I've yet to try that I'm always giddy when I find myself in the area so I can have a new adventure.", "author": "Paolo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "Excellent food! Almost as good as my grandmothers. Service was great! Love the music & atmosphere. Wish we got a little more food for the price but can't really complain cause it really authentic. You can tell they put a lot of pride into their food.\nPros:- They serve Malta\n         - Sangria, Mmm\n         -Alcapurria outstanding.\n         -Real Puerto Rican Owners & staff!\n\nCons: -Wish the servings were a little bigger.\n\nWe will definitely return. If your looking for authentic Puerto Rican food this is the place!", "author": "Raquel Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "Cute restaurant...we had the same photo of a house in Puerto Rico as they did! We ordered the tostones, mofongo, pastel for appetizers and for dinner we had the ropa vieja, pierna de puerco horneada...it was all delicious!! Make sure you ask for the Puerto Rican hot sauce...sorry we emptied the bottle. Order the flan con queso...it was so good...cheesy and worth it!!! We will be back...Can't wait.", "author": "hac h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "Its home cooking but I think they need to get some fresh pans.  Boy.. you take a look inside the kitchen and it seems they haven't got fresh kitchen ware and utensils since the 1960s.   Also I kind of feel bad about how labor intensive the poor woman is like a slave cooking.\n\nThe food is however delicious and I always hope to return. They make perfect \"plantains\" Cuban style and mostly all their dishes have a remote Nicaraguan + Cuban mix to it.  \n\nWhen you order, be more selective about how you are mixing various dishes together and share by having common plates (Chinese food style) with sides of extra rice - you will likely need it.   The same for the soups.. order a soup dish and then a meal dish and plan to share with your group.", "author": "Tito Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Great service! And delicious food! Back in the beginning of the year I had just moved out to SF from the Midwest and was really interested in trying food from different cultures. My boyfriend and I stumbled across fruitlandia when walking through the mission. I've heard that cubanos are really good and they happened to have it on their menu! So of course I ordered it, with a can of \"Iron Beer\" or Cuba cola. Both tasted delicious and we had visited again because we love the service and the food! We will for sure tell our families and friends of this place!", "author": "Ana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Food was wonderful, the service was wonderful and the people are great. Wait time was short and quick service.  Felt like I was part of the family.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "This is an authentic Cuban and Puerto Rican, family run joint that has great food and friendly staff. The fruit shakes are AMAZING, the plantain appetizers are plentiful, and the pork dishes are tender and juicy. \nThe only thing I'd comment on is the need for salt and spice. The pork definitely needed salt and the pepper vinegar on the table helped but didn't give the kick I wanted. Unfortunately, the only options on the table were Tapitio and Tobasco and I didn't want to mask the wonderful flavors with those. \nWe will definitely come back for more shakes, apps, and to try the Cuban sandwich.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "Oh My Goodness!  If you ever find yourself in the Mission/Market area, find this place!  We stopped by for dinner because we wanted a place to eat that was going to be near where our main attraction was.  We didn't want Mexican, again.  We have found scrumptious Mexican food in this same area, but we just wanted something a little bit different.\nThis place served it up!\nNot only were the wait staff very friendly, when we pointed at the menu for lack of being able to pronounce what we wanted, we were given head nods and smiles.  Very warm and inviting.\nWe started with their house shake.  They let us combine fruits so we kind of got a custom shake.  This is a Batidos.  So creamy with finely crushed ice.  Perfect start since we were really thirsty.\nNext our salad were brought to us.  Just a little cup of salad.  House dressing was different.  Nothing much to shout about here, but it was good and we ate all our vegetables.\nNext came dinner.   We ordered Chile Rellenos and Filete de Pollo a la Española.  Some one in the kitchen was making MAGIC!  The sauce for the chicken dish was so good.  Good is not a strong enough word.  This dish was not spicy.  It was not chili hot.  But it was real down home comfort food.  Lots of chunks of chicken with a  side of white rice and a cup of black beans.   The Chile Rellenos was a work of art.  Perfect in every way.  We have found another favorite restaurant.  \nThe place is small.  But even on a Saturday night, we managed to get a table right away without a reservation.  It's old, we were told they have been there for 40 years.  But that's was so much of the charm.  I love these \"hole in the wall\" places that put the fancy schmancy restaurants to shame!\nDon't dine in if you're in a hurry.  They must make everything to order so it takes a little bit to get your dinner.  It's so worth the wait.  If you must be somewhere and you're pressed for time, they do take out and  you can call ahead.  Check out their web site.  And GO!", "author": "Reba Jane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "We love Puerto Rican food, with Husband having grown up with it and all. We can't find any place that serves mofongo near our home in Placer County, so when we are out of town we often look for a great place to get our \"mofongo fix.\"  Husband likes his very traditional, with pork, so this place was perfect. It serves it with pork or vegetarian. I prefer it with chicken, but the pork was very tender and, after all it IS the \"other\" white meat, so I can live with pork just fine. The ground beef empanadas and papa rellenas (mashed potatoes with a bit of ground beef deep fried together) also happen to be a couple of our favorites, and they were done well. We were very happy to see that they were served with the Thousand Island type sauce also known as \"pink mayo\" that is the perfect complement to both these tapas. It is the mofongo that you really need to come here for, though. It is not easy to find and it is so delicious!", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "probably my favorite PR joint in the city. always solid, nothing fancy, just great food.", "author": "W R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "My husband and I wandered in here because Yelp had a check-in-offer for 15% off our bill ;) We ordered Mofongo and the Ropa Vieja because they are classic Puerto Rican dishes and could serve as a sort of control group. The Mofongo came out a very small portion, molded on the plate in the shape of a dome with a (kinda stale) plantain chip sticking out. It was very good, we thoroughly enjoyed it but it was gone in 4 bites. The really surprising thing was that the Ropa Vieja was even skimpier. It was on a plate that you would expect to hold a side dinner salad. It had a tiny scoop of white rice, a tiny cup of black beans and a tiny scoop of meat. Both plates together would barely have even been enough to feed one hungry person. We were one hungry person and one filled-up-on-Phil'z person and it was nowhere near enough food. \nThe server was so nice and we tipped him very generously, of course based on our pre-discounted total and he seemed very grateful. Unfortunately we will not return though because in order to fill our appetites we would need to spend about $40 and ain't nobody got time for that at lunchtime.", "author": "Emma H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-30", "description": "Came here to use my groupon at 4:00 (said that's what the opening time was) and was not open. Lady said they would be opening ten mins later. Came back 45 mins later and they were still closed. Bad business, no wonder why they have to offer groupons and discounts on yelp to convince people to come in.", "author": "Yung C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Boriqua and Cuban food is so delicious here. A very small restaurant; however the food speaks for itself. Slightly pricey but all things great are worth paying for. I left this place in pure satisfaction. The tostones drenched in garlic were definitely my favorite.", "author": "Ruth B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "After a friend raved about a restaurant in Miami that served amazing Mofongo, I went on a mission to find a restaurant in California that served it. Surprisingly, this proved to be more difficult than I originally thought.\n\nSo while I was on a trip to San Francisco I paid a visit to El Nuevo Frutilandia in the Mission District for their Mofongo. I ordered the Vegetarian Mofongo (which on their menu is only listed as an entree with sides, but our server let us order it a la carte as the appetizer). Granted, this was my first experience with Mofongo, so I have nothing to compare it to, but I wasn't overly impressed. I didn't think it tasted like it had too much garlic, but to be honest, my sister and I suffered the remainder of the night with awful garlic breath (sorry for the overshare, but if you come here on a date, best to avoid the Mofongo). \n\nWe also ordered the pulled pork entree. It was good, but the surprising standout was the Sopa de Pollo that came as the side. There were big chunks of chicken and vegetables. If I lived in the neighborhood, I'd come by here and get a bowl every time I was craving something warm, healthy, comfort food.", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "I am eating here right this moment!  Holy moly this half Puerto Rican is pleased.  Reminds me if mi abuelas cooking.  New favorite spot in the city for Caribbean fair.\n\nVaca Frita is amazing!  Order it!  Do it!  I am also loving my guava shake.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "Unfortunately, that place didn't work well for us. We went there around 4 o'clock on Sunday , but they already \"run out\" of iced tea. Restaurant was empty.\nBeans were overcooked , ceviche looked like a plate of onions sprinkled with oil, we had to return it, but the waitress was very nice and she took that dish without any problems. Empanadas were good, service was nice , but it is not worth to go back", "author": "Yulia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "Friendly staff and delicious dinner. Who knew this place has been here for 40 years?!  Go support this family business. Seriously.", "author": "Jonathan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "Came here on a Friday night in June, wasn't busy so we were seated right away. It's not a large restaurant but has a great atmosphere for an intimate meal for 2 or laughs and drinks with friends. Nice music playing in the background. \n\nOrdered our food, and within 10 minutes our food was being served to us. Didn't expect such speedy service, a definite plus. The presentation of both meals were nice and the red wine Sangria was amazing. \n\nThe carnitas plate I ordered was seasoned well and the black beans were some of the best I've ever had. \n\nGood place to try if you're looking for a tasty meal and great Sangria.", "author": "Jarrett D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "Vaca Frita was really fantastic.  The sweet plaintains are very good. Great service too.", "author": "April M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "The food,? excellent, the service? Wonderful the mango sangria? AMAZING!!!!! \nOne of the best  puertorican food ever! \nAnd I can said that because I'm 100%puertorican!   \n\nGreat job and thanks for a great service!", "author": "Omar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "I love this place!\nI've always gone with my kids during lunch or early dinner. This restaurant is very family friendly. \nThe ceviche is amazing! Always get this. \nI've had various items on the menu and have never been disappointed. The staff are always helpful at providing advice if you can't decide.", "author": "Bob M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-17", "description": "They were at SFSFF 2013. I had the cubano sandwich. It was good but the ham on it looked liked lunch meat from the grocery store...", "author": "Alexys E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "This place is awesome!  Super tasty and the servers are really nice.  I had the vaca frita and it was incredible!!!  \n\nAlso their passion fruit is superb.\n\nWas totally surprised with how good everything was.  From the beans to the salad to the empanadas. \n\nOverall amazing!!", "author": "Spencer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-06", "description": "Honestly, I really wanted to like this place as it is a cute little restaurant a few blocks from my place.  \n\nThe service is great, but the food was horrible.  Literally one of the worst meals I have had all year.   The rice was old and so crunchy it hurt my gums. We ordered the Ropa Vieja and it was cold and icky.  We also got the shrimp in garlic butter sauce and it was flavorless and not cooked all the way.   The best thing we ate were the fried plantains and the black beans.  I was a little worried I might get sick from the food, but ended up being fine.\n\nNot only was the food terrible, but it was really expensive!  Almost $40 for two people and no alcohol.", "author": "Christine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "I simply love Puerto Rican food, especially at El Nuevo Frutilandia. It's my secret place but I have been telling so many people about it lately that it ended up on a friend's blog today. Check it out the blog at: http://isthisfrisco.tumblr.com/post/109207201104/day-26-frutilandia-cuban-puerto-rican and don't forget to go in for some delicious food and a warm welcome.", "author": "Mikael B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-17", "description": "The only reason I know of El Nuevo Frutilandia is because my friend lives just a couple of blocks from there. I was able to find the restaurant using the Yelp app and reading that it's a Latin American restaurant I was pretty excited to eat there. \n\nIt's not in the best of neighborhoods and it's surrounded by Mexican restaurants and liquor stores. Parking is hard to find but then again parking is always hard to find in San Francisco. From the outside the place doesn't look very appealing but on the inside it's a very quaint restaurant.\n\nI ordered the Cubano, which is their Cuban sandwich that consists of pork and ham. The sandwich was good but the presentation was awful. It looked as if the sandwich was made as if the cook was given a time limit. Just an awful mess and the fries were just as bad as they were soggy. \n\nOn your very first check in you will be given a Yelp deal that gives you 25% off your order. That's a plus given that I wasn't thrilled about the look of the sandwich and the fries were bad. Just make sure that when you check in and the Yelp offer appears to let your server know right away, as there is a time limit. \n\nThe staff was very accommodating. Both the manager and the waiter were nice and easy to talk to. The bottom line is this. If you happen to be in this neighborhood that is surrounded by countless of taquerias and Mexican restaurants and you want to try something different then I recommend this place. Otherwise I'm sure you can find plenty of other Latin American restaurants.", "author": "Yong Jae C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Just had dinner at this place and it was great!  Being from Miami and visiting our son who lives on SF, we needed our usual Friday night fix for Cuban food.  Man, this place was great, however a limited menu, which is understandable  being so far from Miami and south.  The service was very good and the owner was very friendly.   We ordered a lot of traditional foods, tostones, fried plantains, ropa veiha, picadillo, Vaca frita, and rice and black beans and finished with flan, which was home made by the owners wife.  It was fantastic.   I highly recommend this place if you need your Cubano craving.  Definitely will return when visiting SF again, which is frequently.", "author": "Barbara P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "We tried El Neuvo Fruitlandia for the first time today because we'd been looking for a place to get ropa vieja. They have it as an empanada, a sandwich, or an entree.\n\nWe got the Ropa vieja empanadas (crispy outside, meaty inside, with nicely cooked red peppers), the Empanadas del Espinacas (ala carte), the Plàtanos Maduros (yes, fried plantains can be even better with a little butter and Kahlua), and the Papa Rellena (Mashed potatoes filled with nicely seasoned ground beef & green peppers, fried golden brown).\n\nAll tasty. Service was good. We plan to return to try some of the items we had to forgo this time.\n\nVegetarian entrees and appetizers available as well as beef, pork, and chicken.", "author": "Vicki B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "Fun food, totally unpretentious setting and service.  Reasonable prices.  Generous portions.  Usually not hard to find street parking nearby.  Unusual take on ceviche (with pineapple - like refreshing beach food) and they are happy to offer the yucca steamed instead of fried (delicious - buttery and garlicky).\n\nGreat go-to spot for relaxed Cuban/Puerto Rican food.", "author": "Chase P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-12", "description": "I really wanted to like you more, esp since I've had such good experiences with Puerto Rican food at Parada 22 and El Sol. But the service was soooo slow! There was one waitress for about 5 tables, and she was so inefficient, but sweet. And on the night we went, I guess the chef had ditched work to celebrate his birthday, and a burner was out, so the food came out super slow and the chicken soup was cold. aye dios mio\n\nBut the food was good: the tostones (friend plaintains) were fresh and crisp and accompanied by a savory garlic dip. The acalpurria (mashed plantains and yucca wrapped around ground beef) was an interesting little bite. The Picadillo A La Habana Vieja (cuban style ground sirloin beef cooked with olives, capers, raisins) was a wee bit too salty, but the side pink beans were bomb!\n\nThey just need to get their act together and they'll get more customers.", "author": "Susan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Best place around!  Great atmosphere and truly amicable staff.  Zakary is a true gentlemen and one of a kind. Great place for a date.", "author": "Matteo D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-09", "description": "Placed to go order online, was contacted 15 minutes later that the restaurant was closed, when their hours stated open. Didn't try any food! Get your stuff figured out.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "I had the Cuban Sandwich and Sangria.  Both were very good.  I recently learned while traveling in Cuba that Cuban don't eat Cuban Sandwiches (they eat rice, beans and pork mainly).  Oh well, I still like these sandwiches.  The service was friendly.  My friend and I shared an appetizer.  Reasonable prices, good food, good service.  I\"ll be back.", "author": "Debbie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "This place is insanely bomb. If you're an East Coast transplant looking for consistently good Puerto Rican/Cuban food, this be your spot.", "author": "Will F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "I had a solid dinner here on Day of the Dead, after failing to get in other spots around 24th street.  I ordered a really healthy serving of ropa vieja, and my girlfriend ordered a similarly huge yucca dish.  I'd rate both dishes as good home cooking, but not great.\n\nThat being said -- the prices were reasonable, and service was courteous (not so much prompt, perhaps due to the heavy traffic on a weeknight).\n\nI don't know if I'd go back, though, given alternatives in the neighborhood.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "My husband and I tried this place last night. We were greeted by a friendly woman,( I'm assuming she is the owner.) We ordered the tostone's, mmm. They had this delicious garlic lemon sauce and were salted just enough. We also shared the veggie mofongo tapa, which was heartier than expected and smothered in a delicious tomato sauce that was comforting, it had a taste from home. I also tried the mango sangria, I couldn't taste the mango, but the sangria was really refreshing. I had to have a second glass!\nFor our entree's: I had the Limon Ajo Camarones, I loved this dish. The flavor of the sauce was so good, lemony garlic and the prawns were cleaned and cooked just right! The rice and cuban black beans had a good flavor too. Great portion size. I was stuffed!\nMy husband enjoyed the Lechon Horneado. So flavorful and moist, also a great portion size.. If you like pork? This dish is absolutely amazing! I tasted it and it had so much flavor. \nWe will definitely be going back! This place is a hidden gem. I never had even noticed it until I yelped Cuban food. The interior is really cute, and makes you feel like you are on a mini-vacay. Friendly people and service, and really fresh and tasty quality food!", "author": "Hope A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "If you go at Lunch, you might want to consider ordering your food before you get there, if you don't mind rolling with Latin Time, or European luncheon hour you'll be just find.\n\nI have yet to try their actual food, I just keep going back for their insanely delicious Cuban Sandwichs. Okay so the bread isn't that flacky yellow baguette you pick up in Miami at Publix or your local Farm Store, but who cares they load up this sucker with so much marinated amazing Pork (the most important part of the Cuban Wich) by the end you forget sandwiches come with bread. \n\nOh the Mother land...hehehe anyways I will update my review once I go back for some Mofongo and Fricase de Pollo.", "author": "Lannette G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "OK, so I've never had Cuban or Puerto Rican cusine, at least not that I can remember. I decided to play it safe, considering I don't like spicy or plantains and ordered the Camarones al Ajillo (prawns in lemon and garlic sauce). OMG, I was not disappointed, the garlic flavor was amazing and the prawns were cooked to profection. Where did my beans and rice go? Oh yeah, I ate them. Usually I don't like restaurant's black beens (never flavorful or tender enough), these left me looking for more. \n\nSo what,  I'm here at work smelling like garlic, I don't care! I'm full and satisfied!\n\nDon't like milk either, so my smoothy was made with orange juice it was so refreshing, not to hear \"that's how we make our smoothies\".\n\nI wish I lived in the City today because I'd be right back there tonight to get some more of those beans and rice.\n\nThe staff is very friendly and attentive which makes for a four star establishment!", "author": "Carmen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-21", "description": "My coworkers were planning a big Cuban-themed party, and being responsible for the food, I looked into various Cuban and Puerto Rican places in SF who could possibly cater. Since Frutilandia is in my stomping grounds, I decided to go in one night and order a bunch of food to try. The beans, rice, steak sandwich, chicken, plantains, everything was so good and made with love. Oh, and their Sangria is awesome.\n\nI asked if they could cater the party and the chef, Gary, was so into it. He was very collaborative, creative, and more than happy to work with my very meager budget. He made cubanos, plantains, roasted veggies, chimichurri chicken skewers, and black beans and rice. Everything was hot and ready on time. It was a hit.\n\nNot only is the food delicious, but the people who own and operate this cozy little restaurant treat you like family. I'm almost scared to give them a five star review for fear that I'll have to wait an hour for a table now.\n\nI'll definitely be back again and again, with all my friends and family.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "I ordered the Pierna de Puerco Horneada and it was pretty tastey but lacked that down-home-abuela-made-it taste. I feel like maybe it's the 80s generation in the kitchen. It does have some soul to it but not 100%. I found the portions are too small for this style of restaurant. A $15 plate of rice, beans, and pork done right should be hard to finish, if not impossible. But I ordered on GrubHub, maybe that's why it was small? Anyway I picked it up, walked two blocks home, and when I got there most of the food was cold. It wasn't cold out either. I asked for pink beans but they were black. BUT I also picked it up 15 minutes before closing, so I didn't take points off for that.\n\nHowever, this is the only Puerto Rican food I've found in the mission, and the platanos maduros were pretty delicious. I wish I had ordered the soup instead of salad! I'll be back, but the value isn't great.", "author": "Cecilia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "Absolutely a wonderful dinner experience for me. The pulled pork for the Saturday special dish got me, so delicious!!! I love everything I ordered, and the pork was definitely my favorite. \n\nIt was a Saturday after a day of work, I was feeling really happy to call it a day with a wonderful meal and great service.\n\nTry it!!", "author": "Y Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "So If i was eating this back in South Florida it would only get 3  stars but since it is in San Francisco the land of the taqueria,  I'll give it 4 for being different and offering a unique cuisine to the city.\n\nWe had  vaca frita: too dry and too  shreeded lacked mojo and   the portion was small, but the black beans were on point\nMofongo:  I could not taste the pork or chicharron at all but the tomato sauce for it was amazing\nChicken soup: Was nice great broth\nTostones: Were very good and right on point  but they should of being served with a dipping sauce\nMaduros were good and fried correctly\n\nOverall  it was okay but much room for improvement.\n\nOn another note the server was very attentive and seem to know her menu well", "author": "Manny R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-18", "description": "I've had Cuban and Puerto Rican food in Miami before and this rivals the best in Calle Ocho. Terrific service and amazing food.  Feel free to ask for the chef to make certain dishes to order---the restaurant is very accommodating.  I am definitely going back and taking friends to introduce them.  \nSangria was perfect, the deserts amazing and the chicken soup---OMG, what can I say---I'd go back for just the chicken soup.\nGreat value for your money.", "author": "Ray L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-13", "description": "If you go here, get the mofongo and enjoy! The unique garlicky flavors of the fried plantains will bring joy to your taste buds.\n\nThe other items we tried - some pork chops and steak cooked in a wine sauce with peppers - were a bit on the tough, dry side. And compared to the mofongo, they paled in comparison.\n\nService was friendly but a bit on the slow side. We came a little after they opened up, there was only one family there beside the two of us but it took a while to get the food. \n\nI'd be willing to try some other items but I hope it won't be too long before I'll be getting the mofongo again.", "author": "Art O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-09", "description": "Extremely dissapointed, there to go menus state open today from noon-3pm, drove from the South Bay specifically to bring my peeps to the best PR food in town, just to find them closed. Not sure how they stayed in business for 40 years with false advertisement they displayed today. Unfortunety I had to rate this to post my dissapointment.", "author": "Marty M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-12", "description": "Came in around 4pm on a Sunday. The restaurant was out of couple of the things we wanted to order on the menu--  no biggie --- BUT Waited over an hour for our food. People who came into the restaurant after us were served before us. It looked like they gave other tables the food we had ordered. Ended up getting up and leaving because we were starving. Never offered a side dish? Some bread? Server even brought us a check for our drinks!! For real?!?! Never again!", "author": "Becca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "Another one of my favorite dishes at this place is the Friday special, which is the paella mixta. It comes in a mini personal skillet/pan. It's got a variety of seafood -- shrimp, mussels, and clams. It also has chicken and chorizo. Delicious dish, just wished it had more seafood though!", "author": "Cassy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-12", "description": "I had purchases a Yelp! deal with this place a while ago and had to redeem it before it expired. The boyfriend and I were in the area about to go to a Brazilian Guitar concert and decided to redeem it and get some din din.\n\nOh my god, Reggie was an amazing server. Sometimes you just get lucky and have a waitstaff so charming that they improve your experience ten fold. This was one such experience.\n\nThe sangria is really good, really fresh. I had a happy buzz before the concert.\n\nLoved my dish, it was some kind of pork dish that came recommended. I don't remember what my partner ordered but it was delicious as well.\n\nWill be back!!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "To my great surprise we found this restaurant on the way to a cultural event. \n\nI was excited when I saw they had Malta, a sweet non-alcoholic refreshing beverage,  which goes good with the Puerto Rican Pasteles we had.  My wife who normally is not fond of them was pleasantly surprised. I explained to her she never had them so well prepared, and flavorful.\n\nWe also had shrimp with rice, Papa Relleno (potato balls with meat inside them),  At the time they had run out of Alcapurrias, a tasty fried dish, which didn't surprise me. I could probably clean them out by myself. They also have Coco Rico, a popular coconut soda. I guess we'll have to go back.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-01", "description": "Great environment and good service. \nThe food pricing is a little high for what you get. While it is tasty I just cant go higher than 3 stars with the price considered. \nIf you go with a discount you'll have a 4 star experience.", "author": "John N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "Have been here twice and both were great experiences! I got the slow roasted pork the first time and the second time I asked for Arroz con pollo (which wasn't on the menu that day but they made it for me!). The arroz was not the usual kind I am used to eating but it was definitely delicious, the chicken was tender and very flavorful. \n\nAll entrees come with either soup or salad, the soup is definitely a home run! \n\nThe people who run the place are very nice and sweet. I'd definitely come back to this place.", "author": "Gordon O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Authentic, friendly, casual and the best Mofongo I've had in 20 years! Always my birthday favorite.", "author": "DrRich W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-06", "description": "I've been eating here for a few years now...I love Puerto Rican / Cuban food, and this is one of the only PR/Cuban restaurants in the city.  I haven't been here for a while, and finally went back for some dinner with friends on Friday night.  To my surprise, the restaurant is under new management now....and it's GREAT.  We ordered many different items (alcapurria, mofongo, papa rellena, pastel, maduros, roast pork, etc.) and everything was perfect.  \n\nThe previous owners were El Salvadorean...which never bothered me (you don't have to be Puerto Rican or Cuban to know how to cook the food); but I know it bothered some people, because the food didn't seem \"authentic\".  You'll be happy to know that the new owners are indeed Puerto Ricans.  The new owners and staff were so delightful, accommodating and friendly...I absolutely LOVE good service.\n\nThe only thing I'm worried about is that this is a really tiny place, and it seems like they will become more popular under this new management...so in the future, wait times might be kinda hectic.  With the previous owners, they were never too crowded, and I was always able to get a table anytime of the day/evening.  I suppose it wouldn't be too bad if I go super early right when they open.  Kinda sucks that the location is right in the heart of hipster-ville (I'm a Mission native, and I'm against the hipster invasions).", "author": "Cin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-16", "description": "Don't ask me how I know the owners, but I do.  For all the concerned people questioning the motherland of the owners, they are from El Salvador.  The husband and wife worked for the original owners and learned all the recipes.  Okay enough personal background.  \n\nWe went for my mother-in-laws BDay with a party of 10.5 adults (expecting mom) and 1 child.  Because it is only one person cooking we were there forever!  For appetizers we ordered the following\n\nYucca en ajo.  2 stars.  The yucca was boiled in a garlicky broth but failed to absorb much of the flavor.  The garlic broth was delicious however when we soaked the bread in it.\n\nTostones  4 stars.  On par with what tostones are supposed to be like.\n\nPlatanos fritos con crema Y frijoles fritos (fried plantains w/ refried beans and creme) 5 stars.  Although the bean to platanos ratio was not equal.\n\nI ordered the ropa vieja.  3.5 stars.  I only have a cuban rest. in San Jose to compare it too.  I could tell the meat had been slow cooked for some time in the ingredient's and had absorbed all the flavors wonderfully.  However, the flavors were not unique and did little to distinguish themselves from Mexican flavors.  The dish was served with a side of white rice.\n\nMy husband ordered a shrimp dish in a spicy tomatoes broth. 4 stars.  \nI sampled a shrimp and it tasted very fresh and well cooked.  The \"spicy\" broth  sauce was mild.  \n\nMost of the adults ordered the steak sandwich, which I am kicking myself for not ordering instead.  Very big portion, juicy steak, but I did not taste it so I cant rate.\n\nSomeone else had the garlic shrimp, but had similar results as the yucca. Again I did not taste, just repeating what the other diner said.\n\nKEY TIP!!\n\nIf you have the choice between side salad or soup, ORDER the soup.  I made the mistake of ordering the salad...it was a joke!  It was made up of chopped lettuce, canned vegetable medley (cubed carrots, green beans and peas) with a nonexistent dressing.  It was a waste of food.\n\nThe soup on the other hand, was a small bowl of chicken soup.  Very good.\n\nOverall, I would go again to try the steak sandwich and support the owners.", "author": "Frida V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-25", "description": "You peeps don't know what you are missing. The food here isn't that great, especially the habichuelas rositas and mofongo. I just moved to San Francisco, so I guess I still have to find a good Puerto Rican or Dominican restaurant :(", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "I was there on Saturday night, 1/10/2015. Just stumbling around the area, looking for a place to eat before an event at Adobe Books. As I was reading the menu, another patron, just entering, commented that the Saturday night special was amazing. I recommend the Mango Sangria, the Camarones al Ajillo with cuban rice and the Lechon Horneado (aka Saturday special). The flavors were wonderful, and the atmosphere inviting. One of the owners was working the bar/counter and waitressing; she was a delight to talk to. Just a warm, friendly place. I'll definitely be back there!", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "I love this place. Never had Puerto Rican food before eating here and they have the best. The empanadas are sooo good. I love the Ropa Vieja here. Will go here time and time again.", "author": "Me R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "yelp deal, holla!!!!\n\nok, ok, so I only had sangria but yum, and my friends food seemed fantastic, love the people and quaint decor.  enjoyed my time so much I got my own yelp deal and emailed another someone else as a present.  This place makes a gd present to yrself go check it out. classic cuban fare, vegetarian friendly.", "author": "Coco J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-10", "description": "This place was fantastic! \nMy boyfriend and I tried it out for our date night. \nThe place was small but had enough tables and we did not have to wait on a Friday night at 6:30pm.\nThe place was super clean! All of the staff was so friendly and came over and talked with us! They made us feel like family! (I believe it is a family owned and ran place)\nThey gave us bottomless sangria! We ordered an appetizer and 2 entrees - the staff said it was taking a long time (we didn't notice, and I really don't think it took a long time) so they brought us an additional free appetizer and even offered us sopa but we turned that down. We also had flan for dessert.\nALL of the food was amazing! Fresh tasting and authentic!\nI definitely would recommend this place and will for sure be going back!", "author": "Thea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Solid cuban sandwich, the maduros are glazed with this crazy Kahlua reduction that is   freaking awesome and the flan de queso reminds me of the stuff my great grandma used to make.", "author": "Jose d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-14", "description": "Don't waste your time with this place. Anyone who gives this place anything above 2 stars has not had authentic Puerto Rican cuisine. You want good Puerto Rican food? Make the drive and go to Sol food in Mill Valley or San Rafael. Lacked in ambiance, service was below average, and food was not happening for me. I'm Puerto Rican so I definitely know what I'm talking about.", "author": "Coraly S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "To be completely honest, I have received better and more efficient service eating at an Applebee's or Chilis. Ultimately my experience eating here was not pleasant and I do not plan to come back here ever again. Being that my family and I are Puerto Rican, I was really excited to try authentic nostalgic food. It took approximately 20 plus minutes to get waters and to be greeted at our table. We ordered pasteles, alcapurria, and rellenos de papas. Now, I am aware that pasteles takes a little more time too cook but it's not worth waiting 60 minutes even after the other dishes came out. It came down to us having to cancel the order because we were waiting at that restaurant wayyyyyy too long. The alcapurria was very hard and difficult to eat and the best item was rellenos de papas. The prices are somewhat reasonable. I didn't appreciate the woman not warning us prior that we were going to be waiting over an hour and not all of our food come out at once. The service we received along with the \"ok\" tasting food would make it easy for me to say dont waste your TIME or energy coming here. It makes me sad that I am not recommending a place that serves my cultures food but there are other restaurants in San Francisco that you will have a much better experience and the food wouldn't be less than amazing. As patient as we were you would think they would of just given us the pasteles even if we cancelled the order out of the inconvenience of us not receiving the main entree ordered. Its safe to say they don't take pride in the service provided. If you have 2 or more hours to waste and you don't mind mediocre tasting good then you might be pleased.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-05", "description": "im from nyc and there's a big puerto rican population there and restaurants that cook great authentic pr food. im no expert on the cuisine, but this place was just...meh. ordered a chicken dish, a pork dish, the tamale-type appetizer and some smoothies. basically everything was pretty bland. but prices were ok i guess. every dish was under 15 bucks. but overpriced compared to the street vendors who hawk real pr food on the streets of ny!!", "author": "p f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-23", "description": "Mediocre food, reheated rice, bland tilapia, over sugared fruit shake... Do not recommend.", "author": "Manal D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "Food is good. I likes the ap with plantain, yucca, beef and raisins. Sangria was delicious. Staff is super nice, they even refilled our sangria which came free with my groupon!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-10", "description": "This place is a joke! Walked in at around 745pm, the place was not entirely full. We sat down, the waitress gave us our menus over a table that had not been wiped down. Upon taking our order, the waitress informed us that there were three dishes that were not available. Upsetting, but we ordered other stuff. We waited about 25 mins and no appetizers came. I was starting to think that I should've listened to the Yelp reviews regarding the service. A party of two walked in maybe 20 minutes after we did and they got their dishes within 15 minutes! Unbelievable! I questioned the waitress and she said that our food was coming. Shortly after she gives us tostones that we ordered and says that they don't have any bread left for the cubano sandwich! Why did they have to wait this long to let us know they had no bread? We asked her to cancel our entire order since nothing had been cooked yet. Don't waste your time coming here...the service is not worth it...", "author": "H C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Food was awesome. Service was great. Very cute restaurant right near a book store and ice cream... no complaints!", "author": "Ginna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "Came here with friends through a groupon reserve program (25% off the bill) to have some puerto rican food. The place looks like an honest local business, not too big, not too fancy, just very pleasant, like you're at a friend's place. Waiters were nice, helped with recommendations and didn't bother us unnecesarily. Mofongo starter was excellent as well as all meat entrees we ordered (pork and beef). I can see myself coming here often.", "author": "Marina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "1 word Authentic! I grew up in Miami and everything about this place is true to it's roots. Usually, West Coast Cuban food, it has a fusion aspect to it. That is not what I was looking for and that's not what you'll find here. My recommendation would be the Bistec Empanizado. Num!", "author": "Adam K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "deliciosa\n(3.25 stars)\n\nLiving social deal went into good use.\n\n- Food, good\n- Prices, decent\n- Service, good\n- Ambiance, small and cute\n\nI recall them being a vendor at SF Street Food Festival but did not get a chance to try them out. Craving \"cuban food\" and came this way to get my fixings. I've had cuban food before and always enjoyed it because the dishes are very flavorful. I wanted to give this place more stars, i really do, but something in the food kind of lacks.\n\nHEFFER STATUS.\n\nROPA VIEJA ($14.25) - Shredded flank steak cooked in creole sauce, onions, tomatoes, wine, and bell peppers. includes rice, black beans, and soup or salad. I chose soup because i see other yelps ranting about how good the chicken soup was. OMG THE CHICKEN SOUP (even if it was a small side cup of it) WAS THE BEST!!!!  When the dish came out the portion was decent, not sure if thats their average size or they docked off some because I was purchasing on a Living Social deal.Very good and flavorful. I think I'll just order the chicken soup by itself next time LOL. I didn't really see raisins in my meal, which was fine i prefer to eat raisins by themselves then mixed with a main course. The meat was tender and shredded easily, the flavors of the sauce mixed well with the meat/rice/beans however kind of lacked the strong flavor that I'm use to when eating cuban food, also came with a side of crunch plantains which i wasn't too fond of. I prefer the nice cooked plantains, not these plantain chips with no flavor. \n\nWill I be back? Yes. it may not have been the best cuban food but its still delicious.\n\nUntil the next review....", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "Its a Cuban Restaurant that has some Puerto Rican specialties. \nI had the:\n* Puerto Rican Pasteles\n* White Rice\n* Pink Beans \n* Fried Green Plantains (tostones)\n\nIts a small cozy restaurant with some low volume music that sets the atmosphere. \n\nThe food was well prepared and oh soooooo good. \n\nThe plantains were fried just right. \n\nThe Rice was what I'm used to finding in Dominican and Puerto Rican kitchens.\n\nThe Pink Beans (Habichuelas Rosada) were very very well seasoned.\n\nThe Puerto Rican Pastel was amazingly good and they sell them frozen as well.  \n\nThe combination of cozyness, excellent food and amicable staff made this well worth the trip and I greatly look forward to going back again.", "author": "Seth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Let me start off by saying that you cannot compare this place to anything you've ever eaten in New York or Miami. With that said, overall the food was delicious. It lacked a bit in the true Latin flavor but I am assuming that it may be harder to get some of the ingredients on the west coast because I cannot find them. We ordered several items off of the menu. Plantanos Maduros and Alcapurrias. Unfortunately, they did not have any pastels. The plantains were nice and sweet and the  Picadillio was well seasoned. We each ordered a main dish. The Lechon and the Bistec. Everything tasted great, it just lacked flavor. Both meats were tender. The reason I give this place 4 stars is because their service was superb and their drink specials (pitcher of Sangria) was just what we needed to quench our Sunday thirst. I would say, give it a try, it's probably the closest in Puerto Rican/Cuban food you will come in contact with in the Bay Area.", "author": "Claudine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Love, Love, Love this place! Best Boriqua cuisine in SF!!!! Their Mofongo is AMAZING!...along with the garlic shrimp salad, bistec, white sangria and red sangria. Everything I've ordered here has been delicious!!!! I am now a REGULAR at \"El Nuevo Frutilandia!\" =)", "author": "Claire K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-02", "description": "We booked a reservation for 8pm for 4 people. We showed up 30 minutes early because we saw half the tables available. We asked to be seated early. The waitress acted strange, checked with the cooks, came back and told us they ran out of food. She said they got too busy and they're now closed. Only half the tables where occupied and it was 7:30pm on a Saturday night. No courtesy phone call. No explanation. Amateur hour.", "author": "darren l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-27", "description": "Thank For groupon! Oh man I will not be back. My beans were so salty! I could barely eat them.", "author": "Gabriela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "By far the best Cuban Restaurant in SF and the best thing is no Cubans Chef  around the kitchen. Very friendly owners who I had known for more than 12 years, as a Cuban when I hit the city I stop by with friends & family. I actually recommend this restaurant when Rueda de Casino Congress is happening in SF the second week of February.", "author": "Leo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "I got an Amazon deal, took my mother out for her birthday and I fell in love with this place. the waitress wonderful, the food even better very exotic something totally new for usn We had the tostoned with galic what a wonderful treat. The food was great. I have to take my husband.", "author": "Carolyne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "This place was delicious. Given the affordable menu and delicious sangria, we will be back. Servers were pretty excited but the food was delicious and experience was awesome. \n\nWe had the Chile relleno and the pulled pork. Pink beans are ridiculously good. White sangria was addictive too. Rafael, the owner, was super nice and checked in with us often. \n\nAll around, pleasant experience. A few characters on staff but made for a fun dinner out. We will be back often.", "author": "Geoff R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-10", "description": "Flavors of the food are not the correct ones for puertorrican plates...the mofongo was the only good thing that we ordered, even the sangría didn't taste right. Way over-priced!!! Not coming back!", "author": "Liliana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "Finally a Cuban/Puerto Rican restaurant in SF! This east coast/southern gal has missed this type of authentic cuisine. I ordered the sangria and the Vegetarian Mofongo and was not disappointed. Can't wait to drop by again!", "author": "Whitney W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "Went here last night. I've been meaning to try this place for years and was really excited. When we sat down, the server informed us that several menu items were unavailable. Okay, totally normal. We ordered two entrees from the available menu items and then later were told by the server both dishes were also unavailable. Since we already had our drinks, we decided to stay. We improvised and ordered vegetarian empanadas and salad and asked for any dish at all that they could make with fish or with chicken, whether or not it was on the menu. (I don't eat pork and my friend doesn't eat shell fish). When the server came back, she informed us there was no chicken or fish improv options AND that the vegetarian empanadas were also unavailable. The cook did improvise a Maduro empanada for us, which was delicious. The server was extremely kind and apologetic and they gave us a significant discount on the sangria and appetizers we ate. Still, by the time we finished our drinks, it was too late to get food anywhere else and I went home hungry. I would give this place another try to see if this was a fluke. The menu *looked* exciting and the server was really nice, but otherwise this was a total bummer for us, and probably for them too because they lost significant sales and it must have been really hard for the server too!", "author": "Gabby G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-25", "description": "A little disappointed actually.  After hearing some hype on the joint and remembering I got a quite delicious Cubano sandwich from them at the San Francisco Street Festival, I was excited to try the place especially after being turned away a week ago because its was packed, close to closing time, and claimed \"they were out of food\".\nTonight there it was only about 20% full, perhaps because its a holiday weekend.\nThe standard most be low on 24th Street because I ordered the  Bistec De Palomilla (Tender thin top sirloin steak sauteed with orange-lemon sauce garnished with onions and parsley. includes rice, black beans, and soup )and I can't even say it looked good.  It was Not tender and a bit flavorless.  Like a rubbery chip steak.\nMy partner had the Ropa Vieja (Shredded flank steak cooked in creole sauce, onions, tomatoes, wine, and bell peppers. includes rice, black beans, and soup).  It wasn't even actually what he ordered but it was comparable as far as the menu was concerned so he just went along with it.  I tasted it and though I liked it better then my order, it was certainly nothing to write home about.  Presentation was that of a school cafeteria and there wasn't even a plantano on the plate.  Portions were small.\nI may go by there again for the Cuban Sandwich during lunch hours someday if I'm in the hood but don't hold your breath.  \nWe will stick to our favorite in the Haight for this style food from now on.  It has price points, atmosphere, and presentation.  None of which I could vouch for this place.  Go to Parada 22 instead.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "Thanks to a groupon deal I revisited after many years. I tried their Wednesday special of chicken and rice. I was very happy and most importantly my 20 month old devoured his food. We'll be back!", "author": "L P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-14", "description": "Ouch, this really hurts. I so wanted to love this place. Disappointed is a strong word. Perhaps too strong for the food in this case. Underwhelmed might be more appropriate. However, disappointed is probably not a strong enough descriptor of the service. \n\nI arrived about 30 minutes before my wife and ordered a beer while I waited. Knowing that she would be starving when she got there, I also ordered one alcapurria and some maduros. When my wife arrived, I had finished my beer and the waittress came over. We ordered another beer, a water for my wife, and she commented that the apps would be right out. 10 minutes later when she finally came to get our food order, none of those three things had come out yet. She said they would be right out. 10 minutes later, my beer came. My wife asked again for her water. 10 minutes later, still no water and no apps. We asked again and finally got the water. Eventually the apps came as well, but by that time it had been almost an hour since I ordered them and they were really no longer necessary. No apology or even acknowledgement of the wait. I cook maduros all the time at home. They take 5 minutes; cut and fry, it's really that simple. \n\nUnfortunately, the maduros were not very good either. They were really dry and not greasy or juicy at all like they are usually served, negative stars for the wait and disappointing presentation. The alcapurria was alright, but lacked a bit of flavor, 3 stars. I also ordered a pastel, which I had gotten to go before, so I knew not to expect much, meh, 2.5 stars. I got the mofongo, which was alright, but nothing compared to the version at Parada 22, another 2.5 stars. The wifey got the special of the day, fricase de pollo. This dish was alright, 3 stars is fair. I make a better version, in both of our opinions, but it had decent flavor. \n\nThe services just really killed it. It literally took an hour to get the apps. The waittress must have been newish. She seemed very uncomfortable with the names of the dishes on the menu, not to mention the Spanish pronunciations, always referring to them by their English descriptions (e.g., \"oh, so you want the sweet plantains?\"). She seemed confused a lot and, for some reason, was struggling despite there being three servers and only 5 small tables. \n\nWe will not be back for dinner. I could return for pasteles to go, but only if I get really desperate.", "author": "Miguel V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-27", "description": "Hadn't been here in ages and sadly, won't be coming up. Shocked at how expensive the bill was for the portions we received. Not proportional and we left hungry after a casual $50+ bill. If you're hungry for Puerto Rican food, worth taking the bus/car to Sol Food in Marin. Healthy, filling portions for a fraction of the price.", "author": "Mayra P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-24", "description": "Okay so I 'm Puerto Rican from NYC and I was excited to come and try the food here. Since we are a minority on this side and there are'nt many places to try Puerto Rican food I thought I was excited to try this place . Well firstly the people who cook here are not PR's....the food is okay nothing that is going to make me crave for this place at all. - food lacks flavor...service was okay\n\nthe mofongo lacked the pork fat that is usually added to it. and the pernil lacked so much flavor.", "author": "michelle r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-20", "description": "I live in the neighborhood and have been meaning to try this place for awhile.  Honestly, don't bother.  Considering the place was nearly empty the service was terrible.  Was excited to try the mofongo, but it was not impressive.  All the other dishes (when the food finally did come) were incredibly bland and tasteless.", "author": "Sam G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "Dinner here is one of the best values you can find, and this is among few restaurants in the Mission where vegetarians and non-vegetarians can all enjoy excellent, authentic food from other parts of the Americas. The flavors are wonderful, and the execution has been flawless on every dish I've ordered here, including, most recently, the red snapper. The place is small, unassuming, and usually not very busy... just how we like it, but in this case, definitely deserving of more traffic!", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-19", "description": "1 star seemed too harsh, so I'm going with 2. But the fact that I considered going with 1 star should tell you something.\n\nI'm 1st generation Cuban American, originally from Miami, FL, so I know my way around the Cuban Food block. Now I can't say how they do PR food or sandwiches, but I can tell you they don't do Bistec de Palomilla well at all. And that's enough for me to know not to comeback. Why? Bistec de Palomilla is the quintessential Cuban dish. White rice, black beans, and steak. Done. A Cuban joint messing that dish up is like an Italian restaurant doing lousy spaghetti and meatballs. \n\nThe palomilla at Frutilandia was greasy, the seasoning was all wrong, and it was pounded way too thin. If that wasn't bad enough, the white rice had some rock-hard, bottom of the dish grains in it. As for the black beans, they were passable. \n\nThe entree came with a salad which consisted of lettuce 2 slices of tomato and Veg-all corn, carrots and green beans. It was kind of a travesty, actually. The best part of the meal was the warm bread and the nice server. Everything else was bad and low budget.\n\nGood service and atmosphere go a long way with me and I don't know about their PR food or sandwiches, so I'll give them the benefit of the doubt and give them 2 instead of 1 star.", "author": "Gil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Love this place- the food is amazing- plantains delicious, momfungo amazing- shrimp with garlic sauce delicious the only lacking thing is the service- but it's a small run operation so will be back!", "author": "Jill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "I am probably the most picky eater to ever hit this earth... So to get five stars from me is most definitely an accomplishment. I walked in today after work and really wasn't looking for a full meal. However, I seen on the menu their camarones and I had to try it. It was shrimp in a creole hot sauce and I must say it was Epic! The best dish I have ever ordered anywhere hands down.  The flavors where perfection! I ordered the creole sauce hot (you have the option of hot or not) the heat was just enough! Not over whelming and perfect taste. I was very impressed by the service as well. Would definitely go back and recommend to EVERYONE!", "author": "Ms'Ducky S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "Excellent service, personable, friendly folks. Excellent food and descriptions.  ( I do not know Cuban and Puerto Rican food-they have both)\nOwned by a husband and wife team, they both wait tables.", "author": "Carol K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "This is our second time to this place and it is now under new administration.  The flavors of the food are amazing.  Very traditional and true to the Puerto Rico and Cuban roots.  The tres leche is amazing and we are very picky about it.  Definitely will come back and suggest you come here and enjoy some good Caribbean food.  Thank you very much for serving the best and having the best customer service around.", "author": "Roxana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "I really like this place.  Yea, its not like the Cuban restaurants in Florida, but the food is good and the people are really nice.  Its run by an older couple that like to speak Spanish, which is nice cause I need to practice.  Its reasonably priced, they give you free bread while you wait, which is great cause the food is not prepared quickly.  \nGo, if you want a place where you can enjoy a good meal, in a quiet cosy environment where you can actually have a conversation with friends.  Its just a nice, low-key spot with good food, good service, and no crowds.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-09", "description": "I'm a fan of Puerto Rican/ Cuban food and have eaten quite a bit of it. This was just ok. We ordered quite a bit as we wwere starving: Pastel Puertorriquenos, Platanos Maduros, Alcapurria, Tostones con Mojo de Ajo, Cubano sandwich, Passion fruit shake, and sweet potato fries. Everything tasted fine.. just not out of this world. On the other hand, service was really good. The place is cute, I like the location at the Mission. Not a bad place at all.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Friendly, attentive service combined with delicious, authentic Cuban food. The tostonas with lemon and garlic; the spinach empanadas; the Cuban sandwiches; and flan were soooo good. I would go back any time. It was like being in Miami.", "author": "Harvey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-18", "description": "Soooo excited!!! No more driving to San Rafael for awesome Puerto Rican/Cuban food. The pork chops are so good and delicious, tostones are done just right. Had the sample plate and it was yummy!!!!! I would defintly come back again and again. Staff was awesome!", "author": "Paulie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "Wow! \n\nI love CUBAN FOOD! Especially, the hole in the wall places.  \n\nMy boyfriend ordered the cuban sandwich and I ordered the thin sirloin steak marinated in lemon and herb sauce with sauted onions, rice and black beans.  My dish came with a bowl of chicken soup.  \n\nEverything on our table was the best Cuban food that I have had in a very long time! I would definitely come back again and again!", "author": "Honey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "Great vegetarian mofongo, but disappointed they don't serve fried pork. The service was a little slow, but everything was delicious. We'll be back.", "author": "Kitzzy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "My husband and I just came from having lunch at El Nuevo Fruitlandia.  We visited this restaurant quite a few times when the previous owner ran it and we always enjoyed their traditional Cuban and Puerto Rican dishes.  The new owners have added a few new dishes and have kept the traditional dishes but elevated them to new heights.  I had their paella, which included mussels, clams, chicken, sausage and shrimp.  The rice in this dish had wonderful texture and deep rich flavors and was cooked to perfection and kept hot in the pan it was served in, which added to the presentation.  My husband had the slow-roasted pork marinated in garlic, pineapple, and Caribbean spices.  He loved the everything about his dish and topped it off with a dark beer.  We split a side order of platoons and fought over the last piece. The service was friendly and professional.  The prize is in the preparation of their tasty dishes.", "author": "rita m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "I'm a huge fan of Cuban food, and being in the Mission, decided to try this place out for lunch. The space was clean and organized. Service was very attentive, and the owner helped me figure out what I wanted. He even brought me a few things to try. I love when that happens!\n\nFood-- 3.5 stars. It needs a little help. The salad dressing wasn't very good, and all of the appetizers and the entree was just \"Okay\". Nothing amazing.\n\nAmbience--4 stars. I loved the cuban music, and the space was clean and bright.\n\nService--4.5 stars. Very attentive\n\nPrice--4 stars. Very reasonable.", "author": "Amanda D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-20", "description": "Must haves:\n  Chicken soup\n  Platano maduro\n  Tostones\n\nThe rest of food was very delicious- but the above were excellent.  I lived in Puerto Rico for 2 years and never enjoyed mofongo, but the food here has a definate Island flavor.  \n\nSit by the window and enjoy the food traffic on 24th street, especially nice on a sunny day!", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "Delicious Cuban and Puerto Rican food!  I was searching for a PR restaurant serving alcapurria, finally found it here and it was delicious!!!!!  Mofongo, was excellent and moist!  (most places I've had it make it too dry, not here!!). Chuletas were moist and perfectly seasoned!!  The sangria was yummy too!  Can't wait to go back!!", "author": "Diane F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-17", "description": "Growing up with my grandmother's authentic Puerto Rican cuisine, it was defnitely  a sad day when I moved to the Bay and realized there was not a plethora of PR food (or PR people for that matter) out here.\n\nSo excited to try this place andbrought two of my new friends in Cali with me.  Service was good, overpriced for a glass of wine.\n\nWe Had:\nPastel- the best part of the meal, definitely not the best that I have had but edible\nPork- Bit dry and not well seasoned\nRice with piegeon peas- no flavor, nothing like rice I am used to\nTostones- ok but dry\nYuca- decent\nAlcapurria- so burnt could not even bite into!\nPapa Rellenos- did not come with gravy, not taste or flavor and the potato was crumbly\n\nOverall, not a good meal but the service was good.  Would not recommend but I guess if you have never had authentic PR food better than nothing.\n\nOn another note, if interested, there is a PR festival this Saturday 7/18 in San Jose go to www.wrprc.org.  The $ goes towards scholarships for higher education and I am hoping the food will be better", "author": "Jeannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-15", "description": "I just moved out here like a year ago from ct im puerto rican and i love my puerto rican food i harley eat it that much cause my mom and family live back in ct. I found out about this place and i was so excited so i decided to visit and man it was good food is great the service is awesome! the place is small but doesnt matter to me. I got a bowl of soup when i tasted it , it reminded me of my moms cooking great place great spanish food.", "author": "Steven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-02", "description": "My wife and I love this place. The food is not as greesy as it once was and as puerto rican can sometimes be. But the authentic \"must try\" in this place are the pastellas. Go ahead and try to find them anywhere else on the west coast. We had a devil of a time finding this unique dish.\n\nMmm mmmmm....", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "I'm not usually excited about a spot after eating there, but I can't stop talking about how good this place is. Maybe it's all the sangria that they kept pouring, but regardless this place is legit. The service was great. Really nice group of people. The pork with Caribbean spices was so good I wish I knew how to make it at home. My boyfriend and I are sure to become regulars after this. A Groupon well spent.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "This is the best and only Cuban restaurant in San Francisco.  On main and main in the Mish, this little restaurant is clean and homey.  It's your Mom's home cooking if she was Cuban.  The chicken soup that comes with the entree is generous and delicious.  Be sure to try their wide selection of fruit shakes.  A good change from your typical taqueria on 24th Street.", "author": "Laurence H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "My boyfriend and I ate here last night and everything was delicious. We had the pulled pork and red snapper for our entrees as well as some sweet plantains which are listed as an appetizer (but I think they taste better with the entrees). The sangria was really good and the service was super friendly and happy to answer all of my questions about unfamiliar ingredients. The place is casual but very clean and warm feeling which made it comfortable for a sit down dinner experience. I would definitely go back and recommend this place.", "author": "Natasha K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "I would give it 3 stars if there were more Cuban or PR restaurants in the city to which I could compare this one to, but there aren't.  So 4 stars it is.  Because honestly, I enjoy dining here.\n\nThey have this great chicken dish thats covered in some sort of green sauce.  A little on the salty side, but pretty tasty otherwise.  Standard rice and beans.\n\nDo NOT, and i repeat, DO NOT, respond with \"salad\" when asked for \"salad or soup\"... it is the most bare salad i've ever been served, and they don't even offer dressing.  At most, some olive oil and pepper.  The soup, on the otherhand, is delicious and absolutely bread-dip worthy.\n\n\nThe city needs more Cuban restaurants... i long for Bistec de Palomilla done the right way.", "author": "Gina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "I'm not Puerto Rican, but does it really matter? \n\nGood food is good food & Fruitlandia hasn't disappointed in the two times I've been in a 4-day period. \n\nOrder this and you'll be happy: \nMolfondo w/Gravy: Totally F-yeah worthy & the server loves to say how good it is (and you'll love when she does). \nTostones con Mojo de ajo: Your date will thank you \nSopa de Pollo: Better than anything your mother makes (seriously, pass on the dinner salad and get the damn soup)\n\nBy the way, whoever said the wine is expensive is a total dummy. $3 is like less than 2 bus rides.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "Food was above average (mine was good, my friend didn't like theirs as much) but the atmosphere and service were outstanding.", "author": "Phillip W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "I'm a Puerto Rican from Puerto Rico, not 2nd generation or from the east coast so I know as a fact how the food from island taste.  I have to say that when I tasted the mofongo I felt like I was back at home.  Awesome mofongo, the tostones were great, the papa rellena was great, maduros (we call it amarillos) were great, pasteles were great.  Overall the food was awesome, not 5 star because the rice and beans was just ok, not great, and the malta was not malta india from Puerto Rico, was some other brand that we dont have in the island. Hightly recommended!!!  Tell Carmen that John sent you.", "author": "John Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-19", "description": "I finally found a place for my days when Im homesick and Im craving some of my mom's food. Delicious Caribbean flavors! I was craving Cuban food on a sunday night and found this place here on Yelp. I saw the menu and immediately jumped on Bart and walked the streets of the Mission to find this small and cozy Cuban/PR joint. Since the minute I walked it I was like, ok, this looks good! the music and the art in the walls was authentic from the island. I ordered the Papa Rellena which is Cuabn and it was very flavorful. My favorite was the Mofongo, I would eat this all day every day when Im at home. and this one was very delicious as well and the presentation was super cute. Portions were big, big, big! The chef is Puerto Rican so he knows about which flavors to incorporate one each dish. IS definitely a most go if you are craving a delicious meal from the island. Prices are good as well. I will probably come to Frutilandia every weekend now that i have discovered it.", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-27", "description": "When you are homesick, this place works. When you can't drive to San Rafael to Sol Food, this place works. When you just want comfort food and feel at home, this place works.\nWhen you are with friends celebrating a b-day and explaining the dishes and tell stories from your childhood eating this food, this place works. Don't expect glorious dishes, just nice comfort food.", "author": "Cristina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "Note- that this place has been taken over by new owners since my original post. Still good food. But missing the \"grandma\" touch.\n\n***\nThis place was an absolute find for my wife and I. Having lived in Miami for a while, we were both craving a spot that would give us our fix of Cuban food. Paladar never cut it for me.\n\nThis seems to be a joint that is run by an older husband and wife team. The chicken soup that comes with the dishes is great. None of that canned chicken stock - you can tell that the chef makes her own.  We always ask the cook to make us some arroz con gris along with our food and she is always nice enough to oblige. My main staple in the place is the Ropa Veija - which i think is as good as I've had elsewhere.\n\nI read in some other whiney post that the owner is Dominican - but who cares. The food is among the best cuban food you can get in the bay area.", "author": "Vijay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-16", "description": "There are only 10 and a half Puerto Ricans in the Bay Area, I am one of them and \"nine\" of them are related to me. Not even the owners of Fruliandia are Puerto Rican. The only Puerto Rican restaurant in S.F. and they're not Puerto Rican. That gives me an idea.\n\nOK, maybe there are more boricua but I don't know them and it hasn't stopped this place from making great food. I usually get the same thing everytime. Mofongo and alcapurrias and tostones. My family also orders pasteles from them every year at Christmas time to bring home. Pasteles are a type of plantain dumpling that can have pork and other things and are usually wrapped in banana leaves (like my grandmother used to do) or cooking parchment.\n\nEverything I've had there has tasted authentic and I like to bring out of town guests there to let them sample the food of my people. It's a small place in the Mission and there only ever seems to be two people working so it's not good for large groups.\n\nThere are a couple of other places I found on the other side of the bridge but that is a separate review. For now, Frutilandia is the best place to go for Puerto Rican food. Oh yeah, and I guess Cuban food too.", "author": "Hunter G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-18", "description": "What a trainwreck! Was so excited to find Puerto Rican food so close to me. Went for dinner on a Sunday, never again. The place had just opened for the evening, we sat down and began to drool over the selection. We placed our order only to be denied at almost every request. After finally completing out order, of what we could order, we waited.........and waited. A party of six walked in about 20 mins after we were seated. As soon as they were seated, They had appetizers served. I glanced over to the table, those are the same appetizers we had order over 20min ago.  Then a party of two were seated, they received appetizers as well. By this point I'm trying to scowl my eye contact with staff with no effect. \"That's it\" I belched! I walked to the counter to tell them we were leaving. \"Here is your bill for the soda\" he sang out with a look of glee on his face. He had the nerve to tell me my food was on its way out as we were leaving. I just wanted to let yelp know, we went to \"Red Balloon\" around the corner and was served in less that 15min.", "author": "Juan Carlos R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "This is probably THE only SF restaurant that specializes in Puerto Rican food from what I can tell, but don't hold me to that.  I went here with a friend on Friday night before a jazz concert at the Red Poppy Art House, and the restaurant is tiny but in a cozy way as opposed to a clausterphobic way.  The night I went there was only one lady manning the bar, taking orders, and serving food but she was really sweet and patient since I didn't know what I wanted to order and we didn't have to wait too long for anything.\n\nExcellent dishes enjoyed that night include  Mofongo (mashed plantains and pork sauteed with garlic and olive oil...that you dip in a secret sauce), Pierna de Puerco Horneado (really tender pork with carribean spices) served with a tasty side of dish of rice and beans and my friend had the Ropa Vieja (flank steak in a creole sauce) even though I meant to tell him that I heard the Vaca Frita (fried shredded flank steak) was the way to go.  He enjoyed his dish regardless.\n\nAt $9.95 for an entre, I thought the prices here were cheap.    I'm glad I found this place (via Yelp btw) ...I'll definitely bring some friends here in the future....especially since the Red Poppy is right around the corner.", "author": "LaSha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-15", "description": "Before anything else this place is 3.3 to 3.5 stars...\n\nThe sandwiches are really tasty. I didn't order a sandwich but ended up getting one anyways, I guess the waitress misheard me. It was really good so how can I complain? Maybe she secretly knew I wanted a sandwich and changed it for me :)? They give you cup of sauce with your mofongo that's really tasty, I recommend using it in conjunction with the sandwich for maximum taste utility. \n\nThe service isn't super quick so have the expectation when you go in and it will help.\n\nI'm usually a tortas man but this sandwich is in the top 3 of latin sandwiches.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-10", "description": "Aye, caramba!  My Cuban and Puerto Rican relatives are rolling over in their graves. Sorry folks, this place is such a disappointment.\n\nI'm jaded.  My Grandmother taught my Mom how to cook Cuban food.  My Mom taught me.  I'd rather take the time and cook my own than eat here.  Except for Ropa Vieja because that is one big pain in the culito to make.\n\nI'm still searching for a decent Cuban place in the City other than mi casa.  If anyone finds one, please let me know.", "author": "Liz P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "The service was pretty bad but it was a busy Friday night so not overly surprised. The food was good, the surtido which has tostones, maduros (ripe plantains) and yucca were all really good. Mofongo was a bit dry and there was only maybe three shrimp in there made it a little less dry with the sauce on it. Black beans were decent, could have used a little more flavor but it was better than the last time I went which was almost 5 years ago (judging from the review I am looking at). Also, on the menu it should say that the pink beans have pork in it because friend of mine almost ate it and she is vegetarian. She discovered this after a bite and could taste the pork. At least the server should have informed us but they were fairly busy when we got there so I guess some important details were missed. Life goes on. I would go back but not during the weekend or at least during a time that they're not so busy. I am Puerto Rican so I know what this food should taste like, so I think there's definitely room for improvement. The empanadas de espinacas were quite good and one of my meat eating friends liked the alcapurrias.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "Fast service. I got the food within 10 minutes after ordering. Food was delicious. Got the black beans and slow roasted pork. Black beans were awesome as they have bacon in them! Perfect portion size filling. The Chef/owner is really nice and friendly too.", "author": "Shari B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-20", "description": "This place made me do the Happy Dance!  \nThe Ropa Vieja (shredded beef) dish was every bit as fantastically fabulous as the other reviewers promised.  Lots of peppers and onions mixed in, and not a hint of fattiness.  Just perfectly cooked, flavorful shredded beef served simply with rice and beans.  Awesome, \nWill definitely be adding this cozy little restaurant to my local rotation.", "author": "Becca V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "I had wanted to try this restaurant for some time but was always hesitant due to the inconsistent reviews it's received on here.  My Puerto Rican partner's craving for home cooking and his desire to give this caucasian American a taste of the Island finally won out and I decided to give it a try with an open mind, and I sure am glad I did!  \n\nWe arrived Sat. around 1:00 PM and only two of the 12 tables were occupied, with one waitress on duty.  After an hour about half of the tables were filled, all with what appeared to be local Mission folks, including a charming elderly couple, which I took as a good sign of authentic food.  On this day, service seemed casual as opposed to slow (as other reviewers have reported), but I could see it perhaps slowing down if it was too full or if too many people arrived at once.\n\nFood-wise, everything we ordered was delicious, including the each-piece-separately-toasted French table bread.  I ordered the Pastel app. on Yelp's recommendation, which I enjoyed quite a bit but wished was more tamale-like for my personal taste.  The Al Capurria was like a yummy meat-filled yucca donut which I'd definitely order again.  The complimentary chicken soup was as good as I'd want a chicken soup to be, properly salted and with very soft, moist chunks o'chicken.\n\nFor entrees we had Ropa Vieja (which my parter swore was properly cooked and had an authentic flavor), and Camarones al Ajillo, seven perfectly cooked shrimp in an amazing lemon-butter sauce.  We also tried the Chiles Rellenos just for the sake of comparison, and although they were much wetter than I expected or have had before (served in a casserole dish filled with sauce), they tasted great.  The breading was of course not crispy due to all the sauce, but it was still discernible and added to the flavor and texture of the peppers.  \n\nRegarding the side of beans which others have reviewed as \"watery and bland,\" my partner says the thinner sauce is the authentic Puerto Rican style.  I don't personally like watery beans, but I found this sauce to be just thick enough on its own and was especially good with the addition of rice, which I mixed in to all the sauces we were served. I felt the beans were \"delicately spiced\" rather than bland, meant to be a basic accompaniment, not a main flavor feature.\n\nSome reviews on here have negatively critiqued the decor, though I found it to be basic but charming, likening it to a restaurant you'd find along the road while traveling in the Island countryside.  It at least appeared to be very clean.  I didn't give the restrooms a try.\n\nI don't know if time of day or day of week are factors in some of the inconsistencies people have reported, but I'd recommend making your own decision.  Just be open-minded in regards to some of the negative comments and you should be OK.", "author": "Tim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "Great food! We ordered tapas (empanadas, mofongo, sweet plantains), as well as the slow roasted pork. We topped it off with sangria. Everything was delicious!", "author": "Nia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-18", "description": "I can't believe I haven't reviewed El Nuevo Fruitlandia yet. This place is probably the first hidden treasure I found when moving to the Mission a few years ago. My father lived in Puerto Rico and has always grumbled about the lack of Puerto Rican food in the bay area. So when he requested Carne Guisada (a slow cooked pork stew) for his birthday dinner, I thought, \"hey, I'm in the Mission, I can figure this out.\" We were not dissapointed. El Nuevo Fruitlandia is now a family staple.\n\nTheres a whole list of fried goodness for appetizers: the tostones (smooshed and fried slices of platano) are my favorite, although I wish they had some homemade salsa and not just tapatio. They bring you warm toasted water bread while you're waiting, too, which my sister adores. \n\nYou can tell they've made an effort to cater to vegetarians, which I really appreciate. The chile rellenos (about $7) are the best I've had, in a rich tomato and chile sauce with bell pepers and onions. The mofongo (smashed fried yucca)we get the vegetarian) is also very good, if a bit greasy. The platanos maduros (sweet) are reminiscent of fried bananas but somehow savory and delicious with lots of hot sauce and the white rice and black beans that come with every entree. Yucca con mojo is always perfectly cooked, creamy and so tasty with the lemon they give you squeezed on top. We usually order the salad, too, which is simple but fresh and good, with cucumbers, corn, onions and romaine.\n\nThey also have lots of juices and shakes. I like the juices, but last time I got the shake and it tasted like frothy milk and sugar -- I could barely taste the fruit at all, which was weird. \n\nThe service is very slow but that's because they make everything fresh right when you order it.\n\nThis is one of those unique little gems that reminds me how damn lucky I am to live in San Francisco.", "author": "Suzanne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-17", "description": "It's a cozy little place and has a great selection of traditional Cuban/Puerto Rican cuisine, including a number of veggie options.  Vegetarian mofongo!  Yucca!  Plantains!  Food is made to order, so expect a bit of a wait.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-19", "description": "We just finished another great dinner at El Nuevo Frutilandia.  I'm even more impressed because we got to chat a bit with the waitress.  Just learned this restaurant has been open for over 25 years, that the friendly cute waitress Irene (EE reh neh) has been working there for the past 9 and they are not Puerto Ricans or Cubans...  This is why we were both even more impressed.  The food is well done!\n\nI've been craving PR cooking for a while, so I got a fix tonight.  I went with my friend Rita C who is from the Dominican Republic; you can say we know Caribbean food!\n\nWe ordered mostly tapas stile entrees and we started with the famous MOFONGO, excellent!\n\nFollowed by ALCAPURRIAS- not bad but I miss the regular just plantain alcapurrias, these are made with yucca also.\n\nWe also had a YUCCA AL MOJO dish and followed by a BACALAO GISAU WITH RICE (stew of cod fish with steam rice) which came with the chicken soup or green salad.  The yucca was perfect and the bacalao less salty than I'm used to, but flavorful.  \n\nI most say, their chicken soup is darn good.  The most authentic Puerto Rican chicken soup I've had outside of the island.\n\nThis was a Thursday evening and they were not crowded.  However, the mofongo usually takes a while to prepare, so order it as soon as you are seated.  While you wait, enjoy some warm bread!\n\n===================================================\n\nThe only Puerto Rican restaurant I've been able to find in the city.  And trust me, I've looked!\nNot disappointing, try the mofongo, I love their version.  Maybe not before a hot date/night...  Two words - garlic breath.\nSmall, cozy, friendly waitress and good inexpensive menu selection - I'm coming back!", "author": "Yamil A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-07", "description": "Ok so gotta give them 3 stars because they went out of their way to accommodate us but I was expecting better...\n\nSunday evening, after a trip to MoMA we made a much anticipated trip to Frutilandia.  Keep in mind, I'm Puerto Rican -born and raised- so I know what most of the dishes should taste like.  Trying to be reasonable I don't expect them to be up on \"tastes like when grandma makes them\" status but at least I expect them to taste like if I went to a hole in the wall place in NYC.\n\nWe drive by slowly to check the location around 6:45pm when I see the sign that says CLOSED... Hmm, their website says the hours are until 8pm...  Circled the block and decided to get out of the car and look to see if it was a 4th of July weekend thing but nope, no hours on the door either, hmm.  Then I see her, the waitress inside.  I proceed to knock and signal her to come on over... Success, she heeds my call.  Busted out the Spanish to seem more convincing and she explains that even though they are cleaning they could serve us if we didn't mind.  Score, we go in.\n\nI had looked at the menu online and had pretty much an idea of what I wanted.  There were a couple of things they didn't have (won't hold it against them since they were closing after all) which were the guava juice and the chicken soup that you can have instead of the green salad.  Order for two looked something like this:\n\n- 1 alcapurria\n- 1 pastel\n- 1 side of amarillos (ripe, fried plantains)\n- 1 order of tostones (green, fried plantains)\n- Camarones a la criolla (shrimp in creole sauce)\n- Ropa Vieja (shredded beef in tomato base sauce)\n\nThis came with side of white rice and black beans (Cuban frijoles) and some bread.  Ok here come to complaints...  The alcapurria, the \"dough\" tasted unbalance, meaning they used too much of one ingredient (in this case the baby green bananas) and it was overpowering....  They were also oily.  The pastel was ok, certainly lacking the usual kick of flavor I am used to.  Tostones were ok, I make better.  Amarillos are impossible to screw up so these were good.  I have never been a fan of frijoles but these were bland.  The camarones were ok... although the criolla sauce was bleh at best.  Ropa vieja was again ok, nothing to bring me back.  The mamey and pineapple shakes we got were yum though.  Too bad they didn't have guava....  All of thise for around $45.\n\nI might come back and try to aim for when they are busier to see if then the quality of the food improves even if the service is slower as some reviews mention.  All in all, super sweet of them to seat us when they were getting ready to go but the food...  If I spend a little extra time and effort, I can make it better myself....\n\nfood - 2 stars\nservice - 1 star\n\n3 stars at best as of now.", "author": "melisa n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-17", "description": "Hmmmm....this is a 3.5, really.  \n\nI can't say I am an expert on Puerto Rican food.  So, I'll try keep this light.  \n\nDecor - Eh... pink walls and Puerto Rican maps on the wall aside, they could have done better. \nAppetizers - This was the highlight of our visit: nice, crispy and garlicky tostones and very good pastel (although it is on the small side)\nEntree - We shared a chicken dish that came smothered in a really good green salsa/criolla sauce.  It was tasty, but the serving was very small.  The salad was bare - it came with absolutely NO dressing what so ever!  WTF? \nI am sorry but for $10, this entree was on the pricey side. \n\nAfter my meal at Nuevo Fruitlandia I dreamt that I was Boricua, a hot Puerto Ricena woman with big boobs and a big butt at that. In my dream I was grinding platano to make pasteles for my adorable Puerto Rican kids (they looked like Max and Emme, JLo and Marc Anthony's kids) waiting at the dinner table (overlooking the clear blue Puerto Rican beach).\n\nAnd then I woke up....I felt myself up - I am still the short, flat behind Asian chick that I have always been.  Why the weird dream? Maybe it was the tostones....", "author": "Clarice V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "We were leaving Modern Times Bookstore and hungry.  Why not try a Cubana restaurant, eh.  The service was rushed, because unbeknownst to us, they were actually closing when we walked in.  (Oops, next time you should lock your front door.)  So, they allowed us to sit down and eat, but she was whisking away plates and cups to the point of being halfway disrespectful.  We ordered rice and beans, plantains, and a chicken dish with the most delicious green sauce.  I didn't try the plantains, but my dinner companion thought they were cooked just right.  I'd love to go back and try more traditional dishes.  Too bad I'm not a pork eater, because I really want to try the traditional Cuban sandwich.  Oh well, until next time...", "author": "Felicia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "I lived in Puerto Rico for 35 years and this food is as good as the one I had back home.  The tostones were great, plantain was the right consistency, not to salty, beautiful yellow color, I loved it. I'll be visiting again there soon.", "author": "Edgardo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-30", "description": "Soooo...again, I am BORICUA.  I have gone to Fruitilandia several times over the years.  And like the other reviews, I so desperately want to give this place a great rating, BUT i just can't....\n\nThe pastellas are homemade and scrumptious.  Just like my great grandmother used to make.  If nothing else, at least try this place for the pastellas, because EVERYONE on this planet would be a happier, better person for having ate a homemade pastellas...\n\nNow....back to the rest of the place... the mofongo is dry and kind of bland, BUT the garlic sauce is tasty.....\n\nBut the service is soooooooo slow here....don't go starving, cause you just might start chewing your left arm off while your waiting...\n\nI highly suggest getting appetizers there...because the main dishes are just iffy....\n\nto bad Sofrito in Oakland has closed.   Now THAT is authentic Puerto Rican food....", "author": "Gretchen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "I've been coming here frequently over the past year because I work nearby and the food is amazing! It's my favorite restaurant on 24th st by a long shot and the small, intimate ambiance is perfect for a date... Or you can just eat at the bar like I do when I'm alone. It's taken me a year to write a review but I'm gonna give it five stars!", "author": "Shane D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-27", "description": "Okay, so I've only been here once, but it's not my fault. I want to come back, but it seems that every time I wander by, they're closed. What's up with the funky hours?\n\nAnyway, on my one visit, I was delighted by the vegetarian mofongo. Mofongo is a dish I had not tried before and it was fantastic.\n\nThe place is cozy and the staff was super friendly despite a bit of language barrier. We ended up saying \"thank you\" to each other A LOT. Anyway, I'll keep walking by hoping to see if it's ever open again at any point other than while I'm at work.", "author": "Jere K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "I am so pleased to have discovered this place!  The food is so delicious and homey and unpretentious, and the atmosphere is so friendly and charming!  I don't know from authentic, all I know is if it tastes good and is satisfying, and whether it's a good deal for the money, and this place hits high marks for all three.  I have returned several times with friends from South America and Puerto Rico, and each of them gave it high marks, too, and have told me that they have gone back again to introduce it to others.  I have had the roast pork, the shrimp, the picadillo, the chicken, and each of the appetizers and each of the desserts...they are all 100% worth ordering again.  If I had to choose a favorite, I would probably say the pork...it's \"oh my god\" good.  The sangria is wonderful, too!   I could seriously have dinner here at least once a week.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-08", "description": "We heard this place had mofongo, a wonderful mash of plantains, spices and pork that we enjoyed in Puerto Rico several years ago.  And it did, but it wasn't that good.  It was dry and tasteless until we poured some mystery broth over it -- not sure if that was the right thing to do, but it worked.\r\n\r\nThe picadillo was bland.  The ropa viejo was OK.  The appetizer dumplings, however, were unique + tasty.  Cheap eats.  Not sure it's worth visiting again, though.", "author": "Rufus X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "One of us is half Puerto Rican but grew up really fond of the food.  The appetizers and the pasteles are really authentic, but the mains are less so.  \n\nFor instance what they call Pernil seems more like Spanish food than Puerto Rican.  Real Pernil is usually one of those traditionally poor person cuts of meat such as pork shoulder marinated for about 24 hours and then roasted until it has a crust with some crunch but is still juicy inside.  Something like that would be difficult to make ahead for a restaurant when you have no clue how many people will order it, so compromises end up being made.  At Sofrito in Oakland they leave it roasting all day, whereas at Frutilandia it has been turned into a flattened sauteed pork chop.  It is not bad, but it is not quite right either.\n\nIf you want something more authentic go to Sofrito in East Oakland.  If you have been there already and are looking for something better buy a copy of Puerto Rican Cookery by Carmen Aboy Valldejuli (for Puerto Rican food its a cultural institution in the way that Joy of Cooking and Fannie Farmer was for a generation of people here), the instructions are easy to follow although you need to drastically cut the salt if you would like to live past 50.", "author": "Toy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-08", "description": "I'm no San Francisco native.  I can count on a hand the times I've been here to do non-touristy stuff.  One day, I was wandering around the city with a good friend of mine, and I decided to give an old friend of mine a call.  She, who is far more familiar with the city, suggested that my friend and I try this place, that it was the best Puerto Ricense/ Cubano food that I'd ever find in a restaurant.  Well, I took her word for it and we went and tried it.\n\nI cannot remember what I had, for it was almost three years ago, and I've only been back once since - but I remember leaving content and not poor both times I went, which is a big deal in my book.\n\nI love Latin American food - the spices, the flavors, the contrasts and the staples.  This is a pretty darn good place.  Very very small, but worth your time.", "author": "Cody G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-12", "description": "Very homey, nice meal, we ordered an appetizer and I ordered the pork dish. I was with a Puerto Rican who grew up with the kind of food they serve, it made an experience a whole lot different! I understood most of their conversation in Spanish when they talked about food! It's an universal topic!!", "author": "Yoko S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-06", "description": "So we decided to try this place on a whim one early evening to get some dinner on our vacation.  It was about 4pm and the restaurant was all but empty: we thought perhaps it was just a downtime before the dinner rush.  Now we know that maybe there was something else to it!\n\nThe food wasn't bad, but it was really nothing special.\n\nBut what disappointed me the most was the complete and total lack of service by the one waitress in the restaurant.  I think she visited our table a total of 3 times.  Once to take our order, once to bring the food, and once to take our money!  I'm not even sure she refilled our water glasses during our meal.  What really got me was that even when I asked for assistance, it was hard to get any attention.  Mind you, there was only one other couple in the restaurant at this point.  I needed silverware, and because the waitress was so busy playing with her phone, I needed to get up to get her attention. So I got up, walked to the other side of the restaurant to ask for silverware.  Rather than just hand me some, she directed me to the metal cup on the table which was supposed to have silverware in it.  Well, since ours didn't, when I returned to the table I had to get up again to hunt down a fork from another table.  After checking the three tables immediately around us and finding only butter knives, I had to walk again to the back of the restaurant to take from another table.  Oh yeah, and then I had to do that whole process again to get napkins....\n\nI wouldn't have minded as much, but there was nothing else going on in the restaurant at that time.  The waitress wasn't prepping, cleaning, organizing, refilling the empty silverware and napkins on other tables....she was playing with her cell phone the entire time.\n\nAs I said above the food wasn't anything special, so I can't even say there was a saving grace for our whole experience.  In that neighborhood, you can eat at any number of places with similar food, and almost certainly better service.", "author": "E S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-06", "description": "It's not Cuban food, I'm not sure exactly what it is but it's definitely not Cuban. I realize that I'm not in Little Havana or Spanish Harlem, I get that, but having Cuban food on the menu doesn't make you a Cuban restaurant. I think the owners are actually Nica's or something, but they're not legit. If Wang Foo's Chinese restaurant served spaghetti and meatballs could they be classified as an Italian restaurant? The bistec palomilla was way off, the chicken soup is some kind of Mexican/ Peruvian hybrid, and the black beans were straight out of a can. Also, when you order papas fritas from a legit Cuban spot, you get thin fries that then get thrown onto the steak and get taken down in one fowl swoop, not some steak fries with old bay seasoning that have to be ordered separately. \nI gave an extra star for the effort, because this is after all San Francisco and no one knows good Cuban food around here.", "author": "mario p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-14", "description": "I came here on a date today, being that my date was Puertorican I let his ass do the ordering.  This location definitely has that hole in the wall vibe. Being that my mom grew up in the Caribbean, this type of food was not too foreign to me.\n\nIt appeared that only one lady was running the entire show there, so good thing we came at a non-busy time.   I requested to try the mango shake, and ordered their Sunday pork special.  My date also got an assortment of the appetizers but please don't expect me to remember the names cuz I'm Americanized like that!  My favorite was the smashed up plantain fried with the garlic dipping sauce on the side.. delish!\n\nEither way, everything was really good, although I'm docking a point for finding part of a plastic something in my shake, which I could have choked on had I attempted to swallow it! \n\nThe main meal was ok, the pork itself was a little on the dry side, but I found dunking in it that garlic oil stuff to do wonders.  The yucca was yummy and so was the bean rice combo stuff.\n\nI'm not sure if I would make the the trek out here on my own to come back, but if I have a Spanish speaker as my escort I'd definitely be game again!", "author": "Jaime P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "Definitely coming back and trying more menu items!\n\nMofongo -- HELL YES!  So good.  \nChicken Soup -- yummy, yummy, if I were sick, I would want this.\nPierna de Puerco Horneada -- so tender, delicious green marinade...\nRopa Vieja -- deliciously flavored, my friend loved it.\n\nLoved hearing someone chopping something all to hell in the back.  \n\nClosed on Mondays and no special on Wednesday...\n\nYes, service is slow but this is an island restaurant...also they were out of several of the beers, but again this feels *authentic* to me.  And can someone please.  Please.  PLEASE direct me to a location where I can get a can of Medalla Light?  I drank that stuff like water in PR.", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-11", "description": "FOOD 4.5 stars\n\nService and Bathroom -  2 stars\n\nYou know those little local restaurants you find on hidden away streets when you are on vacation?  You know, the ones that are amazing one night, but may be just OK on another night?   The ones with seating for less than 20 people?  The ones where you know the menu doesn't change much because they like what they make and it usually tastes great.  Then ones where you go to use the bathroom and you think about donating enough money for them to replace the disgusting mini-blinds that are so bad they make you throw up a little bit in your own mouth?  (ok, perhaps too much info)\n\nWell this is one of those places.  I have the picadillo a la viejo and a hot and crispy order of the tostones.    The tostones came to my table reeking of garlic and too hot to eat  --- PERFECT.\n\nThe main dish was like something I would get at a Cuban friends house (except that the rise was just OK).  The flavors were great, the portion was a good size.  \n\nI will be back soon.", "author": "Dan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-08", "description": "Used an AmazonLocal deal of $12 for $24 worth of food. Ended up spending $18 all together (with tip). TERRIBLE FOOD AND OVERPRICED. I ordered the appetizer combo without the alcapurria (since I'm pescatarian) and extra tostones instead. The tostones were hard, over-fried and tasteless. The maduros was okay but a little over-fried as well. The yucca was okay. I then ordered the baked empanada with spinach, ricota cheese, and onions since they were out of the cheese, tomato and basil one. They come pre-made apparently. It came out looking like cafeteria food. The empanada was smallish and hard, almost like it just came out of the microwave. I've had better hot pockets than this!! It was served with a small plastic bowl of flavorless black beans and a side of rice. I didn't even get the cilantro chutney with it but it's my fault for not reminding the waitress. It also came with a salad that was very skimp on the dressing. Overall, very overpriced for the crap they serve on a plate. Can't remember a worse meal I've had in the city, literally. It was my first time having Puerto Rican food, maybe I'm just not a fan but this was almost insulting. On top of everything, the fried plantains mixed with the microwaved empanada and black beans made my stomach toss and turn a little afterwards. Very unsatisfied and will never go back to this hole in the wall. The server was very sweet though so I give it a star.", "author": "Macaulay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-20", "description": "IF you LOVE garlic and LOVE plantain ... you have got to try the MOFONGO at this place! The first time I ever tried PR food was here --- at Fruitilandia ... that was about 3 years ago ... BOY ... when I took my first bite of that MOFONGO ... OMG! so much going on in my mouth ... flavor bud wise ~~  I've yet to have better mofongo ... the other stuff on the menu is good ~ nothing FANTABULOUS ... but the MONFONGO is indescribably delicious!!!  Overall~I would def. recommend!!", "author": "Bravo J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "I have been here a few times, and im always satisfied.  my cuban and puerto rican coworkers swear by it as authentic, and authentic or not, i know good food when i taste it.  not to mention, its easy on the wallet.  good lunch specials too, sandwiches are yummy.  other good stuff includes, ropa vieja, baca frita, mofongo, pollo en salsa verde, those are the ones i have tried, and will try some more stuff when i go back.  the little tamal-like pasteles are yummy too.", "author": "Charlie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-03", "description": "The food was ok.  I tried the ropa vieja, very small amount of meat and very oily.  I also tried couple of appetizers and the oil seem burned.  I wont' come back", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-26", "description": "Great food for a reasonable price.  \n\nI left there so full and reminded me of my trip down to Puerto Rico and all the good times.\n\nLove the warm bread and they play great tunes...Have you heard a Bryan Adams song in Spanish?  If not, go here...", "author": "Dan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-24", "description": "I've been dining here since before I could crawl and I still frequent this little authentic Latin restaurant in the Mission. I love it, I'm half Cuban, and this place reminds me of abuelas home cooking. It's the real deal and is the closest thing you're gonna get to authentic Latin food in the Bay Area.", "author": "Diego C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-20", "description": "horrible service. took forever to get a seat and they took so long to take a drink order that we walked out.  it wasn't that busy either, they just do not aim to please", "author": "Alejandro S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-25", "description": "I walked in excited.\n\nI walked out (after eating) feeling eh.\n\nNothin to write home about.\n\nMom cooks way better.\n\nBeen there; done that.", "author": "Sergio R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "my boyfriends dad got a group on deal for this resturaunt and we planned to go for months just yesterday a day before the coupon expired we went down to have a good meal together. I enjoyed the place i think it would be advised to come earlier because twoards 7 or 8 the more complicated dishes arent being served. it was quite small but frisco is famous for having small diners with some of the most amazing food. i got the alcapurria and it was delicious if only it was TRIPPLE the size but it was a great appetizer maybe order 3 or 4 to start you off i only got one and loved it! I would say the service was a bit slow but they were very friendly and tried to accomadate all our needs and they were quite busy before closing. I also wish they had photos on thier menu because im not familiar with all the dishes they served but they all sounded amazing i think i could have picked something even more delicous for my entree if i was able to see more photographs of the dishes. Other than that our deal came with 4 sangrias for all 4 of us who attended and it was mixed just right. I think overall if your ever feeling a little lazy to cook some puerto rican food and you want to get out of the house why not stop in. i will visit this place again some day soon. give it a try.", "author": "Saranaz S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-28", "description": "so where do i start....1# the salsa music playing gave it a latin welcome vibe..2# had the mofongo and that was good but not good!..3# i had a sangria and that was bla!!..4# i had the ropa vieja with puertorican rice and lets just say i wish i rather had gone to the taco truck instead..5# if i was running the place i make it a priority that when the guest are done to make sure the waiters remove the plates before bringing out the bill..6#bottom line only reason i go bk is if i was walking near by and had to use the bathroom other then that this place let me down...but ill let u make ur own call..", "author": "Ivan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-03", "description": "The Bay Area has real Cuban food!!!  Who knew?  I spent a summer living in Miami, and ever since then, I've been craving authentic Cuban food, and I've finally found it here at Frutilandia!    It's a hole in the wall in a semi-sketchy part of the Mission, and we were the only people when we went for lunch around 1 pm, so we were kind of scared that the food was going to be terrible, but it was fantastic.   Order the tostones and the bistec empanizado (my favorite Cuban dish).   Skip the papa rellena.", "author": "A M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-05", "description": "We started on a promising note at these cute renovated spot, however by the end, we were extremely disappointed in the service and food.  We arrived in the thick of the Dia De Los Muertos procession on 24th St. and were promised a table for 4 within 15 minutes, which was accomplished.  The waitperson was very sweet and accommodating.  However, once we placed our orders, they forgot to bring our eating utencils, plates and napkins, they forgot our salads which were included with the entree, and the food either came out lukewarm or later than the other entrees.  When I informed the waitperson that they forgot to serve our salads, he apologized, but didn't offer anything else to compensate.  He could have comped our dessert and coffee, or given us more sangria, but nothing.  I think they were too overwhelmed by the crowds, but Customer Service 101 basics would suggest you do something to make up for a mistake with the customer.  Needless to say, I'll go somewhere else on 24th St. as there are plenty of other options.", "author": "Julia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-07", "description": "I was so happy when I finally found this place.  You can almost miss it because the sign is so small.  I am half Cuban and half Puerto Rican.  I thought I had to wait till I went to NY to visit relatives so I could have pasteles.  They had them here and the waitress told me they have them every day (not just on special occasions).  The soup actually bought tears to my husbands eyes.  He said it tasted exactly like my mothers.  I was not having soup, I was there for the pasteles.  I took a dozen home with me.", "author": "Molly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "i'm hoping people can give this place 5 stars from now on because they truly deserve it , other than the service is super fast  the food is extremly hearty and homemade, big portions and a great prices, i think they remodeled it looks neat and very cozy , bring their stars up people they deserve it,  we had a great chicken cilantro stew and shredded streak with creole sauce , amazing :)", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-07", "description": "Bland beyond belief, flat tasting and simple. I have found that the only Latin American food I'll ever eat is Mexican.", "author": ".James A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-15", "description": "With every passing year, I think my metabolism slows down another critical increment.  And so, no way was there going to be a ridiculous MEATFEST for my bday this time!  We loaded up instead on plaintains at El Nuevo Frutilandia, in the form of their Aperitivos Surtidos and Mofongo.  I'm not sure which item was what, but the tamale looking thing on the combo dish was great, and the Mofongo (it was like hash) was REALLY good with the accompanying tomato-ey/brothy sauce.\nOkay - we are talking about MY bday - so there was plenty of protein coming thru the kitchen.  The Fried Pork Chops were AWESOME, just like grandma used to make.  Yes, my grandma is Chinese, but nevertheless, it was JUST like how she used to fry it up - simple salt and pepper yumminess. I got the Picadillo a La Habana Vieja - which I enjoyed - can't go wrong with ground beef, tomato sauce and pimiento olives. I also got a bite of their Ropa Vieja - which was just ok to me; I mean it was moist and flavorful, but over-hyped to me.\nI wish I could say how the dishes my other companions tried were, but they ate it all :-\\\nIn conclusion, it was classic home-cooking w/Puerto Rican spices.  I could probably make a lot of the stuff myself, but being the lazy fuck that I am, I'll pay the very reasonable prices to have El Nuevo do it for me.  Just be forewarned they take that treat-you-like-family-thing to heart: they'll take their time, you gotta bug the waitress for what you want, but she's gonna give you a big ol' kiss and hug if it's your bday.\n\nAs I get older...but not really wiser...that worked out just right.  Having some good food, and spending time with people (some I see everyday, and some I don't get to see enough of) who warm my otherwise dead insides....there was no better way to spend my bday.\n\n*WTF with the happy sappy shit? Finds a little kid to push down*", "author": "CINDY K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "I'm so glad I discovered this hidden gem! I'm not at all familiar with Cuban or Puerto Rican food, so this is a nice place for me to branch out. Everything I've ordered has been delicious. Great service, too (the waitress is awesome!).", "author": "Joyce G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-31", "description": "I'm not a real fan of this place but hey, if  I gotta get my fix of Cuban food way out west from Miami where I'm from, this is about as close as can get.  The casual family style ambience does take me back to those Miami restaurants you walk into with the plastic placemats, a cold glass of ice water, and a basket full of  hot buttered Cuban bread.  OK, Fruitilandia is not quite that.  Nothing here approximates what real Cuban bread is like.  The food is OK which is another reason I rate it 3 stars but for being Cuban food, the portions are small.", "author": "David R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-15", "description": "I'm sticking with 2 stars on this one. The mofongo is growing on me and is quite tasty but it's not enough to outweigh the slow service and other mediocre food. This recent visit I had plantains, beans, and rice. The beans were surprisingly disappointing. Who screws up beans? They were watery and bland. The plantains were just okay, too. Much prefer the plantains at Bissap Baobab or ChaChaCha.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-27", "description": "The skrimps were absolutely fresh and delicious in a slightly-spicy red sauce. The plantains were crispy, salty, and sweet. For some reason, I thought this place was Cuban, but no worries. I'll be back the next time the mood strikes.", "author": "Jess F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-22", "description": "I'm always surprised SF doesn't have more Cuban restaurants.  This place is AMAZING and we'll definitely be back. Great Cuban and food and we felt like we were back in Miami.  My husband and I went and had a huge spread for only $30 - great value for your money.  The staff was also incredibly nice.", "author": "M P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-10", "description": "I had such high hopes for this place. Since it's the only Puerto Rican restaurant in SF (that anyone can find) I really wanted to give it as much praise as I possibly could.  \n\nUnfortunately, I'd have to rate the food at Fruitilandia as so-so at best.  I  started with the Mofongo, which had a delicious garlic sauce but I couldnt taste any of the bits of pork, and the large pieces of fried tostones nearly chipped my teeth.  My sis had the Yuca Con Mojo (yucca with garlic).  She really loved that dish and I thought it had a great flavor but the yucca is way to rich for me.  My little nephew had the french fries, which were the best fries I've ever had anywhere, yummy!  Next, I tried the fried pork chops with rice and black beans.  Again, flavor was fabulous but the chops were fried to a crisp.  Sis had the Camarones Al Ajillo, Shrimp with Garlic.  The only problem with this dish was that it should've been described as shrimp with wine sauce because the wine was soooo overpowering, that was all we could taste.  The mango juice was refreshing and the chicken soup was good.  I am willing to give this place a 2nd chance, if someone on yelp can recommend a few of the outstanding dishes to try out.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-05", "description": "I've had a lot of Cuban and Puerto Rican food in New York and there was something missing to the point that I didn't recognize the food as either Cuban nor Puerto Rican.  There was no WOW factor to any of the dishes.  I had the Chile Verde Chicken and my guest had the steak.  The chicken dish was boring and the portion of black beans would have been size appropriate for a four year old.  The chicken dish and the overall flavors reminded me of a El Salvadorean restaurant closer to Valencia St.\n\nMy guest liked her steak but thought the food was bland.  We looked around and we couldn't figure out why the restaurant was full and we decided that the Americans liked it because it was bland.  Nothing picante here in a neighborhood full of picante restaurants. \n\nBack to the Cuban restaurants in New York.  I never saw just plain white rice served.  The rice always had tomato, or zafron or cooked with chicken broth that gave it real flavor.   If you want an authentice Cuban or Puerto Rican restaurant, this isn't it.  If you want someone's idea of Cuban or Puerto Rican food that has nothing spicy and you have hours to wait for your food and anything else you order, this place is for you.     \n\nService was horrible.  The waitress never brought our coffee and gave us butter but the bread never arrived.  We waited 10 minutes before the bill arrived and this is a small restaurant.", "author": "Todd T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-23", "description": "This place really needs to get it together.  I'm all about the chill laid-back latin american ambiance and vibe but it seems like the people who run this restaurant are more concerned about socializing with each other, playing on their android phones and babysitting their kids than taking care of their customers.  The food was mediocre at best. Was that boil bag rice they served me? The meat appeared to be roasted but was served in an odd shredded manner unlike any meat I've ever been served in a cuban restaurant (usually it comes out in one whole piece- like a roast or a skirt steak).  I wasn't asked if I wanted another sangria until I was signing the check and on my way out the door. I was served my dinner without cutlery and had to ask for a fork. the next day on Thursday when I walked past the place, the management had a sign advertising the food special that was offered the day before still on the sign (and the sign read, \"Wednesday\"). The people were kind of friendly (although much more so right as I was signing the check/tipping) and seemed nice but overall it was just an overpriced, mediocre experience.", "author": "Shane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-30", "description": "Wow!!!  I will fly in from LA for their authentic Puerto Rican food.  I felt like I was home.....on the island of Puerto Rico.  The slow service is worth the wait, because I know they are cooking from scratch not frozen.  The best alcapuria I have had in years!  Carne gizada, with white rice and pink beans, mmmmmm....delicious.  Tamarindo drink perfect, not to sweet, not to tart.  Can't wait to fly into SF this weekend.", "author": "yolanda g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "This place is amazing. The food is made to order, it takes a while but is very worth the wait. Order the soup it is very tasty and so are the mofongo and tostones. I ordered the milanesa plate and was very pleased. We come here every time we are in town.", "author": "Jackie J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-04", "description": "I have to start off by saying that I never write reviews because I just have way too many other things to do. However, I have to write about Frutilandia because I am a Puerto Rican woman who grew up in Spanish-Harlem and spent many childhood summers in Puerto Rico. I cook Puerto Rican food, my family cooks Puerto Rican food, I love Puerto Rican food, I love to promote Puerto Rican food because I like to spread love and happiness.\n\nHowever, Frutilandia DOES NOT cook authentic Puerto Rican dishes. I read some reviews from some other \"Puerto Ricans\" who stated that Frutilandia is authentic. They lie. A real Puerto Rican, or even someone who has simply spent time in a Puerto Rican community will tell you that this is not Puerto Rican food. Some of the food may look authentic but isn't. This upsets me because I don't want people to think that this is how our food tastes. Puerto Rican food is just such a beautiful thing and I don't want it to get a bad rep because of Frutilandia. \n\nNow on a positive note the staff is very warm and friendly. I feel kind of sorry for them. The food is just soooo bad. \n\nIf you want to get an idea of how Puerto Rican food is supposed to be prepared, take a trip out to San Rafael and check out Sol Food. I've never eaten there but a friend of mine who was born and raised in Puerto Rico always brings me food from there and it is gooood, and he said the owners are from Puerto Rico.", "author": "Yvette L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-08", "description": "The place was cozy, the lady was nice- she even let me cancel the mango shake which I originally ordered but then decided to slurp some of my friends instead. I ordered the fried plantains, YUMMY, Mofongo, Yummy, but the Beef shredded dish was a bit disappointing, a bit dry and not so tasty.. I had to hot sauce everything. But since it was hanging with friends, the place was nice and quiet!! we came at like noon, no one was there.. but it was a random Wednesday for lunch .", "author": "Tulie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-28", "description": "tasty little cuban/puerto rican restaurant in the mission.\ntheir agua frescas were pretty good.  i can't remember the name of the one i had though.  some exotic fruit :)\ni had some pork chops for dinner which were tasty, but not anything extraordinary from alot of latin restaurants.\nthe service was friendly and the restaurant was pretty quiet since there were only about 3 or 4 other diners while i was there.", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-08", "description": "Really disappointing experience. Restaurant was empty apart from one table and that should be enough information right there. They were out of their special of the day (bacalao), but since it was a weekday and the restaurant was pretty much empty, I found this very hard to believe (read: they never made the special of the day). The vaca frita I ordered instead was small and much tougher than meat that simmers for so long should be. We waited about 45 mins. after ordering. The chicken soup was very bland as well. Our waitress was very unfriendly. My friend had some yucca that did seem pretty good. I will not return though - worst Cuban experience yet.", "author": "Alexander G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-29", "description": "I had a friend visiting from Puerto Rico. He wanted to sample local Puerto Rican fair. This was all I was able to find. So off we went. With the exception of the Mofongo, which was really tasty, I thought the food was pretty bland, but not bad. When I think Latin I want spice. I want heat. There was none of that. Just simple Puerto Rican and Cuban comfort food.", "author": "Kent T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-22", "description": "The food is delicious and the service is still the same.  It might take a while for your food to arrive and you might be half done with your fruit shake, but once you hear those pounding foot steps getting closer, that means that you're foods comin'.  I love the bistec, and savoring the traces of garlic, the black beans, tostones, yucca frita, sandwich suisso (toasted bread with ham and swiss cheese, not a lot of ingredients, but damn tasty,) and the fruit shakes.  On the walls you can see that Marc Anthony and Jennifer Lopez have already eaten there. Not much has changed from the time I was a six to now, except they added \"Nuevo\" to its name.", "author": "Glu C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-28", "description": "This place has AWESOME Cuban and Puerto Rican food.  Ever since I moved out here from Florida, I've been missing good Cuban food and I finally found it!  I had the mixed appetizer platter, which was HUGE and delicious, and the Vaca Frita, which was so good it much be a sin.  Only reason I can't give 5 stars is because there was only 1 person working the WHOLE restaurant while we were there, so service was slow, and she didn't really speak English so I ended up with red wine when I ordered white.  Otherwise, though, an excellent restaurant and I'll definitely be returning!", "author": "Liz P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-14", "description": "Puerto Rican here.  Great place. The Vaca Frita (although Cuban) is by far my favorite plate. You HAVE to try it!.  Also try the Yuca al Mojo, mmm.", "author": "Noel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-14", "description": "Good cuban sandwiches.  Pierna de puerco is also a good one.  The Sunday night special is tasty.  The owner is very friendly and helpful.", "author": "Al K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-23", "description": "Don't come to Frutilandia if you are in a hurry - it's a slow experience, only 2 people were working when we visited.  I'm no expert on Puerto Rican food, but we enjoyed it.  We went heavy on apps and will go back to try the entrees.", "author": "Kelli R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-13", "description": "I'm all about their appetizers. Unfortunately I'm not too crazy about their entrees. A bit on the bland side but the cozy atmosphere makes up for it. If you're not spanish this is probably a good place for you, since spicy is a hit and miss for you folks.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-04", "description": "The service was the worst I have ever had...the server was the waitress, cook, bus person, dish washer all in one!  No one there to help her...the food is so bad...unbelievably bad, just awful.  The Coco Rico was warm, the Alcapurria, she cook it three times, thinking that she had it right.  The first time cooked, she burnt it, the second time is was raw and the third time it was over cooked to a crisp.  The owner/cook is from El Salvador not Puerto Rican...!  If there was a half a star I would have given it that!", "author": "Dianne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "Used to come here as a kid and loved it, need to make it a point to get back....mmmm...Coco Rico", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-18", "description": "I went to this place with a couple of friends for a birthday celebration, and I really enjoyed it. The Mofongo was delicious! I ordered the Bistek de Palomilla which was a bit lemony for me. It was still good, but having only tasted a few different versions, I could not say if it was more or less authentic than the other. I will definitely return to this place as I want to try the ropa vieja and other entrees. My friends had the vaca frita and a pork dish The pork was a bit dry, but I also enjoyed the vaca frita. The Mofongo though was the hit for me!", "author": "Berna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-20", "description": "Good basic ethnic comfort food. Go there for a leisurely dinner with someone that you can enjoy a good conversation with. The chicken soup, plantains and pastellas are wonderful.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-24", "description": "I also really wanted to like this place.  I've always been curious when I've walked down 24th St.  A couple friends and I went in. I knew something was off because while there were lots of tables open, only 2 were clean.  Ah well, perhaps their busboy was sick that day.  It seemed there were only two people working, the cook and the waitress.  The waitress must have been stressed out.  When she finally got around to taking our order, it was rushed and she was too busy to even ask what we'd like to drink. I felt like we were just stressing her out by being there. The food got there. It was good enough, but not great.  What was worse was the stomach ache I got about an hour after.  Something just wasn't right.  What a shame.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "Amazing!!  My mom was cuban and my dad was Puerto Rican so I was raised on delicious cuban/puerto rican food!  We recently moved to the area and I have been craving a taste of home.   We found our corner of Miami here in San Francisco!  Everything we ate was FANTASTIC!  My favorite dish is Vaca Frita and it was made exceptionally well here!  Make sure to get black beans and rice and some yuca - delicious!!  The mofongo (you are supposed to eat it with the broth!) as an appetizer was FANTASTIC!  And if you have room make sure to get a cafe con leche and some flan to end your meal just right!\n\nIt's a dive but well worth the trip and cheap!   We will be back often I am sure!  One note - they are closed on Mondays.", "author": "Ted D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-28", "description": "i love this place.  i used to go there at least once a week but then i had to get a grip and cut back.  the chile rellenos are AMAZING.  i do love all of the vegetarian dishes but the chile rellenos are to be savored - i have actually contemplated asking them to teach me how to make them.  it can take a while to get your food but that's part of the charm.  the fruit shakes are sort of like milkshakes but not nearly as sweet - i recommend pineapple or mango.  oh, and everyone i have taken there who eats meat swears by the chicken soup.", "author": "Kristie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-11", "description": "The greatest crime committed here against Cuban gastrocentricity es el cafe Cubano.  Just skip that menu item altogether.  At best Frutilandia is ok, other times it is as if the head chef is on vacation and they gave a handful of recipes to the guy at the taqueria down the street who has never even eaten Cuban food.  Speaking from the perspective of a Cuban raised in Miami, this place is disappointingly the most authentic Cuban/Puerto Rican restaurant in SF.  I keep going back because I don't always want to have to cook everything myself, but each time I leave more and more disheartened.  Good Cuban food, like good Cuban people, should give everyone hugs and kisses, but Frutilandia is a cold, weak handshake sin gusto.", "author": "Q Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "i,m not gonna even say i,m an expert on puerto rican cuisine but i have been here quite a few times and the food is preatty good not the best but good i really like there tostones i also had the puerto rican pasteles and alcapurrias and they where on hit i once had a spacial it was lechon with arroz con gandules they also sell some cuban dishes they sell good ropa vieja and there vaca frita is hella good i also had a cuban sandwhich it was on hit i met quite a few boricuas in the bay area hopefully one day one of them will open up a new puerto rican restaurant in san fran one day it,s long over due but for right now if you find your self in the city this is the only place that i know of that sells puerto rican food  on a last note the staff is very freindly....", "author": "Jose C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "we got lunch from this restaurant and it was good!  i really liked the fried plantain (spell?).  i would go there just for that again.", "author": "Hiromi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-27", "description": "Ate here for the first time the other night. We had the mofongo appetizer - yummy but a little on the heavy side; the ceviche - great flavor, lots of fish and hot peppers; and the special, which was a roasted pork dish called Lechon Horneado. That was the bomb. Melt in your mouth succulent. Amazing flavor that easily rivaled a cubano pork dish I had in Little Havana. And the meat was also extremely lean. I didn't see a speck of fat. Service was a little slow. Good prices, lots of food. I'd go back and try other things on the menu.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-23", "description": "this place isn't strictly puerto rican, it's cuban too.  the best cuban food i've found in the bay area is in san jose - a place called la havana.  but frutilandia is in my neighborhood and doesn't require getting on the highway.  nice soup.  nice bread.  nothing amazing but it's solid neighborhood grub and very friendly service.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "Relaxing Sunday lunch with a friend.  The 2 of us shared an order of  pork chops (2 decent size and succulent pieces).  The chops were accompanied by black beans, rice and choice of soup/salad.  We also ordered a side of plantanos maduros (sweet plaintains) which is my idea of heaven on earth in a 3 x 2 dish. An extra bowl of black bean soup which was oh so lovely and shared the fresh batido de fresa (strawberry milk shake).  Get this--the tab was $21 total.  Worth looking for parking for 10 minutes or so.  I've dined at this restaurant at least a dozen times in the past 10 years and this was the best meal ever!", "author": "marsh m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-30", "description": "This is the best Puerto Rican food in the bay area. The food is excellent, the service is personal and the prices are amazing. I come here every chance a get - always a special treat!", "author": "Rich C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-29", "description": "3.5 The arroz con pollo was fantastic! The mofongo was good. Cool spot...kinda slow service, but not super expensive either. Biggest disappointment: they gave us styrofoam boxes.", "author": "Cassie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-07", "description": "My wife really likes Cuban and Puerto Rican food and so we tried out this restaurant.  (I prefer spicier fare, e.g. Mexican or Jamaican).  We went on a Sat. nite and the restaurant had only a few customers.  Which is too bad because the food was good, the prices reasonable, and the service efficient.  I had the Ropa Vieja and added lots of hot sauce--the server seemed a bit insulted.  My wife had the Mofongo and enjoyed it.  Not being an expert on this kind of food--nor ever wanting to gain an expertise on it--I defer to the other critics on this page.  But it was a pleasant experience, especially for my wife.", "author": "Murray S."}
