{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "The shrimp taco salad was great. I added bacon to it. It's a pretty big portion and the prawns were huge.\n\nYou have a selection of salsa at the side. Order was ready in a few minutes.", "author": "Gorlan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Let me tell you that I am not a huge fan of Mexican cuisine but this place made me fall in love with the Mexican food. I was in San Francisco for my annual conference and this restaurant was very close to the place I lived in. This was my last day here so I wanted to try Cal-Mex because Tex-Mex is almost everywhere in the DC area. \n\nSo as usual I enter and check out their menu to see if they have something out of the ordinary. I immediately notice their California Burrito . It comes with your choice of meat, crispy fries, guacamole and cheese. Then I checked their price and it was very nominal compared to other restaurants in San Francisco. So one would imagine a small portion for a relatively low price but don't go by their pricing as their portions are huge. I am not exaggerating when I say it's huge, it really is. \n\nI bite into this huge burrito and I immediately experience Nirvana ;well I might be a little over doing here , but trust me it was so delicious that I ordered another and took it back on my flight. I could eat only half of it and I ate the rest on my way to the Airport. I am so glad I packed one for my trip as we found out on the plane that they did not have dinner service. I felt a little guilty though that I have this amazing burrito and most of the others had to stick with snack boxes. I definitely recommend this place.", "author": "Rumesh V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-23", "description": "Been to this place a good 6 times past year.  Went beginning of July and the take out food (Vegi burritos) where ice cold only five minutes later. \n Not a huge deal, but not too good for a $10 item either.  Did not bother complaining just figured next time I went would mention it.  BAD IDEA; The lady working just NO nO NO, come see manager on Tuesday.....Great said fine and proceed to place order, she snapped NOT FREE   YOU PAY!  I said no problem, I was not asking for free, I was planning to pay, \n I clearly asked for cheese on our vegi burritos and she said does not come with,  I said but can you please add queso/cheese.  She said yes.  All good right...Nope   Upon  order ready I asked if they did add cheese she said NO extra money...Fine  she held on to the bag until I gave here $1.03 and then went and added to them. (i felt like ask to take it out of the $3 tip I put in the jar) I think this is a poor way to treat customers.  I was very friendly and non aggressive.  Food is decent but staff is not.", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-04", "description": "If you're buzzed (lets just say) and need a quick late night bite El rancho Grande will suffice.\n\nBut don't be expecting missiontastic burritos and tacos.\n\nThe food here is very meh.\n\nFrom the components to the construction....nothing shouts bite me!!\n\nCome on grill your tortillas for Jesus Christos sake.\n\nCarnitas was not too flavorful and had no texture.\n\nThe whole burrito was rather bland and limp\n\nGuacamole was on the older side and had no flavor.\n\nNonetheless It sopped up the Nights revelries and thus the three stars.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-05", "description": "I been here a few times very happy with the service until today. They left me standing waiting to order for 5 min they did not attempt to serve me until one of there regulars came in, she then proceeded to take his order disregarding the fact I was there before him, I should have left then, she took my order first only because I spoke up, but the cooks made sure the regular customers order was prepared first and as their regular walked out with his meal I waited for min. I will never patronize this business again terrible service and customers there regular customer also made a rude gesture in my direction as he left the restaurant. For ok food not worth the servic", "author": "Christopher H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "Horrible horrible delivery via Grubhub by way of Yelp. I couldn't have been more displeased with my order which was nearly $40 \n\nThe tacos had no salsa on them and not much onion either. Meat was very tough. Perhaps you guys should learn how to marinate meat?\n\nThe taco bowl was not in a tortilla shell. It was in a plastic container. Really?! That's not what I ordered as it wasn't what was shown in the image. Seriously people! Also same meat - steak - no flavor and like rubber. Horrible. \n\nThe chimichanga was disgusting. It was soggy and falling apart and the cinnamon they use on it made it taste gross with the carnitas. \n\nStale chips with no salsa. \n\nLike who are you people kidding by serving this crap to customers?! I would never eat their fake food again. I could cook everything I ordered 10x better than they did, so for that money I would have assumed I at least would have got something edible aside the rice which was pretty decent.", "author": "Bella B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-08", "description": "There are so many Mexican food options in San Francisco and I only come to this one sometimes because sometimes (usually) I'm lazy and this happens to be the closest one to my house.  I rarely have cash, but when I do I'll walk the extra blocks to get to Zona Rosa instead.  \n\nEl Rancho is super hit or miss depending on what you order.  Nachos were not good the time I ordered them.  I've had several different tacos here too and they're nothing special that's for sure.  Carne asada burritos are perfectly acceptable, which is why I try to not to order anything different.  But today I ordered a grilled chicken burrito and it was SO oily and wet.  That poor tortilla couldn't handle it.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-01", "description": "Maybe it's because I ordered something they probably don't specialize in, but my meal at el Rancho was not the best. \n\nThis morning I was really craving a breakfast burrito. I walked in here I didn't see it on their menu, but when I asked she said the do have one. So I get my breakfast burrito with bacon and eggs and it was not your usual bfast burrito with the eggs, meat, potatoes, cheese, etc. This was much more of a regular lunch/dinner burrito that just happened to have undercooked bacon and one fried egg wrapped in. It had all the regular burrito Fix-ins like pico, beans, guacamole, and sour cream. All I really tasted was the sour cream and beans. The tortilla was nicely toasted and the burrito was very large. Definitely a filling meal.\n\nThey seemed to have a very extensive menu that looked great! Maybe if I'm feeling Mexican food again I'll come by again and try something actually on the menu.", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "I have veggie super buritto husband steak super burrito and we got chips and salsa too.  Omg so good!! Plus bathrooms upstairs which is hard to find in SF", "author": "Jill S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "The shredded beef in the burrito was a little dry, but otherwise great place/good food nice seasonings and would go again. The portions are good sized and the salsa bar is nice!! Loving that mango habanero and that they have good selection there. Delicioso!", "author": "JamesAndTeresa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Dropped by on ny lunch break the other day, and im SO GLAD i did! Love, love, love this place! \n\nService was quick, and there was plenty of room to sit. Even at lunchtime, the upstairs seating area was empty so we had plenty of room. \n\nI snagged a veggie burrito for about 6 bucks. It was a solid size with a stellar homemade tortilla. Thick and floury with a perfectly golden color. The salsa bar has lots of options including grilled onions. The salsa verde was definitely a highlight. \n\nWill absolutely be returning. Nothing better than authentic Mexican food.", "author": "Kendall G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-08", "description": "A fine stop for what it is: cheap eats and a customer restroom along a busy shopping street with no public toilets. Food is forgettable. Salsa bar was a disaster zone, making it rather unappealing. Bare bones happy hour carne asada taco was indeed \"meh.\" But it was food in my belly for about $2. The upside: the strawberry agua fresca was quite nice.", "author": "Nina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-25", "description": "This place was awful. The food was terrible. The staff was straight up rude. They got our order wrong. So much failing. Do not eat here.", "author": "Smiley S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "Small place on Haight street. Good happy deal where tacos are a little over 2 dollars and $10 sangria pitchers.\nVibes: 3.5/5\nCustomer service: 4.5/5\n\nGot a carne asada taco (not happy hour) and the meat was really dry and over cooked. 3.5/5 for taco.\n\nMy friend got the shrimp burrito and said it was \"creamy, delicious, and filling - creamy is key word\" 4/5 burrito.\n\nGreat salsa bar with amazing spicy onions.", "author": "Bito M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Y'all Are Crazy with Your Stingy Star Givin'!\n\nIt's a shame this place only has an even four stars. I give it 10,000! Granted, I've never counted on service from this little Haight Street gem. I'm not basing my rating on anything other than the quality of the food. If you wrote your review with the same focus and you gave these guys less than five stars, and you've lived in San Francisco for more than a month and have tried at least three other taquerias in town, then you're perma fried from that LSD bath you took in the 60's (the white snake is dead, Carl. Time to go home!)\nI'll avoid the temptation to list all the reasons why I'm more Mexican than you (I'm' suuuuper Mexican) and therefore my opinion means more than yours (I'm looking at you, Mr. Goldfish with mayonaise). \nAll things being the same boring and muted shade of grey, this is the best taqueria in town. I know I know, I've been a big Farralito supporter for years, but this sleeper pick is the real champion. \nThey cook their meat with some kind of fruit or apple wood, giving the flavor depth and complexity unlike anywhere else in the city. Very true, the pickins are slim here, so the competition isn't exactly fierce, but even if it were, I have a hard time seeing anyone give El Rancho Grande  a run for their money. Take it from me, I'm a ninth generation Californian (argh, I almost made it)!", "author": "Dan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Good food. Affordable good service. Fast and friendly. One of the best in town. Clean and worth it.", "author": "Nuria R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-27", "description": "The lady at the register didn't know how to work the card machine (or so it seemed) so she announces that everyone in the line has to pay cash. \n\nI order a carnitas quesadilla with a side of black beans and rice. She puts the rice in a tiny salsa to go container and the black beans in a regular size to go container.. portions were way off and when I tried to ask why she tries to snatch the black beans out of my hands!!!", "author": "Kaitlin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "They are super nice about making substitutions! California burrito was bomb - I asked them to replace the fries with black beans to make it a leeeeetle bit healthier. Very full and only paid 12$\n\nHaight area is also fun to walk around. Christmas lights are still up in January. El Rancho Grande was a nice, quick dinner after running at Kezar Stadium.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "I love this place. Never disappointed from my order. The prawn and steak burrito is just my all time favorite. Especially when I order it a special way due to food allergies. They definitely deserve the 5 STARS.", "author": "Tofitaitai N L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "My local neighborhood Mexican restaurant.  Really great chorizo and quite reasonable prices.   They are usually pretty quick even if there happens to be a line.  You can also go browse the bookshop or the vintage clothing store next door while you are waitin for your order.  They make their own tortilla chips which is a big plus", "author": "D D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Jerry Garcia's hood is best known for the psychedelic shops and evening night life. But people do not realize that the Haight-Ashbury also have a few good spots for a bite.  \n\nThis somewhat-new taqueria makes some pretty mean and authentic food here. My first visit, I had my usual \"Super\" silver bullet with grilled steak. For a reasonably priced $8.50, I get grilled steak that is seasoned with the restaurant's own blend of spices, choice of beans, rice, cheese, salsa, avocado, and sour cream in a flour tortilla. The meat is spiced very well with a well-balance of the charred and smoky flavor that does not leave a burnt aftertaste. I like my cheese in my burrito slightly melted. And the cheese has a very nice sharp taste. Overall, the burrito is solid. \n\nI liked the food and friendly service from here so much that I returned a few days later for an early dinner. This time, I had the \"Super\" nachos. For the same $8.50, I get the same meat and same condiments all pile on top of flaky tortilla chips. We all know that this is a messy and unattractive dish. But the grilled meat, melted sharp cheese and the somewhat cold sour cream is a difference-maker. \n\nBoth of my recent visits, I had bottled brews with my grub. And this taqueria have a decent selection with a few micro-brews.\n\nThis taqueria does accept credit cards. The good food from here can give many taquerias in the Bay Area, including Mission Street an ultimatum. A solid taqueria in the Haight-Ashbury and expect many returns going forward.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-31", "description": "I never write reviews and trust me I didn't expect much from this place, but I never had to leave sangria behind this was 60% tap water and 40% cheap wine.", "author": "Carol N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Terrific food, convenient location and good prices. The burritos are moist, hot and freshly made while the asada never is bland or chewy. Just the right balance of ingredients without there being too much of any one thing. Love the fact the burritos are never runny or messy. A great spot to grab a tasty meal and then venture through the Haight or head out into the park.", "author": "Wally B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "The best hole in the wall Mexican spot in SF. Cures a hangover, the best tacos, and amazing chorizo burrito. Need I say more?", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Love this neighborhood burrito shop. Big fan of te California burrito with French fries inside -- a great twist. Their salsa bar has lots of variety, whether you're looking for spicy or mild. And the staff is super friendly and help me practice mi Spanish. Gracias amihos!", "author": "Mike V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "Came here for a quick stop for dinner when I was craving some Mexican food after doing some grocery shopping. I didn't have very high expectations as I was not a fan at all of El Faro when it was at this location so I was hoping it would at least be better than that, it was not.\n\nThe interior of the place has not changed whatsoever which was a shame. They could have at least gotten some new art or repainted the place. I decided to go with the California burrito. The burrito was good in size and the price was not bad at all. However, the quality of the carnitas was below average and the fries were insanely oily as well. It became quite a mess to eat. But I ended up eating it all as it was edible and satisfying.\n\nWhat really threw me off was the homeless man who was camped out in the upstairs section of the restaurant. I know it's the haight and I've lived in SF now for long enough where homeless people do not phase me, but in an establishment where I am eating and that I expect to be sanitary? No thanks. I won't be coming back.", "author": "Josue V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Strolled into this gem looking for a California burrito. Wasn't sold on having carne asada, so asked the cashier and she recommended the carnitas. Ohh man she was on point. Super crispy fries in the burrito, plenty of avocados, pico de gallo was fresh, and the pork was to die for. I'll go back and order the exact same or just the carnitas which were on point.", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "You truly cannot go wrong here. Cheap (like around $12 for more food than you can eat in one sitting) and excellent. This was our favorite meal in San Francisco! In fact, it lasted me three meals because the chimichanga I got was so huge. My boyfriend got the wet burrito with beef head and it was AMAZING and my chimichanga with pollo con salsa was delicious as well. And in case a burrito the size of a small infant isn't enough for you they have a free salsa bar with about 6 different kinds of salsa, pickled jalapeños and carrots, pickled red onions, roasted jalapeños and onions, and a few other awesome add ons. You will not be disappointed.", "author": "Kimmy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-09", "description": "I would give zero stars if I could. We came in to a long line and when we finally made it to the register asked how long it would be to order a burrito, nachos and shrimp cocktail to go...we were told 10-15 minutes. We got number 70, as we sat down to wait they called number 58. After a lot of other folks coming in and ordering the kitchen started to deliver tickets. We were fine with the wait, and fine waiting even after they started calling numbers around ours. Numbers 69, 68, 72 and 74 were called. We still waited, it had been close to 35 minutes at this point.", "author": "Alyssa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-17", "description": "Garbage.. gmo oil used. Got sick. Did not prepare food as ordered. I have a dairy allergy, told them 3 times, the request was ignored. Ate around the dairy bit food was tasteless. Plenty of better places on this street.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "Their burritos are excellent but can easily fall apart or get unwrapped if you aren't careful. The service is very quick and the prices are decent too. One negative thing is that their water dispenser tasted like soap, so buy yourself a drink.", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "Not a fan. Stale chips. Guacamole lacked flavor. Little Mexican girl at the counter was not at all friendly. She did not say thank you. That in itself, pisses me. So many options on Haight, why did I stop in here?!  Don't make the same mistake. Keep on walking.", "author": "JJ M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-30", "description": "Went here for the super nacho because the picture looked pretty decent. My bf and I ordered one more steak plate and fish taco for Togo. \n\nSteak plate: around $12, the steak is a little bit burnt and Togo portion is different from dine in. They seem give you more food in the restaurant. Definitely over price! (see my picture) \n\nfish taco:  $5 for one, tasted plain and the size is the same as the one costs $3.\n\nSuper nacho: about $9, it might be the better food we had tonight. The only downside is some of meat are burnt. \n\nConclusion is we should have gone to the $$ more fancy Mexican restaurant. At least we get what we paid for.", "author": "Chi Yi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Simple Vegetarian Burrito. Huge! Order with pinto beans, so gooooooood. Decently priced too!", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Let me tell you how this happened. I was at the Milk Bar with my friend. We wanted to grab some food real quick, so I went to Yelp. \n\nI didn't read any reviews but I saw a picture of the nachos and they looked good. So I am sitting in the restaurant right now telling the world that I liked the nachos. \n\nCome through and try.", "author": "Corey A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-12", "description": "Oh man, this place is fowl.  I remember it being decent back in the day, but I think they changed ownership a while ago, and I figured I'd give it a chance.  \n\nMy wife ordered a burrito and asked for no sour cream.  Not only was it LOADED with sour cream, it was dripping in oil.  Through the foil, through the paper, through the basket and onto the table.  Yuck.  \n\nWe were debating whether to \"be those people\" and say something, when I saw A FUCKING BABY COCKROACH IN MY SALAD.  \n\nThe woman gave us a refund, but also didn't seem that shocked.  :/. Definitely will not be returning anytime soon.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-12", "description": "You know when a good place usually smells good, well you can't even smell this place! The regular tacos I had were dry. I didn't even taste the meat, which was also dry. I had to drench my tacos in Salsa to even get flavor. And then on top of that the lady charged me for the wrong item and they didn't want to even fix it. When I went to ask to change it, not even 2 minutes later, they said I couldn't and the tacos were already made. It took my boyfriend to argue with the lady for them to even consider making it.", "author": "Masen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-31", "description": "Food is okay. I wish the place were cleaner. The dining area is very unkept. The salsa bar is filthy. The worker walked over to it as if she were going to clean it, then she just walked away. The area behind the counter is not very clean either. And of course, there's the filthy bathroom key attached to the large spoon that is handed back and forth to the same person serving the chips.", "author": "scott h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "By far my favorite Mexican Restaurant. So good and really nice servers. The burrito I got was the best thing i've ever had in my life. I wish i lives closer because I would go everyday.", "author": "Jackie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "We were over at Haight/Ashbury fro a photo op. We decided to stop in and in and check El Rancho out. Being from Texas, we have a lot to experience with Mexican food. I definitely give them a passing grade. I had a beef burrito and it was delicious. The salsa bar was tasty. If this place was on my route I would be there 3-4 times a week. El Rancho handled our munchies.", "author": "Randy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "I was craving a shrimp burrito super bad. And when I got here to my surprise they had prawns!!! They have a huge variety of tortillas from flour, to spinach, to chipotle. And their Salsa Verde is to die for! The burrito had a perfect combination of rice, beans, cheese, avocado, salsa and a prawn per bite ;) just how I like it!", "author": "Crystal S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Hella bomb carne asada fries and chicken quesadilla. So good. Coming back. People working there seemed nice, and place was kinda empty when we went. Horchata and mango drinks were really tasty too.", "author": "Paeng M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "Rude lady at register. Bathroom is terrible and they dont care. End up settle for chips because of the attitude we got!", "author": "LPthang S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Delicious food at a responsible price! I live in SF, and this place is one of the best \"hole-in-the-wall\" Mexican Restaurants in the city.", "author": "Merlino T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "Ordered the chimichanga with chile verde. Didn't have to wait an excess amount of time and the free chips and salsa kept me happy. The chimichanga was amazing !!!!!! Sadly though, before I could eat 1/3 of that, my rice and beans were cold. I'm not sure how they could have been hot to start with because they became so cold so quickly. So minus 1 star for that, but I didn't really need them anyway. Chimichanga was way more than enough for me!", "author": "Darcy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-01", "description": "This has to be the worst Mexican food I have ever had. The food tasted awful and even the chips were stale as hell. Save your money please.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "ERG is now open, yay!  \n\nFrankly, anything in this space would have to be a massive improvement over the unlamented El Faro.  Fortunately, ERG is more than just adequate, it's pretty darned good.\n\nWe went there on opening day, which means that they gave us free flan.  Order the flan!  They do it was a smoky dark caramel sauce which is very tasty, and I normally don't like flan.\n\nThe place serves a bit broader menu than the previous Haight taquerias, including a dozen or so standard Cal-Mex plates, plus some tortas.  To the pictures, I've added the Camarones Mojo de Ajo, which were very garlicky and tasty.   ERG served this with what looked like little housemade mini-tortillas.  They've also brought back the Salsa Bar.  5 stars for the food all around.\n\nThey lose one star because they painted over all of the old Balazo murals, and didn't replace the with much of anything.  Also, the space is very cold; you may want to get take-out until the weather warms up.\n\nI still miss Balazo, but if it had to be replaced, ERG is a pretty good replacement.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "I was going to be nice and give 3 stars which equates to an \"A-OK\" which I just can't bring myself to say about this place. It's definitely the most authentic mexican food in upper haight but the meat quality leaves a lot to be desired. Good salsa selection though and large interior.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "So glad I stumbled upon this gem in the Haight. I must say...most food around this 'hood isn't the best...but El Rancho Grande stands out!\n\nThe cashier is friendly, patient and the food is yummy. Ample amounts of seating, seating upstairs with TV that plays sports. Menu is great. Free chips + salsa. \n\nI love their bowls - burrito in a bowl or salads. Love that they're open late.. ( or do i.... )\n\nCan't wait to come back :)", "author": "Selina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "The surrounding area can be a bit rough depending on the time of day but if you're in the hunt for a filling meal and can do without fancy frills or long SF waits... El Rancho Grande might fit the bill. I'm a fan of the carne asada burrito (but be sure to get french fries stuffed inside...).  \n\nNot the healthiest fare... but is that really why you're here?  Go grab your kale smoothie elsewhere, friend.", "author": "Dan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "We stumbled upon this place and it's now my favorite Mexican restaurant. The lady at the cash register was so nice and recommended The California Burrito which was scrumptious. My friend had the mushroom quesadilla which I also tried and found it quite delicious.", "author": "Josh V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Happy hour. My most favorite thing ever about this place. At 3-6, $5 can get you 2 tacos, an agua Fresca and free chips! Tacos are only 1.75 during happy hour and agua frescas are $1! I love their mango and pineapple agua frescas and chorizo tacos! Food comes quick! Definitely recommend", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-21", "description": "If you're starving... this is the place to go. They give you soooo much food and on top of that chips as well. It's ridiculous. There is also a salsa bar as well that's just ok. Horchata here is good though. The place also has upstairs seating so there is plenty of room. I wouldn't only come back here if I was really hungry... or if it was one of the few places around open still.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "I paid with my credit card for quesadilla and beer last Thursday night. I signed receipt, but didn't write anything into the tips line, nor crossed it out. The charge was 13.81. When I checked my credit card statement a few days later I noticed that the charge is 15.81. So they wrote down the tip amount themselves. It's only $2 and not a big deal, some might say I had to give some tip anyway. But such behavior really pisses me off. I just don't want to deal with dishonest people. I'm never coming back, and will recommend everyone to go to Street Taco or Zona Rosa for Mexican food on Haight instead.", "author": "Alexander K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-12", "description": "This place used to have a great cook and was one of my favorite spot on Haight st \nbut it looks like they changed cooks yesterday.\nInstead of refried beans, I was served watered down beans like soup. It was inedible\nIt was crowded with the Haight st Fair going on, and I didn't bother to tell them.\nDon't know if I'll try them again..", "author": "aline d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Ick! They add cinnamon to all the meat! Not that great of prices, chips are purchased not made in house. The local is the only ok thing.", "author": "V R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "El Rancho Grande is the place to go for some mexi-cali casual dining!\nAwesome ingredients, Pico is on point, and centrally located in \"the haight\"\n\nServings Size is SuperSize for the super Taco! Love it Thanks for the 1am pick me up!", "author": "Jeff Jr M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-20", "description": "Good food here, although the prices now are on the new standard SF tourist or rich person scale (many burritos and other entrees are over $9). Two main gripes are the meager half-handful of chips in the basket, and plastic silverware when you're eating in the restaurant. If you're eating in, plastic utensils are really a substandard thing to see.", "author": "Eric O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-04", "description": "This review is strictly for the staff. I walked in ordered a chicken chimichanga with black beans. My order number was #87. \n\nAs I'm waiting for my order the lady called out #87, handed it to me and I said \"thank you\" smiled and walked away.\n\nBy the time I arrived home which was 15 minutes later, opened the box and it was someone's else order. A veggie quesadilla might I add!!\n\nI called the restaurant right away and spoke with the lady who took my order. She knew exactly who I was and said that \"I\" did not confirm my order. Um, excuse me but if you're going to give your customer a # for their order and loudly announce it when's it's ready then damn right the order should be what \"I\" ordered!\n\nNo one has time to come all the way back to the restaurant because of your staffs mistake. Oh and to add insult there was no sort of apology or some sort of reimbursement. Just \"well if you want your order just come back ha ha\"! Seriously lady?!\n\nFyi.. if you're ordering to go I suggest you check your box!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Yum. Supreme taco is magic. So many toppings. Refry bean heaven. Sangria is orange forward and yum. Hope I get to come again.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "Favorite Burrito joint on this side of town (The Mission has lots of great spots too). I'm from SD, where I grew up spoiled with great Mexican food and since I've been living in the city (over a year now), this has been my go-to spot. California burritos are tough to find in NorCal and they make a great one, but my go to is the Steak and Prawn burrito which I always drench in their green avocado salsa and their chipotle salsa. The staff is always friendly and they always give you free chips for you to enjoy with the salsa bar. Definitely a spot I would recommend and have done so. My roommates and I go roughly once a week now haha", "author": "Karim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Danmmm Daniel! At it again at that Rancho Grande!!Daniel took my order and he was sooo helpful. \nI was super impressed with the food & service here& I'll definitely be back when I'm in the area.", "author": "Hanna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Damn good Mexican food in the Haight. Large variety and sizable portions. It won't replace your favorite spot in the Mission but it will satisfy your craving.\n\nPro tip. The super tacos taste great and are an amazing value. They come with the works including cheese, sour cream, and guacamole.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Absolutely hands down the best (super) taco I've had in years. Big, bold. Mexican and reasonably priced!", "author": "Gus H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "MUST TRY CARNITAS. Not greasy, perfectly spiced with a wonderful smoky flavor. Definitely one of the top spots to get your carnitas fix. The burritos were loaded up just right. Going back for sure! \nAdded brownie points: staff didn't mind that we brought our puppy with us.", "author": "Roshan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Love this place, but to the owners/managers: PLEASE add beverages as options on GrubHub!!!! So incredibly annoying that you don't have your non-alcoholic beverages on your delivery menu. This actually results in me ordering from somewhere else often. That said, the food is terrific... I'd give this place 5 stars, but the beverage thing bums me out.", "author": "A. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "I would like to recognize May (Mayerling C. , per the receipt) from Haight El Rancho Grande Restaurant. Her personality and awesome customer service skills are the main reasons why I like to keep coming back to this restaurant. She greets us with a warm smile and asks us how we're doing every time we come in. She even remembers our names which make us feel more welcome like a family. This to me is indicative that she cares a lot about customer relations. She is a great asset to your company.", "author": "Jonas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "The best food I ever had they have new owner \nAnd they remodel this place it looks great and there food is great", "author": "b r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-08", "description": "Meat in vegan burrito. That's pretty hard to pull off. This place turns over every year, i'd play a little more to the customer.", "author": "Brandon W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "The carne Asada in my burrito literally tasted like hamburger meat, I know they make hamburgers too but still! I also got a margarita, which I'm fairly certain either had absolutely no tequila or the worlds smallest drop! Crazy! I wanted to ask them how they made it because it tasted like fake lime juice and water! Ugh. My boyfriend had tacos and a side of fries, and there were some mystery finds in his fries including bits of burnt meat (maybe?). I don't have high standards when it comes to burritos but I didn't even want to take the 95% of the burrito I didn't eat home, because I knew that I'd never want to eat it! also we were given like 10 chips, and I disliked every salsa at the bar, which has never happened to me before! It was a weird experience and I'm definitely disappointed", "author": "Alexis G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Amazing taco salad!\nPeople working here are friendly enough.\nThis place knows how to make a taco for suuure.\nPut this place a 8 on the spice wrack at the salsa bar. Service was quick enough even with only 3 people manning this little taco paradise.\nSuper taco is like 3 tacos in one. Price point is a little high but that's being said it is definitely worth a few extra $\n\nDoin it right for sure.\n\nSunny day on height street demands a cold beer and a taco from this place.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Food was authentic, place was clean and quality was excellent! (No fatty meats) We ordered the Special Mojado, Camarones Empanizados, Mexican Salad and Steak And Chicken Tacos! Everything was delicious! Even the salsa and chips! Pico de gallo was ! Nothing short of a perfect meal! Must try, you won't regret!", "author": "Leese K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "One of the best super burritos in SF! Happy to see this place just as good and just as busy from the first time they opened in the  90s!", "author": "Liz F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-30", "description": "Chips are deliciousss. \nSalsa bar is present, so that's always good, however I just came back from Mexico and the salsas just don't compare.\nPico de gallo- tomatoes were clearly not picked for their ripeness- the tomatoes were an unappetizing pale pink color. \nI really liked that they had roasted onions and jalapeños available at the salsa bar, however they were sitting in a bin, cold. It'd be much better if they served this hot, on request. \n\nTacos - I got the lengua and tripa- I was so excited that they even had these on the menu!!! The amount of meat they put in their tacos is generous. However, again, I just got from Mexico and had the most amazing tripa tacos there... these don't compare. The tripa was somewhat stale, as if it had been cooked a long time ago and was heated up again for my taco. It didn't have that burst of flavor and fattiness and juiciness when you bite into a piece of tripa, just some stale chewiness.\nThe lengua was extremely tender and cooked very well, however it needed to be marinated a lot more because there wasn't any flavor to it. I had to add a lot of their salsa to get some flavor, which resulted in a very wet taco. \n\nThe price is about $5/taco (expensive! although they do load on the stuff) and $10/burrito which is normal for SF. \n\nThis place has great potential.. I live down the street so I'm hoping they see this review and improve on these tiny things so I can be a regular!", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "Good tacos and one of the few places that stays open late. A little pricey for one taco but they're good!", "author": "Jasmine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-13", "description": "Meh. This is not the cleanest place in the world, the food is OK but not wonderful, and its location in the Haight ensures a steady supply of ripe-smelling oddballs coming through the door. It's not bad if you're stuck in the Haight for some reason and really crave some Mexican food, but unless I should find myself in that situation again, I probably won't be back.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-08", "description": "Great food but so slow to make food. I could order on an empty day, walk to Zona Rosa down the street, order, get food, eat and come back before these clowns finish making a burrito. \nIt's a joke.", "author": "Tito T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Whenever I need my guacamole, carne asada taco and burrito fix- this is the place I come to! Everything is fresh and delicious!", "author": "Rimah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Great food and customer service.  The place is very clean and  employees are very nice", "author": "Suzie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Love their food, their steak burritos is one of the best. Very clean place and the employees are very nice.", "author": "May A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "YUM YUM! Fresh and Delicious! I don't get on yelp very often, but felt it was necessary to share my thoughts about this taqueria! Service was great and the food was delicious! I called in my order a few times and they had it ready so quickly! I would definetly stop in and give this place a try! I'll be back this week...again! (Went for lunch today and it's only Monday!)", "author": "Lena Lena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "First time at this restaurant tonight. Ordered two different kinds of Chimichangas and two plates of Crunchy Taco. I ordered the BBQ Chimi, which I have never had anywhere before. It was quite tasty. They are also very large so I couldn't eat but half. The order was promptly made and the service was courteous and excellent. Even though we were there about 8:30 or so PM it had a good 7 or so folk in line. A very extensive menu and an impressive cleanliness score I note. Will eat here again. Price is very good for the amount of food. 4 entree's was 40.00 with tax so about 10 per person, though as we got take away we did not buy drinks or anything else.", "author": "Susan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-10", "description": "Are used to love Balazo at this location for its fish burritos especially. Today I stopped in for fish tacos. Super disappointing. Five dollars each, and, honestly, the worst fish tacos I have ever had. Tasted like the fish was scanned and must've been sitting on a shelf somewhere for years.might be fine if you're wasted, but if you're looking for tasty food, go somewhere else.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "My new fave place on Haight! Such awesome Mexican food here. I've tried almost everything from the quesadilla's to the taco's to the chimichanga's and the salad's and every dish is just so yummy and fresh! The prices are super reasonable and the quality of the food especially in the meats is high. Having parents who own a Mexican restaurant as well, I know how hard it is and how much dedication is put into it and the new owner most definitely went the extra mile to get this place right. Such sweet and friendly staff, the place is newly remodeled and always so clean. I would recommend this place to everyone! It's definitely a must try!", "author": "Ericka G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Family friendly Mexican restaurant.  Extensive menu, nice little self serve salsa selection", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "I love this restaurant. Great food. Good service and kind people. 10/10 taqueria on Haiti street. Street Taco doesn't compare. Looking for an authentic Mexican, local meal? You found your place. ¡Buen provecho!", "author": "Octavio D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Terrific Mexican food!   My family and I enjoyed a burrito and a few taco and they were delicious. The environment was also clean and relaxing.  I highly recommend this restaurant.", "author": "Laszlo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Wow best el pastor I ever had in the Bay Area I got el pastor tacos and they were the best the meat is very fresh and very good quality not the same as other cheap taqueria meats. The salsa bar was full of all kinds of salsa and looked and tasted very fresh. The cashier was very nice and helpful by recommending what to order and the store is super clean and very well remodeled. Thank you guys I will always come to this taqueria from now on and I would recommend it to everyone who loves real Mexican food", "author": "Shadi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "This is some authentic cooking with a twist. Flavorful and a huge variety to choose from. Definitely better than Balazo. Love the French fries in my burrito. A  go to spot", "author": "Matt A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "The place is awesome , the food is delicious,deserve the 5 stars ,I had their super steak burrito , the steak quality is outstanding.", "author": "Motaz A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-13", "description": "Good food, try the huevos rancheros! This place is definitely a step up from the restaurant that was previously in the space. The interior design isn't going to win any awards; this is just a solid SF taqueria. As noted in another review, the tv was way too loud when I visited.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "The food here is awesome. But my 5 stars is for tonight especially. I had a large order and I guess they forgot to put one item into the bag (no big deal, mistakes happen) I got more than 3 blocks down the street and then an employee from here found me and gave me the missing item. Awesome.", "author": "Kalen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-14", "description": "Up there with the grossest burrito ever, just terrible tasting carne Assada and everything in it!!!!", "author": "Tina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-25", "description": "A bit greasy with watered down salsas.... not terrible, but will probably not return.", "author": "Juan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Definitely an improvement over the last taqueria in this location. I had three tacos: lengua, tripas, and pastor. All were flavorful- pretty average for tacos you'd find down in the mission. Not bad if you're in the Haight, but I wouldn't go out of my way.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "BEST MICHELADAS, TACOS, BURRITOS and ELOTES! Happy this place is in my neighborhood. The food is great! Their michiladas are AWESOME! Diverse menu, the elote (Mexican corn) is really good too. Staff is super friendly (we love Mi, she's very kind and always smiling), the restaurant is clean, prices are very reasonable, and they always have the games playing.", "author": "Alyson M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "Definitely an improvement over the dreary El Faro, and there's promise in the food here, but also a couple of problems -- the main one being the flat screens at blasting volume, creating an almost unbelievable din even when the place is virtually empty. On my first visit, the food was quite good. I had two super tacos -- one with pollo en salsa and the other with carnitas -- and a side of black beans. The guacamole that came with the tacos was really delicious, as were the black beans, which were subtly aromatic with spices (it's the little things). The pollo was a little less spicy than I'd hoped; it was basically just chunks of white-meat chicken, but it was really moist and fresh tasting. The carnitas were soft rather than slightly crispy (two different styles, I know), but they were very good. And all the salsas on the side were really delicious and bright. The flat screen downstairs was blasting at top volume *over* the Mexican Muzak; no one was watching it, and it made that room uninhabitable. But the upstairs room was blessedly quiet, and the chairs were comfortable. I was eager to return.\n\nAlas, my second visit was much less successful. Again, I ordered two super tacos: one carne asada and one shrimp, no rice (I can't eat it), with a side of black beans. The bill seemed extraordarily high, but I shrugged it off. I went upstairs to discover that, this time, the flat screen upstairs was on and as loud as the one downstairs. The competing cacophony was unbelievable, but in each room, there seemed to be one person watching, so I let it be. This time, my tacos took about 20 minutes to come, which seemed rather long, but when I got them, I saw why the bill had been so high: I had been given two shrimp tacos, which have a $2 surcharge each, plus a carne asada. Alas, all three tacos were piled high with rice, which got tangled up with all the lettuce and guacamole, so I ended up having to pick through these heaps of rice/lettuce looking for pieces of meat and shrimp, which, I must say, were laughably few (if it wasn't for all that rice, they never would have sent out the tacos with such little meat, because it would have been too obvious.) So I ended up eating a bunch of rice that stuck to the lettuce, and here I am with a big ol' glucose spike (I checked) right before my a1c test (it's a diabetic thing). I walked home dejected past Street Taco, which, in classic Woody Allen fashion, was full of laughing happy people eating delicious-looking plates of food. I'll give this place at least another chance, because the food was so good the first time, but the flat screen situation is really unfortunate. It's almost amazing to me that the workers themselves don't seem to mind the noise.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Stopped by here after shopping around, and I'm so glad I did. My boyfriend and I ordered Carne Asada tacos and Super Nachos. The meat was super soft and flavorful, and the nachos were amazing. They're pico de gallo is seriously on point. The tacos were a little pricier than we were used to, but definitely worth a try!", "author": "Alison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Went on the first day El Rancho opened and I was pleasantly surprised. Prices are standard and food quality was high - I ordered an al pastor taco and it was delicious. Quantity was great, also. The space is clean and nicely renovated. Definitely an improvement on the previous establishment!", "author": "Nikolas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Just had one of the best burritos in the city! I will definitely come back here again. The place is clean, food is fresh, and service was awesome.. Keep the good work El Rancho Grande", "author": "Arta S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "In the past, I would have rated this place 5 stars!! I lived close by and would stop by multiple times a week for food. The staff were friendly and the meals were authentic and amazing. I remember this one cashier in particular who was so sweet and attentive with orders.  I recently called in an order for pick up for old times sake since I was in the neighborhood. When I went to pay, this new cashier who I had not seen before repeated my order and I noticed my order was wrong so I let her know. Instead of offering to fix it, this new cashier just kept looking at me as if she wanted me to take it anyways. Normally it wouldn't have been a problem, but this really isn't what I ordered so repeated again that the order was wrong. She got upset and told the cooks in Spanish that I had given the wrong order (not true). She then told them to do all the other orders first and to fix mine last. I know Spanish so I was blown away by this level of unprofessionalism. She then told me in English I would have to wait an additional 20 mins (I ordered in advance for a reason)! The cooks were nice enough to get me my order within  5 mins. I really loved this place, but I don't think I will go back.", "author": "Emily F."}
