{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Long time customer ~ \nThis place is always been consistent in terms of big juicy burritos.. \nThere salsa bar is in the back. \n\nI've always enjoyed this place for a quick to go order..", "author": "okie r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Ubereats from here all the time and the orders are consistently great  \nFirst time ordering coctel de camarón ill check back to tell you all about it.\nCALIFORNIA BURRITO HIGY RECOMMENDED", "author": "Karina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "Tried this restaurant twice, both delivery. The first time, the order was super quick and the food was good-- one star. The churro was undercooked, however... didn't think much of the churro being undercooked since it was late at night and a minor part of the meal. \n\nOrdered again later that week and was missing the large chips and tortillas which is vital when ordering a large-sized guacamole and fajitas. The restaurant couldn't bother themselves to try and correct the order. They offered no solutions and claimed the bag of 10 chips is the pint-sized bag that we ordered. They also said it was not a big deal that there were no tortillas for the fajitas.\n\nTL; DR: DON'T order delivery from this place. Ever.", "author": "AK P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "I normally wait until after I've finished eating and leave to write my reviews but this place is AMAZING. The portions should you choose to eat in (and you should) are bananas. Look at this order of huevos rancheros. It's GIGANTIC. The food and soda together were the same price as a bowl, chips, and drink at chipotle (about $12) but the chips here are free. Its SO good and its soooo much food. Probably the most generous portions I've had for so low cost since I moved into the city. I don't know if the woman working could tell I was hungover but the amount of cheese in these eggs is the best thing I've experienced all day. Beans are great, rice is good, they do NOT skimp out on the guac. Eggs are perfectly cooked, salsa on top is awesome. I will probably come here as often as I possibly can. If you're reading this and thinking about eating here, you should DEFINITELY eat here.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "Ordered uber eats here and was underwhelmed and disappointed. The steak plate was overdone (not sure why the app asks us what doneness of meat we prefer when it all comes well done anyway), the burrito was not good because the ratio of meat to other ingredients was just not right, and the side of guacamole we ordered was more like a super cheap 50% avocado and 50% green salsa/sour cream mixture and just terrible. Stay away!", "author": "Anna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-19", "description": "(mexikus: mexican haikus)\n\nforced to stare at the\nchimichanga overnight\nno way to eat it\n\nutensils request\nwas overlooked or ignored\nglad other half of\n\nmeal was burrito\ngood textures round to 4 stars\nonce home ate the rest", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-26", "description": "Ordered from Uber Eats and specifically put no beans in the note section. Got my order and there were beans and everything I had asked for on the side on top. I'm on a keto diet and had no way to remove the beans as they were mixed. \n\nI called the restaurant and explained and they just argued with me and told me to call Uber. Very disappointed....", "author": "Emily B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "Guys don't do it, it's so bad. I will usually eat anything but their California burrito tasted like old grease and had so many squishy bits I literally did not finish it. The fish taco wasn't bad though!!", "author": "Sophia U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Don't use them on Uber Eats. You'll pay a bunch of extra cash for stuff and get the blandest version of what you want. Pay extra for Al Pastor and Rice on a Burrito that should have Guacamole on it? No Al Pastor, No Guacamole and enjoy 5 grains of rice.", "author": "Luis G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-09", "description": "I tried this via ubereats just hoping it was edible. No such luck. Got super burrito and two tacos. Both of these were sloppy, had questionable freshness of ingredients and tasted absolutely horrible. Had to chuck all of it out. Do NOT order here.", "author": "Dan N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-12", "description": "The food is good. Wait times are low. My only issue is I can't have too much on my burrito. So today I ordered a chicken burrito (super) with no cilantro, salsa, rice, or onions and when I got home it had rice. Rice grains dry my throat so I can't eat rice. Out of haste I threw it away, granted I shouldn't have but I had my two month old in my arms, and called to let them know about the situation. This had been the second time this week this had happened, but it didn't bother me. What bother's me is when I called and explained, I needed the burrito which was thrown down the trash shoot. I didn't realize at the moment I would need it, but the woman hung the phone up on me when I tried to explain. I understand it was my fault I threw it away, but I don't have access to the trash shoot yet alone the basement. So I was bummed because the phone was hung up on me, I showed up in person to explain and was given attitude and ignored. I just find that the behavior I got was unnecessary. I just spent 10$ on a burrito plus the tip I gave so all I simply asked was for my burrito to be made correctly. I've been coming for months and it I've always been kind and polite as well as the staff so again I'm not understanding why I got so much attitude. I think it was very unprofessional, and unnecessary. Angry at that point I demanded my money back and got it. As a customer i felt like I was treated like trash.", "author": "Tj J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "I ordered a wet burrito and a torta.\n\nThe wet burrito was clearly prepared with all expired ingredients. The tortilla was extremely hard, to the point it took muscle to cut it with a knife. There were avocado slices (which are extra), that had black, hairy spots. At that point it became clear what was going on and stopped eating.\n\nThe torta was absurdly bad, soggy and devoid of any trait resembling a torta.\n\nThis is not only bad preparation. Using expired ingredients is just lack of business ethics. Don't order from this place.", "author": "Felipe O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This is what I'd call a simple taqueria and the best part about El Tesoro is how well their meats are prepared; it is always very flavorful.\n\nNot sure where all the negative reviews are coming from, but I've postmated from here at least 10 times in the last few months and it is consistently delicious and they get every detail correct. We usually get regular burritos or California burritos, I often get the chorizo and bf gets chili verde pork; both are always well-spiced and super tender. Sometimes they even throw in extra chips for free :D\n\nOne oddity: on postmates, they have the option of adding a SINGLE shrimp to your burrito for $1-something. We thought this must have been a typo, so we ordered it anyway. And sure enough, only ONE shrimp was to be found in the burrito. If any El Tesoro employees are reading: you should increase the number of shrimp for this option bc most people want more than one lol.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-11", "description": "I'm still shocked at how expensive food in San Fran is.\nThis place offers 2 tamales with rice and beans for $11.99!?\nIn LA this dish is $5.50.\nThe place was pretty clean but maybe could be more polished.\nThat being said, I tried the carnitas burrito.\nThe burrito was OK. The meat looked and tasted fresh and wasn't dry.\nCertainly wasn't worth $9. but I'd get another.\nI know they can't control the neighborhood prices, but I would try for charging less and attracting a larger crowd.", "author": "Dude Food G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "Huge portions and tasty food. I got the Chimichanga with Al Pastor and it came with rice and beans and smothered in gauc, sour cream, and pico. The pastor wasn't the best I've had, but it was good, and the chimichanga could have been fried a bit more, but it was still good overall. I also got the El Tesoro Nachos which are fries covered in cheese, meat (I got chorizo), and all the nacho fixins. It also was a huge portion and very tasty. Again the meat wasn't amazing, but it had a nice spice to it, and everything else in the dish was tasty.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-25", "description": "Must have run out of carne asada tonight. My taco was steak-free. I suppose this means that this place is vegan-friendly, though? 2 stars because they did provide me with free tortilla chips.", "author": "Shannon F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "We ordered two caldo de pollo soups and their special fries/nachos from Postmates. Upon delivery we received the wrong order; annoying, but it happens. We really wanted our food so we ordered again. Another 1.5 hours after we placed the second order it arrived, freezing cold. \nThey obviously just reused the first order that didn't make it to us. Cold fries are absolutely DISGUSTING. Mexican food sitting out for a few hours is not okay to deliver again. \nWe are so disappointed that we wasted both our money and our time, and will never order from here again.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-17", "description": "One positive star for speedy delivery.  I ordered a shrimp taco, carne asada taco, and pastor tostada. The pastor pork tasted like leftover Chinese BBQ, and the carne asada was completely flavorless and unseasoned.  Chips were stale too.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Delicious burritos, with some of my favorite salsa of any taqueria nearby. Quick service, good prices, and they're open late, and later on Friday and Saturday.\n\nFor those complaining that your online order is wrong, try actually walking to the damn restaurant and ordering. When you order online from *any* restaurant, you're a second-class customer, and rightfully so. It doesn't take that long. Try looking around, or bring your phone and play a game if you're bored or something.", "author": "Devin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-07", "description": "This is the worst Mexican food in San Francisco.. no scratch that the entire west coast. We mistook the guacamole for fuckin green salsa How does that even happen? Night destroyed. My girl won't even talk to me. All jokes aside don't EVER order from this place. Straight doo doo", "author": "Arik B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-04", "description": "Worst customer service ever! If you order delivery don't expect good quality. I tried to modify my order and they didn't want to help me. Never ordering from this place again.", "author": "Vane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "This has become my local-local spot to grab a burrito. The mission is where burritos are best but if you live in union square, trekking down to the mission every time you want a burrito is a bit much. They make a decent California burrito here and I'm just glad it's close by!", "author": "Leo I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Good tacos but can get expensive if you want add ons like sour cream or avocado. That will quickly double the price. Good service tho.", "author": "Gabe J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-02", "description": "The staff are nice, but the food is pretty meh. On more than one occasion my beans and rice have been cold. But that might be because I often come here at the very end of the night, which brings me to Tesoro's main positive attribute--it's open really late. Also, their salsa bar is pretty good. I would recommend it as a very late night option, but not otherwise.", "author": "A E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "I ordered 3 burritos , 2 grilled chicken and one veggie. Instead I got beef burittos and vegie nachos ( beef is against my religion BTW). I called the restaurant 10 times and no answer. The only thing i did try to eat were the nachos but they tasted like soggy made in the morning nachos . please do not get anything from here specially delivery from grub hub.\n\nSTAY AWAY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "Lovi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Try their mushroom quesadilla - you won't regret it! Their salsa tops the charts too.", "author": "Shobhit G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "My co-worker splurged and got a big burrito with steak and shrimp and split it with me. The shrimp was so perfect and the steak was very tender. I like the green salsa, it's slightly sweet. The burrito was wrapped in a garlic tortilla. I am in heaven as I write this review. I love hole in the wall joints like this. They make everything in house and they make it with love. I will be coming back to this place for sure.", "author": "Kat D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-22", "description": "Ew, why did I come here - I asked myself. This place is okay perhaps if you are drunk and hungry, but when you are only ever-so-slightly tipsy and not that hungry - please don't feed your body this food. \n\nSomething about this place feels really dirty and I get that it's a taqueria; usually cleanliness can be ignored if the food is good, but the meat was super dry and tortilla was bleh. The salsa bar is not central to the restaurant and so far away from where the food comes out.", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Just had lunch here and I had the chicken mole plate, wow it was excellent.  I like to try the mole when I go to a new Mexican place to see if it's the real deal and this place has it.", "author": "Kent P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-08", "description": "So I have continually tried to give this place a chance. I'm a simple eater, bean and cheese burrito. For some crazy chance, they get it wrong, every time. I'm nice, I tip. But this time, I had to say something. My burrito came with bean and rice in a wheat tortilla. Yeah, go drunk. Maybe you won't care what you order. I won't go back. I'd rather have a frozen burrito over their bs.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "These guys are there for you.\n\nWhen you're drunk and you want a burrito.\nWhen you're sober and you want a burrito.\nWhen you're broke and you want a burrito.\nWhen you're lost in the TL and you want a burrito.\nWhen you live in the TL and you want a burrito.\nWhen it's 2am and you want a burrito.\nWhen it's 3am-only-because-of-daylights-savings-time-and-they-still-stay-open-for-you and you want a burrito. (#ThatHappened)\nWhen you want a burrito, just because you CAN get a burrito.\n\nVegetarian menu available, spinach flour on request, salsa bar gains, beans tasting better on some days over others.\n\n3.5 round up to 4.\n\nIt's like the guy you use to date. Nothing special, but satisfied the hunger and was around when you needed him. It was not a total loss when you had to stop seeing him.\nThanks El Tesoro!", "author": "Lanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "I've tried this place a few times and while the food is mostly good I do have a few complains\nA. 1 taco was $ 3.25 and it's not even half the side of a normal taco\n2. Food is damn greasy like I'm ok with greasy but they go overboard with the oil made me feel like I ordered a cup of oil with a side of quesadilla\n3. Most of the food is huge but over priced  & that doesn't include the 4.99 delivery fee\n4. The most annoying thing was that once the delivery lady called me and instead of saying hi I'm here with your delivery she said do you have a tip for me and then proceeds to go over the receipt with me trying to figure out where was her tip. I know it's SF but tipping is still optional and when you don't even say hi just go straight into the money then it makes me not want to give you anything at all.\nI will say that they got my food right everything (once they gave me diet instead of regular coke but I'm not dying over that) and they do come on time but 3.25 for a quarter of a taco was not cool", "author": "Rosa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Best tasty, greasy, meaty, saucy quesadilla of all time. When ordered to go, it folds into a brick sized mass of debauched goodness. Haters gonna hate, but I ain't lookin' for Don Pistos. Five. Star. Dirty Mex.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-21", "description": "The food is decent quality. It's everything that you'd expect. Good flavors, low prices. Nothing special. I almost always opt for takeout because the ambiance is quite lacking. There is a little dine-in area downstairs, but the whole place always has the unmistakable stench of a freshly cleaned public bathroom. Not very appetizing. The food is great if you eat it anywhere but inside the restaurant.\n\nAnother weird thing: they have a self-serve salsa bar, but the ladles for the salsa are far too tall for the height of the sneeze guard. It makes for an awkward, messy situation.", "author": "Kelsey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-15", "description": "Came here for chips and salsa. Ordered nachos. No salsa at all in the salsa bar. Asked for chips at the counter. Counter help talking to crackheads too busy to help.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "What's pretty amazing to me is that more than half of the reviews of El Tesoro begin with a variation on \"It was late at night\", \"I was drunk\", or \"I somehow stumbled upon the worst neighborhood in the city\". I've lived in San Francisco for over 20 years, and on the adjacent block for 16 years and if you think O'Farrell at Leavenworth is that frightening than maybe you shouldn't be living in a city at all. And if you find the service subpar, how about showing some respect and not walking in drunk. \n\nIn any event, El Tesoro is one of the many outstanding little places in the neighborhood. It's not my very favorite taqueria but it's in my top 3. Consistently good, prices fair, place is clean. I eat there at least once a week.", "author": "Sean F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "I must have taken the wrong turn and ended up in San Francisco's most exquisite neighborhood. Gazed at and greeted by many unfamiliar friendly folks I was wandering the Streets Of Tenderloin in search for a quick bite to eat.\n\nEl Tesoro Taqueria & Grill wasn't on my list of things to try this evening but it was getting dark, and Tenderloin started to turn into Zombie town. My Spanish is not that great but maybe El Tesoro means Oasis. I'm not sure.\n\nI stepped in. Closed the door behind me cautiously. Looked at the extensive menu full of Mexican food items. And soups. And burgers. And sandwiches. Perfect. I felt safe. \n\nWhile I was waiting for my food, I looked outside. It was dark by now and the Streets of Tenderloin had turned into a scene from World War Z. I knew I need to be strong once I get out there again.\n\nLuckily, only a few minutes later I was consuming my vaccine called burrito, fish taco, and quesadilla. Satisfied and bulletproof, I said \"Adios\" and made my way to the front door. \n\nTake that, Zombies.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "Excellent stop for a tasty meal. I've had the Super Burrito, Chicken Fajitas, and Quesadilla. All are great, but this place is clearly known for its burritos. They load the burritos full of meat, rice, beans, guacamole, sour cream, and salsa. Think Chipotle burrito x 10 (tastier and bigger).\n\nDon't let the Tenderloin location deter you from stepping into El Tesoro. The staff is great and the food is delicious. Either get your food to go or enjoy a Modelo Especial as you eat!", "author": "Emmy Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-15", "description": "Your tamales suck! I was very disappointed that I find Lucky's tamales wayyyyyy better than yours, that person making those tamales must be an Asian or something. \n\nInstructions: \n\nGo to Lucky and buy tamales | learn how tamales are supposed to taste like!\n\nMy roommate enjoyed his quesadilla tho, (reason for four stars).", "author": "Allan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "Burritto had little to no chicken in it and tasted strange.", "author": "Chad C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-29", "description": "Ohh how I wish I could get those wasted calories back and go spend it on a few more drinks at Aces. \n\nService: The lady at the cash register was busy shoving food down her throat, with a single rice hanging at the corner of her mouth, when she stared at us like idiots looking at the menu deciding what to order. I asked if they had taquitios, she points at tacos. -_-. I asked again, she points at the meat options. -_-. Ok, so service sucks. Whatever. \n\nFood: Blah. The Burrito Supreme was supremely mediocre. It was edible, dont get me wrong, but there was no flavor, no love, nothing special. But I had to eat it because of what was next ...\n\nDrink: Horchata was on point! It was the only thing pleasant about this visit. I took it home and mixed in some good ol' whiskey! Try it. You can thank me later ...", "author": "Roman V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-01", "description": "If you're looking for authentic and tasty Mexican food then avoid this place. The nachos were dripping wet and soggy and they were cold and bland. I vow never to eat Mexican anywhere but my neighborhood ( Excelsior) from now on.", "author": "Glenn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Classic Mexican restaurant that you can count on for epic burritos pretty much any time of the day. I like to think of it as my dive bar.... but for Mexican food. With that being said, don't expect the service of a high end restaurant. Come in with the right expectations and you'll be delighted.\n\nI highly recommend the California burrito. The addition of fries as the potato in the burrito is bomb.", "author": "Drew J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "These burritos are HUGE! Filling and getting your money's worth.\n\nLanguage barrier made it difficult to communicate with the owner. I ended up getting a free - albeit unwanted - upgrade. I ordered (and paid for) a vegetarian burrito (#1: rice, beans, and cheese at $5.55) and got a vegetarian regular burrito (#2: rice, beans, lettuce and salsa, which should've been $5.95).\n\nMy friend got a regular burrito (not off the vegetarian menu), and got what he asked for. Guess it's luck whether you're understood or not.", "author": "Carrie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "I like the food here. I genuinely think it's good. Where it fails for is accuracy. About half the time the order gets messed up. Ordered a sandwich where bacon is included (no bacon). Order nachos without salsa guacamole and sour cream (nachos were smothered in it). Ordered a burrito with chile Colorado (the meat was cold????). I eat here because I live across the street, and again, the food is tasty. But I wouldn't go out of my way to eat here if I lived further out.", "author": "Meggie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "A 1-star rating is not even deserving of this restaurant. Read on.\n\n1. I ordered food to go this morning at around 10:15 AM via grub hub. I ordered \"CAMERONES A LA PLANCHA PLATE and STEAK PLATE plus a side dish of salsa and cheese.  \n\n2. When the food was delivered, no side dish was included and I was charged for those items. Disappointing.\n\n3. Next, THERE WAS A STREAK OF 4\" LONG BLACK HAIR in the CAMERONES!\n\n4. Of course, I lost my appetite and called in the restaurant ASAP to complain. Why? Because\nthe last thing that anyone would like to see in his/her own plate of food is hair. HAIR! In the restaurant business, this is a mortal sin!\n\n5. On the phone with EL TESORO staff, the woman said, \"THERE IS NO HAIR.\" \nMe: \"Yeah, hello? Like I would waste my time calling you if my food-to-go had no HAIR!\" Lots of exchange went on. She even blamed me for it. \n\n6. EL TESORO STAFF: \"There is no hair! It might be your hair!\" (Yeah, give me a break. No one has black hair in my family)! I also told her about the side dish that was not in the package of food delivered to me today. Finally, she said she will refund me for the inconvenience. Nine hours later, no refund has been transferred yet in my credit card.\n\n5. In my exasperration, I called grub hub and explained the issue. How sad that they can't do a thing about it. They called the restaurant as well and no one would answer the call. What idiots these people are. I am talking about honesty, integrity and professionalism. This one stinks. Better order your food in Mexico!", "author": "E Olga P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "In the Tenderloin district. But really good authentic Mexican food. Cheap prices, big portions. Pork tamales were great, but I'm pretty picky -- so these tamales had a little too much masa in my opinion. Good rice & beans. Huge Super Taco. Regular size carne asada burrito - was HUGE.  Quick & friendly service.", "author": "So T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Oh how I miss El Tesoro!! I moved out-of-state at the end of 2013 and haven't found any really good burritos.\n\nI loved their burritos and little salsa bar.", "author": "Kara W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "It's an OK place, no different than any other mexican hole-in-the-wall.  I like the fact that their salsa is extremely spicy.\n\nJust a note for vegetarians/vegans: they toast the tortilla on the same grill as their meats.  So expect random stuff to be stuck on your burrito or have a meaty-smell.", "author": "Lol N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Got here late night after having a few drinks.. Friendly staff.. Fast and friendly service... I don't eat Mexican food much but I must say that this food was GOOD!!!! It would definitely be a spot I could come back to. Oh yeah, the burrito is huge!!", "author": "Melvin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "This place consistently f#€ks my order up. Most recent one that broke the camels back is I ordered two identical burritos. One was huge, the other, had so little inside it was mostly shell. Terrible.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-16", "description": "Ordered an Al pastor burrito to go so didn't get to open it until I got home, and the meat was so gross, it was red and bleeding, I almost threw up.", "author": "Maira J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "I'm not a tourist cat. I've lived in SF my whole life, and while some out of towners I meet are too scared to wander into the TL, I consider it my backyard and know that hidden amongst the sometimes junky and dirty buildings, are true gems of a restaurant just waiting to be discovered. El Tesoro is a place that I consider to be one of these gems. \n\nEl tesoro is a small little place with some side/downstairs seating. coming in, you are greeted with a large menu of many options. my personal favorite is their burrito with the grilled veggies. their burritos are large and perfectly flavorful. No overwhelming saltiness or crazy amounts of sour cream like some places will do, here you get a truly tasty burrito that will fill you well.\n\ntheir plate dishes are also massive and are always perfectly cooked and served fresh. You can see the cooks preparing the meals and they always seem to use the freshest ingredients. \n\nI also must mention their horchata! *purr!*\nI love the fresh horchata they make here! sometimes I stop by for that alone as I walk towards the embarcadero, always a perfect treat for me! \n\nservice here has always been very friendly and kind for me, and I always feel comfortable and at home here. Never had any sort of bad experience with any of the people behind the counter! \n\nif you are in the area, definitely stop by El Tesoro! wonderful food, quick and easy, and two paws up! \n\n*chirp!*", "author": "Jei C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-14", "description": "Burritos are ok. Tacos are not any type of Mexican that I have ever tasted. Pork seems to be deep fried, and covered with a layer of shiny grease. (picture attached). \n\nCheap and close, lots of Italians hang there.", "author": "Dean N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-04", "description": "Worst Mexican spot in the whole city. Literally everything on the menu is terrible and tastes like garbage. Nachos are so soggy it's ridiculous. Burritos are super bland and the meat is awful and chewy. As a Mexican this is a huge disappointment and place should be shut down or just not serve Mexican food.", "author": "Paolo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-03", "description": "The food is meh, but opened late night and good for when you don't want to go to mission for Mexican", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "One of the better taquerias in the area. Tasty burritos, reasonable prices, and a fantastic salsa bar.\n\nThe salsa bar is really a big selling point here - the taqueria lets you get salsas on the side on your own, so you don't have to beg for an extra side of salsa as you do at many other taquerias.", "author": "Raj S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Not a bad place to get some late night eats. Had the taco salad without the shell. Generous portions for what you pay. Chicken en salsa was the meat I chose, and it was seasoned well. Served over iceberg lettuce with plenty of guacamole. \n\nPlace has a nostalgic decor with vintage \"Coke\" collectibles. When I was in there, an old black and white movie was on dubbed in Spanish. \n\nAlso had the Mango Agua Fresca. Lightly sweet.", "author": "Shih Fa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "Another place I just happened to run across while in the terrible tenderloin part of San Fran. This place has turned into one of my go-to spots when I'm at working feeling Mexicanish. I usually order the super burrito or the super nachos here. They have a lot more items on the menu that look appealing but I like to keep it simple. Cost 8.50 before tax. An absolute must try if your in the area.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "TIP #1: Order at the counter and then find a seat at the narrow bar table or downstairs at the back of the restaurant.\n\nTIP #2: If you order a super taco, I hope you've prepared your stomach for a pound of food!\n\n3.5 stars rounded up. In San Francisco, competition between taquerias is cutthroat, so I gotta give some credit for a pretty good non-Mission Mexican joint. \n\nIf you're hungry, stop reading now, and just go order the super taco. The super taco is HUGE. Mine was so loaded that I couldn't pick it up. Starting from the bottom, there are two small taco tortillas. Then there's a generous layer of melted cheese. And on top, piled high, is the beans, rice, meat, lettuce, guacamole, sour cream, and pico de gallo. If you're still reading and you're wondering how I could stomach all of that, let's just say that I was really hungry. Just one look at the taco pile and the challenge was accepted. \n\nTheir ingredients are fresh--my boyfriend and I saw a cook returning from the market across the street with cilantro and celery. There was some kind of huge pan of soup simmering away in the kitchen, but I didn't know what it was. \n\nCome give El Tesoro's super taco a try!", "author": "A.L. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "This is my favorite Mexican place in TL. Fast and friendly service. Open late. Nice salsa bar. Chicken taco salad, fish tacos, and burritos are all good. Generous portions. \nCash only at the moment. There's a small seating area downstairs, TVs that usually play soccer. And they sell beer!", "author": "Irina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Two Carne Asada tacos and an ice cold Dos Equis made me a happy man. Smoky flavored tender juicy beer in a such huge quantity I had to get a fork. \n\nThese guys deserve more than their current rating.  Id rate 4.5 stars if i could. Very worth the visit!", "author": "Theodore B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-11", "description": "I ordered through grubhub and when it arrived the order was wrong. They wouldn't correct it and they want me to wait until morning when a manager comes in to approve a refund.  Grubhub really wasn't any help either.", "author": "Victor E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Basically in front of my dorm and always open when I'm craving for the Vegetarian Super Burrito. \n\nCheap, big and super fast with amazing taste. The salsa tastes fresh and the rice is perfectly cooked. \n\nPerfect after a hangover or a stressful day. \n\nSide of chips is only one dollar something and the salsa is free! \n\nThe salsa verde and the mild salsa are the best in my opinion. \n\nNice restaurant, nice takeout.", "author": "Magdalena Victoria B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "Crap service. Super bummed because I wanted to have a go to taco place open late when I get off work. asked for a quesadilla  with beans on the side with a modelo beer and I get it all slapped together in one. When I showed the lady my sloppy quesadilla asking where my side of beans was she couldn't even be bothered or acknowledge me talking. I tipped her and everything prior to and to receive such service after all that you can guarantee I won't be back and I will spread the word. Sucks when your crap service has to affect the review of the restaurant. Can't even tell you if the food is good because I just have this slop of a tortilla in front of me that I'd rather just throw away.", "author": "Blyss L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "MmmmMMMMmm...\n\nThis is why I love Mexican food. It's a hole in the wall. It's got the Olympics playing in Spanish. It's got 2 little Mexican ladies at the front taking orders and carefully placing your fork into your plastic bag with your order. It's love. \n\nIt's got GoPago, too. Got a fried fish taco and a prawn taco, both with avocado. YUM. Fried to perfection, although I do with the fish steaks (for lack of better words) were fatter. But, they don't skimp on the avo and they use the real cremoso stuff. I don't know how they expect you to actually eat them as tacos though, it's physically impossible because they're so loaded. \n\nThe shrimp one is not as good, has a kick to it though. It's much smaller than the fish one, too. I should've known better, I'm always disappointed with prawn/shrimp tacos/burritos. But always have high hopes for them. \n\nWould definitely come here more often if it were closer to my office.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Super fresh food and service that always delivers.\n\nTacos are loaded with meat.\nTheir pozole is so delicious\nBurritos are huge and tasty.\nHorchata that i could drink every day \n\nwould recommend", "author": "Fran M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "Been going here for years. Wish it had more seating. Gets really crowded at lunch. Also the prices just went up. Still affordable tho. Yummy", "author": "nancy w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "HUGE burritos and quesadillas that hit the spot. Not the best Mexican food I've had but totally satisfies the craving especially bc I live so close.", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "I have been on a veggie burrito kick, and have been trying all the Mexi places by my work in the TL.  I had been to the El Tesoro on Geary and was impressed so I tried this location out too. Veggie burrito was damn good, and made quickly.  All for less than $7.  Not a fan of lettuce in my burrito, so be sure to ask for no lettuce if you share my sensibilities.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "Don't be intimidated by the ugly ambiance. If you're interested in some good food, go there.\nYou don't have to sit down and eat if you don't want to, just take it out. :-)\nI don't even like Mexican food that much, but their plates are just so tasty", "author": "Ana Carolina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "The California burrito is just ridiculous.  This place does NOT close early like other places in the neighborhood.  \nBurritos are amazing... All that cheesy goodness... \nOpens late so awesome after drinks and one of the only places that takes card too!  \n\nBurritos are a way of life.", "author": "Wenter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "I ordered a super burrito and my husband ordered flautas food was great and fast!! Burrito was super good and big", "author": "Lety C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "I love this place.  I found it via Yelp and it's only a block from my apartment.  I've been dying for a burrito and decided to search out my craving.  Honestly, I read the funniest review about being in the scary Tenderloin/Zombie Town and he found refuge and refueled with great food at El Tesoro.  I thought \"yep, that sounds like the TL and if he knows the TL, then he knows good food too\" and I decided to go for it.  I always get the super vegetarian burrito.  SO GOOD!   The super tacos look good too, but I have yet to try those.  The people who work there are always so friendly, the place is clean, prices are good.  There are tables to eat-in if you want, and if you head towards the back by the salsa bar, you'll find an additional little hidden area with more seating.    They even have different beers and sodas in those nostalgic bottles, which I think are fun.  \n\nIn short, a good place to hide from zombies and/or get a great burrito.", "author": "Lori B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "Not bad. I ordered over the phone and picked it up less than ten minutes later. It was ready and waiting and when I took a bite I found they got my order right! There has been quite a few times that I order a burrito with no cheese and no beans over the phone and get one that has either just beans and rice with no meat or a burrito with just meat with cheese and no rice!  Yes, I know, unexplainable! I really should just order in Spanish.  \n\nAnyway, burrito was good - carne asada was cooked well and they didn't skimp on the meat or stuff it with too much rice and the size was just right. You also get chips with your burrito.", "author": "Mercy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "Not the fastest service, but the lady taking our order was very nice and helpful. Nothing better than a bowl of menudo after a night out drinking. A big bowl. Huge bowl. Big hearty portions with plenty chunks of menudo, yum!", "author": "Alexandra V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-12", "description": "Food was ok (pastor burrito). \n\nI ordered a pastor burrito with only beans, cheese and rice. Simple. I see a big Corona quart in the fridge by the register and I say \"and add the Corona\". She rings it up and tells me it is almost $17. I said \"how much is that beer??\"  She tells me it's over $7. I say just give me the burrito. Wasn't really that excited about the beer anyway. Then she tells me she CANT take it off!! I look at her like she is crazy. I haven't given her any money yet! She says she \"never cancels\". I tell her \"oh well than keep it all\". This is all within 30 seconds of ordering. No one has made my food. And she just looks at me like this tourist will bluff and give in. I just stare at her then she says \"8.97\" for the burrito. \n\nOf course I get it and it has sour cream and all this stuff I said I didn't want. So two stars for trying to scam a \"tourist\", which I wasn't and two stars because she couldn't heat a tortilla and slop meat, beans cheese and rice on it without messing it up. \n\nSame girl that is always there. Just scamming... \"I never cancel\". Ok", "author": "Jing B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "This place is good! The girl working the register was super friendly! She made great recommendations and got me to order the California burrito, it has fries in it!\nHad to tip her she was super nice and helpful and I have to say they will be seeing me a lot more! \n\nGreat place to go to late night in the area because everything else closes, and you don't have to go all the way to mission anymore for a great burrito like what they serve here.", "author": "Tim V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-28", "description": "Not for nothing, but you're basically eating in a bodega. I had high hopes as far as the quality of the food, but it was all super, super questionable.\n\nTo quote my friend Carl, \"This burrito tastes like cigarettes.\"\n\nIt's a glass half-empty sort of thing: great prices, huge portions, with a very odd undercurrent of suspicious flavors and overwhelming cheese.", "author": "Jiordan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-09", "description": "Great food, but if you have an ear for Spanish keep it open because they will try to charge you an additional $2 for sour cream on the side. Definitely caught them talking MAJOR crap and jacking up prices over reasonable requests when they didn't realize my friend spoke Spanish. 4 stars for food, but MAYBE be careful what you say in front of customers...? Or maybe that's just me.", "author": "Jacqueline W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "All their food has great flavor. My favorite is the California burrito. A burrito with french fries. I like mine with carne asada. Yummy :)", "author": "Omar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "Oasis in the TL warzone, or desert. Above average size burritos at Costco prices. Chips and a quality salsa bar to choose from. Oh, and what's this, a little table seating downstairs? Si, senor. With streetlevel fish bowl views, which in the TL is pretty epic. IMHO.\n\nESPN Desportes on the tube which was good chance to practice my spanglish and catch up on sports. Muchas garcias, Tesoro.", "author": "Tripp S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-30", "description": "El Tesoro sucks now. I don't know what happened but the food is crap. Walk down to El Castillo Mason for an awesome burrito.", "author": "chad l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-09", "description": "If you're from SoCal and you're craving a California Burrito (with fries, no tater tots), this is definitely one of the better options you have in SF.  The neighborhood isn't that great, but the trip is worth it in the day time.  \n\nOther positive is that it's the same price as the other taquerias in the TL, but with so many more options.", "author": "Robert I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-07", "description": "I love this place, really love it! It is my new \"burrito store\"/taqueria that i will go to when i have a craving for tacos/nachos/quesadillas or burritos :] I will hike my phat self all tha way up 4-5 blocks uphill just to come here instead of tha other taquerias a block away; it's THAT good.\n\nI first came here one night when a couple of friends nd i were hungry. we came around 1 am; this place is open surprisingly late for a taquria which is a major plus. Tha place is small but clean has a fair amount of seating for such a tiny place. Tha sauces/salsa are in tha middle of tha place nd is open for people to get themsevles -- great because most places only give one which is really a small amount so at this place, one could get as much as one wants nd of whichever they want.\n\nI usually get a super steak burrito or quesadilla but i've also tried a bbq chicken quesadilla which is yummy (they have BBQ chicken! this is tha only place that i know that has it) nd even asked/tried a steak/bbq quesadilla. They were confused/iffy at first because they've never got such an order but it was really good. I've also tried a steak/shrimp super burrito because i was craving one nd i'm glad i tried it. It was super DELICIOUS! oh my.. i've got to go get another one nd bring some friends to try it too. This place is def. recommended", "author": "Michael N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Got the taco salad, which was in a crispy taco bowl. The ingredients were super fresh, salsa bar was fully stocked and they were really liberal with the guac.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "My favorite burritos in the area. I especially like the California burrito with chorizo.", "author": "Kyle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "It was past midnight and I was craving mexican food but there were so many obstacles in my way...\n\n1) This place is smack dab in the middle of Tenderloin-- Yes, the streets were ghetto and duh, people were all cracked out on who knows what.  When we actually got the little taqueria, it itself was kind of ghetto too because it was not only teeny tiny but also kind of dirty :/\n\n2) It was far walk from my hotel/ Union Square-- almost 1 mile away!! That, plus the freezing February cold, scary people on the streets, and, oh yeah, almost forgot about  Tenderloin = bad news. \n\n3) If I didn't have my boyfriend with me, I wouldn't have braved the trek alone because it was pretty much similar to a walk down the streets of ghetto Downtown LA with it's homeless riddled streets :( Girls, be warned, do not trek alone. Or at least, bring sustenance in the form flats instead of heels and buff boys.\n\nBUUUUUUUT it was all worth it because it was probably one of the best burritos of my life. I got the Super Burrito, although I was suggested to get 'everything' by the waitress who was working there that night -_-  \n\nSuper burrito... do it. And get all the sauces too. They're kind of sneaky because they put the sauce bar in the back of the 'restaurant' but don't let this stop you!!", "author": "Amy Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-14", "description": "I ate a burrito from there today, midway through the meal, I found a hair. It was marinating between the meat and the sour cream. It was soggy just like the burrito. \n\nI wouldn't trust any of the reviewers remarking their burritos as the \"best they've ever had.\" Frankly, there are better spots (obviously) in the Mission. And those people  professing their love are probably from some town that doesn't know a burrito from a falafel. Or they were drunk, if they were drunk they'd enjoy it. Just ask my ex-roomie.\n\nJust saying, I've eaten there before and it's always soooo disappointing.", "author": "Ed G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-14", "description": "Ist the whors taqueria aim ordered steak and praws ....w drink for 23 DLLs aim also aim ordered for eat dear but De server Togo meat ist over Cook.. Aim Wait for my Food 25 min...aim never go back again", "author": "José C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-16", "description": "This place gets four stars based on two facts.\n\n1. I dont have to go to the mission to get good cheap mexican food.\n\n\n2. Chipotle tortillas. Yum.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Came here thanks to yelp's help. It was about 11pm on a Sunday night and we needed a quick bite by our hotel. The walk past the PLETHORA (and I mean plethora) of homeless people and other seedy types kind of threw us for a loop, but we're from Chicago so it's not like we've never seen that before...just not as many as are in this part of SF, I guess. \n\nAnyway, after the short walk, I ordered the steak and prawn burrito as so many other yelpers suggested. It was good. The prawns were better than the steak, but the portion was huge for a $9.75 burrito and the distribution/amount of rice and meat were perfect. I was expecting to get a burrito full of rice and two pieces of meat, but was greatly surprised. I feel like two burritos and two drinks for $25 is a bit much, but again, I wasn't too surprised as this is SF afterall.\n\nMy favorite part however, is that they accept credit cards.", "author": "Selena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "Ah... El Tesoro.  The first place I ever had Mexican food and a nostalgic must-visit for me every time I come home.  Isn't the best Mexican food there is (far from it), but probably the best place you'll find around the downtown/tenderloin area.  That isn't to say their food isn't good, but after a few years in San Diego... (nevermind as we've all heard That story before).\n\nI usually get the Super Burritos (Carne Asada, Pollo Asado, Carne/Prawns) and they're delicious and huge.  I like my burritos wet (which they will do as well), but El Tesoro's normal stuff is juicy enough inside that I usually don't opt for it.  You can also get your fill of cabeza or lengua for the same price.  Speaking of prices, they aren't as ridiculously cheap as other taquerias, but you definitely get value for money.  They have a good spread of homemade salsas toward the rear (near the TV with ESPN Deportes on all day), with the salsa verde going best with the complimentary chips for me.\n\nSo if you live in the area like I do or just have a hankering for Mexican while you're downtown shopping, walk a few blocks down O'Farrell and grab a burrito (and bring a friend unless you're a fatty like me).", "author": "Lincoln L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-08", "description": "Went here for a quick bite to eat before going out in the area.  Got a fish taco and chicken taco.  Free chips and salsa :)  They also serve beer :)  Great spot for before or after a night of drinking.  I would visit again!", "author": "Kyle I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-18", "description": "I really like this place. \n\nTheir shrimp burritos and fish tacos are quite good. The service is always fast and friendly. The prices are a bit high, but it's one of the few good taquerias in the Tenderloin.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "Fast, tasty, large burritos. Enough said. Perfect, really.", "author": "Mister T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-01", "description": "Top choice for neighborhood mexican.  The salsa bar with fresh roasted peppers is great.\nI like the large number of vegetarian items.\nFavorites are the vegetarian super taco (giant heap of salad with guacamole for $4) and the vegetarian burrito with roast vegetables.", "author": "Ric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "THE ABSOLUTE #1 BEST BURRITO I'VE EVER HAD IN MY LIFE IN THE WORLD.\n\nIf you come here, GET THE STEAK AND PRAWN BURRITO!! Holy christ this is the best burrito i've ever had, if you really wanna go for the gold, ask for no beans.  I go here everytime I go to SF and everytime the burrito is MAGNIFICENT.  The trick to a good burrito is distribution, as in, even distribution through the entire burrito of all the ingredients and this place has it down to an art.", "author": "johnny l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "Not the best I've had but I've certainly had worse. I enjoyed the salsa bar and they had more meat choices than the average taqueria.\n\nIt's worth pointing out that the reason all the chicken is pink is because they use the same chicken for all the dishes and it's marinated in a tomato  salsa. Yummy and, no worries.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "They serve pretty tasty food. The cashier girl is friendly, too.", "author": "Akiko M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-28", "description": "3.5 stars. Shatangi had the best Al Pastor burrito the other day. Spiced well and a good mix of ingredients. The girl at the counter let me stand there for a few minutes until she realized I was there and the cook was more busy flirting with the gordita at one of the tables than he was with the food. 5 stars for the food and 2 stars for the slow, unfriendly service.\r\n\r\nShatangi told you", "author": "Njon W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-20", "description": "I came here last Friday as they were closing because it was super late.  I ordered a carnitas taco and a lengua taco, my go-to order for all taquerias.  My friend ordered a carnitas quesadilla, we grabbed our salsas and left to eat elsewhere since they were closing down.\n\nNote: they do not have chorizo, much to my friend's dismay.  of course, he thought hitting on the cashier girl would somehow make chorizo magically appear in the kitchen.\n\nThe tacos were pretty good, though certainly not the best I've had in the city.  That being said, I thought the carnitas quesadilla was freakin' amazing.  Maybe it was because I had had a few (several?) drinks that night, but that quesadilla was divine.  \n\nWould I go out of my way to go to Tesoro? probably not, but I'm in the area, it's late, and I'm hungry, I'm sure to get me some carnitas quesadilla.", "author": "Naoko M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "I have been staying down the street for the last month; and this place is on point! Burritos and Nachos are quite filling with super fast service - better eaten when drunk but still tasty if sober. Regular burrito with choice of meats will run you $6.50 with tax - which is a stellar deal as the portions are huge and it comes with a side of chips.\n\nCashier Girl is attractive and quite friendly which is a plus.\n\nOpen late on the weekends and takes credit cards.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-28", "description": "Just had my first bowl of Menudo the other day. I guess I should had gone to it on Saturday or Sunday like the menu said. What I got was a bowl which had an inch of grease/ oil on top. After sucking up the oil literally I began drinking the soup. Tasted like a greasy version of Ph without the noodles. \n\nThere was very little tripe in the bowl and had 2 big pieces of bone which took most of the space in the bowl. I might be a Chino and don't know what I am eating, but I don't believe menudo should be like that.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "This place is great. I had a delicious and huge carne asada burrito covered in sauce cheese avocado and a bit of lettuce. it was done properly , fresh and very tasty.I couldnt finish it in one sesh...it took two. I tried a burrito in the Mission district a couple days later and it sucked ass in comparison. I will return here for some good mexican food in SF.", "author": "Stefan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-31", "description": "My friends told me about this little place since they live in the TL. This place is pretty chill and clean for a Taqueria. They take credit cards so that's a plus since I don't carry cash.\n\nI ordered the Super Burrito before with Steak. It was yummy! Greasy and oil drippin with every bite! But I don't eat this often so it was okay! Came with a side of nachos. They have a cute little salsa bar where you can get your own salsa, many varieties. \n\nThere is also free water cups. \n\nI also ordered a plain cheese quesadilla before since I had the munchies but didn't want super greasy steak or anything. I dipped it in salsa almost with every bite. It was delish! Simple, yet good. I will come to this place when I am in the TL and crave a burrito!", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "Super sweet workers! Helpful and the horchata was perfect! Eggs were well cooked, plates were fairly sized. Chips were kind of stale but okay.", "author": "Shalaya J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-08", "description": "El Tesoro has been my go-to taqueria for the past year for a couple of reasons:\n1) It was 2 blocks from my place.\n2) It's ridiculously clean for a burrito place in the TL.\n3) Salsa bar(!) is always stocked with a variety of flavors and levels of spice--along with to-go cups (I can get as much as I want withoug shame because it's in the back, far from judging eyes)! AND it's CLEAN!\n4) SUPER friendly cashiers!\n5) Yummy burritos, quesadillas, and nachos--not bland like Taqueria El Sol on Geary! El Tesoro uses delicious grease and fat--the way it should be, dammit!\n\nReasons why I won't miss it:\n1) The price. A burrito and quesadilla in the TL should not cost me ~$16.\n2) The pollo in the quesadilla suiza is always pink (why did we continue to order and eat it time after time?). We never got sick from it, but looking back, probably not the brightest decisions we've ever made.", "author": "Kristine W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-25", "description": "I don't think I'll go back to El Tesoro Taqueria...\n\nTheir burritos are very big +0 (size doesn't matter to me.  taste is everything) \n\nThey use grilled (not fried) fish for their fish taco. +2\n\nThey use large prawns for their shrimp tacos / burritos. +1 \n\nThey grill the fish when you order it. +1 \n\nThere is a salsa bar with 6 different salsas +1\n\nTheir pinto beans tastes like they just came out of a can. -2\n\nTheir rice is not tasty...  very plain without any kind of flavor. -1\n\nTheir guacamole is very watery -1\n\nIngredients inside of the burritos are not evenly spread... first bit had all rice and last bite had all cheese.... -1\n\nI have a hard time finding a Mexican join in my hood...  I really really really want to find out where I can get GOOD Ceviche, Sope,  Sopa de Albondigas, Chili Relleno....  Yes I tried restaurants in Mission.....", "author": "Chie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Best Mexican in Lower lower nob. They make Chilaquiles!! Great tasting super tacos, carne asada plater, Nice little salsa bar. Habanero salsa!! ayyy..Not the best location but it's open late.", "author": "Fred V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "I've been 3 times, but I will always remember my first experience!! \n\nThis review is for Take-Out waiting for the 27 bus review: \nQuick and easy, I have 12 mins left till the bus came, decided to order a carnitas burrito (HUNGRY)... didn't think much of it because it was the closest place and easiest take out. \nEverything on it please! Head to the salsa bar in the back, filled up on my salsa fixes. \n\nGot home... wait for it.... settled down, took off my coat shoes, got the remote out... now ready to eat!! My version of the TV dinner. \n\nFirst BITE: YUM!!!! Had everything in my first bite, rice, sour cream, carnitas, pico, beans... maybe I was just really HUNGRY, but I never felt that way about my burrito.... I was in heaven. \n\nThat was it, I couldn't NOT go back, so whenever I'm heading that direction it's my stop for dinner. \n\nI haven't tried everything on the menu, but it looks amazing and people do sit down and eat there.", "author": "Judi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-17", "description": "They don't understand English. They took 3 tries to understand \"super\" and even after repeating \"no sour cream\" several times still put sour cream in my burrito.", "author": "Phoenix E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-20", "description": "just had the fried fish taco...\nThe fish was thick and the breading stayed on.  It had a nice meaty consistency.  They topped it with this cabbage, not sure what it was marinated in, but it was A-MAZING! \n... this is my new favorite dish here", "author": "Jannea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-04", "description": "Lardy tortilla: check\n\nTender, flavorful asada: check\n\nQuick, friendly service: check\n\nLegit salsa bar: check\n\nThe burrito was so big I couldn't even finish it.  Not the greatest burrito I've encountered, but solid nonetheless.", "author": "Geoff B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "Service was shitty they where really rude. Me and my gf will prob never go back. On top of that food wasn't really up to par either.", "author": "Joe F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "Service was horrible. Tortilla was undercooked. Food was not good. Not fresh. Not worth it.", "author": "Chelsea G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-05", "description": "I'm not being harsh. I tell it like it is. This is the most disgusting burrito place I've ever eaten.\n\nI love authentic mexican food. I just hate the idea of being in the toilet after eating a simple burrito. I came here last year for late dinner after school. I thought it was a descent place to eat so I gave it a shot. I ordered a regular steak burrito no sour cream and cheese. I ate almost half of the burrito when my stomach suddenly feel a bit upset. I never had any weird food that day and my lunch was actually just a salad. Silly me to just ignore my stomach. I thought I was just hungry so I ate half of the burrito when I felt a bit of grawl and a bit weird. And my nightmare begins... in the toilet. Son of a bitch... diarhhea was shooting out of my ass for at least couple of hours... back and forth. I was really pissed off that I thought of returning back the next day to tell them about their nasty food. But didn't want to waste my time as I already wasted eating their disgusting food. Anyone who eats here must really like to sit down the toilet. And for those who wish to try, AVOID AT ALL COST. But if you wanna experience pain and suffering in the toilet, don't say I didn't warn you. Adios Muchachos!\n\nIm surprise they're still in business.", "author": "Jules S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "I showed up for my haircut appointment nearby too early so I decided to wait and have some soda at El Tesoro Taqueria & Grill. The host told me I need to order a meal otherwise I can't sit at the restaurant. I said just 5 minutes, her answer was no. The place is empty, -- not an exaggeration, I was the only one there. Terrible customer service + horrendous attitude + bad juju to the establishment = bad karma. Maybe that's why it's empty?", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-21", "description": "I come here frequently because it's by my house.\n\nI love how expansive their menu is. You can get chimichangas, tortas, mole, and whole fish. They also have daily specials like chicharron (which is good if you like fried pork rinds).\n\nAlso, I strongly recommend the soup here. I always get the chicken soup, but I bet the others are good too. It might seem expensive, but the portion is huge, enough for two people/leftovers. They also give tortillas with the soup, which is nice. :)", "author": "Xavier G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-03", "description": "I don't really go through the TL... I live on the other side of the Bay.  I found this place by accident and all I have to say is Wow.  The food was great!  The staff are super friendly which is 90% reason why I go back to any restaurant. Also, If the food is good and the service is bad, I will not go back.  \n\nI ate a steak burrito that was the size of my house.  It was huge!  I ate half and saved the other half for later.  To bad there isn't one in Alameda.", "author": "Marvin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-23", "description": "The food tastes good, but I get sick to my stomach everytime I have eaten there. The service is so so. They may bring the food to your table but not always.", "author": "Jose R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-02", "description": "I've been here so many times and it's always good but never excellent. In a city with a wealth of incredible burritos and Mexican cuisine this is a 3-star spot. In fabulous NYC, however, a spot like this would score in the 4-5 star range since they know how to roll their burritos and bring the real flava. \n\nI'd say the prices are a bit steep as well. For a corner taqueria, a $9 super burrito ain't all that. I love the nachos here, but have had the unfortunate experience of receiving stale chips a few times. Tesoro manages to satisfy late night taco/nacho/'rito cravings when I'm in the neighborhood but for the most part I'd rather hit Cancun or Farolito for my hot Mexican injection.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Their super nachos are delicious and full of fresh guacamole, rice, beans, etc. They don't skimp out at all. Their super tacos are incredibly rich as well. One of those tacos satisfies me for my entire lunch. Their prices are reasonable and they have a small salsa bar in the back to eat with the free pack of nachos they provide with your meal.", "author": "Lina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "There's nothing better than a big, fat, juicy...burrito! My friend just recently moved across the street from El Tesoro and before I even tried it, I immediately said to her that this was going to be my new favorite spot when I visit...and I was right.\n\nI ordered the super carnitas burrito and this thing was seriously HUGE. I don't think I've had a bigger burrito at any other place in SF. Mexico, sure, but SF? No way.  As far as quality goes, some bites were four and even five star worthy, while others were more 2-3 star. Some of it was mixed well and other parts were kinda clumped together (e.g. big mouth fulls of just cheese or rice, etc.) I'd still definitely come back; especially since it's open late night! I'm always looking to bookmark some new yummy drunk grub spots.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-18", "description": "With all the amazing options for Mexican food in San Francisco, this just isn't cutting it. I think the main downfall about this place is how water-y their guacamole is. It completely ruined my burrito!\nSome other major cons are that the chips are also not tasty at all, the meat is not good quality and there's nothing truly remarkable about their food at all.\nAlso, it's not really that cheap, considering it's located in the Tenderloin.\nI'm sure I'll be back though, just based on how close I am to it.\nIt really is nothing awe-inspiring or life-changing though.", "author": "Felicity M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-10", "description": "Mom and I went on vacation to San Francisco in April 2009. I'd visited once the year before and my former coworker introduced me to the awesomeness that is The California Burrito.\n\nAfter we dropped our suitcases off at the hotel (Hilton Union Square), I ran down to the concierge and hurriedly asked, \"Whereisthenearesttaqueria?!\" You see, I'd been craving them since my first trip to San Francisco in May 2008.\n\nHe pointed me toward El Tesoro, located just a block or two away on O'Farrell Street. When we arrived at the storefront, my mom seemed hesitant (\"Where are the seats?\") but I asked her to trust me. \n\nWe each had a chicken adobe burrito and helped ourselves to the chips and salsa. Oh, the salsa! Listen Californians, I live in New York City, Land of No Good Mexican Food. Fresh salsa is such a rarity that I moaned while I inhaled this tomato-y treat. I poured the salsa on my burrito and ate it by the forkful, and made many trips to the salsa bar for refills.\n\nI ate the green salsa, the red salsa and went back for the jalapenos. \n\nSomeone please open a real taqueria in NYC. \n\nLove, \nMy tastebuds.", "author": "Amanda D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "11:30pm on a Thursday and my friends realized that they had accidentally skipped dinner.  We were in Cow Hollow area, which is the land of no latenight food.  So thanks to Yelp we drove to the Tenderloin for some of the best Mexican food!  The carne asado super burrito rec by the cashier was spot on. The guac tasted surprisingly good and the salsa bar was well-utilized :)  The quesadilla was a hit too.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-21", "description": "The French can make anything sound sexy-romantic. For example:  le chien a pris une merde.  Sounds sexy, right?  Well, I believe it means \"the dog took a shit.\"  I wanted to study French in high school, but my parents would not have it.  \"Where will you use French?  There are far more Spanish people in America than French.\"  So, Spanish it was.  Little did they know that a year of my life would later be spent living in Montreal...a lot of good my forced Spanish classes did me there.\n\nParfois je deteste mes parents.  (Sometimes I hate my parents) ((FR))\n\nPero yo digress (But I digress...)  ((I think, in ESP))\n\nEl Tesoro means TREASURE in Spanish.  This is an understatement.  I love this place.  Their Horchatas are bad-ass.  For those who have never tried one: I believe the Latin American version is referred to as Morro (or rice-based with Cinnamon) and it goes well with any meat you can stuff down your gourd, yes, even Cabeza and Lengua  (beef head and tongue).  I love ordering Horchatas - because I expect most gringos order a Pepsi.  Their pretty countergirls always do a doubletake.  \"Yeah sweet thang, that's right...a horchata, and please don't spill anything down the side of that styrofoam cup.\" Oh, isn't styrofoam an absolute no-no?  In fact, isn't it illegal now?  Illegal or not, minus one star for not doing their part to save the world.  I suppose I could bring my own thermos or cup...but I'm a lazy bastard.  Bitching about it is how I do my part.\n\nTheir Caldo De Res (beef soup) soothes the soul on those arctic San Francisco nights (you know...when the mercury dips below 60).  Their standard tacos just make me wanna do a hat dance...but my sombrero is a baseball cap.  That would just look foolish.  Last, but not least, is their special \"Mojado\" (wet) Burrito - they'll put whatever you want in the damn thing and then smother it with enough guac, sour cream, cheese and salsa for a small child to doggy-paddle in.  It's holy mayhem...\n\nIn retrospect, learning Spanish was not the end of my world.  El perro tomo una mierda WILL NEVER SOUNDS AS SEXY AS:  le chien a pris une merde.  But that's okay...you can't get a morro horchata in Paris...at least not a good one...no matter how many times you say s'il vous plait.\n\nFeliz Navidad!", "author": "Mc Matty b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-09", "description": "There was mouse poop in my chips when I came here.  I discovered this AFTER I had eaten almost all of them.  \n\nEnough said.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-08", "description": "Eh.  I had a veggie burrito, but it was soggy and packed to the gills with rice and beans that I could barely taste any salsa or guac.  The chips were good, though.  Seating is available.  The staff was accommodating when I wanted to change my order.\r\n\r\nGood taquerias are hard to come by in this area.  For a savory burrito, I'd suggest walking down to Golden Gate and heading to El Castillito or Fiesta Tacos.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-10", "description": "Pretty good steak and shrimp buritto, but way more rice and beans than meat.  Definitely not bad, but nothing memorable.  If you live in the neighborhood it's worth a walk, but probably not worth looking for parking.  There are much better taquerias in this great city!", "author": "P J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-13", "description": "location being tenderloin...expectations set low...late night stroll....through mentally insane...addicts and those suspicious....following alpha leader....destination becomig el tesoro....taqueria & grill....interiors fairly kept....mostly barstool seating visible...surprising basement level tables....seating actually found plenty.....largescale menu...soup. salads, tortas, tacos, burritos, plates, sandwiches, burgers...*breathe deep*...quesadillas, nachos, desayuno, etc...*breathe out...woooooo*...order being \"safe\" carne asada burrito....no beans...no rice~!!~@!...only meat 'n' salsa wanted....\n\npreparation being \"a\" grade...best grilling ever seen....meats and tortilla grilled...final grilling before grilling shut....most perfect burrito.....taste grading a \"b\"....heavily seasoned bringing flavors max......presentation an easy \"b\" grade given....grilled closed tight...standard foil holding.....other's plating looking fairly well.....although...sanitation falling to miserable failure...solid \"f\" given....uncovered raw flesh....chilling like a villain....no gloves or washing visible....yet, open kitchen to boast....cooking and eating....double dipping into ingredient fixings....change that...\"f-\"...that possible grade in school?.....please confirm if experienced......overall \"d\"....dos stars...and no more~!~@!", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-03", "description": "I tried this place out because Shatangi Told Me (tm) .. haha! ...*ahem*.  Located in the heart of the TenderNob, the Al Pastor super burrito is prolly one of the tastiest I've tried in this 'hood. They also do something to the tortilla that makes it very flakey and almost croissant-like decadent.  All this for $5.50 folks, that's a hard price to beat for that amount of food.  \r\n\r\nOtherwise, extra points for being well lit and clean. 4 stars homestyle!", "author": "I. O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "tasty fillings stewed to soak up the spicy flavors, different salsas on tap at a separate station, my mexican buddies take me here, what more can I say", "author": "Jeff O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "I love this place.  This is my favorite taqueria by my job, and I've turned so many people onto this place, and everyone loves it as much as I do.  The flautas plate and steak plates are ridiculous.  So much food, that when I eat here at lunch, I don't need to eat dinner that day.  Good salsa bar.  Not huge inside and seating is limited, so getting for \"for here\" can sometimes not be the best option.", "author": "Logan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-20", "description": "This used to be my favorite place in the TL. Now I don't really go anymore. They are going downhill really fast. They lost their head cook and nothing tastes good anymore. The counter service has also gotten worse recently. I have to find a new burrito joint. :(", "author": "Paul O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-19", "description": "Everytime I go by this place I think I see a tranny behind the counter.\nApparently this is not the case, or so I am told.\nThe food... has a certain I-don't-know-what I attribute to filth.\nBut filth never tasted this good before?\nKeep away from the nachos.\nGood food, reasonably priced.\nNotice the furniture yet?? Who doesn't like to pretend they're in a Quiznos every now and then, right?", "author": "mike l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-27", "description": "A nice big well wrapped burrito with a grilled tortilla, which is a nice change.  The carnitas was good, but the beans, rice, guac and crema didn't add much to the party.  Juicy beans and guacamole resulted in a loose burrito that was falling apart once you were about halfway through.  \nOther reviews mentioned the cleanliness, but the place seemed acceptable in the light of mid afternoon.  Who knows what happens in the middle of the night. \nIt sure wasn't the best burrito that I've had in San Francisco and I wouldn't make a special trip for it, but as a neighborhood joint or in a pinch it's ok.", "author": "Thomas T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-08", "description": "It seems like it's never a good time to saunter through the tenderloin, and I always want a burrito at the oddest of hours. I've spent the last three weeks agonizing over my need for a BBQ pork (Al Pastor) burrito from El Tesoro. I cannot put into words how glorious and sweet and satiating it is... and when I finally grow some balls and get one, I will write a more thorough review. Just talking about it and not being able to have it, makes me feel dark and empty inside.", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-24", "description": "Skip El Tesoro if you're in the mood for a veggie burrito--I had the same soggy (the thing was relentlessly squirting, juicing and oozing) and flavorless experience as Marsha Z.\n\nUpsides: they take plastic and the horchata was good!", "author": "jizzie b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-03-03", "description": "04/03/07 Update:\nShould have taken my own advice.  Ordered a Chile Relleno and fajitas (without rice or beans).  Get home, Chile Rellenos are ok, well except for the toothpick and a stray paper towel mixed in with the cheese.\n\nFajitas are about 1/4 cup of unseasoned beef (what happened to their good carne asada?) with a mountain of rice and beans (when I specifically said none).  I should have checked before I left.  I know they opened a store up the street so maybe they put all the competent people to work over there.\n\nEither way, even though El Tesoro is a half a block away from me, I won't be returning.  Sorry.\n\n8/29/06 Update:\nI'm taking away a star since the last three times that I or sweet baboo went there we had unusual difficulties in communicating with the counter girl (who is really nice, but I can't figure out her deal).  Once led to a half hour delay and a wrong order and the latest time led to a very grumpy sweet baboo (who speaks spanish, so that's not the issue) upon return with dinner.\n\nIf you do go, don't expect super fast service and make sure to check your order before you leave, if it's take-away.\nFresh meat, reliably tasty and filling burritos, good nachos, good salad - overall a very decent place to get a burrito in the Tenderloin.\n\nSometimes they get backed up - takes a while to get your order, but the salsa bar is cool and the area is pretty ok in general.\n\nThe beans need more flavor - but if you get a carne asada burrito, you'll be impressed by the meat.\n\nStill beats out Chunky's for fresh ingredients and cleanliness.", "author": "Suze C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-19", "description": "Everything here seems a little off and extra-EXTRA greasy, and not in the good way.  I had a super veggie burrito once and it seemed way too salty.  Nachos were decent, but not that great.  The chips seemed extra heavy, thicker than at most places.\n\nThe pattern here seems to be \"too much,\" except for the good prices.", "author": "jess l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-06", "description": "Having been here a couple times now, I would have to say this is probably one of the better TL taquerias. There's no blandness, just tons and tons of flavor. The al pastor is juicy and grilled to just the right crispiness! \r\n\r\nAlso, maybe this was just me, but they have an amazing salsa bar that I didn't see the first 2 times I went there. It's kind of hidden in the back near there additional basement seating area!", "author": "Brett B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-28", "description": "I was disappointed when I ate and was even more disappointed for the next day and a half.  The food was mushy and overcooked, the taste was bland.  The place looked pretty clean and everything \"seemed\" all right...\n\nGot food poisoning for the next 36 hours and will never return.", "author": "Paige C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "This is my spot!!! I LOVE this place! You want a super good cheap burrito? You've got one! The people are super nice, you get a basket of chips and help yourself to the salsa in the back. If you ask for a cup, they have a pitcher of water near the salsa stand, so free water! What more can you ask for!? \n\nOne time when I was there I was sitting in the section in the back near the window and saw one guy piss in the garbage outside. And then two minutes later a homeless man went through that same garbage. Play that visual in your head with blasting obnoxiously awesome mexican music in the background and you've got yourself a REAL San Francisco burrito place. \n\nBy the way...the burritos are on the big side, STUFFED to the point of near explosion...so maybe you might wanna share one.", "author": "Shaina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-05", "description": "Recently, there's been a taqueria renaissance in the Tenderloin, giving us burrito lovers more choices than old standby Dos Amigos.  Right now El Tesoro holds the title for best taqueria in the area.\r\n\r\nThe last time I went, I had the carne asada burrito, which was the best asada burrito I've ever had -- really flavorful, juicy steak, and the perfect ratio of meat to beans, rice and salsa.  My shrimp-loving lunch partner got the camarones a la plancha, which is basically shrimp with bacon -- how can you go wrong with shrimp and bacon together???  \r\n\r\nA few other plusses -- fresh (albeit slightly greasy) tortilla chips, a proper salsa bar (the only one in the Tenderloin), and immaculate cleanliness.  And the couple times I've been there, the woman at the counter was really friendly.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-11", "description": "You know what you should eat here? (besides apparently, the shrimp tacos) is the carnitas tacos. Yum. \n\nEL Tesoro is really a treasure. I feel that this taqueria is as good-if not better-than many of its' peers in the Mission and greater SF. Their fried pork is amazing, really something to desire after a long night of drinking, a long day of work, or any really strenuous activity at all. It' s that good.\n\nI live in the hood, and it is something which  really appreciate on a daily basis.  \n\njeez. I'm surprised that this place hasn't gotten better rating as well. I love it and hope that other people do too.", "author": "Libby T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-26", "description": "I live REALLY close to this place so I go there when I'm lazy and it's late and I just want something to eat.\n\nHowever, if I was a vegetarian I wouldn't go here.  My sister got a veggie burrito with a little bit of meat in it.  But I've never had a problem.  It's decent for a quick, easy, cheap and somewhat tasty burrito.", "author": "Josh V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-20", "description": "Since my taco mishap, this has slowly become my favorite neighborhood burrito. \nFor starters, the tortillas are grilled, not steamed. And the salsa bar has several sauces which vary in flavor and spiciness, but are all consistently good.", "author": "Chadwick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-25", "description": "shrimp burrito is pretty good. i also like to order the tostada, its like a mini salad and its only like $4 or so. if u order the whole 'taco salad' its like $8. \n\ngrilled green onions, a must!\n\ngreat for late night!", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "My FAVORITE place to get a burrito!! They have great ingredients, they taste AMAZING and the tortilla isn't too much like some other places i've been to around the area.  \n\nThis is my 'when all else fails' or 'can't decide on what I want' or 'im broke and need something filling for cheap' or 'mmmm i want a delicious burrito' place :D\n\nThanks El Tesoro!!  I'll never stop coming!!", "author": "Carrie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-07", "description": "nothing special. Fast and friendly service. Food below average. Large portions.", "author": "vishal k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-22", "description": "LOVE, LOVE, LOVE their tacos! Ever since I've had their bbq chicken tacos I am addicted. I've been to all sorts of taqueria and I think this is the only taqueria (compared to all the ones I've eaten) at that have bbq chicken as a choice of meat. Their regular chicken tacos are just as delish but there's something about them bbq chicken tacos that rock my world! Their burritos are good but not great-- very filling though. If you're ever in the TL this is the taqueira to go to!", "author": "selina n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "I stumbled upon this place a while back and fell in love with it. Pretty decent selection, but still a little perturbed as to why I get a quizzical look when I order carne, cheese and guac only. Staff is really cool, but must be thinking silly gringo.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-09", "description": "Awesome carnitas tacos for a couple bucks, open till midnight.  It's a tiny little place, but it's the perfect thing if you're coming back early after a couple drinks.", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-09", "description": "quite good. i had better burritos, but their prices are good and you know what, its hard to find a good mexican joint downtown.\ni recommend the super burrito mojido...oh yeah.", "author": "Hassan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-13", "description": "I like this joint. It's my regular place since I live a few doors down. Sometimes the food is inconsistent, but it has never sucked. It definitely not like the food in the mission, cause this is the tenderloin. I like their cheese enchiladas, the shrimp quesadilla, veggie nachos, and burritos. It's decent, it's next door, and is usually around the same taste every time I go.", "author": "malarky j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-27", "description": "I had the best Super Nachos here, at this new Taqueria located on the Corner of Leaveworth and O'Farrell. It was a saturday night and my digestion was great (I can tell what taquerias are bad or good if I have nightmares or not.) My carne asada burrito I had three days ago was proof that this place was something else. Way high reccomendable.", "author": "CacaoRock J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-27", "description": "Very clean space and cheap . Had the Vegetarian Burrito for lunch. Service is slow at times but the food is great especially for grab and go. They are open until 11pm every night.", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-11", "description": "I live next door to El Tesoro and I eat here at least once/week.  Anyway, it's typical, greasy, delicious mexican food.  I love coming here when I'm too drunk to make it much further.  Good food, nice people, fast service.", "author": "Callie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-25", "description": "good enough to eat my half of a burrito and chips (and drink more than my half of the horchata), good enough to go back to if i'm in the area and needing something to eat, as i was when i happened upon this place. i wouldn't go out of my way to eat here again...\n\nit IS clean, and the lady working the cashier WAS super sweet, but i'm really picky about mexican food.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "Good food and fast service. Ive tried a wide variety of their menu since its so convient for myself. Their products always look nice and fresh. big fan of open kitchens. The place is always clean and have late hours which is a big plus for me. I swear by the freshly squeezed carrot juice ..even though I feel bad for the girl who has to make it.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-12", "description": "The Burritos here are delicious, and the staff are very friendly. When time I didn't have enough money for my corona and the cashier trusted me to bring the money another time, which i did (im a regular customer). I highly recommend this place for their friendly and prompt service. The Burritos and Nachos are delicious.", "author": "Nathan Anthony R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-08", "description": "Very friendly service. Fresh Salsa Bar in Full Effect! Yum. Very affordable for the serving sizes and El Tesoro is bringin' sexy taquerias back to the TenderNob.", "author": "Braden B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "This is better Mexican food than some I've had in the Mission. I live for the chilequiles! The veggie burrito is huge, the veggie quesadilla is sooooooooooooo good. Everything is fresh and wonderful. My mouth is watering just thinking about it!", "author": "Heather G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-25", "description": "I really like this place. Everyone is so friendly, and they make my veggie burrito just the way i like it. Their chips are the best, too. My boyfriend loves their quesadilla's. It's enormous for such a cheap price.", "author": "Brenda F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-09", "description": "I love burritos with refried beans. I don't like burritos with salsa. Every time I go to El Tesoro I order my burrito with refried beans, no salsa. Every time I come home to eat my burrito, it has whole beans with salsa. I don't think it is a complicated request, which I make ever so politely. Maybe they think I'm an asshole because I put in a special request.", "author": "Wendy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-24", "description": "This long, narrow corner taqueria has some of the best bean-and-cheese burritos on the planet. They're huge, salty, cheap, and perfectly symmetrical. Their hot (not habanero) salsa has a depth of smoky flavor you can neither get out of a bottle nor replicate in your home test kitchen. I'm not sure how they do it, but El Tesoro has mastered the extremely difficult art of making the simplest dish, very nearly perfectly, and giving it to you with a freaking smile. And that's how I judge \"ethnic\" food places - by the simplest dishes (or the most available, such as Pad Thai). As an added bonus, because the restaurant is in the Tenderloin, the people-watching is an exercise in sadism.", "author": "Angela O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "I live across the street from here and go at least once a week. I love that you can order a dinner plate and EASILY split it between 2 pple. They give a lot of food. You get whatever meat  plus sour cream, guac and rice...\n\nI lived in the mIssion and I know that Mexican food is supposed to be really good there, but this place is the same caliber. People love to love El Farolito and la Taqueria, but the food here is just as good. I'm going to say it's better. \nThere isn't much of an atmosphere or anything. I don't recommend coming with a date to sit down here, or the like, but the food is good. Try the chicken fajitas. Had them last night and they were great", "author": "Roger W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-09", "description": "I'm surprised this place doesn't have higher ratings.  I've had the hardest time here finding a REALLY good burrito and then my boyfriend took me here.  It was awesome!  Probably the best carne asada burrito I've had in the city AND I was even sober eating it.  I think it was awesome... huge portions for the price and I LOVE how they grill it!  Amazing, and I'm begging my boyfriend to take me back here!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "This place is pretty tops compared to all the other Mexican places I've tried in the city.  They have great sit down style plates aside from the delicious tacos, which isn't always easy to find.  Their camarones el diablo is cooked in the perfect sauce.  The al pastor is just the right shade of orange and full of flavor, a total giveaway that they know what they're doing all around.  The salsas are all flavorful and plenty spicy when they claim to be and the horchata is good.  That warrants 4 stars.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-23", "description": "I am extremely picky when it comes to Taquerias. my favorites for the longest time were El Farolito on Mission and the one whose name escapes me on the corner of 16th & Valencia, after those two is Taqueria Cancun on Market, but this one has won my heart because not only is the food excellent and reasonable, the restaurant is always clean and the service is wonderfully friendly. it's right up the street from me and I'd definitely love to take my friends here!", "author": "Sakkara C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-30", "description": "Worst Mexican food ever!!!\n\nYou want to make the kinda of Mexican food they make at El Tesoro. Get all your ingredients from Sysco. This is the Mexican food your lunch lady made.\n\nThe Adobada tasted like sloppy joes. The Tortas used rolls that reminded me of hot dog buns.\n\nSeriously don't go here. DON'T EVER!!!", "author": "Dani Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-11", "description": "This place really is a treasure! Probably the best taqueria I've found in San Francisco yet... Their super quesadilla is absolutely amazing! Service can be a little slow at times, but it's always worth the wait. I have to admit that once or twice I have felt *slightly* nauseas after eating here, but it wasn't bad enough to stop me from eating here or giving them less than 5 stars. Until I find a better tacqueria, El Tesoro gets 5 stars.", "author": "P A U L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-19", "description": "I wish I could give this place more stars I really want to but nearly every visit I've gotten some gnarly meat.  I will say that most everything has been good aside from this fact.  Don't get me wrong it didn't keep me from finishing my burritos or super tacos and I mean this kind of thing happens.  However it just happens too much for me here to continue to give it a better review.", "author": "Derek D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-07", "description": "This place is a real treasure in the tendernob!  The burritos are great, but the real standout for me is the quesadillas.  These aren't the appetizer chain restaurant style that are flat and dry, so get that out of your head immediately.  They're almost like a burrito that's been filled with cheese.  I've never had a quesadilla that was so thick and filling.  Also, the first few times I went here, I didn't know about the salsa bar, which is back behind the kitchen area, where there are also bathrooms and additional seating.  The service is very friendly, but if you're trying to give special instructions for your food, it sometimes helps to speak a little Spanish, because some of the clerks might have a bit of trouble understanding your English.  They also have a juicer machine with tasty fresh juice.", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-20", "description": "El Tesoro has some really good mexican food if you're looking for a quick and cheap bite to eat. The food is consistent and the staff is pretty friendly. \n\nThere is another location on Geary a few blocks away. The Geary location is equally as good but the girl who works the register is a snotty b*tch and can't take an order without giving attitude and acting completely over her job unless you're also a spanish speaking mexican.\n\nOverall both places have ok food and decent prices. The O'Farrell location has much more pleasant staff though.", "author": "g m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-04", "description": "It's been a few hours now since I've finished my burrito, and the debate has raged on between a four or five star review. It wasn't the perfect experience, had they offered a choice of tortillas, that would have sealed it. But for what they didn't have in tortillas, they more than made up for with the BBQ chicken. Not many places offer this, and as I watched them toss my chicken on the grill and pour BBQ sauce on top, I knew I was in for something good. Add in the no charge lettuce, a healthy portion of black beans and rice, and a grilled tortilla that holds it all together, it is pretty close to burrito heaven. I'll give it 4.75, which rounds up to 5.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "One of the best  taqerias I have ever tried. Great meat in whatever you decide goes around it. Burritos and tacos (though no hard shell) are both great  as well as their chips and range of salsas. \n\nAs well as not being expensive and good service make this place one of my faves. Limited seating inside.", "author": "Brook B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "Burritos, quesedillas are hella good, a good price for it's size. One burrito is filling so is one quesedilla, and it's not like to stupid thin ones at taco bell, these are mad thick and big! I like their fish tacos, but i think the price is maybe a dollar more than what it should be for it's small size. I think it would taste way better if they fry batter the fish, so it'll have a crunch to it when you bit in to it!", "author": "kirehleen f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-31", "description": "stumbled into this taqueria a few weeks back whilst out boozing, place is not cheap like mission taqueria's,  but the carnitas burrito's and carne asada nacho's were quite delicious.  staff was friendly, but then again, we were drunk.  will return.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-14", "description": "I've had the shrimp burrito here on a couple of occasions.  Definitely one of the better burrito joints in the neighborhood, but I prefer several different spots in the Mission.", "author": "Luke P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-19", "description": "I wanted to like it, because I wanted there to be a good burrito possibility for lunch breaks. And maybe it was just a bad day, but the woman at the counter was pretty indifferent/borderline-grumpy to me. Then there's that whole thing about dictating your ingredients ahead of time. No pointing at what you want... you need to be able to think ahead about what makes a good burrito, and speak those words to her. So I started naming a few things that I wanted, and she told me that no, I could only put three items on or it would be a Super Burrito. But the items I was saying were cillantro, onions and hot sauce... I didn't want cheese or sour cream or anything else super-esque. So I stuck with whatever three items I had said, and ended up with a completely mediocre burrito made with clearly sub-par meat to boot. I would have given them bonus points if I could have sat in one of the front window-view tables, but there were toddlers (the counter woman's?) playing with crayons on them. Yeah -- I understand issues about childcare and I'm not going to knock anybody for having to bring their kids to work occasionally -- but this is the review of a restaurant customer, and as such, I was disappointed that I'd have to sit in the back room if I wanted to eat at the restaurant. I will say that the decor was above par for a tenderloin restaurant, and the place did seem quite clean. My burrito was made fast, and the guy doing the cooking was the one employee there who was willing to smile at me. So because of those points, I'm giving it two stars -- and I might even go back one more time to make sure I haven't misjudged them. But it won't be in the immediate future.", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-07", "description": "i had a big old burrito.  it was pretty damn good... and cheap.  little heavy on the cheese, but forgivable.  the salsa bar was crucial.  the tortilla on my burrito was grilled and toasty and 100% pleasant.", "author": "Evan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-28", "description": "Fabulous Mexican food at the edge of the Tenderloin.  Friendly and happy folks behind the counter.  Super Veggie Taco was a full meal for under $3.  Chips and salsa were fresh and tasty.  The BEST horchata (rice milk drink) north of the border...check this place out!", "author": "claudia t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-28", "description": "On the recomendation of some good friends, I had visited here before, and I thought the food was good.  Today, I went in and ordered carne asada tacos, to go.  I asked the woman at the counter, in Spanish, that I only wanted carne asada  with a little bit of onions...that's it.  She nodded, she wrote the order down,  I paid for my order, and I waited.  She gave me my order, I thanked her, again in Spanish and went on my way.  I got home, and unwrapped my tacos only to find that the tacos were full of cilantro, and that the carne asada tasted like pork.  Pork, uh no!    I know I betray my race by not liking most pork, but that's just me.  Also, whatever meat that was seemed drenched...uh, marinated in a highly seasoned sauce, possibly to mask it's flavor.  Diced flank steak (a.k.a. carne asada), corn tortillas, a bit of guacamole are simple pleasures for me.  It's kinda hard to make an error on such a simple order.  Oh! well, I'll go again, at some point.", "author": "Carlos C."}
