{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "One GREAT Chinese restaurant near the Golden park! Me and my best friend were starving and I told my best friend that I don't want to go far just to eat and I asked him if he knows any restaurant that's nearby and I told him that i don't care what kind of food it is for I'm Type 2 diabetic and I didn't eat breakfast this morning so my blood sugar is coming down quick and i need something to eat now.\n\nHe said he knows this restaurant not far so he took me here we walked 2 blocks and dined here this afternoon. He told me that this is where he frequents because the food is good and they give you generous portions the way Chinese food is supposed to be served. We got in and were seated quickly as we were having a conversation about something. This joint was empty when we got in and I was paying close attention about the ambience of this place.\n\nIt's OK and a typical Chinese restaurant, brightly lit, the menus are easy to read and understand and there were menu items posted on the walls in both Chinese characters and English letters. Now mind you that in my experience as an veteran eater, whenever I go to a certain Chinese eating place and the are writings in their language, this means this joint is Legit specially if their local clientele are Chinese people too.\n\nWe were handed menus and I picked the beef w/ scrambled eggs and my friend picked the Mongolian beef and a big bowl of Wor Wonton soup. We waited about 10 minutes and we're still talking about the events of the day and our food came out and we started to eat. I told my friend that the food here is tasty and they give you a generous portion and he agreed.\n\nHe said he picked this restaurant not only because it's near his house but also the great taste of the food. We finished our meal and the tab came to $33.05 with tax and I added a tip so it all boiled down to almost $40.00 with the tip for 2 big main dishes + a big bowl of steamed rice + a big bowl of soup (We had to take some home because there was a lot of leftover soup) + 2 cans of soda....Not bad!\n\nWe enjoyed eating here and this wouldn't be the last time either. I usually eat in places like this then forget about it for awhile for I wanted to miss the restaurants I ate before and this place was no exception. A Jem of a restaurant if you happen to be near the Golden Gate park around Balboa street between 6th and 7th street. They accept cash and plastics here of every kind (Debit/Credit Cards). A highly recommended Chinese restaurant I might add.", "author": "Joel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "A friend suggested we have dinner here ending a long day of volunteering.  He told our group this was his favorite Chinese restaurant, and he frequented this restaurant quite often noting its proximity to his home and the restaurant's inexpensive menu.  That appeared to be the case when he led us into a crowded Emperor Palace Restaurant on Mother's Day weekend, and the waiter recognized him immediately offering our group of four to sit at a big banquet sized table.  The Emperor Palace sits on the 500 block of Balboa Street, a mostly residential block in San Francisco's Inner Richmond. \n\nPerusing the worn, sticky menus the first thing we noticed were the super cheap prices.  Together we shared three items, the Dry Fried Beef Chow Fun, the Chicken Pan Fried Noodle and the Rock Cod Filet in Black Bean Sauce Clay Pot (http://bit.ly/2zXiGvo).  The two noodle dishes were solid.  I didn't try the rock cod but my friends seemed to enjoy it.  Included was a carrot with Chinese root house soup and sweet, fresh orange slices for dessert both complimentary.  All in all it was a very good experience.\n\nFast forward about eight weeks later my friends invited me back for a celebration dinner of sorts.  The restaurant was far less crowded.  We were greeted with a pot of hot tea and brand new menus with increased menu prices across the board.  Sigh.  So much for cheap eats!!\n\nAfter some indecision on what we wanted to eat we finally put in an order with the friendly waiter.  Our choices would arrive rather quickly but first they served us their complimentary house soup which was again a carrot and Chinese root soup.  In the order of arrival were:\n\nSalt and Pepper Flounder Fish Filet (http://bit.ly/2Jzs1tc) - Wait!  We didn't order this.  These were fresh flounder filet pieces, battered, deep fried, salt and peppered and served with chopped jalapeno.  Tasty as it was we flagged down the waiter who took it and started to walk towards the kitchen when he was intercepted by a young lady who brought it back to our table and asked if we'd mind keeping the dish on the house.  No sense in wasting good food.  Thank you!  We accepted.\n\nPea Shoots sautéed in Garlic (http://bit.ly/2Nnu31N) - A non-menu item that I chose because I gotta have my veggies!  Delicious!  The pea shoots were vibrant and cooked to perfection with just the right amount of garlic.\n\nChicken Pan Fried Noodle (http://bit.ly/2Jzt0to) - My friend's favorite.  If it was the same as the one we had on my first visit then it was solid.  I picked off a few pieces of the tender bok choy but didn't have the chicken or the noodles.\n\nHoney Walnut Prawns (http://bit.ly/2LnfzSb) - Heavily mayo'd but okay by my standards.  I'm glad the walnuts were crunchy and fresh tasting.\n\nCrispy Chicken Half (http://bit.ly/2mqCzSb) - Very well executed the chicken meat was properly seasoned and moist while the chicken skin was nice and crispy.  Sadly, they served this with stale shrimp chips that tasted like they'd been fried in old oil and were left sitting out too long.\n\nSalt and Pepper Squids (http://bit.ly/2uL78Wr) - Similar to the flounder they served us by mistake but these were prepared flat pieces of calamari.  Despite not having any squid tentacles I enjoyed this as much as I did the flounder.\n\nRed Bean Soup (http://bit.ly/2JygwSL) - The traditional Chinese dessert was served complimentary.  A bit too sweet and runny, but it was free so I'm not complaining.\n\nOverall it was another very good meal, and my friends had plenty of leftovers to take home.  A 3.5 star experience for sure!", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Love the food! \nSimple and low key restaurant to eat delicious chines food! Would recommend. Yummy!!!", "author": "Mai X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "Great neighborhood restaurant, wish it was closer to me though. Whenever we're in the area, we try to stop by for lunch. Lots of tasty items to choose from, prices are really reasonable with big portions, what more could you ask for?", "author": "Gary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "The food here is really cheap and very tasty.  Like, it's really tasty.  The salt and pepper pork, especially, is delicious!  Flavor is ON point!  \n\nThere's zero ambiance, but that's okay, you're here for the food.  \n\nI would generally give a place like this five stars for the awesome food, but they need to do something about cleanliness.  I saw something while I was eating that I won't write about here, but it should not have been in a restaurant.  I'm taking off one star for that.  Emperor Palace folks, you should be better about cleanliness.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "So Good. Huge portion for take out! Just what we needed after a long week of work! wor wonton soup, eggplant short rib, pea sprout, and combo chow mein. these photos are AFTER two of us ate! Happy Bellies.", "author": "Jen O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "Hole in the wall Chinese restaurant with good food and insanely cheap prices. Believe me when I tell you, this is a true definition of a no frills type joint. You gotta wonder with the prices so low, wth are we eating?", "author": "Benny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-22", "description": "You want some good chinese food, this place is good. I ordered the minced beef with egg over rice for lunch and another time chicken chow fun with gravy. Taste is good. Had to order to go, I had no time to dine in. They are so nice here.", "author": "Jack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "This place is my family favorite Chinese restaurant. They have great prices, big portions, the foods are very good. The service is great and friendly. We will definitely be going back!", "author": "Lien C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-24", "description": "2 stars.\nif you live in the Inner Richmond on Cabrillo or Balboa, this is one of the closer options. One of the reasons our family still orders from this place from time to time (if our other neighborhood restaurant is closed or we're just lazy..)\n\nThe food used to be really good a few years back, but I don't know if the chef or ownership changed, it's definitely gone down in quality. Our meals from here have consistently been mediocre the past few times.\n\nOverall, the noodle/rice dishes lack flavor and sauce and are scant in the toppings.\nThe veggies are alright.\nHoney and walnut prawns are a SKIP. I don't know why but their mayo is way off (too thick and starchy!) and the shrimp is on the smaller side.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Our grateful thank yous to Yin (sp?) and Michael for being hands down the best servers in the Richmond District. The menu is extensive but they both come through with great suggestions to make our family dining experience top shelf. ALL dishes we've had are plentiful and delicious. It's like home cooking and Yin & Michael make us feel like we're eating at home (without having to do dishes). We heard about this little secret through word-of-mouth and I'd like to share Emperor Palace with you. Bon appetite!", "author": "Lizzie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Overall satisfied based on below dish ordered:\n\n- Crab meat and fish maw soup: This dish was delicious and the best out of all but there was barely any crab meat.\n- Seafood chow fun: Okay but lacked in flavors so had to add some soy sauce.\n- Salt and pepper smelt fish: Hit the spot!\n- Chinese broccoli with oyster sauce: Tasted as expected.\n- Sizzling platter oysters with ginger and scallion: Delicious and would order again!", "author": "Hello E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "First time here with the mister. Waitress was very nice, polite, great personality, smiley. Food was delicious and the most affordable pricing in SF. I cannot wait to come back! \n\nAmbiance - typical Chinese loud restaurant. Restrooms - :/", "author": "Margherita S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-11", "description": "Decent for the price \n\nSo far I have had the \n\nbeef chow fun : large portion of noodle, not much beef and not much flavor on the noodle. Even when ordered wet needs more flavor\n\nChicken with black bean : not much meat, flavor was ok, needed garlic and more veggies \n\nHad to add lots of hot pepper oil to both for some flavor kick \n\nWhen in a hurrry and in the area not to bad.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-14", "description": "I actually ordered from here on a regular basis. But tonight, my order came to $39.75 before taxes ($47 after taxes and tip). There's supposed to be free egg rolls for orders over $40. I rejected the 2 free sodas for orders over $30 and included a note to include the free egg roles. They gave us the 2 free sodas, which were immediately thrown away because we don't drink soda, and a note saying that we get free sodas for orders over $30. So for a quarter, they just lost our regular business. Too bad, but you can't be cheap when there are a million other halfway decent Chinese places from which to order.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "Im a regular here although i mostly get food to go i dont always check in. Staff is friendly. Food is good. They have the more original chinese dishes that you grow up eating. The restaurant....not the most esthetically pleasing with the live fish in the back and the notes all over the walls but the food is good. Always have my order within 15 mins even on a busy day.", "author": "Melissa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Great primarily Cantonese home dishes. Generous servings, good value. Fast delivery.  Low minimum delivery, $15. \n\nDishes tried:\nWalnut Honey Prawns\nSteamed Chicken with Ginger Sauce\nShrimp Fried Rice\nSalt and Pepper Pork Chops\nClams with Black Bean Sauce\n\nAll great.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "This is my go to spot for inexpensive and filling Chinese delivery. When your hungry and need some good ol clams with black bean sauce or fried rice, and don't want to leave your home, this is the place to call. The lighting for the restaurant is super bright, which is why I prefer takeout or delivery.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "We were here from out of town for a Doctors visit at UCSF and ordered food from here thru DoorDash. When we were finished we dumped the left over soup in the toilet and there was a COCKROACH in the soup. If there was one cockroach there is more. I wrote door dash for a refund and I am notifying the Health Department to do a Health Inspection. I hope we don't get SICK.", "author": "Joe O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "I ordered through Grubhub which offered free delivery for orders of 15$ or more. My order rang in at just under $15.20 so it was basically a $20.00 meal (with tip) that was more than enough to feed two people.\nIt came 30 minutes later, a whole 30 minutes sooner than the estimated arrival. Food was hot! I ordered walnut prawns and chicken fried rice. Both were not only very much edible and also pretty good.  I work at St. Mary's Hospital and I was very pleased to k now the delivery driver didn't get lost at all like most delivery people do. All in all I would order delivery again or even get take out since it's so close to my best friend's house who lives in the Sunset.", "author": "Vanessa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "We went here for Mother's day dinner, services are great! It might Not be fine dining but Must go authentic Cantonese restaurant! Price are great! We had $188 set dinner for 10ppl, and they gave us so much food!!! Definitely will go again!", "author": "Lori T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-15", "description": "Despite going to this place for years because of proximity, I must say their quality has gone down quite a lot recently. Just ordered some fried rice and pork with eggplant tonight, and both were covered (and well mixed) with wok scraps like pepper on white. It's not that hard to clean the wok before cooking the next dish is it? \n\nAlso, never NEVER come here or order takeout when it's crowded there, like other reviews claim, they take forever and you can imagine how much worse their quality would go down!", "author": "Allen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Went here with friends and everything was great! This is a Chinese restaurant serving typical Chinese food of very high quality and very reasonable price!! Highly recommend their Cantonese style lobster, crispy fried pumpkin with salted egg yolk, salt and pepper duck chin, steamed whole fish, and clams served with Cantonese spicy soy sauce! Very FRESH and TASTY! Definitely will come back!", "author": "Mordecai X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-21", "description": "Came here on a rainy weekend evening and the place was absolutely packed.  Had to hunt a bit for a parking space in the shopping center lot.  The obvious popularity of this place is certainly contrary to the early Yelp reviews for Emperor Palace.  \n\nOur party of ten had a very nice banquet meal, notwithstanding the fact that the banquet menu is not in English.  Service was fine even with the big crowd.  \n\nI came here when they opened for their dim sum.  Thought it was good too.  \n\nThis is a nice addition to the San Leandro dining scene.  I'd eat here again for sure.", "author": "Doctor G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-17", "description": "Cleanliness was what really brought this place down. There was stuff all over the floors, the mirrors were covered with specials printed on colored paper and taped up, I had floating things in my water, my chopsticks were dirty.. but the staff was nice which is a plus. The food was nothing to come back for either. The fried rice had no flavor, the noodles were dry and gross.", "author": "Liz J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "Been dining here for the last 14yrs (since we moved around the corner from the restaurant) and seen it go through a few changes. The restaurant staff has always treated my wife and I well from the first day we ate here... never an issue with service. \n\nThe food is very reasonable for the cheap prices... people have to remember they need to make a profit to stay in business. Some of our favorite dishes, I usually ask them for additional meats and vegetables and willing to pay their extra $1 or $2, well worth it... transform a good dish to great, like their salted fish chicken fried rice with extra salted fish. \n\nUnder their old owner when we first stated eating here, they had an 8 course family meal for $35 that knock your shoes off and easily feeds 8+ people... but that was 14yrs ago.\n\nTo this day, we try to either eat in or order take out once a week. I do agree with one thing from the other reviews, they could clean the floors better.", "author": "Kmaintl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "We used to live in the Richmond district many years ago and used to go here. My hubby and I were in the neighborhood and we decided to get something to eat. It was a Friday night about  8:30pm with no customers, but there were many take outs. The food was good with large portions and the price was extremely reasonable. Another time, we brought our son with us and he liked it. The woman server is nice and checked in with us a few times. Since it is located in a dense part of town, parking is bad. The restaurant is little run down but it is clean. We plan to come back again.", "author": "Janet W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-19", "description": "Very average all around. Nothing was bad, but the noodles were slightly underdone, the tofu was a tad bland, and the eggplant was a mix of underdone and just right. Also there was a constant breeze that made the food cool rapidly. Service was fine if a bit indifferent.", "author": "Kris F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Only a local who understands what \"Chinese Food\" means will understand and appreciate the value of Emperor Palace Restaurant.\n\nTo those who have suffered food poisoning, I am so sorry that you had such a painful experience.  However, there is something to be said about people who are more adventurous when it comes to food and have developed something called an \"iron stomach.\"  \n\nI LOVE Emperor Palace Restaurant for the following reasons:\n\n1.  Big Portions (because Chinese food is designed to be consumed in family style)\n2.  Quick (I have only done the pick-up option, and not delivery)\n3.  Tasty (as long as you order the non-Americanized dishes - quick find an Asian friend and get cultured!)\n4.  Takes credit cards\n\n My one con is probably the etiquette, but that's my little American-born \"first generation voice\" speaking up.  If you travel to Asia, and eat as the locals do, you will understand that customer service is a totally different concept.  Yes, I know we are in America and immigrants should do as we do here, but isn't this a country based on immigration?  Last I checked, this was a fact, although I can't speak for those that rely on Texas textbooks for a grounded truthful education.\n\nWith all that said, thanks Emperor Palace for being in existence in the Richmond neighborhood!", "author": "Elisha Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "Today for dinner, My family came to this very restaurant and the food there was extremely good, Its good for dinner service the waiter are pretty nice. Its good for kids. \nI very recommended this restaurant because the experience here was fabulous.\n\nFood:4.9/ 5\nDrink:(only if you like tea)\nDécor:( nothing so nice)\n\nI would come back soon.", "author": "Nq V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-06", "description": "I only ordered eggrolls because it took forever to get them.  The male waiter was on his phone and never looked up.  I heard the \"ting\" from the kitchen a few times and eventually the cook came out with my egg rolls.  I was planning on ordering a main dish but was ignored for about 75 minutes (luckily I was replying to work emails), never once did the waiter come to ask if I needed anything, not even water and I was the only one in the goddamn restaurant (a lady came afterward and was ignored as well) at the time.  I didn't say anything or gesture for the \"waiter\" because I shouldn't have to, it's their job.   Maybe my mistake was deciding to dine in or come during their lunch time because all they did was chow down and talk loud.  After they finished their long ass lunch, the \"waiter\" goes back to the booth and starts messing with his phone instead of asking the two people in the restaurant if we needed anything. Terrible!!", "author": "Zurc C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "This is my go to restaurant whenever I am out in the Richmond District.  I will always get take out and bring it home to the Peninsula since you can not find this kind of food at decent price!\n\nDishes that I order:\n- Salted fish and chicken fried rice\n- House special Hong Kong style noodles\n- Singapore style chow fun\n- Salt and pepper spare ribs\n- Peking spare ribs\n\nThe only downside to this place is parking.  Parking is horrendous.\n\nIf you want homestyle Chinese cooking, great portions and at a great price...this is the place for you.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-15", "description": "When I mention \"cheap place\" to my family, everyone knows which restaurant I'm referring to. The name of the restaurant sounds grand and upscale, but inside of the restaurant, not so much. There are only 2 people on the floor, sometimes I only see one who's the cashier and the waiter. Depends the day you are there, you might get some service. \n\nFood is decent for the price. Portions are big. It's great to have a place like this when you have a big group of people, and nobody feels like cooking. Standard and quick food in our neighborhood leaving us satisfied without making a huge dent in our wallet. My favorite is the singaporean rice noodles. When I'm there, I noticed they do quite a few take-out orders.\n\nParking sucks in this area, but bottomless rice!", "author": "Em T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "Emperor's Palace is my light in the dark and I'm not really sure what to do with myself now that they don't deliver to my neighborhood :( \n\nI've only ever ordered from them through Seamless and delivery takes about 45 minutes. They're always nice and food arrives pipping hot. I get the clams with black bean sauce EVERY TIME. Literally a box of fat steaming clams. Broccoli beef can be a hit or miss, but everything else is amazing. Oh, and the egg rolls are sweet, not savory. \n\nThey're definitely amazing for a good mix of Americanized and traditional Chinese food!", "author": "Lani C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-24", "description": "Made reservations for 10 on a week night.  Each person selected an entree so we had 10 dishes and it was too much food.  Portions are very generous.  Not really crowded but it was loud because it was the typical clientele of a Chinese restaurant with loud yelling talkers :) !  Restaurant was bright and cleanliness was okay.  Waitress was nice but not that attentive as empty dishes were left on the table forever?  Dishes were tasty and not too salty.  I'd have to say all 10 dishes were good and we would probably go back to this establishment.  Some items we ordered were Salted Egg Pork Hash (good), Salted Pork Chop (crispy), Salted Fish Tofu Clay Pot (delicious), Green Beans, Honey Walnut Prawn and Pork Belly....", "author": "Em D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "I ordered spicy pork chop, braised tofu, and Singapore style chow fun; they were big portions and tasty. I would order again. Delivery time prompt. Containers did not leaked. Will order again from them in the future.", "author": "annika k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "Great neighborhood Chinese restaurant. I often stop by on the way home from work to pick up a couple dishes when I'm lazy and don't feel like cooking dinner. Salt and Pepper pork chops is my favorite dish there. Huge portion for what you pay!\n\nIgnore the 1 star reviews. Can't trust someone that orders mu shu from a Chinese place anyhow.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-07", "description": "Ordered two plates for delivery less than two miles away. It took 90 minutes to get here. Food was okay, but not at all worth the wait. On top of this terrible service, there were no fortune cookies included in the bag. For as long as I waited, they should have thrown in some spring rolls or something. \n\nI will not be ordering from this place again.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "They have decent sized portions, for a really good price. Their BBQ Pork Chow Mein is amazing, so is there broccoli beef, and orange chicken. Their sesame chicken is kind of bland, but if you add shredded cheese on top of it, then it will taste pretty good!", "author": "Cristian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Barely ever see anyone eat here, but I always see people grabbing take-out. Their salt and pepper chicken wings are one of my favorite dishes here. Prices have seemed to go up over the last couple of years, but the food hasn't seemed to change. Still delicious and always looks good.", "author": "Courtney D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Overall, the food is good for Chinese takeout. Tasty and fresh and very reasonable prices. Delivery was fast.", "author": "Gale H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "Excellent sized portions, good quality ingredients. I used Grubhub.com to order from this establishment so I am only speaking to the delivery experience. \n\nThe driver was extremely nice and professional not to mention timely. They arrived 20-30 minutes faster than estimated and the food was hot and delicious. I would definitely use them again... \n\nI ordered the sweet and sour chicken, wor wonton soup and the house noodles. The protein portions were great and the selection that came with the house noodles was excellent. Highly recommend especially if you're looking to get some food delivered.", "author": "Brett H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-25", "description": "My parents love this place.  It's cheap, fast and close to home.  But for an ABC like me, I think I will only come here when my parents want to come here.  It's one of those places where I'd only feel comfy with my mom and dad who are fluent Chinese speakers from China.  That being said, I enjoyed the squab and veggies we ordered here.  I'm a huge fan of pea shoots and they cooked them right!  Nice and garlic-y.  The lobster noodles were also a hit!  And for a great price!  I don't remember exactly how much it was, but I believe it was a special that my parents asked about.  This place definitely has a whole in the wall feel, so be prepared!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "The prices are good and the portions are bigger than standard chinese restaurants near by.  Don't expect too much if you are picky about the food taste then it is a good daily convenient place for meals.", "author": "Wally L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "One of the better places to get basic delicious Chinese food in SF. I loved the Chinese beef & broccoli, the Walnut Prawns are a must, and the Chow Mien was also on point. One MAJOR plus for this restaurant-everything comes out piping hot (you know they just made it fresh for your table. Not a destination point but perfect if you have a craving you need to satisfy!", "author": "Sophia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "Make sure u ask for no msg. Place is good for family events. Dinner usually is busy. My fav is the steamed fish. Japanese tofu & seafood in clay pot (off menu) really good.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Just read the 1 star reviews. Nonsense. 3rd time eating there. Bomb dot com! Atmosphere was great. Waitstaff very welcoming. As far as good Chinese restaurant near your house goes, couldn't have hoped for better", "author": "Max D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-09", "description": "How come so many people gave this a bunch of stars?\n\nMe, ordered the Mongolian beef lunch special.\nHusband, ordered the black bean chicken.\n\nOnly one other couple dining, and they were finishing up. Still, took about 20 minutes for the waiter to take our order. Then another 10 for food to come. \n\nMongolian Beef: came with white onion, tender beef, green onion, and fried noodle garnish.... Oh, and a ton of MSG. Taste? Very enhanced, actually pretty good.\n\nBlack bean chicken. Came with more white onions, some black beans, some MSG,  a few bell pepper pieces, a lot of chicken (with cartilage.)  One word: No.\nHusband ate my food too.  That was fine- there was enough for two.\n\nRice:  good.\n\nBill: ten dollars.\n\nCheap, but I have an enhanced headache now.  Bummer.", "author": "El B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "Those of you that know me, know by now, how much I appreciate good, fresh, and reasonably priced food. I have posted many reviews of places around the bay, where you can eat well for not too much money. That's where my \"trademark\" \"$10 for lunch ya'll\" (mostly for yummy buffet food,) was born. When I reviewed a rare and outstanding \"$5 for lunch ya'll\" place in Daly City, complete with pics, I got messages from several of you telling me, \"looks great, I would like to go, but I live in Frisco, and with the time and gas to get down there, it ain't $5 anymore.\" Well, I've got good news for you. You don't have to drive all the way down to Daly City to enjoy one of my iconic \"only $5 for lunch ya'll\" places. There is one right in the middle of San Francisco, in the Richmond district, say hello to Emperor Palace. When you first walk in, you think hmmm, typical Cantonese. But you do see one notable fact immediately, and that's the fact that almost all the tables are filled with the usual \"good eaters\" and that means Cantonese contractors, house painters, and construction workers, s sign of good food and value. These folks know how and where to eat for lunch. The next thing you'll notice is the menu. (Selections and Price.) and you will immediately be surprised to see that most everything on the menu is ?? Yeah, you guessed it. \"$5.25 ya'll\". Impossible you say, with rents and expenses in SF? No, I'm not sh----n you! The whole noodle, fried rice, and rice plate section is $5.25! The Tomato Beef Chow Mein (fan ke au yok chow mein) was one of the best I ever had, and I love that dish! Order it all the time as my previous pics show haha. (perfect mix of protein, carb, and veggie. Tomato is not a veggie right? Well anyway....) and homeys crispy noodle house special (all ur leftover extra meats haha.,) was GOOD!! Both $5.25. We waddled outta there, \"Full, Dumb, and Happy.\" Sh--t, I know I'll never make \"elite\" eatin $5, payin $5, and reviewin $5 like this, but hey, I'm the real, no lie, voice of the common people. Somebody's gotta do it, n I do it cuz I love ya'll \"$5 bucks for lunch ya'll\" Aye ya ya ya hey, can't stop dancin. :)", "author": "George F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-23", "description": "If you enjoy food poisoning, and food that is clearly spoiled, you will love this place. Note to any food department or health official, probably not a bad idea to check on their refrigerator temps.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Authentic looking Chinese restaurant featuring full menu decently priced. We came for Sunday night dinner as a family of 2 adults and 2 children. Service was fast. Food was excellent and fresh. The restaurant is very clean and well taken care of including restrooms. We enjoyed our stay and will be back.", "author": "Ilya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "This restaurant's name is Emperor Palace?  My family and I have always referred to it as \"The Cafeteria.\"  As unanimously stated, you get a lot for very little at this place, so you could afford to eat here as often as one would a cafeteria.  And, many people do, such as Chinese carpenters during lunch, locals who go so often they never even have to place an order, as their food is served hot from the kitchen when they arrive.  I usually eat in here, but getting take-out is speedy, and portions equally large.\n\nThey serve complimentary soup and tong sui/tian tang like other Chinese restaurants, but I love the five-star anise flavored fried peanuts they give you while you're waiting for the rest of your party to arrive or deciding what to order.\n\nThe \"boss lady\" doesn't seem the most friendly, but overall, the staff is very accommodating.  This one server (I don't know what his name is - sorry!) who only works there one day a week (usually Sunday nights I think) is super friendly and good at what he does.\n\nTo be fair, there are a couple cons.  You don't exactly come here for the ambiance, but c'mon, the food is delicious and the leftovers will feed you for days.  I live within walking distance so this isn't a problem for me, but I know parking in this neighborhood SUCKS, so I highly recommend you avoid driving to this place if you can help it.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "I frequently order delivery from here.  This is your classic neighborhood Chinese comfort food with extremely generous portions, a great value.  You could feed a large family with the amount of food you receive.  Delivery is usually within a half hour and food is always nice and hot. They've got a nicely seasoned wok so their chow mein has great flavor.", "author": "Melanie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-30", "description": "I would give no stars if it was possible. My friend and I had a roach leg in the chow mien and piece of hair in the fried rice! DO NOT EAT HERE!! Unless your into eating bugs. You have been warned!", "author": "Paul Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "FOOD:\n1.) Chow Fun = yum sloppy wet sauce kind! big portion.. only $5! \n2.) Seafood Fried Rice = This is ok. More rice like. Not the kind of fried rice I would eat alone.\n3.) Chicken Brocoli = dude the chicken is really tender.. lol feels unhealthy but oh well it tastes good \n\n\nSERVICE:\nI've only ordered for pick up and I like how they line the clear take out box with foil as to keep the food hot. They're realllyyy rushed on the phone lol and they don't really understand or communicate in English very well. I wish they delivered. Yeah, I'm that lazy. Nay, I mean I'm that efficient. ;P\n\n\n\nATMOSPHERE:\nPlace is kinda not that great lol... carpeted floors, buncha round tables. Very barron at night time, but lunch time weekdays it's completely bustley. Really weird.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-04", "description": "I can only say that they were friendly and served a mildly flavored pork in a claypot, but other than that I cannot come back here. We ordered the orange chicken (the worst among all the dishes, it was kind of cold, watery and just plain sad), mongolian beef (the better dish, but the veggies tasted old), and everything else was forgettable. \n\nYou get what you pay for, so it was pretty cheap for dinner.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-01", "description": "The best thing I can say about this place is that I didn't get food poisoning.  Oh, and at least I wasn't wearing dry cleanable clothing so I can wash the smell out of my clothes.\n\nSomeone took me to this place and I'm seriously reconsidering even speaking to this person again.  I'm also reconsidering even being on Yelp seeing how many Elites gave this place 4 and 5 star reviews.  Seriously?  \n\nThe service wasn't just slow, but it was downright rude.  The waitress would purposely ignore people and avoid eye contact.  I saw it happen not only with our table, but also some older people next to us who were trying to get her attention after being completely neglected.\n\nThe food was totally unmemorable.  We had Mu Shu Shrimp and the wrappers were obviously out of a package (not made fresh) and the filling was mostly cabbage.  My friend ordered some other dish for us to share with fish, tofu, and mushroom.  Other than the textures, I couldn't tell one dish from the other.\n\nThis place is also dirty, dirty, dirty.  The plastic table tops are covered with a brown discoloring and the rice was served in a container with a huge crack down the side.  Every once in a while I got a sniff of something disgusting and finally figured out that it was the smell of rotting fish!  I don't know if it was the fish they were serving or something they hadn't cleaned, but it really turned my stomach.\n\nMy friend was pushing me to take leftovers and wouldn't take no for an answer, so I did and threw them into the garbage outside as soon as I got home.\n\nGag.", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "Great neighborhood joint. Nothing fancy. Just cheap eats. Decent quality for the price. Everything is fairly fresh. Like a hole in the wall with tables.  I would go for the popular stuff like chowmein and chow fun. You can be stuff at $10!  You get free peanuts as an appetizer. If you want service, forget about it. This is almost like a hole in the wall.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-17", "description": "Walked in at busy lunch with sis and friend with a deadline to get friend back to work on time. Place was packed and thought it was close to a miracle finding a parking spot for rental car just across the street! The place is a \"slum\" as compared to other places I've been to...  I thought many places I've been to in Kowloon and Hong Kong were even cleaner than this place. I cleaned the table myself and when the overworked waitress come out with bowls and things, she didn't complain at all! We ordered beforehand since we had limited time, and it took about 10mins for our food to be served: Sizzling Rice Soup with Shredded Pork (4.95) which was easily enough for six persons, and both Beef Pan Fried Noodles (4.50) and Chow Mein with Prawns (4.50) could've fed three to four persons. The food was tasty and hot, and CHEAP! Granted, even the table had embedded dirt on the glass but if hot good tasty food is your vice and you don't care too much for the appearance of the place, then this is your place!! I didn't see a bathroom - am sure one was available but considering the place, didn't even want to try seeing what the toilet would look like!! Street Parking only so you try your luck, but worth it. I am looking at the menu as I write this and almost all items are UNDER $10 and can eat more than three persons. All the fried rice dishes are priced between a lot of 4.25 and 7.95, and the steamed rice dishes are ALL priced at 4.71!! \n\nHours: 11am to 9:30pm  located between 6th and 7th avenues\n\nNOTE: The shrimp in their food is HUGE!!!!", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "Emperor Palace has consistently satisfied lazy Saturday afternoon Chinese takeout decisions for my family.\n\nOur most frequent orders, dry chow fun and wet chow fun with gravy, come in plentiful portions housed in spill-proof plastic containers (no more leaky styrofoam).  Unlike other Chinese restaurants that tend to skimp on the fillings, the beef, bok choy, and other veggies readily populate the noodles.  The ingredients always taste fresh, and the grease level is acceptable for everyday life and admirable for Chinese takeout.\n\nDue to the impressive quality of the chow funs, I will venture towards other menu options shortly!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-06", "description": "This place looks like a hole in the wall but the food is good! Just as good as any other chinese restaurant. As good as those big fancy places like Koi Palace. The portions are probably even bigger and CHEAPER. I'm a big fan because it's close to home, and this place has become part of my family memories! \nI recommend trying this place out if you are in the neighborhood! Minus a couple stars because it is a hole in the wall which means the place can be SUPER crammed. There was a  bee flying around that scared the crap out of me and that the food did not come instantly!", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "Chinese food thats cheap and decent. \nGot free soup, roasted peanuts and red bean dessert with our meal. 3 entrees for 23.00 not too shabby! We had the Prawns with Lobster sauce, Fried Rice and The beef and Tender greens chow fun which they list as Flat rice noodles. We opted to get the chow fun with sauce which was good. Fried rice was lacking a lot of flavor though, it needed more soy sauce and I don't care for peas in my fried rice--other than that, like I said, not too shabby for the price range.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "Salt & Pepper Squid is bland and even if you order spicy, it will only have a few tiny bits of jalapeno in it. It's deep fried and soggy.\nThe mustard greens with garlic is also bland and overcooked.\nWe ordered theSizzling Platter Medallion Beef with Black Pepper - it was not great either. They simply don't know how to cook good food.\n\nSizzling Platter Hunan Tofu - it was okay. Again the sauce is not tasty.", "author": "John J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "This is like going home, big, big portions. Loved the Peking pork chops. There's more meat than bones. I can always depend on them for my home cooked soup and sweet dessert red bean soup. Today was \"Lin Owl\" lotus roots. The service is always friendly. Today, we had the fried calamari-the thick meaty kind, no tentacles. They accommodate for diet restrictions, just ask them. Food comes out faster than you can eat them. This is my go to place for egg white, shrimp gravy chow fun. It's the best and very light and creamy.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-06", "description": "Not sure if this is the same one that used to be over in the Sunset District a long time ago? Ordered their Beef Pan Fried Hong Kong Noodles and a side of Chinese Broccoli. Actually, pretty good and big portions! Pleasantly surprised!", "author": "V. P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-11", "description": "I was around the area and checked on yelp for some chinese food for lunch. Found this place 3.5 stars which is about right. Prices are reasonable and big portions. I was going to order shrimp chowmein (which is only 4.50) but decided to get the rice plate (fish with tender greens). The dish was ok. \n\nWill definitely come back.  ;)", "author": "roderick s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "It's 4pm, and I am starving because I skipped lunch. I walk down Balboa in an attempt to go to Sushi Bistro to only find out that it doesn't open until 5pm. \n\nI wanted Chinese food, and the only two choices I had were: Melisa's or Emperor Palace. Obviously, Emperor Palace was in favor! (See prior review for Melisa's)\n\nEmperor Palace isn't the nicest place on the outside, or inside for that matter. It's not decorative at all, and everything seems to be really outdated and dull-looking. The restaurant always seem to be vacant. There was only one other party eating when we came in. However, the menu took me by surprise. Every dish is $5-$10! Everything on the menu sounded delicious, too. (But that's probably because I was starving by this time)\n\nI went with a friend, and we ordered Shrimp Stir Fried Noodles and Tofu and Salted Fish Clay Plot. We also had rice on the side. The order came pretty quick, and the server was really friendly. Both dishes smelled so good the moment the server brought it to our table. The food tasted like a HOME-COOKED Chinese meal. It's a little rare for me to find that home-cooked quality taste in restaurants these days. The flavors weren't over the top, and the grease and oil that you would normally get in Chinese food was to a minimum. The bill came to $13.70. Two people for under $15! Need I say more?", "author": "Linda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "The food was good and really inexpensive. We paid 30$ for a three person meal and found that we had way over ordered. We ended up taking the majority home. My parents really enjoyed the wonton soup which came out with big pieces of meat and seafood in it and was enough for 6 people. \n\nThe food comes out quickly too. We barely waited more than a few minutes. Check it out. The price is right in a city of very expensive food!", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "This place serves up some Awesome chinese food!\n\nit may not be the best looking one or the cleanest looking either, but their chinese food is one of the best. They carry the freshest shrimp and fish that any chinese family or any family in general can ask for.\n\nas for prices, they're moderate especially compared to other places in the Richmond. The only downer is that parking sucks. \n\nI'd def. recommend coming here for dinner.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-26", "description": "The food here was really cheap.  i had an order of chow mein.  It was kinda greasy, but filled me up.  i ate half of my order  for dinner, then ate the other half as a late night snack.  good place to eat if you short on money, but I think there are better quality restaurants in the area.  I guess if I was broke this would be my go-to place.  Can't say much about the other food because I only ordered 1 dish from here.", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-15", "description": "Went here recently, i'm upping the stars to 4.   Very Good sea food  Sweeeeeet crab, fresh sweet fish,steamy rice,  veggies are good, salt n' pepper shrimps are tastey. Good sized portions. Always quality food. No crowds if you get here at 5pm.\nDecor: fine.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "The service was a little slow. The food was average Chinese food, but it was so cheap and affordable! I would recommend this restaurant for people who are on a budget, and still like the luxury of eating out.", "author": "Kathy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-30", "description": "We ate here recently and ordered the beef tendon clay pot.  The beef tendon was suspiciously undercooked (it was red!).  I don't know how you can under cook meat in a clay pot!  When we told the manager, the said, \"Oh it's suppose to be like that!  It's New Zealand beef tendon.\"  Well, how do I know if that's true?  You got a return address stamped on that piece of beef somewhere?\n\nHe didn't apologize or offer to replace our dish.  Thanks a lot moron.  You just lost my business.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-15", "description": "I went to this spot several times with worse and worse results. Yes, the prices are ridiculously low - but the decor and service are awful!!\n\nThe staff is rude, they always forget some portion of your order, and it smells of decomposing fish as soon as you walk in the front door.\n\nI've had my fill of this place and wouldn't recommend it to my worse enemy...", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-31", "description": "I am writing this as a reminder for myself not to return again. \nYes, food is cheap and quick but please yelper.. walk a few blocks more to Clement street and you will have better choices. \nThere are reasons why I stop ordering to go here - and silly me, I forgot and ordered from there again yesterday. Big mistake - got seafood pan fried noodles and man I was disappointed. When I went home and opened the box, it's more noodles than the actual meat - few pieces of fish, calamari and 2 small shrimps. It smell kinda funky too.. but I ate it anyways. Can't be that picky when you're starving. Plus I have a strong stomach, so the worst case scenario will just be spending more time in the bathroom..\nAlso, I ordered a few more items before - they are ok. The one thing that I couldn't forget is one of their vegetable with mushroom dish - the mushroom tasted foul, sour; just completely off....... \nSo yes, I am not returning to the restaurant. Would rather have cereal for dinner than eating food from there again.", "author": "Doris H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "I really try to like this little small establishment! But the rude owner or chef and the greasy food which gave me 4 hrs of stomach ulcers and pain told me to stay away like the plague. I was tempted by the 2 lobsters for $20 deal. But the lobsters turn out to be really small like a giant crawfish instead. It was cooked and steam perfectly right like any Chinese restaurant would do. Lots of ginger, scallions, and cornstarch. I think what make me sick was the combine grease from the lobsters and the complimentary soup. But the final blow in the coffin is the rude owner which snatch the condiments from my table without saying sorry or excuse me. He even brush his hand into one of my dish that I was eating. It was just so disgusting and unprofessional. I feel like complaining, but I know it is a waste of time to complained in any Chinese restaurant establishment! It is a sad fact that will never change!", "author": "Cam T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-24", "description": "They follow instructions... but that's about all I can say.  Food was really bad.  No taste and when there was taste it was bitter and seemed spoiled.  Only reason why they even get one star is because they follow delivery instructions.  Other than that... disgusting. Plus we got sick afterwards. Never again!", "author": "D G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "In terms of really good cheap-eats, this is the place. To preface, I love chinese food, dim-sum, salty fish, chicken's feet, pork cheeks, sea cucumber, jellyfish, and anything that crawls.\n\nThis is authentic chinese cuisine at an affordable price - for 20 bucks you can easily feed a family of four or have leftovers for 2-3 days for two people.\n\nNow eating at the resto is an option, but this is really a take-out place. Ambiance is sub-par to say the least.\n\nchicken with tender greens (i.e. bok choy), yang chow fried rice, singapore chow fun, and many many more excellent dishes\n\ndef a gem", "author": "Jerome, Jerome T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "my grandma took me here to order takeout for one of our huge family dinners. first off, the chow fun is about $4.50 !!! (just remember it being cheaper than a subway sandwich!) AND it is literally a mountain of food!!! as i was waiting for our takeout food to be ready, i heard comments like \"omg this chow fun is sooooo good!!!\" and \"omg theres so much food!\". i think the main reason why there are big portions that taste good is because the owner is also the cook! \n\nwe ordered the spareribs, fish and vegetables and chicken and they were all so good and fresh. he even got it ready for us under 20 minutes and we came out with three huge party trays of food for $50 dollars. what a deal!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "It's a great start when all the signs are in Chinese.  Very accommodating to special requests.", "author": "Henry M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-30", "description": "Everyone seems to be up on this place because it is cheap. I tried it out because I moved to the neighborhood and I was hoping I would find some good chinese.\n\nMaybe it was just what I got - orange chicken and mongolian beef - but it was atrocious. Never again.", "author": "Car C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-21", "description": "Even though they raised the price significantly recently, it's still one of the best lunch deal in town - what can u say to a fresh steamed fish dish w/ complementary rice (a whole box) & soup (a large bowl) for $4.75 only (used to be $3.99)?  ^_^", "author": "Bkwm J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-10", "description": "It's a local Chinese restaurant close by. Food isn't the greatest, but it hits the spot when you're too tired to cook. I like that it's cheap as well. \n\nThe salt and pepper [insert chicken wings, pork chops, tofu, etc] are pretty standard. Braised tofu with mushrooms is greasy, but yet, really great over plain white rice.", "author": "Kanara T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "$36 for 9 course dinner. No, not per person. It's $36 for 9 courses, period. You can split with however many people you want. My friend K has done this with 8 people and still had leftovers. I think there are restrictions on the special pricing. I thought K said it was weekdays only but considering we came here on a Sunday night, I was wrong. At 7pm on a Sunday night, we were seated right away.\n\nThe dishes are served when they're ready, which is quickly. They don't wait for you to finish one course then bring out the next. K says if there's only 2 diners, they seat you at the smaller square tables and just stack up the dishes. With 4 of us, we sat at a larger round table. \n\nIf you want rice, you'll need to order it ($1/person). K says the menu varies sometimes. Our 9 courses were as follows:\n-soup: a seafood soup. My friends were excited that there's real crab in it. I didn't notice this...which may explain why I didn't think much of it.\n-ginger beef: ok. this was to replace the oysters dish they were out of.\n-calamari and broccoli dish: my favorite. it's a white sauce.\n-Chinese green vegetable: maybe bok choy? \n-Mixed vegetable dish: maybe bok choy too? also had shiitake mushrooms, tofu, carrots.\n-fried pork cutlets: pretty good but salty\n-fried chicken: ok. and it came with shrimp chips, yummy.\n-fried fish: not the delicious ones for banquets, but decent. lightly breaded. \nplus dessert: a red bean/sago Chinese dessert. ok, not that sweet or flavorful.\n\nOverall, the food is average and can be a bit greasy or salty. I didn't taste the grease but considering how much each vegetable dish glistened, it's greasy. Also note how many dishes were fried.  But it's cheap and quick.", "author": "Yan E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "The Mongolian Beef was very good with a little kick from the hot peppers they added to spice it up. The Cashew Chicken was just OK. We ordered take-out so can not comment on the service level.", "author": "Jim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "My go to hole in the wall Chinese spot. Would love to order some of their specials (they are written all over the place), but I don't read Chinese and there is a language barrier. Good food at a reasonable price.", "author": "Jeremy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "What a huuuuge difference it makes to eat in house rather than simply pick up take out!! I enjoyed complimentary hot tea, pork and greens soup, and adzuki bean dessert! I was shocked that I received such A+ service when my first comment was to request a substitution... usually restaurants don't like substitutions but they were more than happy to serve me tofu in the chicken curry rice plate. It was low on vegetables (2 carrot slices) but it was so delicious I didn't really mind. Big portions and good price! I am a fan :)", "author": "Libra J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "great prices at lunch time,get the rice plates,big portions,cheap,food is some of the best in san francisco,full of chinease at lunch which is a good sign,you might find the place dirty,could do with refurbishment,it would get 5 stars apart from dirt\nbut dont let that put you off,good food cheap,if your in the area try it out\n\nsome lunch times its full,sometimes empty,", "author": "cc c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "On a cold rainy day I ventured out in the rain on my lunch break only to stumble in to the Emperor Palace Restaurant. I didn't rally know what to expect but the prices were cheap so I figured why not give it a try.\n\nThe minute I sat down they brought me a huge bowl of their house soup which was great and almost instantly warmed me up. I ended up ordering something really simple (chicken chow fun w/gravy) and when it came the order was HUGE! I ended up eating about half of it and did not eat for the rest of the entire day. \n\nThey can now consider me a regular because I will definitely be back for more.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-12", "description": "OMG i don't even know how I'm able to type right now! I'm beyond full!  That food was ridiculous...in a good way.  I can't remember the last time we paid $21.50 (before tax) for soup and 4 other dishes!  They weren't skimpy on the portions either...NOT AT ALL!\n\nIt was mine and my boyfriend's first time there.  We got a little overwhelmed looking at the menu so we went with the prix fixe dinner.  They have different set dinners varying in price and number of dishes.  We went with the \"Economy Special\".  So, for $21.50, we got:\n\n-Soup of the day\n-Ribs (more like thinly sliced pork chops) with sour and spicy sauce\n-Salt and pepper shrimp (whole.  head and all. YAY for me! :D)\n-Half a ginger and scallion chicken (they ran out of whatever was on the menu)\n-Mustard greens with garlic sauce\n\nEverything was pretty tasty.  Those \"ribs\" were by far my favorite.  The place is VERY casual so don't go expecting a gourmet setting.  It might appear to be on the dirty side, but whatever!\n\nWe went hungry, we ate like gluttons, and came home with enough leftovers for 2 days!  \n\nThis place is perfect for nights when I don't feel like cooking.  I'll definitely be back!", "author": "Sally T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-16", "description": "I'm about to throw a half order of kung pao chicken and a half order of lemon chicken into the compost. That, more or less, describes this place. The hot and sour soup, however, is good. I'd go back again for just soup, but that's weird. Sooo...if anyone knows a bum that likes shit chinese food, direct him to my compost bin.", "author": "Aaron Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-07", "description": "I have dined here a few times before, and had my son's 1st birthday catered by this place. I don't remember what I've ordered in the past, but tonight how will I ever forget what we ordered. Price-wise, this place is very good. \n\nI never really had a complaint until tonight. The family and I came by after the kids' doctor appointment and since we've had a good experience here before, we thought it would be a good choice since we were pretty hungry and I wasn't in the mood to try anything unfamiliar.\n\nWhy I never noticed it before, but when I walked in today, the place smelled like an old closet. No one else was eating there except a take-out customer was waiting, it was about 5:30, so probably local diners weren't home yet for dinner time. A couple of more take-out customers came in and out as we waited for our orders of broccoli beef, orange chicken and pot stickers.\n\nThe pot stickers weren't the first time I've had it but today it tasted like a burrito from Taco Bell. The broccoli beef was OK. But our biggest issue was with the orange chicken. It was all fat and skin! We tried to bring it to the attention of the only employee there (usually there would be a staff of waiters when I've eaten there). He claimed to have cooked it himself and it was all dark meat. My husband tried to reason it out: even cut it open, invited him to eat it and really admit it was what it was, and made it clear we weren't buying his claims. \n\nYes sure, we eat out and not really know what we eat but it was pretty OBVIOUS this wasn't chicken meat. I've had it better at Panda Express!  Before my husband even pointed out how there was no meat in the plate, I was already separating the pieces off my plate that didn't appear to have meat. And the little I got to eat was clearly all just  crunchy with fried starch and no meat.\n\nToo bad. One bad experience puts this restaurant off our list. There are many more in the area that we can go to next time.", "author": "Anio D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-13", "description": "I frquent here often for Chinese take-out.  Good price.  Sometimes hit-and-miss with the food here.  \n\nThe hits are spicy salted pork spareribs/chicken wings, honey walnut pawns, sweet and sour chicken, house pan fried noodle, and westlake beef soup.  The misses - lemon chicken (where's the chicken?) and mongolian beef (not enough beef, too much filling like onions).", "author": "Mick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "This is me and my fam's go to place whenever I trek home to the Richmond.  Easy on the wallet, and the portions could last you for days.\n\n+ fried chicken wings.  You get 14 in a dish, and all the minced garlic in the world.\n+ drunken clams.  Remember to drink the soup, or soak your rice in it.\n+ never having to wait.\n+ free soup and dessert.\n\n- taro.  Never, ever get their taro.  I warned you.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "The Won Ton Soup is the #1 reason I will be going back to Emperor Palace Restaurant every trip to San Francisco. I think about how good it was each time I eat Chinese food.  The dish we ordered was fantastic as well.  The service was horrible-  when we walked in the two of us gravitated towards a two top table (one of two open tables in the place).  The waiter nearly had a melt down and ushered us to the adjacent table??  Upon ordering he almost blew a gasket when didn't know exactly what we wanted in 10 seconds!  The food was cheap, fast, and the BEST!", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "Really it's the age old question. Would you rather have a lot of ok food or a little bit of really good food. (Pizza by Alfredos or Alfredo's Pizzaria). I droppped by here with my roommates who usually judge a restaurant's quality by the amount of food they give you.\n\nThis place was cheap for sure and by no means is the food outstanding, but I was impressed by the quality of what what they served for the price. It's a true bargain.\n\nGreasy, salty? Definitely\n\nTo sum it up, the Emperor hits the spot when you're super hungry/not looking to spend a lot of money.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-13", "description": "your average Chinese restaurant with dirty bathrooms and cheap food\n\njelly fish meat platter\nthe sweet and sour roots tasted funny. Jelly fish, pork sausage and beef muscle was on par. Tomatoes on the side added to the presentation.\n\nseafood soup\nreal lobster with squid and shrimp. Decent and my second favorite soup next to shark fin. recommended\n\nfried quail\nfried to perfection. recommended\n\nwalnut shrimp\nthe shrimp was a little soggy and the walnuts were stale. Avoid\n\nblack pepper beef short ribs\ngood blend of onions and bell peppers for flavor and the portions were very generous. recommended\n\nsauteed seafood vegetable \nsquid, scallops, shrimp with broccoli and carrots. Average \n\nFried flounder with yellow chives over mustard greens \nThe fried fish was already cut and mixed well with the canned mushrooms and yellow chives. Mustard greens added a bitter taste.\n\nyang chow fried rice\npretty standard bbq pork and shrimp fried rice\n\nsteamed garlic, onion crab\nthe presentation was good as the crab pieces and garlic and onions were strategically placed.\n\nOverall a very typical Chinese restaurant. Nothing too amazing, but nothing horrible", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "WTF!!!  Was the Combo Meal Deal we got really only $36.95????  Why Yes, it really was.  Dish after dish came out and I was like this can't be happening.  When the dust settled, there was a large bowl of soup enough for at least 10 people and 8 dishes and complimentary dessert.  \n\nI've seen some meal deals before where they might sell 3 dishes for $15 but most of those deals, the dishes are really small and might be just enough for 2 to 3 people if lucky.  At this place, ALL of the dishes were FULL SIZE!  \n\nI'm still perplexed by what happened but after the bill came out, it really, really was a Super Deal.  \n\nThis place is not the cleanest but the food was actually pretty good and the value, I don't think I've seen another place give as much food for as little a price as this place.  \n\nAlert to Starving College Students, this is YOUR Place....  I guess the nearest college is USF so I think someone needs to start passing some menus over to the dorms on campus...", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-04", "description": "If you know how to order and what to order, this place worths the money.  The dishes are mostly the cheapest amongst all the Chinese restaurants within the few blocks.  Go there early during Friday night and weekend then you can avoid the long waiting line.  In weekday afternoons, the restaurant offers a wide range of discounted sets and you can see all kind of people sitting inside there, mostly plumbers, journeymen and construction workers.\n\nI would recommend steamed oysters with black bean sauce, fried rice with chicken and salty fish, spinach with salty eggs and marinated eggs, crispy chicken.....I can actually list a lot.  Since I prefer dishes not too salty, I would always ask for all dishes without msg.  \n\nReservation is highly recommended if you want to dine there during feastive days such as Chinese New Year, Mother's Day, Father's Day.", "author": "Roserrele W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-24", "description": "This is probably my favorite place to get take out, but it's really good to eat in also. Very cheap food with HUGE, and I mean HUGE portions. Plus the food is really good. They're a bit non-responsive if you don't speak Chinese (damn my ABCness), but really...who the f cares when they serve good food with good portions for cheap. \n\nBest Tomato Beef Chow Fun I've ever had. This is personal taste though and I love how they stuff the to-go box with it. The salt and pepper pork is good, the walnut prawns is good, I haven't had one bad thing here. The only thing I wish they did was deliver. But this place is frickin awesome", "author": "Calvin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-09", "description": "4.25 stars. =D\r\n\r\nI love this place. It's funny, the dirty, hole-in-the wall Chinese restaurants are always the best.\r\n\r\nMore specifically, this is a Cantonese restaurant so don't order the generic lemon chicken, sweet and sour, broccoli beef stuff which is normally catered to the non-Chinese. \r\n\r\nGreat things to order:\r\n\r\n- Beef chow fun (It's only something ridiculous like $3.75, they ran out yesterday! Popular item on the menu)\r\n- Seafood Pan-fried noodles, Hong Kong style (Haishien jian mien)\r\n- Clams with black bean sauce\r\n- Sauteed fish (black cod, I believe) with bok choy\r\n- Seafood soup (sorry I don't know the real name to this, it's sort of thick with chunks of seafood in it and is white).\r\n\r\nEverything above was delicious and full of flavor. Total bill was $21. Ummm, I wish we had cheap, yummy, Cantonese restaurants like this in the South Bay. Like Bert stated, mostly Chinese people eat here so you know it's good.", "author": "Ta G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Chinese fajitas!!!! (get the scallop and prawns sizzle platter!) I get picky about scallops- here my only complaint was that there wasn't more.\n\nSoup was bland but included- the hot pot of rice was wonderful - actually hot, sticky, just like mom used to make if your mom was Chinese instead of Swedish like mine. We ended up here because the place we were going to go had moved. Inexpensive, good eggplant with garlic sauce (although nobody told the seafood only lamest version there is of vegetarian that there was pork in it ahead of time and I think part of this little piggy went into this little tummy accidentally. Not.cool.) \n\nThe mustard greens are not date food- unless trying to wield large pieces of slippery greens with chopsticks are a turn on for you- it's SF, who knows? \n\nThe kung pao shrimp were, in the words of IR man (finding panini and coffee for damsels in distress since 2008), \"more kung than pao\" but were still tasty-and anytime I can eat peanuts with chopsticks I'm happy.\n\nDefinitely going back. next time for dinner and crab and pineapple fried rice. Luckily the menu will take a long time to work through--even without more piggies.", "author": "Keri B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-20", "description": "My boyfriend and I LOVE this place. His parents always drag us off to eat there when they come visit from the North Bay. Sometimes we kid that his Dad really isn't interesting in seeing us but interested in the food. It's that good.\n\nMy favorites are the fish man soup (yes, fish man! What is that? Aquaman chopped up?) and shrimp fried rice. The dishes are always heaping, hot, and served quickly. And you can't beat the price. I just wish they delivered.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "A just-killed whole steamed sea bass, weighing in at 1.6 lb. was $19, a fraction of what restaurants ordinarily charge.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-30", "description": "Meh, it was okay... \nThe food isn't all that good as left overs.", "author": "Allie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-04", "description": "We were looking for an inexpensive meal before going to the de Young, and stumbled into this place.  All the specials were in Chinese, as was a large portion of the menu; we were the only white people in a sea of Chinese and the waitress brought us forks as soon as we sat down (even though we didn't ask, and refused to use them on principle).  All the mirrors made me a little dizzy, but the wall-o-live-seafood in the back was a nice touch.  The soup was thin, but the entrees we ordered (mu shoo chicken and broccoli beef-- we played it safe) were both generously portioned and delicious.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Ever since Ocean Restaurant closed down on Clement, there hasn't been a lot of Chinese restaurants I like to go out to. Being Chinese myself, I eat Chinese food every night at home with my parents. My mom is a excellent cook so when I go out for Chinese, I better get my socks rocked. \n\nMy parents started coming here when Ocean closed down. They said the food was good and I recently moved back from LA so I wasn't sure what was good anymore. \n\nThe only thing holding me back from that extra star is the consistentcy. The curry beef stew is the best beef stew that I have ever had in my life. The curry sauce is addicting and will have you eating so much rice you will end up with diabetes. The beef stew is so tender, its falls apart in your mouth. One time though, the tendons that end up in the stew was not so tender and soft. \n\nThe sticky rice is only 5 bucks and it the best sticky rice ever. Many times sticky rice gets too sticky or eating just a little can cause you to feel incredibly full. Not so with their version of sticky rice. It is the perfect balance between flavor and texture. \n\nThe chicken wings are incredible. The sauce is crazy good. I like it over the San Tung wings now but its a different flavor. The wings don't taste dried up or overly deep fried. \n\nThe beef stew incident was the only thing that prevents me from giving it all 5. But this is definitely the place to go for some Chinese in the Richmond nowadays. \n\nWord of caution. Parking sucks.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "If you like Chinese food this is the place to go. This place the prices are so inexpensive and the portions are very generous. You will always have leftovers to go home with you. Favorite things to order are:\n\nHong Kong style chow mein  (skinny noodles) bbq. with chinese broccoli or any meat you like\nChow fun without gravy  and add what ever meat you like with veggies\nSalt & pepper chicken wings\nSalt & pepper pork chops\nrock cod with braised tofu in clay pot\nsalted fish with chicken fried rice\nsalt and pepper shrimp\ncurry tomato beef chow mein or crispy noodles\nsalted fish with tofu in clay pot\nshrimp or bbq. pork egg foo young  with gravy  (got to try it)\nsalt & pepper string beans\ngot to try the quails  3 of the for $5.00\nspicy eggplant\nsalt & pepper duck tongue  (sounds gross but tasty)\nsticky rice with chinese sausage (naw mai fawn)\nlotus root with chinese sausage and preserved duck\n\n\nThey also have dinner specials or set menus from $21.50 to $225.00.  I think for 5 to 6 people you can order the 36.95 set menu. Check out what you get with this dinner:\n1.crab meat w/fish mall soup\n2. black bean sauce oysters in shell (6)\n3. spicy salted spareribs with bone\n4. crab with green onion & ginger\n5. 1/2 crispy fried chicken\n6. calamari with tender greens\n7. braised tofu with tender greens\n8. deep fried flounder\n9. mustard greens in a garlic sauce\n10. red bean or some kind of tapioca for dessert", "author": "Steve w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-29", "description": "Tasty chinese food and not overly greased up.  Large portions of every dish.  They dont need MSG to make it good.  The $36 dinner plan is soooo worth it.  Impressed.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "I've been here a couple times and I haven't had any serious complaints. As many yelpers have already noted, they do have a $38 (or was it $36?) family meal that comes with about 9 dishes, that's hard to beat. However, as some have said, they did not have oysters the most recent time I came to this place and the waitress told us that it will be replaced with a beef dish. I'm generally not big on beef dishes so I had to substituted with Honey Walnut Shrimp but she told us that it's $4 to substitute it. But seeing as how the meal was only 40 or so anyway, I decided to let it slide. It did bug me to know that they charged $4 for it so I compared the oysters' price to the Honey Walnut Shrimp and it was a $1 difference so I found it a bit absurd that not only did they not have oysters but charged me more than they should for the substitution.\n\nThe service was also unsatisfactory as, again, what many others have said. However, it was on a holiday and she was working ALL the tables by herself and it was nearly a full house. Yes, this included taking orders, serving, answering phone orders, making sure everyone had tea, etc. I can't blame her for being frazzled and unable to treat us nicely (giving her the benefit of the doubt).\n\nThe food did come out very quickly though and the food was pretty good. I do have to take a star off for overcharging for the substitution though. All things considered though, I probably would come back simply for the food and price.\n\nAlthough not directly related to this restaurant, parking is a batch to find here. We ended up having to park 4-5 blocks away. If you live nearby, I recommend take-out instead.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "We had great take out food from this restaurant over the weekend.   We found the following to be especially tasty.\n* Salt and pepper short ribs\n* Spicy Eggplant\n* Fried Chicken Wings (taste has changed over the last few months, but these are still really good.  Not like San Tung's, but I can't quite place the sauce)\nWe always order take out and it seems that they have a good volume of take out orders.  Parking is really tough in this area during dinner, which may explain why many choose take out.  The food is fresh and hot, the service is fast and friendly.  The restaurant is clean and the prices are excellent.", "author": "Antonio E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-04", "description": "This was my go to place when I lived in the Richmond District for 8 years.  I mostly got the same dishes and it got to a point where they recognize my voice over the phone.  As other have said, huge portions at a cheap price.  I also didn't have to worry about parking since I lived close by but I haven't been back there in 5 years.  Nice to see they are still a place to go to.", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "I love this place!!! It certainly is nothing fancy but for a few bucks you can get a super delicious sit-down chinese meal. I took a friend here from out of town and he swore it was the best orange chicken he had ever had. The place is always fully crowded with a large groups of Asian families speaking Chinese (which is usually a good sign that the food is good.) It's all about the price as well. Usually for about 10$ I can get enough food for a couple of days, The service is super friendly and overall the place is just a nice little establishment! The only reason I deducted a star was because they don't deliver.", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-24", "description": "i like this place a lot. I went here with a pretty big group of friends and we ate our hearts out for only $11 per person without limiting ourselves on the menu. We were seated upstairs in what felt like our own vip section because it's away from the rest of the action and we were the only ones there so that was pretty cool. The same held true the second time we went and sat upstairs with the exception of a group of old guys celebrating a some sort of occasion with their own costco sized hennessy they had brought in and the staff seemed totally okay with it. How cool is that -- good food and a pseudo VIP area to enjoy!", "author": "Henry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-17", "description": "this is much better compare to king sing restaurant from across the street although king sing is not a competition at all. \nthis place is always packed with construction chinese people. good service i go there all the time when im lazy. price is also cheap. food is good. what else more?", "author": "Jerome J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-07", "description": "Was delighted at first but after several visits it became horrible ...\nOrdered the same steam catfish but overcharge later on ...\nBeware on charges ... TIP amount was  changed .... added a few $ more", "author": "Charles J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-23", "description": "Food here is cheap, portions are huge, and great. They can sometimes use to much oil, but that's usually when it's super busy, so it's understandable. Staff can be rude just like any other regular chinese resturant. O yeah good luck finding parking.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-25", "description": "i ABS0LUTELY *L0VE* THiS PLACE!  i`VE BEEN C0MiNG HERE F0R YEARS.   i LiVE 0NLY A BL0CK AWAY FR0M HERE, S0 iT`S REALLY C0NViENENT F0R ME :]  ALL i D0 iS CALL iN T0 0RDER TAKE 0UT, WAiT 1O MiNUTES, LEASH MY D0G && WE TAKE A NiCE STR0LL D0WN THE BL0CK [WiTH MUCH MARKiNG 0F TERRiT0RY 0N TELEPH0NE P0LES FR0M SHAD0W LoLx] T0 PiCK UP MY F00D. ;]  \n\nTHE STAFF iSN`T 0VERLY FRiENDLY, BUT SiNCE i`VE BEEN C0MiNG HERE F0R S0 L0NG, THEY ALWAYS GREET ME && ASK H0W i`VE BEEN, THEN GiVE SHAD0W A PAT 0N THE HEAD HEHE ^_^\"  THEY ALS0 H00K UP THE F00D S0METiME && KN0CK 0FF A C0UPLE D0LLARS iF i MAKE AN 0RDER 0VER $1O!\n\nTHEY MAKE THE BESTERESTEST GEEN MEiN [HK STYLE FRiED N00DLES WiTH GRAVY] HERE T00!!  iT SERi0USLY iS *THE BEST*!  THiS iS THE 0NLY PLACE i`LL 0RDER iT FR0M N0W.  THEiR CH0W FUN iS REALLY G00D AS WELL...&& THEiR HAM YU GAi NUP CH0W FAN [SALTY FiSH && CHiCKEN FRiED RiCE]  iS SUPER YUMMiE!!", "author": "Dee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "Big portions for a very cheap price! By far, this is the cheapest Chinese restaurant that I've been too. Plus, it's very close by from where I live. Who could beat a big plate of chicken fried rice for less than $5?\n\nAnd when I mean big, it literally takes two people to finish it!", "author": "A R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-03", "description": "I brought my kids in after seeing a lot of good ratings through my Yelp-iphone app (one of the greatest apps ever) and boy was I disappointed.  It was awful.   All of the food smelled and tasted like fish and let me leave out what the bathroom smelled/looked/were cleaned like.  Perhaps it is a restaurant only for the \"hard-core\" Chinese food diner - but we could not have been more disappointed.", "author": "Brett B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "Terrific value, very good food.  We had the $48 family meal that included clams with black bean sauce, whole crab, tofu seafood soup, braised mustard greens with garlic, salted fish, sweat and sour pork chops and chicken with greens.  Incredible deal.  Parking is a real issue though.  Usually your best bet is to park on Geary and walk up a few blocks.  Nice neighborhood, so not a problem, weather permitting.  Will definitely be back!", "author": "Brad A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-09", "description": "food is ok, but very bad service; came here with my family for a Chinese New Year celebration dinner; we made reservation for 7:30 pm and was not seated till 8:30 pm; there were empty tables, but the host said those tables were reserved; (I guess what he meant was those tables were reserved for his \"friends\".)  If they are not going to honor the reservation, they should tell us that they do not take reservation when we called.  \n\nAfter we have ordered, they gave us a tea pot, but forgot to give us tea cups.  They brought out the soup, but forgot to bring out the serving spoon and soup spoons.  We ordered a set meal, which included lobster and they forgot to bring out the lobster.  When we reminded them that one dish is still missing, they brought out the crab dish, which seem to be missing quite a few pieces.  When we told them that it should be lobster and to crab, we were then told they ran out of lobster.  Of course, when it was time to pay, they were extremely nice and helpful.  \n\nI have eaten at this restaurant at least once every 2 months or so since they first opened, but have never experienced such bad service.", "author": "Rocky B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "I work nearby to the Emperor Palace and my coworkers go there almost every night.  I have to say I love it.  For 4 or 5 bucks you get a giant portion of food.  Its usually good for 2 meals.  And the food is pretty good.  I am not a chinese food conesour, but I really like the food.  i haven 't been inside so I can't comment on that.", "author": "ken c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-19", "description": "i'm a regular here. if you like chinese food, and you're nearby, stop by this jewel.  you wont be disappointed.  my recommendations:\n\n-salt n pepper chicken wings\n-pan friend noodles\n-any meat with tender greens over rice\n-salty fish and chicken fried rice\n- wonton in fishman soup\n\nmy rule of thumb (for chinese restaurants): if you see painters and contractors in the restaurant at lunchtime, chances are the place is GOOOOOOD.\n\n\n...and this place is packed at lunch with them!", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-15", "description": "It took some negotiating (they wouldn't steam my broccoli and shrimp, but they would boil it), but I finally got what I wanted. Portion was gigantic - enough to make two meals. Also gigantic is their menu, one of the most expansive I've ever seen. I went with my usual, but was very intrigued by the steamed frog. Maybe next time.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-26", "description": "Had a family dinner here the other nite--needed to find a good Chinese restaurant in this neighborhoood and found them on Yelp.  The place has no atmosphere--which is ok for most Chinese people, cause we care more about the freshness of the food.  They have a fish tank and fished out our fish and crab.  We had one of their banquet dinners--the one with two whole crabs for $118 which is a great deal--I think there were 15 dishes--crab, whole fish, fried oysters, roast chicken, pea sprouts, yummy friend rice, dried scallop soup that was delish, salted deep friend pork chops, scallops, etc.  The portions were huge so the value was certainly there and with 11 people, we had a lot of left overs.  Now for the taste--food was good, some dishes really good, others were A-OK,  So as far as Chinese restaurants go, this one gave a lot for the money with good food and the service was fine.", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "The most valuable set dinner for family with the lowest price, big potion and good taste in San Francisco. It's even hard to find a competitive one in SF Chinatown. It's the best choice for family dinner if you don't care about the environment and the service. The dishes served very quickly though.", "author": "dove t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-03", "description": "This place deserves NEGATIVE FIVE STARS for every rude remark the female waitress made while we were ordering and during the whole time we ate. My family and I UNFORTUNATELY ate at this restaurant. When we first arrived there were a couple of customers inside but it was mostly empty. The only person there to serve us was eating and didn't even bother to stand up up to greet us. When we ask questions about the dishes and check to see if they have clams or other seafood in stock the waitress would reply no in a rude manner as if we just insulted her. We wanted to order the $48 family dinner and it states clams as one of the dishes. My gf loves clams and my dad loves oysters, so we asked if we can substitute oysters and pay a little extra to replace clams since they don't have clams. The waitress tells us we can only substitute it with some lamb dish and they don't have oysters in stock either. We ask her if we can substitute the clam dish with some other seafood and she says it will cost at least $4 more to do that. Wow...her attitude, the policy of this restaurant, and the fact that she plain out doesn't care makes me want to leave. An extra for dollars to replace a similar seafood dish with another...rip off! She's lucky my parents were there or else we would've left. I don't think its too much of an expectation to get friendly customer service from a restaurant employee or just get the \"i don't care\" attitude from her without the rude and angry behavior.  We in no way said anything rude to her to get such harsh treatment from her. After the food was served we did let her know what we though of her rude, unacceptable behavior and that we would not be coming back nor recommend this place.\n\nBesides the terrible customer service the food was ok. Portions are smaller than similar Chinese restaurants. The food did come out of the kitchen quickly which may be indicator they didn't take much time to cook quality food. The fried chicken dish had chips with it but the chips were stale and not crunchy. The chicken had way too much salt on it. The soup tasted and looked like it was just water and a little msg. The shrimp with walnut dish was just globs of mayonnaise with small shrimps hidden inside. The best part of the meal was the end when we left. Why? Because it was over! The waitress didn't even say thank you or bye. Maybe she was annoyed that we went in when she was eating or she had a issue earlier with a different customer, or she's on her period. Whatever the reason may be there is no reason to vent that anger and rude behavior on customers that want to enjoy a dinner together. I WOULD NOT RECOMMEND THIS PLACE TO ANYONE! STAY AWAY FROM THIS PLACE! THE FOOD HERE IS NOT WORTH IT, AND THE SERVICE WAS HORRENDOUS! I WILL NEVER COME BACK TO THIS PLACE AGAIN AND WILL MAKE SURE ALL MY FRIENDS DON'T COME HERE. I WOULD RATHER BUY THEM DINNER SOMEWHERE ELSE. If you are craving Chinese food in the Richmond neighborhood go to D&A on Clement. The food tastes better, the service is better, and they have fresh juice drinks.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-12", "description": "This place deserves a solid 3 stars, but really varies.  I eat here a lot (or at least get take-out) since it's close to my abode.  The food is usually pretty consistent.  Service is spotty, but really, what do you expect from a Chinese restaurant?  Not the cleanest place to eat, but the prices are reasonable and the food is good.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-05", "description": "It's not my favorite Chinese food (I find it bland), but it's a great value for money. Mains start around $4.50, and they usually throw in free rice and soup. The portions are so big that I've given up on trying to finish anything I order here. I eat half and take the rest home, which gives me two very cheap meals. It's cheaper and faster than cooking!", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "I visited at the suggestion of a friend (Chalmers!) and was not disappointed.  As other Yelpers advised, the fried chicken is indeed succulent, yet crispy!  Pineapple fried rice is also good, and the steamed crab did not disappoint, especially at around $20 for a whole crustacean.  The only average (not bad, just average) dish was their crispy noodles.\n\nI went on a Tuesday afternoon and had no trouble getting a seat.  It was cool noting the crowd was a mix of contractors and locals who have probably been eating here several times a week for the past umpteen years.\n\nI will return here when I come back to SF.  I will still get the crab even though I'll hit up PPQ Dungeness Island as the main objective in my next SF outing.\n\nWarning: this is a hole in the wall Chinese restaurant with all the requisite diggings, including carpet that should have been changed out ca. 20 years ago.  But who cares?  You eat food off the plate, not the floor.", "author": "X. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-11", "description": "3 1/2 stars is what I would give to my experience at Emperor Palace, but since there's no half star, I'd think 3 stars would be more suitable than 4 stars.  \n\nYou get a pretty good deal at Emperor Palace.  The portions are HUGE for the price you pay.  Their seafood is fresh, but the way they cooked our fresh crab (we ordered salt & pepper crab) wasn't cooked right.  They used this tempura-like batter, which wasn't really what I wanted.  The fried quail was a bit too salty.  Besides these two dishes, everything else we had ordered was decent.", "author": "Katniss B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-15", "description": "$4.95 for a huge, steaming plate of seafood noodles? sign me up!", "author": "Brett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "I love this place. The portions are large and the food is great. The ginger onion lobster is one of the best. When in season it's only 19.99 for 2 lobster. I would do dinner on the weekends only because I think they have a better cook for the busier weekends. When I have food there on the weeknights, it's a hit or miss with the food...can be a little bland at times.", "author": "Steven J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "We come for dinner here only.  \n\nGet the price fixe menu the one for $36.  It has crab, scallops, vegetables, oysters, clams.  \n\nThe food is delicious and plentiful.  Can't go wrong.", "author": "kenny l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-24", "description": "What my cousins drives up from San Jose just to eat here?  My brother, Grant and his wife, Liz (and her mama) came over and whisked me away to this tiny restaurant in the Inner Richmond District.  And,  we found in all the places to eat, my cousins from SJ on their way out the door after finishing their meal!  There was a small plate of toasted peanuts and the house soup(free) was served.  It's true their salt & pepper pork chops and chicken wings ($5.25) are tops.  We also order their Hong Kong style fried beef chow mein with bok choy ($3.95), Chinese Broccoli with Beef ($5.50), half Crispy Chicken  ($5.75). And of course, white rice (free) as well as their pot of tea (free).  Grant said if he had known how much I enjoy the Pork Meatloaf with salty fish  ($5.25) he would've ordered it.  I've learned later that this is a dish to bulk up on with your rice.  The entrees were huge and we had to have six boxes to take away.  After our dinner, the waiter bought us a sweet soupy bean dessert (free).   Ask for the Family meal style menu it ranges from $21.50 to $268.00.  Reservations for a large party. Just remember, when you order food to go, it doesn't taste as good and fresh.  I am coming back with my Wednesday Group for lunch next week!", "author": "Marian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-19", "description": "I've been coming to this restaurant - however many times it's changed hands, since 1995.   It's my family's neighborhood go to restaurant because it's convenient - walking distance/no need to look for parking, cheap, fast  - all the reasons why one would dine at a hole in the wall Chinese restaurant.  Yes, it's true you get freebies like roasted peanuts, soup of the day - you never know what to expect, and dessert usually a bean type of sweet soup.  I've tried everything here from your typical chow fun, chow mein, salted fish fried rice to their ala carte, and fixed menu items.  Our family usually goes for the $35 fixed menu (I think 5 courses) dinner and adds or substitutes dishes.  I can't say the food is always consistent, some days are better than others.  However the service is consistent - the food always comes out fast and the people are well....typical.  I will continue to come here because of convenience sake, and it does suit my Chinese food craving most of the time.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-12", "description": "Really gross.  I ordered Szechuan Chincken.  The chicken was very, very low quality and super greasy.  I gave it one extra star because the guys serving us was really nice and hard working.  He was practically the only waiter in the whole room, serving a lot of people.", "author": "chad H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-19", "description": "I do not know how in the world this restaurant is rated 4 out of 5 stars. My boyfriend and I decided to try it after reading such great reviews on Yelp, but we were shocked by our experience. After seeing only one table full of people and the decor of the restaurant, we decided to order on the safe side. We ordered potstickers, kung pao chicken, and chicken fried rice, thinking these dishes were pretty generic. We thought wrong. I don't want to be very rude and say the things we really felt about the food... but let me just say this was the worst food I have ever had at a restaurant. We were pretty sure the \"chicken\" was just fat from a chicken covered in sauce, and the mystery meat in the potstickers was enough to make me sick to my stomach. I had never had a bad experience at a restaurant  in my life until last night, but it was so bad, we put cash down on the table and left as quickly as we could. All I can say is, do not eat here... and I do not know how the other reviewers' enjoyed Emperor Palace Restaurant's food as much as they wrote here on Yelp.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-19", "description": "OMG...I died and went to hole-in-the-wall Chinese restaurant heaven!  I have not had an experience like this in a long while..and I'm not talking about the food, although the food was pretty decent.  First off, I was born and raised in Chinatown...home of the hole-in-the-wall, grease on the floor, rude wait staff, cheap, plentiful and decent food.  I had my fill of these type of restaurants growing up, and being the child of a cook that worked at the old Joe Jung's, I know the meaning of the words \"wok hei.\"  (For those of you that don't understand Cantonese, the best translation I can give is \"fire flavor.\")  After moving out of Chinatown, finding these types of restaurants were hard to come by....until now.....\n\nI went to this place on a lark...I was around the neighborhood for a meeting and was scouting the area for some place to eat.  This restaurant was packed at 11 am, with lots of old Chinese (Cantonese/Toishanese speaking) people.  A good sign since we \"lo wah kuei\" people are known for frequenting places whose food are not just good but friggin' cheap.  When I walked in, the heads swiveled to see what new blood walked through the door as I did not look like anybody in the restaurant.  Thank goodness for my parents insisting I speak Cantonese to them or else I wouldn't have been able to get a seat.  No one brought a menu, and it wasn't until I was moved to a smaller table (did I mention it was packed?) about 10 minutes later that I reached over to the counter and grabbed a menu that I finally \"got\" a menu.  About another five minutes later the hostess/waitress came by and asked (in broken English) what I wanted.  Replied to her in Cantonese, and she ran off to the kitchen to place the order.  In between waiting for the food that I ordered, I noticed that patrons were going into the kitchen with a plate and coming out with peanuts...a bribe from the cook to get these guys out of the kitchen?  Got my food (tofu beef) about five minutes later - HUGE portions and was told rice was coming - about two minutes later.  The flavor of the beef was great - tender, and the tofu was silky.  In the midst of eating, a shipment of food supplies came in and almost didn't make it through the very tight rows.  I was able to see fresh vegetables and some still kicking fish.\n\nAll in all the experience was something that I haven't had in over five years.  I knocked it down one star as it took over 10 minutes to pay the bill.  Waitress didn't give an actual ticket on the total price of the food and was only told of the price verbally upon her throwing a couple of boxes for me to put my leftovers in.  All-in-all if you want the \"real\" Chinese hole-in-the-wall restaurant experience outside of Chinatown, this is definitely the place to go!", "author": "J H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-28", "description": "This place was pretty bad. The egg rolls were ok but the wor won ton soup and tomato beef pan friend noodle were gross. It seems like most of the dishes would be bad because im pretty sure they actually used ketchup in the tomato beef. Everything was slimy and the meat was bad.", "author": "rachel r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "this family style restaurant was surprisingly great!  food was fresh, flavorful and very good.  price is very very reasonable.  menu options are better than normal chinese restaurant choices.  great place around the neighborhood.", "author": "Silver C."}
