{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I found this place by chance. I was waiting for a concert next door and was starving in line. I decided to head over and grab a slice while I waited.\n\nI walked in and it was fairly busy, I didn't wait long. I asked for a plain cheese and took it tllo go. I'm glad they didn't need to pop it in the oven because I was in hurry, maybe it just came out of the oven?\n\nI didn't have any expectations as it was just a plain slice but wow it was delish! I'm still thinking about it all way from San Jose. I need to go back and try their other options. The sauce made the pizza. So delish!\n\nRecommend if your in the neighborhood!", "author": "Evangelina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-30", "description": "Good pizza on a pinch. We came by around late dinner time, not a lot of options left. We both got a slice and sat down to watch the Giants on the TV while munching away.\n\nThe potato pizza was delicious, an unusual flavor that pairs potato slices with soft whole garlic cloves. Who doesn't like potato, garlic and pizza?!", "author": "YY M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "I love this pizza place! Whenever I'm working in San Francisco, I come here. The pizza is great; best one is the fig and bacon one (only available on Tuesday's and Friday's). Today they had a new one--potato and fig. Excellent (though the fig and bacon remains my favorite). And the staff! The same folks have worked there for quite a while and they are all friendly, helpful, and actually remember me when I come in. You can tell they have a great rapport with each other, and it makes the whole place feel friendly and welcoming. Definitely a favorite place of mine and my colleagues.", "author": "Kati A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "It's isn't my first time I order from them.  \nAnd I think the pizza is great   \nI usually love the feta cheese one. With black olives.   \n\nPizza is good.  A bit pricey.    Cost me 43$ tonight \n\nAnd the only things.   They delivery that. Not that hot.    In between I will say.", "author": "Riley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "Few things bring me as much joy as redemption.\n\nAs a Yelp Elite, that means a biz-nass coming through and delivering on their promise - doing whatever they do, well.\n\nIn my original review, I lamented the fact that the Hawaiian was missing from our catering. Fast forward to now, I got my slice of Hawaii -- and what better time than when it's pouring down outside.\n\nHam. Pineapple. Cheeeeeeese. Home run.\n\nCertainly not the best Hawaiian pizza I've ever had but, today, it lit up my life. (It's been a week...!)\n\n______________________________________\n\nORIGINAL REVIEW:\n\n2/6/2017\n\nWanted to be thrilled.\n\nWasn't thrilled.\n\nTL;DR was really excited for a Hawaiian Pizza that was part of a catered lunch from Escape from NY. Said pizza never came, so I tried a couple of the others (Miss Figgy and the vegg) and I just wasn't .... thrilled.\n\nThe pizza fell flat - literally and figuratively. Although, I heard it was decent cold the next day.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-19", "description": "Ugh, it's a stressful morning at work, so I'm going to think back to last night when I had pizza. Pizza makes everything better, right? All the roommates were around last night, so we decided to get delivery...which turned into pickup. \n\nWe got the \"You Say Potato,\" a combination of sliced and roasted potatoes, roasted garlic cloves, and pesto sauce and \"Big Applewood Bacon,\" barbeque chicken, bacon, tomato slices, and cheddar.\n\nMy all time favorite pizza is a mashed potato and bacon pizza (BAR in New Haven, CT-- I miss this so much) so this potato pizza didn't quite live up to that standard. The crust on this was soft, but not chewy. Toppings were nicely done-- the garlic was soft and the potatoes were cooked through tenderly. The pesto had good color but flavor wasn't that strong.\n\nOur barbeque chicken pizza was juicy, but severely burnt on the bottom. Giant hunks of white meat chicken made it a tad difficult to eat-- I wish they were more bite-size. Bacon was okay but not super delicious.\n\nSeems like a solid spot.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-28", "description": "I came in to pick up two slices of pizza. They had no pizzas ready by the slice just one cheese that looked like it's been sitting there. \n\nThe woman told me to wait for ten minutes. I came back and she said five more minutes. When I pulled up someone was smoking weed out front then I saw her go behind the counter and realized she works there. \n\nThe place was dirty. No pizzas ready. I thought they would have slices after 15 min of waiting. \n\nI never got my slices", "author": "Princess Jasmine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "I order a pizza last night.  From\nEscape from New York \n\nAnd it is not my first time.  I think the forth time I order pizza there. \n\n\nSo the pizza is great. With out a doubt.  And delivery very very quick.  ( also I live 3 blocks down the street )\n\n\nThe only things. And that why I give only 4 stars.  \n\n\nLarge pizza. 40$ and up\n \nNot cheap I will say.  \n\nBut again. A fine pizza", "author": "Comrac L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-31", "description": "I like to pop in for a post - work slice now and again. The recently upgraded from Pepsi to some other brand of soda which is great. Wish I could recall the name...the diet black cherry is tasty. \n\nI do recommend of you need a slice!", "author": "Greg J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "It was a pretty good simple pizza for a it's price. \n\nWe offered half plain and half with artichoke in the biggest size.", "author": "Mete R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "I'm kind of biased on this place... been eating here since I was a kid. Lol I used to only get cheese but now I'm all about that gourmet or potato pesto (or stack them on top of each other lol).\n\nI think my favorite location overall is the one on haight (is that the original one?) I love that they reheat your slices in the oven so it always comes out crispy and hot.\n\nMmmmmmmmm I want one now :)", "author": "Jewel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Checked in on May 31st.\n\nThe 4 star rating is for the potato garlic pizza.  Who would have thought of that combination?  They went great together.  The pizza was tasty, served hot.  Serving size of a slice is decent.  The person who took the order was friendly.  Inside the place is bare bones kind of ambiance.  I would not want to sit and eat there.  Take out would be my choice, unless I plan to be in that area for that day.", "author": "Anjali A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Decided to stop by tuesday around 1. Truly a a great slice of pizza! One of the cooks recommended the Miss Figgy, didn't catch his name but I think he was one of the managers.  Very helpful throughout the whole process. He even to took the time to explain the ingredients and offered a menu too, in case I wanted to try any of their other pizza selections. He looked very busy but still managed to maintain great service.", "author": "Cassandra K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-12", "description": "Pros:  One of the few pizza places that will deliver at lunch\n\nCons:  Rude customer service, not great tasting pizza.  \n\nI wish we had more options for pizza delivery in Soma.", "author": "Vi Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-28", "description": "As a pizza connoisseur, this place is average. Not the most amazing pizza I've had but if I was walking by I would grab a slice to go. My friend lives a block away and we ordered a medium glorious chicken. It is pretty much a roasted chicken pizza with cheddar cheese, tomatoes, garlic and spinach. Toppings were okay and the chicken looked weird. I thought it was tofu at first. The crust was a bit soft. It did not have the optimal amount of firmest in the crust to prevent my toppings from falling .  I definitely do not think it was worst $30 for a medium size pizza and at that piece, they should serve me my pizza with a pint of beer.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "Well, what can I say...I've finally given up on this place for good. Used to be my go to spot in SF/Soma MB for delivery but the quality and consistency has been steadily decreasing. The order I placed this past Sunday night was the final straw. \n\nOrdered a pizza with a mix of red sauce/pesto, pepperoni and fresh basil. The pizza arrived with the most scant amount of mozzarella cheese I've seen and some slices had no cheese at all. There was only a small amount of pesto sauce and absolutely no red sauce to be found. \n\nTo be fair, I messaged EFNY through 2 different mediums and didn't even receive the courtesy of a response. \n\nDone.", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Honestly one of the best Pizza I ever had. Friendly and clean place. Recommend the You Say Potato pizza. Delicious", "author": "Joe A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-15", "description": "Employee would rather close early than make a new pizza...\n\n\n\n\n\n\nCame in last night 8:25pm (35 minutes before closing) to seeing a mess of slices on display. When I asked if they would be making any new pizzas even a simple pepperoni, she said \"no, we are done for the night.\" \n\nI asked her \"if someone came in and bought all these slices right now, would you close up early?\" She responded \"yes\".\n\nif I was in that situation I would have suggested to put pepperoni on the last cheese slice available, cut a deal like throw in a free slice, and also... make a new damn pizza! (Make customer happy)\n\nIt's Friday night in the city, it's not going to hurt the business to make another pie. Also, I understand food cost is in mind when you're nearing closing time, there was 6-7 slices left with 35 minutes to spare.\n\nWhat does hurt the business is when people like me come in to a sad display of old pizza and get turned away with little to no customer service.\n\nYou have the name backing you, your customer service needs a tune up.\n\n-Manager 2+ years similar restaurant.", "author": "Brett F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "A friend of mine was having a terrible day, and I joked that I would send her flowers (which she would hate) to forget the other things that were ruining her day. Instead I sent her a huge pizza (which she likes), and the guy who took my order was nice enough to put a balsamic-reduction frowny face on the pie, per my request. Restaurant folks, and especially pizza folks at lunch time on a Monday, don't always have time for that kind of silly nonsense. They're not cake decorators, and I definitely would have understood if he said no. But he did it, and my friend was so happy. Also the pizza was really good and got there well within the delivery window. Thanks dude. You're the best.", "author": "Carmen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "An average pizza place IMO, but better than the late night pizzas. Definitely worthwhile if you're in the area and want value pizza. The order-to-eat process is pretty quick, even when there's a line. You can be in and out of here within 30 minutes.\n\nThe large TV is always on some sport, even futbol, score.\nThey have a frequent visitor card; buy 7 slices and get the next slice free!\n\nLocated near the corner of 3rd and Harrison with plenty of parking meters around. This review is slightly bias as the location is conveniently near work.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Perfected cheese!! I could taste it. The pesto was savory, and pepporoni had a fresh taste. Stop by and grab a huge piece of new york style pizza!", "author": "So C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "Well, I went in at 8:55PM on 8/5 and the woman working there was very rude saying that they were closed.  Apparently, her 3 friends that she was speaking with were exempt from the closure rules.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "Walked into this place thinking \"I love pizza, how bad could it be?\"\n\nIt was bad. \n\nOne of the cooks smoking outside as I walked in.\n\nInside is dirty and smells like a urinal.\n\nOrdered my pizza: two slices of cheese. Second guessing my decision.\n\nCook comes back in, goes right back into back of kitchen without washing hands. I push the pizza back towards them, and say \"no thanks.\"", "author": "Alex L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-21", "description": "After years of extolling the virtues of this chain, it has fallen off the cliff. What was once cripsy crust and tangy sauce has been transformed into cardboard crust and sugary sauce. \nA huge mistake to cater to the Pizza Hut crowd, but that is what happens when you over extend a brand, too many stores and not enough love. \nReally sad turn of events. My group of 6 tried all kinds of slices so this review is not based on one slice or one visit.", "author": "David B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "TL/DR ordered a $30 and never got it, they never offered a solution.\n\nOrdered, waited, they never showed up. They called me and hung up twice after telling me to \"hold on\". Kinda confusing, never actually got to taste their pizza ;(.", "author": "Ethan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Needed pizza delivery last night. Was disappointed that I couldn't find one in the dogpatch which is where we were. While this is not in the dogpatch, it was relatively close.\n\nCalled in my order of an XL big meat pizza. It was delivered within 30 minutes and piping hot!\n\nI will definitely use this location again!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-09", "description": "Worst experience I have ever ever ever had going into any establishment. We wanted pizza before going to city nights and the horrible staff screamed at us yelling \"GET OUT\" \"WERE CLOSED\" immediately when we walked in. We didn't know they were closed because there was no closed sign and the door was UNLOCKED. When we complained one of the girls yelled in my face saying, \"DO YOU WANT TO GET IN THE CLUB?! ILL TELL THEM NOT TO LET YOU IN!!\" Then they all locked up and proceeded to jaywalk across the street to their cars and flipped off a driver and screamed at them as the driver skid to make sure he didn't run into them. Horrible disgusting people. I don't care how good the pizza is. I wouldn't even care", "author": "Julia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Pretty good pizza! Really thin and crunchy crust. And the slices are huge so worth the SF prices as far as lunch options go. You can easily go off of one slice but I tried the meat combo one and the pesto. Sausage on the combo was huge and there were lots of other things on there. Pesto was solid pesto with light amount of cheese. I can handle and enjoy more pesto but theirs was tastefully done. But yeah sf prices so for two it's like $9 so for healthier option I'll just get one slice of pizza next time. Definitely will fill ya up.", "author": "Maxfield A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "Quality pizza and what I usually order for delivery...\n\nHowever last time my pizza was delivered mangled as 1/2 of the pizza was in a squished pizza ball.  I called the manager and he seemed bothered by my request... He gave me 1/2 off my next pizza. So the service can certainly get better...\n\nDont damage the pizzas after someone pays $30 bucks for a medium pizza!", "author": "Steven W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "It low key looks iffy at times but the pizza is phenomenal", "author": "Ian N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "Dirty inside. I walked to the counter and the attendant started at me with an annoyed look for a few awkward seconds until I ordered. The single slice of pepperoni was $4.50. It was greasy and flavorless. I took it to go because all I could think of was leaving this gross restaurant.\n\nI'll recommend not going here to my friends..", "author": "Joshua N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-13", "description": "Great NY style pizza although it's not posted anywhere that you csn't buy slices after 9pm and the guy acts all huffy like I'm supposed to know.\n\nI get a medium mushroom to take back to my hotel room and it was awesome (apparently small is off the menu too after 9).\n\nGood food, not crazy about the time it took and service.  One other thing... use spell check when printing Menu boards.  \"Ceasar\" salad is not something I'd order since I figure you didn't take the time to run spell-check...", "author": "Ben H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "Not their best location - perhaps not as busy as other parts of town, so the pizzas aren't as fresh?", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-20", "description": "This was my first experience with Escape from NY Pizza and had to try it since it had been teasing me from across the street. \n\nThere are multiple locations, so don't place a to-go order with the wrong restaurant... Oops! Although, they were very nice about it.\n\nAtmosphere:\n\nI walked over closer to closing time and the tables and chairs had already been put away. I didn't get a true sense of the atmosphere, especially considering the club next door was in full swing and blaring music at this point.\n\nFood:\n\nWe ordered a medium Glorious Chicken (~$30). Since I live so close, we basically tore into the thing fresh out of the oven. Flavors on the pizza were fantastic and the chicken was juicy. Downside to this particular pizza, the tomatoes. They were extremely watery and caused what was once a crispy crust to get very soggy very quickly, hence the 3 star rating.\n\nSince the flavors were great, I'd definitely head back to try out the rest of their selection.", "author": "Bobby M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "I have a gluten and dairy intolerance and have been very iffy about buying pizza from a chain. I tried frozen pizza, cauliflower pizza crust, and almond meal pizza crust but they have all been awful. So I took a chance at escape from New York pizza and this is been the best pizza I've had since I found out I have an intolerance.", "author": "Jessie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-23", "description": "Went after a morning outing at Yerba Buena Gardens. This location is tricky to find because its a 2-way street that becomes a 1-way. Anyways on to the review. Had high expectations with the high overall rating and number of reviews. Disappointed. Taste not that great. Had better from hole in the walls. Offered option of salad drink combo which was nice. Overall not the best slices to get.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-15", "description": "There pizza is good, but I think I'd rather pick up and eat home then to dine in. Staff is weird and the bathroom is disgusting.", "author": "Penny G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-07", "description": "I would give them no stars if I could. It's been 2 hours and still no sign of my pizza. The man on the phone said he cannot track or contact the driver. Absolutely ridiculous! I better get my money back!", "author": "Nupur B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Okay it's  a little hole in the wall big dea!  The restroom was kid friendly  (meaning clean) We picked three slices ,they reheated them in the oven and off we went in the the city of San Francisco!  Yummy and hot\nNo argument here!", "author": "JoDivinequeen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-27", "description": "The pizza is good and worth a visit, but sometime recently, the prices have driven me elsewhere. $6 for a slice is a lot, enough for me to get a bagel sandwich instead.", "author": "Greg T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "Via work, I have had more Escape from New York Pizza than I would have liked. While I don't find any of their ingredients particularly high quality, credit must at least be given for their daiya cheese option. Daiya cheese is far from the best vegan cheese offering but in SF that's about as good as it gets at pizza joints. There are maybe only a handful of places that even have this as an option, and I'm thankful that Escape is one of them. Still, I wish they could up their game, perhaps by adding a vegan sausage option or even a more robust selection of veggies.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-28", "description": "I'm officially finished with this place. The pizza isn't half bad and it's right on my way home, but I just can't sink this low anymore. This place is fired.\n\n1. Tonight I ordered three slices to go and the total was $11.84. I mean to give $12, but accidentally gave $13. When the counter girl gave me the change, she told me \"You could tip us\" and nudged the tip jar to me. WTF?!?! That is SO. WILDLY. inappropriate. \n\n2. She (didn't catch her name but she had a very long straight brown hair in a side braid) took my order, put the pizza in the oven to heat, dealt with the money and then went to take the pizza out. I asked her to leave it in another two minutes. The walk home is three blocks. I could tell by looking at the pie that the cheese was congealed, which meant it wasn't fresh out of the oven, which was WHY I asked for another two minutes. She ARGUED with me. She was wrong; I don't know why she thought it was her place to argue with the customer who wanted something totally reasonable, let alone when she was incorrect. \n\n3. When she went to take the pizza out the second time, she put all the pieces of pizza on top of each other. Any idiot who knows the tiniest bit about hot pizza knows that the hot cheese will melt into the crust of the piece on top, making the crust soggy. I asked her to fix the slices so they weren't overlapping. She used the tongs, and then also USED HER FINGERS. The same fingers that had just handed money, which everyone who works a cash register KNOWS is FILTHY. This is a huge hygiene issue. She then did NOT close the box. Just ... put the tongs down and stepped back. Who the hell walks out of a pizza parlor with their box of pizza OPEN? \n\n4. When I got home there was a black hair in my pizza box.\n\nEspecially with Tony's Neapolitan opening a \"by-the-slice\" parlor on Second Street, there is just no need to put up with this sub-par service from Escape From NY Pizza. Whoever the manager is should be ashamed of themselves for not training their employees better.", "author": "Green Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "This place is convenient and close to our house for delivery. I have ordered from here over a handful of times and it has always been good. \n\nUsually get the pepperoni, ham, and artichoke topping. Can't go wrong with what you order on your pizza.", "author": "T. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "3.5 stars!\n If you want a tasty quick slice of pizza then check this place out. Good sauce to cheese ratio with a nice balanced crust. Not the cheapest slice of pizza but for the quality well worth the money!\n\nI'd come back again for sure.", "author": "Lyle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "I got the meatball pizza that came with tomatoes on there and I can't say anything bad about it.  It was delicious in terms of the combo of the sauce, cheese, and the toppings.  And it passed the day after test when I had a slice cold...the crust didn't harden up and was delicious!  The place seems to do more takeout and delivery since their dining area was so small.  The medium pizza that I ordered can really feed three people as it was really a big pizza.\n\nThe pizza is really worth the money spent on it.  I would likely order it again too.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-21", "description": "Says it's open till 11pm today but on going in to ask for pizza at 820pm they say no more pizzas being made tonight!", "author": "Neill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "This is really just a basic pizza slice spot but it's an a good location close to a lot of events that happen downtown; They have pesto! There are tables if you want to eat there. The chick working was super friendly and chill so the 5th star is because of her!", "author": "Krystina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "When we lived in SF, we lived right around the corner from this Escape From New York Pizza.  We always saw the big sign on the side of the building, but never saw a storefront.  But one day, we saw a new, huge window one one side of the building.  We peered in and saw they had seating on the inside.\n\nSo one day, wifey and I walked in for a quick snack and split a cheese slice.  Damn, it  was good.  Thin crust with a bit of crisp, hot melty cheese, and the right amount of sauce. \n\nMade me wish I had my own slice, so next time I'm getting my own!", "author": "Nadeem A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "If you're walking along 3rd street on your way to AT&T park for a Giant's game, you might consider stopping by this Escape from NY location for a pre-game slice and brewski. \n\n Nothing fancy about the slices - it's the usual variety from Escape from NY but the pesto potato or the gourmet (spinach, artichoke, sun dried tomatoes, and feta) are nice change ups from the usual pepperoni. Best of all, add $2 to that slice and you get yourself a nice cold bottle of beer. The total comes around the $6 mark which is a total steal because if you think about it.... that's just about half a beer at the ballpark isn't it?", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Escape from New York is probably my favorite delivery pizza in all of San Francisco. The pizza is ridiculously good, and the delivery time is generally not intolerable. I just wish it wasn't so expensive for their pizzas!", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "I decided it was a great day to treat my employees to lunch.  I wanted to get pizza and didn't know a good place to order from so I surfed the net. I found Escape From New York (EFNY) and saw that their SOMA location would deliver to my work address. I ordered 2 large pizzas. One plain cheese and the other tomato and artichoke. There was a spot on the web order form to let them know what time you wanted the delivery and I put 12:15. Right on the dot, here comes the delivery man with two fantastic smelling pizzas!! The smell was second only to the taste. I felt like I was back east at my favorite pizza place! The dough was perfect, nice crusts, and excellent sauce, cheese, and toppings! I highly recommend EFNY! They have 6 locations in the city so pick one and head in or order out!", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "My first time ordering from here. Free delivery which is always a bonus. They showed up right at 6 pm on a Saturday. We ordered the Miss Figgy with figs, balsamic vinaigrette, goat cheese, argula and it was amazing. The slices are generous. Also got the wings which were on point. A little price but you get what you pay for. Highly recommend this place for pizza and wings.", "author": "Mal L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-20", "description": "had a nagging pizza craving since my morning run, and i finally got my hands on some after waiting about 6 hours haha. this place is about 6 blocks from my apartment, so it was convenient, and i've had their pizza from their bush location, although a really long time ago..  \n\nthere are quite a few choices on hand during lunch time, but they ran out of pineapple as soon as i got there.  so i got a slice each of the pesto and sausage, which was warmed in their ovens and boxed. the consistency of crush on the two slices were different, perhaps cuz sausage had a tomato sauce. sausage was definitely better tasting and more 'new york' than pesto, which tasted vaguely like cardboard and had really no flavor. sigh.  i will probably walk further to orgasmica next time for slice pizza.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "For all you SOMA workers... you know how limited we are for lunch choices... for about a year I've been telling my coworkers that we should try this spot... every time we'd walk towards to Whole Paycheck...\n\nWell, we finally tried it! It was definitely cheaper than getting pizza at WF so that's a major plus. We came during lunch hours so it was a bit crazy but the staff churned out pizzas pretty darn quick.\n\nI pigged out and got two pizzas: something with chicken and broccoli and cheese. Both were actually really good and it was thin like the pizza that I ate when I was in NYC in May. \n\nWell worth checking out for those moments when you really don't know what else to eat around the area... \n\nPS: the decor is on the weird side... but it's SF... so... :)", "author": "Cath M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-05", "description": "My wife had a quick bite here while I was in a lunch meeting around the corner. The area is OK. The atmosphere was all right. They had a bathroom you  could use (through a door into the neighboring club).\n\nShe got the lunch deal: pizza slice, small salad, and drink which was close to $10. The pizza itself was OK, nothing special... maybe a little on the burnt side.\n\nWe actually weren't too impressed with most New York Pizzerias in New York City, so I guess we shouldn't expect too much from one in California.", "author": "Kurt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Loving the pizza here, the You Say Potato pizza was bomb with ranch! Anthony was awesome too, and so friendly! I'm from out of town and he recommended some places to check out for the evening! Great food and great customer service! Thank you!", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-03", "description": "Terrible service every time I go in here.\n\nIt's literally as if I am inconveniencing the manager and workers by wanting to spend my hard earned money on their mediocre pizza (at best).\n\nSeriously, they must've escaped from NY but forgot to leave their terrible east coast attitude there.\n\nSkip this joint for sure.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Still rocking.\n\nMore descriptive pizza slice reviews can be found here: http://www.yelp.com/user_details_review_search?userid=WecuAsHBDZGj7Z6_sJcQAw&q=Escape+From+New+York\n\nMost excellent homemade cookies can be found here: Double chocolate that are as perfectly chewy and rich as they are perfectly priced for just $1.25.\n\nDidn't see the rocks. But did see an awesome Scrabble game on the bathroom door.\n\nFour star cookie. Extra star for being cheap and clever.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Visited today while in SF for business...viewing other Yelp reviews, I decided to give this place a shot.  \n\nThe pizza was good and what I felt was a good price - 2 slices for under $10.  \n\nYou Say Potato was an interesting slice and well worth the try.", "author": "Nathan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-02", "description": "Not bad, but not great either. Nice thin crust, not like that Chicago Deep Dish. Bland sauce and not enough of it ends up making a very dry pizza. \nAnd don't believe the guy about the potatoes on the pizza, yuck!\nYou could do better getting a frozen pizza at Whole Foods across the street....", "author": "Fred S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-23", "description": "Just had about the most terrible pizza experience of my life. I've been here several times before and the pizza was pretty decent, but tonight ordered a large pepperoni, 1/2 bacon and was beyond disappointed.\n\nThe crust was very, very chewy, thin and tough underneath. The cheese did not cover the entire pizza, there was a giant ball of it on one piece (did they get distracted and forget to spread it around?). The pepperoni and cheese had a very re-heated taste and texture. All in all it looked and tasted like they through some ingredients on an old pizza and put it back in the oven.\n\nI called to complain, asked for the manager, never got him. The employee who answered though seemed to believe the pizza was fine, and offered to keep his ears open for other customers complaints about the crust. Apparently they have to have several bad pizzas in a row before they care?\n\nI've never thrown pizza away in my life, but this sucker was literally inedible. I got a frozen pizza from whole foods instead and tasted like pizza heaven in comparison.\n\nMistakes happen, but no one could have even looked at this thing. Will not be returning, which is a shame since its close by. A little customer service would have gone a long way.", "author": "Randall B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "Went here before a Giants game in August 2011. It's a 5 minute walk from AT&T Park.\n\nPretty good New York style pizza. Not the best San Fran has to offer but a lot better than the area I live. All the different New York memorabilia they have in there is nice and it's a cool place to sit down and chill.", "author": "Nate F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Really love the pizzas here. Compare to other fast pizza options, escape from new york just taste the best. It's not as greasy and the meat feels like it's quality. The slices are huge and can get you full.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "The pizza is superb; and this is coming from someone who knows great pizza!!! The potato pesto slice was very unique and tasted really good. The Hawiian was very standard and I really enjoyed it. Overall, 5/5 pizza and I WILL be going back again. =D", "author": "Rob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "I've spent many a lunch at the Escape from New York in the Financial District, and I'm glad to see that this SOMA location is continuing the tradition of good pizza at reasonable prices.\n\nUnfortunately, this location has a smaller counter, so the selection of slices when we went in around 12:30 was a little weak (cheese, pepperoni, 1 slice of mushroom). But the quality is there. I'll be back.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-02", "description": "This is my first 1 star review.\n\nDelivery took 1 hour 20 minutes. I called to ask where the pizza was and was told that they would knock $10 off the order because they were so late- that never happened, I was billed full price. \n\nThe pizza itself was mediocre.", "author": "Navin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-14", "description": "Just ordered 2 pizzas and a caesar salad.  An hour later the pizzas came, but they forgot the salad.  20 minutes later they came with the salad, but forgot the dressing.\n\nCome on, this is pretty basic stuff.  Would love to have this experience corrected if the business owner is reading this review....", "author": "Clay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "Our go-to pizza place for delivery in SoMA.  \n\n+ Their website has a well-developed user interface for online pizza ordering, which remembers previous pizzas (nice).\n+ Pay for the pizza (and leave a tip) online, so the delivery is quick. \n+ LOVE the buffalo-based pizza sauce.\n+ Quite inexpensive, I think.  About $26 for a large pizza with delivery.  \n+ Delivery in about 45 minutes (at least to us, at 4th and King).\n+ I've had 4 pizzas from them, and the pizzas are consistently tasty and not too oily (although their default cheese may be a bit of a heavy serving for some people).\n\nTheir menu pizzas can get a little pricey, but if you design one yourself it's quite economic. Oh, and there are coupons online...", "author": "Charles Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-14", "description": "The person who answers the phone always sounds like he hates his job. Like, it's such an inconvenience to have pizza delivered to my place. 3x this happened. I used to think maybe he was having a bad day. But 3x already. I think it's his attitude.", "author": "Mayenne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-27", "description": "Ahh!! New York pizza right here in San Francisco . . . this my new go-to pizza delivery restaurant.\n\nThe toppings are incredibly fresh and the pizza comes to your place piping hot. The XL pizza is also so large that it practically covers my entire desk and barely fits through my door frame. Hah! Who can ask for a better experience than biting into a warm and cheesy pizza slice that is bigger than your face??\n\nSuggestions: NY Pesto Chicken; pepperoni with jalapenos\n\nService: I've always talked to a friendly and helpful person when ordering for delivery. Also, they tell you that your pizza will arrive in about 45 mins but it always arrives a bit earlier (around 35-40) which always makes for a nice surprise.\n\nI would rank this place above Goat Hill for two reasons: (1) They don't charge you for delivery; (2) The crust is a bit lighter and softer.\n\nTip: Every time you order delivery, they'll give you coupons for $1 off a medium, $2 off a large, and $3 off an extra large on your next order. It may not seem like a lot, but with free delivery, a couple dollars off is like getting an extra topping for free!", "author": "Linna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "This pizza was very good.  I would rate it a close second to Chico's Pizza.  The benefit of this place is that it has more space to dine in (or outside on the patio) and it has a private bathroom.", "author": "Tristan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-06", "description": "On a Sunday I was getting a craving for pizza while working at Epicenter cafe down the street.\n\nSo I popped by Escape from New York, maybe it'll be as good and well-priced as the pizza in NYC, I thought to myself. \n\nI was wrong, this place has mediocre pizza at high prices. One slice of Pepperoni is $4.15 and there's nothing special about it whatsoever. On top of it, the pizza in the window looked like it had been sitting there for over a day, or many many hours at the least. I won't be back again.", "author": "Brad M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-16", "description": "3.5.. standard not so bad pizza.  Sauce wasn't memorable, but the crust was chewy how I liked it.  We just got a regular pepperoni around 11 pm, it was the only thing opened around the Courtyard Marriott at that time.  The delivery was really fast, about 20 mins.  The Cesaer was standard, nothing special.  Although the online menu said they delivery beer, they dont :-(.  2 bottle water, a salad, and a medium pizza put us back almost $30 with tip.", "author": "Liz N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "I don't know what took me so long to write a review for this place, especially with its awesome combo deals. Pizza (around $4) and a beer will net you the beer at only an extra $2, and you can get an Anchor. How is that not a steal? Pizza, soda, and salad for a little over $8. Again, unless you're eating at the Costco food court (which kicks butt, by the way), you're not going to get a deal like this. I always eat in because I don't do the delivery thing, but you're going to get a decent portioned slice, and if you choose the potato pie, you won't be disappointed. It has thicks slices of potatoes and whole garlic cloves on it. Love this slice, but you can't really go wrong with the others, and honestly, you're going to get a flavorful, non-cardboard-like crust that isn't overly thick either. It's not that far off from the way a NY-slice crust is made. Cashiers are quick and know what they're doing. I'm pretty sure they're lit most of the time, but meh. You probably are as well. There's even a huge flat-screen showing sports and lots of Giants memorabilia. This place is always empty too, so don't worry about a crowd or line. Just be warned that you're eating next to a really rowdy club, and both places share the same restroom. ;)", "author": "Danny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "Great recipes, creative pizza names, amazing pizza pies, absolutely horrible customer service. This would have been a 5 star review for the pizza, but thank your phone order taker from Sat 9/12 around noon for the fantastically awful hospitality. He was rude, short on the telephone, had no knowledge whatsoever, and hung up at the end without confirming any details or saying goodbye. Much like other reviews written below, I recommend some much needed training be put into place. I understand NY is in your name, but on the West Cost we treat people kindly and with respect. (Note: for the SOMA location only).", "author": "Dustin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "This last Sunday I was slated to work a 12 hour shift on the unit across from mine, and I wasn't exactly looking forward to it.  It was a good thing that my manager had come in to help and decided to buy us all a few pizzas to take the edge off of the long shift. I looked online for anyplace that would deliver to my work and Escape from New York was one of the places that came up within the permissible vicinity. We ordered the Margherita, the Gourmet, and a pepperoni and mushroom pizza all extra-large and tremendously huge.  Between about 8 of us there was about 4 slices left when the carnage was over. The quality was great (very much east coast style) with thin, but broad slices with prime ingredients . I highly recommend this place.", "author": "George S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "The pesto/potato/garlic pizza is delicious!\n\nThis time I decided to buy a whole pie. It was around $30! That is too pricey for a large, veggie pizza!\n\nI'm a sucker and paid up, worth every penny but still pricey!", "author": "Lola K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-10", "description": "Pizza a was undercooked, then burnt when reheated. I'm not saying this as a person who just eats it and thinks they know, I used to work in a shop. $9+ for two slices?! It's not gourmet in the least, why ya'll charging gourmet prices?", "author": "Chuck L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "It's an alright pizza, the crust is ok and the sauce is meh. Nothing spectacular, especially for the (high) price. Delivery was fast though.", "author": "Nicolas P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-07", "description": "Meh pizza.  Doughy and over sauced.  The delivery was fast and friendly.  Damn I wish this place was better.", "author": "Darin E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-10", "description": "Was in San Francisco on business at the Moscone Center when a local recommended Escape from New York Pizza. When I arrived at 1:00pm on a Sunday, I was sorely disappointed. There were four slices just sitting out that looked they had been there since the prior day. Was told that no fresh slices would be coming out anytime soon because they had a busy day with deliveries. \n\nBecause I was in a rush, I asked one of the guys to heat up a slice. It was still ice cold when I went to eat it five minutes later.\n\nThe dispensers for the utensils were covered with black grime, I had to use a napkin to push down the levers. \n\nI'm all for hole-in-the-wall pizza joints but this was NOT it.", "author": "Allison B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "Great pizza.  Very friendly crew.  Super fast service.  Are these guys guilty of spending more time making great pizza than shining the floors?  Yup.  And I wouldn't have it any other way.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-16", "description": "Pizza slices were all good.  Nice crust.  A little skimpy on the cheese, but flavors were tasty.  We tried the mushroon, the combo, and the pepperoni.  Throw in a side salad and drink for total of about 9 bucks each and I would say it was a decent deal, but nothing to write home about.  It is convenient however.", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "Super fast delivery\nCoupon for a few bucks off.. You can set up an account and keep a credit card on file for convenience..\nI also asked them to make it well done and the y always do..\nThey never disappoint...", "author": "Robert O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-25", "description": "Wow... management needs to seriously reconsider who they hire to deal with their customers. I called the other day to order a pizza for delivery and the guy that picked up lacked so much in his customer service skills it was laughable. No greeting when picking up the phone, voice barely audible and monotone, and just sounded like the most depressed person on Earth. And when we finished the call not a \"thank you\" or \"good-bye\", just simply clicked after I (as the paying customer) said \"thank you\"! Haha really?! Who does that?  I don't expect them to be bubbly or even necessarily friendly but standard phone etiquette is expected if you're picking up phone calls and dealing with people, one would think. But I liked their 30 minute ETA on delivery so i refrained from cancelling the order altogether and we gave them a try. \n\nPizza actually arrived in about 20 (quickest delivery EVER!) and we dove right in! I immediately wished we ordered a medium as the large was too much for the two of us. Maybe if it was a thinner crust it would have been fine but the crust was thicker than any NY style pizzas I've ever had. The quality of the pizza was pretty average. Not horrible but it sufficed for the night. However i just plain did not like the guy who took my order over the phone so I most likely wont ever order from EFNYP again.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "almost every time I try to go there, which isn't often to begin with, I just want a couple slices of cheese. I can never get that because they're always \"working on a big order\". They should atleast have a plate of cheese for those that just want that instead of just pandering to one group of people. This is kinda annoying.", "author": "Rion N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "Love, love, love their pesto pizza! Thin, flaky crust and no pools of oil is so worth the walk across the street from my house :)\n\nWent in around 9:30pm - it was empty, service was good and pizza was amazing. I got a slice of pesto and pepperoni. The sauce on the pepperoni slice was flavorful and they don't use government cheese on their pies! Hallelujah, holla back.", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-20", "description": "Temporarily closed for renovation as of 2011-01-20.\n\nI'll write something more useful once they let me trade legal tender for dough, cheese, etc.", "author": "Ken M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-14", "description": "Should be a 3.5* if Yelp allowed half stars.  \n\nCame to Escape from NY Pizza after a Giants game as it's very close to the stadium.  The pizza was decent and the price was great.  It hit the spot as we weren't looking for a full meal and you can buy by the slice.  \n\nI'd return if I was in the area.  Not bad.", "author": "Abhay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "They deliver, they are saints. They are super fast and have great people working there. My husband loves the meat ball pizza and I just had the \"you say potato\" it was so good, sometimes if you get potato and garlic on pizza they are under cooked but this was so perfect and flavorful. This is a great place to walk in and grab a slice of pizza too.\n\nOne time I called the wrong location and showed up to get my pizza, they had no idea what I was talking about, so they called the other stores found out what I ordered then made it for me and gave me a discount. I couldn't believe how cool that was. They will always have my business after that.", "author": "Raquel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "I've used this location for delivery service for our office and LOVED it!\n\nThey're extremely good about honoring the delivery window (and the one time they ran late they called!)\n\nTheir online ordering system is a breeze, and I've never had a problem.\n\nThe service is always top-notch, and I love that I can get something for everyone because they carry VEGAN CHEESE.\n\nPizza is delish, great service, and nice to use a local company. \n\nWoo hoo!", "author": "Roachie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "BEST delivery pizza in the hood!\n\nIf you want the pizza of your life, go to Tony's in North Beach or Zero Zero. If you want a top option for quick, easy and delicious delivery or take-out...Escape is fabulous.\n\nI've tried their Upper Haight location and it was really disappointing. This SOMA spot dishes out a great pie with good sauce, quality crust and ingredients. Unlike other delivery pizza, they use good cheese - no nasty grease puddle in the middle of your pie! - the bottom of your pizza will be crispy and delicious, like it should be.\n\nLastly, their pizzas are huge. Maybe I'm used to be ripped-off by artisan joints, but their large kept us (me, bf) going for 2 days. And that includes breakfast.", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-16", "description": "Nothing beats the gourmet pizza at Escape From New York Pizza, but all their other pies are pretty damn good also.  I use to go to the Haight Street location all the time, but I've just grown tired of that locale.  I much prefer the location at Harrison Street now.  It's as small as the Haight Street location I'm accustomed to, but this location has a 36' inch TV screen with cable....helllz yeah!  They've only got a few tables so at lunch their pretty full.  The best time to go would be after lunch and just before people get off work (9-to-5'ers) if you want to grab a seat and watch some tube (PTI, SportsCenter, etc.)  Good bunch of people that work here too...", "author": "Jules S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-04", "description": "Good pizza but if you're open till 11 serve pizza till 11. Ran over and got disappointed hard when they closed 15 minutes early.", "author": "Alex N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "My boyfriend wanted to check out the Haight Ashbury district on our visit to SF. As we were walking around exploring the shops we stopped in Escape From New York Pizza to grab a quick bite to keep our energy up. We both got a drink and a slice (I got mushroom, he got pepperoni) for less than $15. HUGE slices, thin crust NY style pizza cooked perfectly, not overly greasy, great for a quick bite!", "author": "Dana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "Not sure what Doug G is smokin' but the pizza here is good.  Is there better?  Sure.  But it's far from a hot pocket and there aren't a lot of pizza options in the area that are close by for me.  Maybe some of you had a bad cook or something but whenever I get a slice from there for lunch it's always good.  And I am able to fold the crust and eat it like a real pizza.\n\nToday I had the pesto chicken, salad and drink combo.  Very good as expected.  Fresh ingredients and nice and crispy crust but not rock hard where it would fall apart when folding it.  \n\nIt's a simple lunch favorite and they do it right and it's a good value.  But if you are looking for filet mignon I suggest going elsewhere.  This is pizza and it hits the spot when you want pizza, period.", "author": "Gary L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-06", "description": "Just tried to order the pizza and worst customer service skills ever! He had so much attitude on the phone I ordered from some where else. Sorry I was going to order over $100 worth of food but, no one wants to deal with attitude.", "author": "Alissa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "Escape from New York Pizza is becoming one of my favorite pizza places in SF. They have both thin and thick crust, both are pretty good. Very fresh ingredients and they deliver!\n\n+ they deliver late for those late night pizza cravings BUT\n- they close at 9PM to dine in (kinda early)\n- it's a small space, perfect for a quick bite, nothing more \n- convenient location", "author": "Ivannia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-15", "description": "Well, I just moved from NYC to San Francisco almost a week ago.  My GF and I were busy unpacking and didn't want to be bothered with going out for dinner, so we decided to order from Escape from New York Pizza for some NY style pizza.  \n\nMy first thought when ordering, was the prices seemed high, but from the reviews, it seemed like a lot of pizza, so I was ok with it.  \n\nWell when the pizza arrived, I was not disappointed in the size of the pizza (large).  It could feed 3 reasonably hungry people.  (If you are a New Yorker, ignore the slice count they provide with the pizza, these are not on the same scale as you would find in NY).\n\nSo, how is the pizza?  Well, it's not bad.  Not bad by any stretch of the word.  It, however, is not NY style pizza.  That's not necessarily a bad thing, but it is when you want NY style pizza.  I think the main problem I had with the dough is it is too thick and the pizza wasn't really foldable, which might be due the to thickness or the size of the slice.\n\nI'll order from here again, just not to satisfy my itch for NY style pizza.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "Now the third time I have tried this location and every time the bottom is burnt. Other locations don't have the same problem This was the last chance at this location.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "Ingredients were good. Veggies were very fresh. Delivery was speedy. Delivery guy was friendly.\n\nThe crust was mediocre. Too crispy at the perimeter to fold without breaking it, and too flimsy in the middle to eat flat. Flavor on it was good. But you should be able to do one or the other. Either it should be stiff enough to eat flat, or flexible enough to fold, and this was neither.\n\nIt's a 3.5 star kind of place, but I will be kind and round up to 4 for the quality of ingredients.", "author": "TJ P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "Fast and free delivery service. Used their website to order everything and pizza was here in ~20mins and i got 20% off.\n\nThe pesto chicken was good, not great. Ease of ordering and speed will keep me coming back.", "author": "EM S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-29", "description": "The pizza was great, and the delivery fast as well. Normally I would give them a higher rating (4 stars maybe?), but the delivery guy pissed me off royally. \n\nDude, I know you work for the tip, and I'm sure sometimes people shortchange you. But I was going to tell you to keep the change anyway if you hadn't turned around and started running the second you grabbed my bill. Thanks to that, the next time we want pizza from this joint we'll simply walk downstairs and grab it ourselves. I'm more than glad to tip for service, just not for attitudes like yours.", "author": "Pablo D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "Came with the $1 for $10 LivingSocial deal, along with a million other people. The staff was organized and cheerful dealing with the swarm of cheap-o's, and really took advantage of the marketing opportunity.\n\nThe pizza was pretty good too-- thin-crusted, not too greasy, a nice bit of char on the bottom. If I went again, the only thing I would ask for is a little lighter cheese and heavier sauce.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-19", "description": "This has become our go-to pizza delivery. I love a good NY style pie, and this place is no slouch. Thin, but not too thin. Crispy, but without sharp edges that cut the inside of your mouth. \n\"The Gourmet\" is worthy of praise- sun dried tomatoes, spinach, feta cheese- swap that spinach for some basil and you have an unstoppable combo. *Be warned that if you order roasted garlic as a topping, they don't skimp. Make sure your calendar is free for the next few days.\nI ordered a large pie the other night and it fed my hubs and I for dinner and lunch the next day. Hugeness. And it reheats nicely in the toaster oven on day 2.", "author": "Carnley P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "Tasty BBQ pizza: very good.  Free delivery and came fast. Will be ordering again.", "author": "Cam S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-12", "description": "Lunch here was pretty disappointing. \n\nPros: \nThey sell pizza by the slice. \nNo wait.\nThe meat pizza tasted ok.\n\nCons:\nThe pizzas on display didn't look appealing. They just looked sad. \n$4 for a thin slice. I could've ate 3 of them and not been full.  I ended up getting a 2nd lunch b/c I was still hungry.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "Great pizza and awesome delivery service!  We were staying at the Palace Hotel and the kids were having such a great time in the pool, we decided to order delivery. Found these guys on Yelp and thought we'd give them a try. Not only was the pizza piping hot, tasty  and delivered in less than 30 minutes, they also delivered the pizza to the pool at the hotel!  I highly recommend them and would get their delivery pizza again.", "author": "Marla P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "LOVE this pizza!!  It was hard for me to find good pizza out here, but this place really hits the spot!  It is a little on the pricey side.  It's definitely not your \"I just want something cheap for dinner\" kind of place.  The sauce is amazing and there are endless toppings to choose from!", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "Pizza delivery options for me in SOMA are pretty limited.  There's Amici's, which is usually really dry, and Orgasmica, which isn't bad, but not great.  I can also order from Patxi's in Hayes Valley, but for someone who has been eating Zachary's for almost 20 years, there's no comparison.\n\nEscape is decent, but still not what I'd consider authentic NY-style pizza.  But I'd order this before Amici's.  The sauce is a little sweet, and the crust isn't as good as Orgasmica, but sometimes you just want to pizza that doesn't try too hard to be eco/organic/socially-aware/gourmet.\n\nPROS:\n- Fast delivery, no hassle\n- Interesting menu - I'll have to try others\n\nCONS:\n- Crust is a little doughy\n- Sauce is on the sweeter side", "author": "Drew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "I have ordered my custom pizza here a few times, its darn good i have to say.  Try is: XL pepperoni and olives with half pesto sauce.  Hmm its good, price is on par, maybe some discounts after like 5 pizzas or something would be nice.  Delivery is fast, and they seem to know what there doing, no lost and confused guys.", "author": "Tim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "I normally order from Amicis sometimes Extreme and once and a while Escape. Last night we decided to order from Escape and ordered a pepperoni pizza. When it arrived it was a cheese pizza and as I was getting ready to call I noticed how good it looked. So we had a slice and it was awesome. Thin crisp crust! The pie was gone in no time. We enjoyed it so much we didn't even report it. Today I walked over to their new restaurant on Harrison and got a slice of pepperoni and it was equally good. Not very many tables but being able to walk up for a slice, I am very excited about. Escape is back on a more regular rotation in my household and will be a good place for a quick snack.", "author": "Russell D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-05", "description": "Food poisoning over 4th July holiday.  Ordered 1/2 bbq chicken, 1/2 pepperoni pizza on 7/1/15.  It was the chicken (partner had no issues with the pepperoni side).  Violently ill for 48 hours...never been that sick in my life.  In hindsight, since we ordered right before closing time so I can only assume shortcuts were taken.  Hope this was an anomaly.", "author": "Nicholas P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-25", "description": "I did enjoy the thin crust that was crispy and sturdy enough to hold my pizza together. Moreover, the point system to work towards a free slice is a nice incentive for those who frequent the area in attempt to grab a quick bite during lunch or evening munchies.\n\nHowever, what made this place mediocre was the lack of flavor from toppings and crust (fine for those who like cracker like crust). \n\nOverall, this place was mediocre and neither impressed nor dissatisfied.", "author": "Casey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "Love, LOVE! their 'You Say Potato' potato garlic pesto pizza.  I don't eat much pizza so I don't know if this is NY pizza.  It's just a cheap-o delicious pizza joint.\n\nBeen here many times, including getting in on the $1 for $10 LivingSocial deal!  Heyo!", "author": "Erika C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-09", "description": "Ingredients for the salad seemed fresh, but the pizza left something to be desired. The big meat pizza didn't wow me. Also, the person who took my order over the phone had a real attitude.", "author": "Debbie Chiou S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "For the price, quality and fast delivery it is very solid for SOMA... I've had patxis and goat hill deliver and they lagged a long time / or something was off about pizza ... Escape in soma is very consistent, always parking at night for pick up- classic pizza cool price", "author": "John O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "Great place for a quick slice. I recommend eating your slice immediately to maximize toastiness. No need for a box, just have them put it on a plate for you - heck, you don't even need a plate!\n\nIf you're dining in, you can get a beer for $2 when you buy a slice.", "author": "Dave P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-09", "description": "Recently opened so it looks new and clean.  Not your usual store front, but nice and low key that fits the area well.  I tried a pesto-potato and it was good but I should have stayed with my usual cheese ($2.98).  So for now, I'm giving them 3 stars until I return (which will be soon) and try the cheese.\n\nAlso why don't pizza places like this advertise that they sell slices on their on-line menus?  I know most people use them to order to go but why not put \"dine-in only\" next to them?  It never hurts to advertise.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "After a week of eating healthy, I experienced intense cravings for pizza.  It was a very specific craving: I wanted New York-style pizza, with the thin crust, stretchy cheese and greasy pepperonis.  And since there aren't many NY-style pizza places that deliver to my area in SOMA, I remembered someone mentioning that EFNY had just opened recently REALLY CLOSE BY.\n\nI looked online at their menu, ordered, and was told that the wait would be 46 minutes (what an odd number).  Less than 40 minutes later, my doorbell rang and my pizza was here!  My glorious hot, cheesy, medium pizza with pepperonis (the total plus tax was about $17) was here!  I tipped the delivery guy, and he seemed really surprised.\n\nThe pizza was exactly what I wanted it to be: thin crust that didn't completely fold and droop when I picked it up, topped with stringy gooey hot cheese and slices of pepperoni.  Everything was perfectly spiced and baked, and a medium was enough for 3 meals (I suppose I could've finished the whole thing in one sitting, but that would've negated a week of working out).\n\nOverall, it's my new go-to place for pizza delivery.  I'm so excited for the next time I crave EFNY!", "author": "Tori S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-04", "description": "I have never had a bad experience here but I have waited quite some time for a slice of mediocre pizza.It's not bad if you're in New York I'm sure, but here in SF it fails in comparison to other delightful pizza choices.  keep trying Escape.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-28", "description": "It's easy because it's just down the hill from my office. And (unlike a certain hircine peak place around the corner) they actually staff the storefront and post the menu. But I've been overcharged here so many times it's embarrassing. You think I'd remember to count my change by now...", "author": "Brian W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "This pizza is sub par at best - even in SF where bad pizza is the norm. Calling it NY pizza (where I'm from) is an absolute lie.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-09", "description": "Their pizza didn't exactly escape from New York, but it's pretty good attempt! I order from the Polk/Russian Hill branch and am pleased by their service, and quality. The slices are pretty hefty - more bang for your buck. I'm a fan of their \"You Say Potato\" pie. I add roasted red peppers to it - delish! The salads are the best I've had from a pizzeria - the Spring Mix is a stand out. Much nicer than the basic lettuce-with-a-few-tomatoes-and-olives-thrown-in salads I've gotten from other places. From a Large sized salad, you can easily get 3 big servings. Their menu is definitely a keeper in my rotation of take out options.", "author": "Barbara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "There is an amazing coupon deal. This location was pretty empty around 1:30 PM. The service was pretty friendly. The food was ok. Not the best ingredients but certainly not the worst. This was a good deal altogether.", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "This place  is just what you can hope for to get a quick bare-bones lunch.  They have some fresh pizza varieties ready by the slice.  They can usually make a custom slice in just a couple minutes.  It's the kind with the hard crust.  The prices are reasonable.", "author": "George G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-03", "description": "This is the only edible pizza in SOMA, and they deliver rather late, which is awesome. Their ordering process is clean and effective. Their product has been very consistent.  Not great pizza, but I'd put it in the top 5% of San Francisco 'za (I know, that still doesn't say much). \n\nWaaaay better than the crappy goat hill that used to occupy this spot. This is a weird spot, and I'm not sure if EFNY will last. The building owner keeps pizza places in the spot so that the real money winner, the 18+ dance club, can say they sell enough food to keep serving alcohol while having an underaged crowd.  I hope it lasts, at least until my lease runs out!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "Thank God! I was out of the Escape delivery zone but now...hot digity!\n\nBest delivery Pizza around. Much better than other places that deliver in SOMA. Thanks New York refugees.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-17", "description": "Best chain pie joint this side of the mississippi! \"you say potato\" is the best concept pizza around- pesto sauce and fresh cheese topped with thinly sliced and seasoned red potatoes and fresh garlic, BOOM! Now you've got yourself a pie!", "author": "Marv C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-16", "description": "The slices were tasty, though a little burnt on the bottom.  The staff was very friendly and attentive.  I would come here a gain.", "author": "Ed H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-15", "description": "Had a slice of the freshest-looking pie available (most looked hours old). It was SWIMMING in grease. Cannot recommend.", "author": "Edna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-26", "description": "Ordered a pizza for delivery at 7:45pm. I called them at 8:45pm and they said the pizza was on its way. I called again at 9:15 (place is only 0.4mi away) and they couldn't find my order at all. Finally they said they would bring it by in 20 minutes. When I eventually got my pizza, they would not accept my Yelp Coupon...after all the trouble they put me through I decided to return their pizza.", "author": "Desiree L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "Now getting EFNYP again at our office, I must say that their Gourmet Pizza is totally bomb!! My coworker also ordered their meatball sub (claiming it would be healthier than the pizza we ordered, HA), which looked super cheesy and meatball-ish. If I ate red meat, I would be all over that...or even better maybe I should jump back onto the meatball train...mmmhm. They also always supply us with plates, and tons of parm cheese to sprinkle on our pizza.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "If you're looking for some good pizza with no frills, this is your spot.  It really was quite tasty.  We ordered a full pie to split and just walked there, picked it up, grabbed some drinks, and sat at one of the tables.  This particular location wasn't busy and was super small, but they are hiding all over the place in SF.  There really isn't that much to say other than if you're looking for some bangin' pizza- hit this place up!", "author": "Kat L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-09", "description": "Thank you for confirming what I've long suspected.  Yelp is retarded and reviewers are nuttier than a fruitcake.\n\nFolks, this isn't exactly a tough one.  It's not French Laundry or Chez Panisse, etc. \n\nIt's a mediocre pizza joint that serves 'C' grade pizza.  Sure, it's edible.  But barely above a DiGiorno or something out of the frozen food aisle.  It's crap, basically... but filling and reasonably satisfying for the price.  In a blind taste test I doubt I'd pick it over pizza from a school cafeteria (which could easily be better).\n\nBut boy.  You'd never know this from reading the comments on here.  Some sound like they were written straight out of pizza heaven. \n\nErika C. gushes - 4 stars, I \"love, LOVE! their\" pizza.  This joint is \"delicious.\"\n\nVicky L. is glowing all over - this pizza is \"exactly what I wanted it to be\" .... \"perfectly spiced and baked.\"\n\nNatalie H. says it's \"fabulous.\"\n\nAnd not to be outdone, Brian D. claims \"best delivery pizza around\"..........\n\n\nBest pizza around?  Perfect and fabulous?  Folks, what brand of drug were you smoking before eating this stuff?  \n\nYou are overhyping a pizza that is entirely mediocre, in every respect.  Calling this the best pizza around is like calling McDonalds, the \"best hamburger ever\" or similar such nonsense.  It's just not a reasonable conclusion to reach, especially in this city, which has so many fresh and innovative ideas when it comes to pizzas, with kitchens exploring farm fresh ideas and truly great pizza restaurants that feature superb doughs and exciting new combinations of ingredients.\n\nI don't know.  Maybe to you, hot pockets taste like filet mignon.  Or, you just don't get out very much.  Whatever.  At any rate, for the rest of you out there, you'd do well to order this for your kid's soccer game.  But if you are looking for some fantastic pizza experience, my advice is to keep looking.", "author": "Doug G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-23", "description": "My husband had said good things about this place after stopping in for a slice, but after we ordered for delivery and weren't impressed, he thought, maybe he was just really hungry the first time he had it.\n\nI will say there were VERY fast in getting it to us, I'd say about 30 minutes after we called it was at our door. With that said, the pizza was undercooked. I actually heated up in the oven the next day and both my husband and I agreed it was much better, but still not great. I don't think we'll be going here again.\n\nWe ordered a large, wanting to have some leftovers, but the pizza was huge. We each had 2 slices and then we must have had another 8 leftover. We didn't even save them all. We also ordered a salad and I think it came out to about $35. We got pepperoni, tomatoes and bell pepper.\n\nWe don't order delivery/take out very often, partly because it's always disappointing and we won't be ordering from here again.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "This pizza isn't greasy or limp like usual New York pizza that I've experienced. Its thick, has great toppings and it was delivered fast. I'm definitely a fan. I will be ordering again. This time I ordered the New York Pesto Chicken- yummy :)", "author": "Shardie' T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-24", "description": "Had 2 pieces to go today. Awful. The box would've tasted better! Also slow service! I paid $11 for 2 pieces of terrible pizza & a large coke! Will never eat here again!", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-29", "description": "Pizza was ready fairly quickly after ordering.  But it tasted awful.  We ordered a simple veggie, and it made Domino's look like gourmet cuisine.  Tasteless and mass manufactured is the feeling you walk away with. Not to be repeated !", "author": "Shruti Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-14", "description": "I remember going to the Escape from New York near Golden Gate park and the you say potato pizza being one of the best slices of pizza I've ever had. I got 2 slices from this newly opened location and definitely was not the pizza I had remembered from that one time. It wasn't terrible, but it wasn't good enough for me to come back and get it on a regular basis.", "author": "Danny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-31", "description": "I escaped from NYC in 2010 and after eating pizza all over this town (SF) I have to say they have the best pizza going.  Place is clean, people are friendly but the pizza is great! So if your looking for a good pie, stop on by, if your looking for more try another door.  (I just made that up.)", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Thin and crispy, and their pesto pizza is delicious! I've never done delivery, but they're always quick and friendly for takeout.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-01", "description": "I tried Escape from New York for the first time last weekend. The pizza was fabulous. (Try the 'You say potato') I'm giving them 4 stars though because the delivery took FOREVER! (about 1 hour). Considering I ordered 1 large pizza, I thought that was a bit ridiculous - but perhaps that's just a testament to their popularity.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "Tried it out for the first time and we were pleased.  The person taking my order was friendly.  Delivery on a Sunday evening was less than 45 minutes, and the pizza itself was delicious!  Thin crust, but not too thin that it could not withstand the toppings.  We ordered a large, which was more like an extra large.  The prices were great and they sent us coupons, as well.  I think we will definitely be ordering the next time we have a craving for NY style pizza.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-11", "description": "A little pricier than we expected, but solid ordering and delivery process. The pizza is good, not the best. Our biggest complaint is that the sauce is too sweet.", "author": "Belén T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-11", "description": "Combine an overly alkaline crust with a ridiculously acidic sauce and you've got a really bad imitation of New York street food that costs entirely too much money. Dip some Saltines in a jar of Classico and you'll basically get the same experience for pennies on the dollar.", "author": "Nicholas J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-10", "description": "Worst pizza in Soma. delivery was promised in 40 min they took 1 hour, When the order came the delivery guy didnt have the full order and blamed the store even tough I specified and double checked the order. He promised to return with the rest and never did. The pizza was not very hot and  burnt around the edges. The topping was good but the base tasted and felt like cardboard. I want my money back!", "author": "themba l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-22", "description": "Pretty good slice.  I love NY style thin crust.  Its especially tough to find in SF where places make pizza too fancy...   I just want aregular slice...this place has a few posh pizzas but cant go wrong with cheese or combo!", "author": "Naji E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "They just added this location in SOMA on Harrison where Goat Hill Pizza used to be.  The website doesn't show the address but they are up and running.  I  After a long drive home from Tahoe we needed a good pizza delivered so we could relax and unwind.  I usually order Xtreme pizza because the toppings are awesome but I got tired of their slightly rubbery crust so I tried EFNY instead.  Good decision.  The toppings are fresh and the crust is much better than Xtreme pizza.  Looks like we have a new go-to pizza place in SOMA.", "author": "Kris N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "As a New Yorker I completely agree that this is the closest to New York-style thin pizza I've found. (Amici's isn't bad, but Escape is better and its pies are larger for the price.) The new SoMa location is great because the 333 Bush location stops delivering to my apartment after about 3pm.", "author": "Yeechang L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-17", "description": "the pizza's OK for what it is. you want to come here and check out the *bathroom*, which is in a discoteque in the back. that plus the gemology display and baseball theme add to the WTF factor. this is a very clean restaurant: they got a 100 from the health department. it is just regular pizza, though, and too expensive for what it is.", "author": "sellMyFing n."}
