{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "**********DISCLAIMERS**********\n\nI'm giving this 5 stars because we personally had a great experience, but I want to be clear that there are some serious disclaimers. I've read a lot of the other reviews and there seem to be some ethical discrepancies in terms of skewed reviews. I'm not sure if they're true (I wasn't aware of the 15% discount thing until I read the Yelp reviews), or if the restaurant is responsible for the hacked account. Maybe they've also gotten better, but I would definitely advise you to be cautious anyway and maybe pay with cash to be extra careful. If it happens to be true that someone's account was hacked/a 15% discount is given to 5 star reviews, please please to the restaurant: you don't need bribery or sketchy business practices to support you. You have an adorable shop with great food and good service. You can be a 5 star place on Yelp on your own merits!\n\n**********ACTUAL REVIEW**********\n\nNow, for our experience: the food came fast! This place is super cute on the inside and they play good, chill music. We got the tiramisu, strawberry shortcake mini toast, and the s'mores half-waffle. The s'mores waffle had nutella on it and it was exactly what you'd want it to be (absolutely delicious with big fluffy marshmallows). The toast tasted like toast and jam at breakfast only 100x better! The tiramisu had a good texture and was enjoyable. It wasn't the best tiramisu ever, but that's okay because this isn't an Italian restaurant. I also had the rose latte which was pretty good, and very foamy (definitely instagrammable).", "author": "Claire C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-31", "description": "Came back here after many years later, desserts are bomb as usual but service omg.....\n\n\nMe and some friends order the coconut sogo dessert, 3 of them and some chicken wings.\n\n10-20 mins later the wings come waits 10-15 mins no sago waits another 5 mins still nothing. We ask the girl server where is our sago and she said \"oh so sorry thought you only wanted the chicken wings\" then wait another 10 mins or so then the sago comes 2 of them instead of 3 we tell the server \"umm we ordered 3 not 2\" she reply's \"omg so sorry I thought 2\" then 5 mins later it comes.\n\nLong story short she messed up our order Twice like what the F...... maybe if you stop focusing on taking selfies on your phone or whatever you were doing then you wouldn't have forgot our order.... \n\nWant to give this place higher rating for the good food but horrible service, one of the worst experience ever anywhere....", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "A picture is NOT worth a thousand words when food is the topic\n\nAt the midsummer's night hangout, my cousins and I found a parking spot (for free) right in front of the restaurant (lucky us!). We walked into the restaurant excited about the dessert that I spare a portion of our stomach for after a big dinner. The shop was rather small and snuggle, with barely any space to stand. That was okay, because another group of 3-4 people waited outside in the cold, while we did not. \n\nWe ordered the hot tofu, to warm up our happy heart. The waitress said we needed to wait 15 minutes because the dish ran out. We agreed to wait while signing up on the waitlist and stepped outside into our car to wait. The next wait did not go long; she called us in within 3 minutes. \n\nAlthough one thing I personally rather pissed about didn't come from the service itself but the etiquette of the customers. Many tables finished and paid, however, they superglued their butt onto the seats and didn't leave, while others waited for their turn to eat. Like I said, the shop is little so after you eat and enjoy your food, leave and let others enjoy theirs too. Don't stay in your selfish shell and ignore others' suffers. \n\nMy mom makes delicious soft tahu (tofu) and I like to compare those I bought to hers. To my expectation, anything I bought is worse than my mom's. There isn't ginger nor caramelized syrup. This soft tofu consists of solely tofu and nothing else. For $5, I bet they profited about $4 from it. I think another reason why it costs so much for so little is the cute container it comes in (which I cannot take with me). Deceiving the eyes, any pictures here, that does not compare the container to their hand, makes the the portion looks huge like around 6-7 inches. It's smaller than a bowl, I'm telling you. I didn't order their toast because it was cold but I thought they looked pretty tasty. Anyway, I may come back to try something else but the tofu.", "author": "Trinny T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "What the hell, came here only to discover that it's not open like Yelp said it was!! I guess business hasn't been good so they altered their hours -- doesn't open until 6pm!!", "author": "Cathrin P C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-18", "description": "Came here at 8pm on a Friday night (prime hang out time) to wait for our iPot reservation LOL, and were seated immediately... probably because we were the only ones in the restaurant lol.\n\nThe GOOD:\n+ A lot of seating. \n+ Fair prices (3.95 - 6.95 for an average dessert)\n+ The place was fairly clean. And if you like seeing pink Paris/Eiffel tower pictures and decor everywhere, this is the spot for you lol.\n\nThe MEH:\n- even with no one in the restaurant, we were served and attended to quite slowly. The server/cashier was never in sight, and it took a while to call the server for our check and ketchup, or anything else.\n- the desserts lacked any wow factor. Usually i'm really excited to have dessert and taiwanese places like these usually do something extra to make a statement or make it look cute/ extra appetizing, but it was quite plain here. Please refer to the pictures. \n- Decorations were too pink and PARIS-ey for my tastes. It's like they wanted it to seem a bit boujie-er, but didn't have the good looking desserts to back it up.\n- There's a $3/person requirement, which the waiter didn't tell us about until we asked for the check.", "author": "Vy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "There are quite a few pearl tea joints around this area, but this place is good if 1.) you want a place to sit and chat and 2.) you are hanging out with people who don't like boba (AKA blasphemers). The menu us quite extensive and has both sweet and savory options, so chances are you'll find something for every tastebud.\n\nRating Breakdown:\n1/2 Stars for Taste --\nThe desserts here aren't anything to write home about, but they're decent. My favorite is the hot almond soup with black rice -- the perfect dessert on a cold day if you don't want something too sweet. The brick toast is also good, though I've only tried the mango pyramid toast. It's cubes of thick toast, buttered and griddled so it's crisp on the outside, warm and soft on the inside, then generously slathered in sweet cream and syrup then topped with a scoop of ice cream. Sweetness overload for those cheat days. \n\n0.5/1 Stars for Value --\nThe drinks and desserts are slightly overpriced but that's understandable considering it's a sit-down establishment. Most milk teas will probably run you around $5 and a brick toast will be closer to $10. Also, they charge $.30 to use a credit card.\n\n0.5/1 Stars for Customer Service --\nThis place gets kind of busy and it's usually run by only one or two people at a time. Sometimes it's hard to get the server's attention, but generally the food comes quick. \n\nBonus star because this is my go-to place after dinner when friends are visiting and we want to find somewhere to sit and catch up.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "Went here with a few friends for dessert after dinner. I would have to say it wasn't worth the 4 stars they show on yelp to me.\n#1 I don't like when businesses will give you 15% off your bill if you give them a 5 review.\nI feel that if you want a good review you should do a good job. Therefore just because I am giving them only 1.\n#2 the desserts were just ok and over priced. Most dessert places are overpriced for what they are but I guess that is the name of the game", "author": "Austin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Came here and got the matcha honey toast mango black sticky rice.\n\nFirst time I had honey toast, it takes 15 min but it's worth it! Was pleasant surprised as the inside had really crunchy bread. A little sweet and when you bite into it, the bread just shatters (in a good way) the rest of the toppings are all whatever, but the inside and the toast itself really stood out. The cold and liquid toppings with the crunchy toast was a great balance.\n\nThe hot mango black sticky rice dessert was good. Mango was really tasty, just wish the sauce had more condensed milk in it.\n\nI wasn't a fan of the decor as it seemed like it was trying to be too cute.\n\nThe novelty of the honey toast might wear off on me, but until then this is 4 stars.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "Good and friendly service staff! I got the matcha green tea ice cream and red bean Belgian waffle and it was decent! The presentation is very well done for sure, but quality and taste of the desserts were debatable. I went at 4 pm on a Sunday afternoon and there were 2-3 other tables seated too. Matcha green tea ice cream wasn't very sweet and the waffle was definitely not a Belgian waffle which was quite disappointing... \n\nSmall area, a little dirty and the facilities probably needs a facelift. However, their menu is very expansive so there's a ton to choose from! Cute place to go on a date and go Chinese grocery shopping later", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "Everything else was closed except this spot when I walked by after 12AM. I wanted something savory, so I got the spaghetti with meat sauce and the bacon wrapped sausage. The sausage is hot dogs. The spaghetti was not the best I have ever had. But it satisfied my hunger. I had this place bookmarked.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "*************I NEVER WROTE THIS REVIEW************\n\nCan someone explain to me how you used my account a review for this place?!?\n\nI've never even been to SF.*****************\n\nCreepy, and says a lot of the quality of your stuff. \n\n***********", "author": "Dana A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-24", "description": "Honestly, I found ETC to be nothing special. Sure, the walls are candy pink and they have popular Taiwanese/Hong Kongese snacks and desserts like brick toast and popcorn chicken, but eh. It's a tiny joint that feels stuffy (especially with the way the owner/host stares at every table while they eat from the back) with some shady policies.\n\nIf there's a table when you get there, they sit you down and hand you your menus and a pitcher of water right away. A couple that got there right after we did were asked to wait, and the host shuttled them into a sterile white hallway to the side of the main dining room and closed the door on them. Um, sketchy much?\n\nWe split the mini macaron chocolate brick toast, partially because my boyfriend insisted he could not fit any more food in him after Tasty Pot, and partially because I couldn't justify paying over ten dollars for a couple slices of toast and a scoop of ice cream. The two macarons that adorned the top (chocolate and matcha, I think) were soft and perfectly bite-sized, and the scoop of chocolate ice cream was delicious. The toast just didn't stand out, even with the addition of fresh strawberries. So continues the hunt for a good brick toast in the city.\n\nAt the table, a small menu stand indicates that if you check in and leave them a 5 star review, you can get 15% off your bill or a future bill. That's against Yelp policy, last I checked. We realized as we were eating that it would have been cheaper to build the same brick toast, and add some condensed milk or whip cream for about the same cost. I doubt it's a good value for what you're paying, and I think the only people who'd really enjoy it are the ones who don't mind someone staring at them intensely while they eat a waffle..", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "I had the boba milk tea and coconut milk with sago and both were excellent.  Service was fine.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-21", "description": "WARNING: REVIEWS ARE MOST LIKELY SKEWED!!!\n\nETC offers a 15% discount off your bill if you give them a 5 star review. That is most likely the reason for their high rating. I, however, shall not be bribed.\n\nCame here as this was the only place with available seating for dessert. It's new so still fairly empty. Place was clean and they offer a free dessert with Yelp check in. What you get is dependent on how much you spend. We spent at least $20, meaning we could get a free tiramisu. Wish we hadn't. It was store bought, freezer burned crap. Took one bite full of ice crystals and slop and pushed it aside. \n\nOrdered mango sago, almond sago, sweet tofu (tofu fa), and strawberry honey toast. Sago seem to be standard. Honey toast could have been sweeter with more honey. Not the best, but edible. The sweet tofu wasn't very sweet, even with extra syrup. They put way too much ginger in the syrup, so I didn't enjoy it.\n\nIf you're craving Asian dessert and everywhere else is full, this is a good last stop. But wouldn't go out of my way.", "author": "Mallory L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-14", "description": "Seems like they have changed the dessert chef or some of the standards have decreased. It's been awhile since my last visit and unfortunately the desserts have declined in taste and quality. I ordered a mango shaved ice and it was shaved ice in name only. The shaved iced was little chunks of ice particles that I found myself chewing and hurting my jaw. It wasn't smooth or a nice fine texture as it should be. The mango ice cream had ice crystals in it, a sign of ice cream not at its peak of freshness. Overall a big thumbs down. The place is warm and relaxing, and the service was friendly, so I will give 2 stars. The dessert took some time to make, which is another negative. I remember when this place was packed; now I see why it was easy to get a table.", "author": "Dom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "This has to be my favorite place for brick toasts in the city.. \nThey have a huge menu with a lot of different Hong Kong styled desserts (sago, waffles, sweet dumplings). I was surprised to see that they offer a variety of pasta dishes which looked good! Might have to try next time. :)", "author": "Leilani Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "The inside of this place is so adorable almost everything is pink even the walls. One thing I thought was weird is they were playing Rap music, although I was ok with music I feel it didn't fit the ambiance.\n\nDessert- mango sago 5/10 you can tell the mangoes they blended were soggy and getting ready to expire. \nAlso got a taste of the green tea mountain bread thing( forgot the name lol) 7/10. The bread soaked in honey was soooo goood! I would recommend this dessert. \n\nSome tips I have for this place are: \nChange the music to something more calm lol.\nPut ice in your water... it's too warm. Thanks", "author": "Camille B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-04", "description": "Wanted to take my mom out to desserts but wanted to try a new place rather than always being boring and going to our usual. We were seated right away as there was no one there. \n\nTakoyaki was def just reheated frozen ones that they charge $1.25 for each. Pretty sad as I can get some fresh ones at the Torrance Mitsuwa for like $5. \n\nThe sugar for the sweet tofu ain't even melted ginger sugar but rather some brown sugar they drop off at your table and I guess they only have the one cuz the girl had to come take it from us to give to the table next to us. The sweet tofu wasn't bad tho, it was pretty good. Out of everything we ordered, I think that was my fave. \n\nThe mini strawberry toast was sad and pathetic looking, no one was impressed.\n\nFondue was alright but the fruits sucked, they gave us canned pineapples. My brother really liked it tho. He thought it was fun. \n\nMajority of their desserts aren't even homemade, they're store bought and prices are jacked up. They literally skimp and shortcut their way here & then charge a lot for it. Definetely will not be back, I think we will be going back to our usual.\n\nP.S they prob have such hight rating on Yelp because they were offering 15% if you gave them a 5 star review, so people were prob just saying stuff to get that discount. Yelp has caught them on that.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "Every time I'm in Hawaii, somebody wants to go to Shokudo for honey toast. The honey toast here beats it by a mile.\n\nThe service is alright, nothing amazing, nothing terrible. It's the desserts that I'm more excited about! There are so many options and most of the items I've had here are enough for two people, especially after dinner.\n\nIt can get pretty crowded here sometimes, but so far I've only ever been when it's empty.\n\nFood: 8/10\nStaff: 6/10\nAtmosphere: 8/10\nValue: 8/10\nOverall: 7.5/10", "author": "Evan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-23", "description": "I wanted dessert one night. My brother and cousin didn't want to go to Golden Island or our usual place in San Mateo so a quick Yelp search led us here. \n\nThe inside is a decent size. The decor is super decked out in pink and it's all cutesy like and weird, but we stayed anyway for the dessert and we were able to hit 2 pokestops from the inside so... it was cool. Service wasn't much to brag about. It was one dude working the whole time and while it wasn't his fault, the food came out really slow. I had gotten an order of their fries, s'mores honey bread, and my cousin had gotten one of their waffles with fruits. Prices are okay for what you get, but the wait was ridiculous.\n\nFries came out piping hot, but somewhat salty. I did enjoy the s'mores honey bread as it was gooey and chocolatey. I think my cousin enjoyed her waffle. Also, really sad- we saw an old guy order a pasta to eat and when he asked for pepper, the worker gave him a container of what looked like it was filled with air. When he tried to shake some to put on his pasta, it looked like dust came out. It was very sad. How do you guys run out of black pepper?!\n\nOverall, come back? ... Not really. The service was slow and they require each person in the party to order something which doesn't always work out.", "author": "Venus L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Great desserts and open super late. I really enjoyed my tiramisu honey toast. It was so delicious and perfect. The other snacks here are also enjoyable. mmm I want to come back to try more!", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "Another one on my list of favorite dessert cafe's!\n\nThis particular cafe is more intimate and cozy inside. It kind of gives me a homey feeling actually, every time I eat there. I have tried several of their desserts before but what really stood out was their creme brûlée! I usually love it here, but from time to time, there has been incidents where the texture of it was inconsistent so I have had to send it back. :( Other than those incidents, it is actually delish.\n\nFood wise, I have only tried their pastas and their condensed milk with peanut butter sandwich. Both of which I have thoroughly enjoyed! I would definitely recommend this place to try since they are also open late night as well! \n\nThere are several poke stops nearby within reaching distance too, for those who play ;)\nThey take both card (charged with small fee), and cash!", "author": "Sunia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "Most desserts are expensive than other dessert places ! ETC Dessert cafe also charge tea fee when u just get in and sit down !", "author": "Bing L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Walking into ETC Dessert Cafe, I was immediately struck by the cuteness of the cafe's decor. It is the perfect setting for a tea party or hanging out with friends and catching up over an enormous serving of sago with mixed fruits. The latter is what my friends and I did. \n\nThere is a wide selection of desserts. Can't make a decision? Look for the items with a star to help you pick a popular dessert. This is exactly what we all did after 10 minutes or so of indecisiveness. We ordered the warm tofu pudding (served with brown sugar on the side), mixed fruit with mango sago, and something with mixed fruit, grass jelly, and red bean. The last two items I listed can definitely be shared between two people since the portions are huge. We were please with our orders. \n\nWe were one of three parties in the cafe late Sunday night. We were seated and served quickly. The cafe is great for groups.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "I like the pink color interior and the toast. Great for a late night dessert!\nGet the toast with ice cream and mango sago.", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-01", "description": "This cafe looks like Hello Kitty threw up with an explosion of pink and cuteness when you first enter.   The cafe is kind of small, kind of close seating and doesn't have a cozy feel to it. Typical Chinese-like cafe, especially with the Chinese songs playing in the background. The waitress was quick and efficient. Their menu is full of dessert choices ranging from hot to cold. They also have free wifi.\n\nSo, the 3 star isn't for the environment, but for the food. I ordered a green tea shaved ice that came with 1 scoop green tea ice cream, 1 scoop vanilla, red bean, a couple of strawberries and what I assume are small green tea mochi. This was the most mediocre tasting green tea shaved ice I've ever eaten. I'm not sure what it is. The presentation looks great. The mochi was hard and difficult to chew due to the coldness of the ice. The red bean kind of tasted like it was just there. The ice cream was fine. The strawberries looked good, but were sour. Somehow, everything didn't really taste like it meshed together well. \n\nI probably won't be ordering green tea shaved ice again.", "author": "Tabitha H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "Store front is a little hard to spot, I actually walked past here many times without knowing its existence! \n\nMarshmallow waffle- Presentation is great, waffle is ok but not amazing. Marshmallow is really soft but sticky, almost glue my upper and lower teeth together, and I personally think the marshmallow did not match very well with the waffle. \n\nmini brick toast with coffee ice cream- The brick toast is really fresh and the contrast of temperature and crunchiness from toast and softness from ice cream is amazing! \n\nmango sago with grapefruit- It's ok.The base taste milky and the texture is creamy, but not enough mango flavor, \n\nReally cute interior, lots of pink. I would say the tables are at an awkward height (too high) compared to the seats, making it hard to eat. Food is average but it is a great place to catch up with friends or have a date!", "author": "Karen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-30", "description": "First of all, the reviews on this place may be heavily skewed towards 5 stars because they bribe you with a 15% discount for a 5- star review. I don't take kindly to bribes, but I'll take your discount anyway! \nSecondly, this place offers you a free snack for purchasing up to a certain meal. We paid more than $20 so we got a free tiramisu. I always enjoy free perks! However, the tiramisu was a bit disappointing cause there were ice crystals in the cream so it was improperly refrigerated. \nFinally to the reviews: our table ordered 2 honey toasts, 1 mango tofu-fa, 1 almond paste sago. \nThe almond paste sago was pretty good. No better, but no worse than any other sago from other dessert places. \nThe mango tofu-fa was decent, but the mango didn't taste very sweet. \nThe 2 honey toasts were OK. Far from spectacular, but it is satisfactory. I've definitely had better honey toast elsewhere, but ETC is local so there are pros and cons. I do suggest getting a regular honey toast and splitting it with a friend rather than getting a mini so you can get more bang for your buck.\nConclusion: nothing stood out to me to make me come back here again, but I might come out of convenience if I'm not willing to go to Richmond for honey toast. Also, the discount for a review seems super sketch and turns me off from the place.", "author": "Edmund L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-15", "description": "Meh is all I can say. I would've given 4 stars originally but I would have to take off 1 star for the service lol. \n\nCame here tonight with my friend after work because we were craving sweets and were in the area. It wasn't busy at all but it did pick up a little after we started eating. \n\nParking - not that bad...there is metered and residential parking. Probably will be a lot trickier on weekends. \n\nService - not the best....it was my first time coming here so of course I had some questions about the menu. I didn't catch her name but one of waitresses was so rude and even rolled her eyes at me before she answered my questions. Now, I work in the restaurant business as well so I get that people may have one of those bad days but I was not even being difficult and I asked in the nicest way possible....She also messed up on my order and was really slow when it came to bringing our check. \n\nFood - \n1. Chocolate macaron party honey toast - my friend loved it. She was in chocolate heaven! \n2. Strawberry banana waffle - really good!! The fruits were fresh and the waffle was fluffy. I definitely approve! \n3. Fried chicken wings and fries - mediocre at best. Nothing special. Both were probably from the frozen section of Safeway or something. \n\nI would say definitely come here for the desserts but don't expect the service to be great or anything.....", "author": "Coco L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Love their waffles, nice and crunch! Also shaved ice is one of my favorite, as well! Wish they open all day instead of nights only.", "author": "Jaylene L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-20", "description": "I can describe this place as one of the string of dessert places open late in the avenues. I was captured by the pictures here on Yelp, that looked exquisitely amazingly. For dessert goers, this is a place for you, especially if you have a sweet tooth as big as mine. The ambience was slightly dim. I think they were trying to capture or match their menu to their walls, which was a little cute if I say so myself. Other than that, it took us a while to get service, about 15-20 minutes. I literally had to put my hands up and literally call him to get the servers attention. Once we finally got the service that we were asking for, we ordered their tea, mango pyramid toast, and their mango black sticky rice covered with coconut milk. \n\nUnfortunately, the pictures did not with stand the flavor of their desserts. Pictures here on Yelp were much better than the way the desserts tasted. First of all, the tea came out not hot at all. The mango black sticky rice with coconut milk had NO flavor (I don't know if it was suppose to be like that). I was slightly enlightened with the mango pyramid Toast, until I tasted the mango ice cream. I can clearly and definitely tell you, that is NOT mango ice cream. That was the most artificial mango tasting ice cream I have ever tasted! It was a bit depressing because it looked so pretty in pictures and once you tasted it, only the toasted tasted good. Not great, just good. \n\nOverall, I sadly have to only give this place a three star because of the wait and the taste. If the Toast had real good tasting mango ice cream with more mango pieces, I think I would've enjoyed it a little more. Will I go back to this place? I don't know, because it is one of the few dessert places open at 10 PM.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Lots of Asian desserts and drinks to pick from! Honey toast is my favorite!\n\nStrawberry \nMatcha", "author": "Alyssa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Very nice place to chill. \nGreat variety of food choices. \nNot just desserts but also noodles / pastas.", "author": "Jackylyn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "well... we wanted to try this place. they posted times of business on their door, but they weren't open at their designated time. we waited 15min minutes but no one came, and we didn't see anyone prepping or setting up inside. we'll just have to try this place another time. very unprofessional. maybe the opener has some of emergency or something..", "author": "Aiko H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-24", "description": "Nice place for honey toast. \n\nLimited seating area. \n\nThey charge 30 cents for credit card.\n\nSlow service, seemed like there was only one gentleman working.\n\nI ordered the tropical toast ..or whichever one that's filled with fruit lol \nNot bad, but I wouldn't spend $11 for dessert on a regular basis.", "author": "Danae L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "If you love pink things and Tigger, I've got JUST THE PLACE FOR YOU! The walk up to this place seemed pretty normal, but as soon as I turned around and my retinas were bombarded by the color pink.  I visited this pink establishment on a Wednesday night and was immediately seated.  We ordered the green tea ice cream pyramid toast.  It was very good; the toast cubes were perfect for absorbing the whipped cream mixed with green tea ice cream.  The presentation was great and was perfect for those who have to take a picture of every plate of food they devour. My only complaint was that the amount of ice cream for this massive pyramid was too small to accompany the cube toast.  Other than that, I would definitely come back to try other flavors and other items on the menu.", "author": "Alex J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Considering it was my first time here, and I had a major sweet-tooth at night...this was the nearest place suggested. \nAs you walk in, it is pretty small with minimal amount of seats. I do like the cute decor with the pink walls and framed quotes hung up. You can choose where to sit. I liked how the water jug was complimentary and brought to your table. \nAs far as what I ordered, which was the Matcha Red Bean Waffle, I loved it. I am glad my first try was a tasty one!! When ordering your waffles, you can either order Half or Full, price does vary depending on size. \nI've been told that this place is A-OK but to me, i thought it was great! Hopefully, as I do plan to come again, my expectations and hopes will not be lowered because I find this place to be tasty!! \nDefinitely coming back with a friend or a group of gal-pals!", "author": "Stacey M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "This place is great if you're in the area trying to get a late night dessert bite or some super tasty brick toast! \nI came here twice before and I ordered the same things as my last visit: brick toast, mango sago, and creme brûlée. \n\nThe brick toast is an absolute MUST. It's super good, crispy, melts in your mouth too, has icecream on top and you can choose from different types of toppings and etc. The creme brûlée was also yum. \n\nMy hot mango sago was also pretty good BUT when it arrived to the table, it had a hair in it (which is why I docked two stars down, cus that is just grossssss..)\nI sent it back and got a new one and it was fine. \n\nAnyway,\nThe place itself is super cute. Decked out in plushies on shelves and pink walls, pink menus, cute atmosphere. \n\nService is okay. Just okay. \n\nETC also gives free tiny desserts if you check in, depending on how much you spend.  \nAlso there's 15% off if you give a 5 star review. So beware of the skewed ratings. \n\nTl;dr The desserts are pretty good. Brick toast is the most worth it/must try if you o here. Cute atmosphere. Okay service.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "I can never resist an Asian dessert cafe, especially when they serve honey toast!! We shared the tiramisu-coffee toast - warm, buttery, toasted white bread layered with creamy tiramisu and topped with coffee ice cream. If it could have had more of a fluffy, soft interior the balance would have been perfect, but it was delicious regardless. \n\nWe also tried the mango tapioca dessert soup, a dessert that was new to me. It was lovely to have in a neighborhood that's consistently overcast. I enjoyed its warmth and homey essence, although it lacked some depth in flavor. Overall though, I got good feels from this place.", "author": "Hannah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "I love this place!! Not only because their walls are pink and it's my favorite color but it's very good here! Reasonable pricing and the workers are very kind! Sucks they open at 2pm but the closing time makes up for it lol! Been here twice and each time I left very satisfied and actually craving more!! My favorite has to be their toast box! Not too sweet but just right for a sweet lover like me!", "author": "Lina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Food tastes good, whats better is the service was great...\nGot a table right away with a super warm welcoming, food/menu is very unique, fair and reasonable prices, and was prepared to serve us extraordinary fast!! Will definitely return, you too should come visit this spot!!\n\n6 star if possible A+++", "author": "Mister S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "The smell, the charm, the desserts! Bring your friends, order a few of the toasts (mini size is a good portion) and enjoy the etc.....", "author": "James I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "Came back here two weeks ago and sad to say their menu got cut down and smaller. The portions you get are much smaller too! They used to have a lot of foods here but now it's mostly dessert and about 10 food dishes. This used to be my favorite dessert place but sad to say the service and quality has gone down significantly.", "author": "Ruby F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Yes to a place open late with desserts that's not in the Richmond area! \n\nI give it four stars for the fact they're open late and the desserts they carry. I used to live in the South Bay and brick toast was quite plentiful. In San Francisco, it's still taking its time to build roots. It was really yummy! I ordered the Tiramisu in regular, large enough for two to share. It wasn't overly sweet and textures were good, bread wasn't overly toasted. The piece of tiramisu that was on top was kind of disappointing. It didn't taste fresh or authentic. \n\nThe other dessert I ordered was the tofu fa. It's prepared fresh so it takes some time to come out. It has a hint of coconut in it, which is so delicious!! It is served with brown sugar so the sweetness is adjustable to your taste! \n\nThe service is average, no big deal. Be initiative to what you need and make it clear to servers what you want. \n\nNote: bathroom is a journey's away. I bet finding the wizard of oz was easier than finding this bathroom. You must leave the side door, climb stairs, turn left and go behind the wall (best way I can describe it). Bring your phone to be safe. Tad sketchy.... But workers are helpful and try to set you up for success :)\n\nI'll be back again!", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Came here with my friend last Wednesday night. We walked in and there was no one inside lol. Parking was semi hard on irving bc they blocked off the meter parking for construction or something. But anyways the guy seated us, gave us menu and water. My friend and I ordered the green tea and red bean brick toast & chocolate fondue! Both pretty good. The dark chocolate fondue came in this heart shaped bowl which was romantic haha. It came with bunch of fruits, marshmallows, and 2 waffles. Overall pretty good experience!", "author": "Monica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "My friend and I finished eating dinner and she was craving for asian dessert. We found this place through Yelp and decided to check it out. It seems like ETC Dessert Cafe is popular for its brick toast, but we decided to try the Dessert Sampler instead. We were full from dinner, but not too full for dessert - Dessert Sampler it is!  \n\nOur Dessert Sampler had fresh fruits, some sort of red bean jello dessert, tiramisu ice cream, and creme brûlée. My friend and I agreed that the tiramisu ice cream was our favorite. The other desserts were just okay - not bad, not spectacular. However, the presentation of the desserts was pleasing to the eye. The portion size was also good enough for two people to share.\n\nThe ambiance was cute and the place is a bit small. Walls were covered in pink and the cafe was playing \"The Best Love Songs in the 90s\". I was definitely jamming to M2M's \"Pretty Boy\" song.\n\nI feel like I would only go here again if a friend wanted to check it out. Maybe I'll try one of the brick toasts next time, but there would be other dessert cafes I'd first recommend to a friend before this one.", "author": "Kristal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "LOVE THIS PLACE!!!!! The decor in this place is also very cutesy. This place mainly serves desserts but they also have a few non-dessert items.\n\nFew tables inside but on a sunday evening around 6-7, there wasn't a lot of people. The waitress there was super nice. She was patient with us as she answered our many questions and gave recommendations. She was nice in giving us alternatives to things they sold out of.\n\nThe plating was beautiful. The dishes were delicious. I was in heaven. Most of what I had was very sweet so if you have a sweet tooth like me, you'll love this place. Otherwise, you might find it overly sweet.\n\nI recommend the honey toast here. Bread was toasted to perfection. Had that nice crunch and wasn't burnt. All the fruits were fresh and nicely cut. If ever in the area, should totally stop by for dessert!", "author": "Benita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Pretty good! I feel like the market for Asian dessert spots open late at night is pretty saturated in the Bay Area so I wasn't expecting much. Ordered the mango tofu pudding (I asked for them to leave out the sago, they kindly complied.) Mango pieces and sauce was sweet and ripe, tofu pudding tasted fresh-clearly not to packaged kind. Yum! Price is average. Friend got the fruit tea which was also delicious. Service was fine.", "author": "Crystal Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Mmmhhhmmm the macaroons are great! The mini honey toast was just exquisite! The bread was very soothing and comforting. The almond paste tofu pudding was very sweet and melt in your mouth. It was smooth and silky. This place is perfect for an after dinner desert!", "author": "Doudou H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "My friend and I each had our own mini honey toasts and we were both very satisfied with our choices. The presentation was lovely and the toast itself was delicious. Sweet, creamy, a little crisp...oddly satisfying despite the nippy San Francisco weather. The service is decent; however, because it is a very small operation, the food did take a while to arrive. It was not a big deal though, the waitress didn't rush us to order or to leave...ETC Dessert Cafe is definitely a nice place to hang out and catch up with friends. Fair warning though, it is a little drafty inside....", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-21", "description": "Came over on a weekend craving for honey toast. The good ones I had were in South Bay and I didn't want to drive down just for that. Sometimes I do, but not today. Not today.\n\nI've been to ETC Dessert Cafe in 2012 and I haven't visit since then. Over all, I like the idea of mini size Honey Toast because that 1) solved my cravness, 2) good price for good amount for 2 people and 3) less guilty for getting all these in my stomach so I sort of skip the gym ;) The mini one doesn't look as good as the regular but hey, that's not the point.\n\nI also ordered a mix fruit black tea, which was good and got these chopped fruits in my tea. The server was really nice although it was a slow night.", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-19", "description": "How does this place rated so well for 3.5 stars?\nThis place may look kind cute but....the Worst drink/dessert place ever. \n\nOur party ordered grass jelly milk tea, asked for half sweetness, came out still way too sweet. Couldn't taste the flavor of tea or milk. Very bad quality milk tea exact the kind you get for free when buying combo at some Chinese fast food restaurant.  \n\nTaro coconut tapioca dessert (hot)\nTasted old and very watery. Feel like someone just mixed those ingredients prepared long ago and heated them together. We were joking it tasted like porridge. GROSS !\n\nWe had another two orders of similar hot desserts. All the same quality just slightly different ingredient. \n\nTotal 4 orders came out around $18.5 which was way $$$ for such crappy low quality food. \n\nService was whatever. \nStay away!", "author": "Niki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "Wonderful place\nMy husband and I absolutely loved it! \nThis was our first time to try food like this, tasted amazing!!!\n\nWould def recommend and go back again!!!", "author": "Ovsick H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "My first time trying out brick toast and my boyfriend took me here. I liked how there was pink everywhere and some seats had flat pillows on them (comfortable butt = happy butt). I forgot what exactly I ordered, but it had the green tea ice cream and fresh strawberries and was on the first page of the menu (no add ons, because I did not think that they were worth the extra cost). \n\nI liked how the water came inside corked glass bottles, but the forks were so flimsy and low quality that I was tempted to bend the prongs back and forth until they broke. The wait after ordering was about 15 minutes. The toast was buttered and warm and the whole dessert ranked 7/10 on my happiness meter. For not being very fulfilling (I shared it with another person), I would have liked to spend less than $12 on it.", "author": "Vy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Nice place to have dessert at. Tried the mini strawberry sweetheart brick toast, remind me of what I had back in HK. Would definitely come again. 10/10.", "author": "Lawson J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-21", "description": "SUPER CUTE DESSERT CAFE!!!!\n\nFelt like a little kid all over again while walking into this super asian establishment. Pink walls, cute white and black furniture, asian music videos, and a lot of yummy desserts to choose from. Their prices are very reasonable too! \n\nThis place is pretty much like a restaurant for desserts. As soon as me and my friend sat down a waitress brought us glasses of water and handed us dessert menus. What made the place even better was that the waitress was super friendly. \n\nI ordered the waffle and fruit plate with Nutella on the side. So yummy! It had a perfect amount of vanilla ice cream on the side which made the dessert more desirable. \n\nThis place is ideal for simply grabbing some well presented desserts with a friend or even on a date with your spouse, especially late night on a weekend since they're open until 1:30 am. \n\nThere's something about little places like these that make me happy and feel like a kid inside :) Will definitely be back here more often when I'm craving yummy desserts for a cheap price and want to enjoy the cute ambiance.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "The best dessert in town. Try their famous Oreo banana split. I highly recommend it. Great food and dessert along Irving.", "author": "Ron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "So cute here! Dessert tasted amazing! Small place, but cozy! Friendly service! All of our desserts looked fantastic and wasn't too sweet.", "author": "RACHELLE T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-17", "description": "I have to say, I got excited because I saw on the menu they served hot tofu pudding which is super rare. I decided to order that and a honey lemon ice tea. \n\nI'm highly disappointed in my dessert and iced tea. For my tofu pudding, I was expecting to get a side of ginger syrup with my tofu since its bland and steamed. They gave me brown sugar which didn't taste right to me. I wished they listed what syrup/sauce they were going to use because I  basically wasted $3.75 on this since I didn't touch it because I didnt lole the sweetness of the brown sugar on my tofu pudding. It was suppose to be a soothing hot dessert to enjoy ):\n\nSecondly, my honey lemon iced tea was the last to come out  of my party of 6. DONT ORDER IT. It tasted like watered down unsweetened tea with a couple of ice and three sizes of lemon. Highly disappointed since it costed me roughly $3.50-4 for it. \n\nThe place wasn't super busy at all but service was so slow. Our waitress was nice but she wasn't attentive at all. The two stars is for her trying thought.", "author": "Valerie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "First time coming here and first off I just want to say the service is great. The gentleman with the tattoos was very kind to us and had great manners. I would give 6 stars if I can because of the great service here.", "author": "Trinh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Hidden gem within the best neighborhood in San Francisco. Delicious deserts, and usually easy to get a table during busy nights. This spot is A1. Great food, staff and service! Highly recommend.", "author": "Alvin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-05", "description": "Went around 9pm and it wasn't too crowded but the quality of the food isn't as good as I expected. There is definitely a bigger selection of desserts and the portion is pretty big but I wasn't as pleased as I thought I would be", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "I finally tried this place! After always passing by it and deciding whether it was really worth it to come here for dessert. It was pretty empty when I went, granted it was a school night. The seats in the booth though, they provide great back and butt support, especially after you indulge yourself with bite after bite of sweet desserts. Also, if you order over $20 of food, you can get either their Belgium waffle with Nutella and marshmallow, or a mini banana split. I tried the watermelon sago, tiramisu honey toast, and their free Belgium waffle w/Nutella and marshmallow. \n\nWatermelon sago: you can't really go wrong with this. Sweet watermelon juice with a generous amount of sago at the bottom. Although I would recommend getting it with mixed fruit too because it tastes adds a lot more taste and texture.\n\nTiramisu honey toast: the presentation was actually pretty neat. They smeared \"Etc\" in chocolate on the edge of the plate, along with a honey toast topped with a scoop of ice cream, a slice of tiramisu cake, drizzled with chocolate. This dish is pretty sweet, so make sure you have a large sweet tooth before tackling on this dish. I only wish it was bigger, seeing as the smaller size cost $7.50. Other than that, no complaints about it. You can't really complain about warm honey toast with ice cream and whipped cream.\n\nBelgium waffle w/Nutella and marshmallow: this was, by far, my favorite at this place. To you waffle lovers and you s'more lovers, strap on your seat belts and prepare for a wild ride. Combining these two was genius. If you thought Nutella on a waffle was good, get ready to add a toasted marshmallow on top, with a little whipped cream on the side. They cut them into small pieces so you can fit the whole piece in your mouth and get the whole Belgium waffle-s'mores taste. \n\nI'm glad I tried this place because it will be one of my regular asian dessert places from now on.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "Irving Street is packed with Asian dessert places, but ETC Dessert Cafe is leagues above its neighbors. Not only does it have an awesomely weird name, it is open later than the competition, the service is very friendly, and the drinks and food are great. I enjoyed my smoothie and the Toast with Strawberry and Vanilla Ice Cream. \n\nNext time I'm craving some late-night dessert, I'm just going to skip the rest and head to the best: ETC Dessert Cafe.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Great place！ love the toast, we had the Banana and Oreo honey toast. The toast is very crispy and full of the taste of honey!", "author": "Rosa Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "This is a tiny little place that you would miss it if you weren't specifically looking for it.  My daughter and I got fried calamari rings, mini tiramisu brick toast, teriyaki chicken ramen and iced fruit tea.  Everything was yummy.  We plan to go back again.", "author": "Aileen I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "We tried the teriyaki ramen and the oreo honey toast. The ramen was pretty basic, it looked like the packaged noodles. The broth had good flavor though. The honey toast was amazing! If I lived in San Francisco I'd be in here weekly. At first it's a weird flavor, but with each bite you get more and more addicted. Definitely a must try. Service was great too, she was super attentive.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Awesome place to fulfill all your sugary cravings.  Make sure to get toasted marshmallow on the brick toast!", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "I really like this place that dessert is really off the hook. For the amount that give you it is pretty cheap. Staff is very friendly and nice the food is worth it. I know it's a little teenybopper place where kids come and hang out and how did dessert and it's fine because it's probably what it's made for but I like this place to be a little more quiet a little more intimate to have a dessert or it could be loud but just not too loud where you can still hang out with your friends and have conversation and actually hear yourself but like I said the desert is totally worth it so I don't really care for the noise", "author": "Michele T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "If you like green tea, try out their green tea pyramid toast! It is delicious!!! You can share it... or not. It's a cute little place, and it can get busy. \n\nI love this dessert place that's open late for my night cravings.", "author": "Windy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "The brick toast is bomb.com. Nice pink bows on their menus. We had to wait a good 10-15 minutes but it wasn't too bad. We ordered the brick toast and mango shaved ice with ice cream. Definitely satisfied my sweets craving.  Will be back! EZ$", "author": "Garrett L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Great service, we ordered the tiramisu coffee toast with caramelized banana. It's was great. It's the best toast I have ever had. The hot dessert like egg white almond paste was the best, cuz the sweetness just right. The ETC has super warm pink interior decorations, and a cute collection of tigger.", "author": "Cuiying H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "I always come here for the toast. You may ask why? The size of the toast is just right. It's not overwhelming that you will get sick of it. It's nice of them to offer two size option, mini or regular which most places don't offer. I always order the mini. They have a bunch of flavors to choose from. So far ,the (mini Tiramisu toast) is my favorite. It has honey toast cubes, coffee flavor ice cream, 2 chocolate wafers, strawberries, chocolate syrup, Tiramisu cake and whipped cream. Sounds amazing doesn't it? It is amazing and its one of the must order items when you are here at ETC cafe.\n\nMy second favorite is : (Matcha Green Tea Moose Cake). I believe they just got this recently. I have to say is far my favorite Green tea cake , coming from a Matcha Green Tea Lover. The outside of the cake has a thin layer of jello like substance, the next layer is green tea moose, then its green tea sponge cake. The cake wasn't dry and wasn't bitter. It was just right. Then its filled with this cream. It has a nice scented flavor maybe it was the tea flavor , mixed with  red beans. The last layer was the green tea sponge. It was a very delightful sweet and moist cake. Each layer gives a new surprise for your mouth.", "author": "Miri L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "The strawberry Brick toast was really good. Highly recommend!! \nGreat customer service !", "author": "Kingston L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "My sister and I ate a lot. I wanted to try a couple of things and my sis just went along ;) gotta love big Sis when they help you eat dessert just so you can try a lot of things. This was my first time and my big sis's second and we both enjoyed somethings and disliked other things such as the Rose and honey toast but others should try it because we all have different tastes. But will definitely come back when I'm craving sweets and in the area.", "author": "G-Dragon Girl K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Excellent dessert especially the jumbo honey bread toast with all the fixins..  the creme Brule was ab fab since it was light and not too sweet.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "The dessert here is neither amazing nor horrible, but they do have a large selection of HK style desserts and they usually come out looking pretty. If I'm feeling hungry I usually choose among the various honey toasts topped with fruit or ice cream, or the waffles topped with the same. They really do put some effort into making them look aesthetically pleasing, and the flavor isn't too bad. If I'm just thirsty I may get a drink, and they have a ton of different juices, smoothies, and teas--I really like the matcha green latte, which is sweet and smooth. \n\nWhile the food is not something to scream about, what I really like about the place is that it is a great place to hang out with friends, chat, and maybe play some games at your table, all while or after you eat the desserts. Other tables are just the same, with large, loud groups or just couples enjoying the atmosphere. So this place often gets crowded late, usually around 10 or 11, as people aren't leaving. The waitresses aren't the most adept at handling overcrowding or seating, so get here earlier and grab a table. Once you're seated, just sit back and enjoy.\n\nAn interesting tidbit is that the restroom is upstairs in the building, which means you have to grab the key, go outside, and go in through a separate entrance to access the staircase leading you upstairs to a floor with other businesses.", "author": "Tony D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Great hangout spot! Staff does not rush you at all so you can relax with friends while enjoying dessert and snacks! Will definitely come back again.", "author": "Tony S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "I have mixed feelings about this place. \nThe woman making the food and helping us was super sweet and attentive. \nI got fries and then a banana Oreo toast box, and my friend got some mango with sticky rice thing. Visually, my friends dessert was unappealing and much smaller than anticipated, but she said it was really good. My fries were average, which is partly because they were thick and i prefer thin cut fries. The toast box was super big, definitely good to share. It was okay, I think my expectations were higher. The outside crust was good but the inside had a weird texture like croutons (kind of). I would come back again, just would try something else.", "author": "Shira S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-30", "description": "Was looking for a place to chill basically after dinner and we just wandered into this small little cafe. Will not be back...The first sign should have been when I asked for a latte and the waiter looked at me like I was crazy. For the record, my latte was most definitely not a latte and tasted a lot like instant coffee and not in a good way.\n\nAlso -- Minimum of 3 dollars per person after 8 and there are no restrooms (my bladder was dyinggg)", "author": "Jingxi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "It's a small cute store! There are tons of choices in desserts and some savory food too, I got the marshmallow Nutella waffle and it was delicious! I would highly recommend it. The food came to our table really quick and the service is great! This place is open till really and will fulfill your sweet cravings", "author": "Cherry Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "A nice dessert place! The desserts are great. We always come here at least twice a week. Oreo Banana is by far the best", "author": "Kay AL T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "I really like their honey toast. They offer two sizes for it: mini (6.95) or regular (8.95)! Not many places do that. With that, they have a decent selection you can choose from (around 6-8 types!) I've had the strawberry one and tropical delight. Both were really good! They warn you on the menu that it is a 10-15 wait for the honey toast, so order it right away if you must. Good presentation, I must say.\n\nI also had their mini dessert sampler (9.95) that comes with four mini desserts: tiramisu, macau pudding, mango pudding, and a mini fruit salad. All of it was pretty decent, not really anything to hype up. Something to note was that the macau pudding was frozen.. boo.\n\nI can imagine their sago and other asian desserts are pretty good here. One of my friends had their red bean and green tea pudding which ended up to be pretty small, but he enjoyed it anyways. Next time, I'll try their waffle and ice cream desserts; those seem popular along with the honey toast. I wouldn't trust the pasta here.. which is kinda odd since it IS a dessert cafe. Stick to the dessert, hence the name!\n\nCome here on a weeknight or around 8-9pm on a friday or saturday. I've heard plenty of stories from friends that say this place is OVERLY crowded when it gets to about 11pm. Easy to find parking at night because everything's metered. And as of service, never had a bad problem here.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "The service was quick and efficient. The server answered all our questions thoroughly. The food also tasted very good. I have nothing to complain about. I will be back soon. I will recommend to my friends..", "author": "Sugar Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "My friend brought me here, so it's the first time to be here. The tableware and decoration are very cute and sweet. I suggest the #imitation shark fin soup and the #Honeythicktoast. It's taste pretty good.", "author": "Elise G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-21", "description": "Over the years I have become a regular for the brick toast because I have yet to find another place that makes it well. \n\nIt took a while for the waitress to take our order. I think she forgot about us until another coworker I recognized noticed us and told her to take out order. You don't go here for the service or atmosphere though, you go for the dessert. \n\nThey added more stuff to the place too like nicer seating. That's cool.  \n\nMy boyfriend and I ordered the Strawberry Sweetheart regular size toast. It was delicious. Buttery and sweetened with honey but the flavor comes from the toppings they use. Out of all the toasts, I like the Oreo Banana and the Strawberry Sweetheart best. \n\nI decided to try the Matcha Red Bean pudding. At $4.50, I expected a juicier serving. It was in a cute little glass cup so it looked nice. Taste wise was pretty good but I was anticipating a thick and creamy pudding but this was like the lighter, jiggly puddings people put in milk tea drinks. I guess similar to panna cotta. \n\nI want to try the mango coconut sticky rice next!", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "My favorite late night go to by the Sunset area. During the late nights it isn't usually too packed and they have a great selection of food both savory and sweet to choose from. Have lots of rules about paying with cards and splitting and such, but given the area it makes sense. Very cute and girlie and overall always leave satisfied!", "author": "Devika B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "A friend and I were visiting SF from Monterey area when we craved for Asian dessert. We stopped by at ETC dessert cafe and it was just we wanted! I ordered the mango shaved ice with mango ice cream and my friend order the coconut milk with black sticky rice & mango. Service was also great, and the interior was cute! We will definitely return :)", "author": "Ari P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "First off, this place is freaking adorable- so kawaii\nThe desserts are good as well- the staff picked up on my girlfriend's and my indecisiveness and were totally patient. Go if you're in the area", "author": "Wellington C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-10", "description": "Great little(and I mean little) cafe for late night eats and kick-its. \n\nMy friends and I came here after some late night photography shooting in the city. It was around 1am when we finished galavanting. We chose this place(that I previously BM'd), because it was open 'til 1:30am and I wanted to try honey toast(been wanting to try since I saw pics on IG). \n\nWe were rollin 8 deep in da cafe & we were crammed(really, this place is small). You can easily eavesdrop into ppl's conversations while waiting to order at the register. We were able to get a table and snag the couch/table area right across from it. We ordered a lot-- Soups, ramen, spam sandwich, smoothies, calamari, takoyaki, desserts & of course...my honey toast. Everything came out in a timely manner, except for my macaron chocolate party honey toast :( I was the last one to get my order(my friends threatened to leave me when I received my order, lol). It took more than the allotted time it said on the menu. Worth the wait? Chyeah...I think so...\n\nWhen it came out, I got excited(hooray-yay, cheers)! I had to take multiple shots and angles before my friends and I destroyed it ;) It was looking Nom-worthy. The honey toast was pretty good! Not too sweet, not too flavor lacking. Crunchy, reasonably sized, & delish. BUT they coulda gave me better looking strawberries \"/ Anywhoozies, it was pretty good for my first honey toast experience. Price could of been a tad cheaper tho. But hey, the macaron alone is already $1.50-75(compared to other bakerys I've been to). So I settled.\n\nOverall, good food/drinks, reasonably priced menu items, service was good. \"Night owl\" friendly cafe(some of us ordered more dessert after the 1:30am) & Free Wifi!(YAY). We stayed until 2am.\n\nJust a heads up, if you need to use their bathroom, I suggest not going alone. You have to ask for a key and go next door & walk up a flight of stairs. One of my guyfriends went alone and he said he felt like it was in a scene from The grudge o___O Plus, it's a Unisex bathroom and it smells *(insert stank face emoji here)\n\nCheck this place out if you're in the area and you wanna get your K-pop on and your late night dessert/snack cravings on ;D", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Food was great! their drinks need some improvement though... Really liked their rose latte, but milk tea was below average quality. Toast was on point", "author": "Luki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "First time here and it did not disappoint. It's a cute little cafe with yummy desserts. We ordered the Oreo Banana honey toast & it was delicious. The regular size was a great sharing size. Very picture-worthy. The taro crema was definitely something I'd come back for.  Great place to hang out with friends!", "author": "Kristina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Nice little place.  We came here in search of honey toast since Akiba was closed.  \nWe split a Green Tea Red Bean Mini Toast, and it was delicious.  Green tea ice cream on honey toast, what's not to love?  Paired with red beans for a nice extra texture.  I also had one of their Peach Smoothies, good flavors with peaches and bananas.\nDon't bother getting takoyaki, I don't recommend it.  There are big chunks of octopus, but the batter isn't great.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "Atmosphere awesome.\n\nService cool. Papi amazing, friendly and accommodating.\n\nFamily own biz, I appreciate. \n\nGood place to hang out and chill with friends, family, significant other. Good selection of food and drinks. Some sweet and some savory.\n\nParking isn't bad after 9PM.\n\nAlso a good place to drown sorrows when your brothers are being jerks. I recommend the waffle special. \n\nH/\\VE FUN", "author": "William S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Service was so friendly, got our delicious desserts at a reasonable time and price... We ordered the creme brulee and waffle #19, both were well presented and delish. Annnd they accept debit!!! Around here, that's kind of a big deal ***** Happy as a Hippo :)", "author": "Nora M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "The service is nice, my friends and I usually come here after dinner for refreshing treats. Do not get the sampler, God knows what that weird green tea shit in a cup was. The creme brûlée was the only thing saving that. However, everything else was good.  I highly recommend the cold desserts such as the shaved ice or mixed fruits.  \n\nOwners, if you are reading please stop using YouTube, your internet connection takes 10 years to load a song sometimes.  I recommend saving a music video playlist on a usb.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-05", "description": "Ehhh its alright. Their food wasn't terrible but it wasn't spectacular either. I probably wouldn't come back since there are just SO many dessert places in SF. They were accommodating though when we asked for a bunch of dessert to go (asian almond tofu thing). Their waffles were eh. Their brick toast was good. I liked that a lot more than the waffles. It was buttery and crunchy and tasted good with the ice cream.\n\nSKIP the wings with fries. they give you four wings and the rest are fries. fries were not very crispy.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Etc. is an extremely friendly place wth great dessert and service. Their tiramisu honey toast is amazing! Can't wait to come back", "author": "Eric J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Excellent dessert and opens late. Family loves it here. Good variety of food for all to enjoy whether your looking for a cold dessert or a hot dessert even full on meals this place has it", "author": "Eva K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "We ordered the chocolate fondue set and on the menu it says it should come with cheesecake bits, fruits, marshmallows, and ice cream. However, ours came with a waffle instead of the cheesecake bits and they forgot the ice cream. I wish they updated their menu or just followed what's stated on the menu. On the other hand, they have a variety of desserts and would come again to try something new.", "author": "Kotoko T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Great dessert after we ate PPQ across the street. Got the iforgota and ice cream. I'm sure I spelled it wrong but it was good. We also got a ube coffee.", "author": "George T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Tried this place for the first time definitely will be back very chill vibe really enjoyed dinning in", "author": "Emery L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "My friend and I ordered the Oreo banana and chocolate macaron party toast. The plate looks really nice and spot on. It seemed like they put a lot of effort into it. It wasn't really sweet which I like. The only down side is the toast. They added raw honey to it and the texture of the toast was too dry and crunchy in my opinion. I couldn't finish it because it was just too much. The overall service is good. The worker that served us was so friendly. She was so patient with us with our order. For sure coming back!", "author": "Sandra Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "I came here 10 minutes before they closed, which is kind of messed up yeah but my friends and I were looking for somewhere to eat so we ended up here. The waitress was super accommodating, gentle, nice, and just overall great. Would definitely come back!", "author": "Lili L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "I couldn't decide what to get because there are so many great options! Love the decorations too :) meow.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-02", "description": "We were craving dessert after dinner one night and stumbled upon this little cafe that I always walked past and never noticed. Definitely falls short of the Asian dessert places in SoCal, but it'll do for those late night cravings- not much else to choose from in SF. Brick toast was nicely toasted ? Toppings were generous although a bit lacking in flavor (the green tea ice cream was definitely mediocre, as was the mochi- a bit hard) and the mini size was just right. Setting is definitely a bit old and rundown, bathroom is in the building upstairs and incredibly janky, but it was nice to have a warm place inside to sit and chat over dessert. Price is alright, selection is wide, but quality is just meh.", "author": "Joy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-15", "description": "Nice place but when I checked in and showed them they told me that I can only get the free stuff for \"for here\" order but we literally waited for almost 30 mins for our order. So we in here still. Ehhh mediocre food as well", "author": "Jimbo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-09", "description": "Desserts:\n-Matcha green tea pudding with red bean, too bland\n-Green tea ice cream shaved ice with red bean and mochi (I know what your racist mind is thinking, this is different from the dessert above, not all asian desserts are the same) a pile of flavorless shaved ice permeated with uneven green liquid, only good thing about this was the generic strawberry mochies and dollop of Polly Anne's green tea ice cream in this giant bowl\n-Macaron party honey toast box was decent, vanilla macaron was pretty chewey as it should be, surprisingly well-toasted honey bread box for north america, though not comparable to ones form asia, could've done without the cheaped whipped cream and chocolate chip pieces\n\nService and setting:\n-Really friendly service by soft-spoken asian girl\n-Nice atmosphere for a fob asian place, actually some fucks given to interior decor although a lot of things seem a little mismatched like my fob parents' outfits, loved the white (ikea?) furniture", "author": "Tian Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "This place is pretty good. We had 7 people and thee dessert was all served on time. They also R gave us 15% off discount since they are grand open.", "author": "Justin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Great service, the fruit waffle was really good and you have to try the fries. Make sure to use the check-in so that you can receive different \"tiers\" with minimum orders of free desserts!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "For the price Brick toast is the best thing here but the add ons aren't worth the price.", "author": "Jacksun F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "The strawberry waffle was quite delicious. The black sticky rice in coconut milk with mango tasted much better once I mixed the hot rice and cold milk to make it a uniform temperature. They were able to specially make my friends dessert too! - almond paste with sesame dumplings.", "author": "Kristie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Super awesome and cute Asian dessert place in sunset! Love the coconut milk sago with mango :) I always come here when I'm in the area for dinner!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "Time: Thursday Night around 11:45pm.\nMission: find a place with ice cream & maybe some food\n\nThat shouldn't be too hard right?\n\nInitially deterred by the horrible Yelp reviews, 2/3 of us still wanted to try out the new spot on Irving. Given that it was past midnight when we arrived, parking was not a problem but I see why this is an issue during the day. And YES there are about 9 bazillion other \"HK dessert\" type places but most of them are overpacked with fobs and screams \"Walk in so you can bump into the randomest person you've ever known in life\" but how many are open past midnight on a thursday? and aren't in the richmond district. \n+1 for fulfilling our mission\n\nFood:\nWe ordered the HK Style Imitation Fin Soup, which was pretty good and most places don't have it. I could drink this stuff all day so +1.\nThe banana split was good and they do offer a variety of ice cream flavors (but this is a pretty hard dish to butcher) As for the Ham & Egg Sandwich, the bread came out too toasty so it tasted a bit weird.\n\nService&Price:\nCash Only ! So I hope they post bigger signs stating this because we didn't see any and Yelp lied saying that they accept card. (BoFa ATMs are at the end of the block though) Luckily we did have cash & pre-tip for 5 items was around $20.\nThe Owners were really nice & props to them for being young and opening up your own business. When the waitress came to clean off the table, she saw that my friend had not eaten much of the toasted bread and asked if there was something wrong. She profusely apologized and took in our opinions. Overall though service was good and they don't stare at you with confusion after you converse in English but order in fluent Chinese. +2\n\n\nIf you're looking for something closer to the Sunset, this could be a new place to check out. Review update once I try out more of the menu !", "author": "Jenn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Super cute place with even better food! Got smoothies and an appetizer and it couldn't have been tastier!", "author": "Natalie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "Honestly if I could give this place 0 stars I would. \n\nFirst my friends and I (4 of us) ordered one toast. Nutella banana marshmallow toast and water. \n\nthe first thing is they gave us water and 4 cups. The water and the water bottle smelled like legitimate piss. Like they washed the bottle, closed the lid and didn't let the inside dry. It was horrible. \n\nThen when she brought out our toast she said everyone needed to spend a min of $3 dollars after 8 pm. My first question: why wasn't that mentioned when we first ordered. She said sorry and walked away. \n\nSo my friends and I ordered two more dishes to make our $12 minimum. One friend ordered fresh mango and mango ice cream. When she brought it out it was mango juice and mango ice cream. We asked her why we got mango juice instead of fresh mango when the picture clearly shows mango cut into pieces. Our server responds with \"oh in Chinese it says fresh mango juice\". While I understand that this is just poor communication, don't show mango pieces and say fresh mango and not expect people to think its mango pieces. \n\nSo we ask her if she can add the mango pieces of fruit and she says yes. We also ordered coconut milk with black rice and mango pieces and she Asks if we want hot or Cold. We asked her what was better and she responded by saying the cold was better. \n\nWe received the right mango dessert and the coconut dessert with an added scoop of mango ice cream. \n\nWhen we got the bill, not ONLY were we charged for the extra fruit BUT ALSO charged and extra dollar for the mango ice cream in coconut dessert. When I asked her to take these $3.00 dollars off since we didn't even want to spend this much on dessert. She only took off 1.50 saying that she could take off the fruit because she NEVER told us she would charge us but nothing could be done about the coconut dessert because it always comes with ice cream when it's a COLD DESSERT. WHY DIDNT YOU TELL US THAT WHEN WE ASKED YOU WHICH ONE TO PICK. \n\nNot once did the manager come out and talk to me. And at this point sorry is not enough and does not do anything. \n\nAnd the cherry on top was our server telling us that the 3.00 min charge after 8pm is on the menu: let me tell you. ITS IN 7 POINT FONT IN THE BOTTOM LEFT CORNER IN BETWEEN A BUNCH OF OTHER TEXT. THAT SHOULD BE BIG AND BOLDED. \n\nBesides the SHADY and SNEAKY charges, the server was a nice girl but doesn't seem to know what she is doing. She said sorry a lot but I'm sorry sweety it doesn't help a single bit at this point. \n\nIf you wanna get ripped off by the tiny ass print and have people not help you one bit when you're pissed beyond belief this is the right place for you.", "author": "Selina Andrea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Brick toast was delicious. Unfortunately they ran out of matcha ice cream so we will have to come back another time.", "author": "Cameron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "ETC Dessert Cafe is amazing! I come here all the time for their brick toast especially their strawberry pyramid! Instead of a whole toast, they cut the toast into smaller cubes and each piece is absolutely perfect! The outside is nice and crunchy but the inside is super moist! With the combo of ice cream and condensed milk, it's delightful! Definitely recommend all of you to try it!", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "If there was ever a moment to scream and weep uncontrollably over the goodness of food, it's when you try their Nutella Marshmallow waffle. I never wanted it to end. If ever I'm on death row and they ask me what I want for my last meal it will be that damn waffle. While on my death bed, surrounded by loved ones my final words will be \"that damn waffle!\" I got the half waffle , but my soul wanted the full waffle. Do yourself a favor and get one.", "author": "Jared O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "I've been here way before and I actually didn't really like this place too much. I tried their toast maybe like a year or two ago. I recently came back because my friends decided to try this place out. It wasn't busy because we went on a weekday. They are also closed late so that's a  plus! My friends ordered their oreo toast and I tried it, it was actually pretty good! The toast was soft on the inside and toasty on the outside. The flavors my friends picked were a good combination so it tasted really good. I then came back with my sister a week later because she was craving some dessert. I ordered their chicken wings with fries and I thought they were so good! Fried to perfection! The chicken wings were also breaded really nice with a good amount of seasoning too. My sister ordered their mixed fruit grass jelly. I didn't get to try it but she was pretty satisfied after. I've looked at their prices and honestly, this spot is one of the cheapest dessert cafes I know. Very inexpensive! I don't know if they've changed ownership or not but I will definitely be back! \n\nIt's also another plus that they take card here!", "author": "Joey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "I waited for 2 minutes for seats, but its worthy. The dessert is great, and location is awesome, the service is perfect. I love it. Highly recommended!!!!", "author": "Kingsley W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-13", "description": "My friend and I ate a light dinner, in hopes that we would find some kind of snack/boba place that intrigued us on Irving Street. We were being super picky and couldn't decide on what to get.\n\nWhen we saw the menu for ETC in the window and saw HK style desserts, we looked at each other and basically screamed in agreement. We met in Shanghai, and one of our favorite places had this bomb dessert with black rice, mango, vanilla sauce, and ice. We saw this on the menu and basically died because we finally found it in America! Woohoo!\n\nAfter our first bite, we were sadly disappointed. It was in coconut milk instead of vanilla sauce - not sure how it is normally, but the coconut milk tasted weird. The rice wasn't sticky at all and was too hard. It was just not what we expected, and it was a super tiny portion as well. It wasn't terrible, but I definitely won't be coming back for this dessert.\n\nStill trying to find a place with legit Hong Kong style desserts :(", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Very cute dessert lounge! We got the matcha brick toast, cold mango sago, tofu pudding, creme brûlée, a rose latte, and honey green tea. It was all very good! The rose latte was a little miss leading bc it tastes like coffee and had no rose flavor what so ever. But despite that, the experience was very nice with some delicious and aesthetic desserts!", "author": "Tina S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-16", "description": "I love dessert sports, and this place is not one that I love or even like. I've been here two times. First time I think I got one of their mini toasts, which wasn't bad. Second time, I got the \"tofu fa\". It was not food at all. Not sweet and really dry tasting. Bleh.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "I ordered a Mango Pudding which was meh okay, but a friend ordered a \"Mini Oreo Honey Toast\" which was so huge so she had to share. This was my very first time trying a Honey Toast, and it was so yummy! I've gotta say, something about 'honey toast' did not sound appealing to me, but this dessert exceeded my expectations!\n\nThe portion for a 'mini' was big enough for 3 people to share! Can't imagine what the adult honey toast would be! \n\nAlso the Nutella Waffle they offer for yelp check ins was delicious! \n\nOverall great and attentive service, minus one star because it did take a while for everything to come out and the Winnie the Pooh theme around the place was a bit odd.", "author": "Oriel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "So amazing. Perfect place if you're in the mood for an interesting variety of sweets. Highly reccomend the mango milk tea and brick toast", "author": "Manpreet P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "It is our first time there, the food was yummy. I ordered the refreshing lemon tea and my son ordered the lemonade which was sugar water with lemon slices. Great value for the price and amount of food we ordered. I wished that they have sugar syrup for sweet tofu. I'll come back again. Please check in with yelp and FB to unlock their dessert promotion.", "author": "Carol L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Have been coming to this place for a long time now. Great hang out place,  friendly service, good food and very spacious. I'd recommend this place after a long day or week of work. It is a noisy atmosphere/ can get very noisy, so if you do like quiet dessert places, then this may not be the best for you. I'd recommend the pyramid toast,  any flavor, and the Mango delight.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "It's been one sweet journey trying all six honey toast flavors form ETC! That probably makes me sound like a fatty, but I prefer the term \"honey toast connoisseur.\"\n\nMy favorite was the Tiramisu Honey Toast, the most chocolatey of all the flavors. It came with coffee ice cream, a tiny slice of tiramisu cake, sliced strawberries, striped chocolate wafer sticks, and chocolate syrup drizzled all over.\n\nThe overall sweetest flavor was the Strawberry Sweetheart. It consisted of vanilla ice cream, strawberry slices, striped strawberry wafer sticks, and a tiny slice of New York cheesecake. Strawberry syrup and powdered sugar topped it all off.\n\nFruit lovers will enjoy the Tropical Delight. The fruits' natural sweetness paired with mango ice cream created a luscious medley without being overly sugary. It includes fresh kiwi, honeydew melon, cantaloupe, watermelon, strawberries, canned pineapple, and canned peaches.\n\nThe Matcha Green Tea Honey Toast features the refreshingly sweet combination of green tea ice cream and sweet red beans. The small pink mochi chunks and chocolate pocky sticks topped off the Japanese theme nicely.\n\nOreo cookies, cookies and cream ice cream, and banana slices come together to make the Oreo and Banana Honey Toast. It's topped with chocolate syrup and powdered sugar.\n\nThe Macaron Party was the most disappointing. It was an uninspired medley of chocolate ice cream, strawberry slices, chocolate shavings, and one lone vanilla macaron. Granted, you can add extra macarons for a dollar each, but with a name like Macaron Party, it's presumed that there would be more than one macaron.\n\nAll the honey toasts are deliciously beautiful desserts to share with family and friends, and ETC provides a cozy environment for doing exactly that!", "author": "Tanya A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "This is my first time at ETC cafe and the experience was good. My bf and I ordered 4 items: rose latte, full size tiramisu honey toast, full size Belgian waffle with Nutella and banana, and calamari. Rose latte came in a  cute coffee mug with a tiny spoon; however, we only finished half of the amount because it was way too sweet. We give the honey toast a 3 out of 5 because we think the honey didn't go well with the dessert. I was expecting the waffle to be crispy, but the waffle turned out to be soft and fluffy which is not I wanted. The calamari was surprisingly really good except that they used ranch instead of tartar sauce. The calamari was seasoned right and tasted fresh too. The calamari is a must when you visit ETC cafe! Highly recommended! Our waiter was friendly, polite and attentive. I give him 5 stars! I would definitely come back for fruit desserts.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-08", "description": "Food: After having brick toast from Snowflakes, I knew it was going to be hard finding a comparable brick toast that taste just as delicious, and this place was no exception. The small size break toast was about $6 for one 1 inch slice of brick toast and a couple blocks of buttered toast on the sides, 1 scoop of ice cream, whip cream, fruits, cake, beans, etc. everything tasted just okay, nothing spectacular or anything, but it did give me my sugar fix for the night. \n\nService: pretty good service and friendly waitress. Every table got their own water jug which I thought was pretty cool, because usually dessert places like these have a big water jug that is self-served.\n\nAmbiance: this place has a cutesy-Disney-tiger theme. It was however pretty small and the tables were sort of cramped together.  \n\nNot sure if I will be back, because there are so many other dessert places to try in the SF.", "author": "Samantha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-27", "description": "My buddy and I needed a quiet place to talk shop after dinner and a drink. Naturally, we sought out some dessert but Tea Way was totally packed so we walked down the street until we stumbled upon a welcoming Hong Kong-style dessert shop glowing bright in the night. We saw some seats inside and also that the closed late so it was the perfect spot to chat.\n\nWe shared the marshmallow waffle and matcha green tea pudding, which were both excellent. I was worried that the marshmallow and nutella would be too sweet, but it was just right. The pudding was really strong and had a caffeinated kick to it which was quite nice. There was tons of delicious looking things on the menu and I can't wait to try them on my return visit.\n\nService was excellent and the couch and armchair were comfy. Prices were reasonable and the portion sizes are great for a late night treat. Most HK dessert places tend to be packed, especially on the weekends but this one has just the right amount of traffic to make it very easy to visit. Plus, it's nearby my girlfriend's place so I'll be bringing her by soon!\n\nFood: 10/10\n\nService: 9/10\n\nPrice: $\n\nAtmosphere: 8/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Best dessert around sunset area! \nCute little shop and good food \nMy favourite is the green tea toast box\nOther than dessert, they have entreé too. The pastas are good, really creamy. Oh and chicken wings Omg.\nI took one star out because the shop is small, so some times we might have to wait outside or share table with other customers.", "author": "Coral N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-04", "description": "This place is OK for hangout but not for good desert. Compare to other desert place, they do have something different. However for the money I think they're really good at all. The pricey item like thick toasted bread, is really not worth it. For $9 you got a cone of ice cream and alot of toasted bread. I'll say that's a rip off.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Very delicious and good service, no need to worry parking and wait for table, my bf loves it so much, and the price is worth and make sence!!!", "author": "Ying W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "I went here with a group of friends for dessert and ordered the Strawberry Sweetheart Honey Toast. The dessert was big. You should share with another person. The toast was cubed and toasted with honey. The toast was topped with a mini cheesecake slice, strawberry slices, a scoop of ice cream, and 2 mini stick cookies. The toppings and toast went great together. I thought the presentation was very nice. We also ordered the waffles with mixed fruit and ice cream which was also great. \n\nService was ok. It did take a while for them to make the toast. They had a lot of Disney plushies on display. I found it strange that you have to go outside the cafe to reach the restroom.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Some delicious foods and yummy munchies for the night owls looking for a nice quiet sunset snack!", "author": "Mozark S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "I've heard of this place but had never been here until a few nights ago. One of the great things about this place is the fact that it's open late night. What a great concept if you asked me because most places open late night are usually fast food restaurants or drive through's which are never healthy for you anyways. But at least when you eat these desserts, you don't feel so guilty because there so darn good.\n\nAlthough it's very small when you first pull up you recognize that you're in the right place because it has blue Christmas lights sprawled out from the front windows all the way through the café. It's a little funky but in my opinion pretty cool because I love Christmas lights. My party and I we're given seats and the waitress came pretty quickly to take our orders. Unfortunately that was one of only two positive things that came from my time here. The second was the fact that the servings are huge. Even the small serving sizes need two people to finish.\n\nAre order took 20 minutes to reach our table which normally wouldn't be bad but the café was completely empty. That is except for the staff and their friends, who seem to have their own table and clearly made themselves comfortable here. Really 20 minutes for two desserts that is insane to even think about!! If that's how long it takes to make two desserts in an empty cafe, I wonder how you guys even stay open.\n\nRegardless when I got my Oreo honey toast dessert it was great. It was light and fluffy and when the ice cream began to melt, it flowed and covered the toast in sweet goodness. As I wipe the drool from my mouth just thinking of how good it was, haha...I then realize that it began to go down hill even worst after that. So after we finished out food, it took another 20 minutes for our waitress to come back to our table to check up on us. That's 40 minutes of waiting time in between our desert. It seems the waitresses were too busy having fun with their friends to even come and check up on us. \n\nAlthough I know it was late at night you still have customers and they should always be top priority especially when we're paying for our food. Overall great food for service just something to really think about before you come here. Maybe it could've been an off evening for the staff but at the end of the day, customers should always take priority over anything. But that's just my opinion!", "author": "Donald W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Ordered the strawberry toast! Super delicious! The hazelnut latte is also good. Small little place but cozy. The girl who served us was super attentive. Nice little spot to grab dessert.", "author": "Ciplada R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "The honey toast (I got tiramisu) is very good. At first, I was afraid to eat it. Such a large piece of toast, how can I eat it gracefully? Usually if I hang with my bros I wouldn't mind \"how\" to eat my food, but this time I was with my girlfriend and her sisters so I did not want to eat like a cave man. I trembled with fear.\n\nWhen the toast arrived, I was very pleased to find out that the toast is actually cut into small pieces so it is very easy to eat. I scooped up a piece of toast and put some ice cream on it, and the taste was heavenly. It was a little crunchy, a little honey sweet, and covered with cool, ice creamy flavor. It's very different from your typical ice cream.\n\nMake sure you split your honey toast with friends, it's too much for one person. \n\nEventually, conversation got boring, and the waitress lend us cards to play with. The service was awesome and it was a great place to hang out after dinner. I recommend it.", "author": "Song Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "Good for the frozen treats like green tea ice cream or coconut sago.", "author": "Xtina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "I've been here  a few times. Their honey brick toast is really good, I'd recommend it. I've tried their strawberry and green tea matcha flavors, but I think all their brick toast flavors are pretty good. I've also had the sampler platter which had chicken wings, calamari and takoyaki. I've had good experiences here with their food & service.", "author": "Bailey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Great avocado and banana smoothie! The tiramisu is really fluffy. Open late night too which is good.", "author": "Monica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Came here on Saturday night, pretty busy.\nAmazed at the menu, so many varieties.\nOrdered mango sago; coconut milk almond black sticky rice and fried chicken. Great as late night snacks.\n\nThe deco and environment are really cute. \nWill be back to try out the pastas and toast with ice cream.", "author": "Jimmy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-26", "description": "This place had a lot of choices of beverages and lots of Asian desserts. The decor was a bit over-the-top pink and cutesy and probably something you'd expect to see in Japan...but...if Asian desserts is what you want, this place probably has a good amount of that covered.", "author": "Leo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-29", "description": "Pretty LED blue lights in hang in the large windows and lure me in almost immediately.\n\nOne cold December night, babe and I went in for a sweet treat. The restaurant was completely empty upon arriving to the doorstep and leaving the threshold when we were done. The restaurant does have a sort of comforting, coziness to it.\n\nI ordered the chocolate fondue and babe ordered the sesame paste with glutinous balls. My chocolate fondue was small in portion and the chocolate wasn't very good. :( I've had better at Genki Ramen... (specialty in ramen, lol) and the sesame paste was luke warmish and lacked flavor.\n\n3.5 for service and 2 for the dessert. Don't think I'll be coming back unless I hear that there has been some improvement in their desserts.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-15", "description": "We wanted honey toast for dessert so we opted to try this place out & ordered the Tiramisu Coffee Honey Toast. You could really taste the honey, which was great,  but the toast was overly dry and the edges nearly burnt. Coffee ice cream was creamy and strong flavor. The tiramisu flavor came from a small slice of cake that tasted like it. Different flavor for a honey toast but wouldn't order again. \n\nLocated across from Tpumps and between Honeyberry & Ichiban on Irving St, it is hard to find parking.\n\nUse cash or they'll charge you a fee to use card.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-07", "description": "The brick toast is yummmy! But really pricey. We ordered the one with choco syrup, strawberries, and vanilla ice cream. That thing came out to like $10+\nIts not something i wud come back for", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "The food is so bomb and the place is so cute, love it! Service was great, the lady was really nice. Would come again.", "author": "Abi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-11", "description": "I really liked the honey toast. I've been looking for honey toast since I moved to the bay. I also liked the ambiance of the place. It's really chill and they also have a lot of food option. There's even pasta!!! Will be coming back again :)", "author": "Ina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Many choices for desserts! Nice quiet place. Good service. Great for couples on dates! :)", "author": "Vita N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "Got on the hype and deciding to try this place out!\n\ngot the tiramisu honey toast and oh my goodness, it was one of the best honey toasts I've had.  The texture of the tiny bits was crunchy but slightly softer on the inside, so if that's the texture you like, you'll be a fan of this as well.  If you're more into the soft chunks, you may want to go elsewhere.  Also ordered the taro sago and it was fairly decent, nothing too special.  I had not eaten dinner that day as well so I ordered the butter waffles and \"chichen\" lolol I kid you not, the menu says that, but it's cute.. hahah my friend and I couldn't get over it :)  It was pretty good too! I definitely want to come back and try the other stuff as well.  The menu sounds pretty nomlicious and there's such a good variety to order from!\n\nAlso, the girl that was working there was super nice and though it take a little longer for the food, her service just accommodated for it.  Super sweet!\n\nAnd as usual, I beat the crowd so I can't say much about waiting time.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "Quant little restaurant on Irving Street   I pass it all the time yet the store front never caught my attention.  We were looking for Taiwanese Ice and ETC Dessert Café appeared on Yelp.  My family ordered the Fruit Slush topped with mango ice cream and the honey toast with fresh fruit.  The fruit was fresh and the slush was oh so refreshing.  Both were large enough to share.  Looking forward to trying something new next time.", "author": "J H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "It's a good place to hang out. I love that they have many good desserts and savory food!! Nice service too!! I will recommend the honey toast here. Many choices too!", "author": "Eggie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Yummy stuff. Much love. I love that they're open late so friends and I can hang out here. They have a good variety of desserts, drinks and snacks. Perfect for late night.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "Very cute, dead empty when I went. Note that their restroom is in the building next to it in this random as hell hallway. Haha felt really sketchy but it was fine.\n\nCurry Toast - boyfriend devoured it. tasty!\nHoney Chicken and Waffle - Skip, it works for a craving but I think there are better items on the menu\nHoney Toast - Tiramisu. We got the mini. It was delicious. I love honey toast now. :)\n\nCute place, I would go again, plus its near honeyberry, and t-pumps. Can't go wrong.", "author": "Samantha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Accessibility (Parking / Wait Time)\n\n1/1 Star: Easy street parking at night.  No wait.\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n1/1 Star:  Nice blue lights.  Average service. \n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n2/3 Stars:  I had a chocolate party and it was pretty good.  I just wish it didn't take an additional 15 minutes to make.\n_____\n\n\nOverall Experience\n4/5 Stars \n\n_____\n\nPictures\n\nChocolate Party: http://www.yelp.com/biz_photos/etc-dessert-cafe-san-francisco?select=5mC4IAIsKmlMIvcxkPDB2w#5mC4IAIsKmlMIvcxkPDB2w\n\nWaffles and Oreo Ice cream: http://www.yelp.com/biz_photos/etc-dessert-cafe-san-francisco?select=ay2gNuT8GsOSNCN5TAWZ_Q#ay2gNuT8GsOSNCN5TAWZ_Q\n\n_____\n\nLast Words\n\nI would go again", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "It is now official that ETC is our two top Chinese dessert place in San Francisco~\nReason being: my Cantonese food fiend friend loves it, says it is legit and innovative. And truth is their cold fruit dessert is quite decent (occasional use of canned fruits - not a surprise, not a secret, but the saigos are fresh and abundant!), their hot traditional desserts are stellar (Taro+red bean paste). \n\nInnovation is what matters the most: I like their almond paste over tofu fa (which is \"Tofu flower\", which is very very soft silky tofu), and gosh the smore monster of marshmallow on waffles~ \n\nWe were won over. Love the friendly atmosphere too, really chill, cute - like the lights blue is perfect for winter", "author": "Dilys S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Family size brick toast was yums, great for eating out with friends. Can have lots of fun and lots of toppings with it", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-28", "description": "I wouldn't necessarily come here for a legitimate dessert.\n\nYou come for a late night spot to hang out with your fellow Asian brethren, drink milk tea, and eat honey toast.\n\nThis spot was open on Thanksgiving (duh). My friend said the milk tea was pretty good but I went with an avocado shake. It was aaaaaaa-okay.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Waitress was super nice and informative. They also had a great selection of amazing desserts. Everything I have here blows my mind every time. 10/10 would eat again.", "author": "Ethan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Their grass jelly is really good if you like sweet things. I love their brick toast because it's coated in condensed milk!", "author": "Verrone L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-25", "description": "As my first time here, I have to say, I was pretty satisfied!\n\nWe ordered two mini-sized toasts, one with a macron it and another called Tropical Delight, which had pieces of mango, watermelon, and all the other tropical fruits as so described by the name of the dessert. The toast was nice, crunchy, and soft. The sweetness was perfect and it was easy to eat too; when you cut it apart, it breaks easily into square pieces. We shared these 2 with 3 people. So perfect portions for dessert after dinner if you aren't too hungry! I've seen the normal-size and that's perfect to share amongst two people!\n\nThe service is good. Since we were 10 people and the place was small, they were still able to somehow accommodate us as best as they can, not just with tables, but with menus, forks, and plates.\n\nIf you're looking for dessert and something interesting and not too heavy for your taste buds, this is the place to go!", "author": "Tina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "Gotta love this place for staying open til midnight. Cause seriously, late night sweet cravings are a VERY regular thing in my life! \n\nFirst off, the interior is extremely pink. So pink that it makes you feel like you're in a Hello Kitty or Sanrio store. We ordered the tiramisu honey toast, avocado smoothie, and honey chicken creamy mushroom pasta.\n-Tiramisu Toast ($8-9): big, real big, and beautiful presentation. But only big because of how much bread you're getting, not the goodie toppings (small piece of tiramisu, chocolate sticks, coffee ice cream, and whipped cream). The toast is super crunchy, like you're eating honey-sweetened croutons. Definitely go with their smaller size order, which will give you the same amount of topping with a smaller more proportionate toast.\n-Avocado Smoothie ($3.50): not as avocadoey as I've had and like. Almost like they blended a little too much ice into it and diluted it. Still good and refreshing though!\n-Honey Chicken Mushroom Pasta ($7-8?): healthy serving of chicken served hot with the creamy pasta. Interesting mix of the sweetness from the honey chicken with the savory creamy pasta that my friend really enjoyed.\n-Mini Banana Split (free with check-in and $20): very simple. Sliced banana with 2 small scoops of vanilla and chocolate ice cream. No fudge or toppings, but hey it was free!\n\nService can be slow with only 1 server, but she was very sweet. I'll definitely be back to try their other desserts or milkshakes!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "My #1 weakness, dessert...\n\nI was so excited to see that they had honey toast so of course I had to try it. I got the one with all the fruits on it and I decided to go with vanilla ice cream. I love vanilla ice cream! \n\nThe toast took about 20min to come out and it looked super delicious buttt when I started shoving it into my face it was just OK. The toast wasn't sweet enough for me :( I was expecting the outside to be crunchy, which it was, and the inside to be soaked in honey but half of the bread on the inside was still crunchy. Fruits and ice cream were pretty good but I was really hoping the bread would be like Guppys brick toast :/\n\nService is w/e unless your hella down with fobby Chinese girls. If you ever need to use the bathroom, make sure to have a buddy system. It's upstairs in the building next to ETC and at night its empty and creepy.", "author": "Harry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "I love this dessert place because it's in the outer  sunset and easy to find parking at night.  The staff is nice and the food is delicious.  If you are from Asia and feeling homesick, this is the place to go!", "author": "P Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-19", "description": "Horrible horrible shaved ice. The ice was hard and not fluffy. The green tea ice cream on top of the ice was even harder. It was a mission impossible to get a spoonful of the ice cream. The red beans were way too dry as if they were left outside for way too long. Gosh it was just awful.\nThe almon paste was better. Maybe their hot desserts are better in general?", "author": "Jojo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "tip: great service, but the food doesn't completely match up with the pictures.\n\nTiramisu brick toast was good but a lil disappointing because since the dessert is called tiramisu they shouldn't throw in a store bought slice of tiramisu and integrate it in the dessert (should make their own); also the brick toast is built from small pieces instead of one big brick toast which was creative but i prefer the latter.  the green tea red bean pudding didn't match up with the menu picture because the real thing came in a small plastic cup with mushy red bean (overcooked).\n\noverall, it's an average dessert joint with some savory foods offered as well", "author": "Jacky K C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "good dessert! However the drinks are my favorite part. If you get anything fruity order it with Sago (not sure if thats the correct spelling)\n\nstaff are super sweet!", "author": "Larisa V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "If I could give a 3.5, I would. The food is GREAT, but the place is so small that you'll be lucky to get in, especially on weekends when you're most likely to go.", "author": "Austin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "I love this place. So many delicious sweets and beautifully composed choices. Whatever choice you make you can't go wrong.\n\nYou gotta love their waffle ice creams and my absolute favorite, the Baked brick toast with ice cream, fruit, and a slice of Tiramisu cake all in one. I will post up some pictures to explain exactly what I'm trying to describe.\n\nThis time I went dessert crazy! Ordered a variety of dishes with a couple of my close friends, coffee-toffee ice cream, and a slice of rich chocolate cake topped with raspberries and topped it all off with their specialty sauce. \n\nYes, we ate it all at one sitting, we couldn't  believe it ourselves. All the desserts we ordered truly were...um...extraordinary, we were sugar-buzzed for the rest of the day.\n\nService was friendly and energetic. I highly recommend a stop here for a sweet treat. \n\nThe server here named Eva, gave us excellent service, I definitely recommend her, she was also the same person that made our desserts, that's a bonus! Describe how you like it, and she'll prepare it the way you want it!\n\nI would recommend all my friends coming to ETC for afternoon or midnight snacks! I'm a happy customer.", "author": "Steven M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "This place ROCKS! If you like dessert at all, come here for sure. This reminds me of the 24/7 cafes in East LA, where you get good food for cheap!\n\nCame here with my sister on a Friday night around 11pm for some good sister time and desserts. Wait wasn't bad, and they have free wifi. Crowd is very Asian (duh) and student-y. There's one leather love seat with a single armchair across, which gives a little bit more of an intimate space if you're on a date.\n\nWe ordered a plate of fries (my weakness), a waffle with nutella and TOASTED SMORES (sister's weakness), a honey toast with strawberries and chocolate ice cream (if you don't know what honey toast is, it's a thick toast they carve into cubes, toast, and place back into the crust (which is left whole and in tact), mixed with fruits, honey, and ice cream). ALL DELICIOUS.\n\nPlus you're offered free hot tea, with great service. Also had the caramel milk tea and it tastes like milk tea you get in Asia, which is bomb-dot-com.\n\nAll that for about $15. Talk about a great sister gab session with amazing food!!! Will definitely be back!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "Alright, I have to admit that my stomach was already pretty pissed with me by the time my friend and I got here, having been abused with so much food and drink already. But, we were in the area, and we'd both been wanting to try honey toast for a while, so onward we went. \n\nSettling for something a little bit more reasonable (portion wise), we ordered one of their mini honey toasts, with fruit, a scoop of vanilla ice cream, and chocolate drizzled all atop [ http://flic.kr/p/cfz68f ]. After about a 10-15 minute wait as they toasted the bread (I was incredibly distracted/engrossed with the K-pop that was playing on their TVs, anyhow), we dug in to what was, all in all, an awesome dessert. The bread was toasted just right, soft on the inside with a lightly toasted exterior, and tasty toppings. My only qualm, if I had to choose, was that I wish there was a bit more fruit (and that I wasn't so terribly full).\n\n***Accessibility Info***\n\nVenue - No issues with the entrance or interiors. While the cafe is small, things are spaced apart well so there's plenty of space.\n\nBathroom - Pretty sure they don't have one.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "I haven't written a Yelp review in years but this place deserves notoriety. Some of the desserts are unique (at least to me) and so delicious!  A must is the Tiramisu coffee honey thick toast.  A 'regular' size is big enough for two and is brioche cut into cubes then toasted and roped with a cube of a very good tiramisu, a scoop of coffee ice cream, vanilla ice cream, all in a slightly crispy, slightly chewy brioche crust bowl.  Wow.  Not overly sweet, great mix of textures. I also enjoyed a coco mango sago drink- cool, refreshing and textures by the sago.", "author": "C N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-17", "description": "Ew. Not good. Nothing special. Do not get the matcha green tea ice cream on shaved ice.", "author": "Belia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Their tiramisu brick toast is very good! The toast inside is warm, crisp, buttery and sweet and chopped up into little squares. Then it is topped with ice cream and a piece of tiramisu. Simple but great.", "author": "Jeffrey Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "Quick service and delectable desserts- a wonderful accidental find in a very diverse neighborhood. I had the Tiramisu waffle and the silky tofu pudding, both were really good.", "author": "M L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "mMmmmm dessert toast!\n\nI came late Saturday night with friends. This place was empty so the service was good. After asking her to refill our tea, I didn't have to ask again the rest of the night. She came over and refilled it fairly often!\n\nHere is what I tasted/ordered:\n\nTri Berry Toast ($8.95): I thought this toast was good for two, but when the lady started to give us plates with tongs and forks... I was thinking, hrm... I don't want to share! When the toast came out, I was like DAMN! This dessert was HUGE! Toasted to perfection, but the downside is that they don't give enough fruit. At the end, my friend had to scrape the bottom of the plate for the toast to get some chocolate syrup and ice cream lovin. Still a good dessert item! Would come back and get it again. http://s3-media3.ak.yelpcdn.com/bphoto/3jtVh_TAXcSjt0ZYANddLA/l.jpg\n\nWaffle with banana, strawberry and ice cream ($4.95): This was also yummy, but a bit too dense for a late night snack. Waffle was not soggy or undercooked, which is a good thing! If I wanted dessert in the day time, I would order this dish. http://s3-media4.ak.yelpcdn.com/bphoto/urU7A9v4Iktk3eeCF4-wZA/l.jpg\n\nTakoyaki ($4.95): you definitely get chunks of octopus, but I don't think this was really made the way takoyaki is supposed to be made. I just think this was pre-packaged and then put  into the fryer when someone orders it. My friend said he would come here again for takoyaki because not a lot of places give that much octopus pieces in each takoyaki and this place has two big pieces in each ball. http://s3-media4.ak.yelpcdn.com/bphoto/u82R_NPj6AGDIPUO1meKQQ/l.jpg\n\nOverall, I am a fan of this place, I would come again for their desserts!", "author": "Erica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "Went there on Sunday for the first time and wow their plates are definitely pretty! The tastes were also great. We got a whole bunch of different things (i can't recall their name\" but pyramid something, mango delight, mixed fruits shaved ice, waffle w/ ice cream, and one more i forgot. They all tasted wonderful! Looked amazing! \n\nOne downside though was that it took almost too long for the food to come out. We all got our orders at different times and since it took much much longer for some of us, the ones who got theirs first had already finished before we even got ours. Some of our orders took 10-20 mins to come out. Though they told us it might take a while, we didn't expect it to be that long. Especially when there was no other table ahead of us. \n\nGreat! But definitely not a place to go if you just wanna grab a quick dessert!!", "author": "Verdina P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-16", "description": "We stopped by here for some honey toast dessert after dinner. Outside of the cool YouTube music videos that they stream on their TV, this place isn't all that great. I had a craving for honey toast and this was the closest option. Unfortunately, the reviews of \"crouton-like\" is completely dead on. The pieces inside the toast were completely crunchy with no flavor. The ice cream was your standard run in the mill. The place seems to be family owned and ran; the people were very nice so nothing against them but this is not a place I can recommend anyone going to for dessert. They did have random bottles of Ace and Dom P. for some reason; that made it interesting.", "author": "Jimmy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-01", "description": "Do not get anything besides the fantasy desserts, it will not be worth it.\nI tried the mango sago tofu pudding, got sick of it after 3 spoons.\nI hate how this place opens at 6pm...", "author": "Josie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-14", "description": "It is not bad or good; average really. With many HK-cafe substitutes within a few blocks - on the same street - the \"newness\" factor is the most likely reason I would return.\n\nPros:\nNewly opened\nGood clean working furniture\nCriss-cut fries instead of regular fries\nLobster balls were good\n\nCons:\nMilk tea was mostly hot water w/condensed milk; little tea\nDid not have a couple of items we wanted\nSo-so chicken wings\nStreet parking is harder to find on this block\n\nKudos to the waitress who did her best, and kudos to the youngish owner(s) for opening a business that is already saturated. However, they were sitting not that far away might have even heard some of our requests. And, instead of asking us while sitting nearby, waited for the waitress to ask her what our requests were...", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Friendly staffs and very good service, the thick toast dessert are the rare and tasty. And you can go with some asian style dessert like tofu fa. We will be back.", "author": "Leanna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "I went here last night at around midnight as opposed to the usual Creations outing. The place is pretty small, but a group left just as we arrived so we were seated quickly. \n\nWe got the Tiramisu Coffee Honey Brick Toast & Waffles w/ Mixed Fruit. The honey  toast was really good & the bread was toasted perfectly. The only part I didn't like was the crust holding everything together (it was too hard).  The waffles & fruits were so-so. It wasn't bad, but it wasn't super good either. \n\nI would definitely try this place again and get the other desserts they have, but it's not at the top of my list. Akiba is still my favorite for honey toast!", "author": "Jillian Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "This is a great place to come and chillax with your friends and get desserts. They serve the thick toast bread with lots of variations on toppings. I've only been here twice and tried the tiramisu coffee thick toast (super yummy!! definitely my favorite so far) and the oreo banana thick toast (this was just ok...) \n\nThey also serve lots of other things like snacks (we had the takoyaki (squid balls pretty good, spam and egg ramen (I can make this at home), buffalo wings (not spicy at all.. just taste like regular wings), and mango sago (very refreshing).\n\nI'd definitely come back again even tho it's out of the way...", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "Let's welcome Irving's NEW Hong Kong dessert joint, ETC!\n\nTheir illuminating blue fading lights can be quite difficult to miss late in the evening, which is how it caught our (my girlfriend and I) eyes. Upon entering the small but spacious cafe, your eyes will dilate to their bright white and orange interior walls while K-pop is bumpin' in your ears (due to their beautiful 46\" LED flat screen). My girlfriend didn't mind whatsoever since a couple of 2NE1 music videos were stuck on repeat.\n\nSesame Paste with Rice Balls ($4.25) - http://www.yelp.com/user_local_photos?select=zKVo88dC1dvCazQCfFI46g&userid=5jUlCtMCI9Z7poi1vHq6cQ\nI'm not much of a fan of sesame paste so this dessert wasn't for me (my girlfriend's order). The rice balls wasn't as firm as I wanted it to be, resulting in a mushy texture (if you like your rice balls like that) and the paste tasted a little grainy-like. \n\nFresh Mango & Coconut Milk with Black Sticky Rice ($4.50) - http://www.yelp.com/user_local_photos?select=6sjrW1eQB1tT2sbH-_uTVA&userid=5jUlCtMCI9Z7poi1vHq6cQ\nThe mangoes were fresh as stated, but there wasn't a ton of it. I know it's not in season yet so I won't dock em' for it. On the other hand, the warm black rice blended with the coconut milk created a really refreshing hot dessert.\n\nHong Kong style Waffle with Banana and Ice Cream ($4.50) - http://www.yelp.com/user_local_photos?select=X3Xj9JhEBqbyyTBruRgKCg&userid=5jUlCtMCI9Z7poi1vHq6cQ\nThe waffle was warm and fluffy, the slices of banana were drizzled with light chocolate and sweet syrup and need I mention, you get 2 scoops of ice cream! I did wish that the dessert could have been arranged together more as one instead of segregated on the plate (see picture). If placed on top of each other, the warm waffle should slowly melt away some of the ice cream while the bananas and syrups seeps into each nook and cranny of the waffle -- that's how I'd do it.\n\nETC hasn't perfected their desserts quite yet, but considering their grand opening was only a few days ago, it looks like they know what they're doing. Complimentary hot tea for all guests is a standard. ETC also serves up Chocolate Fondue set (served with mixed fruits and cotton candy) which is new to many HK-style dessert joints I've been to, so kudos! \n\nOverall, it's really affordable, not to shaby desserts for their soft opening, open late for your 4th meal shennanigans, and extremely friendly hospitality and service. I hope you like k-pop!\n\nPS: I have to add this. \nTheir restroom is not within the cafe, but actual in the next door building, up the stairs. If it's late in the night and you need to make that head call, DON'T GO ALONE!! Seriously, it's pretty dark in the building and it even gave me goosebumps while I was going (felt like a scene from the grudge).", "author": "Albert L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-21", "description": "SO i came back and tried their mango pudding.  It was UNDERwhelming.\n\nWe got it to go because it was really late, and it came in a pretty fair sized Styrofoam container.  It was just SO small, and the fruit was canned and just not very good.  There are SOME times when canned fruit it okay.  Canned peahes are pretty good, and sometimes pears, but if I'm going to order a slightly overpriced mango pudding, I want MANGO pudding, condensed milk, and little bit of Fresh fruit.  \n\nHowever, I would DEFINITELY go back here for the TOAST! :D", "author": "Aly A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "This place was so cute! And the waitress was super nice!\n\nWe came to try the honey thick toast and ordered the strawberry one, and not only was the presentation beautiful, but it was DELICIOUS! Basically, they carve out the inside of a piece of bread, an cut it into cubes, and toast it with butter + honey! Then place it into the bread shell, add ice cream, cheesecake, and strawberry syrup... yummm!\nWe also tried the waffle with mixed fruit + ice cream, which was yummy as well, but not as novel as the toast. \n\nWould definitely come back to have more honey toast!", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "It's hard to miss this place when you go at night. They have those beautiful blue lightings hanging from the ceilings, covering the entire window. When you go inside, it feels like a warm, cozy place. Owners/Servers are really friendly and sweet. They've JUST opened, so I understand that they may have a lot to improve, but I can see that they're trying their best to satisfy the customers.\n\nI had their ETC Dessert Cafe Grass Jelly Special, chicken wings, and curry fish balls. They're delicious!!! I'm definitely going back again!", "author": "Peggy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-11", "description": "It's an ok plane... Nothing to race about... Just limited service and open forty late night dessert", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "We had our second visit to this place, the atmosphere/decode has definitely improved, and the honey toast and creme brûlée were both better than I remembered. The mango sago type dish we tried was a bit thick on the concentrate that they use as the base and could have used more sago, but over all I feel that this place has definitely improved. The service was also faster than last time which is always a plus.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "This place is really small and the service isn't the best, but the brick toast here is worth the visit. I had the strawberry cheesecake brick toast which was so satisfying after a long day of exploring golden gate park.", "author": "Kern S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-16", "description": "First time I came here I ordered the grass jelly mountain and the strawberry honey toast. The quality of their food is very mediocre and I wouldn't deem this the best place to get your brick toast fix. The grass jelly mountain didn't taste as good as it sounds; it's something I wouldn't order again. The second time I came back I got the chicken wings and matcha green tea brick toast. All I can remember is how salty all the food was. The chicken wings were definitely frozen and they just reheat it before they serve it. Some of our chicken wings were still cold...which was kind of disgusting. And the matcha green tea brick toast was extremely salty. Maybe they made their bread differently that time but I had trouble finishing it without drinking 2-3 cups of water. Overall, I wouldn't come back here unless I was really desperate for dessert and every other dessert places in SF was closed.", "author": "Annie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "we came in because this place was the only one open on the block. I really like the fast service and the food was really good. they gave us free tiramisu for a 20$ bill with a check in. the waitress turned tables quickly and had a lot of patience when we were ordering. the interior design is very cute with pink walls and fun decorations.", "author": "Gina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "I came here two times already for their honey toast box! Both times I got the banana berry (which is not on the menu) but I saw it on yelp. The first time I had it, it was amazing. The crust was Crunchy and easy to eat. The second time I came here, they used a different kind of bread but I didn't like that one because the crust was hard and rubbery? So it was hard to break off and eat. So sad.\n\n\nI really hope you guys change it back to the old one!! Please !", "author": "Emi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-27", "description": "I've been here so many timmmmees, I always love their waffles / brick toast.\nService is amazing.\nI bring my friends as well. I've never tried any of their drinks except their smoothies and they're yummy.\nI'm not feeling the shaved ice tho or the tofu. But otherwise the other things are pretty good :)", "author": "Donna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-15", "description": "Ehh, service here is not so great. Portion sizes are pretty small. I mean, it's not expensive, but the quality of the food is also mediocre. The waffles could come out burnt, or maybe right? It's hit or miss. Tables are easy to find early on, but even the ice cream isn't very flavorful. You can do better. Janky menus inside plastic wraps. Hilarious.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "We always get  the tornado potato and the takoyaki every time we come here. The wait is never too long. Their brick toast taste heavenly. Man there is just isn't enough adjective to describe the food here would definitely recommend to other friends and families.", "author": "Jeffrey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Decent Hong Kong Style Desserts! The wait for the table was incredibly long on a Saturday night but it was worth the wait. Had the mango dessert and it was good.  Can't wait to come back again.", "author": "Janet W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-06", "description": "The place is cute and cozy, a nice hang out spot.\nThere was alot of choices on the menu, but I had to try the tick toast. \nI tried the tiramisu toast and it was delicous, I loved it.\nIt's big so you can share with friends. \nI will definity come back for it and also try their other varieties too.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-24", "description": "Ate here yesterday around 11:30pm. It was possibly one of the only places that was open this late in the city to help satisfy my sweet tooth. \n\nThe restaurant is a bit tiny and we lucked out with some seats.  It's very simple and plain decor in the restaurant. Nothing too fancy, but definitely not ghetto. \n\nThe staff was very courteous and seated us immediately and was really helpful with the ordering and just recommendations and such. \n\nEnded up ordering the Grass Jelly Shaved Ice with green tea ice cream:\n-ice cream was delicious and we ended up getting two scoops before hand and I am glad we did so \n-portion is standard on this \n-the ice wasn't really soft and felt hard and had thicker pieces, which I felt was the come down for this dessert. \n\nWas still hungry so my fatass ordered the chocolate macaroon toast: \n-the toast inside was pretty delicious and good \n-the macaroon was hard and not the typical soft kind that you'd expect \n-the chocolate ice cream was well, just like how it should be, chocolatey \n\nOverall, this dessert looked better than it really tasted. It wasn't bad, but it wasn't amazing. I can definitely pass on this for next time. Damn those photos! They tricked me! \n\nPricing for this dessert place is pretty reasonable. Both desserts came out to be around $14ish \n\nThe also accept credit cards, but uses the app called Square so they will add a .20 fee if you choose to use this method of payment.", "author": "Suzie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Nice and cute place, marshmallow waffle is my favourite. Strawberry sweet heart honey toast is delicious.", "author": "Narisa A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-12", "description": "It wasn't all that great. My friends decided they wanted to get desert after our dinner at san tung. So we decided to give this place a try, since it was the nearest and open. We ordered the creme brulee, strawberry and waffles with ice cream, and mango pudding for me. The creme brulee was meh.. tasted like refrigerated store bought. The best thing about the strawberry and waffles was the ice cream. And the mango pudding was not good. The best part of the mango pudding was the fresh fruits that came on top of the pudding. and as for the pudding, the texture was mushy and flavor was bland. \nI feel bad for giving two stars but i just cant bump it up another one.", "author": "Tina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "This small cafe has a BIG menu. First of all, their brick toast is much better than Akiba! They are loaded with a variety of fruits and ice cream. It's a little heavy and big for one person so I recommend to share. Also try to avoid weekends and high traffic hours because this place only has about 6 tables so if you're in a hurry and don't want to wait for your dessert fix, there are a few more options around the area.\n\nOther wise, I like their extensive menu selections. They have a creative combination of drinks and I will return on an slow day.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "The food were so delicious and good services. I got Takoyaki and Taramisu Toasted. I got pasta also. That's so yummy! I can tell I will back soon :)", "author": "Zin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "First timer with my friend. We ordered a pyramid toast with strawberry ice cream on top of it. Its honey toast tastes great. In addition, my friend ordered a cup of green tea ice cream with red bean. Tastes so fresh. Love this place!", "author": "YY Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-12", "description": "Really tiny place but has some long sofas for larger parties.  \n\nThe green tea red bean honey toast is not bad.  The toast came out warm which accentuated the honey and had a nice crisp and soft texture. However, the rest of the ingredients seemed to be processed or come straight out of a can.  \n\nThe takoyaki is nasty. Don't order it.\n\nProbably won't be back because there are better options in the city. Heck, even down the street.", "author": "Renee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "We got the green tea pyramid, iced green tea latte and Nutella toast. The food is great and this is definitely a good place to hang out with your friends. Five star dessert place!!!", "author": "Lori W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-16", "description": "A) .30 cent charge per card used to pay the bill.....\n\nB)tiramisu brick toast taste like deep fried bread from a failed french fry experiment...\n\nC)1 incompetent waitress for a seating space of 20..The raiders have more depth on their roster then you guys...and when you get your menu, it looks like something made in a kindergarten classroom thats not even laminated, but just sealed in a GLAD Ziploc bag.\n\nD)Even attractive looking asian girls here get shit service....strip clubs give you more service when your paying the cover charge than what you get here...the only way you really get service is by being buddy buddy with the FOBS who work here...and i mean HK speaking fobs, not the american chinese speaking asians...\n\nE)They don't wear gloves when they handle uncooked foods and switch to taking care of condiments, sauces, syrups for the toast...you may end up getting food poisoning...trust me... its almost as bad as Mr Fong in Daily city ..(gag)\n\nF)The blender they use looks, seems and sounds like a holdover from the previous establishment that existed before ETC took over...it not cozy...its tacky and cramped in here....like a undersized karaoke bar....\n\nG)How the hell does your front door handle look cleaner than your cashier counter top? oh wait a minute, you guys don't even have a fitted cashier space, let alone a competent worker as your cashier....another broken asian stereotyped expectation.. ...\n\nOverall Result: This place makes taco bell across the street feel homey and welcoming.... ETC is not worth it...\n\n--When the room is full of fit/skinny/slim asian females, theres no way the space is so supposed to be crowded like the DMV lobby area......congratulations to ETC you found a way to do it....\n\n\nE.T.C = Eat Their Cr*p.....you can fill in the missing letter.\n\n-----------Final Grade 0/7:Failure-----------", "author": "Eric C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-02", "description": "This reminds me a lot of Shooting Star cafe in Oakland. Although ETC serves similar desserts,  plays melodic tunes during the peak hours of midnight, it is a little more cramped and FAR from where I am from. There isn't anything magical about ETC that persuades me to come back other than it closes late. \n\nMy friend and I split curry fish balls and the special snack platter. Portions were small. The snack special included: fried potstickers, fried squid, fried chicken and a dough/potato/squid pastry. \n\nMy favorite was the curry fish balls. The other were salty and highly mediocre. Maybe I should've tried their desserts instead.", "author": "Phuong V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "My buddy's friend came into town and she wanted to go to a Asian dessert place so I decided on trying this place since my fellow yelpers recommend it, according to the 4 stars. hehe\n\nI ordered green tea ice cream on waffle and fruits. A lot of the fruits were sour and I can tell some were canned, oh well what can I expect? A bonus to this place is that they play k-pop! HAHA The waitress was nice and polite so that's a another plus. I couldn't stop turning around to watch the MVs. My friends didn't really enjoy their desserts and I don't think we may come back but it was worth a try. \n\nHmm maybe we ordered the wrong items? If you have a late night sweet-tooth sure, this place doesn't close until midnight.", "author": "Victor Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "There's a wide variety of HK snacks, desserts, and drinks including \"healthy\" drinks.  I was fixated on the Bread Box, but being weaksauce, I downsized to the mini version, which is just a thick slice of toast with the same toppings.   The mini Oreo Bread \"Box\" was as good as it looks to satisfy my sweet tooth - warm and crunchy (perhaps too crispy) toast with Oreo and ice cream goodness, although the fruit was just ok.\n\nService was a bit slow even for a small place, which was half empty.  On the plus side, there are couches for more casual lounging instead of just tables.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "I have to up my rating, I'm here *way* too often not to, mostly to take advantage of the Honey Toast, \"Golden Sesame Balls\", and sticky rice with mango... Mmmm...\n\nI do think it still needs a little bit of polish, but once that happens this will definitely be my favorite go-to hang out in the area.", "author": "Emilynne A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-28", "description": "I should have read the reviews before stepping in to the place last night. We friends were looking for a quick dessert cafe on our way to home, when we came across this sign board of ETC Dessert Cafe. Well, without a much thought give, we decided to give it a shot and continue with our night. What I noticed - \n\nThe service was terrible, ultra slow. \nThe menu was quite impressive in terms of quick bites \nStaff was not at all trained for hygiene \nThey charge extra if you pay on your card. \n\nExcept for point two, none of them made any sense to me. So I'm never going back to this place to have anymore desserts. Phewww!!", "author": "Dinkar K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "I came with a few friends to get dessert and the fours of us shared two honey breads. We waited probably about 20 minutes for it to be made. It was good, pretty much like every other place that sells brick bread.", "author": "Sandy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "It's lit fam. Everything is bomb. Y'all should come and try it here. The food is amazing! And they have good customer service! Good place for hangouts!", "author": "Steph A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-29", "description": "The place is small, didnt have to wait in line. The food came our fast and the girls there like to show off their legs... (it was a ok summer night). Everything there is overly sweet but the presentations are nice. The server that night was attentive at filling up my water cup but when it comes to her table bussing skills.... all I have to say was she almost dropped all the plates to the floor. Inexpensive and good for 2-4 people parties. It will be hard to accommodate parties with more than 4 people. The restroom is located in the building next door and the key to the restroom is right at the door.", "author": "Jan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "When I found this cafe, there were many blue  christmas lights at the front. You can't really miss it! When we entered there was only one waitress. She gave us menus and we all asked for water. 10 min in our water finally came... but she didn't get enough for everyone. So we just assumed she would come back with more.... but she didn't. 20 minutes later she finally got our orders. I had the dessert sampler, and my sister had the mixed fruit w/mango juice. 20-30 minutes later our orders finally came... which felt really long. My sister enjoyed her dessert, except her pineapple wasn't fresh. She said it was old. The dessert sampler was pretty good, my favorite would have to be the creme brulee and the mocha ice cream w/cake. Once we were finished we had a hard time getting the waitress to give our checks. We waited another 15 minutes or so again. \n\nOverall the desserts were pretty good, excluding the pineapples. The creme brulee is definitely my new favorite dessert. Nonetheless service was incredibly slow, one waitress shouldn't handle the whole cafe. I left with mix feelings about this place so thats why I'm giving 3 stars.", "author": "Doris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "If you want honey toast, this place is definitely a go to. I am not an expert, but I do like that the honey toast here is better than other places I have tried, like 5 Degrees and I dare to say Honey Berry and Akihabara. It does take time because they cut out the bread, butter it up, toast and reassemble the inside back into the crispy toast shell part. It takes like 10-25 minutes depending on how busy they are, but definitely won't be a problem if you bring friends. If you are stuffed from your dinner and you come here, your stomach will be ready by the time the honey toast gets to your table. They have a nice selection of honey toast. The ice cream doesn't melt right away , which is a plus. The bread is super crunchy and the butteriness isn't too overwhelming.", "author": "Cynthia D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-21", "description": "I wanted to like this place, but the dessert was not up to par compared to the other Chinese dessert places.  \n\nI ordered a fungus soup with papaya and it was not really sweet.  My friend ordered the black sesame paste and it was watery - it should be thicker.  Also, we ordered the waffle which we thought would be like a eaglets to share, but it was actually 2 waffle with condensed milk.  Unfortunately, the waffle were soft - prefer to be crispy.\n\nIt was a total failure and I wonder why it was empty on a Saturday night.  I mean, if you going to have a Chinese dessert place, make your desserts at least decent.  Big failure.  \n\nOne good thing was they asked what they can improve on, my friend told them.  I don't think we will be back.  Nice place but it was not worth it unless they make a big improvement.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "Don't usually go into dessert cafés, but some friends and I had just left a concert, exhausted and thirsty. Since it was one of the only cafés open near my apartment, we stopped in only for a drink, only to be enticed by the menu. I ended up ordering french fries and an Oreo shake. The atmosphere was quite chill and forgive my ignorance of not being able to recognize languages, the Cantonese(?) music was really cool. Being that we came in late, I felt pretty bad because there was only one employee working. However, she was so cute and friendly! \n\nWhen I received my oreo shake, I was so surprised, it was pretty good! The fries were perfectly fried too. \n\nCute place! I'd come back again.", "author": "K N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Very cute place and their creme brulee is really good! They give free dessert when you check in which is a plus!", "author": "Scott Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "First time coming here. Dessert was okay. Service was friendly and it was a chill place to hang out.", "author": "Anita L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "I have to admit, it is small, and sometimes slow, but they make the best damn nutella waffles with marshmellows on the whole block, even from their competitor next door whom always seem to have lots of customers. Honestly, just because they have lots of people means nothing. ETC Dessert are attentive and always have some chinese films on! Get the nutella waffles with marshmellows! AMAZING", "author": "Sandra D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-26", "description": "Ever have a bland bowl of ramen that just has absolutely  no taste? Well guess what this place? This place just won the award for the most disgusting bowl of ramen with no taste  at all. Seriously peeps you can't  just messed up a bowl of ramen :(", "author": "Lu Lu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "My friend and I were searching for a place that served honey toast. We came across this place and decided to try it out. Inside it is decorated super cute! The service was great! And the strawberry sweetheart honey toast was amazing!", "author": "Ashleigh R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Dude it wz hella good food. My squirrelfriend squad came here for a girls night out. We got a regular size tiramisu honey toast and it wz fuego. I will definitely be coming here many more times in the future and tryig out more of their food as well", "author": "Kanika G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "This place has the best creme brûlée ever good price for the portion size. Also this place is one of the few places that serve sharks fin soup. HELLO!", "author": "Gio D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-26", "description": "Since I was sick, I thought it might be nice to have something warm & sweet to coat my sore throat.\n\nI got a Stewed snow frog with papaya to-go which cost close to $8 but only filled up half of the tiny container (see the picture).  It was super sweet & some of the snow frog tasted really fishy because there was still some blood left behind.\n\nThe service was slow but it was good.  There wasn't anyone else in the store but it could be because it was very new.  I was really excited to check this place out since there aren't any Chinese dessert places nearby.  But I think I will wait to decide whether or not to go again until there are more reviews.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Service was amazing! The waitresses were friendly, accommodating, and understood what I requested. The ambiance could be better. I love the lights at the front door (looks like a lounge haha) but inside was bland and simple. \n\nI had pasta carbonara and takoyaki for the meal. They were both mediocre. I wasn't expecting some bomb-ass dish anyway. I just need some tummy filling food. Then I moved on to my mini-Tropical Delight Honey Toast. I regretted ordering it mini. It was so delicious. The toast just melted it my mouth. The cantaloupe flavor ice cream went perfectly with all the fruits and condensed milk haha. \n\nOne downside will be that they do take time to prepare each plates. But then, that's fine because I was there to spend some quality time, enjoying the dessert, chatting etc. Was not in a hurry at all.\n\nAll in all...stop by and try the toast! The solution for your sweet tooth problems !", "author": "Tipsy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-19", "description": "Nice waitresses.\n\nSo this place is called ETC Dessert Cafe, so of course I get their pasta. Makes perfect sense, right? Although the chicken was cooked fine and the pasta was the perfect al dente, goopy clumpy sauce ruins a dish every time.\n\nAlso, the wifi wasn't working, so they told me to use someone else's. They just happened to also have the password on hand. Laughs were had, internet was stolen.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-28", "description": "had the waffle with chocolate and nutella i think it was pretty good. my freinds order some other stuff that they liked. i ordered a matcha green tea or somthing it was ok. me and my freind both order this mango drink that was good.\n\nsome of the desserts was ok and some were good. the presentation was very nice but they did take a while to make them look all good i guess. the place is kinda small, we got there and was able to get a table for 4 without wait. i also like the look of the place i guess i am a sucker for that but i would come here again", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-13", "description": "Extremely slow server seems confused. Awkward experience food was average nothing really special about it", "author": "Sherry F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-10", "description": "Service: Good. We had to flag the girl down a few times to get more tea. 1 star\n\nDessert: Meh...it wasn't all that good. My taro coconut sago had no taste of taro or coconut. Tasted like watered down coconut with a load of sago. \n\nThe place is quite small but we didn't get kicked out for staying an extra hour or two just chatting. Kudos to that. 1 star", "author": "Serena F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "Love the LA meets SF food. Small nice place. Service is slow then again it's handled by one waitress. I love the bread with fondue or even the brick toast. Fruit isn't fresh because it's served when not in season. Peaches were canned and honeydew tasted like pure water. Brick toast is #1.", "author": "Vic A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "Customer service: Excellent and friendly people who work here!!!\n\nFood quality:  Tummy satisfied LOL pretty delicious :)\n\nThe only downside is the waiting period for the food to be prepared but I believe in food quality rather than just eat and leave.  After all it is a dessert place which is meant for people to relax and chill... :) \n\nI will def be going and try it out again LOL", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "Okay i haven't tried it here but that's because i've been trying for few times now! It says it's open from 6pm till late but our attempts failed because they are still close by 6:30! Tried again the orher day by around 7pm and it's still closed! Hopefully next time it will be open like they said it will be open!", "author": "Em S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "OMG, this place is a stoner's heaven. It's open until the early morning and they sell the most amazing desserts ever. I like going here once in a while to splurge on something huge. It is pricey but totally worth the money. I like the ambiance of the place. It has a younger crowd that adds a nice feel to the place. \n\nFor a while they had this really tacky set-up with cases displaying iPhone cases. I stopped going after this because it gave the place a different feel. Before this they had a really nice set-up with a couple of couches and a table between for people to sit, chill and chat but they took it out and put in this cabinet to sell cases but took it out because I don't think it was doing well. I just want to say they had a great thing going before I wish they would've  just left it they way it was. \n\nOther than that the food is awesome, I couldn't be happier with anything I get here.", "author": "Krishna V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-29", "description": "After dinner one night my friends and I were walking around irving in hunt of a dessert place to satisfy our sweet tooth. We saw this place and decided to take a shot. It's a cute little shop with about 6 little tables, some sofas. The place is decorated with blue christmas lights and looks nice... too bad it was one of the biggest dessert disappointments I've had.\n\nSo we sit down and promptly get some hot tea. The waitress is really cheery and nice and it all pretty much went down here from there.\n\nWhat we had:\n\nDessert sampler ($9.95) : it included:\nwatery creme brulee with a very stiff sugar coating, soft mango pudding with some cream? on top, didn't taste like mango; a bite of tiramisu that was half forzen, 1 strawberry chopped up, 2 mandarin orange wedges, one wedge of kiwi, 2 balls of watermlon and 1 of honey dew, plus two tiny spoons of ice cream that was beginning to get gritty because it was old\n\nWaffle: 4.95: it was a cold waffle (semi stiff like it had been cooked a few days ago) The size was that of half a round waffle, with a scoop of ice cream, a few pieces of fruit, a little drizzle of watered down chocolate and some whipped cream.\n\nThis place is basically about false presentations. Everything attemps to look 'cute', but nothing actually tastes good or has much value. What makes matters worse is that it took 30 minutes at least to get everything and the anticipation didn't make anything taste better!", "author": "Christine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "Good place after dinner. Decent dessert and  service. 4 stars because the restroom is quite scary :D", "author": "Son N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-05", "description": "I usually just go to Golden Island when i'm craving chinese desserts. But I just had San Tung, and I was on Irving might as well... \n\nThe desserts are MAD expensive, for such a small portion. The service sucks, it's just girls who try to remember what we ordered and kept coming back to ask... Small place too. \n\nNot coming back. As far as desserts, it's too sweet.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "Doesn't have as expansive a chinese dessert menu as say Golden Island, but you can find some stuff like the sesame rice balls in ginger soup. This time I had the honey toast - this stuff is way better than at Akiba's, but too much for one. The crust was very crispy and buttered even on the inside, and the cubed up insides were also toasted. Their \"minis\" are still friggin large! They also have a checkin offer for another free small dessert if you spend $20+ right now.", "author": "Linus W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "Third time here & still excellent service! Love the brick toasts, snacks, & sampler!! Environment/atmosphere is very cute and bright! Everything is very customizable & looks true to pictures on their menu!\n\nThis is the only other place I am always happy to go to besides Sweet Cafe for late night Asian desserts! I highly recommend their honey toasts and if you have more than one person, their regular size is just perfect! On your own? Try a mini if you're not too hungry!\n\nTheir snacks are pretty good too. The first time I came here I was actually looking for a cozy place for desserts&snacks. I tried their \"imitation sharkfin soup\" and it wasn't too shabby! Their creme brulee is also delicious! After the first time, full off a few snacks, I decided I would love to come back for some of their brick toasts & it did not dissapoint! :)", "author": "Carin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "Can't decide between 3.5 or 4, so I just gave it 4 stars.  The first few times I came here, I thought the tirumisu toast was delicious.  Not sure if it was because we ordered the mini toast, but this past time, we ordered the regular size and it wasn't the same.  We also order the mixed fruits with jelly, which was a little too sweet for my taste.  It was drowned with condense milk. \n\nService is usually good.  The server is very sweet, but there's only one person working, so service may be slow when there's a rush.  I also deducted one star because they don't have a restroom there, so you have to go next door, up the stairs to some building.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "HONEY TOAST! Yummmmmm. \nI came here with a few friends after a concert in Golden Gate Park, and we tried three different desserts. But the honey toast is the only thing worth coming back for.\n\nIt's basically a super thick piece of bread that's carved out. They fill it with toasted cubes of the bread, fruits, ice cream and whipped cream! The bread is toasted with butter and honey, which complements the ice cream really well. The dessert is sweet without being overly sweet, and easy to share with a group of friends.\n\nWe also tried the waffle with icecream & fruit, which was very standard, and black sticky rice, which ended up being really soupy and kind of strange.\n\nThe shop is pretty clean, and the waitress is really nice. Definitely would come back for more honey toast!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-11", "description": "The only reason why i will have SoCal withdrawls is because of the food in SoCal.  One main dish that i miss is the Brick toast.  I've had other brick toast in SF but this place has the best selection.  There's matcha green tea, tiramisu, a fruity one, and an oreo one, i'm sure they have more but i  don't remember.  You can also get a mini toast if you can't finish it with your friends.  My favorite is the Matcha green tea one, because it's not as sweet as the tiramisu one. Chocolate lovers should get the Tiramisu one. Their bread is is more buttery compared to other places and it's so more crunchy too.  They have other types of toast here, and the employee told me that the those toast are prepared differently and they use different breads.  I have yet to try their other desserts here. I've had the Nutella mashmellow waffle and it was really good esp when it's warm.  The place is pretty cozy, and they have a tv that shows you K-pop music and other Chinese music.  I think this place might be topping my fav. place to get brick toast!", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "ETC is just the perfect name for this tiny dessert joint on Irving. They have a great selection on all things desserts from honey toast boxes, sago, ice cream, waffle ice cream sandwiches, and ETC! any given day, I'd hate to trek my way to Irving but at night, thank goodness the streets are all clear and parking is a breeze! \n\nIts not hard to find ETC as there are lights flashing on the outside to welcome you in.\nLuckily there was no wait around 9pm and we immediately found a seat. But damn those honey toast boxes for taking so long. We were still waiting for a friend to arrive and it just so happens that a group of 10 each decides to order their own honey toast box. Do you know how long it takes to make one? About 10-15 minutes. *shakes my fist in the air* \n\nEven with the wait ahead of us for food, my friends and I shared a honey toast box with strawberries and ice cream, and an order of chicken wings! We didn't realize how hungry we'd be and finished in no time when it finally arrived. The honey toast is tastier here than Akiba. It has more of a crunch while still soaking in the ice cream. The chicken wings are delicious too. Nice batter and flavorful! \n\nI definitely plan to come back in the future and hopefully they can surprise me with more desserts, oh say I don't know, crepes, bread pudding, gelato, brownie ice cream sandwiches, etc etc etc!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Definitely one of my favorite places so far from my visits to SF. \n\nWent there to get food and brick toast. The lady working was super helpful and friendly. She seated us with menus, asked if we wanted water or tea, brought tea and took our orders. She kept in mind to ask us things to get us more comfortable such as asking if we wanted our brick toast after the food or at the same time. She made sure to inform us that brick toast will take about 20 minutes or so before we ordered it (but it came faster). While we were waiting for the food, she saw that we had our phones out and was thoughtful to come by and tell us the wifi password. NEVER had that happen before and LOVED that she did that. +1 right there.\n\nThe overall atmosphere of the place is like a small cafe shop with a tv in the middle playing Korean music videos and Korean songs in the background. \n\nThe food was good too! We ordered the Strawberry ______  brick toast. So everything went well here but what really brought it up to 5-stars was the service.\n\nWill definitely come back!", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "A great little place that is super cozy!\nThe desserts are good and the people who work there are nice.\nThe best part is it's not too busy so we never have to wait to get a seat.\n\nP.S. they accept Square! Way to support new tech! :D", "author": "Clement N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "I first learned of this place back in August 2012. Late, I know. ETC is awesome in a lot of ways and I think I've been here possibly once every 3 weeks since my cherry was popped.\n\nSo why 4 stars? Although Eva is extremely nice, sometimes I don't feel as if staff are completely attentive. That's about half a star because I really need my water refilled instead of staring at an empty glass. I also haven't really had their signature toasts so I can't honestly say they're completely amazing in my dessert book.\n\nMy favorites:\nFor appetizers, I really like their Curry Fish Balls. They're the right kind of spicy and definitely wake up your taste buds. For an entree, their special pastas are a nice-sized portion for the price but I like the creamy mushroom pasta with chicken the most. Hands down, I LOVE the Mango Macau Pudding. I don't know what it is about it but it's just so satisfying.\n\nAnyway, I'd highly recommend anyone whose looking for a dessert place to visit ETC at least once. Everyone usually goes for their signature toasts but they have a good selection for every appetite.", "author": "Angel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "We got the green tea and red bean shaved ice with green tea ice cream. It was pretty good! The ladies who work there are super friendly :)", "author": "Lincy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-30", "description": "I came here on a Tuesday night and it wasn't that crowded. There was a parking spot right outside.\n\nWe ordered a honey green tea, the fin soup, and the soft tofu flower with the mango and sago. They didn't give us hot tea. Was I supposed to ask for it? Anyway, the honey green tea taste great. The fin soup is pretty good, but I wished there was more \"fin\" in the soup. The mangos and the mango juice that came with the soft tofu flower was from a can. I was particually disappointed because pretty much all Asian dessert places use real mangos.\n\nETC isn't all that special. Just a normal Asian dessert place. Maybe I'll come back and try their toast, since they did look good but we were too full to eat that.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "Dinner is nice with drink! Food is not bad, and good place to spend a night with friends. Check in with yelp can get free desert when spending $20+", "author": "Randolph T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-17", "description": "Not my first choice for Chinese desserts in the Sunset, but I'd return.  \n\nOpen late, nice chill crowd (some come to watch Chinese soap operas, chat, and have sweets), standard snacks.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "I LOVE adventurous food and this place served it up right away! Everything was funky and super Asian - my friend who'd spent abroad in China was freaking out about how authentic the experience was. \n\nThe gal that served us was very interested in us having the best experience, telling us how to eat the dessert we got, recommending others for next time, and generally very much trying to make sure we had a good time.\n\nWe got the chocolate macaroon toast party and just the name alone made it worth it, but it was delicious and different and I can't wait to try more. Their presentation is fantastic! Super beautiful!", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "Was looking for a Honeyberry store but found out it had closed. Luckily, found this place and the reviews seemed good. Kind of a small place. Needs a better menu board. I had already been looking through pics to see what looked good. Waitress handed me a menu and another card that had pictures of various desserts. Didn't  seem to have all the different kinds of dessert though. So I just pointed to one in the Yelp pics. Asked if I wanted the regular size (brick) or mini. The regular size looked like too much (I had just eaten dinner) so I chose a mini Tiramisu Coffee Toast. The toast was about 1.5 inches high and the inside was cut to separate from crust and cubed. Topped with coffee ice cream, cookie, tiramisu cake and some strawberries. Tasted similar to a toast dessert had at Honeyberry. It was really good. I'll have to try some of the other selections next time.", "author": "Ronald C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-14", "description": "2nd time Coming here on a Saturday night at 11pm. Strawberry sweetheart toast too sweet and the service is terrible. They never check up on you, you have to raise your hand if you need napkins or water etc haha", "author": "Kathleen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "I came here on a mission to try HK style french toast.\n\nThey didn't have it on the menu but the female employee ordered the closest thing they could conjure. What I received was deep fried bread with peanut butter inside, a square of butter on top, and syrup on the side. It wasn't soaked in egg, but it was still fun to eat. I was even able to get some condensed milk instead of syrup. Really great service.", "author": "Rahil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "very delicious and nice store！I really lo ve the jasmie green tea and complimentry tiramisu！", "author": "Le A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-07", "description": "So my mom and I were looking for a dessert shop. This place had ok rating and we never been so I thought we would give it a whirl. Did not have great expectation. \n\nThe decor was too cute kinda kiddish. The service was very nice. Our server was very attentive but didn't hover. Reading the reviews seems honey toast was their specialty and the waitress confirmed. We ordered the tirimisu honey toast and sesame glutinous balls. The sesame balls came out first and they were good. Not a big fan of the syrup but the balls were good. Better than the frozen one from the store.  We had WTO wait a while for the toast", "author": "Sharon C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-02", "description": "We always get boba from the place next door and grab pho @ Kevin's so we decided to try this place out for dessert. Overpriced desserts, small portions, but the reason for 2 stars is the desserts just didn't taste very good. We ordered the fruit salad sago and it tasted pretty watery....Definitely does not satisfy the Canto dessert craving.", "author": "Betty C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-24", "description": "Quaint little Asian dessert cafe in Outer Sunset with K-pop videos playing on the TV...always a good sign.  We ordered the Creme Brulee, Mini Honey Toast with Matcha & Red Bean and Ginger Milk Pudding.  The former was decent and I enjoyed the mix of flavors in the toast without any one component being overly sweet.  Service here is attentive and friendly so overall, not a bad spot to satisfy your sweet tooth.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "I was rather surprised that I never noticed this place. The desserts are alright. I have an insane sweet tooth so I love getting desserts. The menu doesn't have a large variety to choose from and some combinations are odd and excess. I had the mixed fruit pudding and a creme brulee with my friend. The desserts were average and overly sweet, I'm rather disappointed for such a cute looking dessert house, the food didn't meet my expectations. \nI won't be coming back.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-18", "description": "New place in sunset. \n\n        I love to go around place to place to find good foods and nice places. \n\nThis is place is great. cause I love to go out at nite. This place open til 2am.\n\nThere milk tea is good.  And they have a very very relax sofa let you sit and talk\n\nthat will make me give them 5 star.  Cool place to hang up .", "author": "Erica T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "Water cups smell like old dirty towel.", "author": "Anna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "The honey toast is good here. It's BIG so SHARE. :)\nThey have a good selection of items. Both times I came here I ordered the honey toast to share, but look forward to trying other specials. \n\nNice decor, and friendly staff. \nFood service is a bit slow when this place has a lot of customers. But this would be a good place to just chill with your friends. They open pretty late so that's a plus.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-22", "description": "10pm on a Saturday night and there was a 6 person table available for us... kinda weird.\n\nAll I can remember is that the wait for the dessert was unbearably long. If I hadn't come with a group, I'd have been bored out of my mind. Each dessert came out at different times too with long lag times in between.\n\nFresh from trying Akiba's honey bread box/brick toast, I had to try the one here too. Sadly, I don't think it compares as ETC makes their's extra toasted; it's hard to eat without scratching up the roof of my mouth. My friend had the $5 Banana Berry waffle and she liked it for the price. \n\nNot a bad place but I see myself going over to iCrave for their waffles more. Also, to use their bathroom, you have to get a key and go out of the store and down this alley way next door. Um.... no thanks. Cash only.", "author": "Liana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "After dinner, friends and I decided to grab some Chinese dessert. \n\nWe ordered one of the waffles. The waiter was nice. We ended up ordering a waffle thing with ice cream and fruits on it. The waffle was warm to the touch. \n\nOverall it was good :] But parking is eh since it IS irving. Lots of kids come here too.", "author": "Harmony C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "A decent, not amazing / not awful dessert spot in San Francisco.  We ordered 5 desserts, a couple were good, one was great (the smores waffle) and two were awful.  The green tea waffle and tarot pudding type thing were good.\n\nThe red bean tofu soup tasted like dirt.  Literally.\n\nThe hot milk tea (caramel) was AMAZING.  The staff was sweet.  The prices are reasonable and you get deals for checking in on yelp.", "author": "Melanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "I'm never disappointed every single time I come here. This is my go-to dessert place!\n\nHoney toast: BEAUTIFULLY PUT TOGETHER. I wouldn't go anywhere else for it. There are a lot of different varieties to choose from, but my favorite is the strawberry one. The only set back is that it takes 10-15 minutes to make it.\n\nChocolate fondue: Great to share and it is great as a light dessert with fruits, honey toast bits, and marshmallows. \n\nThe service is outstanding because the waitress comes to check up on you once in a while and refills your water promptly all the time.\n\nI love the overall ambiance of the little place. They recently bought nicer chairs so it's a nice place to sit and talk with friends.", "author": "Terri H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "Came here on a Friday night around 8:30-9 p.m. and it was packed. After eating a large dinner at Tonight we wanted to grab some dessert. We had a friend who came up from SoCal for spring break who was craving the honey toast from this place.  We were debating on whether or not to go in because we were a party of 6 and there wasn't enough space for all of us. We walked in a the waitress was quick to tell us that she would make a table available for us in a minute. The service is pretty good here being that there was only one girl running the whole show. The selection for desserts at this place is pretty good, but to be honest we always order the same things. Honey brick toast and matcha and red bean shaved ice bowl. \n\nThe only downside is waiting 10-15 minutes for the brick toast.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-04", "description": "Came here with a couple of my close friends to eat dessert and I ordered the Tiramisu thing. It was pretty good, I liked it. But I didn't like how their bread was really hard. I have sensitive teeth and I couldn't handle the super hard bread. Overall, it was okay. The service was great, but the food was alright.", "author": "cadence p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-28", "description": "As a huge fan of dessert, how can I give a super low rating to this place? It's a little small, so on busy nights this place gets a little crowded..\n\nI've only tried their pyramid toast with vanilla ice cream. I'm not sure if we ordered the wrong thing or if the waitress misheard us, but we were highly disappointed with how we expected it to look (seeing the pictures on the menu) and how it really looked. The proportions were so small!!\n\nI also really was not a fan of how the toast was already cut up for us, but the taste was pretty good! The only reason why I knocked it down a star was because our order was forgotten. We sat there for a good 30 minutes until we realized everyone else was getting their desserts before we were. \n\nWill I be coming back? Most likely! It's a good place to hang out with friends and get some dessert... Also, parking is not too hard to find at night, but can get a little annoying around dinner time and on the weekends around 3-8pm. Just go up the block and park in the residential areas.", "author": "Gelene V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "Saw a new dessert place and thought I'd give it a try. There were people there but not crowded or anything. It's pretty tiny inside so if they did get crowded, I can only imagine the wait time. The blue lights are interesting but they're a bit too bright and can become an eyesore after a while. Unfortunately, we were seated right under the TV and it was extremely loud. All the other customers were watching it but our table hated it since it was so loud. Would be better if they placed the TV not directly over a table or lower the volume.\n\nAs for the food... I got the pancake with the assorted fruits and ice cream. It was alright, the pancake was light and fluffy. Sad thing was that it took forever to make. I think I waited almost 25-30 minutes just for my pancake. Everyone else in my group finished theirs. Weird thing was that not everything came together, everything item came on its own with 5-10 minute gaps in between. Some of them wanted to wait but we didn't want their ice or ice cream stuff to melt so we told them to start first... they ended up finishing and not just starting!\n\nMy friend got a dark chocolate fondue... she said she wasn't too impressed. They literally stuck a candle (which was pretty weak) to keep the chocolate hot. However, the flame was weak and the chocolate wasn't fully melted... so it took a while before she could start dipping. Either they need to get a better candle or lower the bowl containing the chocolate into the fire more so it melts better.\n\nMy other friend got a mango shaved ice... I tried it. It was okay, but definitely not worth a 15-20 minute wait for it. Pretty big portion though compared to other dessert places.\n\nOverall, the desserts were alright. Service was... okay. They kept coming by and apologizing and refilling our tea cups though. But with 3 workers and not much costumers to serve... I expected the food to come out faster.", "author": "Johnson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "My friend and I set out on Irving to look for a place to eat dessert. We wanted a place that had some savory snacks to fill his stomach as well as something sweet for me to eat. We saw the menu here as we walked by and decided to try it out.\n\nThe menu has a huge amount of choices for both savory and sweet cravings. I took at least 5 minutes to sort through my options on the menu (I tend to do this often). My friend ordered the rice noodle roll, which he says was not hot when it came out, but warm enough. Minus one star for that. I ordered the coconut and grass jelly shaved ice, which was delicious and devoured pretty much the whole thing...The portion would be better for two people to share.\n\nI played on my friend's iPad while eating and, just our luck, the waitress spilled one of our cups of tea and almost killed the iPad! No stars taken off for that though--that'll teach us to play on an iPad while eating out...\n\nThe shop is cozy and comfortable and I really liked it on a quiet Sunday night. I'd go again.", "author": "Reanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "I really enjoy this place. Cute decor and waitresses always have a smile on~ My friends and I always order a pyramid toast or two (maccha personal favorite) and honey mix fruit drink HOT. These never disappoint and they satisfy that craving for a sweet dessert~", "author": "Nick Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "First time coming here last week and I liked it overall. The place isn't that big but the waitress was super nice and friendly! She really described things well if we had any questions or if we didn't know what something was on the menu. \n\nMy friend and I got the Thick Brick Toast but mini versions. I'm glad this place has a mini option. Anyway, I got the Tropical Thick Toast and it was pretty good overall. The pieces of bread weren't too buttered like at Akiba (well my experience at Akiba, anyway), which I really liked. The only thing that I didn't like was that the crust was a little hard but everything else was fine! I think I'd definitely come back here to try more of their items :) It's also conveniently located near me so that's another plus!", "author": "Kathleen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-22", "description": "Not entirely busy on a Saturday night. Service is a bit slow and our waiter was not too proficient in English. I had the peach shaved ice. It's nothing amazing but definitely not bad for $3.95 although the cantaloupes weren't sweet and it really brought down the quality for me. My friend got the oreo milkshake which would be exactly what you'd expect. The black currant juice is a little tart for my liking but it's nice, it channels a lemonade kick. We also got the strawberry and ice cream waffle which was good and it came with sprinkles, haha. Be aware that the food comes out slowly - our waffle came out like fifteen minutes later than the red bean soup which I think is rather problematic. \n\nThe place is new so I don't really know what's good here but the food was alright and the price is cheap.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-30", "description": "The decorations are interesting. The food is alright, it's good but nothing special. I had the Nutella waffle with marshmallow, I liked it cause it reminded me of s'mores. Not exactly sure what my friend ordered. It was like dessert tofu with mango syrup but he said it was more like mango pudding. My other friends ordered smoothies, they said the drinks were good but then again nothing really special.", "author": "Charlene P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-17", "description": "I have been very excited to try this place out. I was finally in the area and decided to go. Unfortunately they were Not open at 6:38pm on Tuesday 12/17/13. No hours posted, no hours on the menu, and no website. Yelp showed they were scheduled to be open. Oh well maybe another time ETC.", "author": "David B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-20", "description": "Ordered the wrong dessert. Was expecting Mango Pudding HK style. But the Macau one is way different. Served in a Martini Glass, it has nice presentation but impractical because of the cocoa powder getting everywhere when trying to eat it. The Cookie-like layers inside was difficult to swallow. Really sweet and you need a glass of milk to go with it. \n\nNext time, ordering a drink instead. Service was Excellent. Staff was attentive and the boss lady is nice to talk to.", "author": "Dustin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Whenever I'm craving for some brick toast, this is always the place that pops in my mind. Love the Tiramisu one, so rich and creamy. I prefer that over the Macaron one anyday. I've also tried some shaved ice which is pretty decent. Make sure you order right away, it takes about 15-20min for them to make the Brick toast!", "author": "Alice K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-31", "description": "Went here with my homegirl Tiff after we ate at San Tungs. Never heard of this place before but we just yelped something close by to try out for some hot milk tea. \n\nPeople inside were mostly enjoying deserts. We both ordered hot almond milk tea with less sweetner or \"sugar\". It took about 5-10min before we got our tea as she was bringing out the orders for the rest of the customers.\n\nOverall, the milk tea was pleasant and ok. Seemed a little pricey at 8 bucks for both of ours with a not so large cup. I prolly would go back if i was in the area but i would not go out of my way to get a drink here.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-02", "description": "3 stars for the food + 0.5 for the service!\n\nThis little dessert shop has potential to do really well! Items on the menu mimic those in Asia, but I feel like it almost tries too hard to include EVERYTHING. Yeah, it'd be great if this place could master every item on its menu, but it's definitely lacking in some areas in flavor, texture, and taste. I think it would be better for them to cut down some items on their menu, and concentrate on making their desserts up to par with those in Hong Kong/Taiwan. By that time, I'm pretty sure it would attract more customers, especially in the Sunset. \n\n1. Brick Toast\nFirst time I came here, I tried their famous brick toast - forget the  name of it, but it was the one with the most fruits. I liked the texture of the toast, but both my friend and I thought that it was a bit too sweet. However, they piled on the fruits, which made it semi better :) I would get the brick toast again, but maybe in another flavor next time. The presentation looked nice also :)\n\n2. Tofu Pudding\nSecond time I came here, I was craving tofu pudding. The texture of the tofu pudding was not quite there... kind of powdery and dense, definitely not silky smooth like it's supposed to :( But the waitress (owner??) was really nice and gave me extra syrup when I wanted it to be more sweet.\n\nWould come back for dessert because it's a nice environment in their (not dirt, pretty spacious, not too loud), but I hope their desserts improve!!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-23", "description": "Nicely done, and hit the spot.  If you're in the area, it's worth popping in.  The waffles are made on-the-spot, not pre-made, which is the norm for this area.  Ice cream is typical, nothing special.", "author": "Diane M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-12", "description": "Pros-Open Late and Tiramisu honey toast, Waffes, Service, Desserts completely unique.                                                                       Cons- Macroon Choclate Cake.....ughh Only 1 macaroon? , 30 Cents Debt Charage, Just a tad too cheap, Menus are absolutely Rubish.     ~I will come here again when im craving dessert late at night, Next time I will try the food items to see if it earns that extra one star.....I Will come again :)", "author": "Danny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "Really nice place. I come here once every two week or so. Takoyaki and Mango juice with Aloe combo is quite the best.", "author": "Jason X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "10/10 would recommend strawberry toast is very yum service, great. food, awesome. location, good. Store, v v cute. Everyone come here for good desser and destress from life", "author": "Trishel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-22", "description": "Some Chinese ladies run this dessert place. This place is little cozy, but it is a good place to hang out with friends at night for dessert and chill chat. They have many different desserts on their menu and some of them are self-created by them. The price is fair compared with other dessert places. I have only been here for a couple times and I always have some good time. Their \"Macaron Chocolate Party\" and \"Mixed fruit Mango Pudding\" are good. \n\nMy favorite drink is the \"Mango Smoothie\", which is my personal recommendation. I really love it!!! \n\nWhen I revisit next time, I will try the \"Marshmallow Waffle with Nutella\", which looks nice in the menu. \n\nLast, the dessert place stays open till very late, so you can always drop by at late night after dinner for a nice dessert.", "author": "S C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Mini Green Tea Red Bean Honey Toast is so good! The \"mini\" size is plenty enough to feed 2-3 people. I can't imagine how big the regular size is! The inside of the toast is cut up into cubes and every side is lightly toasted along with the outer crust and then reassembled back into box form. They drizzle on some honey and add the toppings: whipped cream; a scoop of green tea ice cream; a generous spoonful of red bean paste; some mochi and a small strawberry cut in half to garnish. The red bean paste tastes like it's made in-house; it isn't too sweet and I love the texture (they don't puree it to crap; it's chunky and delicious)! \n\nNote that it'll take ~15 minutes for your honey toast to come out. There is a disclaimer written on the menu, so be patient! \n\nAlso, really attentive service! The young lady that helped us was so sweet and genuine. She checked up on us, refilled water, and even told us about the $0.30 charge if you decide to use your card there. \n\nLighting can be a little dim, so instagram photos may not be as cute and fabulous as they should turn out. This place spends lots of time meticulously assembling their honey toasts!", "author": "Rebecca N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-12", "description": "Came here during the crazy weekend of Outside Lands on a Saturday night around 10 with 3 other friends. We chose to sit on the couch because we're cool kids. The young lady who served us was super nice- I had just gotten my wisdom teeth out so I asked for some salt and she immediately offered some hot water to go with it ^_^. She was also very patient, explaining each menu item that we had a question about. We ordered the Chocolate Honey Toast (I think that's what it was called?)  & the Waffle.. with ice cream all over it. (see pics, haha). The ice cream was whatever ice cream and the whole dish was just super sweet. It was topped with sprinkles and basically covered in sugar. The waffle wasn't crunchy or anything but you could tell that they made their own batter for it. The macaron was also very sweet. And the restroom to this place ... it's in the building next door. I didn't even go in because I was so scared haha. But during the daytime, I'm sure it's fine :)\nOh, and my friend ordered the \"traffic light\" drink which tasted like asian gummies :( so sweet!", "author": "Chantel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Delicious thick honey toast. :) Order it and split it with a friend! Best shared, as it is quite large!", "author": "Jasmine O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Really nice service! The lady who worked there explained to my group what was in the desserts we were interested in. Btw if you check in and your order is more than $20 you get a free banana split or a marshmallow waffle.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "This place is cheap and fun as a place to get desert and even a meal.  The location is a little tough to get to for most, though.  The Honey Toast is a personal favorite, but beware... it's huge!", "author": "Noah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "I came to this cafe again the day after i came here for the first time. The toast is really awesome. The girl in the store is cute too. Highly recommend.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-09", "description": "eh. it's asian. it has waffles. but I have definitely had a lot better elsewhere.\n\ndessert sampler (creme brulee, maucau pudding (?-they ran out so they just gave us mango pudding), bite-size (literally a PINCH) of tiramisu cake, two babyspoonful of ice cream, and some random pieces of fruit (probably not fresh) saturated in chocolate sauce): $9.95 = MUST AVOID. worst dessert dish/sampler I've ever had. the tiramisu was a joke. it was the size of a froyo sample cup- the picture is very deceiving. it was also completely frozen. \n\nsingle waffle with ice cream and fruits=$4.25: better than the dessert sampler but that doesn't mean much. waffle was plain- crispy so i guess i would give this dish 3 stars. again, the picture is deceiving- it was half the size of what we imagined.\n\nwait time: TOO long. \n\nstaff: nice but a bit slow.\n\noverall: will not recommend to others nor ever return. :(", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-15", "description": "One star for the look of the food. \n\nIt used to be my favorite dessert place because of the decent pricing and quality of food, but my recent visits were very disappointing. \n\nStepped in and asked for using the restroom, when I returned, the waitress gave my table to someone else. She came up to me and said 5 minutes, 10 minutes later she said 5 minutes. Finally got seated, but a dirty table with used napkins on top. Putting that aside, I didn't get served any tea until I asked for it. When I said I was ready to order she took the menu back to the front counter, came back and asked me what I wanted to order. I don't understand the meaning of doing that. \n\nAwful waitress who barely understands English. When I asked for no soy sauce on my food, she didn't understand.  When my food arrived, it was completely cold on the inside so I asked the waitress for a new plate. She replied  \"you want it hot?\" It's legit food, not dessert, isn't is suppose to be hot? She came back with the same plate, just microwaved. Awful tasting, bad customer, ruined my night.\n\nAlso while I was waiting, I've notice the waitress asking around tables by tables where the food on her hands belongs. \n\nWill not be back.", "author": "Jia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "My friends and I came here for a late-night dessert run. Everyone enjoyed their desserts, which included 2 different types of sago and a mini tiramisu waffle. My boyfriend and I shared the dark chocolate fondue which was delicious, but to make it perfect they could have doubled or even tripled the quantity of chocolate given. The Asian music videos playing in the background were also very entertaining.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "I love dessert!! so when I found out we're going to try out a new dessert place I was the first one ran into the car and ready to go to ETC Dessert Cafe! \n\nAtmosphere of the cafe is so cute with their blue lights, couch, TV.  It's a cozy place, and great for friends gather, family events, or date! \nWe tried their tiramisu brick toast, Hk style waffle, mixed fruit with grass jelly, and mixed fruit with sweet tofu.  They were all so yummy!! not overly sweet but sweet enough to warm my heart! My favorite one is tiramisu brick toast! toasts were crispy and buttery on the outside but soft and warm inside, it's perfect to eat it with ice cream!! I'm getting hungry just thinking about it right now! I'll definitely go back to this place again, again, and again!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "I been there last time and I think the food is very good. The Ice cream Toast is one of the best food I will recommend to everyone. Also, the dessert is very good as well. Just like we went back to Hong Kong and have dessert in the HK Dessert Cafe.", "author": "Angel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-05", "description": "The service is poor because they always take forever to give me the menu after seating me and forever to order and forever to get my food and check. With such a small location, I don't understand why it's so difficult for them to pay attention to their customers. Plus side, they have free wifi, their desserts look super presentable and tastes not bad. I ordered chicken wings one time, and I only got 4 mini wings, which I feel like I got ripped off for. The mango sago with tofu fa was not flavorful, very bland. BUT I do like their Takoyaki. Probably wouldn't come back if I didn't have to.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "A great place to have dessert in outer sunset. Very friendly service! Food portion is huge. I could not even finish the mango sago because they gave me so much.", "author": "Quan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "super charming, open late, great great service. yummy asian desserts that are made with care. tasty mango pudding and honey toast", "author": "Pip R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-29", "description": "The toast here is pretty good! It's light, so go for bigger portions. Other items were ok. Seating can be a little difficult on weekend evenings.", "author": "Thuan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-12", "description": "small little cafe but with lots of good desserts. Their honey toast is better than other places I've been.", "author": "Mara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "5 Stars across the board! The desserts were really good. The smoothes were really good. And to my surprise, the service was EXTREMELY great! I found this place on Yelp after leaving a club early. I really wanted dessert and they seemed like the best choice that was still open at 12. Our waitress, who's name i wish i asked for, was awesome! She recommnended which desserts to get.... She kept making sure if everything was tasty (in a non-annoying manner)... and was just over all polite. Also, she wasnt super asian so she was easy to understand lol.", "author": "Craig S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "5 Stars for the their honey thick toast. It's the toast that's phenomenally WONDERFUL!  But all other desserts still has room for improvements.  I've went there two times already, there toast is still great.", "author": "K G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "They are the best place for dessert and snacks at night in my opinion. I never liked going to dessert until i tried coming here because other places around Sunet and Richmond are very crapy. Their seats are also very comfortable and their restaurant is very bright", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-12", "description": "The desserts here is not bad. I particularly like the taro sago (hot) here. It's yummy. Coming here at night , eating desserts with friends is such a treat. They really need to step up the cooking time. The wait is quite long for a simple dish.", "author": "Dee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "First time here with friends and they have creative desserts! We had their ETC dessert sampler, shaved ice, fresh fruit sweet tofu fa cold! (my favorite) and their peanut butter french toast. Good dessert and good service.", "author": "Ella A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-24", "description": "It was nice that they were so close to the Academy of Science and open pretty late. It had a cute atmosphere and looked pretty new. Their desserts look gorgeous, but when it comes to taste, it's alright. We also ordered their snack combination which came with takoyaki, fried chicken wings, calamari  rings, french fries, and fried fish balls. But the plate was so sad! There were only 2 takoyaki balls and 3 chicken wings, the fries were either stale or overcooked and cold, but they sure gave us a lot of cheap fried fish balls...Their tea was the most watered down tea I've ever had and we overheard the waitress telling other customers to \"stop going to that other place\". If you wanna beat the competition, do it by offering quality food and service first.", "author": "Shelly U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "food: 4/5\ndecor/atmosphere:5/5 (typical asian dessert place)\nservice: 3/5\n\nI came to ETC dessert Cafe after dinner. My friends and I were all really full but decided we wanted sweets. We got the toast desserts. There are two sizes, mini and normal. There were 3 of us and we got two mini  with ice cream (total $15 including extra cost for ice cream on top of the toast) and it filled us up pretty well. I would say a mini size will serve 1-2 people. The average size 2-3 people. I would definitely come here again, the desserts were so pretty!!! It was too cute to eat. Each toast dessert comes with fruit, whipped cream, and small cookies on top. They arrange it soo well and is just a treat to look at. Although the presentation was great, I found the taste lacking. It was still good but nothing that wowed me.\n\nThe menu says toast dessert takes 10-15 minutes to make. So its not a quick stop. However, we waited almost 25 mins to get our food. I think they tried to make our dessert and the tables next to us together so they dont have to do as much work. I was a bit disappointed in the long wait time. Lastly, the bathrooms are outside the shop, and is a bit creepy. So try to use the loo before coming in.", "author": "Cecile S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-12", "description": "Where do I begin?  The first thing I noticed was the blue lights decorated in this place.  It was a bit distracting.  The menu is quite extensive for a small place like this.  The dessert took way too long to come out (15-20mins).  When I received my strawberry with mixed fruit sago, I was a bit disappointed because it was not good.  I had higher expectations for this place but it left me in great disappointment.  Furthermore, there was only one waitress working at night which can take awhile to flag her down for the bill.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "I came a few times and finally decide to write a review to share my exp. here\nVery nice and cozy place. I'll always go for the sofa if I have a chance. I wasn't a big fan of dessert until one of my friends brought me here. \nI love their dessert trio.  You get to try a little portion of different things. My favorite is the pyramid toast. i can't believe I finished the whole thing by myself. One thing I have to have along with anything I tried here is a hot milk tea and the shark fin soup. Perfect the way I want it. \nMy friend had a hot green tea latte And the tokayaki. She enjoyed it and wanted to order another one. Sometimes it gets a little busy but the servers were very friendly so I didn't mind a little bit of the wait.\n\nDefinitely will come back and try some of their other stuff on the menu.", "author": "Kit W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "Was here to try the Nutella marshmallow waffle and it was delicious.  Also ordered the Mixed fruit Grass Jelly with ice cream, that was okay.  Would definitely come back to try other selections.", "author": "C L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-29", "description": "Last Sunday I went to ETC at 3:30pm since that's time it opens, and it wasn't open. So today, Saturday, I went to ETC on time again at 3:00pm and we waited until 4 o'clock and it still wasn't open. The thing is, ETC doesn't put up their open hours schedule on the window of their restaurant, so we don't know if the schedule on yelp is correct too, and if afternoon isn't their opening hours, then I hope they correct the schedule so that we as customers don't waste our time.", "author": "Mandy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "E.T.C is a good overall place for honey toast. They are known mostly for their toast and have a variety of dessert. Whether it be hot or cold, E.T.C is a good overall place to hang out with your friends.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-13", "description": "When my friend and I came here , they didn't have mango pudding or Guilinggao . Their menu is pretty limited and their selection isn't that great so we just got the grass jelly w/ mixed fruits and the chocolate milkshake . The grass jelly w/ mixed fruits didn't taste good ... it lacked flavor . The mixed fruits didn't taste that great either . The chocolate milkshake was pretty good though . They're still fairly new so I'm sure they're still working on things . I'll return and re-evaluate on a later day .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-22", "description": "This place is awesome!! Its real tiny but the food is amazing especially the tiramisu and club sandwich. If your looking for a late night spot to hang out I recommend it", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "get the green tea cake slice with red bean. full of green tea flavor, not too sweet, light and fluffy texture, red bean contrast. very nice. can order a whole cake w/ 2 days' advance notice for under $30; definitely worth it. but the cake pickup service & communication should improve.", "author": "V L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "Came here with my sister. She actually introduced this place to me. We tried the wings and fries combo and I got an order of takoyaki. The wings were tiny and were just ok. They were the perfect kind of wings to toss in buffalo sauce though. The fries were typical and they were pretty generous with it, so that was good. As far as the takoyaki goes, I've had plenty of different kinds of takoyaki, but this one was just ok. I thought the batter was too thick and dense. I probably wouldn't get it again. The star of our visit was the honey toast. YUM. We got the one with a bunch of fruits on it..I forget the name lol. It was soooo good. We got a mini size, and that was not mini at all, but it was perfect for my sis and I since we had food prior to the toast. If we got the regular size, we probably wouldn't have finished it. That was a good call on our waitress though because she actually recommended the smaller size lol. Service was excellent. The girl that was working when we came was such a sweetheart. She was so nice and polite and even asked how I liked the toast since it was my first time trying it. Service was a tad bit slow, but she was so nice that I didn't even really care. I would definitely come back for the honey toast, but the food...maybe not.", "author": "Faye M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "I think this might be one of my new favorite dessert places. The people working there are friendly and the drinks are delicious. I'm a fan of their fresh fruit honey green tea, which is a drink often found in Taiwanese places and rarely found in SF. They actually use fresh kiwis, mangoes, strawberries, and lemons! I also really like how they have couches there for customers to sit on, even though my friend K thinks they're really dirty :p.", "author": "Fiona N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-27", "description": "Never given a review on any food joint before, but had a good experience here at ETC last nite so I decided to create a account and give props. I had the munchies and decided to go to Irving to satisfy my sweet tooth. Saw this cool little trendy place with the kick ass Blue lights at the window. Nice comfortable spot with good seating and comfy looking lounge chairs. Place looked really clean and organized. Oh, and WIFI, gotta have WIFI. Really reminded me of my vaca in Tokyo where they had little gem food joints like ETC. I decided on the special they had advertised outside for waffles topped with bananas, strawberries, choco syrup and Ice cream. Seeing that, it was a done deal to satisfy my sweet tooth. The young ladies there were very friendly and also attractive, sorry had to throw that in there and asked me to take any seat. They serve hot tea while you wait, which I thought was really cool. While 1 of the girls was preparing my treat, the other came out with some appetizer which I did not order and she proceeded to say it was on the house as it was something that they were thinking about selling and I was gonna be the food taster. I had no problem with that of course, not sure exactly what you called it but it was rectangular wrapped crepe goodie with mango slices and whipped cream..soooo good. I told them it would be a hit and sell it. Next came the waffles, maaaan! it was screamin good! Waffles were perfect, not too crispy and hard and not soggy which I hate. The strawberries and bananas were fresh and sweet and the vannilla ice cream was thick and not air whipped. Good mix with the straw/ choco syrup. Never had this combo before on waffles and was impressed! It started to get pretty busy in the store and I saw all the desserts the ladies were rolling out and was like I gotta try those the next time I come. I told the young lady which turned out to be the owner, that she had a good thing going and to keep up the good food. I also told her the prices were good and reasonable compared to other places which I have gone too. She was very thankful and told her I will be coming here more often with friends to try out the other goodies on the menu.-Jeff", "author": "Mos J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-20", "description": "I ordered a Honey Box, it was good but not as good as Akiba. The honeybox did not contain the soft/crunchy consistency as other places, but overall the visual of the honeybox was pretty appealing. Overall, this place was decent.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-15", "description": "I went here tonight with my single buddies because it was Valentine's Day and we wanted something sweet to end off the night. The cafe it VERY small, there was a max about 6 tables and one small couch area. So if you want intimacy, you got it here! We sat at the table closest to the window and they have these sparkling blue light flashing everywhere!  I feel like my friends and I got mini seizures while we where there. \n\nHowever, don't let the decor turn you off.  The serves was great...a little slow..but great. There was probably only one manager and a waiter there tonight to work the front but they were both really nice! When we had questions about the desserts they took the time to explain it to us and any other questions we had. Our orders took a while, i think partly due to the small staff size, but if you're with a group of friends just chilling and talking you really wouldn't mind it. We ordered the Banana Berry Brick Honey Toast (not on the direct menu), the matcha red bean waffles w/ green tea ice cream, and the Tiramisu Brick Honey Toast. I really liked how the toast inside and under the ice cream was not overly sweet and was cut into cubes, for easy eating, and individually buttered and toasted. The ice cream and topping are as expected and of good quality. The waffles had green tea powder in them and decent. The tiramisu was kinda grainy so we didn't really eat it but again the bread cubes and ice cream were yummy!  If i had to give this a grade for presentation i would give it an A+, when our orders came out they all looked really pretty and professional! Sad to admit we took a good 5 minutes taking an insane amount of pictures of just the food. \n\nBottom line: I really like this place and had a very pleasant experience. If you want a nice cozy place to hang out at and you are not in a rush then definitely check this place out, just make sure you don't star too long at the flashing blue lights.", "author": "Danna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "came her for the first time this week i think monday , after i left the place left me wanting to yelp about how good the customer service is here,  looked at the menu i was really over whelmed so many options to choose from , super creative items and extremly nice waitress", "author": "eric l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "This place is pretty good. The workers are super nice and always trying to help. I will definitely come back", "author": "Samson L."}
