{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "An amazing bar on the outer edges of the Mission. The decor will immediately catch your eye with several comfy couches, eclectic light fixtures, and unique art. It's cozy and eccentric, like your crazy great-aunt's place. \n\nThe cocktails are delicious, and I especially liked the Sky Juice - gin, cachaça, coconut cream, falernum, basil, lime, orange. If you're with a small group or going solo, sit at the bar and chat up the bartenders. They may let you taste drinks that could be on future menus. \n\nIt's a bar so the cocktails better be good, but I was pleasantly surprised to find the food was also stellar! We had the Deviled Eggs and Kale Salad - all classically good. But the real stand-out was The Burger. They only make 13 per day so make sure you order as soon as you arrive.", "author": "Dyanna Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "I went to this place on a date! Loooooved the nicely decorated corner with burgundy velvet chais and moracan coffee table! Drinks were really good too- They had decorated their bathrooms in a very creepy way (like dolls with no eyes kind of creepy)I guess was expected: Evil Eye", "author": "Rana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "A girlfriend and I went to Evil Eye for a going away party. I guess the party didn't start until 6:30pm, but we arrived early on Friday, December 15th around 5:45pm. It turned out they reserved a table in the back, but since we didn't know, we started off at the table in the front by the bar.\n\n*DRUNKEN SAILOR: coconut-infused bourbon, white rum, grapefruit, falernum, cinnamon syrup, lemon ($11)\n*MANHATTAN: rye, carpano antica, bitters, orange ($11)\n*PORK BELLY SLIDERS: rock shrimp, house made kimchi, scallions, gochujang ($9)\n\nWe began with the above for the 30 or so mins we were here by ourselves. I got the Manhattan. It was nicely balanced. I wasn't trying to drink too much at first since our holiday party was the night before, so this was a good sipping cocktail. We decided to get the sliders to split. They were a nice snack to start the evening.\n\n*GRANDAD'S SPECIAL: rye, oloroso sherry, coffee, salted cacao, chili, bitters ($12)\n*PUNCH #3: rye, lemon, spice, sherry, ginger ($50)\n*BAR NUTS: warm mixed nuts with a blend of spices ($7)\n*POPCORN: with savory furikake ($5)\n\nOnce everyone started arriving, the going away girl ordered a punch bowl and snacks for the table. I believe we ended up with two punch bowls at the end of the night. The punch was good. Very drinkable and not too sweet. I ended up getting two more cocktails on top of the punch bowl. I believe both were the grandad's special. It was dark and spirit forward like I prefer, but there was something very cozy and maybe even a little christmas-y about the drink. I can't recall why, but I remember enjoying it. I only tried the popcorn which was good for munching on as the night progressed.\n\nFun night at Evil Eye. I was here for almost 5 hours before I left for a late dinner. Great spot for ccocktails and small bites.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-11", "description": "Rude and disrespectful female bartender. She verbally attacked me when all I did was ask for a menu.", "author": "Andy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Awesome place they did a great job inside and out Food is Great and Drinks are the Bomb! I actually used to own this spot 1999-2003 The VooDoo Lounge! This place is nicer then mine! Great Job!", "author": "tommy b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "The waitress was SUPER rude. We spent $200 on drinks and she was super anoyed bc we went strait to the bar and skip her BAD SERVICE. \nIf you are moving your money maker, at least be nice if you want money. I'm paying for your service, so just DO IT.", "author": "Beautytraveler G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "I thought I came here just for drinks but was pleasantly surprised they have a decent menu and desserts! \n\nMy group ordered a broad range of cocktails, snacks and boozy milkshakes and I can't forget about the bread pudding. \n\nDrinks are what you'd expect in price and taste. Nothing special here. \n\nBoozy milkshakes were super creamy. Wished there was less cream to taste more flavor but that's just me. \n\nPopcorn was a really nice snack and the bread pudding was pretty tasty.\n\nIt had a really fun atmosphere and a good crowd. We had a big group so luckily we were able to snag the front table and seats so we could all sit together. \n\nBartenders were nice and quick to make the drinks, snacks came out super slow though, but they tasted good so it worked out. \n\nI'll have to come back to try their dinner menu.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "I don't think I've ever truly had a kick ass burger enter my life until \"The Burger.\" So they only make 13 of these beauts and then you're screwed and gotta wait until another visit. The meats are a mix of brisket and chuck roast- who freaking knew this was the definition of heaven? And that's not all- there is friggin' bacon jam in all that glory...drool. \nDon't forget to order some of those wings too- I was a little skeptical because I normally shy away from honey sweet anything in my food, but it wasn't sweet or spicy at all. It was a perfect blend of both.\nPro tip: order a few Old Fashioned drinks and pair with the warm olive appetizer. Sounds odd, but it works. Yum.", "author": "Vanessa O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "What a great find near the end of Mission street! Friends and I were grabbing dinner near by (off of 26th) and wanted to find somewhere chill nearby. Some friends wanted drinks, others wanted dessert, so here we landed at Evil Eye. \n\nTurns out, the drinks + food options were totally on point! The bartender was also awesome! Wish we got his name, but shout out to him for his recos and quick cocktail making skills :)\n\nAlthough we were majorly stuffed from dinner, the savory (Japanese flavored) popcorn sounded like a must have...and that apple bread pudding situation. I mean, come on. SO GOOD. Was sooo full bah. \n\nWe all tried out a variety of their drinks. I don't even like bourbon, but the bartender convinced me otherwise. Only thing I wasn't crazy about was the milk shakes. One friend got a regular milk shake, and another got the boozy milk shake. They were 100% cream flavored. Sooo if that's your thing, then by all means, get that. It's just not mine. \n\nWe sat right up in the front of the bar (very spacious sitting area). Tons of seats along the bar and, again, very spacious in the back as well. \n\nWould 100% come back! 4 stars", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "I was pleasantly surprised by the decor and vintage ambiance of this bar. Has the exterior of a dive bar but the inside doesn't match up to the outside. The place has comfy leather couches and plenty of seating. The place is dimly lit and is a good casual date place. Also a good place to chill with a group of friends over some drinks, food and games. There's a pool table and a few arcade games to keep you engaged. The restrooms are extremely clean.\n\nBoyfriend and I stopped here for cocktails on a Saturday evening post dinner at a nearby restaurant in the mission. The place was moderately crowded but we didn't have to wait to find seating. The bartender was very friendly and greeted us immediately on arrival.\n\nPlenty of cocktail options, both the classic and citrus kinds. We ordered the Pimm's cup and the white Widow. Pimm's cup was definitely a winner, stiff and quite refreshing.\n\nCan't speak for the food as we didn't eat here but will definitely be back to try out their food and the other cocktails on the menu as they have plenty of interesting options.", "author": "Preeti R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "It's pretty dark in here and the candlelight probably does them some favors but Evil Eye was about as sexy as it gets on a weekday summer evening. \n\nLooking around, everyone was attractive it seemed like they were on the date that happens like maybe two dates after they both wanted to \"do it\" but for whatever reason they hadn't yet and tonight was THE night and this was the hot and heavy pre-game. \n\nI didn't come here on a date but that didn't stop me from creeping on everyone in the place because while I love a peaceful night in by myself, the one thing I love more is being the audience to developing situation of either humorous, sexual, or over-dramatic nature and Evil Eye delivered in the best way.\n\nMy friend and I were able to snag a booth in the back that could have comfortably fit 5 or 6 people. During the week probably around 8-ish there were plenty of seating options and all were comfy AF and conducive to intimate conversations.\n\nHead up to the bar for a gander at their menu. They have at least one staff member who goes around and clears empty glasses off the tables but to order and all that you have to go to the bar. The bartenders were soooo nice and unlike so many other Bay Area places, still made an effort to make eye contact with people waiting to order or close out, even when they were busy, and went that extra step to ask how they can help you and let you know they'll be with you in a minute. It almost brought a tear to my eye to receive this sort of dutiful Midwestern service again. It's been a while since that's happened and I wish other Bay Area restaurants and bars would take note. \n\nI got the Desert Rose, which was just my style - boozy without tasting like it with an mildly oversized leafy garnish. My friend for the Mexican Cocktail which look like a more floral Old Fashion, but had a rich, smoky flavor and at least 5 different phases of conception when it came to how my mouth perceived it. It was a little too jet fueled for me, but I think all my true liquor loving friends would love it.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "Came here on a whim on a Saturday night and it was packed. It's kind of like a dive bar, but they have an extensive cocktail menu. They have some pretty interesting drinks! My boyfriend wasn't impressed though because the bartenders made him 2 of the same drink on accident, which he did not request. He wanted to avoid drama, so he just accepted and paid for them. He did tell the bartenders that he only wanted one, so I thought they shouldn't have made him pay for both. Unfortunately, he did not enjoy the drinks at all, and he actually found a piece of egg shell inside one of them (egg white was an ingredient in the drink). \nAnother thing was the location of the pool table.. It was so close to where people walk through from the bar, and it's common that the players would hit people on accident with their sticks.\nWe didn't have a very fun time here, but it's worth it to check out. It's a pretty cool looking place and they have some great drinks. Just maybe watch out for some egg shells and stay far from the pool table unless you are playing!", "author": "Christina W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-02", "description": "Decent cocktails & service, pool table missing the triangle - $1 a game, and some interesting decor/furniture in the back. All things considered, a pretty solid, and dimly lit, cocktail bar but nothing that would really draw me back specifically. \n\nPerhaps the food..? Oh, and they have pinball which was kind of cool, I did appreciate that.", "author": "Myles C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-14", "description": "Very cool atmosphere, but the customer service was terrible. In the menu, the punch bowls are listed as \"$30 or $60.\" My two friends and I ordered a bowl, expecting the smaller size, as the bartender knew how small my group was. Instead, he made us the large $60 bowl and said there was nothing he could do when we expressed that it was too much for us to drink responsibly. It was  12:30am when we ordered and we were already a few drinks in, but we felt like we were forced to finish this huge bowl before close at 2am because they made us pay for it. We were very disappointed because it felt like we were taken advantage of for our money. I would not return here.", "author": "Megan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Thanks to a super hip, but not hipster colleague/friend of mine who introduced this super cool place to me. Met up for a happy hour, and this place was nothing but great surprises. Found a place to sit towards the back of the bar, on the super comfy couches.\n\nThe exterior looks like a dive bar (as many in the Mission are), but the inside was anything but. The interior was dark and sexy, but not pretentious and stuffy. The back display wall had windows galore, like straight from an art gallery or something. And there was even a video and pinball machine (old school and pre-millenial-hollah)! The cocktail menu had interesting combinations and flavor profiles, and they do have awesome classic cocktails and modern takes of classics as well. We tried a few yummy eats, furikake popcorn and fries. \nBoth are winners in my book! Please use the bathrooms when you are at the Evil Eye, as they are something out of a first class hotel or something. I've never ever seen a bathroom so nice, clean, with a newly lit candle. Hello, can you say lots of marble throughout? \n\nCan't wait to go back to the Evil Eye with more friends to chillax! \nCheers my dears!", "author": "Gill C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Amazing bar with a real vintage feel! Perfect for an interesting date spot, or casual outings with friends.\n\nLove, love the decor and lighting fixtures. There are two old-school arcade games and a pool table so you don't just have to lounge around and drink. Restrooms were all-gender, single occupancy and extremely clean.\n\nWe ordered the punch bowl #2, which had grapefruit in it. Plenty of alcohol to go around and it tasted great - not the watered down crap you get at some bars. The only downside is, there isn't really a dance floor here so you'll have to migrate elsewhere.\n\nWould definitely come again!", "author": "Kevin Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Great cocktails with great bartenders serving them, they'll even deliver to your table if they aren't busy. The atmosphere isn't pretentious given the high level of drink sophistication which is nice to find these days. They also have good food which is a nice bonus.", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "Love the decor, love the drinks and the fries here are DOPE! Came here for a work event last week and it was awesome. Ordered a pimms cup which was delicious and fresh. I loved the decor inside. They knick knacks and succulents all over the place super cool! They also serve their drinks in pretty/cool/different glasses, nice touch! Need to come back to try more food and their punch bowls! :)", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-13", "description": "A great selection of cocktails. My girlfriend had Pimms cup. She really liked it. I had wayfarer which is a gin based cup with Absinthe. I didn't care for it because it had a black licorice flavor. Service was good. I didn't eat but the bar snacks looked interesting.", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Wow, this place is beautifully decorated. I came on a Sunday night so it wasn't too packed. Cocktail menu is huge, and about as expensive as most places here. I would definitely return for at least one drink or two. But I probably wouldn't bother on a busy night.", "author": "Tanya T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-21", "description": "When I first heard about Evil Eye, I thought what a strange name for a bar. The phrase: Evil Eye gives me the heebie jeebies because my mom always gave me the evil eye for no reason at all. Her evil eye was so strong, I could feel it penetrate through her bug eye shades and Darth Vader visor as she rolled through in her little Corolla. \n\nI read the owners named their bar Evil Eye as a sign of good luck and the pictures of the retro-funk vibe with lots of plushy sofas really drew me in. It looked like a great place to chill over some cocktails and bar bites so my friend and I met up for happy hour during their opening week (several weeks ago). \n\nI found parking early so decided to wait inside for my friend. Upon arrival, I got the once over look by the bartender which was a bit unwelcoming. We decided to sit in the lounge area where the female server was much nicer. \n\nEvil Eye has a good variety of cocktails on their menu (18 kinds) ranging from $9-$12 but since we planned on being there for a while, we ordered one of their punch bowls. We ordered the Punch Bowl #1: Gin, cucumber, lime, absinthe ($50 + $10 upgrade to Hendrick's). I've ordered punch bowls before at other bars but this one looked very empty and was mainly ice: http://bit.ly/28LreWV. It was potent but this would be gone after one round with a larger group (my gf and I killed it and we both were able to drive home).  \n\nOn the food menu, they have snacks like popcorn and charcuterie ($5-$17), toasts ($10-$11), and small plates like salads, chicken wings, sliders ($8-$12).\n\nWe shared the following:\n*Furikake Popcorn ($5): http://bit.ly/28KMTvX\nCould use more furikake seasoning and the portion was quite small for the price. \n\n*Fried Green Tomatoes w/ burrata, confit cherry tomato, balsamic, basil ($11): http://bit.ly/28K5edF\nSkip; the burrata was fine but the batter on the tomatoes was terribly hard and lukewarm.\n\n*Brokaw Avocado Toast w/ charred corn, cherry tomato, queso fresco ($11): http://bit.ly/28Ls462\nLoved the creamy avocado and sweet and smoky corn but it was very messy to eat (corn and queso toppled off with each bite). Could of used some freshly cracked pepper or red pepper flakes to add some dimension. I don't mind paying for good food but this piece of toast seems overpriced by $2-$3. \n\n*Vietnamese Chicken Wings w/ savory caramel, cilantro, lime, peanuts (6 pc. - $9): http://bit.ly/28MPE2s\nEnjoyably crisp and tender with a nice salty sweetness from the fish sauce. \n\nFemale server was nice and attentive and was good about refilling our water glasses. The owner (?) came by to check in with us which I thought was nice since it seemed that we were one of the few customers that weren't friends of the owners that night. \n\nLoved the retro funky vibe with vintage furniture and lots of plushy couches. There's also a pool table, pinball machines, and one flat screen tv for watching the game. Such a transformation from the stark space and the awful pepto-bismol walls that previously housed Coco Frio. \n\nNot sure if I would return to Evil Eye as I read several disconcerting reviews where SF natives weren't treated well by the bartender. I was born and raised in SF and I'm all for gentrification (to an extent) but when you start alienating SF natives (specifically from The Mission where your business is located in)...not cool. I hope they better train their staff, i.e. bartender so this one person does not poorly reflect on the entire business.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Thanks to Yelp I read about this new spot in my old hood and decided to come check it out for an impromptu date night with my boo.\n\nThe drink menu was dynamic so I decided to try a Drunken Sailor. It was really delicious! Then I ordered my favorite drink, an Old Fashioned, and wow it was the best one I've had in a while! Bravo Evil Eye bartenders!\n\nWe started to get tipsy so we ordered some food.\n\nThe furikake popcorn seemed expensive ($5) but then when it came in a HUGE never ending bowl, it all get worth it. It was also addicting. \n\nThe Vietnamese fried chicken was really something else! That savory caramel was unique and it tasted really good with the jalapeños. \n\nMy favorite dish of the night was the pastrami toast. AMAZING! The sauerkraut, cheese and sauce were the perfect combination and after a couple of drinks it was scrumptious! \n\nThe decor is cool. It's new with an old feel. Super fun details that make the place feel unique and hip. \n\nService was stellar!\n\nI can't wait to go back to try more drinks and bar bites :)", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Evil Eye is my new favorite bar. It's casual yet beautiful, food is good, has good wine, staff is friendly. \n\nI love getting the Serrano toast with Apple with a glass of the Tres Picos red wine. In fact, I'm quite sure I always order the exact same thing.\n\nUnfortunately they don't open on Mondays. I've been standing stupidly at the door waiting for friends on a Monday and I'm sure I'm not the only one.", "author": "Marta F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "What a deep mission gem. The decor is Victorian meets rock star. The drinks are priced well for SF and good. The patrons remind me of a dive bar, maybe that's why I love it. It's know for pool too--bring your A game.", "author": "Laurisha C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "Evil eye review \nThis place *should* get 5 stars because the food and the drinks are both top notch. A+!\n\nHowever, we recently went here for dinner and the service really, really sucked. \n\nThe interior is cute and comfortable, the cocktail menu has a range of delicious and creative drinks. (The best Pimm's cup I've had in America so far, actually) We ordered about half the menu and everything was amazing. The brussel sprouts particularly were really tasty. \n\nI've been here a couple times for drinks, and the food menu caught my eye so we went back to get dinner. It was really early on a Saturday night. There was a server on, and we grabbed a table. There were two other tables seated.\n\nWhen she didn't bring us menus, we started watching her to see if there was in fact table service. The server (Rachel?) was waiting on other tables so we waited... and waited... and eventually grabbed a menu from the bar so that we'd be ready to order when she wasn't busy. I've been a server for years, so I know how it can be when you're trying to fire orders and have a table staring you down, we were being patient. \n\nAfter 20 minutes, it is clear that she's not serving us. She's hanging out at the server station chatting with the bar staff and drinking a beer. I assumed we had made a mistake and needed to order from the bar because she hadn't so much as greeted us at this point. The bartender informs me that no, the server should be taking our order. I look back and she's waiting on a the table next to us that just sat down. \n\nMy friend flags her down as she's waiting on this table, and she finally approaches us. I had made eye contact with her several times while we were waiting, so it seems impossible that she didn't see us... but clearly it's just a miscommunication, right? She didn't apologise for ignoring us in her section for 20 full minutes. I thought that was kind of rude, but, whatever. Let it go.\n\nWell, the table next to us gets their drinks and their food almost instantly. Had it been my table, I probably would have fired our food first since we'd obviously been waiting. They even ordered some of the same apps as us so I thought it was really weird that theirs came out first instead of at the same time, but whatever. I don't know their kitchen's flow. That's usually not the server's fault, ok. \n\nHowever, our entire meal finally came out within about half an hour. (We ordered 5-6 things that came out one at a time) and we still didn't have our drinks. She'd made several trips to our table at this point, and didn't say anything about our cocktails. Given the previous impression she'd made, I thought perhaps our server had forgotten to put them in. It happens to every server from time to time, especially if you're putting in orders for multiple tables at once. I asked (politely) if our drinks would be out soon. (Again, remember it had been about half an hour since we ordered) and our server snidely give me some spiel about how each drink is handmade and about 20 people had put their order in at the same time. Firstly, there's fewer than 30 people in the bar right now. You're really trying to tell me that they all put in their drink orders at the same time? Secondly, if that's the case, why did the table whose order you took 30 seconds before ours just get their SECOND ROUND of drinks? She could have just said, \"Sorry about the wait, your drinks will be right out\" but instead talked down to me about it. She continued to talk to me (specifically) in this weird passive aggressive patronising voice for the rest of our meal, it was palpably uncomfortable. When we asked for the bill, she ran my card before bringing it to review as well, which was annoying as we had intended to split it. I'm not sure what this particular server's attitude problem is, but she couldn't have been more condescending and rude unless she had called me a b***h right to my face. \n\nAgain, I've been a server for years in a lot of different types of venues from big nightclubs to tiny intimate bistros. I'm not easily shaken up about stuff like this. But I have never, ever, in my life had service that made me feel this uncomfortable and ruined my experience at a place this badly. \n\nI'd recommend that the management train their staff and keep a closer eye on them. It also concerns me that your staff is drinking on shift at 5:30. I find rude staff and drinking on shift go hand in hand in my experience...\n\nThe cocktails and food are fantastic and every other time we've been here has been a great experience. So, I'd like to come back, but if that server's working, I'll probably take a pass.", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Tonight I went to Evil Eye to celebrate the end of my school year. I brought along my SF Native high school friends. The Warriors game was on so everyone was happy. The service was on point; friendly, attentive, helpful. Someone even refreshed the cherries in my Manhattan when I wasn't looking. The vintage glassware is so fun and festive. Tonight we all shared the popcorn, fries and wings. Next time I will try the kale salad. The comfy couches and warm decor make me want to stay all night. It's easy to sit back and enjoy being at the Evil Eye.", "author": "Tobi G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-18", "description": "Super cool space hidden away in the mission - really hipster and well designed. I wanted to love this place from the moment I walked in - however, one mustached and rude bartender ruined the whole experience for our group. On letting him know that the Mezcal drink he made was a little too sour (we asked him to make it sweeter politely) he took it super personally, told us we didn't know what a good drink was - then dumped a bunch of ginger ale in it (made it worse) and then literally dumped more strawberry balsamic in it. At this point the drink was absolutely unpalatable - so I told him I'd like a new one. He said you shouldn't waste drinks and threw the concoction he made down the drain. He then REFUSED to make me the new cocktail I wanted because \"I wouldn't like it cause I don't like sour things\" then made me a truly crappy and sweet new drink and charged me again. He also made the most disgusting mai Tai's for my whole group (how can you get this one wrong?!). What a completely terrible experience - none of us will be going back here ever again.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "This place has an awesome vibe and was packed for a Friday night! We had to wait a little bit for a table, but we got a booth in the back. The waiters came promptly to take our order, but it took forever to get food/ drinks. For example, my friends cocktail came out first and my beer 5 mins later which didn't make sense to me. We ordered their baked cauliflower dish and it was savory and not overlooked. We also ordered their bread pudding with ice cream (ice cream sold separately), and to be honest, it wasn't that great. I would definitely go back here to meet up friends and grab drinks.", "author": "Sandeep C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "\"And as my hands drop the last desperate pen, in some cheap room, they will find me there and never know my name, my meaning, nor the treasure of my escape ...\"\n\nName it.\n\nWere I that and there's still time certainly I could do it here, without a doubt.  I'd move perhaps even so as to be closer and not have to spend evenings with the man in between for as having chosen a less responsible manner of transportation.  And time locked away, time without choices and afternoons into evenings at the Evil Eye would be sad times indeed.\n\nIt does not appear as if many of my friends have either been here or perhaps they have and they're simply too overcome to find the words yet to share with the others or maybe they'd prefer to not for as the Eye might still be a bit of a secret they'd prefer to keep to themselves for a spell longer.  Little chance that this will stay secret for long.  I've but one fleeting visit but one is enough to know.  Come here in the afternoon.  I'll toast you when you do.\n\nTo all my friends!", "author": "Markus N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Eye can't believe it.\nCocktails come with a real punch!\nBoho living room.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "5 stars plus! Evil eye promptly responded when I made reservations for 10-15. Usually the bar is much smaller and less impressive than their photos, Evil Eye was the opposite so much larger and aesthetically impressive than represented in the Yelp photos. Bartenders were skillful, attentive and nice. Thank you so much for being such wonderful hosts.", "author": "Gracie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "This bar has a romantic, intimate feel. Even though it's huge. Incredibly friendly and attentive. Would 7/7 recommend.", "author": "Drew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Dope fucking bar. Excellent attention to cocktails and pretty easy to get a beer. The atmosphere is laid back yet exciting at the same time. Nice speak easy vibe without being too full of itself.", "author": "Jamal J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "The staff was disgruntled. I was standing near the supply closet when this a**hole of a barback? bartender? was going in there, I turned and said, \"oh is this the secret garden\" he just looked at me and said \"i'm going to need you guys to clear this area\" in a condescending a rude tone, um, okay a**hole. He was walking around all pissed off, his energy was unsettling. No one from the staff even tried to be nice at all. \n\nDear staff, please get over yourselves and get a clue about customer service. Maybe if I was a mustache toting neck beard they would have been nicer. I will never come back to this place, actually when I walk by I will be sure to give it the evil eye.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "There's nothing EVIL about this place other than it leaves you wanting more. It's got an eclectic menu with tasty treats for meat lovers, vegetarians, AND vegans! \n\nThe decor is 70s swank meets Boho-chic, but don't let the fancy fool you - the prices definitely won't burn a hole through your pocket. The cocktails are all about $10 a pop and so are most of the snacks. Try the Chinese broccoli and send your taste buds to veggie lovers heaven. OH MAH GAH, my mouth is watering just writing about it! \n\nABSOLUTE MUST VISIT.", "author": "Flor K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Creative and delicious cocktail menu, friendly and knowledgeable staff, good food, nice decor/atmosphere, and booths! What more could you ask for?", "author": "Ben C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-12", "description": "2 stars for rude female bartender last night and tiny cocktails. Cool space and pinball machines.", "author": "Wil B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "I read about Evil Eye before it had even opened, and kept it on my radar. My friends and I went the second week it opened and were one of the first groups to get there after work. We were all pleasantly surprised at how beautiful and cozy the space was. It really does feel like someone's living room, in the best way possible! They also have a few pinball machines for those looking for added entertainment. I really liked the mismatched vibe of the couches and tables - it didn't look disorderly, just homey. The evil eye theme is prominent but not overly done or in your face. The glassware is also mismatched and gorgeous. \n\nWe were able to snag a booth in the back that was big enough for the 6 of us. At one point, one of the owners came to our table to chat and see how things were going, and she was very personable and excited. Over the course of the evening, we ordered savory furikake popcorn and the deviled eggs, which were both great sharable snacks. For drinks, I tried the Cobra's Negroni, the Old Fashioned, and the Smoked Paloma. All of the drinks were very well made! The only issue we had the entire night was at one point, they got super backed up at the bar and our ticket got lost. It just so happened that 20ish minutes after we had placed that order, the owner had come up to chat and we mentioned that our drinks hadn't arrived. She quickly went to check on our drinks (ticket got lost) and was very apologetic. Otherwise, we had a really fun night and I look forward to going back!", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "I love the way this place is decorated! Vintage, very spacious. However this means that if it's ever crowded you will probably not get a table or a seat. We happened to come late(ish) on a Friday night and got a table since we were ordering food.\n\nWe got:\n\n- spicy kale salad - the dressing on this is v spicy. I would ask for it on the side\n- wings - good! But nothing too special to comment on\n- chicken biscuit - honestly so good. Maybe it was a drunchies effect, but the fried piece of chicken on a fluffy biscuit was really excellent\n- fries - also good, also nothing special to comment on", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "Stopped in for a pre-dinner drink. \nAlthough, after seeing their food menu, I may come back dinner. \n\nThis is a unique space, I love the different seating options. \nIt would work well whether you came with a group, a few people or just one other person.\n\nThe bartender was really nice, and SO great about making me a new drink when he saw I didn't like mine. Which was no fault of his, I didn't realize I didn't like sherry much. I even told him I didn't expect him to make me something else because I picked badly. (Once again, not a bad drink, it was just my personal taste.)\n\nThis is a strange thing to say, but the bathroom is gorgeous! I really hope people appreciate that and don't ruin it.\n\nThe glassware is interesting as well. It's from the owner's antique/vintage collection. \n\nGreat new spot, hope they do well!", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "I was really looking forward to check out Evil Eye after hearing about it. Although it was not what I expected, I would definitely come by here again the next time I'm in the Mission.\n\nAmbiance: dark and groovy. It's got the dive bar feel with the billiards table in the corner. The couches and deco are funky and take you back in time\n\nBartenders are super friendly. Drinks are your usual SF prices, so don't come here if you're on a budget. I really loved the sky juice cocktail- never had a drink with coconut milk before and was glad I gave it a try. If you're into gin and something sweet, I'd totally recommend it.\n\nI'd call this a good place to hang out with friends.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "We stopped by here for cocktails on a Sunday night; killing time before our reservation at Al's Place. We were pleasantly surprised by the drinks and thought the menu looked interesting enough to bring us back. We were in the area and starving so I wanted to go back in.\n\nYes it's \"Bar Food\" but it was well above standard bar food. We thought the Cauliflower, Pork Belly Toast and a burger would be plenty for the two of us...it would have been plenty if we had brought friends too. The toast alone was a meal to be shared.\n\nI was almost embarrassed by the amount of food we didn't eat, like they might get insulted that we didn't enjoy it. The burger was quite good, maybe needed a little salt, but otherwise stellar. fries were crispy. The Toast was best described as Interestingly Tasty. The Cauliflower was a huge hit with my wife.  \n\nDefinitely plan to go back with friends for the cocktails and explore more of the menu. I know I list it as Mderate pricing, but I don't think it was expensive or break the bank.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "The wings were different(good) the devil eggs one of a kind. As for the drinks they are ok, no alcohol. Be careful they pre mix some drinks \" the hello mello yellow\" I believe that's the name. The ambiance is laid back chill, pool table and only one working pinball machine. Over all I enjoyed my Tuesday night out;)", "author": "Charlotte T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "Came here on a Thursday night around 8pm. Ordered a few items off the menu. The deviled eggs, the wings as well as the Brussels sprouts. The food was decent and the atmosphere was casual. The customer service was horrible. The place wasn't even busy and I got no service. The little service that I did get was rude and condescending. The only reason I gave 3 stars was because they had cool looking pinball machines. Not coming back here again.", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Evil Eye is a welcome addition to the neighborhood: a classy cocktail bar with excellent lounge seating. \n\nI LOVED the two of their \"new cocjtauls\" that I tried. The El Gruño combines mezcal and fernet in an unexpectedly delicate and tasty drink -- and the Grandad's Special does the same for rye and coffee. \n\nStandard bar seating with an old school wooden bar and mirror is combined with modern navy walls and light fixtures. The lounge seating in the back is rare for San Francisco and feels very adult... Plus the windows on the back wall are the coolest decorative elements!!\n\nCome check them out and welcome them to the neighborhood!", "author": "Maia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Just left the Evil Eye and I am feeling so warm and taken care of on this cold San Francisco summer night. The drinks and the food were all delicious! The service was a hundred percent! Diane, Courtney and I will be back!", "author": "Camille B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "The old Savannah Blues club remodeled in a very appealing way.  Lots of group seating, so it's big but still cosy.  Nice art and really nice bathrooms! Went there with a big group so we tried lots of the cocktails.  The surprise winner was the El Gruño, which sounded gross, but was delicious.  There were a couple of misses, the Sherry Cobbler just tasted like lemon, and smoked Paloma which tasted like watery salty grapefruit.  Most everything else we tried was tasty.  We also ordered some food, the fries, the chicken wings, pork belly toast and fried green tomatoes.  The winner was the chicken wings, the loser, fried green tomatoes.  Service was slow between drinks, but we weren't in a hurry, and I probably drink too fast anyhow.  Overall a nice addition to the neighborhood.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "This is a newish bar in the Mission District that I checked out on my birthday. It wasn't that busy when I went on a Saturday night--I guess because it's so new and somewhat far down on Mission St. I like the setup of their place with various types of seating like bar stools, round booths, and couches/coffee tables that accommodate different party sizes. They sell delicious bowls of alcohol to share and tasty bar food. You could also get some ice cream (they had Secret Breakfast flavor from Humphry Slocombe the time I was there). Since this place might not be that busy like most well-established Mission District bars, consider Evil Eye it for a large group event or a place to get a drink without the crowds.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Stopped in on a Saturday night after dinner, knowing this place was new and hoping it wouldn't be too crowded. Thankfully for us (though perhaps not for the owners) it had people, but there were plenty of open seats. \n\nOur group of four took a booth in the back, where the stage used to be when it was the Savannah Lounge. They've cleaned up the space a bit (not nearly as dusty as it was before, and some new lacquer) but kept the bar in the same spot. I've always thought it was weird that the space is narrow in the front and open in the back.\n\nOur server was attentive and helpful when we asked about one of the punches, and the bowl was perfect for our group of 4. It wasn't cheap at $50, but for four drinks and potentially multiple rounds, we probably would have paid a bit more otherwise. We also picked up some of the furikake popcorn, which was the only reasonably-priced snack on the menu. \n\nThe menu looked tasty, but it was pricey for a dark bar atmosphere where not all the seating is at proper tables. Hopefully they can find a happy medium between covering their costs and attracting customers soon.\n\nUPDATE: last Friday it seemed things were fully buzzing. We had to hover for one of the tables to clear out so we could sit. Now the pool table is in the way and a poor use of space considering how many drinkers could sit there-- nice for when it's not crowded, but annoying when it is :)", "author": "Krista L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-09", "description": "I'm left asking......\"What happened?  What happened Evil Eye?\"  When I first came in back in August my gal and I swore this is one of the few bars we'd make an effort to go out to.  She loved her craft cocktail, the avacado toast was awesome, and the beer selection was nice.  Fast forward a few months and many of the craft cocktails my gal liked have been pulled from the menu, our food came out burnt and greasy, and the couch smelled of mildew to the point it rubbed off on our clothes so we smelled of mildew the whole way home.\nGreat start, sad ending......We won't be back and I'm guessing this place will be gone by next summer.......Bummer!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-23", "description": "First off giving this place a two star is just plain sad because this place was lovely and I would love to give it a five star rating as it well deserves HOWEVER one particular bar tender was out to ruin my birthday night and I just can't accept her 'tude. My friends and I had just ordered a punch bowl and several goodies from the bar from the \"blonde bar tender\" who seemed friendly enough had only passed out a mugs worth of punch when the 2nd bar tender \"the brunette\" (who thought she was living in that 70s show) came up to our table of 7 and snapped at me and my friends in a very loud and very aggressive tone saying \"WAS THERE AN ISSUE CAUSE YOU DIDN'T TIP SO IF THERE WAS A PROBLEM I'll NEED TO KNOW\" we all looked at each other confused af because we weren't done ordering. A receipt was given because we had ordered food but planned on staying for a while (at this point based off what we ordered the bar tender who actually served us was looking at a 25 plus tip). I AM A BAR TENDER and I have never experienced this type of behavior from a bar tender I've worked with or been served by in my 6 year of going to/working at bars. It got outrageous. Responded with a very confused \"we thought we'd trip cash when we were finished (like at every other bar ever.)\" she glared at all of us and no joke hair flipped away then immediately went to go talk shit and giving play by play to the \"blonde bartender\" the two laughed like middle school mean girls and this continued the rest of the time we were there. Two more friends of mine showed up for my birthday and out of the total 11 people in the bar (9 of them in my group) it took over 5 minutes to even get a bar tender to say anything. Both saw us and said something to each other about us waiting AND POINTED like they couldn't be more obvious or childish. Nor were they getting any kind of tip at this rate, nice way to screw over your friend/place of employment because we will not go back here unless it's to speak to the manager/owner about this particular set of women because they really made a tremendous effort at ruining my birthday night. But bitches don't get me down. The food arrived and was passively aggressively thrown on our table, surprised any of it showed up at all. Our stools were taken away from our seating area to place that no one was using, like I said we are pretty much the only people in the entire bar. And the only burger we ordered came out burnt. Since I'm a bartender and a nice person I decided to tip the \"blonde bartender\" since she was somewhat helpful and did her job to some extent. I said to her \"i'd like to personally give you this tip and only you because I'm pretty sure you know your friend over there hasn't been very nice to us since we got here\". She giggled. \"OK well I hope you have a wonderful evening and I'll be writing just as wonderful of a review about both of you on yelp. Appreciate it the great service.\" Finally after all the shit talking and dirty looks we got we were leaving for a much more relaxing and friendly environment and this bitch had the fucking nerve to clap us out of the fucking bar. Yes, I said clap us out. I turned around and I was like \"hi excuse me if you have something to actually say now is the time\" this scared little Bitch hid behind her bar and wouldn't even look at me after pushing me and my friends the entire time. I told her to go fuck her self and I fucking mean it. I have worked in customer service since 2009 and that shit was unacceptable. Maybe this was her way of adding to the \"Evil Eye\" environment but it came off as just trashy. I will be calling to further this because I was looking forward to this experience and now I'd like to ruin its reputation.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-02", "description": "RUDE RACIST OWNERS!!!\n\n\nLast night I went to Evil Eye bar to have a drink with my friend and had the worst experience with Matt and Piper, the owners of the bar. The Latino bartender began serving us, when suddenly, the male owner Matt came by and asked if we needed anything else. I asked for more water, as he quickly directed me to help myself at their water station located at the end of the bar. I informed the owner that the other bartender had just given me water where I was sitting. He then responded rudely by informing me he was not going to treat me any different from any other customers and again directed me to the water station. I told him it's fine, I would help myself. As he walked away, I turned to my friend sitting next to me and said, \"why does he have to be an asshole about it?\" I quickly looked over and noticed he was nearby and overheard what I said. I looked at him and said, \"You heard me?\" He nodded his head, \"yes.\" I responded, \"I get it, you have your own protocol and all and that's fine, but I did feel you were very rude about it.\" He began repeating rudely, that he was not going to treat me any different from any other customers. \n\n\nWhen I went to the water station to help myself there was a lady fixing the cups. The lady asked me if I was having a good time. I informed her of what had occurred with the other owner and how I felt I was being subliminally racially discriminated against. I had a pleasant conversation with her and she had revealed that she was the owner of the bar and her name was Pipper and how she was Matt's wife. At the end of the conversation, I thanked her for changing my perception. I then went back to my seat where my friend was seated. Matt stood in front of me cleaning a cup and had rudely informed me that after tonight I was no longer welcomed into his bar. I informed him that it was perfectly fine and I would be leaving shortly. After exchanging words with Matt, Piper stood right behind me and disrespectfully informing me that I had to leave the establishment. I informed Pipper that I had just finish saying I was leaving and I could walk myself out. She began following me out, then suddenly she GRABBED MY ARM! I told her I was a respectable person from the community and a peace officer. I also informed her that there was especially NO NEED for her to be grabbing me and I was leaving her racist establishment without making a scene. I began questioning her of the need and audacity to place hands on me as she began to retrieve her physical grip and walked away.\n\n\nI have never experienced this level of disrespect in my LIFE!!! I am a person of the community, I have worked in the neighborhood for years in nonprofit work and now work as a respectable peace officer. I am completely APPALLED and ANGERED by the way I was treated and how both owners teamed up to badger and verbally disrespect me regarding a comment I made to my friend that was not meant for him to hear.\n\n\nGiven the fact San Francisco is enriched with a plethora of different cultures and nationalities from all walks of life, I did not find it skeptical to notice the bar was filled with predominantly Caucasian hipsters and myself being one of the only Latina females. This observation was never the issue. I honestly felt that the owners were targeting me given that I was the minority within the establishment. Knowing an extensive amount about customer service and its expectations, customers are an essential factor to a growing business and its reputation. Customer service should always be demonstrated as legendary to continue the growth and longevity of a business. And feel free to quote me if I am wrong, but it all begins with customer and employee optimizing interactions. Sadly, this business did not fulfill any of the criteria of a legendary service. Yes, if I were verbally antagonizing the owners and fellow customers along with demonstrating a volatile behavior then fine by all means get loud and ask me to leave! But I've engaged in none of these obscenities.\n\nOther precautionary measures could have been taken. We could have discussed the issue and delegated out the tension and negativity, but NO! Matt decides to feel violated and have his sense of pride shaken by a female due to catching whiff of someone's personal opinion spoken about him. Piper and Matt, your customer service is a fail. Try putting hands on the next person and let's see if after letting go, you'll be able catch another quick break!", "author": "Cindy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-01", "description": "Came here on a Friday night, every seat was filled. They have a nice drink menu and I liked reading what they had each alcohol paired with. I got the desert rose with tequila, it had great flavor and the drink was nicely balanced that I couldn't even taste the alcohol, yes I did feel it later. The food and service however weren't up to par with the drinks. Ordered the fries and they were luke warm and my friends and I commented on how there was no potato inside like hollow, crunchy shells. The waitresses weren't too tentative either and when we asked for the check the other waitress wasn't pleased almost confused and then upset she had to fetch our check. The ambience is a cute boho vibe. Yes I would come back for the drinks but avoid the food and interaction with the waitresses.", "author": "Chloe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Great drinks! Nice vibe and decor. The bread pudding was amazing with an even better presentation. Thanks Matt!", "author": "Rachel J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-29", "description": "Couch smells like mildew. The drink we came back here specifically for is no longer on the menu nor can they make it when requested. Won't be back. Looks like our awesome experience was just a flash in the pan. Sigh.", "author": "Kat R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-09", "description": "Terrible service and drinks just ok. Some friends had a couple tables reserved and I ordered a drink along with a few others. The waitress recommended one for me, so I went with her suggestion.  A long while later everyone got their drink but me, and she asked if anyone else wanted to order. I told her that I'd ordered one already and she said \"well I can't remember everyone's face\" and then turned around and wouldn't take my order again. Uhhh...what?  So, no, I won't be going back.", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Very good environment at night and the food is great! There's a lot of room for social gatherings and for those who still want to sit down and eat late at night. Definitely I will return.", "author": "Yvette E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "If Cheers or Friends took place in San Francisco this would be the place!! A place for friends, dates, late nights, meet ups in Mission is here. \n\nThe historic long wood bar, the friendly staff and welcoming cocktail and bites menu is legit! Try the beet pickled deviled eggs - nailed it. \n\nYou know a bar is half way good when the owner is actually working the bar. \n\nSeating is awesome by being cozy. \n\nWill be back again very soon!", "author": "Thomas V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Cocktails are awesome, a huge variety as well. The ambiance is classy, dark and speak easy'ish - they do get VERY busy on the weekends, so please bear with the bartenders who are tirelessly making drinks with a smile.", "author": "Tarun P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "My favorite bar! It's cozy, the deviled eggs are delicious, the wait staff is friendly, and Grandad's Special is my very favorite drink.", "author": "Sahra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "Place had a really cool vibe, drinks were good and the pool table was fun to play with. Bartender was a little into his own drama the day we came in and it took forever to get drinks with not a ton of ppl there. Would go back and give it another shot though!", "author": "Erica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "LIT. \n\ngorgeous decor, rare pinball machines, and a beautifully lit pool table. \n\n$11-12 boozy cocktails served in great glassware. \nGreat for what it is. \n\nTons of couches and booths to sit in, great for dates and small groups of friends. They have these pretty stained glass windows in the back wall. \n\nThe chicken wings and avocado corn toast are really good. \n\nget it before this becomes \"a thing\"\n\nUpdate: it's now too lit", "author": "Megan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-04", "description": "25 minutes later and still no sign of 2 drinks that my bf and I ordered. No way I'm visiting this place ever again. The place is not even crowded or busy. Waitress seemed like she hated her life. The only reason that I didn't complain was bcus it was nice and warm inside and outside it was freezing.\n\nShit service. Not worth it.", "author": "Karen G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "God awful service.....from the owner. Yes, the horrible bartender that all the reviews below describe is actually the owner of this bar. Unfortunate, because when you walk in the place looks great, like it should be THE neighborhood place for birthday gatherings, dates, after work drinks with coworkers. I guess because the bar has made a few lists and is near a huge transportation hub the owner has no need for return customers. \n\nWe took a table in the back because we wanted to order food. My friends decided to go up to the bar to order drinks because we were on our way to the show and the service seemed kind of slow. One friend came back with a drink, the other friend was told by the rude bartender that she should go back to the table and order her drink because it's just easier for him that way. Excuse me? After waiting an incredibly long time to be next in line for the bartender, you're told you can't order your drink at the bar because you're sitting at a table...because it would be easier for him? WTF? And she only ordered beer. A lady comes to our table to drop off plates for food, and when asked if my friend could order her beer, she scoffs, \"i'm not a server\" ....OKAY.  Meanwhile....back at the table 20 minutes later...two friends have drinks and food and one friend still hasn't even been able to order. The best part of all this is that the rude bartender who couldn't be bothered to pour a beer for someone who was next and had been waiting...is the owner. \n\nOne star for the food (which was actually good), one star for the decor and the space, one star for the server who was the only employee working worth a damn. Advice to the owner: hire some staff with some customer service experience and get out from behind the bar.", "author": "Nao D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Love this spot. Great drinks and delicious food. Also located in a lesser visited area in the Mission District. Hope they stick around for a while!", "author": "Nick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Stopped in for a drink, and ended up staying for hours sampling off the small bites menu and playing pool. This funky joint brings all the cool and unpretentiousness that San Francisco has been known for with its seventies style decor paired with inventive and TASTY cocktails. My personal favorites are the gin bramble to sip on, and the fried green tomatoes with burrata is a must! As an SF resident myself for going on 10 yrs, Evil Eye is a breath of fresh air compared to many other generic bars/restaurants I've seen popping up recently. I foresee a lot of my nights out spent here in the future. :)", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Great local bar in the Mission with fantastic mixed drinks.  Had a surprise birthday party here and Piper (the owner) was very accommodating and helpful with reserving a space.  We ordered several bowls of the grapefruit, mezcal and rum punch and it was delicious (and this is coming from a person that never drinks cocktails).  Will definitely visit this bar again and again, especially when with a group.", "author": "Craig S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Had a great time here! The punch bowl drinks are super cool if you are with a couple of people. I would highly recommend that you check it out", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "evil eye was awesome! so glad we decided on this relatively new bar for our first alcoholics meeting of 2017.  the space is really cool with lots of cozy group seating, and plenty of seats at the bar if youre by yourself or one other person.  at 7:30 on a random wednesday, most of the back table areas were taken, so we grabbed one of the two at the front of the bar.  the cocktail menu is extensive, and amazing - 3 types of punches at $50 each, 3 sections of cocktails: citrus, spirit forward, and classics.  the three of us got 3 different drinks each, and shared a punch bowl with latecomers.  i would probably skip the punch bowl next time because it's a little too fruity (mezcal rum combo - #2), but the cocktails themselves are legit!  we did not have a bad one.  also ordered the pimenton fries (nice n crunchy) and the pastrami toast (great portion size for $10!) if this spot was any closer to fidi/soma where i live and breathe 98% of my time, i would come here probably once every 2 weeks  carlos served us and he was amazing - round of shots for everyone at the end, and 2 extra for him and my guy friend. so awesome!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-14", "description": "They serve the tiniest cocktails I've ever seen. I had the Continental and it was just a big block of ice with maybe a shot of liquid pooled around the edges. What a disappointment.\n\nThe anchovy toast with tomatoes was soggy, but the chicken wings were ok.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "Really bad first experience here. Had a drunk bartender verbally assault someone in our party completely unprovoked. He then proceeded to try and significantly over charge us when we were leaving-hoping we wouldn't notice.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-24", "description": "This business is shady by adjusting receipt to increase tip even though I left cash tip. Luckily I kept my receipt. I was there 10/22 evening, served by cashier: Gina I. Shame on you people. I'm never returning and you bet I'm disputing that charge. You guys suck ass.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-03", "description": "Drinks are great, the space is great.\nService, however, was really sub par last night and I will not be back.\nCame with a group. Was acknowledged by the bartender 10 minutes after sitting at the bar. There were maybe 20 people in the bar total, and three parties ordering drinks. I understand the drinks take a minute to make, but at least be friendly and acknowledge your patrons.\nBarback asked if we needed anything / if we were doing OK. Asked if she could take drink orders and she said yes, so I ordered. 15 minutes later, no drink, no bartender at the bar.\nI was at the empty bar trying to cancel my drink and close out, while the barback sat with her boyfriend having an intimate moment. No acknowledgement. I had to ask for her help, in which she replied a very template response, 'the bartender will take care of that for you.' There was no bartender behind the bar. I asked her if she could cancel the drink order I placed with her, and her template response came out again, 'the bartender will take care of that for you'. I don't think she even put the drink order in, and was so infatuated with her non-work conversation. It was very rude. I recommended this place to a group of 6 friends, in which two made comments about how rude the barback was aside from my interaction. Sad, this place is so good, to have such poor service. I really don't think it was the bartender's fault.", "author": "Trevor M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "Evil eye was popping up nonstop on my facebook for some time when they just opened, so I took as a sign that I had to make an appearance. I came here with a friend as our first stop on a cocktail binge in the Mission, we went with the Grandad's Special and Gift of the Andes. Grandad's Special was a nice spin on a manhattan-like drink. Gift of the Andes may need some less mixology to it, because the flavors seemed to clash too much and leave a strong fruit aftertaste. The bar has a cool pool table, but the service is a bit lagging.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-27", "description": "Won't come here again- I so badly wanted to like this place. The bartender was rude, disrespectful, and condescending. I honestly can't believe it- so disappointing. ‍", "author": "Mariana P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-15", "description": "2nd attempt in checking out this bar. Surprisingly, it was not as packed on a Thursday night. But do avoid Friday & Saturday nights(it's crowded). The drinks take awhile to make... but I guess it wasn't as crowded that I did not have trouble with the bartender as most of these reviews stated. The fries were over seasoned in a spiced powder. The citrus drink I had with vodka, lime, pineapple, turmeric was delicious but easily fucked me up later on. I was buzzed. I think they frequently change their drink menu and I was actually excited to try their mission mule but didn't want to be a pain to order a drink from their previous menu. Would like to visit again if it's not as crowded.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-17", "description": "Came here today for a quick drink and some snacks. The bar gets one star for the food which very good and tasty! And one star for decor! What I didn't like was that the bartenders seem very annoyed to be at the bar and they all had very stale faces! I only got one smile from who I think was the barback. One thing that really bugged me was when a homie who was a little buzzed wanted to get some food and a short stack bartender went off on him, 86 him and making a scene! If this was a tech person they would've cater to him regardless!! To the owner of the bar you need to tell your bartenders to treat everyone equally regardless of how they look! One bad move like this to the wrong person and your going to end up like locals corner. Please have your bartenders respect La Mission and all its characters! FYI the drinks could use improvements they were ok, but I believe the bartender was a beginner so he will get a pass. Would I come back idk? I do recommend the food.", "author": "Duke Of Frisco X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "Pretty cool bar to check out in the Mission District in San Francisco.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "I must say, food is great! But the people who own this bar should know where they are located at and welcome others.", "author": "Lulu R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Serious contender for the nicest bathrooms in SF...I shit you not. \n\nEverything else is great as well. Excellent, actually. Best new spot in recent memory. \n\nMy only concern is not being able to find a seat after word gets out.", "author": "Lou D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Dear evil eye, mission has been in need of a chill spot like you that offers good drinks/crowd/decor and OK food. I will be back!", "author": "Beril Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Evil Eye is the hot and new bar in the Mission. The bartenders are extremely skilled, ready to make whatever your heart desires. The cocktail selection is excellent, as well as the bar bites. I had the pink deviled eggs and fried green tomatoes. The burrata melted perfectly on the tomatoes for some cheesy goodness. \n\nThe bar is beautifully decorated with plenty of space for groups. It feels very much like a classy friend's comfortable living room. There is a huge wood bar, and great details throughout. The glassware is an especially nice touch to complement the delicious cocktails. \n\nAlthough this place has barely been open, it's already popular. I found enough seats to comfortably fit my group of four though, since this bar is surprisingly big! I was really impressed at how fancy and clean the bathrooms rooms were, something of a rarity in the Mission. Definitely check this place out!", "author": "Amy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "We visited this bar while visiting a friend who lives in the neighborhood. We learned it'd only been open about a month and seems it will be a welcome addition to the neighborhood. As if following a dare, we tried all three punches they offer and all were delicious (though #2 was my personal fave). Food options were all fantastic- I ordered the antipasti, which was enough to share but if you're a little hungrier could also be eaten alone. The music and ambiance was great and the bartenders were Amazing!", "author": "Megan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "after several trips here, I can safely say that there are no bad menu items.  the mixed drinks are exquisite, the staff is excellent and the ambiance is wonderful.  I highly recommend stopping by.", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Super solid.  Get the mezcal punch bowl, obviously, and the Vietnamese wings.  Also, get everything else, it's all good.", "author": "Bernard W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Amazing drinks, amazing food and a very relaxed chill atmosphere. Highly recommended!!", "author": "B F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "This place is fantastic. Food is great, drinks are better, staff is the best. Thanks for a great night! We will definitely be back soon. Keep up the good work!", "author": "Charles G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "First time here but the cocktails are incredible and the small plates are a fantastic complement. that space is very inviting and comfortable with vintage couches. 100% would come again.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "This is the bar I had been dreaming of but didn't realize it until I walked into this eclectic and funky lounge and did not want to leave. Beautiful (and damn comfortable) space and designed lighting that creates such a welcoming, unpretentious vibe. Amazing, thoughtful bites (get the deviled eggs and pork belly toastie STAT) that accompany completely unique cocktails (the gin rambler is amazing) in vintage barware. The owners are experts, every detail considered and executed to the guests delight (gorgeous marble bathroom with fresh flowers and candles? Uhhhhh let me think about that - HELL YES!).", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Great drinks, great bartenders, great vibes.  Definitely my new chill spot in the Mission.  Favorites are the house gin and tonic, and the grape ape!", "author": "Alicia T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "How come some people get a taller glass of cocktail and others get a short glass? My friend with the tall glass is white. The 2 shorter glasses belonged to friends who were not.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "One of my favorite places to go in the city, hands down. The entire crew that works there are always welcoming and ready to chat it up and serve some amazing drinks and food. Never had a bad experience here and make it a point to stop in whenever I'm near. Anyone who wants to have a chill night with friends should make this place a staple! Seriously, run don't walk to Evil Eye you won't regret it.", "author": "Sherry T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-08", "description": "OK, I waited awhile for the dust to settle as yet another hip bar in the Mission sprung up. Liked the look of the place, 80% women, small kitchen, but it's the bartender that's gonna make a place and this bartender had his customers waiting even after they ordered. Will I go back? Probably not but this \"new\" place has already garnered a steady clientele, so they must be doing something right.", "author": "Googie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-25", "description": "snooty, achingly too-cool-for-school service.  decent enough cocktails / food i guess, but there are loads of places to get that without being condescended to. they're trying so desperately hard.  you're not zeitgeist or toronado, assholes.", "author": "beltrand a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Very cool place! Would recommend the chicken biscuit for food and the Manhattan to drink. Speak easy look with a punk soundtrack.", "author": "Andy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-28", "description": "Friendly patrons, and a great first cocktail. The second one never came because it got busy, and the bartender started serving people who ordered beer bottles or simple drinks. Cool - except when you completely ignore my existence, even though I am sitting at the bar, looking right at you, watching you skip me. My first and last time in this place.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "came in with a group of a few friends.... there were maybe a dozen total other people in the bar; the bartender told us to wait about 15 minutes to order a drink... what?! they also spent about 10 minutes trying to fulfill a food order... VERY amateur. won't be back again.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-22", "description": "Lovely interior.  Fancy presentation.  Fancy ice cubes.\n\nWeak drinks, too sugary.  I had an old-fashioned, which tasted like syrup.  Then ordered a manhattan (w/Jameson's, very, very light on the vermouth), got back a drink with too much vermouth.  Too watery, too sweet.\n\nPerfect for the \"fireball is whiskey and Coors is beer\" crowd, I guess.\n\nI won't be going back.", "author": "Chet M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "\"Evil Eye\" is a really great neighborhood place that's friendly and not at all pretentious, even though there's some serious mixology taking place here that rivals ANYTHING (Hard Water, Bourbon & Branch, Rickhouse, etc.) I've had in SF. Seriously, it's THAT good and you won't need to empty your bank account to enjoy your visit. The food is excellent as well, and creative.  We tried the toast with avocado, which was a real treat loaded with tasty roasted root vegetables.  The atmosphere is comfy and the crowd is diverse.  The decor includes couches, cushioned bar stools, a pool table and even a couple of pinball machines.  Owner Matt works the bar like the cocktail wizard he obviously is and everyone else on staff really seems to enjoy being part of the great vibe \"Evil Eye\" creates.  We will absolutely return and take friends.  Can't wait to try one of their \"punch bowls,\" but we will definitely need a group for one of those.  Now, if Matt could open an \"Evil Eye\" in Marin .....", "author": "Rick B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Evil Eye has the drinks you are looking for and food to match.  I tries the Drunken Sailor and the El Gruno paired with the Pork Belly toast.  Great ambiance that feels like your best friends comfy living room.  Highly recommended and I will keep going back every time I am in San Francisco.", "author": "Erik R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Best new place. Dropped in for a quick drink thinking 15 mins. Winded up staying for a couple of drinks and food. So unexpected. Great new spot. Plenty of space, cool chill vibe, great decor, awesome cocktails, yummy food and a pool table! Fav drinks Horse Race and sweet Petunia.  Savory furikake popcorn and anchovy toast DELISH! A welcome addition!!! Luv this place.", "author": "L W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Evil Eye is my new favorite bar in SF!  I've been here a few times since they opened, and the drinks and food have always been on point.  My favorite cocktail is the Sky Juice (gin, cachaca homemade coconut milk (!) and other good stuff), I could drink a gallon of it.  Food-wise the chicken and biscuit is SO delicious - my friend and I agreed it's the best dish we've had in a long time.  After all the changes in SF the past few years it's really refreshing to be in a comfortable, unique and welcoming neighborhood bar that feels original.  Love this place.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "New little spot. The food looks good and the vibe is chill. Good selection at the bar. The crowd during the week seems like youngish professionals, but I'm betting more locals on the weekend. Would try it again on a weekend to see the crowd.", "author": "Rage Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "My new favorite SF bar. Great food. Delicious cocktails. Pool table. Pinball. Cozy couches and friendly service. Evil Eye is a great place to meet up with friends. Check it out!", "author": "Donna H."}
