{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "I tried their ube crusted pizza at this years ube food fest in the SoMa streetfood park and it was bombbbb! The first bite I took was the crust alone, so I really got a chance to taste the ube flavors in the dough. Initially I tasted the ube very distinctly and it did in fact taste like ube, butbeith a combination of pizza crust. Hoenstly, if I could order all my pizza crusts like this I would because the flavor was distinct but not too drastic, so I paired well with any toppings.\n\nI ordered the mushroom and sausage and it was cooked perfectly. I have to say the sauce really made the pizza as delicious as it was. It was super tomatoey and tasted like puréed fresh tomatoes cooked right on the pan, not like canned pizza sauce. Exclusive meal!", "author": "Alejandra A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-14", "description": "Part one of my weekly office lunch came from Firetrail Pizza. Our delivery order arrived via Caviar on Friday, August 10th a little before 12:15pm.\n\n*Pepperoni Pizza - Small 10\": Crushed tomatoes, shredded mozzarella, hormone-free pepperoni, and grated parmesan cheese ($12) x2, add Olives (+$1), Mushrooms (+$2)\n*Sausage and Mushroom Pizza - Small 10\": Crushed tomatoes, shredded mozzarella, hormone free, spicy (not too spicy) Italian sausage, mushrooms, and grated parmesan ($14), add Olives (+$1), Basil (+$1), Pepperoni (+$2)\n*Organic Mixed Greens: Lightly tossed in lemon, olive oil, and a pinch of sea salt ($4.99)\n\nThe pizzas arrived kinda smooshed and disheveled. I think cuz they were packed on their side. It was fine as it didn't affect the taste. They were a good size. Perfect for for an individual. Not too big and not too small. Though I think they forgot the basil in the sausage pizza as we didn't see any. My salad was standard. I didn't like the dressing that came with it as it was overly citrus-y. Overpowered the mixed greens.\n\nGood spot for individual pizzas. Just make sure you get all your toppings when adding extra. We missed our basil.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "I dont know who Put $$ on this as being mildly inexpensive because this place is WAY WAY WAY WAY WAY over priced.\n\nI thought i would take a chance because i am still on a quest for a decent pizza in SF and have not yet found one.\n\nThe pizza? Meh, i dont how you paid off these reviewers to give you all these stars but they are bat crazy.\n\nAlso, 42.32 for a 14 pizza with ONE topping? That is QUITE the rip off...", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Had the margarita pizza for the first time and it was absolutely perfect. The dough is perfectly crispy and chewy at the same time. High quality cheese and a very balanced tomato sauce. I live over in hunters point and from the moment I placed the order it arrived in 20 minutes! Speedy and delicious. Bravo!", "author": "Elly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Firetrail Pizza is hands down one of the best pizzas I've had! Super delicious. I love how thin the crust is; and my pepperoni pizza had just the right amount of every ingredient! \n\nToo bad I live a couple hours away, or else I'd come by and grab a pizza way more often! Nom nom nom. You won't regret it!", "author": "Susanna Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Beautiful pies and very above-average pizza delivery option in SF! \n\nThey've got that nice bubbly, charred crust and a generous spread of gourmet toppings. You'll pay about $20-25 per pizza, but they're a nice size. 1 pizza is perfect for about 3 people (or 4 people with good restraint :) \n\nWe had some delivered for a pizza party in the office. A good value for a handful of people, but could get pricey if you're feeding a large crowd.", "author": "Nique F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "If you're in the mood for excellent, fast, beautiful, expensive little pizzas - this is your place. I had them at Spark Social, where they seem to be a regular. Great pizza, perfect crunchiness + softness, a lil smaller than $12 should get you, but you are in San Francisco after all", "author": "Hareem M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-10", "description": "Terrible, skip it. Ordered delivery, charged my card, no show. Called restaurant, they said driver already picked up order, nothing they could do. Called GrubHub support, they talked to driver, driver said restaurant was closed when he arrived so marked the order as delivered. 10 peeps waiting on no food. Skip it and order from a real restaurant.", "author": "andrew s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-19", "description": "My husband and I had Firetrail for the first time when we came for a concert at the Bill Graham Civic Auditorium. Firetrail was super fast at making our margarita pizza and it was really flavorful and tasty. The only issue we had was that the pizza is a bit soggy in the middle which made it impossible to eat without a fork. Our pizza was cooked well too so maybe there was too much cheese? The other downside was the price. For $10 or so, this was pretty small but the quality is high so I am ok with that.\n\nWe might try this place again in the future.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "Was here for a work event, line was not too long, but the wait for food was a little longer then the other food trucks.\n\nFor $13, a personal pepperoni pizza (had a little heat, maybe in the sauce) was quite delicious. It is a thin crust, so for people that like a lot of crust it is not your thing. It had a good balance of cheese, sauce and heat.\n\nI would get it again, if I was in a pizza mode around the area.", "author": "Mei L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-28", "description": "On this particular visit, the pizza was cold. Perhaps because it was from the food truck and eaten outdoors, but still...", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Good stuff ... really. Gluten free crust was great! Had from food truck @ Mission Bay.", "author": "Henry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Delicious! So glad that Soma Street Food Trucks is only four blocks away from my place. Perfect char, perfect crust, and perfect toppings. Not sure who can compete at $13 for four slices in the SOMA or in Design Dist., Potrero or Dog Patch. New go-to.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Even though it's been over 7 years since I left NYC, I'm still *very* particular about slices in San Francisco.  Most are pretty bad, that's just a fact.  But San Francisco does excel in cooked-to-order-at-a-high-temperature personal pizzas.  It's a completely different category from reheated slices, but that's fine.  This anchor in the new Spark food truck park is perfect to meet your comfort pizza needs.\n\nClassic Pepperoni Pizza: I love fancy pants ingredients just as much as the next guy, but I also love me some pepperoni pizza.  I'm always tempted to try that benchmark pizza first before exploring other varietals.  And Firetrail did not disappoint!  A generous amount of red sauce that had a nice tomato tang.  A decent amount of cheese and tons of juicy pepperoni.  Crust was nice and chewy too.  I was able to dust off the whole pie myself and felt full, but not grossly stuffed.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-11", "description": "I actually went to the one on 4th street, in what is known as \"spark\".  It is all full of really expensive food trucks, and this one was the only one that did not serve Poke bowls.  The pizza was good, but only when it was hot, otherwise the crust turned to mush, and was really gross.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "I've ordered the margherita pizza several times through UberEATS. Despite short (under 30 minute) delivery times it's never arrived more than lukewarm, which suggests to me the restaurant could be doing more to keep things warm before the Uber courier arrives, but the pizza is still delicious with delightfully soft crust and savory ingredients.\n\nPrices are fair for the city although I do wish there were an intermediate size between 10\", which is too little for one person, and 14\", which is too much for one yet too little for two.", "author": "Barack O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-19", "description": "I'm going to keep this review simple.\n\nThe things they have going for them:\n- fresh ingredients (except the basil), good quality mozzarella and tomato sauce.\n\nThings that didn't work for me\n- crust is way too thin\n- the oven was dirty from previous pizzas that were charred, I could tell from all the char particles at the bottom of my pizza and my pizza came out a bit too charred", "author": "Josh Giosue D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Really impressed by Firetrail pizza! I ordered through postmates because I was going to a group event and needed something to contribute. Reasonably priced: I got two ten inch pizzas--one sausage and one Margherita. The sausage was delicious and I loved the char on the crust (a bit burnt in small places but nothing that ruined it for me). \n\nWill definitely seek out their truck when I'm in the area and get one of their pies hot out of the oven!", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "The best part about SOMA Food park is that if your friends are anything like mine everybody can have food from a different restaurant and enjoy eating it together.\n\nReally beautiful pizza. This place has a brick wood fire oven as far as I can tell. It is one of those ovens that is so hot Pizzas come out fast. I'm no pizza expert but I think that is the way the best Pizzas are made.\n\nThe pizza comes out perfectly. Its something special when you look at the bubbly thin crust. So many are going the low carb route so this will fit into your diet if you share the pizza with another friend or two. The toppings are not piled on so heavily either - the crust has a chance to rise.  The bubbles are a sign of a good fresh dough from what I know.\n\nSOMA food park is a comfortable place to hang. If you have never been come and enjoy. There are TVs and bathrooms and parking spaces usually toward the end of the day. What more do you need? Grab a couple friends and have a drink in this relaxed environment.", "author": "Stefan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "Pizza was the bare definition of pizza. Would not recommend. FYI this is for the Firetrail in Mission Bay", "author": "Patrick J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "That awkward moment where your friends are carefully watching your expression as you sink your teeth into a mound of melty cheese, pepperoni, steaming hot tomato sauce and spongy, floppy pizza dough and you suddenly realize that you just torched the f#ck out of the roof of your mouth and you're definitely not enjoying this, but it was your own d#mn fault because you definitely knew that you needed to let it cool down, but once the smell of all that bidness hit your nostrils you were like, \"Hey guys, take a look at the pizza I just scored at that food truck.\" And now you got mouth skin falling off the roof of your mouth because you blistered yourself, and that's rather disgusting, but nonetheless the pizza is really tasty and you kind of just decide F#ckit, I'm devouring this bastard, and your expression switches from intense pain to pure joy.\n\nThat's about all I can report. The crust is a little too flopster for my tastes, but it's kinda all the rage these days, I'd eat it again and I'm sure, seeing as I'm basically a lughead of a foodie, that I'd burn the f#ck out of my mouth the next time, too.", "author": "Howie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "I discovered these guys recently at SoMa StrEat Food Park. Truth be told, I wasn't exactly expecting much from pizza served from a truck. But boy, was I blown away! Firetrail is dishing out some legitimate 'Za! \n\nAnd these aren't just regular slices, folks. You're getting you're own personalized pie which is almost big enough to feed two hungry hippos. Best of all, it's only $11. You really can't beat that price. I ordered the pepperoni (which comes baked with crushed, flavorful tomatoes, melted mozzarella & parmesan cheese). It only took 3 - 4 minutes for the food to come out of their mobile wood-fired oven and go straight into my mouth. You'd be hard-pressed to find a better pizza experience in SF. \n\nI would serious consider hiring Firetrail Pizza to cater my next big event. These guys really know what they're doing. And they've forever changed my view of food trucks.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Thin and crispy pizza that delivers. A little pricey, but it was worth it to try it out. Crust was perfection, pepperoni nice and spicy. No leftovers. Perfect. Not super filling like other pizzas, so be prepared if you have a hungry crew.", "author": "Tracey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-04", "description": "Not that impressed at all. Its pretty pricey for a mediocore pizza that is small. Had the four cheese pizza which seemed super greasy and just overall small for damn near $14. I think ill pass", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "4.5 STARS\n\nUntil recently, food truck chasing was a thing of the past for me. In most cases (especially the newer trucks), the food is overpriced and mediocre. Why pay restaurant prices with no seating and no porcelain throne?\n\nFor the love of our furbaby, that's why.\n\nSoMa StrEat Food Park has become our weekend rotation because they're super dog friendly. While we grub, Tater Tot sniffs butts. A win-win situation!\n\nI had a hankering for Asian food but all the Asian food trucks used MSG. I yelped Firetrail Pizza and they had solid ratings so I decided to give them a shot. That particular Saturday, they only had three types of 10-11 inch Neapolitan pizzas available: Cheese ($10), Pepperoni ($11), and Pesto ($12). I'm not sure why some people are complaining about the price because pizzas of this size and caliber are usually $13-$18. CC's accepted. \n\nPizzas are cooked in their mobile wood-fired oven, and are ready in less than 5 minutes. They also offer delivery but Neapolitan pizzas are always best, hot out-of-the-oven. \n\nMr. NSS wanted a meat pie so I ordered the Pepperoni for us to share: http://bit.ly/1ErF2yI. The leopard spotted crust was flavorful with a great, toothsome chew. The bottom crust had a subtle char giving it a nice smoky nuance (foldable and not soggy). The tomato sauce was bright and tangy. Loved the stretchy c-h-e-e-s-e. I normally order veggie pizzas so I found the pepperoni to be a tad too oily for my liking but everything else was fantastic, especially that crust! \n\n4.5 stars rounded down because I wish they had more of a selection.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "I live like 2 blocks away from this place and the pizza i received was burnt and nearly freezing. Never ordering again", "author": "Sahil A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-09", "description": "Do not order delivery with uber eats. Pizzas were completely cold and I only live 5 min away by car. Save your money and only eat this pizza at the food truck park. Total waste of time and money.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Firetrail catered our wedding a few months back. They were very flexible and let us customized the pizza menu. They arrived right on time and all of the pizza types turned out delicious. Service was reasonably quick for the most part. There were a few pauses but it's probably because my guests were pretty quick to grab the pizza once it's out of the oven. Definitely recommend.", "author": "Mona A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Solid pizza truck. They deliver too!\n\nSuper fresh ingredients - I always get the margarita and add pepperoni/mushroom/garlic. Delicious.\n\nTheir crust is also fantastic and service is fast. Highly recommended!", "author": "Farid V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Who would have thought someone could have a truck with a brick oven pizza? Even more who would have thought these pizzas would be as good as some brick oven pizza joints? Top it off with offering a gluten free crust that doesn't taste like it's made of cardboard and you have something truly special. Their crust is really thin and crispy with a good flavor. \n\nOne thing about the gluten free crust they'll be sure to tell you is if you're really sensitive or allergic it's not for you. When I asked they said because of \"how it's made.\" Reading other reviews and thinking about it, I can see why. The gluten free pizza shares the same cooking surface, cutting board, and utensils as the regular pizzas. Fortunately it's not a problem for me but if you have allergies or celiac you will probably want to avoid eating here. \n\nThey are a pretty common vendor at the SOMA Street Eats food truck park (just look for the truck with a brick oven on the back). They usually have a selection of four to six selections, but you can add other toppings if you like. \n\nI've been a few times, but one visit stands out. I ordered a pizza that was all veggies and I decided to add some pepperoni. They told me to come back in five to ten minutes and my pizza would be ready. I came back and there was a pizza on a plate. The lady working the counter told me they had realized they forgot to put my pepperoni on my pizza. Before I could ask if this was going to be an issue or how they were going to resolve it, she said we'll give you this pizza and we've got another one in oven being made that's got everything including your pepperoni for you to take with you. I was pleasantly surprised by how far they went to make it right!!! She could have probably slapped some cold pepperoni on my pizza and called it done. It wouldn't be as good and I probably wouldn't have known why. In the age of dying customer service, I figure that alone is worth a shout out.\n\nThere's one other thing that I feel is worth mentioning. To me it's more of a positive than a negative and I feel it's typical of a lot of brick oven pizzas I've had. If you insist on perfectly consistently cooked pizza brick oven pizza may not be for you. I understand that brick oven pizzas cook at such a high temperature that a minute can be the difference between a pizza that's perfectly cooked and one that's burnt. Personally I don't mind a little char and that adds some of what makes brick oven pizza, well, brick oven pizza. There's a little bit of a craft required to made good brick oven pizza and I thought they did a great job. \n\nIf you see them and you're in the mood for good, thin crust brick over pizza, then this is the place for you. I know I'll be back.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-27", "description": "I'm astonished by the high reviews here while there are FAR better pizza spots thru out the city.\n\nI decided to give this place a try since the ratings seem good. I got a 12'' pepperoni w/ garlic & mushrooms & green mix salad.\n\n12'' Pizza - overpriced ($19) and undersized, it barely filled me up, I don't eat a ton either I have a fairly normal appetite. Presentation wise half the crust was burnt and deeply blackened which meant I couldn't eat half the crust. Cheese was minimal, sauce was basic, toppings were sparse, and the dough itself was quite chewy and soggy. There was nothing special about this pie, no special pizzazz in any way. I really question these reviews & wonder is yelp allowing business owners to bury bad reviews? And what mindset are these people in to consider this pizza place above average? Maybe it's considered good by all the gluten free eaters out here. If you want good pizza and are not worrying about being health conscious, there are so many places in the city that are WAY better (Tonys, Carmel Pizza Company, Delfina, Golden Boy, etc.). Hell, even Dominos & Pizza Hut have more enjoyable pizza than this place does. Never again.\n\nSalad - $4.99 for a bunch of spring leaves with a little olive oil. Overpriced and the worst salad I could have. There isn't even an option for ceasar or house salad here.", "author": "Pratul L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-04", "description": "I literally just ordered this pizza today. man it was a huge disappointment. I mean I was expecting quality dough, sauce, cheese, and toppings but this was the exact opposite. \n\n1.) first it arrived cold on delivery. \n2.) the dough tasted like pita bread not to insult pita bread (I'm arab I love pita bread)\n3.) drenched in olive oil and cheese didn't look like it was heated up properly.\n\nI was referred by a friend and was told this is really high quality but I am very disappointed by the pizza here. I don't know if it was because of delivery but I did not enjoy this pizza.", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-22", "description": "The owner contacted me and offered a refund for the burnt pizza.\n\nGreat customer service, which is rare and appreciated.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "My work had a big student meet-up at SOMA StrEat Food Park and enjoyed the solid pizzas from Firetrail. I don't usually even like olives but thought these were fine.\n\n* Pesto with roasted red peppers, black olives and goat cheese ($12) - 4 stars\npic: http://www.yelp.com/biz_photos/firetrail-pizza-san-francisco?select=G7NkeWqXGgILWPepHCaYKg#G7NkeWqXGgILWPepHCaYKg\nThe crust was great - thin crust, lightly crisped. I wished the pest just had a little more kick to the flavor, and I don't remember tasting the goat cheese much. But the olives were good (I usually pick olives out but these were very soft and not too briny-tasting) and I was surprised at the restaurant-level quality of this pizza!\n\nWe also got a marinara, which I didn't try but people enjoyed.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-06", "description": "Ordered a 14\" pepperoni with added mushroom and sausage today. Upon delivery the box seemed pretty light for a pizza that size and when I opened it I saw why. The pizza was woefully thin and floppy, which was explained by the rubber-like consistency of the dough. It was more like a store-bought flatbread than a handmade pizza from the likes of Delfina or others. While the pepperoni and sausage were nice, the tomato sauce was too acidic.\n\nI paid $27 for this experience and it is definitely overpriced. I mean, $3 to add mushrooms? Come on. Will be taking my business elsewhere in the future and would advise you to do the same.", "author": "Andrei Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "Poor hygiene practices. The person working as cashier, handling cash and credit cards, is also the person that cuts the pizzas and sprinkles certain ingredients after taking them out of the oven. \n\nToday at SOMA Streat Food, she went straight from taking my cash to sprinkling greens on someone else pizza and cutting it. She did not wash her hands, put on gloves, or even use hand sanitizer. This is extremely unhygienic and frankly disgusting. First and last time.", "author": "JC C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Unlike some other recent Firetrail delivery orders detailed below, I just got an EXCELLENT pepperoni large pizza from Firetrail Pizza via Caviar delivery service, so I figured I should say kudos to them this time!\n\nI ordered it at 6:00 here in Duboce Triangle area (10 minutes' drive from them) and it was delivered hot and really delicious at 6:52 PM. Yes, the crust is thin, but tasty and in my opinion, let the awesome pepperoni shine. A few charred dough bubbles added to the fired taste. Bottom of crust was not burnt. \n\nReally one of the best pizzas I have ever had! Happy thumbs-up!", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "I got the large Pizza with no extras. it was good, however, at $32+ it's not really worth it. At this price, i'll skip delivery next time and go to another san francisco restaurant for a better meal that is more reasonably priced.", "author": "Bill W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Not too many places in the Marin serve up Neapolitan Pizzas. That being said, Firetrail does not serve up Neapolitan pizzas, but it's definitely Naples inspired and they do a pretty darn good job at it. With their trailer wood fired oven, the crust always comes out puffy, slightly crispy, and with a nice char to it. \n\nThough they may not be as airy as a Napolitana, they are way better and lighter than any of the Amicis, Extremes, Red-Boys, or the awkwardly named 'Orgasmica' brand of pizzas nearby.\n\nI have had the Margherita, the Sausage, the Pancetta/Pepperoni, and the occasional 'farmers'  finished with a scrambled egg on top. And they are all really good. If I had to leave one out, I'd skip the pancetta/pepperoni as the cured meats are too strong and salty for such a light pizza.\n\nI prefer the meat topped pizzas with the optional salad greens on top --- somehow hot cured meats with tossed greens wilted on it always calls out to me. The salsiccia with the caramelized onions was spot on --- the umami of the cured meat and the sauce played a perfect tune with the subtle sweetness of the caramelized onions.\n\nAll in all, they are a little on the expensive side; my 12-inch salsiccia personal pizza with optional greens clocking in at $15 including tax.", "author": "Umesh T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-24", "description": "Arrived fast. However, we ordered pepperoni pizza with extra mushrooms and pizza was a bit burned, greasy and not particularly good. It was ok, but not more than that. Doubt we will order it again.", "author": "Maja P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-05", "description": "The pizza at Firetrail is just alright. I like the doughy crust and cheese that they use, but the whole thing is extremely thin (even for a Neapolitan pizza) and is fairly greasy. Plus, with pies starting at $10 before tax, it's kind of pricey too.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-27", "description": "Did you know you can order a 1\" metallic pin--sharp enough to damage your esophagus--at Firetrail? Check out the picture I posted here.\n\nKinda bummed I had to find this while chewing my Margherita pizza, but I guess we all make mistakes sometimes. I hope this is just a one time occurrence. \n\nAnyway, the pizza itself was 'pretty good.' I'm a New Yorker, so I'm a little biased with all of the great options over there, but I do realize we're in SF and not in New York. So, Firetrail has a pretty decent option if you're looking to satisfy your pizza fix.", "author": "Tik P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "The pizza is good.  You're not going to brag about it to a magazine, but it's better than the other options in the area.\n\nThe pizza is expensive and small.\n\nThis is a very thin crust pizza.  I like that a lot, but it's thin enough that if you don't know how to eat it, you might lose your toppings and think it's soggy.  (It's not.  It's just that thin.  Stack two slices then New York fold.  You'll be fine.)\n\nThis is actually a food truck in that little pavilion.  You're better off going in person, if it's near enough.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Loved it! Great thin crust margarita (full disclosure: I added sausage :). And almost as important, my wife got her gluten free pizza! Definitely one of the best GF crusts in town. \n\nThis was our first Amazon Prime Now Restaurants order and it did not disappoint. Very easy and quick and pizzas were still warm. I notice that some were disappointed by the size they received but there was no doubt which size we ordered from the Amazon site (10\"). In fact, it was perfect to get one personal pizza and each (so yours truly could get full gluten). \n\nWe'll definitely come back for more!\n\n#glutenfree #gf", "author": "Eirik O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "After posting that last review, Jed, the owner, contacted me and apologized for the unacceptable pizza. He explained that he was swamped with a catering order and offered to replace the burnt and skimpy pizza, and the salad, ON THE SAME DAY! We were very excited to try the new pizza and salad which turned out to be 5 times better. We could actually taste the garlic, which added that much more flavor to it. The crust was also a lot better, with an actual bite to it. To fix the salad they added tomatoes, red bell peppers, onions, and provided the dressing. I appreciate Jed reaching out to make things right, after being unsatisfied. I give this place 4/5 for the customer service and for the yummy pizza, as many restaurants don't try to reach out of take suggestions to make things better. :)", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "SOO GOOOD! not expecting this good quality pizza from a food truck. the crust is amazing. they just close too early", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Service was wonderful. Was disappointed in the first pizza, but they send another one on the same day! It was just great! Give it a try!", "author": "Lulu W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "These guys make great pizza, better than most of the big chains, and surprisingly good coming from a food truck! My favorite pizza: Margherita Pizza!!", "author": "Maki J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-31", "description": "Do not order from this place! We ordered via Uber eats and they never delivered. Waited over 3 hours and the order finally was canceled after contacting UberEats. Apparently they accepted the order and forgot about it and nerver fulfilled it. Avoid this place.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "Pizza is not bad. Blistered crust, quality mozzarella and nice tangy sauce. Mine happened to be charred more than I'd like mine to be that day. This was my second visit to Firetrail and besides the extra char this time, my pizza was consistent with my first visit. \n\nBut I want to note their \"service\" is terrible. We came by to order and we might as well ordered with a robot. No greeting, no smile. The only time I heard her voice was when she told me the price being charged to my card. Somehow, I still gave a 15% tip for the same exchange that I could have had with a vending machine but that's on me. No, I don't expect small talk about current events or the weather but welcoming a paying customer with a greeting is customary, no? \n\nI found a table near the truck while I waited so she can see me. Every few minutes i'd look her way and see her fiddling on her phone and after 10 minutes of waiting goes by I start to wonder if my order was ready. Perhaps I was supposed to stand there staring at her the entire time? Mind you, no other patrons ordered after me so my order was the only one they were preparing. I thought she would motion for me or yell that my order was ready since she never told me when to check back in for the finished pizza or any mention of what to expect. The last time I ordered from them they walked my pizza over to me (which I realize is an exception and not what they normally do) because they had to remake my pizza. So I go up and see my pizza was just sitting at the pick up window and it looks as though it had slightly cooled off. Again, no words when I went back to pick it up. I realize I should have asked when i should come back but I don't think it's too far fetched to be told what to expect upon ordering. \n\nSo anyway she wordlessly handed me the plate, no \"thank you\" from her (I still managed to say \"thanks\") and then she resumed fiddling away on her phone. I don't believe she is an owner, perhaps hired help because it was very clear to me she did not care how customers perceive Firetrail. Firetrail, you should be more selective on who you hire.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-21", "description": "Firetrail Pizza offers wood fired pizza from a van\n\neats: margherita pizza(10, 6\")\n-very thin crispy pizza\n-not a lot of toppings, flavors minimalist.\n-ready in 5 minutes\nwouldn't repeat.\n\nlocale: sf soma park(11/21)", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "Caught them today at SoMa Streat Food Park.  They had a selection of 5 pies: Cheese, Pepperoni, Susage, Margherita and  Pesto. I chose the pesto pizza which came with mushrooms, onions and a variety of peppers. \n\nThe crust was good; a nice mix of crusty and chewy. The vegetables were tender without being  overcooked. Good pizza for a decent price.", "author": "Sherman B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "I'm updating my review because of Firetrail's excellent customer service. Within minutes of me posting about the two unfortunately inedible burned pizzas, the owner Jed personally called to apologize and politely ask if they could get me a replacement. A free replacement pizza for another time sounded good, and I promised to call them on it the next time I had pizza on the mind. Today I did just that, and the replacement pizzas were very tasty. Bummer about missing the mark during the Friday night rush the other time, but they were really nice about it so I'm giving these pizzas the full 4/5 I think they deserve. Would order again.", "author": "Wesley W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-04", "description": "Good pizza but not the best (mobile pizza).  I tried the margarita recently at the StreatFood Park, and while it was generally, good, and I may indeed eat another in the future, it was simply not the best execution I've seen from a mobile pizza vendor.  The crust taste and texture left a bit to be desired, and the flavor was just good but not great.  That being said, I respect the craft and would try them again. The price was a bit less than their mobile pizza competitors as well.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Some of the best pizza in California. Delicious affordable and speedy. Please come to LA!!! We need more fire trail.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "4.5 Stars! \n\nAfter a small issue with delivery, and Jed (the owner) calling me to sort it out himself, I found a great little new spot to get my pizza fix from. NY style wood fired pizza's (which is amazing to see - We need more of these!) on a thin crust, and a tangy sauce. You cant go by this hidden gem. Thanks again Jed for you focus and commitment to customer service.  I will be recommending Firetrail to all my friends.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "This pizza is tasty, fresh and wood fired. Thin crust with top quality ingredients. Eat this pizza fresh from the truck rather than get delivery", "author": "Piper W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-13", "description": "Really great service! Hugely appreciative of how thoughtful and receptive to feedback the owner is. Hoping that they get some of the issues fixed, but it looks like they care a lot about customers, which is promising.", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Just had the sausage pizza at the Firetrail Truck at the SOMA StrEat Food Park in SF.\n\nMy pizza had an excellent thin crust, with well seasoned red sauce, cheese and fresh sausage. Great tasting and just the right size for one. I was lucky to get to the window during a lull, and sure enough, it was ready out of the oven in 5 minutes. By the time I got to the table, it has cooled just enough and was ready to eat.\n\nThe crust is perfect for NYC-style eating, slightly folded, and everything stayed together just right. \n\nI definitely recommend Firetrail, and look forward to having some of their other offerings!", "author": "Steven A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "We ordered delivery of a pizza and some sides. The order was on time. The delivery guy called and the food was hot. The pizza, however, was a bit soggy. The salad was lacking cheese and toppings.", "author": "UrbanStar .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "For a food truck, this is pretty awesome tasty pizza! I've managed to go here twice within the past month and ordered the margarita pizza both times. They have a few other options, including veg*an pies, but margarita is definitely my favourite.\n\nIt takes about 5 minutes for their wood fire to cook up your food and you get a piping hot medium sized pizza with cheese and sauce oozing all over and bits of blackened crust for added flavour. \n\nMy only minor complaint is the food tend to be a bit greasier than I'm used to in pizza. A slight dab of the napkin clears up most of it though!", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "I ordered a pizza here since Me So Hungry was taking forever and a day.  I'm actually super picky about my pizzas ever since I had del popolo, but this place is pretty good.  They're super fast and you get a pipping hot pizza in 5 minutes.  The crust is slightly crispy and you can taste all the ingredients that they use.  Sure I still love Del Popolo more, but for the ease and convenience Firetrail is pretty good.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "The owner of Firetrail, Jed, is a cool guy. We had a problem with a delivery order where the delivery driver left the pizza on a bench outside the hospital where my wife was in labor while my family was in the waiting room. As it turns out, this particular driver was an Uber Rush driver and he just wasn't careful. When Jed found out about the issue he immediately called me to resolve the issue. When it's all said and done, I can definitely recommend Firetrail.", "author": "Lance J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "The pizza is amazing.  Really some of the best pizza I have ever had.  Pretty much everyone agreed that this was some top notch stuff. \n\nHowever, due to the very thin crust and the quantity of toppings even the largest pizza at Firetrail is only enough for one person, maybe two if they are not very hungry.  \nAt around $25 per pizza this is a bit steep, but still definitely worth it.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "a great pizza place. this is in the food trucks place. nice wood burned pizza.\n\neven with less toppings the taste is really good. i wish the price was a little less given the size of pizza and toppings. difficult to spend more than $13 per person for lunch and given that any customization adds a lot of extra money.", "author": "Kumar G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Pretty comparable to the other mobile fired pizza oven outfit, Del Popolo. I think I like del Popolo a tad bit better. This one is slightly larger in diameter though. But this was still a very good pizza. Nice delicate crust. Good cheese. Slightly heavy on the tomato sauce but not over the top. I've had much worse pizza in sf for the same price if not more.", "author": "Augusto M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "This truck took me by surprise! I had some catered pizza by them once and it was just okay... but when I had it freshly baked from their truck, the crust was perfectly crispy and everything tasted delicious! They actually have a wood-fired oven in their truck (you can see the piles of wood next to the truck), and it adds a perfect smokiness to their crust. The pizza game in SF is so competitive, but these guys are doing it right!", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-24", "description": "Note: I ordered delivery from this place. I ordered from this place expecting larger pizzas that could be shared in a group. However, I was sorely disappointed to discover I had ordered 3 individual-sized pizzas and that I would need to order more to feed my friends.\n\nThe pizza ended up being very good but they were definitely on the small side...we ordered Sausage pizza, Margherita pizza and BBQ Chicken pizza.\n\nI'm giving this place 3 stars because the pizzas were that small. With pizza, I can be a little picky since pizza always tastes good.", "author": "Lillian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "We had Firetrail Pizza cater our wedding at Wellington's Wine Bar, and they did a terrific job!  They worked with us to pick pizzas we all liked, and even made a custom pizza based just on a description of a pizza we liked at a bar in SF, which we found very accommodating and helpful.  Firetrail even coordinated the place setting rental for the wedding reception, and helped cut and serve ice cream and the cake we brought in!  Jed, Krissy and the Firetrail staff worked very hard to make sure everyone was well fed, and brought everything out at exactly the times we'd asked for.\n\nOf course, most importantly, the pizza and appetizers were DELICIOUS!  No picture can capture how good this thin crust pizza right out of the oven is.  And I highly suggest the bacon wrapped shrimp, which had our guests literally sending emails the next week to say how much they enjoyed it.\n\nDefinitely try their food truck at SOMA Streat Park, and use them for great pizza at your next event!", "author": "Scott W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "Don't try ordering this online via eat24. I tried this and the pizza was never made. Wtf.", "author": "Dan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-23", "description": "Ordered out pepperoni and cheese gluten-free pizza. The pizza wasn't particularly warm when it arrived, and one of the pizzas looked like a third of it was gone. (We found that third though.. it was folded under the rest of the pizza). It was also pretty burnt on the bottom. \n\nFinal thoughts? Don't waste your calories.", "author": "Tamara B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-28", "description": "The pizza is always completely burned and tastes like coal.", "author": "Kilian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "I owe my sanity to Firetrail Pizza. \n\nAfter the caterer for our rehearsal dinner canceled on us 10 days before our wedding, our rehearsal dinner venue (Wellington's Wine Bar) put us in touch with Kari who was so ridiculously accommodating and easy to work with, well... it was ridiculous. \n\nIn just those 10 short days she put together an entirely vegan menu for us, including different types of pizzas, salads, and cupcakes (all vegan!) and even accommodated our gluten-free guests with special pizzas and cupcakes. AND she and her staff were so easy to work with. They put on a beautiful presentation, and even stood out in the rain to cook our food for our guests. People raved about the food and the service. It was so classy yet easy and comfortable. I just loved it so much. \n\nMy husband hired them to cater a work party at his company a few months later, because we loved them so much, and that went flawlessly as well. Of course. \n\nThank you to Kari and her amazing team for saving us!", "author": "Kalista B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Was it the best pizza I've had EVER? No BUT it was pretty close. We were leaving Costco and headed for home when our friends noticed that the SoMA Streatfood Park was open. So we decided to stop in. There weren't a ton of options and pizza seemed like a good choice. Plus, how could we not try it when you can clearly see the wood fired oven on the back of the truck. A couple of reviews mentioned the price which didn't bother me because it's San Francisco, the city of overpriced everything. Plus it was better than some of the $15 plus meals that I've had in the Bay area. We got the classic pepperoni and I thought it was the perfect mix of crust, pepperoni, sauce and cheese. The pizza wasn't greasy which is typically a problem I have with pizza in general. \n\nBTW, the best pizza I've ever had was in NC and it was $14 for a margherita pizza...so yeah.", "author": "Julie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "This is a review for catering by Jed and company at Firetrail Pizza.\n\nMost importantly: the pizza is ridiculously good. It's made fresh in their portable brick oven and prepared with great care. They get this fantastic char on their delicious yeasty crust, and their cheeses and sauces provide bright and bold flavors to complement that memorable base. \n\nWe took a chance on catering with them, because we hadn't tried their pizza before, but people seemed to really like it on Yelp! We hired them for a picnic that took place on the day before our wedding. They arrived up at Tilden Park on time, they set up, and they served up fantastic food. And we didn't have to do anything except save them a couple parking spots so they would have room to set up. I kept asking if they needed anything and they said no! They didn't even interrupt our festivities when they packed up to go.\n\nThey leave you leftovers in boxes--which, of course, went by the end of the picnic, because they were so damn good--and they provide napkins and plates and a pepper shaker and all that.\n\nThese people are seriously good at pizza. Hire them to cater for you! You won't regret it.", "author": "Antonia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-05", "description": "Tried this out today at the SoMa StrEat Food Park and I'm definitely a fan!  Great crust; chewy and soft, with just a little bit of burnt bits -- perfect.  My husband and I shared the pepperoni and one with pesto, sun-dried tomatoes, and artichoke hearts.  We also added the greens to the pesto one, and those were great.  I really have no complaints; it was exactly what I wanted out of a food truck park pizza!  I can imagine this setup would be super awesome for catering a party!\n\nHopefully these guys will be making appearances at the SoMa park frequently!", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-09", "description": "Why bother offering a \"gluten free\" pizza if you prepare the crust with wheat flour? Does not make any sense. Also this is basically a cross contamination nightmare with flour everywhere, not very clean.", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "Pure poetry. Where do I begin? The lush, flawlessly dressed and seasoned salad leaves served atop the pizza? The crisp and delicate yet satisfying crust? Or perhaps the exquisite toppings, a symphony of perfectly juxtaposed flavors and textures? \n\nExcellent wood-fired pizza, made by wonderful and intelligent people. I couldn't recommend Firetrail Pizza more highly. Perfect for a quick and satisfying lunch!", "author": "Scott R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-19", "description": "Granted, a mobile wood-fired pizza oven is commendable. But the pizza itself really lacks in any flavor. The sauce is bland, and the cheese has hardly any flavor.\n\nOverall, I've had better pizzas for $10.", "author": "Caroline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "so chewy and fresh!!!! perfect size !!!! \nJUST GO N TRY IT !!!", "author": "W211 E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-05", "description": "Gave them a try yesterday at SOMA Streatfoodpark and was a bit underwhelmed. \nWaiting time was fine, they seem to be nice people.\nPizza was okay, but nothing special: no crust, a bit too wobbly. Tomato sauce, fresh basil and the cheese are good. Liked the burnt bits and the scent of burnt wood.\n\nOkay pizza afterall, but a bit too pricey.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "When my company scheduled a fancy pizza party for all employees, I figured we were going to get Round Table...because that's fancy. Little did I know that they were about to take it to a whole different level - oven-baked pizza on-site. They served us petite slices of thin-crust pizza with flavors ranging from sausage pepperoncinis to margherita to basil pesto. The small slices kept our appetites going and the cooks were great with expediting pizzas before we ran out. Also, if you look at their website, they have many more flavors of pizza, including a chocolate dessert pizza! I was very happy with the overall experience and would recommend Firetrail Pizza to anyone who is looking to throw an out-of-the-ordinary pizza party!", "author": "Priscilla V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "We met some friends here for \"brunch\" with a pitcher of sangria on the side. It was really fun. While the pizza tasted fine (nothing extraordinary), it was a little too greasy for my taste and I had to keep dabbing it with napkins because it was sort of grossing me out. I don't think I would come back and eat this again, maybe I'll try something from a different food truck.", "author": "Ana N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "Very good artisan pizza, thin and crispy! A little bit on the pricey end for the size, but definetly worth given the quality of Ingredients!", "author": "Luca E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Stopped by the farmer's market in Larkspur on Saturday and was planning to go to Belcampo but decided on Firetrail Pizza.  Got the Margherita with mixed greens on top.  Very well made pizza and the greens was perfect to add.  Staff was nice and super quick.  Crust was good.  Definitely would get it again and $11 was great for a personal pie.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-17", "description": "I don't understand \"artisan/gourmet\" pizza as I was still hungry after three slices and was disappointed with my online delivery experience with Firetrail Pizza in San Francisco. I can make better pizza myself and not burn the crust for $26.00. Not recommended pizza to order for a hungry band before concert though their sauce was the only good part of their product (ordered a pepperoni and margarita). Also, they only have one size, 10\"-11\" ... No Large!?", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-29", "description": "The pizza was ok because it arrived room temperature. If it arrived at least warm rating would, of course, be better. Maybe take out is better option.", "author": "mike t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-15", "description": "Mobile innovation.\n\nWe don't need another app that tells you when people who are friends of friends of friends and share twelve of your Facebook likes are nearby.\n\nWe do need more trailers with wood-fired pizza ovens hitched to the back.\n\nEven though the good but not great BBQ chicken pizza wasn't life changing ($13 for a 10\" pie was a bit steep), huge fan of the culinary innovation.\n\nOther yelps suggest these guys are even better as caterers.\n\nThree stars for the eats, five stars for the application.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "I don't know if this is some weird \"taste buds changing as I get old\" thang, but all of my favorite pizzas of late have been pies sold from the back of a truck. No,don't start picturing some 3-toothed Cletus in dirty overalls picking up a 12\" margherita that was cooked directly on the flatbed of his Ram pickup with a shovel and scooping it directly into my gullet. I'm talking about the crop of pizza trucks ala Casey's and this one, Firetrail Pizza, over at Soma Streat Food. I had them twice in the past couple of weeks now. While Casey's still makes my favorite pizza of the moment (their Margherita), Firetrail, while not as consistent with nailing the crust each time, makes a Margherita that is very comparable. Also, the dude behind the counter deserves props because he was wearing a Cramps \"Can Your Pussy Do the Dog?\" t-shirt. RIP, Lux Interior. :( I'm getting off topic and rambling...let's cut to the haiku close.\n\nMARGHERITA PIE\nSECOND ONLY TO CASEY'S\nAND THEY DIG THE CRAMPS", "author": "Bill J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "If I could give Firetrail Pizza 10 stars I would!  Kari, Jed, and their team are fantastic in every which way.  Having them cater our wedding was one of the best decisions we made about our Big Day (other than getting married, of course ;) )\nMy (now) husband and I met with Kari at her cute office in San Rafael.  We talked logisitics, menus, preferences, etc.  Not only was she super informative and creative, but she brought up tons of details that we never would have thought of!  She was so welcoming and full of positive energy- it was like chatting with somebody we've known forever!\nThroughout the weeks of planning, Kari was in communication with us.  She was great about returning phone calls and e-mails and giving us her attnetion.  Prior to the wedding, we figured out all the supplies and menu items she would provide.  We decided to give the pizzas on the menu unique names for the wedding...Baby Light My Fire, I Do! Pesto, A Perfect Pair, etc.  Of course it was cheesy and lovey dovey, but hey!  It's the one day we can get away with it!\nThe wedding weekend arrived and Kari and her team rolled up to the wedding site a few hours before the ceremony, as planned.  They set up their trailer by getting the fire blazing, put out tables with custom menus, flowers, and plates, and raised their tent to shield guests from the sun (yes!  after long periods of rain this spring, we had a sunny day!).\nShe brought several employees with her to act as bartender and servers for the day.  They all worked cohesively as a team and knew exactly how to manage food prep, service, and clean-up.  They were AWESOME!\nOn to the pizza iteself...we had available to us their entire menu with a few minor adjustments.  Guests would walk up, order, watch their pizza get prepped and cooked in front of them, and munch away to their heart's content...then repeat the process!  Seriously, some people ate three pizzas all to themselves.  My favorite was the Pear and Prosciutto- the sweetness of the pear combined with the saltiness of the meat...MMMmmmm!  Everybody raved about the light, flaky, perfect crust and the variety in fresh, delicious toppings.  When everybody was full and thought they couldn't eat anymore, Kari and her crew made dessert pizzas to deliver to guests!  Pizza crust with toppings like marshmallows, chocolate sauce, and strawberries.  Outrageous, amazing combinations that made everybody smile :D\nI heart everything about and everyone involved with Firetrail Pizza and wold recommend them for weddings, birthday parties, company gatherings- anything that requires scrumptious food with superb service!", "author": "Maki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "Delicious. It's so hard to find a good NY style pizza in SF. This is close enough for me to be satisfied. Chewy dough with crisp outer crust slightly chard from the fire.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-21", "description": "I would've given a 3 stars, but it says \"A-OK\".   2 stars is \"Meh. I've experience better\".   Sorry, had it at the Diablo trails run and was very unimpressed.   Lots of reviews on the crust, but my slice didn't have much of a crust.   The whole slice was soft and mooshy...all the way to the crust.   The taste was okay...2 small pepperoni's on the slice...\n\nSorry...served a subpar slice of pizza and it gets a 2 star.", "author": "Mickey K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-19", "description": "Wanted to like, but the entire pizza from crust to toppings was really not good Not nearly as delicious as the Del Popalo pizza truck or Goat Hill pizza.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-25", "description": "'We ran out of pizza dough', should never come out of the mouth of someone working at a store dedicated to selling pizza. Poor planning. I would love to leave a review of their pizza but alas they couldn't get their shit together enough to make that happen. Sadly. Piss poor management.", "author": "joseph e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-05", "description": "Kari and the gang really know how to make pizza. The topping choices are amazing, the pizza's come out of the mobile oven so fast and the za is super yummy!\n\nCan't wait to get my next one....", "author": "Mark C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-22", "description": "I literally felt like I got robbed after I are this pizza. I got a sausage pizza and asked for onions on it. Total came to 15 something. I couldn't even distinguish the sausage \"sand\" on the pizza. There was about 1 oz of cheese on the entire pizza and it was dry. Wow a 15 dollar cracker! Thanks but no thanks! I can't believe that this is a usual portion size and that everybody else is satisfied with that. If so, I really need to start operating a food truck!", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "Love their pizza and they really know how to treat and appreciate their customers. Been going here for over a year and really enjoy the Margherita pizza (I dream of it at night:-). Recently, I had a small mistake on one of my orders and the owner Jed personally called me to take care of it. What else can someone ask for? So many place these days do not appreciate their customers or underestimate the power of word of mouth. If you want the best wood fire pizza in SF from business owners that care look no further! Thank you Firetrail Pizza and thank you Jed! Best truck at SoMa park:-)", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-27", "description": "We were invited to a private event that included Paul Hobbs' wine and Firetrail Pizza. An interesting combination that proved to be a very memorable day. The pizza was amazing - the salmon on the first one was fresh caught by one of the partners just the day before and it melted in your mouth and made that pizza into an unforgettable treat. My other favorite was a carmelized onion pizza that was so simple, but the flavors were so wonderful together. And all the pizzas really worked well with the wine we were drinking. Outside on a deck in the wine country, does it get any better?\n\nKari & her team were great, personable, full of interesting tidbits about the food and preparation and also a lot of fun.\n\nI would definitely have Firetrail cater an event. The variety of pizzas they do can fit any style event and they are very professional as well as having an amazing product.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-18", "description": "Their pepperoni pizza  was way better than del popolo. Especially because it was burned and blackened.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-26", "description": "We were so excited to discover that you would be at the Streat Food Park from 5-9pm.  We found out your operation hours from your website.  Made plans to meet there to try you out after work before suffering through the Bay Bridge traffic.  We were there at 5:15. You set out the menu board and left your drink cooler in front of your trailer. We waited and waited for you to open.  But you never came back.  We couldn't wait any longer.  We were starved and couldn't wait any longer.  We went to Chairman and Melt instead.  Perhaps you could have put a sign on the menu board or on the trailer, letting customers know when you would return to open.  Can't say we weren't bummed.", "author": "Kai N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "My wife and I recently hired Firetrail Pizza to host our wedding rehearsal dinner and they did an outstanding job helping to put on a memorable night for us!!  \n\nWe wanted something simple yet elegant for our family and guests.  Kari jumped right in and started helping to design a menu, she offered to organize the linens and plates and suggested creating a Tuscan theme night.  She met with the church organizer where the dinner was planned and drove over on her own time to scope out the site.  In the end, she created a beautiful setting with candles, flowers and tuscan style table clothes and dinnerware.  The church reception hall was turned into an intimate Italian restaurant.\n\nAnd then there was the pizza.  The pizza was amazing!  Our guests couldn't get enough!!  They were made with fresh ingredients and she offered a variety of unique flavors.  She also had fresh salads and homemade cupcakes.  \n\nBut what made the experience really memorable with Kari's personal touch.  She was easy to work with, she devoted her time to making my party her priority and she wanted to know things about us and our families to help tailor the experience to us.  I would recommend Kari and Firetrail to anyone looking for incredible food and a fun experience!", "author": "Adrian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "I really loved this place! I enjoyed this pizza at the SOMA StrEAT food trucks. I was a little nervous to try it because the other pizza truck there was a huge disappointment when I tried it a couple months back. However, we were intrigued and decided to give it a try. We ordered the margarita with the fresh greens on top. Th crust was nice and chewy and the sauce was so so good. We loved it so much that we decided to go back and order another. We ordered the sausage. I didn't try it since I am a vegetarian, but my sister-in-law and daughter loved it! I am not sure why so many other people choose that other pizza truck, it is total crap compared to this delicious pizza. The only reason I gave 4 stars instead of 5 is because I personally like a crispy, crunchy crust. However, if you like your crust chewy you will give this 5 stars. Try it you won't be disappointed.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-17", "description": "FINALLY A HEALTHY PIZZA EVEN I CAN EAT. \nImagine My Surprise when I had a gluten-free pizza crust with goat cheese, pesto, artichoke hearts & asparagus. All this cooked in a mobile wood-fired oven! Kari's organization as a chef and macro/micro manager stands out as the party rolls happily along. Thank you.\nKathryn McMudie", "author": "Kathryn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "Not just the best food truck pizza you'll ever have, maybe the best pizza anywhere. Wow. Run, don't walk.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-06", "description": "Awesome pizza!  The crust was amazing.  Flavorful, slight chew, so good.  Kari and her team were fantastic.  Friendly and fun and integrate well with any crowd.  The pizza toppings were delicious; the whole experience was excellent. \n\nA mobile wood fire oven....great idea for a private party.", "author": "Yoko K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "Firetrail catered our company party. The best wood-fired pizza I have ever had.  It is so cool being able to stand at the back of a truck and watch them cook your pizza to order. Highly recommend them for your next party. I have them 4 stars because of the price.  But then again it is SanFran.", "author": "Bud F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "Went out to the park on Nov 18th 2013 and had great wood fire pizzas and I have to say what a wonderfulfavor you get when its heated by fire. I have to say that if your there go to Firetrail Pizza 1st, cuz they're great!!", "author": "DaWhite P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-25", "description": "Three months after my first experience with Firetrail Pizza, I was able to enjoy their delicious pizzas at Old Mill Park in Mill Valley, where they catered the finish line food for the Quad Dipsea race and over 250 runners and spectators lined up to sample their wares. Not only is their food wonderful, but they have the ability to work in a variety of venues and group sizes. A very impressive team!", "author": "Stan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "What a delicious and amazing experience!  The treat of having such great, gormet pizza made on the spot with organic ingredients and pleasantly presented is truly inspiring. Kari and her staff did a great job at a recent party that I attended.\n\nFrom vegetarian and meat-eaters to the delicious dessert pizzas, Firetrail is a must-have for any gathering. Thank you Firetrail!", "author": "Brad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "I come from NY, home of the great pizza, this is so delicious it reminds me of home but better. Great pizza and very nice people as well!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "We found this sweet place and its a lil interesting plaza of food trucks. Their pizza is surprisingly good! I recommend margherita. Simple but really well made. Would come back again.", "author": "Dom O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-16", "description": "I showed up to Wellington's recently on  Superbowl evening and Firetrail Pizza was outside cooking up their pizzas. I was delighted to know they had a gluten free option and it was super tasty~ Fast service and good options, nice people. I'll look for them again.", "author": "anna m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "Firetrail Pizza comes to our business park every week. It's a blessing and a curse...we just can't get enough!! We want to eat pizza for lunch every day. We love both their regular and gluten free crusts, and also the amazing greens on the pizza. Their menus are changing all the time, we can't wait to see what specials they have come up with every week. Both Kari and Jed are amazing people and we enjoy hanging out with them while our pizza cooks. We really do love Firetrail Pizza.", "author": "Todd W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "These are fantastic pizzas.  Unique in both flavor and preparation. They come to our place of work a couple of time a week and setup the kitchen right there in the parking lot. We look forward to this with great anticipation each week to see what new combinations are available. You will not be disappointed.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Great Pizza! I usually do not like pizza as it is all wheat & dough. Firetrail makes gluten free pizza :) even the regular pizza were really light & flavorful. I recommend them for any occasion. Excellent.", "author": "Linda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "WOW!! Have you ever had a fresh baked Artisan Pizza straight out of a mobile brick oven!! PLUS hanging out with some of the coolest people who make up FireTrail Pizza. This is an experience that one should not miss. This company is literally on FIRE. 5 Stars for TASTE, INGREDIENTS, PRESENTATION, and PERSONALITY. What a memorable night. Thank You!", "author": "Garrett B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-20", "description": "Just attended an event that Firetrail catered.  Wow!!  The pizza was phenomenal.  You could taste every ingredient as they were super fresh, from the carmelized onions, to the taragon leaves to the fresh rosemary.  Nice thin crust that was not over cooked too.  Kari and staff provided just the right combination of interaction and service.  I only wish they had a retail location around!", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "We had Firetrail Pizza at our school's fundraising event, and they were amazing.  I worked with Jed, who was responsive and professional.  Thanks to him and his wonderful staff  the event was a huge success.  Everyone raved about the delicious, hot pizza straight from the wood burning oven.  I would highly recommend Firetrail Pizza!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-13", "description": "The sausage kale pizza was delicious but the SALAD on top was AMAZING!!  Seriously, I don't know how they did it, it was only lettuce but it was seasoned so well that I could have eaten my weight in it.  So sad when it was all gobbled up.  Can't wait for them to come back to the office!", "author": "liz g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-10", "description": "We got delivery from this place. As has been mentioned before, it was quite unclear that the pizzas were individual size. Additionally, they arrived after more than an hour, were cold  and part of the crust was too charred to eat.", "author": "Jasper S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "Seriously \"Awesome\" pizza.  This was the sentiment of my pizza connoisseur sons after Firetrail blew them away.  The problem I see with this company is that they need a pizza parlor, and fast.  The usual, run of the mill, generic, cheese/pepperoni will not do anymore.  Thin tasty crust, creative combinations and, get this, dessert pizzas will be what they will require from this day forward.  No more cardboard for these little guys and I can't say that I blame them.  Awesome people running an awesome mobile, wood-fired pizza oven.  Now all I need is a reason to have a party but until then if you hire these guys please invite me and my boys...", "author": "Ralph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "Wow!! Every bit as good as their yelp reviews indicate!! This team is awesome! We used Firetrail Pizza for our Teacher Appreciation Luncheon and they made it special in every way. The food is so delicious. We had the greens and four different kinds of pizza. Everything was a crowd pleaser. They were super accommodating - even offering gluten free and vegan options. Very professional and super responsive. Kari has a great eye for detail and the set up is beautiful.  Very helpful in making sure we had everything we needed for a successful event. Such a pleasure to work with. Fabulous experience!!\n(Review by Jeanne, wife of Steve D.)", "author": "Steve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "I promote healthy products and pizza is the last thing I think of for a meal cuz  of what it normally  has, carbs (thick crust)  with oozing fat on the crust.  But Kari's pizza is unique,  Her  creativity included healthy ingredients and  each bite bursting with flavor!  That was a treat!  There was also very minimal grease.  I enjoyed most of the pieces I got a hold off.  Thanks to Kari and team.  Impressive operation!  Will definitely tell all my friends!", "author": "Madelene Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "I went to a private party catered by Firetrail Pizza last Friday evening. The Firetrail Pizza folks have a new wood-fired mobile \"pizza wagon.\"  The hand-built pizzas are constructed before your eyes and then popped into the oven, from which they emerge -- crispy, sizzling, bubbling and delectable -- about 90 seconds later. The pizzas were coming out of the oven in fast and furious fashion and being devoured within seconds. The operators--gorgeous Kari and athletic Jed--are lots of fun. While the pizza was supposed to be the food at the party, the Firetrails pizza oven became the centerpiece of the entire party. After people ate their fill, Kari and Jed served \"s'more pizzas\" -- melted chocolate-and-marshmallow atop crispy pizza crust. \n\nI'm planning to hire Firetrail Pizza for my next big bash.", "author": "George F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "The best pizza I have ever had the pleasure of eating, always something new and creative each time I visit, I am now spoiled for life.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "As good as it get's. Within minutes you have a delicious pizza. I cant imagine a better place for lunch. I don't usually like trailer-in-tow food, but I have never seen anything  like this. It's a little peace of organic heaven in San Rafael.", "author": "Dirty Harry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "I tried Firetrail Pizza for the first time yesterday.  I ordered their sausage pizza, and it was great.  They use high quality ingredients, the workers were friendly and professional, and I enjoyed my pizza.  I wouldn't hesitate to use their catering services for a party after my experience yesterday.  Thanks guys!", "author": "Nathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-06", "description": "Great stuff! And such a cool idea for a party -fresh pizza right off the mobile oven. And all those reviews about the desert pizza -  I did not think desert pizza would be a real substitute for desert. Thought it would be just pizza with pineapple or something. Was I wrong.  They were just absolutely delicious - you have to try it to know what everyone is talking about.", "author": "Madhur D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-06", "description": "I am a pizza snob. In my pizza world, the texture of crust is critical, the flavor of the sauce can make or break the whole experience, and the quality of cheese and toppings reveals the integrity of the chefs. My one visit (of many to come) to a roving Firetrail Pizza location was my most satisfying pizza indulgence since the last time I was in New York City. The crust! Perfect thickness and lightness! It was only in the wood-fired oven for a couple minutes, it seemed. How'd they do that? The sauce had a subtle sweetness to it which again reminded me of NYC pizza. I tried several tasty toppings... all organic, I'm pretty sure. The pizzas are fairly small for a guy my size so I did lots of sampling. And they aren't heavy and greasy like so many pies around here. As you can tell, I am a big fan. I hope they put up a website so I can track down their oven-on-wheels whenever I'm dying for great pizza.", "author": "geoff v."}
