{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-22", "description": "I wasn't impressed with this restaurant, if you've had a long night of drinking and just want to put something on your stomach and not really concerned with quality this is a good option. \n\nThey are open late and you can get your fill of pizza or some wings maybe, they do serve beer and you can take it to go which is key!\n\nThey are fast so that makes them a viable option when you don't want to wait long.", "author": "Tracey M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "This place was horrible. Do not eat here! Yesterday my family and I were in town and decided to go site seeing. After walking around forever, we decided to get food. When we stumbled upon this place, they were completely empty, which is always an indication the food is not good. By this point,  my parents were tired of walking and we felt like the children would enjoy pizza before anything else.\n\nWhile looking through the menu, we noticed the food was extremely high-priced. Honestly, with me being from TX, I thought maybe this was the norm for Cali and I would be a country bumpkin to complain about it. Nevertheless,  we ordered. I purchased the meatball sandwich which was about $12. The sauce was the worst sauce I've ever tasted and the meatballs were tough. It came with a bag of chips that consisted mostly of air and the only delicious part was the toasted bread it came on. I will admit though, it was large enough for 2 people, but all of my family passed on my offer to take the other part of the sandwich off my hands.\n\nMy daughters pizza was \"ok\". The sausage on it was horrible and left a bad aftertaste. The chicken wings my mom ordered were very salty and 1 wing came with a feather on it. I mean I know chickens have feathers, but how hard would it have been to pull the feather off, before presenting it to your customers?\n\nSo we finished what we could of the food. Our ticket came with everything on 1. We asked if they could separate it by person. We were told no and that they could have if we said something beforehand. So, what is the difference between doing that before or now? And our waitress went a step further, saying \"Can't you just have 1 person pay and everyone pay them back?\" Well clearly, we will have to. It's not as if you suggested something we aren't being forced to do anyway. My mom offered to bite the bullet, gave her card to pay about $161, which included \"gratitude\" as the waitress called it. AFTER they swiped my mom's card, they brought the receipt for her to sign, but this time we noticed there was another fee for about $5..which was a non-cash payment fee. Something I've never heard of...so you charge a fee for not using cash? Bonkers! My mom didn't argue b/c she just wanted out. As we're leaving, I noticed a lot more people were there and I'm assuming b/c they saw us, a large party, in there so this must be ok. Absolutely not! Worst place so far I've been to in San Fran.", "author": "C T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "Honestly don't even bother!!! Like they charged me for using my credit card, and they forcefully got the tips \nThe food, was literally like eating oil! \nSave your health and money and time", "author": "Nikkie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-13", "description": "Felt a late night craving for slice of pizza to take to the hotel. We walked by the slice place across the street & found it empty other than the Asian guy sweeping outside. So the Hubs thought it was too sketchy & opted for this place. There were a few people eating, a table of about 6 young college looking kids in the middle of the establishment who seemed to be enjoying the food. Walked up to the counter to order our small pizza. Was told it'd be about 15-20min. Ok, no prob. We sat down at an empty table and took in the view. And then we looked up Yelp. Uh-oh. 2 stars. Well, here's hoping. \n\nWhen I saw another pizza being brought to that table of youngsters, I felt more at ease. Surely it can't be THAT bad if they ordered more, right? That's when Hubs said, \"Or they might not care that much after drinking.\" Well, true dat. When our pizza finally came out, which was ~$20, we took one look at it & I knew....this is NOT gunna be good. As we walked out with our pizza in hand, we walked by the place across the street where a few people had since ordered & were eating their pizza. Naturally, I took a glance and said to Hubs, \"We should'a just went there.\"  The slices I saw looked waaaay more appetizing than the whole small pizza we were carrying back to our room. Dang it!\n\nWhen we got to the room & tried the pizza, sure enough, it wasn't good. It was barely ok. Toppings were minimal (we ordered pepperoni & Salami) & not evenly distributed among the slices, but worse, the crust was kinda doughy, especially in the middle. Hubs was all, \"I sometimes like it a little doughy.\" Yeah, but this was more than a little. \n\nI REALLY wanted Fisherman's Pizzeria to be good so I could redeem their name, but they just didn't even come close. Also, I think the doughy pizza might've even upset my tummy, cuz I was not ok the next morning. Boo!! Hopefully they'll get their act together. \n\nSo, if you're in the area & looking for some good pizza on the late night, go across the street.", "author": "Dionne T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "My Clam Chowders was stale and wasn't even warm. It had pretty much no clams. Looked like it was bought somewhere else and then re-heated. Too expensive for this quality of food and service. I could have had a better time having dinner at a homeless shelter.", "author": "Antonia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Just Amazing!\n\nI have no idea why this place has such a low rating.\n\nI got a pizza half pesto half red sauce. With mushrooms and olives. It was amazing, exactly the way I wanted it. With a nice thin crust and very cheesy.\n\nI also got a tiramisu which was very good. It tasted fresh and sweet. I highly recommend it!", "author": "Ajay V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "Came here on a Sunday afternoon and since it was Memorial Day weekend you would expect it to be busy! We found this joint just by luck as my husband and son were hungry after doing half the day roaming around the city! We also wanted something that was spacious because we had a stroller with us! And this restaurant by far had alot of space and was not as busy as expected!\n\nWe ordered our food and my son wanted fish and chips and for some odd reason the waitress said they ran out! Hmm thats odd! The place didnt look busy and it was only 2:00 pm! And youre telling me you already ran out of fish and chips! As for my husband and I we ordered the small Fog city pizza to share which had 6 pieces. It consisted of shrimp, clams, onions, garlic, bell pepper! It looked appetizing but once you bite into it, to me it lacked some flavor, im not sure what though! My husband on the other hand liked it! We also ordered clam chowder which was good but I wish it was warmer to taste! I like my soup hot and this by far was more cold than hot! \n\nAs for the price well when youre in a tourist area and the Bay area at that everything is by far expensive. All in all we paid about $65 for just those 3 items! I wouldn't t have mind paying that amount if I actually liked the food! Moral of the story, don't look for a restaurant when you're re super hungry cause you'll end up eating something you didnt want to really eat in the first place! Waste of calories! Ugh!", "author": "Charmaine D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "Damn I am so pissed that I thought this place was Carmel Pizza. I looked at my phone wrong and ended up at this disappointment of a pizza joint. The pizza is horrible here!! I am so mad at myself!! What a terrible place.", "author": "Javan E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-03", "description": "Clam chowder was definitely not fresh. Barely any clams at all. Seemed like it was bought from Safeway and re-heated. Sandwiches are just burgers with different meat. \n\nCan get same quality food at a fast food place for 12 dollars cheaper. Not sure the up charge - food is not fresh.", "author": "Cameron J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "Literally the worse service i ever had. DO NOT EAT HERE!! They charge you a 3% fee for using your card they dont tell you that towards the end untill you see it on the bill. Then  when i asked about the fee they tell me theres a sign by the register when we dont even go near it because we dine in. Then the food was awful, we got the Philadelphia cheesesteak and when we had it it comes with chip, but dont be fouled its literally THE TINNIEST BAG OF LAYS YOU EVER HAD. I thought it was house chips but nope not these. They're too lazy to chop up the steak and give you a chunk of thin cut steak, and dry. Big bread no real stuff in it. Then they had nerve to get some attitude when asked to refill their empty napkin tray. Worse place i ever eatin, again dont ever eat here.", "author": "Rigoberto M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "The first sign this place should have been avoided were the empty seats. There was literally no one in this place but my family being extremely exhausted decided to go in  anyway. Boy was that a MISTAKE! Let me just say I'm only giving this place one star cause they had sense to turn the tv to the NBA finals while we dine so there's that. The service wasn't bad till the check came. Got a 5 dollar charge on a credit card(never heard of that before). And the food was basic to bad. School Cafeteria quality! Avoid this place at all cost!!!", "author": "Adam T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-18", "description": "Good service, great location. Server was attentive and sweet. Good was just ok. Bland sauce on pizza. I hope they take this review and make their food/sauce more tasty", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "This place is a disaster. One look at the overpriced menu, the EMPTY seats during lunch and the dirty, dingy interior made it a no-brainer to keep walking.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "So i was super hungry and felt for pizza. I did not want to park and walk like two or three blocks to grab something to eat. So i found a parking right in front of this place. I saw the word pizza, i was like ohhh great.  I ordered a small cheese pizza and ohh my its one of those really cheesy pizza with a thin crust. Have you guys ever tasted margarita pizza from cpk? Its the same texture but wayyyy more yummy. I have never has a chance to go back. But as soon as i am back in aan francisco, iam definitely stipping by because its like 6am and iam sitting here writing this review, i so wana have that pizza right now.", "author": "Pritika M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-06", "description": "Good :service, quiet, and clean.\n\nBad: Food! I got a  side garlic bread it was $7.00.( I think its expensive and I'm from here. ) and it was awful!  Rubber cheese, stale bread and some kind of \"garlic\" substance .. it definitely was not real garlic.  \n\nSo many other great places around here.  Don't go here!", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-07", "description": "Review #232 - 2016\n\nMy nephew and I grew desperate after searching for a place to eat--so we ended up here on a Saturday night around midnight.\n\nWe walked in, the place was pretty much empty and that should've been a sign as to why we shouldn't have ordered from there, yet I wanted to give them the benefit of the doubt since it was late and I didn't want to keep driving around looking for food, especially since this was the third place that we stopped at.\n\nWe sat down and placed our order.  The lady taking our order was nice and pleasant, that's deserving of 2 stars.\n\nWe ordered the Mexican Special which consisted of: Pepperoni, Mushrooms, Bell Peppers, Onions and Jalapeños (minus the onions).\n\nA group of strange drunk Asian guys walked in with a white girl and started asking the waitress for a bag.  She was confused and told them that they only use boxes for the pizzas, yet these guys are still so persistent on getting a bag.  They even asked if they could buy a garbage bag from her, which she said that she couldn't sell one to them.  They walk out and sends the white girl back in alone to ask for a bag again!  No idea what that was about.\n\nOf course, I'm sitting in this empty place with my kids and I tell the lady that I changed my mind and asked to have my order to go.  I wasn't about to take a risk with a bunch of drunks coming back and forth to harass the poor lady & possibly cause a scene.  So, we paid and head back to our car and told her we'd be back to pick up our pizza in about 20 minutes.\n\nAt more than $30 for a medium, I expected a semi-decent pizza.  I wasn't asking for gourmet or even good, just good enough.  However, it was edible to say the least, just lacking in flavor of any sort.  I couldn't even tell that there was any marinara sauce in my pizza slice and I don't even care for marinara.\n\nI guess this place is able to stay in business because suckers like me end up hungry and desperate at the wrong place, at the wrong time...", "author": "Sivilay T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "Perfectly mediocre pizza. Think...roller rink pizza for that kid in your class who no one REALLY knows. Everything was clean, so theres that.", "author": "Teagan E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "The service was really, really bad and the pizza was absolutely disgusting. Don't go there!!!!", "author": "Daarel B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "unfortunately I took a chance and ordered a pizza from this place, despite the reviews. they don't sell pizza by the slice so I ordered a small thinking I could heat some up the next day.\n\nI ordered it to go and when I got to my hotel found that the center of the pizza was doughy...like it was uncooked.\n\nFor the price, the size of the pizza was very disappointing. \n\ni ate one slice and threw the rest away. Probably the first time I ever considered disputing the credit card charge or getting a refund, but since for the time it takes to get into san francisco and the price of parking it just wasnt worth it.\n\nabout $40 for pizza, calamari (only half of order was edible), and a soda....next time I'll listen to yelp.", "author": "Adrian G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "DO NOT EAT HERE!\n\nThe first red flag was after sitting our table was sticky. That is the overarching theme of my experience at this restaurant. Sticky, nasty, and disgusting.\n\nThese people do not care about their restaurant. Their parmesian cheese contains actual black mold.\n\nWhen we got our pizza I had a horror movie reaction. The pizza was like a swamp. There was so much grease the pizza was dripping.\n\nOnce again,\nDO NOT EAT HERE!!!", "author": "Aidan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I literally love the food there ... I came back here several times... pizza, spaghetti and H&Ch are especially yummy", "author": "Sandra D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "Terrible looks, no restroom inside, expensive, no coke or Pepsi but \"there own coke\" , refill cost 1 dollar, Waitresses did not see me for a long time and it was NOT full at all.\nPizza was good!!!! Could take a piece home with me but sorry... 30 dollars for 1 small pizza and a coke... no... you will not see me back here", "author": "Fanny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Delicious pizza for my family of four! Sauce, pepperoni, and crust were great!!! The atmosphere is fun and great for families! TVs fit sports, big tables for groups, and very friendly staff!", "author": "David A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "Blonde hair girl was very rude the brunette girl was cool and friendly pizza was good but I asked for a box to go and she said you have to ask your server and I have to wait in a rude way it was filled with bad vibes and I'm a paying customer who was asking nice and being friendly the whole time even the nice girl waitress was never checking on us as we were freaking ghost", "author": "L-Jay C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Hahaha this place just makes me laugh. Worst customer service, rude ass waiters rude as cook. The pizza is pretty much raw, we asked them to put it in the oven for a little bit and the cook got super mad and got all in our face about it but finally brought it back and it was all burned. ridiculously bad ! Never again . Once they brought the pizza we were completely ignored the rest of the meal", "author": "vanessa p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "I've never been so mad at customer service until I came here, I went with some friends to the The roc nightclub and we went shortly, and wanted some pizza. We arrived here, no I understand if the restaurant is closed but the way the employee yelled at us was ridiculous. We simple asked \"are you guys open?\" And he yells \"No!!! We aren't open!!\" And starts yelling at us. Honestly glad we didn't go because we found a better pizza place.", "author": "Aaron R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Wow glad I didn't read reviews till after!!  We were cold, tired and hungry and wanting anything but fish. Saw a sign for pizza and it was right down from our hotel so we took a seat and ordered pepperoni and coronas. Pizza was cheesy hot and beer was cold. Good location for relaxing and watching the street traffic. Our waiter was friendly and checked on us often. True it wasnt packed but we came in at 3 on Tuesday after Memorial Day.", "author": "Debi N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-09", "description": "If you value your health then don't eat here. \n\nMy fiancee and I stopped here on our way to the Chocolate Festival for a quick bite. We passed by and saw that A. it was not busy and B. pizza smelled good. Boy, do we regret that. \n\nWe sat outside and ordered our pizza. Our waitress was very nice. We ordered a pepperoni pizza and anxiously awaited our greasy deliciousness. When it arrived, it looked like your typical floppy pizza that you would receive at a sporting event. Of course, we asked for parmesan to spread all over BUT, to my surprise, I noticed a blackish/greenish area inside the parmesan bottle. My fiancee at this time had happily sprinkled a ton of it on our pizza. When I took the top off and took a closer look, it was MOLD. Nasty MOLD in the parmesan bottle. Of course we nicely told the waitress and she apologized and made us a new pizza. She also brought us a new batch of parmesan and stated \"Oh Im sorry. The person who closed last night forgot to put the bottle in the refrigerator\". So with hesitation, we ate the pizza which was average at best. I thought they would give us the pizza for free after that incident, but they didn't offer. No biggie, but I would definitely no recommend this place to anyone... Unless you like pizza with a sprinkle of mold.", "author": "Lysette B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "Even though I checked in about a month ago, I've been contemplating about writing this review for the simple fact that I was really pissed off at the kind of service that I had gotten here...\n\nI absolutely love pizza, and my friends and I thought it would be a great idea to try out a new pizza place in the city before we headed to the bars. By far, the pizza was cooked perfectly. The dough was great and wasn't burnt, it wasn't to thin or thick, the pineapples were a little soggy but not too bad! \n\nThis review is based mostly on the service... We walked in, and the server (an Asian woman) greeted us and sat us down. Barely said a word to us, she came and asked us what we would like but we didn't know what kind of pizza to get so we were debating on a half and half. The second time she came back she looked annoyed because we were still deciding... When we got our food, she didn't ask if we wanted anything else didn't give us plates or water, whenever we went up to ask for something she rolled her eyes. She didn't once come up to us to ask if we needed anything else, everything we needed we had to go up to ask her cause she was behind the counter the whole time on her phone... \n\nBy other customers' reviews, a lot of them were based on HER customer service skills. Maybe this business should rethink of how she's making them look.", "author": "Adrianna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-18", "description": "I have so much regret from eating here. My friend and I had pasta and our other friend had the wings. None of us enjoyed our food. We basically left the meals on the table and went to find snacks at a cvs after to get the taste out of our mouths. I have worked in a restaurant before and I had no issue with the service just the food quality.", "author": "Natasha W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Pizza was really good. Would totally come back! Just got the simple pepperoni pizza. Really great flavors!", "author": "Claudia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "Came to eat on lunch with my boss an the service was horrible there was only 4 tables. An we had to call for our server to take our order. Then when had to our order  we asked for no onions an she had messed up an started saying she didnt hear us say that.. i will never eat there again.", "author": "Happy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-05", "description": "I was hesitant to try this place due to the reviews, however my brother and I were tired and starving so we decided to give this place a try. \n\nWe had a small pizza (6 slices) to share. It was alright. Not terrible, not amazing. The pizza was really cheesy though, so if you like extra cheese on your pizza this might be the place for you. A bit pricey, about $18 just for the pizza and two toppings (we got water to drink) but what can you expect, you're in a pretty touristy area so it wasn't surprising. \n\nAll in all, pizza was good enough to eat.", "author": "Denise D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "The way we treated is awful. Only 3 people working inside and waiting time is 50-60 minute for simple pizza.", "author": "Anil A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "Service is absolutely awful. The waitress and the chef were arguing and yelling at each other with a restaurant full of customers. Our waitress, who couldn't have been any more rude, never came back to our table after she dropped our pizza off and rolled her eyes when we asked for sides of ranch that we ordered when we ordered our pizza anyway. Sign outside says \"SF's most famous pizza\" but definitely not worth stopping in for. Pizza was definitely not memorable.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Our family of five had a great experience.  Pizza and spaghetti were good.  Wife and I shared a small pizza and 2 of our kids shared an adult-sized spaghetti. Perfect sizes and plenty of food. There were no issues with the service. Nice atmosphere watching the hustle and bustle of outside.", "author": "Marc M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Worst customer service ever. Our server was angry at us for no reason and she made sure we knew that she was angry at us. Food was horrible as well, not worth the amount of money that we spent.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "We had a medium fisherman's special. It had pepperoni, onions, peppers, mushrooms and shrimp. The shrimp salad shrimp ( kind of small shrimp but very good) Never had shrimp on Pizza before. Very good. Definitely will be back again.", "author": "Gwen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "Not very good pizza, tasteless. The best pizzeria of SF is Tony's napoletana, I would suggest you go there instead.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "Very poor service and very unorganized. Wasn't greeted and offered not even water. I asked for menu and I didn't received because I needed to wait for my turn. There were only two servers and they looked overwhelmed. I went to order a pizza to later be told the food wasn't ordered or prepared. I just walked away. They need to fix everything. Very dissatisfied and won't come back again.", "author": "Alexis S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "So far this spot has no reason for a bad review. We visited at about 7pm on a Wednesday night in late September. Waitress quickly came to our table to take our order. She wasn't overly enthusiastic but she wasn't rude or inattentive. She did her job. Brought us our DIET COKE swiftly. Waiting for food and will continue review after we eat. \nSo the food came in a reasonable amount of time. My son had a burger, daughter had spaghetti and I had a small pizza. We all thought the food was good. Definitely no complaints. Thought it was a cool sports/pizza type place that was sorta quiet amidst the Fisherman's Wharf busy atmosphere. Giants game was on. Stoked. Whatever the negativity was about 11 or so months ago, the ship seems to have been righted. Then again you never know on a different night, at diff time of year, with a different shift of workers. I would return.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "If I could give them zero stars I would they had us sit at a dirty table first off only to walk by 5 times and to top it off clean another table right next to us so glad we left totally not going back ever again this is such a mediocre place", "author": "Raina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "Hi I been today Fishermans pizzeria I found this place by insisting of my friends Asem.\nSo I decided to give it try!\nTaste wise it's primo; the right combo of chesse, tomato.great crusts and of course thinly sliced! \nPeople are efficient and easy to talk.\nOnly place for pizza in California that I truly enjoy! \nI haven't tried their ice cream yet, but I'm pretty sure that they are awesome.Big Big thank you Asema.", "author": "Akimzhan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "After walking around all day I needed something to eat. This place was alright. If they had BBQ it would have been better.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-05", "description": "0 zero stars !!! Service here is the worse. The waiters are so slow and very rude. I had to get up and ask for a refill, get up and ask for the check and the to-go box only to be told to sit down and wait for my server. The blonde girl with glasses is the rudest one there. She should not be working in that type of job, she clearly doesn't have costumer service. They think filling the empty salt n pepper shakers are priority over checking on customers tables. I looked around and seen another table being ignored so long they left. For as long as we waited for our check we should have just walked out too. We will NEVER come back. Don't waste your money here.", "author": "Serena R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "We were in a rush so we came in here for a quick bite. \n\nFood: we ordered the house special large and it was alright. Thin crust pizza and with shrimp, onions, green pepper, pepperoni, and mushrooms. \n\nThe coffee machine was broken to make cappuccino and the coke seemed pretty stale and no refills. (Refill for coke was $1) \n\nService: there was a new waitress and she was really nice and friendly. They were pretty nice \n\nBathroom was outside and needed a code to unlock the doors for both men and women. \n\nBehind the scenes: The owner seemed to be running in and out and was the server and the cook which was sort of unhygienic. He would make the food with bare hands (no gloves) and serve food, then grab the check and menu and then go back to making the food again... Even though there was another chef who was making the pizza....", "author": "Rechenna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Went here twice to eat. The first time I had rigatoni with a nice red sauce and melted mozzarella and a large French bread half cut piece of garlic bread and a soda. The price was medium but the food was really good! The server was a really nice, sweet and handsome guy who ran all over the place inside and out (there is outside seating) and was really great and made sure I had everything I needed. I tipped him 100 percent because he deserved it. \n\nThe second time was a day later and I took my friend here. We both ordered fish and chips which were hot, tasty and came with fries, tartar sauce and lemon. She had a beer and I had water. The place is nice and clean for the tourist area. I really enjoyed it because you can people watch while you eat and the pizza smelled and looked amazing...next time!\nI'm a fan of that server though!", "author": "John P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "I would give 0 stars if I could. This is the worst place to eat. Food is  overpriced and terrible. I would chose to eat cardboard instead. Surprised they didn't mess up the fries as well. If you buy something based on how it's described on the menu, you kind of expect to to taste like it but no. Don't waste your money! Go somewhere else.", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "No restrooms, slow service, bad food.\nWe ordered hamburgers and they were overcooked, fries were very dry and the bottom of the hamburger buns were dirty and burnt.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-05", "description": "Worst service EVER. Pizza is greasy and overpriced Took two hours to even arrive at the table. Do not waste your money. You've been warned...", "author": "L A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "Mediocre, over-priced food. Slow service. No restrooms. Earlier comparison to amusement park-quality pizza is perfect description. Avoid.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "Terrible food, bad service, not very clean, and no restroom for customers. We do not recommend this pizzeria.", "author": "Trinh S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-05", "description": "We drove 2 hours...kids were hungry so this place sounded good...but honestly it was very Greasy pizza, expensive prices, no free refills, 1 waitress. Go elsewhere.", "author": "Yadira C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "Waitress is rude and unfriendly. No smiles, treating us like we are an inconvenience. I'd get up and leave but my kids are really hungry and she did manage to take our order after 15 minutes of being ignored.  Hopefully the food is ok and doesn't take an hour to arrive.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-12", "description": "Service was not very good---didn't refill drinks, didn't ask how we were doing, didn't ask if we needed anything else. We ordered pizza, which was pretty good. It wasn't too busy---two other tables but we barely saw our waitress. The atmosphere was alright though. They had tables inside and out. Maybe just a little sprucing up to the place would be more appealing to the public. I would probably look elsewhere for pizza in the area if I were to go back.", "author": "Tori D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-23", "description": "This place was not good.  My toppings were just thrown on top of the pizza and not even cooked. Jalapeños,  onions,  and bell peppers just thrown on after the pizza was done being baked. 24.99 for a small pizza with toppings just thrown on. Also the service was not good at all.", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "After a tired day of walking around San Francisco and not wanting to fight the tourist crowds at the fisherman's wharf we stumbled into this pizza joint. I was pleasantly surprise. We had the fried calamari, fog pizza and spaghetti. I actually enjoy the pizza a lot. The crust was nice and light for me and not greasy.  I enjoy the combo of shrimp and clams. The calamari was flavorful. The spaghetti was ok according to my daughter. She is a spaghetti expert. The service was very good and friendly. There were two large tv so I did not notice the wait.  Over all it was a very nice meal.  I would recommend it if you are looking to get out of the crowd.", "author": "david c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Worst food ever. Expensive. I don't even know how to describe how awful the experience was but the pizza was burnt, greasy, cardboard crusted and the drinks were tasteless as well. Stay away, you've been warned.", "author": "Norma P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-17", "description": "Pizza dough is made from frozen dough. Terrible quality ingredients used for toppings. Owner is mean to the sweet and kind girls who work there.  He needs to be fired. Avoid at all costs. We gave our $26 small leftover pizza to a homeless person and even felt bad giving it to him!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "Being from Chicago I was not expecting much from Fisherman's but it smelled good and we decided to check it out. After eating there I am not sure why there's so many negative reviews about this spot. As fairly hungry tourists we opted to split a pepperoni and onion pizza that was definitely hit the spot. Service was also good. My only real complaint about this spot is that the inside did not seem super clean and was fairly dumpy. Not sure if I'd be back but I don't think this place is as bad as others have made it out to be...", "author": "Magen R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-13", "description": "We came on Oct 8 Sat after the Air Shows of Fleet Week SF 2016.  We ordered medium  vegetarian pizza.  The price is $27+.  The pizza was soggy and burned.  zero star of the food.   one star for the cold beer.", "author": "Cary L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-07", "description": "Falls into the tourist trap category.\n\nDon't come here for anything other than the pizza. The cold cut sandwich ($10) surprisingly turned out to be a muffuletta, but it was heavy on the bread. \n\nSmall cheese pizza, 9 inches, $10. Dough was good. \n\nNo bathrooms, you have to rely on the public ones around the corner. \n\nSmoke weed everyday.", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-17", "description": "Holy pooper scooper!  There is no bathroom at this restaurant...so when you are a couple of beers in, just start crying: you have to walk down the street to a piss drenched public bathroom if you need to make a wee.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-05", "description": "WORST SERVICE EVER!! STAY FAR AWAY!!\nThis place is the worst. We were looking for a pizza place near by the holiday inn and decided to give this rats nest a try. Right from beginning we were helped by a Rude asian lady that was clearly Fresh off the Boat (said her name was Anne, which I doubt). No smile. No greeting Just absolutely unprofessional. We ordered a Pizza, Jalapeno poppers and fries. I asked her for extra ranch and she poured maybe 5 ML of extra ranch into the soda cup and walked away. We shook it off and proceeded to our hotel to enjoy our overpriced dinner. Upon getting to the room we notice Anne screwed up our order and gave us wings instead. So we headed back to let Miss Rude Anne know about her incompetence.  She then wanted to argue and claim that we never said Jalapeno poppers and we told her chicken, We never ever said chicken clearly the owner of this establishment needs to educate his employees with Rosetta Stone. She still wanted to argue but threw the poppers in the fryer anyway. After that she ignored us completely. She plopped the poppers in a togo box and handed it to us. Then she told us she was going to  to the back to go get ranch. Funny how the ranch came from the front when we originally were in so she must have been trying to give us her \"special ranch\" We decided we didn't want Annes ranch from the back, so we left. My fellow yelp users, if you are looking for good service and you don't want someone messing with your order, I highly encourage you to AVOID THIS PLACE LIKE THE PLAGUE!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Not sure why the reviews are so bad if this place. We had two pizzas for 7 folks and no complaints from anyone. I loved it actually!", "author": "Vicki C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-02", "description": "Awful customer service! Took the waitress 30 minutes to come back and tell me what I ordered they were out of. Asked to speak to a manager or a supervisor and she said they didn't have one on duty. After she told me my food was out it, the chef placed my food on the counter while my waitress chatted it up with her friends. Would not recommend or ever go back!", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "I read the reviews of this place and expected nothing good, but we were hungry and it was super windy outside so we decided to stop here. \n\nThe waitress was super nice and informative about the menu and she recommended the pizza to us over the hamburger . I also heard her recommending things to other guests. \n\nWe both got the JR. Pizzas...which was surpringsly big! The dough was super yummy. I asked for a side of ranch which she did not charge me for. \n\nOverall a yummy place! Sure, it's a bit pricey...but you're in a tourist part of SF..what do you expect?", "author": "Jessica Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "EXPENSIVE, not very good, and VERY POOR SERVICE!\n\n$19 for a medium cheese pizza, $2.50 for a (small) coke, and $1 for a refill (that I had to ask for after sitting empty for over 5 minutes. The service is horrible. Our server never checked on us once in the entire hour we were there.\n\nDon't go here.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-19", "description": "Extremely disappointing experience here. To be fair the actual pizza was ok but the service was non existent and there is no restroom on the premises. Avoid at all costs.", "author": "Shane C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "I would have gave 4 stars because the pizza is good in the neighborhood but the service is horrible. They are rude people walking around with attitudes. Always looking mad. Never a smile. They make everything about that place very uncomfortable. The prices are too high but of course it's made for the tourist.", "author": "Lady L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-25", "description": "This review is for the same visit where the cashier demanded her tip.\n\nSo after eating our very uncomfortable meal, we waited outside as our Lyft was soon to arrive. We're drunk and annoyed that she demanded tip and threw a fit when we requested for plates, so yes we were all talking crap about this place and how we were going to leave shitty yelp reviews. And (not to my surprise), cashier lady comes out yelling \"are you guys talking shit about me- I can hear you.\" She's poppin off & it was so funny. She wasn't worth the fight or assault charges one of us might have incurred. Just as this place isn't worth your time and your money.", "author": "Paulina T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "Terrible service and expensive for the quality of the food.  Pizza crust was very dry and a bit hard. Restroom situation is unacceptable.", "author": "William B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-07", "description": "Don't even bother to go to this place...  \n\nIt's a tourist trap... The pizza is mediocre and EXPENSIVE for no reason.  One 11\" inch basic cheese and sauce is $13.90 and they charged me $2.70  for one topping of mushrooms. It also took 20 mins for them to cook the pizza. I ended up spending $22 for a small pizza with ONE topping and a small glass of cock which half of the glass was ICE !!! \n\nAgreed with the negative reviews. Do not go here.  Go to Carmel Pizza Company instead which is just couple blocks down the street.\n\nSorry guys but I really didn't like the prices.", "author": "Helen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-02", "description": "Pizza was ok, but I lost my appetite when I saw the \"Restaurant Sanitation score of 84\" as rated by the city in May 2015 posted on the back corner of the wall. To clarify and be very clear, 84 is \"needs improvement\". I read some of the reasons for the 84: food products on floor in walkway...Then I noticed the dirty floor in the kitchen/cooking area. In general, didn't look too hygienic. \n\nAlways check sanitation scores before ordering food. Staff was nice though.", "author": "Keith L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-24", "description": "Out of chicken.  Huge chef salad, filling.  Waiter hustling.\n\nI'm sure we could have found something better nearby, but after walking around all day, this big, mostly empty restaurant seemed like it would do just fine.   How wrong we were.\n\nThey kept the doors wide open despite it being late December and chilly, so we kept our jackets on the whole meal.  \n\nMy friend ordered a pizza with chicken and come to find out... they were out of chicken.  This seems like a weird thing to run out of to me.\n\nOn the positive side, I had the chef salad which was huge and pretty satisfying.   There was only one waitress and she was hustling and doing a good job.", "author": "Erin E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-17", "description": "Horrible and depressing place to eat.  I had the vegetable sandwich for 10 bucks.  I could have made a better one myself for 1 buck.  I just left there and my stomach is churning and I wish I could throw up the food to get it out of my system. I really do feel sick from just a vegetable sandwich! Hope the cheese didn't go bad. Negative stars for this place.  The owner also stands behind the counter looking sad and depressed..i feel bad for him.  Sorry I just have to be honest as this is not worth your time and money.", "author": "Jamie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-27", "description": "We wanted pizza and we stopped here to eat. It was probably the worst experience i have ever had at a pizzeria. The waitress claimed that we didn't get our food for an hour or 2 because the chef forgot. The stupid wings were like $25 dollars and weren't worth it at all. For waiting over hour, we had to pay over $100 dollars for being forgotten. WHAT A WASTE!! DON'T EAT HERE IT'S HORRIBLE AND IT WAS A MISTAKE!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "The food is terrible and overpriced.\nThe shirmp cocktail contains of mini shrimps defrosted very fast (without a taste) drowned in ketchup. \nBolignese spaghetti is a meatball drowning in disgusting sauce. \nEven though I came there very hungry I would prefer not to eat while evening. I felt sick after. Will never enter these doors again", "author": "Jan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "How can you mess up something as simple as pizza?? Our family was really hungry so we got trapped to have lunch here. Surly waitress- we tried to say thank you and she said nothing. Pizza was greasy, calamari was just fried ish on a plate. Service sucks. The only saving grace is that they're in a prime location. Boo on them.", "author": "Jasmine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "I was looking for a place to chill and have some pizza. I thought this place was good ! I read the previous reviews. I came in with nobody here. I ordered a small pizza which was a simple pepperoni. I had pizza and beer. I people watched from my window and had the nicest service. Had great music playing ! Exactly what I was looking for. !", "author": "Liz L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "Service is like so bad I don't have to taste the pizza to give it 1 star.  They don't care about customer service here. Unless your ultra drunk and just need to eat to keep from starving I recommend you go and grab some Cheetos from the local corner store to satisfy your hunger panges.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "Philly steak sandwich was OK. Service with a scowl. Iced tea was soured. Walk on by...", "author": "mark p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-29", "description": "Decided to give this place a try despite the negative reviews. The place was almost empty on a Friday. When the pizza did not show up even after 30 mins, we asked the server how long it would be. And she said like 10-15 mins. When we said that's too long, a guy (owner?) started talking rudely. Then he just pulled out the half baked pizza from the oven and packed it for us!", "author": "Adwait A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "One star even seems like too many. Giving this a low rating mostly because of the terrible service. The food was mediocre, too, though. It took about 45 minutes to get to our table and 20 of those minutes were from waiting just to get our order taken. Especially disappointed with our payment experience. The waiter was being very rude, he would not let us speak in order to correct a mistake that we noticed on the bill and he thought it was acceptable to speak to us in a very disrespectful tone while we were being calm and polite. The other waitress had to apologize for his rudeness. Unacceptable.", "author": "Karla D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-16", "description": "$33 for a large pizza. Check the wall they have a 62/100 on their health code. It's below satisfactory at \"poor\" and on the report the agent underlined \"use of toxic substances\".", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "Pros: no waiting to get a seat. Quiet atmosphere.\nCons: Ignorant staff. Slow service. Mediocre food.", "author": "New C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-29", "description": "I asked to have salad instead of chips with my sandwich because i dont eat fried food. They said thats not possible. The manager was very abrupt about the whole situation. I also asked if the philly was made with ribeye she said yes and it was steakums style processed meat. Everything i didnt want. It was also smothered in mayo and mustard. Who puts mayo and mustard on a philly EVER?!Watching other people being served and orderd on while i wait and was here first is also very annoying. This place lacks organization thats forsure. I walked out and many others did too. Horrible excuse for a resturant. Im very anti yelp and never do this but my mind is blown. How is this place still open.  Never EVER will i be here again and i highly suggest you dont either.", "author": "Armando K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "Lousy pizza. Way too greasy. Coke tastes like chloride. Service was not customer friendly. No go...", "author": "Jeroen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-27", "description": "Horrible chicken Cesar, drowning in dressing so I couldn't eat the bottom layer or anything that fell into the soup at the bottom, cheap packaged croutons, chicken was in ity-bity bits that cost me $3 extra dollars. Overall horrible salad that wasn't filling for the $12 cost. Will not be returning. Now I need to go elsewhere to grab a snack since I'm still hungry.", "author": "Celine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "I walked in expecting to order a slice. FYI - they dont do slices. \nOkay fine, we have three people willing to eat (and a toddler who although saying no, will surely want one when she sees it) so let's get a medium cheese pizza. \nThey had been busy on Christmas (two days before) and they were out of ice cream and hot tea, but they did have pizza. A half hour later our pizza comes out to us. At first I was deeply afraid because there was pizza oil in puddles on the pizza. I used at least 30 napkins to soap it up. However, I was worried for no reason. The pizza was actually pretty good! It was had lots of herb spices in the sauce and a ton of cheese (hence the puddles of oil). I would definitely go here again. Of course the toddler finally wanted some when we were leaving. She grabbed her slice, tasted it, said \"ooh yummy\" and would not let us take it away from her.", "author": "Pamela R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "Good for a corner pizza that is open late. The garlic bread on the Spaghetti had some real minced garlic on top. Spaghetti was ok and cheese pizza was ok. This place is a good eat \"on the way\" place.", "author": "Carl B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "Worst service I have ever had. We first sat down and the waitress tossed our menus on the table and left, no introduction, or greet of any sort. She came back, took our order, brought the drink and left. Pizza came out, again tossed on the table, left again... All throughout the service NOT A SINGLE WORD was said to us, we ate the whole meal without being checked up on. Next thing we know, check is on the table with again NO WORDS SPOKEN. Reading the reviews on here I'm glad I wasn't the only one that was treated like this, pizza was decent but service was horrible, basically non existent.", "author": "Juan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "Pizza was hot wasn't greasy really good. A little pricey but it's all about location should I say? The crust was light. Beer was cold. It was overpriced. We enjoyed.", "author": "Jonelle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-07", "description": "Service, eh. Drink was small and it was 2.70! Plus dollar refills! Wtf! I can only imagine the pizza. Shit. Better come with a massage! Overrated already!", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-21", "description": "Service was a bit slow but pizza came out fast. We came early evening and the owner refused to close the door because he doesn't have an open sign so he probably wanted it to be more welcoming but all the customers including the waitress was wearing jackets and scarfs. Pizza was good and the topping generous but it wasn't as spectacular for the price. I rate it on the dough and the dough was something you can get at a fast food greasy diner place considering we paid $28 for a medium three topping pizza. If you want to come for a sports game they have two TVs on each end of the restaurant but it's not much of a sports bar atmosphere. Not sure what ambience they want to set ....", "author": "Oly C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-25", "description": "Service was okay, however the pizza was very \"dough-y\" and I didn't enjoy it. However, it was the first pizza place we saw!\nAlong with that, they did not have a public restroom which was annoying and they lady seemed annoyed that we didn't want to take our leftover pizza home.", "author": "Lexi S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-12", "description": "We went back again on Friday... It wasn't as good as I remembered. The waitress was short tempered even with only 3 tables to service. The pizza tasted much like cafeteria pizza. We probably won't be returning on our next visit.", "author": "Nicolle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-23", "description": "came in because I got to parlor way too early and I hadn't eaten anything that evening. I wanted to avoid passing out at 11 PM, so I needed something in my belleh. this place is right across the street so I randomly popped in to get some pizza before the drinking began. \n\nthey don't sell slices, sadface. I ordered a junior (9 inch) pepperoni and mushroom pizza and after they put in my order, pulled this place up on yelp. I cringed when I saw the low ratings, but I had already ordered and didn't want to venture anywhere else as this was convenient for me. so, the pizza came out and I was surprised at how decent/good it was. was it the best pizza I've had? hell no. but trust me, I've had way worse before! I think the ratings are just super low because yes, it is overpriced. service was friendly and the pizza did it's job. can't hate on that!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "San Francisco Indian Summers are amazing.\n\nAfter a nice sunny morning of playing tourist last week I remembered how much I enjoyed the pizza at Fisherman's the last time I was in the area.  I came back to this pizza restaurant and again... I loved loved LOVED the pizza.\n\nIt was a bit pricey but this is San Francisco.  I can't afford to eat here all the time, but if I'll allow myself to splurge, I would definitely try one of their seafood pizza's.\n\nWhats most interesting is my experience while dining in.  My first visit was a simple and quick process, order to go, 10 minutes, its done, boom, I'm out.  This time I wanted to relax and enjoy my pizza with table service.  \n\nIt was odd...  There were probably eight or nine tables and only one waitress running the show.  Lucky for me I was settled in my corner booth and devouring my meal before the big rush of people flooded in.  I witnessed the worker rushing to take on the role of hostess, barista, bartender, food server, cashier, busser, AND security guard during my meal.  \n\nA homeless man was harassing a customer and she had to ask the creep to leave!  Really in Fisherman's Wharf?  I guess the SF homeless problem just gets worse every year.  \n\nI can only imagine how difficult it would be in the evenings with all the co-eds stumbling in drunk from the bar across the street.  No doubt looking for food to sober up after a long alcohol infused night of dry humping and twerking.  In that case I suppose the waitstaff would need to add bouncer to their repertoire.\n\nAll in all, both my visits were great.  They were short staffed, but she worked it.  I got my fill on pizza and beer and I was happy.  \n\nI've decided to change my initial 4 star review to a 5.  \n\nThis place is good.  Good people, good food.", "author": "Clementine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-12", "description": "Food quality is low. Hamburger was stiff, bread was still frozen. Location is good but it's not enough to get 2 stars.", "author": "Luca G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-01", "description": "shittest pizza ever. Bad service! Horrible waitress. Charges 1$ for a small ranch while sitting there eating. Will never eat here again.", "author": "Desiree H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-29", "description": "The Spaghetti was Great, I rdered a Small Pizza with Peporonni & Extra Jalapenos. The Pizza was great, thin crust, and ther where not shy with the Jalapenos..", "author": "Ralph A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-03", "description": "I really wish Yelp had a negative stars review because this place doesn't even deserve one star! This place is terrible I came with my family of 5 and a small child who didn't even eat. We ordered 2 small pizzas, 2 spaghetti plates and 5 drinks and our bill was $135!! The food was terrible the sauce literally tastes like Ragu. Which isn't bad but not worth $135 also they added gratuity because they had to count the child even though she wasn't eating, because technically that made 6 and they charge 18% for gratuity on tables of 6 or more. The sodas were terrible and it's a tiny glass that you don't get a refill on unless you pay $1. The waitresses are young and seem like they hate theirs jobs, they take your order once your food comes they never return. All this isn't the worst part!! The worst part is my whole family felt ill after and my wife was vomiting all night!! Stay far away from this place!!", "author": "Mando C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-25", "description": "Worst service in the world. .. waitress acted as if she was kim jun whatever from north Korea... just mean and racist. .. the pizzza was awsome tho. Good! !!", "author": "Majid A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-18", "description": "Ok, I'm going to be very bitter in this review. I ordered a burger, my friend ordered fish and chips. My burger took at least 25 minutes to arrive and it came well after my friend's fish and chips. The fish was slimey and some of it was raw. \n\nFinally my burger comes out, and at first look, the bun seemed moldy to me, but the waitress assured it was rembrants from the grill (which is still gross) so I sent it back...took another 15 minutes to get another burger. Took a few bites and it was very obvious that this was not only a frozen beef patty, but it was also not seasoned what-so-ever. I was so hungry, I just had to take a couple more bites, but left most of it behind and eat all my fries (which I could get at safeway and pop them in the oven). \n\nMy friend did them same, eating his fries, and leaving the fish. \n\nIt's sad that this is in such a prime tourist location. I hope tourists don't use this place as their first impression of food in SF.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-15", "description": "Not great but not horrible either  a medium 2 topping pizza, 2 cute little mini glasses of soda and 1 cheese ravioli came to $52 w tax & tip. Overpriced but it is a tourist trap area so I get it. At least it wasn't crowded and the food was OK. No crazy waitresses today that we saw. To the person who complained about too much ice in their glass of \"cock\", I'd say you should be thankful it wasn't filled with \"cock\". I'd much rather have ice myself but it's a free country. Is there better pizza for the same price or less, of course. But if it's close and not total garbage, that's par for the course around Pier 39.  One major gripe with all the restaurants in this area is this. No freaking bathrooms? You have to go outside with a code to use them. The custodial staff were a pair of dicks (or \"cocks\". They need to be put on ice.", "author": "Steve O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "As I'm sitting here in the pizzeria, I'm deciding whether I should even bother carrying the left over pizza home. It's just bad. The crust is bland and unremarkable. The dough is probably frozen. The toppings, pepperoni, onion, bell peppers, are all cooked to different consistencies, which means that the cheese base and components were probably precooked separately hours ago and then assembled. My husband said it tastes like the pizza you get at amusement parks. You're better off buying a Red Baron pizza and staying home.", "author": "A. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Shared a small Hawaiian pizza with my boyfriend. Perfect size for 2 people. A little pricey for the size but the pizza was delicious. Don't have bathrooms which is a down side but other than that I would recommend to someone who loves pizza.", "author": "Yesenia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Amazing service and great food! I highly recommend it. You can sit wherever you like and it only takes 15 minutes for the pizza to be delivered to your table.", "author": "Natalie V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "Came to this place with family, and looks very nice outside also facing out the city, I ordered the spaghetti and was disappointed the spaghetti was very watery that most of my noodles weren't covered with sauce, also had no flavor at all not worth paying for but garlic bread was good, But looks wise nice, spaghetti not so great.", "author": "Natalie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-26", "description": "We were walking by and the smell was incredible. The pizza smelled fantastic.   Unfortunately the service was HORRIBLE, there is trash on the floor and whatever you do, do not order the calamari.  It is sooo gross. Very very disappointing!", "author": "Denise Placencio Divorce Atty P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-03", "description": "The waitress was nice, but the pizza took an hour to make. It was not worth the wait because it didn't taste good. The pizza was very greasy and I really had to pat that down with a few napkins. And the worst part is that it was expensive. Because of the wait they gave us small fries on the house and one free cheese cake to share with the other 5 people that were with me. Everyone was getting frustrated and tried for waiting so long. I know; I should have left earlier, but we were tried of walking. This was not a pleasant experience.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "This place is bomb! They have a bar and their pizza is really really tasty! It was so good I ate half of the entire pizza in like 3 minutes. Tasted fresh and smelled amazing. I will be back. Service is really good too. The second I walked in I was greeted and sat. Then my order was taken. Maybe price is a tad high but it's San Fran, practically on the water - I'm sure the overhead there is insane, so I get it. Thank you, FP - see you again very soon!", "author": "Hambone M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-04", "description": "I hate bad reviews.....so take this as constructive criticism.....you need a bathroom.  When a family walks in and asks for a restroom and you say sure just walk outside, down the street, down the stairs, over the trees, under the woods, and enter a code then something is not good.  I mean really?   The only reason I picked this place was because it was so empty and I was 8 deep........ have to say wish I never did.  1st off I chose my seat just to be moved, and I can understand a section being closed but no it was open, I just could not sit there.   The next kicker was they have buffalo wings on the menu so I order, that lady says these are not spicy they are just regular wings?????  Why call the buffalo.    I know fisherman wharf is tourist area but if this is what we subject the visitors to our city to then we got it all wrong.\n\nAll in all this place gets one star for ok tasting pizza but service/atmosphere/ and price suck!!!!   And no bathroom    triple thumbs down", "author": "Kareem J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "Ordered a meat ball sandwich and ran out of meatballs, on a 3pm on a Saturday. The guy cooking pizzas was drinking and eating at the same time he plunked the pizzas in the oven. Got a sausage sandwich that was disgusting , microwaved marinara sauce and poured all over the bread. Then some burger which they claim was angus beef, no way in hell. It was definitely frozen and ground and weeks old. Never coming back here again.", "author": "Fabio H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "Food isn't anything too special, and the service is garbage! I walk in to a bunch of people, who look like they hate their lives staring me down. It honestly made me wanna walk right out, but everything else was closed.", "author": "Serra L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-10", "description": "Screw this place. Seriously dont come here. We were 12 people but we all sat sepreatly and paid sepraetly. In the menu it said with a party of 7 people or more they would charge us 15% gratitude but we were only 2 from everyone else. Even though we paid speretely,sat and charged us sepreatly they still charged us the automatic gratitude since they knew we were all \"together\". I asked the waiter why and she said because we were 12 and its 7 people or more so thats an automatic charge. I was confused because it was only 2 of us is like if we all came sepreatly in a way. She refused to remove the gratitude because is under the state law everyone got bothered by this. But she made 12 buks on each check wich was the 15% for the whole party. They should of charged us the 15% from each separate check at least but she refused . She made an easy 70 dollar tip that night. Food was okay. But service from our waiter was horrible. I forgot to get her name guys sorry. Dont come here please and thankyou its nonesense.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-16", "description": "From out of town and didn't even get to eat or experience full service here.  I stayed at the Holiday Inn, a block away from this place.  First time we walked in, it was later at night and it was really busy, but no one cared to seat us.  Okay, no problem, we thought, they're just really busy.  We tried going in another day around noon.  The doors were wide open and there's this guy who's just sitting at a table and talking on his phone, no customers.  When we asked if we just seat ourselves, he rudely tells us they aren't open.  I guess it wasn't important enough for him to stop his phone conversation to let us know as we walked through the wide open doors. And it was noon - why aren't you open for lunch especially with your doors wide open?! So for the rest of our stay, we just avoided this place.", "author": "Chia X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Friendly service, pizza was delicious. Had a problem with my drink and they replaced it with a smile (problem wasn't their fault). Pasta wasn't anything special but wasn't bad (hence 4 stars) and I am a little picky about pasta. I'd go there again!", "author": "Erin A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-11", "description": "Right outside this establishment, large signs in white letter touting \"San Francisco's Finest Pizza\" imbued this place.  Those words sold me.  Well, not really.  It was actually a few feet away from my hotel room and I was letting my laziness dictate where to dine.  The attentive waitress handed me their menu and after a brief perusal, I ventured for their $20.90 small \"Vegetarian Deluxe\" pizza and ordered a glass of Anchor Steam beer.  \n\nAs pizzas tend to normally take some time to prepare and heat, I wandered around for their restroom to wash up.  Upon seeing my bumbling, confuzzling and desperate look for a restroom, the waitress approached me and said they have no public restrooms.   I trekked back to my hotel room to wash up and promptly returned to the waiting game.  After seating myself, she presented me the \"glass\" of beer I ordered.  The Anchor Steam tasted great, but it was disappointingly held in a warm cheap flimsy plastic beer \"glass\".  As part of this waiting game: I stared at the flat screen TVs, played with my phone, people watched, zoned out looking at my table and occasionally sipped on my beer to pass the time.  \n\nI noticed my beer was half filled when my Vegetarian Deluxe pizza arrived.  Vegetarian, it is.  Deluxe, it ain't.  The toppings were pitiful as the toppings were half cooked or not even cooked at all.   I see bits of mushrooms, but it was sparingly used. The only thing good to say is their crust.  It's surprisingly good.  Nonetheless, it's not worth $20.90 and participating in the wait-a-thon.  I did experience attentive service from the waitress, despite other Yelpers' complaint of their lackluster service.", "author": "Archie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-18", "description": "The jalepino poppers were very good, as well as the Fisherman's Special pizza (?), (pepperoni and shrimp!).  The service was horrible.  We luckily got waited on, but another group came in after us, sat down for over 5 minutes without ever being greeted and left.  And then to be charged extra for soda  refills in a small glass, I would not recommend eating here, maybe grab a pizza to go though!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-10", "description": "Without a doubt the worst restaurant in the wharf area. I should have walked out when the hostess handed me 2 menus without seating me and my wife. 5 minutes later our waitress showed up and took our order. My hot meatball sandwich had 3 tasteless meatballs with too much sauce and bread. My wife's rigatoni tasted like it came out of a can. Our waitress never came back after serving our food. I had to go up to the counter to get my bill and pay. My best tip for anyone visiting the Wharf, stay far away from this place. The service and food were absolutely horrible.", "author": "Frank M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "The reviews suggest that this pizza is the absolute worst thing most people have ever tasted, but I personally didn't think it was all that bad. The crust was a little doughy, but it still had a nice flavor. Additionally, the pizza was very greasy, which I LOVE in pizza because it adds a lot of flavor. Those who don't like greasy pizza won't like this pizza. All in all, not a bad place, but definitely not the best pizza for the price or in comparison to really good pizzas.", "author": "Elliot S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-19", "description": "All I can say is \"meh\". They were out of meatballs (no big deal) so I ordered the sausage sandwich. The sausage was tasty, but the marinara tasted weird, as in not good. Staff was nice, but the floors were filthy. I don't think I'll be coming back.", "author": "George C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-28", "description": "Where do I begin?\n\nService-- snails pace!\n\nPrice --- outrageous !\n\nQuality --- freezer!\n\nNeed I say more!", "author": "The Original R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-14", "description": "Based on previous reviews it seems like this place is a hit or miss. I came here with a group of 6 people around midnight on a Saturday. The service wasn't as bad as others have stated, but who knows since I'm not a regular here.  The restroom situation is a bit challenging since it's outside and down some steps in a hallway. The code that we were given didn't work and thankfully there was a restroom attended cleaning that allowed us in. \nLet's get to the food: first up \"buffalo wings\", that turned out to be plain fried hotwings-sans sauce. A small bummer, but we still cleared the plate. As for the pizza, we went with the fisherman wharf (the name might be slightly off, I should have made note of it) it's a thin crust with cheese, tomatoes, baby shrimp and mushrooms. This was the first time I've had a pizza with shrimp on it and it was surprisingly good! I do have to agree with my fellow Yelpers and say that the large pizza wasn't large enough. Man that crust was good though! So all in all, after a night of bar hoping and looking for a place to grub, this place is okay.", "author": "Cyndi S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "Horrible we were seated watching the tv and one of the workers kicked us out for not ordering fast enough when we walked in he seemed eery and unfriendly horrible...", "author": "Karim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-25", "description": "So this restaurant is the only saving grace from my experience last night.  Please refer to my disappointing Ghirardelli review: \nhttp://www.yelp.com/biz/ghirardelli-chocolate-san-francisco-2#hrid:V-b45SmWNGvTL9FnOoAPEA\nI am really surprised this joint got  4 stars.  Did anyone actually sample and enjoy the FRESH pizza crust? What about the organic burger-the leanest burger I have ever had?  It was seriously not greasy and surprisingly flavorful.  80% lean ground chuck truly makes a difference.  \n\nI loved loved loved the pizza! The crust seriously tasted buttery and yeah, it was good.  As compared to burger, this was greasy, but I only had a couple of squished slices.  My friend and I ordered a MED pepperoni sausage combo and split that along with the burger.  It was great.  I will admit it maybe pricey...but it's the area.  I highly recommend this joint. Of course I have love for A Slice of NY in San Jose, but this is a close second. It's that good!", "author": "Flor D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-01", "description": "We only went here cause it was convenient and needed a place to watch the Giants win the World Series!!!! wooohoooooo\n\nThe service was ok as was the pizza. The prices are ridiculous, but understandable for the area, I'm sure rent is high.", "author": "Jess O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "I didn't like the pizza. It was too greasy, and there wasn't enough sauce and way too much cheese. The crust was passable, but I'd recommend a real Italian pizza restaurant over this one. The service was average, but not overly friendly. I can't remember the last time I've been charged for an iced tea refill. What's up with that?", "author": "Jim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-05", "description": "I am always guilty of going to pizza, pasta, or Mexican spots, and ordering just a salad. This is one of those times. This review is purely for their crappy salad, not the pizza. \n\nJust started a new job down the road from this place, and I was looking for a cool spot to hang out in the sun while I grubbed. With their nice outside dining patio, I figured this was the spot. \n\nI ordered a shrimp caesar salad with an iced tea, pretty basic. And that was exactly how the salad tasted. Basic, boring, and null. The dressing  looked like someone gargled it in their mouth then spit it out on my plate, it was extremely watery. Even the croutons were stale as if they purchased them from the dollar store two years ago. I should have just ordered a cup of shrimp. $17 for a crappy salad with cheap crappy tea. \n\nOnly good thing going for this place was the friendly attentive staff and outdoor seating. Next time, I'll make my own salad and walk down to the beach.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-27", "description": "It is a great place.  I love the taste of the pizza of this Pizzeria.", "author": "Lee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-12", "description": "Now I don't normally write reviews unless I really dislike a place...\n\nThis place is horrible. Came here after a city lights tour around 9:30pm on a Wednesday night. Because of this, there was only one other table in the restaurant.\n\nThe only reason I decided to buy something was to get my parking validated and to catch the last five minutes of the Clippers-Bulls basketball game. \n\nBAD SERVICE\nI go up to the cash register and say, \"hi, is this where i'm supposed to order?\" The only thing the cashier says is \"can you wait?\" That immediately put me in a foul mood. \n\nMEDIOCRE FOOD\nOrdered a plate of calamari so I could munch on it while watching the game. $10 for a mediocre dish. Portions were pretty big though, but definitely not worth the price.", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-06", "description": "Came here because it was close to our hotel at The Argonaut. Cannot express enough how bad this pizza sucked. (stomach still hurts) Not to mention the poor girl working was being taunted by her boss (until openly crying) in front of the entire restaurant that she couldn't even keep up with because of understaffing. Point is.. Avoid this place and it's overpriced fare. I've had better pizza at a gas station.", "author": "Chad A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-25", "description": "Food absolutely sucks... Will never come back. No bathrooms... Waitress was a fucking retard... No condiments for the Togo food....", "author": "Michael L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-14", "description": "The pizza is made pretty quickly, so if speed is more important than quality, then this place will be great for you. Otherwise, I'd pass. The crust is good, but the ingredients are sparse. For the money I've done much better.", "author": "Jim P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-28", "description": "Hey, I've had alot of mediocre pizzas in my life. And trust me, Fisherman's Wharf is not the place for pizza. But that being said, they can still make a fine pizza there. And trust me, even the fanciest Italian restaurants/pizza parlors in Italy of beyond can and will serve a bad pie every one in a blue moon.\n\n So with that out of the way, this was the first place I dined in San Francisco. And you know what? It was perfectly fine. Despite the fact that they are three hours ahead of us and it was about 8:00pm and you come in saying \"I'm not tired!\" but you leave like you just stayed up for three nights (Sorry for the random comment there- if your from the east you'll understand.)\n\n Anyway, the pizza pies here are just fine. Like I've said, I've had bad pies before and this place was fine. I noticed the waitstaff was a bit unattentive, however, but that was mostly fine for me. It was a fine meal.\n\nS.O.", "author": "Spenser O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-16", "description": "So I ordered a sandwich and thinking about my yelp review I told my family how it was OK, not great but not really bad. My wife thought her clam chowder was again, just OK. I then asked the kids what they thought and neither liked there pizza. That being said I hate leaving negative reviews but to save another family like mine from a bad meal. I would try something else for now and hope that the owners of this place read their yelp reviews and and work on making this place a little better for family's like mine.", "author": "David R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-19", "description": "Service was half ass. They got our order wrong, just 2 items! The buffalo wings came with no sauce on them and a side of blue cheese, horrible. The beer was good. The table next to us got their order, 1 pitcher of beer, all wrong as well. How could one server mess that up when we were the only 2 tables? We were there for about an hour and the one waitress only stopped by once and that was just to bring our food. HORRIBLE!!", "author": "John N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-17", "description": "This is the worst pizza ever. It's totally soggy and just came out of the oven. The cook was talking to another employee while watching football. The place is dirty. He was touching blinds and tables and then going in touching tomatoes on pizza. Gross. The health dept needs to make an unexpected visit.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-17", "description": "I would give this place NEGATIVE FIVE STARS if it was possible!!! The taste and quality of the pizza was the worst that I've ever had!!! I spent $31.10 for the smallest and tasteless pizza ever!!! And on top of that, the idiots who work here waited until AFTER they brought over my husband's pizza to tell me that they didn't have the fish and chips that I ordered. Why the hell did they wait until then to tell me that?!?! How did they not know way before then that they were out??? They should've been notified by the cooks right when my order was put in. So after they brought my husband's pizza 15-20 minutes after being ordered, a tiny pizza that barely feeds one, they ask me if I'd like to order something else. Yeah right! Then I'd have to wait ANOTHER 15-20 minutes, which by then my husband would be done with eating his food already, which I'd have to end up eating alone and making him wait for me to finish, so I said forget it. We pretty much ended up sharing this stupid tiny pizza and still felt starved afterwards. Do yourself a favor and skip this place when you're in SF. We were better off eating at In N Out instead. Oh yeah, their pizzas are also soaked in grease and falls apart when we pick it up to eat. You can't even eat it properly.", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "I don't know why the low rating, but I figure it's because SF tends to have really high expectations from their restaurants. Anyway, pizza was pretty darn good, but then I was also pretty darn hungry. \n\nIt was good.  I'd go again.", "author": "Mayraa E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "Just had the spaghetti and ceasar salad.  Hands down the worst meal I have had on vacation.  I had to go to another pizza place to get my son something edible.  Run, don't walk away from this place.  Service was terrible and there is nothing better than picking up your order when the entire staff is eating a meal while you wait to pick up your food.", "author": "Ray J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-16", "description": "Cute small friendly pizza place in touristy Fisherman's Wharf.  It is very family friendly and has reasonable prices.\n\nI split a small 11' veggie pizza with a friend.  The ingredients were fresh and the crust was really exceptional.  The thin crispy crust really made the pizza.  \n\nThe service was quick and friendly.  The restaurant was clean - but because the windows were opened several birds flew inside while we were eating.  This did cause me some concern - but nothing pooped so I'm assuming clean.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-31", "description": "Not sure one can complain when you know walking in you are going to be paying Fisherman's Wharf prices. That still doesn't make my junior pie (no slices offered) with barely there tomato sauce for $11 any better of an experience. I wouldn't mind the cost if there was some effort or art that had gone into the pie, but I was very unimpressed. Not offering an alternative when I asked for no cheese on half was another disappointment. \n\nI should have given my money to someone in need and gotten a slice elsewhere.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "We parked in the Anchorage Plaza garage in the same complex.  \n\nMy main reason to go there was to find a place that was not too crowded that would validate my parking during Fleet Week.   \n\nI was expecting something really mediocre out of this place, located in the tourist trap of Fisherman's Wharf.  Right, something overpriced that would taste like a warmed-over Mama Celeste or Pizza Hut variety.  Although the food was very good (a one-topping mushroom pizza), I'm surprised about the 2.50 sodas with no refill (that's my reason for knocking off a star).  I would go there again if I'm in the area, but truth be known,  I'm more likely to make a trip to North Beach for Italian food.", "author": "Alison .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-14", "description": "they need to shut this place down! the lady was all in my face when she was the one who got my food wrong!! this lady was out of her mind. I will be calling the manger tomorrow!! im so upset with how she treats costumers there was a family that had to bring the cops there when I was eating NOW I SEE WHY please dont eat here!", "author": "Shianne G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-30", "description": "Mediocre pizza and salad.  Very overpriced.  Possibly the worst service I've had.  Please do not waste your time or money here.", "author": "stephanie f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-01", "description": "GarbAAAAge.  This place steals money from tourists.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-25", "description": "Soggy pizzas, slow waitress's, high waiting time, overall.......SUCKS!!!!!!!!\n\nOh, and this place is freakishly overpriced", "author": "A. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-15", "description": "Slow service ruined an otherwise acceptable visit. The waitress never smiled a single time and barely talked to us at all. I wasn't asking for a full conversation but something more than \"what do you want\" and \"here's your check\" would have been nice.\n\nThe other lame thing they do is charge you for each ingredient, even if you split a pizza in half. If you get pepperoni/sausage on one side and beef/mushrooms on the other, that's 4 toppings. Also, some of the toppings counted as two toppings. I'm not sure if we got charged for soda refills but I had a feeling we did.\n\nThe wording on the awning states it's \"San Francisco's Finest Pizza\" - if that's true, I feel bad for the city.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-27", "description": "Wow. How can four people be so slow?  It took 10 minutes for a waitress to show up at our table.  \n\nComing from Chicago, I realized that not ever town has access to good pizza joints like we do, but when you claim to be San Francisco's Finest, you'd think just on principal you'd put together a decent pie.  Alas, such was not the case.  We ordered two pies.  One cheexe, one half sausage half pepperoni.  The best thing is that they were hot.  Really hot.  I think if they would let the darn things rest for a minute the grease would be absorbed.  Taste was okay.  So close to being good.\n\nTwo stars from the boys.  Three stars from the girls.", "author": "Angry A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-01", "description": "Pretty good pizza. Lots of toppings, but the crust could've been a bit crispier. Service was okay.  On the pricy side for pizza.", "author": "Sean T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-11", "description": "I get off work pretty late and I am always hungry when I get off. This time a few of us walked the streets in the Ghiradelli area looking for a place to eat at 11pm on a Wed. This pizza place was the only thing open other than In-N-Out. \n\nLarge pie with pepperoni, italian sausage, mushrooms and onions. GOOD. A little soggy in the middle, but after a few minutes the oils soaked up and it wasn't too soggy. \n\nService was whatever, but maybe it was because it was so late and they were gonna close up. Either way, this is going on my list of neighborhood places to grab a bite, late night.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "Pizza was good, and the wings were delicious.. Our server was very helpful. Only negative was the restroom situation.. They don't have one", "author": "Josh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "Loved it!  Service was excellent and the pizza surprisingly great for a tourist area.  Strong recommendation.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-25", "description": "Pizza was soggy, and overpriced.  The pepperoni was super salty.  $2.50 for a 6oz glass os soda with no free refills!  Stay away from this place.", "author": "Alex V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-25", "description": "First, if I was rating this only on the pizza, I'd give them 4/5. It's pretty good. Good ingredients, fresh taste.\n\nBut here's why I'm giving it a 1:\n\n* Sells \"coke\" in the menu. It's not - it's RC Cola and they charge for refills.\n* Over 10 minutes to process a credit card payment.\n* Waitresses are cooks too. I watched them handle money, then handle food directly. No hand washing.\n* Observed waitress blowing her nose, and then handling food. No hand washing.\n* Observed cook touching customer's food, licking his finger, then touching the food again (cutting a pizza.)\n* Service is really really... really... slow.\n\nSo, if you can get over the ick factor of those issues, give the pizza a try.", "author": "Kale R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-25", "description": "I don't really get the terrible reviews here... perhaps it was because I was one of the only 8 customers in the whole place when I visited, but I got good, friendly service, a decent pie and a good salad. I definitely found the prices to be a bit high, but after having grabbed a slice at Pizza Zone earlier that afternoon, I was glad to pay for something that didn't make me want to die. Minus 2 stars for (again) the high prices, and charging for soda refills.", "author": "Mindy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-02", "description": "We thought this place would be great but soon after we got our pizza it looked and tasted horrible. Half of it was watery and soaked up as if they dipped it in water and brought it to us.", "author": "A P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-01", "description": "The service here was not good and the pizza is nothing truly special...it got 2 stars from me because when I ate the pizza I was drunk and I liked it....but if I was sober I think it would have been another story.", "author": "Amiee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "OMG I FUCKING LURVE THIS PLADCE :-)!!!!!!!!!!!!!  THE PIZZA IS THE BEST IN ALL OF CALI420!!!!  THE BLONDE WAITRESS IS A LITTLE SLO!!!!!!!\n\nalso i love the Caesar salad. hail Caesar!", "author": "zac m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-10", "description": "Pricey & greasy.  Friendly service.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-25", "description": "My husband and I came here on a late Friday night while touring SF.  We were craving pizza and this place was close to our hotel. Their specialty pizzas were pretty pricey for what it was but we went ahead and ordered the Fog City Special. The pizza was not OK. It had very small pieces of clam and a handful of shrimp. The crust was nothing special. The only flavor that came out of this pizza was the italian seasoning that they used on the pizza. I probably wouldn't recommend this place.", "author": "Pugsly W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-02", "description": "2 Stars is generous - 1-1/2 would be about right. We had meatball sandwiches there on the recommendation of the hotel concierge. Food was barely acceptable and the service was marginal. Almost $30 for 2 sandwiches and 2 drinks is way too much for what you get.\n\nNuff said - too many good places to eat in this town to bother with this one.", "author": "Alan N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-21", "description": "No ice with the iced tea, service was crappy, pizza was crappier.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-29", "description": "Unfortunately we ended up here on our first night in San Francisco. Good news is that it could only get better. The table was sticky and felt dirty. Pizza was undercooked; it might have been fine pizza if the crust wasn't \"soggy\".  Our order took forever to arrive, then it was partially incorrect so some of us ate and some of us waited for our meal. Had to get up and ask for the check. Looked understaffed. Service was slow and servers were apathetic.", "author": "Beth S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-20", "description": "i visited thisplace on saturday May 18, 2013 and the service was horrible.  It was my wife, my in laws, and my dughter of 13, daughter of 10 and my 10 month old baby. They counted my 10 month old baby as a person and charged me $15 as service charge for a party of 7.  I argued with the asian young lady about this and she did not even care.  I advised her that my son does not eat pizza or pasta at his age and she could care less.  To be honest, this service, thise fraud ruined my evening and trip.  I have been upset about this and i will file a complaint with consumer affairs.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-05", "description": "overpriced average pizza i work nearby and decided to try it. $29.00 for a large vegetarian pizza which was very average (soggy). no pizazz. the service was super bad too. she was as slow as a snail to bring the beers. i asked twice and the total wait time was 15 minutes. save your money and go across the street to pizza zone.", "author": "S. G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-26", "description": "Expensive pizza, taste ok at very best. No bathroom, you have to leave the store, walk down the street to use a very dirty restroom.  Look somewhere else for food.", "author": "Gary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "Typical pizzeria. The pizza is certainly above average, but not great.\n\nConsidering what you get, Fisherman's Pizzeria is a bit higher priced when compared to other pizza restaurants. Nonetheless, the pizza is above average. The hot wings are good as well.\n\nService is okay. On one visit, we waited about 30 minutes for the pizza to arrive.\n\nFurther, on my most recent visit, I was nearly given the wrong type of pizza.", "author": "A B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "After walking around the block looking for a nice place to eat that was playing the Shark's game, I found this little place conveniently right next to my hotel. They were playing the Duck's game (BOOO!!!) and they were in OT, so I asked a patron and they said that they'd play the Sharks after. I ran up to my hotel room to shower and came running back! The game wasn't on so I asked if they could turn it on. Everyone was super friendly and really helpful! Sadly DirectTV was being a butt and the game wouldn't play. But I was really moved with their sympathy! I ordered the Hot Fisherman's Special Sandwich with no tomatoes and onions. My food didn't take long to make and trust me, it didn't take long for me to devour this baby up! I was so stuffed that I couldn't even eat the bag of chips it came with. I wish I knew they vouched for the parking garage next door because I parked across the street! Boo me! It was a great night with great food and a great game! GO SHARKS! xoxo!", "author": "Crystal V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "This place was great. We were staying two blocks away and wanted good, quick pizza. The calamari was huge, the pizza was delicious, and the staff was really friendly. We fed two adults and three kids for about $50, compared to $250 at the other restaurants close by. It's not fancy, but the pizza was delicious.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "Wow, I'm surprised there are such low reviews on this place. Gotta boost up the ratings here a little. The pizzas here tastes great. You must eat it fresh right when they bring it out the oven and right after they cut it or else it will get soggy. The cheese is all melted and when you take a bite and pull the slice away, the cheese wll be stringy.  The crust taste great too. Sauce isn't too saucy. Fresh tasting ingredients. All in all, GREAT pizza. Service usually depends on who you get. Bathrooms are kinda far. I honestly think this place has the best pizza in S.F. I would give it a 5 star but its kinda pricey for pizza, service is alright but sometimes slow and not too friendly.", "author": "Vinh T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-31", "description": "It might not be fair to give a poor review for something best known for pizza and not ordering pizza. I ordered the meatball sandwich. It was difficult to eat. Meatballs were huge, but tasted bad. They tasted more like meatloaf than meatballs. The sauce was decent but a bit on the spicy side. I was also dissapointed when I saw there was no cheese! It came with chips, but it was the tiniest bag of chips I've ever seen. Overall very disapointed and should have ordered the pizza.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-11", "description": "Decent pizza. Warm, welcome environment, however it is way overpriced and the service isn't outstanding. They charge you extra for everything under the sun including topping, refills, exc. It seems like all they care about is nickle and dimeing you rather than providing you with good customer service and outstanding pizza. So if you're worried about spending a lot, I advise you to not come here. I most likely will not be returning.", "author": "Kerry Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-31", "description": "I know this is pizza we're talking about and you really can't go wrong with pizza, but I gotta say this place did! By far the worst pizza place I've been to of all time!!! The service, well lets just say they did the minimum they needed to do, I'll just leave it at that.  The place wasn't very clean looking at all, the only reason we stopped here cause we were starving and my kids had to have pizza.  Well the pizza was horrid, the crust was krispy, for the first 5 minutes, then completely soggy.  I'm pretty sure the pizza sauce was either powdered tomato with water or just a regular can of tomato sauce, because it had to flavor what so ever and it was literally watered down and that just killed it for me! I don't know how this place is still in business!!! Stay away from here!! Did I mention how way over priced this place is, save your money and go to Little Caesar's!!!", "author": "Phil A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-23", "description": "FOOD, C-\n-Pizza was nothing special.  We had onion rings and garlic bread too, as with the pizza, these were both nothing to write home about.\n-They do have a couple of decent craft brews on draft.  Plus, for that.\n\nSERVICE, D-\n-Was actually shocked how bad the service was.  Both waitresses didn't seem to care about any customers, or what was going on.  Two tables hadn't been bussed before we got there, and by the time we left they still hadn't been bussed.\n\nPRICE, D-\n-$60 w/o tip for a large pie, two aps, and four beers.\n\nOVERALL, D+\n-Would I go here again? No.  \n-Nothing at all stands out about this place.  Beer was served in plastic mugs, there is no bathroom in the restaurant (its outside, and down the block), the chairs sucked, the food wasn't too good, the waitstaff was terrible, and it was fairly expensive.", "author": "Blake T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-10", "description": "Me and my friends came here for a late dinner one night because we were toolazy to walk anywhere else (we were staying at the Marriott Courtyard on the same black). The pizza was kind of heavy and not very good but I didn't really have the highest expectations going into a place called the \"Fisherman's Pizzeria\" anyway. Service was kind of flighty which was bad cause we were the only people in there. Also the bill was pretty high, 1 small and 1 medium pizzas with a few toppings, 2 sodas and a beer set me back almost $50.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-03", "description": "For quite some time, I was convinced that a great crust and the right tomato sauce could carry any pizza, no matter how dismal the toppings. As it turns out, I was wrong :( I ordered a pepperoni & ground beef pizza at Fisherman's and it was strangely tasteless. My friend and I concluded that the problem was likely the cheap, unsalted mozzarella.  It's too bad.. with the super friendly staff, great crust/tomato sauce and in-house espresso machine, this could have been a neighborhood favorite.", "author": "Chrissy Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-10", "description": "Today we drove an hour to stop here to eat pizza on the way to a museum.  We asked for a quarter of it to be pepperoni for our son and they said sure.  The pizza was under cooked and most of it was pepperoni on it. The server asked if it was okay and said they could remake it which we agreed to that. The server talked to the cook who was watching football at the time since we were the only people in there at noon.  He argued with the server  loudly about how he wasn't going to do it.  We decided to leave and pay for drinks.  We make a remark about why we were leaving and the cook just arged and when I made a comment the gentleman rudely told me that he was talking to my husband and he wouldn't look at me and from his comment and his mannerism it was telling he wouldn't because I was a female.  Never been so insulted by a anyone.  He didn't care and funny thing is they didn't care that they were empty at noon on a busy weekend.   We have loved this place in the past but I will not go back of this guy is working but looking at the reviews I don't think they care.  Best advice go across the street to the pizza by slice.  Very good service", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-29", "description": "Not even worth a star....worst place ever! We were hoping to get slices and turns out they don't serve them. So, we ordered a small cheese for the kids, and a meatball sandwich for me and my husband to split. OMG! The meatball sandwich was open faced..no cheese..and omg the GARLIC!! I almost threw up!! My husband and I kept trying to eat it only because we were STARVING! Wish we hadn't....made us so sick for the next 2 days! Throwing up....both ends...ick!! While we were there, we had asked for refills on our soda ($2.50 each for a sm/med size cup). I stood up at the front for at least 5 minutes while being overlooked on purpose. Then one of the ladies took my cups from me..and then came back and said \"our menu states its $1 extra for refills\" Um..I just paid $10 for 4 drinks....and you're going to charge me another $1 each for refills??? I walked away with my drinks pissed off....like ARE YOU KIDDING? the lady came and took my drinks back from me!!! Didn't even give me a chance to try to pay for them....I ran up to her and said FUCKIN WORST SERVICE EVER!!!!!!!!!!!! LOL! I was so livid!! Never again..in fact I'm trying to get my money back for the whole deal. They won't answer the phone though, so I have to call my bank and deal with this. DO NOT GO THERE!! RIP OFF!!!", "author": "chelsea e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-31", "description": "Good pizza place to hang out at if you happen to be in the Marina District.  It's got pretty good prices with a decent pizza.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-20", "description": "I have NEVER EVER not given a tip before... This was my first time.  This was the worst waitress ever.  And dirtiest place. She never smiled, never checked on us and when we asked for some water, it had a small fly in it and was extremely foggy.  The waitress was eating behind the counter and licking her fingers and then she and the cook were touching money and then not washing their hands.  The trash was overflowing and food all over the floor and they were all playfully arguing over who was going to have to dump it.  The pizza was so greasy we had to blot it like 10 times in order to eat it.  When we asked for a to-go box, she brought a clear plastic container that looked like it had spit in it.  The 2 waitresses and the cook were laughing and joking around and never once even after I raised my hand finally for service did they even acknowledge us.  It was unbelievable.  And to top it off our table wobbled the entire time like it was off balance and our drinks kept spilling.  So we had to hold the table in a certain spot the whole time.  We couldn't wait to get out of there.  Steer clear!", "author": "Meesh D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-22", "description": "What a dump.  Health services should shut these people down.  After we ordered, we noticed the cooks just chucking garbage near the can on the floor.  The tables and floor were covered with trash and food remnants.  We were charged a fortune for a 12\" pizza that sat there getting cold while we waited for the staff to figure out it was sitting there.  When we complained about it being cold, no one really spoke English - so good luck with that.  Overall, a dirty place with bad food, rude/bad service.  DON'T eat there.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-06", "description": "Well, I guess I should preface with the fact that I'm 32 years old, have traveled stateside and abroad multiple times and have never in my \"relatively\" short life ever ever - seen a rodent scurrying past my feet in ANY sort of food related establishment...um, up until tonight that is! That being said, I can't actually rate this particular establishment in regards to it's food per se as I spent roughly 8 minutes inside before leaving nauseous...I was only 2 sips into my chardonnay when our disgusting lil Ratatouille made his guest appearance...barreling down the the edge of the wall which unfortunately was the same edge of the wall our booth was backed up against...after my husband alerted me to the situation by calmly screaming we proceeded to explain our hasty departure to the waitress who shrugged her shoulders with indifference and poorly pretended to look just a teeny tiny bit surprised...hmmm...if I could give this negative stars I would...in one word - FILTHY!!!", "author": "Ashley E."}
