{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "This is how you know this is a good pace: Every time I come here, I wonder why other food courts across the country are not like this. What's not to like about authentic Poke, giant kimbop, and Beard Papas green tea cream puff?!  Sure, I may have Asian food bias but still, when a food court is not just all about the Sbarros, Cinnabon, and Panda Express, it's definitely refreshing. . With plenty of seating and \"exotic\" food options, this place never disappoints.", "author": "George W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "One of the better food courts with several good choices. Conveniently located right by the BART entrance.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-18", "description": "Not a single garbage can?  What the f?  I'm sorry to start my review this way but I have two kids and we have garbage.  There wasn't a single garbage can to be found.\n\nI think you just leave your trash on a random table and someone is hired to come around and pick it up.  These said cleaning people walk around with giant carts for picking up the garbage and the random plates and they separate it all to be thrown away or recycled.  These carts are pretty big and they do not care if they are in the way of moving people traffic at all.\n\nAnother thing about this food hub, there really isn't that much to choose from.  We walked around twice and finally decided on the lobster place but we really didn't even want that.\n\nI think Ill go exploring other options when we visit again.", "author": "Ivy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "No frills food court at westfield center in sfo. Lots of choices from pastas, steaks, japanese, curries etc...\n\nI had the 2 item combo of beef rendang and lemon grass chicken...you het a bowl.with generous serving of beef chunks in malaysian curry and a large piece.of chicken ...forgot to take a pict as i was hungry...for a guy..i couldnt even finish all..so ordered a side.of rice and shared with my wife...such good value for $. Kids had the pasta and chiecken terriyaki on rice....all were tasty and portions were big. \n\nHappy eating!!", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-16", "description": "Some of the places are OK and others have really become bad due to recent changes. Now that the whole food court switched from actual silverware to plastic knives and forks eating at some locations makes it really difficult. Have you ever tried to eat a steak with plastic utensils? \n\nThey replaced the glassware to plastic cups too. So I guess cut the staffing to less than half. Less than half means fewer people to clean the tables and wipe things clean.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-24", "description": "Okay..so you're in the City... on a Friday or Saturday night... and you don't have dinner reservations. You and your date or group can't decide if you want steak, pasta, Thai food, vegan, Mongolian barbecue, Brazilian, puff pastries, American, or a fancy grocery buffet... Well, the Westfield Food Court is the place to go. This is not your ordinary food court. There is ample comfortable seating amidst barriers and plants that make the seating options more intimate, workers with caddies that go through and clean up vacant tables, and crappy wi-fi--so you will be forced to enjoy the company your with or people watch. \n\nAffordable, convenient, and no reservations needed. Definitely my kind of place.", "author": "Tashara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "We're not in the suburbs and usually got better things to do than hanging out at the mall but if there is some shopping that needs to be done, Westfield SF is a great place to do so.\n\nMake sure to visit the food court - great variety of food counters (Korean BBQ, Sushi, Burger, Sandwiches, Mexican, Thai, Italian...). I tried out the Thai food over there as well as the Mexican - both decent choices.\n\nFor \"Andale\", the Mexican counter: sure, you'll get better and more authentic food in the Mission, and they should have said somewhere that the burrito they serve is actually a \"wet burrito\". But nevertheless, decent and filling food.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Note: this is not a review of any of the restaurants, just the food court in general.  Due to traffic, we were late getting to the city for our pre-play dinner.  In this case, the food court was perfect.  It's right across the street from the Powell Bart and has a variety of restaurants.  It was great, because now we really couldn't decide on something we both wanted.  It's a bit rambling, so don't think the restaurants are only what you can see - go around the next corner.  They have a good selection: Buckhorn Grill, vegan, SF Soup Co, Panda, sandwiches, Chipotle, ice cream, etc.  We were there about 6:00 on a Tuesday, and there was plenty of seating.  Tables were fairly clean and there is wi-fi available.", "author": "Lydia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "It's a food court, for sure.  But it's a food court with a huge selection that will please everyone in your group; whether they are craving sushi, steak, mac and cheese, or veggie entrees.  This is one of the cheapest places to get a meal in the City  My daughter and I have been here many times and usually manage to get the both of us full for under $20!\n\nCrowded on the weekends with both tourists and locals, the food emporium has a large enough seating area that you can almost always find a table.    It's pretty clean most of the time, especially when you consider the high foot traffic and its' proximity to BART.  \n\nIf you don't want to sit down and eat, a good choice is Bristol Farms market, which has a great selection of healthier foods and prepared dishes, such as pizza and sandwiches.  Very fairly priced for SF.\n\nMy favorite places: Pasta Moto (great pizza, spaghetti, roast veggies, and salads plus specialty items)  Buckhorn Grill (try the tri-tip salad for lunch- awesome and filling.)", "author": "Tammy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "This shopping center has great shops & food restaurants, I can just recommend it \n\nIt's on a big shopping street, you can't not see it", "author": "Franzi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Super cool shopping center! Very unique and different from all of there other shopping centers I have been to over the years. Got tons of different levels to go to and some stores I haven't seen or been to before. They are even setting up the Christina's decorations already.", "author": "Magz K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-03", "description": "Absolutely average. Nothing different than any food emporium I've seen all over the united states. Yeah - so it is big. But it is big with average places to eat. I would have liked to have seen something different than \"everything else\" - just doubled or tripled because of size...\n\nbut not so much.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-23", "description": "I love lobster. But who ever came up with this, and again I say \" l Iove lobster\", but don't eat here. If you don't execute lobster right, don't serve it to the public....The Lobster sandwich spot in the Westfield. \n\nThe sandwich was so tiny. The roll was miniature. the $16 it cost pays for the 1/2 cup of lobster meat shoved in the small roll. Don't know who their lobster purveyor is, they need to switch that up! Go back east, these sandwiches are normal size sandwiches. I have had larger lobster rolls in New England than this franchise Lobster chain. \n\nToday experience: Most of my lobster was rubbery and stringy. I believe the lobster pieces come in a cry-o-vac bag, the meat was overcooked. The Lobster Mac and cheese had no flavor, the sauce was oily and not cheesy at all. All together=$30 disappointment. Don't believe the hype of this place.", "author": "Kitty L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-03", "description": "I go to the Westfield Mall one or two times a week. Unfortunately, the basement food court is just average. Recently, two of the food venues have closed. Of course, they needed to close because they were serving crappy food. I expect \"Lobster Me\" will be next to close up.\n\nIt would be nice to see some classier food venues downstairs. I'd love to see an In-N- Out  Burger there. They'd probably put every other food venue in the court out of business, lol. \n\nAs it stands now, Sarabol and Buckhorn will be the only two remaining when the smoke clears.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "I love this mall. This is co. Information from a guy who's used to going to hilltop mall growing up so yeah there's my comparison. The only problem for me as a male is and not surprisingly the mall is catered majority towards women but hey the food selection is pretty good", "author": "Leel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "I remember when the food court here was just the Nordstrom side of the mall. Ever since the Bloomingdale's side opened, the food court has gotten more and more varied. I do love that as I adore having options. Working downtown, I make the occasional stop here to run errands and grab lunch.\n\nOn the Nordstrom side, I've tried both Ajisen ramen and Napoleon macarons. Ajisen is a good option for quick ramen. Not as good as some of the ramen shops in the area, but if I don't want to wait forever for a table, Ajisen fulfills that ramen craving. Napoleon's macarons have great flavor, but I found them lacking in texture. More soft and cakey instead of having a slight chew.\n\nOn the Bloomingdale's side, I've actually tried more restaurants than places in the food court. Bristol farms is a nice option when you just want a variety of hot food. Kind of like a buffet. I've been known to grab a mishmosh of things (such as pizza, poki, etc) and bring them home for dinner. Recently, I tried Lobster me. Though it underwhelmed me, I was happy there was a lobster option in the mall.\n\nThere are so many restaurants in the food court. I'm surprised I haven't tried more places. After writing this review, I think I may make more trips to the Food Emporium.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Food Emporium! That's just about right. \n\nI don't think any other mall can claim to have a full-scale supermarket in its food court. Yeah, Westfield SF is that cool. \n\nSpanning all food groups and personal preferences, if you can't find something to munch on here, well then you just aren't even trying. \n\n-Soup, sammies, salads\n-Sushi\n-All veg\n- Fast foody Asian (aka the dark ages of mall food courts with only super dry chicken....jk)\n- (myfave) DavidsTea slightly off center\n-Dessert - options! Cupcakes, chocolate, and ice cream galore\n-Bristol Farms (full-scale supermarket)\n\nMy brain hurts from trying to remember all the options. Did that answer the question for all the things i missed?\n\nIn fact, the food court probably offers more variety than the actual mall. Shopping? Meh. Food shopping? Okay!", "author": "Libby J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "You're not in San Francisco to go to the mall. But sometimes you need some shopping to be done, and this place has a lot of stores. Also, it's sometimes nice to be in a modern environment in a very \"classically styled\" city, and this fits the bill.\n\nLots of options here, bigger than your standard mall food court. Multicultural too, which you don't get everywhere.\n\nYou could do worse.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "I love this mall simply because it is THE center mall for San Francisco, where you can enjoy walking around, shopping, eating at the best mall food court, meet up easily with friends or family and basically enjoy a great day to hangout!\n\nI feel like you can find anything here - from clothing, shoes, accessories, name brands, furnishings and more!  This Westfield mall has everything - even coffee and a food market to keep you energized and productive if you are going to be here for the entire day, literally!\n\nOn top of that, the top level of this grand mall is elaborate with its intricate rooftop architecture as well as themed celebratory events - such as holidays when you can just feel the warmth and festivity!\n\nThis mall is and will be a classic place for entertainment and a delight for a shopping experience in San Francisco!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "I cannot find where to voice a proper complaint to Westfield itself so I'll share here. I saw a woman that worked at the Charley's subs come out of the bathroom stall, still buttoning her pants, with her apron on, fixed her hair and left without washing her hands D: \n\nEw.", "author": "Antoinette J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "Located at the concourse level is the Westfield San Francisco Food Centre Food Emporium.  There's a large selection of food choices ranging from Korean, Japanese, Chinese, American, Thai, Mediterranean, Brazilian, Italian, sandwiches, soups, juices, pretzels, coffees and teas, and desserts, such as cupcakes and cream puffs.  You can also get hot food as Bristol Farms.\n\nThere is a large seating section in the center where you can park and enjoy your food. During the peak hours of lunch and dinner, it can be a challenge to get a table. There's free w-fi too.\n\nA good pit stop for a food break while shopping in the San Francisco Centre or the area.", "author": "Al L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-08", "description": "Surprisingly, there are quite a few good selections for dinner and dessert.  My favorites include black bean noodles at Sorabol, Beard Papa cream puffs, and honey frozen yogurt at Yoppi.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Wow...if malls near me had these type of food options then I would go to the mall more often. Pasta, lobster rolls and Brasil grill...plus numerous other options. The food court area is rather clean too - I was bringing a tray in when the nicest guy takes it from me with a smile.", "author": "Mikhail H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-11", "description": "To be honest, if it wasn't for Loving Hut being located here, I'd probably never eat here.\n\nI've tried a bunch of places here, and they are all just \"ok.\"\n\nI mean, I get it. It's a \"Food Emporium.\" They have more classier fast-casual food. No McD's, Chipotle, Burger King, or Taco Bell here.\n\nInstead, I bought a burger from \"Burger Bistro\" that charged me $10 and the quality was dry and full of iceberg lettuce.\nI bought a burrito from that fancy Mexican place, and it was bland.\nI bought Thai from that Thai place with the super long line, but it was oily.\n\nSo yes, \"Emporium\" is a nice word, but it's still mediocre quality.\nExcept Loving Hut. Their food tastes amazing every single time. I may be biased because I'm vegan, but I see a lot of meat eaters buying food from here and their eyes kinda light up as they're surprised at how good the quality is.\n\nThere seems to be a lot of seating, and it really should be. But if you come here between 12-1pm, good luck. Not a table in sight.\n\nIt's also a nice touch for the workers to go around and bus/wipe down tables.\n\nFor a tourist, it must be a breath of fresh air to have a group of friends and family who are hungry and don't have time/money/patience for a full service restaurant. That way, there's an option for everyone in the group and it's quick and affordable.", "author": "Lanie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-09", "description": "We visited Westfield Mall in SF and dined at Buckhorn Grill for a quick lunch last Sunday. Regardless about the foods, the charges automatically included an3% S/F EMP MADATE without permission. We could have refused the charge but we chose not since this would be our the last visit.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "Westfield doesn't just have many \"name\" merchants., nevertheless, food quality here is superior to most courts. any one can find something they like. no need to dine in only one eatery\n\nfavs:\n-beard papa cream puffs\n-Ajisen amen\n-vegan hut\n-seafood place, nice fish & chip\n-Bristol bay\n-Chipotle, fallback if i can't decide\n-out the door? never went\n-M. Y. China\" ? never went\n-japanese snacks. interesting, didn't stay long\n-Sorabol korean cuisine.\n-froyo, gelato, artisan coffees nearby.\n\ndrawback:\n-lack of seating during peak hours in the food court.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "This is an ever changing place. It seems that every time I walk through the bottom level of the Westfield Center, usually on my way to the Powell BART station, something is new here. \n\nLots of choices, though, no matter what you might want to eat. I highly recommend this food court, at the far east end of the mall, when you are with a group of people who cannot make up their minds as to what to eat. Everyone will find something to make them happy.", "author": "Delaine Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "My hotel was next to Westfield Mall (Hotel Zetta San Francisco). I came to Westfield San Francisco Centre Food Emporium numerous times during my stay in San Francisco. I'm not a big food court fan but Westfield San Francisco Centre Food Emporium is the exception.This food court has a variety of food options for customers. You will find fast food to quality meals. There are desserts options as well like Beard Papa's. The dining area is huge with plenty of seats (well maintained). Westfield San Francisco Centre Food Emporiumis a good place to fulfill your hunger in Union Square. I give Westfield San Francisco Centre Food Emporium a 4.5 rating.", "author": "Dominic B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "I'll start off by saying that the 5 stars are not for the food. Most of the food is 3-3.5 stars and simply good for mall food. But the 5 stars are for the huge variety, the ease of eating here, the simplicity it might provide for groups of tourists needing an inexpensive meal in an expensive city, and for overall nice ambiance. This is not your typical food court. \n\nI ordered the taco plate from the mexican restaurant and a draft Pyramid Beer. The food was tasty and almost too much for me to eat. The tacos were loaded with meat, guacamole($1 extra), mexican cream, salsa, lettuce, and cheese. The pork was flavorable, the chicken not quite as much. Total for the beer and meal was ~$17\n\nMy wife had some kind of soy nuggets and sweet potato fries from a vegetairan place and said it was delicious. It was somewhere around $7-8.\n\nI believe there were about 15 different food stands. If I were to return, I'd try Buckhorn or the lobster place. \n\nI liked it here and if you are in a group with a variety of tastes and don't want to break the bank, I really recommend this location.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "This is one of the biggest malls I've ever been to. I seriously can't tell where it ends, lol. It all connects.\n\nI really like that sushi place that's in the food court though. There's so many restaurants in there, all different types of food.\n\nThere are a lot of stores to shop as well. I'm usually distracted by all the food so I haven't really bought anything else, lol.", "author": "Yee W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-05", "description": "Coriander Thai has decided to up the prices they charge at registers without updating the prices they show their customers. \n\nAs soon as you get through the register and your meal is magically bumped up a few dollars they pull the \"next person please\" and bank on heavy lunch traffic to keep people from noticing. \n\nSketchy practice of secretly bumping prices means you end up paying $13-$14 for you-pick-a-scoop meal without a drink. \n\nIf you're paying Caviar/Fastbite or Bento delivery prices you'd may as well get the food quality, value and convenience of delivery. \n\nIf you're in a hurry and need a tasty lunch at the Westfield food court you're better off hitting the Korean spot which has just as many options and better business practices.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "This review is for Westfield's food court, located on the lower level of the mall (floor LC).  It's nice, convenient, and very popular.  The food is decent, the restaurant selection is good, and the dining area has a cool, stylish design.  It's one of the nicer mall food courts I've been to in the States.  There's also free Wi-Fi, which works OK.\n\nThe only real downside I see to this food court is its small space.  It's often cramped and crowded with tiny, packed tables and long lines at many of the restaurants.  Sometimes, you're lucky to find an open seat.  Then again, it's not like the mall has much room to work with.\n\nSome highlights include:\n\nKichi Grill - Japanese soba noodles, gyoza potstickers, sushi rolls\nLoving Hut - vegan food\nGodiva Chocolatier Express - picturesque stand\nBuckhorn Grill - delicious tri-tip steak, sandwiches, salads\nSorabol - fast casual Korean BBQ, noodle soups\nAmoura - Mediterranean shawarmas, falafels, gyros\nCoriander - Thai food\nCako - cupcakes\n\nThere are a few more restaurants located on the other end of the floor including chains like Sarku, Chipotle, and Panda Express, and Ajisen Ramen from Japan.  I think it's hard to go wrong with most of the restaurants.\n\nOne thing about this food court which makes it different from other food courts is you don't have to clear your table when you're finished eating.  Food court staff promptly clear and clean tables once customers are done.\n\nOverall, Westfield's food court is another nice American mall food court.  I give it 3.5 stars rounded up to 4 because of its unique chic and modern look.  If you don't mind crowds, it's a neat place to check out.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "It's so overwhelming! So many food choices. Good stop by if you're shopping around the union square area with a group of indecisive people. Everyone can go pick what they want.", "author": "Cindy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-22", "description": "I'm not a huge fan of malls, particularly the food courts with their Sbarros, Panda Express, and Great Steak and Potato Companies. Westfield does the food court right with a small dose of bigger chains (they do have a Panda) and plenty of smaller, more unique places like Loving Hut Vegan Cafe. It's also well maintained; clean and brightly lit. \n\nI'm afraid to let the secret out, but if you're looking for food while attending a conference at Moscone, this place can't be beat. It's close enough to duck out and back in a hour, but far enough to skirt the long lines in the immediate vicinity; even at huge conferences. It's packed with enough variety that you could return multiple days in a row and not eat the same thing. \n\nWell done Westfield, well done.", "author": "Mary T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": "What a joke.  They do not have the contact number for Wood Stop, a kiosk vendor located in the mall.  This vendor does not have a website and no other way to reach them.  It seems like in the modern world this type of thing is mandatory to be a vendor at a major shopping center.  As the person who I spoke to on the phone at Westfield said \"we are waiting for them to provide contact info\".  Pretty lame.  Pretty shady.", "author": "Moody G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Phenomenal food court! It has a variety of foods to choose from! There's Mediterranean, Korean, Japanese, Chinese, Thai, American, etc!! As big as the food court seating area is, it can be difficult to find a seat since this place can get super busy & crowded! \nI went to Sorabol to get the 2-item combo (beef short rib/galbi) which came with rice, kimchi, broccoli & japchae, totaling $12.95 (w/o tax). \nI ordered the tofu Stew on the side, which although tasted great, was too pricy ($5/small cup). \nHowever, from what I ordered, the food was phenomenal. It was surprisingly comparable to other regular Korean restaurants.  Of course since it was a food court vendor, there were no banchans, and the tofu Stew was way overpriced for its portion. It was about $20 total for my meal. \nAt this price, I would have rather just gone to an actual Korean restaurant and gotten the extra perks (banchans, bigger portions).\nHowever, the food emporium is still a great place to stop by if you are in the area, so I do recommend checking this place out. The atmosphere is very lively and food selection is fantastic!", "author": "Hu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Westfield San Francisco's Food Emporium is delicious!! One of the nicest food courts I have ever been to like other Westfield food courts! Has high quality food, different cuisines, artesian pastries, gelato, crepes, and more! There's a Häagen-Dazs next to it, a farmer's market grocery store right across from it! They even have a Godiva chocolate bar! Such a great food court with something for everyone! :)", "author": "Busayo O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "Corriander:\n\nSweet Thai Basil Chicken. \n\nNuff said.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "This is like the Creme de la Creme of shopping mall Food Courts. Perfect for San Francisco, where shoppers usually consider themselves foodies, locals and tourists alike. This is a good place to bring your cousin from Lodi and impress her with SF's city cool style, even in food courts! Of course, it is not hard to impress her if all she is used to is shopping in Stockton or Tracy. \n\nThis is on the concourse level of the Westfield Mall, or as most people know it, the Nordstrom Mall. Westfield Mall's are all over the world, and it is actually a huge Australian outfit that owns Westfield Valley Fair in San Jose, Westfield in Culver City, and a bunch more in the US, Australia, the UK, and other hotspots. \n\nCalling it the Food Emporium is a bit of an homage to the old Emporium, the 'Big E\", which for decades was a downtown SF department store fixture, and a regional chain with stores on the SF Peninsula. It was afflliated with the sister chains of Capwell's in the east bay, Weinstock's in Sacramento, and Broadway's in SoCal. The Big E in San Francisco had it's famous Dome, and basement specials, and had a Notions department. The entire chain was bought out and by Federated I think, and maybe parts were sold off to Macy's. \n\nI digress, but the name Emporium has a soft spot in many old San Franciscans' heart and wallet. So The Food Emporium name provides either some instant comfort, or confusion to the Westfield Mall shopper, depending on their senility. \n\nThe Big E was never this nice. The Food Emporium is nothing like your standard Food Court. It is closer to Macy's Cellar, but with many different food concessions. The decor is upscale, to match that unique circular Escalator this mall is known for, which really impresses those relatives from Lodi, or Manteca, or Modesto. \n\nThere are modern chandeliers, colorful decor, rich textures and better than Ikea furniture in the Food Emporium. And you can find better than Sbarro's TCBY, Annie's Pretzel's, and Cinnabon food sources here. Like Pete's Coffee (better than Starbucks) and Melt, for Gelato and Crepes, and many more lunch and dinner eateries. \n\nSo when in-laws from the great San Joaquin Valley come into town to visit, wow them with shopping and the upscale escalator in the Westfield Mall, and impress them with the fancy Food Emporium, and you will avoid having to take them to an expensive, real SF restaurant.", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-25", "description": "Really good selection for a food court! I'm talking thai, wraps, soups, burgers, burritos, different kinds of sweets, and stuff I'm sure I didn't even notice.\n\nI'm used to getting variety at a food court, but usually at crappy chains- think Taco Bell-style food. The selection of restaurants here is more focused on quality, and if you don't happen to find exactly what you want, or if what you want is a little more healthy- BAM! Bristol Farms is adjacent to the food court and has everything to meet those needs, too.\n\nAnd the food court isn't the only food options for this mall, either- there are a lot of sit-down restaurants sprinkled around, too, including M.Y. China right down the hall.", "author": "Stefany V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "If you want something decent to good to eat fast & cheap, this is the place.  The only thing I do not like is there are really not many open seating.  There are only a few seats for each vendor and even if it's open, you will not be able to sit there unless you buy their food.", "author": "Judy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "It blows my mind that this is a FOOD COURT IN A MALL.\n\nComing from the East Bay, I'm used to pieces of shit such as New Park Mall, Southland, or the slightly better but still awful Great Mall. As a major foodie stepping into Westfield's Food Emporium, it's like stepping into heaven on Earth.\n\nLocation:\nIt's inside Westfield Shopping Centre on the lower floor. It's pretty huge so you can't miss it.\n\nVariety:\nThere aren't stupid Hot Dog on a Stick takeaways here. The food here is GOOD. You have...\n\n~ Steaks\n~ Korean BBQ\n~ Japanese\n~ Vegetarian/Vegan\n~ Desserts\n~ Italian\n\nand anything else your little food-craving self can dream of. Even if you're one of the world's most pickiest eaters like me, you're guaranteed to find a delicious spot to dig in.\n\nMy recommendations:\n~ Buckhorn Grill for some delicious medium-rare tri-tip steaks.\n~ Melt for some of the best crepes you'll ever have.\n~ Beard Papa's for some yummy and simple cream puffs.\n\nNOTES:\n~ One downside of this food court is that it's extremely popular so beware. If you're with a large group, it could be difficult to nab seats.", "author": "Clarissa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Japanese cuisine is of course very tasty and the bar his high for any establishment. Kichi Grill gets a star for location(in the mall downtown),accessibility,customer service,time to for food all add up to a plus. But what about the food? I ordered the grill rice salmon bowl-wow! The rice was super delicious,i had only expected average. the vegetables perfectly cooked,and the salmon grilled to perfection. It was moist,tender,and tasty. I can't wait to try some more of their dishes.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "The edible variety that exists inside this MALL of all places serves up some tasty bites.  The selection ranges from over-priced to over-priced with quality food to back it up.  Bristol Farms has a nice selection if you only shop at Whole Foods and need some change in your daily routine.  The food is made fresh daily and options are bountiful. Corriandor Thai has to serve some of the best take-out available, while burger joints and burritos lie just footsteps away.\n\nGrab a spoonful of gelato on your way out and make sure to hit up the chocolate kiosk for a small sample that will keep you coming back for more.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-28", "description": "I love the food court for the variety of choices. \n\nThis review received a 1 star rating for safety and security issue.  My bag was stolen here.\n\nYesterday, while sitting on a bar stool in the food court, at the counter to the right of restaurant Andale, my computer bag was stolen. I hung my bag on the stool while eating. I was lucky to note a movement of my chair,  turned around, noted my bag was gone. \n\nHopped off the bar stool immediately and saw a woman walking off with my bag.  I ran after her and grabbed my bag back. She acted surprised, dropped my bag and walked away. This incident stunned me and others who were sharing the counter with me.\n\nI reported the incident to the Westfield security.  Lady next to me who worked at one of the stores in the mall, said customers go their phone stolen while they put them on the counter to look at merchandise, thief just cased the place, ran in grab the phone and ran out. \n\nPlease be very careful with purses, bags, phones while eating in that food court.", "author": "Linh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Great mall. I like the food court in here. There is a good variety of choices, many of them are a bit upscale for a food court. Seating can be tricky, but its do-able. There is also a wide variety of shopping choices. It is pretty clean and doesn't smell too terrible (in SF this is always a factor to consider).", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "I must say, I do quite enjoy the Westfield Mall here in downtown San Francisco. Located right above the Powell Street BART Station. It's very easy to get to!\n\nPlan to spend at least a few hours here, especially if you like shopping!", "author": "Charles K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "i like the Thai fast food place here.\nI forget the name, but it has been there for years now.\nFor mall food, it's excellent.\nLast time I was in SFO, I ate at the Thai place three nights in a row; that's how much I like it.", "author": "Harry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "Good food options packed into a convenient location right under the mall.\n\nGrowing up in the bay area, I was kind of spoiled until I went out of state. There aren't a lot of malls with food options as good as the ones here.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-25", "description": "As far as mall food go this place is pretty good. Prices are fairly high for the amount of food given. Probably varies from vendor to vendor. Try the Thai place and the pasta and buckhorn. \n\nThere is one place though you need to stay away from.  Andale!  Ordered the nachos. It sounded good on the menu but boy was it far from it. The guacamole and the sour creme was good as well as the salsa but the cheese, chips and meat was horrible. The meat, we got the steak was burnt, hard and dry. The cheese was melted together, not liquid like. Since they put it in the oven, the chips were burnt. I think someone forgot about it. Believe me the chef doesn't really know nachos. For 10.75, go somewhere else. Should have take a picture and returned it. Garbage.", "author": "Christian S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-23", "description": "Great food selection but generally an unpleasant dining experience. Vagrants taking food scraps from tables. Panhandlers begging  4 money. Filthiest public bathroom in California.", "author": "scott h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-14", "description": "After arriving hungover and hungry, my friend picked me up from SFO and immediately said, \"lets go eat at Westfield food court.\" \n\nI said: \"Food court? I don't want no cheap taco bell or McDonalds....I can get that in Vegas!\"\n\nAnd he said, \"Trust me!\"\n\nSo who was I to complain...I was the tourist!\n\nHe. Did. Not. Let. Me. Down!\n\n\nThis place is a gourmet food court on acid!\n- Fancy Korean bbq, like that of restaurants in Hawaii. \n- Beard Papa's cream puffs, which I've only seen in Hawaii and Japan. \n- They even have a grocery store in there called Bristol Farms.\n\n\nThose workers in the mall and Downtown SF are eating like kings and queens with a food court like this in the area!", "author": "Laurie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "I don't know what it is but something about food courts just makes me hungry. You know you aren't here for quality, you are here for affordability, choice and costco style free samples on toothpicks. \n\nThis food court has a lot of unique qualities.\n- Takes up pretty much all of the bottom level of one of the most unique Westfield malls. \n- Prime location right off market street\n- Bart has an entrance to it\n- Super market in a food court, not sure who does their grocery shopping here but I would be interested to see that demographic\n\nSome of my favorite vendors:\n- Sarku Japan\n- Ajisen Ramen\n- Buckhorn Grill\n- Pretzels (Wetzels or Annies)", "author": "Luke O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "There are so many choices at this place that it's no wonder that so many of my co-workers eat here often.  Corriander is my favorite - green chicken curry and noodles.  Bristol Farms has a great deal on Monday's for a prime rib or carved turkey sandwich.  Buckhorn Grill has huge salads.  The Korean and vegan place both have great soups for a cold day.  The only one I don't recommend is the mexican place.  Great food court.  Just avoid at lunch on days there is a big conference in the area.", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Visited this food court for the first time and was impressed.  I had Andale Mexican food. I had the Andale Burrito.  Excellent! It was very fresh and the steak was so tender!  I wish they had this restaurant in the South Bay!", "author": "Erika P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Andales is the bomb! Everything I tried on the menu was very good and full of flavor. I really like the presentation of the food. I would choose Andeles over Chipotle anyday. One of my favorite places to eat. The cooks seem to care about how the food actualy looks and taste. Thumbs up. Shout out to Mercedes your cool! And Im not just saying that cause your name is the same as a luxury car lol Thanks for serving me.", "author": "Todd M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "They have a huge variety of cuisine for every whim. Love to splurge and all in a few steps.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "This is a nice food court, lots of options....with some relatively \"high end/fancy\" options.  It's also right next to a Bristol farm so you can get food from their salad/hot foods bar too.  \n\nReminds me of the food court at Century City mall", "author": "Ben Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "NICEEEEEE food court.  One of the better ones that i've been in.  Their food court is huge.  It almost takes up the whole floor.  There are almost 30 individual booths? Stalls? that are in this food court.\n\nThere's something for everyone.  Even you picky people.\n\nIt took us about 10 minutes to walk around the whole food court in order to see everything they had to offer... before finally deciding on what we wanted.\n\nThe Thai food from Coriander Gourmet Thai was good.  Lots of variety in their menu.\nhttp://www.yelp.com/biz/coriander-gourmet-thai-san-francisco\n\nFrank M. went with Buckhorn Grill and LOooOoveeedd the plate he ordered.  Sorry Hun, they're only located in N. Cali. :(\nhttp://www.yelp.com/biz/buckhorn-grill-san-francisco-2\n\nI went with Kichi Grill and got their two item combo.  I liked it! Although.. yes.. this place would qualify as typical mall food. :P\nhttp://www.yelp.com/biz/kichi-grill-san-francisco", "author": "Emily S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-21", "description": "Out of all the years I've eaten here I felt compelled to write a review now because I experienced a less-than good lunch here today. I started patronizing this location since it's opening in the food court at the glorious Westfield Mall. It used to be a destination lunch spot for me because of the huge quantity of food, and the good quality. Well, the quality has certainly declined over the past several months but today really grossed me out. I had the Panang Beef Curry with white rice and Pad Thai. The beef was cubed and tasted old and dry. The curry sauce was ok but missing that distinctly nutty taste I look forward to with panang. The pad thai was gross. The sauce was obviously burned as it tasted bitter and the noodles were extra chewy. Yum, just what I wanted on my lunch hour -- old beef and rubber bands. I won't be returning to this establishment.", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-07", "description": "Why I can see people liking this place:\n\n-- the variety of nouveau stands: they have aren't your typical mall food stands (although I don't see anything wrong with a Great Steak and Fry once in awhile).\n-- the people watching is more fun out here\n\nWhy I don't get it:\n\n-- why it gets really crowded: does everyone who works in the mall eat here?\n-- why the samples from Buckhorn Grill taste better than the lunch I just bought?\n-- why this place is so highly reviewed?\n\n\nConclusion:\n\nIt's a food court folks.  I don't care how hard you try to dress it up.  At best the food is good but when you take into account how much you've paid for it, then it becomes a rip off.  For the price you're paying, you could go to an actually restaurant.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "My Plate:  Korean BBQ \nWeff's Plate:  Nutella Crepe \nCA's Plate:  Tri-Tip & a smoothie\nJammer's Plate:  Shrimp Tacos & a Negro Modela     \n\n...and that's what I love about this place:  Everyone's really happy 'cause everyone is eating exactly what they want.  In fact, the only conflict here is between the side of me that wants Korean BBQ and the side that wants a gigantic fajita salad.    \n\nAs food courts go, this is as good as they get.  It's an excellent place to watch people, watch food, and watch people eating food.  \n\nYou're in the City, you're well fed, and multiple floors of shopping await you.  Be still my beating heart.  I love this place.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "It's a food court but it's still a great place to stop for a meal.  Great selection, good food, nice dining area, but loud and crowded during peak hours.  \n\nIs it better than going to a restaurant?  Hell no, but it's a FOOD COURT so stop complaining.  Is this the best food court I've seen?  Probably, so 5 stars is what I'm giving it and you'll accept it and like it.", "author": "Mark J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "This is an amazing food court~~ I have eaten here many times, and tried the yummy gelato, ate the Thai food, and even one day ordered a rip-off salad : /  They have a Peet's coffee which brews really fresh coffee!  (according to my Aunt; as we got coffee later in the day at another Peet's location and she was disappointed at the UN-FRESHNESS).\n\nSurprisingly, well maybe not so surprisingly because this \"Food Emporium\" is so busy.  I was scanning the seating area for wall chargers but didn't find any.  If they did have some, it'd turn into some sort of coffee shop with people there ALL DAY.  They don't always have samples, you might just have to get lucky.\n\nThe food here somewhat reminds me of a medium priced restaurant.. you can get a yummy meal for ~$10 and refill your glass multiples times with water.  And they have plenty of people to clean the tables and clear your dishes once you're done.  They're really speedy about that. \n\nThis used to be my favorite food court ever until I moved to LA-- even though it is still pretty high on my list.\n\nIt's SF.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "This place has been lovingly called my other dining room as it has saved me in my most hungry hour and was on my way between destinations... it's so convenient! Not to mention caters to nearly everyone. It even has a Sur La Table store to inspire you to cook your own food if you happen to visit the pricey Bristol Farms, also in the food court.\n\nMinus one star for it being crowded, having spotty wifi, and the homeless folks coming in and asking for money or food.", "author": "Bobby M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "I really like this place. So many food options and good food. In spite of the fact that this is a food court, you can get a really good quality food here. It's a nicely designed place, in a beautiful shopping center,  great place if you don't want to spend a lot of money at the surrounding restaurants.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-12", "description": "Initially I wanted to give a 3.5 star... but it wont let me, so a 3 star it is.\n\nThere's no question about the variety of food they have here. I'm especially impressed at the info structure of this massive place itself and the convenience of places to go to before, during, or after dinner. The quality of food may be debatably to some, but I find it 'okay' because its edible and its a quick alternative than going to a fancy  5 star restaurant, or if your if your in a laid back mood ( students, families, tourist alike, etc.) It does get full, especially on weekends, but what I like are the staff there who clean and clear out your table once your done eating (Thank you so much!)\n\nI see this as a place to hang out and chill with friends. Yes, this place is very popular due to the malls and movie theaters floors above (Not to mention a booth to charge your phones and other electronic devices if you cannot find an outlet). The themed holidays are always a plus too! Once in a while they have live entertainment, such as Lion dancing. \n\nFlashback: (Shopping around, hears loud sound like music and drums) Me: \"What is that?\" (turns around looks below the level floors) see's Lion dancers around main floor Me: (ecstatic and excited) omg so cool! :D (Take's out phone to record and take pictures", "author": "Stephany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-07", "description": "Definitely one of the best food courts I've seen but it of course still maintains a bunch of mainstream joints. Some mainstream to SF, some mainstream in general. I can't lie, I visit daily because I work across the street.\n\nDon't judge me...", "author": "Diego A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-24", "description": "\"But of course\" they couldn't call this a \"food court\", cos it really is a \"Food Emporium\". Great variety of cuisine, and generally good quality. I thought I was not a fan of malls and definitely not a fan of \"food courts\". The Westfield has bent my mind. \n\nWhile not a \"destination\" meal place, it is a super  nice complement to the stores (Nordstrom & Bloomingdales ... what other stores would you need?.) AND the theaters which are awesome ( Metreon up the street is withering - I think Target or some other discounter is taking the large space on the ground level).....ahhh but if you look closely it is another Westfield property.\n\nOk, so on with the food favorites @ the Food Emporium:\n\nBuckhorn Grill: Think roast beef. Get a plate or sandwich. Big Buck (dump the horse radish sauce on it) is a favorite with the string onion fries. \n\nBeard Papa: Can't  resist a cream puff (nuff said)\n\nBristal Farms: deli has a good variety of hot food & cold food to take to the table. Hot food is good, although I do question how long those veggies have been under the heat lamp\n\nThai: (named something like Coriander) have had their noodles ... not bad but not great. Remember we are in a mall. So, if your in the mood for a little Thai .... get in line\n\nItalian: (something like Pasta Moto or Mojo), surprisingly good for this type of joint. I think their pasta is all imported. They cook it correctly & sauces are tasty\n\nThey have lots of roaming service people cleaning tables.  It is a bustling environment and great to have the \"people watching\" entertainment  while dining. The food selection & people watching is like the United Nations. Really 3 stars on average for the food stalls, 4 stars for the variety of joints & cleanliness. Ok, well and 5 stars to witness the mall dining crowd.... priceless.", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "i gotta say one of the best food courts in a mall ever.  hands down.  sorabol and beard papa are the tops! also got vegan and japanese and mediterranean and italian and bbq and soup and salad. you name it and it has it.  not just like panda express or burger king.  top notch places.  i come here just for the food sometimes! great that bart stops right here too. free water everywhere and you just leave your stuff on the table.  someone will pick it up.  such great service.  gets crowded though so try to steal some tables early.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "Love this place very clean, food are awesome, lots of shops to look at and buy, have free WiFi and comfortable seatings. Just hate it when security aren't around when crimes or robbery are in progress, also security don't do anything when homeless are in the mall.", "author": "C T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-10", "description": "This place has a variety of places to eat. But most of the food is overpriced. Many long lines. Hard to find a table to sit at. Your food on your tray gets cold before you find a table. Bristol Farms is like the only place to get good priced food. The food court at the Stones Town mall is better.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-14", "description": "I don't like the sarku japan in Westfield they give you small servings not like other branches where they have a full to go box filled with food.. I still love their teriyaki chicken and the shrimp it's just too little of a serving for $8.99.. Their restaurants is a little bit messy when it's lunch time they don't have time to check if the tables were clean", "author": "Kathzell M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "Where else can you go to ONE location and have a billion restaurants surrounding you? \n\nat the Westfield in SF.\n\nThere's everything from Bear Papas to Thai food to Fish and Chips.  And if you don't want anything to eat and you just want a snack or a drink, there's a BRISTOL FARMS.  \n\nNever have I been to a mall and seen a high end grocery store.  It was pretty awesome.  This is the place to go if you're hungry and you have no idea what the hell it is that you want to consume.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-08", "description": "OH MY GOODNESS! Talk about a food overload!\n\nThe food court at The San Francisco Centre is amazing. There are tons of different options and something for everybody, even the pickiest eater.\n\nPrices are reasonable, though some places are cheaper than others, and some places give you more food for your buck.\n\nMy favorites are:\nCoriander - Thai food\nSorabol - Korean BBQ\nBistro Burger - burgers and fries\nBuckhorn Grill - burgers, salads, sandwiches, BBQ\nSan Francisco Soup Company - pretty self explanatory ;)\nCatch Isle - seafood\n\nFor more \"sit-down\" places, I LOVE the Nordstrom Cafe on the 4th floor and also STRAITS restuarant  - great for HH and sharing small plates.\n\nIt can get insanely crowded and there's no \"good\" time to go so just bear with the crowds and happy eating!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-08", "description": "Okay, I admit this is the best food court I've probably ever been to. But still...it's too pricey for a meal while I'm shopping. I'm already spending so much on clothes...why spend so much extra on food too?\n\nBut if I were to choose my favorite restaurant out of this bunch, it would be the Thai place! I like their curry..it's super filling. Oh yeah, the Korean place is also not bad. They give pretty big portions, and it tastes pretty legit. \n\nI also like beard papa's, and gelato. Too bad they closed the tea place that was here...it was good!", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "About the most gourmet and expensive food court I have ever witnessed, and you pay more than an average food court as well.\n\nI like:\n-Lots of options\n-Friendly service\n-Convenient location\n\nI do not like:\n-Loud\n-Can be dirty.  Seems they could use more bussing\n-I have been solicited by bums while sitting and eating, but to their credit, the mall staff came by and made the bum give my friend back her money and apologize\n\nthe options seem to change rather often as restaurants go out of business and are replaced.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-07", "description": "So I used to think was the greatest upscale mall food court of all time.  Until last week I would have mentioned about all the great food selections; Buckhorn Grill, Bistro Burger, Andale, Haagen Dazs, etc... \n\nHere's my experience:\n\nLast week I noticed cockroach walking on my tray...WHILE I WAS EATING! Eww.. This is unacceptable for a hole-in-the-wall in the T-Loin and especially unacceptable at the Westfield San Francisco Centre. I was enjoying an excellent Bistro Burger at the former Asqew Grill location.  The initial reaction was shock followed by disgust.  Haven't been back since!\n\nI took a couple low-quality photos using my phone (and posted them on Yelp in the photos section).\n\nBefore mentioning any of this on Yelp, I email mall management as I wanted them to be aware of the situation and provide an opportunity to respond. They're unedited response: \n\"Thank you for taking the time to write about your negative experience as it is crucial we receive this type of feedback in order to keep the center at its best for our patrons. I have forwarded this information\nonto our Operations Manager who will handle the situation immediately.\"\n\nI have no clue what \"immediate\" response was taken, but I hope the mall maintains a minimum sanitary standard as one would expect for an upscale San Francisco tourist destination.\n\nIn all fairness, I would rate four/five stars if not for this one-time experience. I'll surely be back, but only after I give the Operations Manager sufficient time to immediately handle the situation.", "author": "Nathan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-23", "description": "This is not your typical food court at the mall. Westfield may have fine dining on its top most floor, but I'd rather eat here as there are plenty of options to choose from for everyone from meat lovers, to seafood lovers, and even a vegan option. I prefer eating at either Buckhorn (they serve tri-tip sandwiches which I absolutely love) or Catch Isle ($6.50 for 3 Piece Fish & Chips). If I wanted a deli-style sandwich, I'll go to Bristol Farms. If I wanted a snack, I'll buy some fries at Calbee. Plenty of desert options too from Beard Papa and gelato to Häagen-Dazs. Definitely the best mall food court in San Francisco and possibly the entire Bay Area.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "The Westfield San Francisco Centre Food Emporium reminded me of the food court inside of  the Santa Monica mall. Unlike many other malls in the United States, these food courts offer a variety of gourmet food at reasonable prices. (Although some restaurants are a bit overpriced)\n\nMy boyfriend and I were going to try Burger Bar inside of the Westfield Mall but did not have enough time to eat there before our movie. We decided to eat in the Food Emporium and had a great time dining there. \n\nI ordered the Korean BBQ short ribs from Sorabol and he ordered some $5.00 fish and chips. Both of our dishes were delicious.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "In this food court, I've tried Buckhorn Grill, Coriander Gourmet Thai, Kichi Grill, Beard Papa Sweets Cafe, San Francisco Soup Company, and\nSorabol Korean BBQ & Asian Noodles. They're are so many to choose from and I like that they're better than your ordinary eateries in typical food courts.\n\nThis place is convenient because they have a mixture of all different kinds of gourmet food! Thai, Italian, American, they have it all! It's super busy on the weekends but the weekdays, it's easier to find seats. \n\nThe great thing is that all eateries use silverware and china. No paper plates or plastic folks around here. They always have workers bussing tables so you won't have to. \n\nNot everyone knows this unless you frequent the restrooms here but they have sinks outside of the restrooms, yes sinks! I was amazed too when I first saw it 'cause I didn't want to wait in line just to wash my hands after I ate. The wash area is always clean and they even have an sinks for kids. When my boyfriend and I were done eating our food, he was amazed too, lol.\n\nThe food here is really good though but one must try it. I'll keep it to the Emporium only since there's separate business reviews for the eateries.\n\nHappy dining!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-06", "description": "Ate sushi at Westfield mall in San Francisco. Rice was still warm so assume that they rolled it after I ordered it. Two rolls cut into eight pieces. Looked like real crab in calif roll. Rice did not look like Japanese round grain. Inside mall in basement so you can get here via BART Powell Station", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-30", "description": "I love eating here! There isn't that many restaurants in the heart of downtown in my opinion. I love eating here because you can get the non-typical mall food. Well you can if you walk over to the old mall side. When I think of mall food I think of snacks not a good quality meal but you can get it here. \n\nThis place gives off a more upscale feeling. There is so many to choose from! I should be more adventurous though. I usually order from the Korean place. There isn't that many Korean places in town. I don't think there is any near downtown SF. \n\nThey also have Thai, Italian, Japanese, burgers, steaks, etc.\n\nThere is a lot of seating also but I am giving them 4 stars because at times it gets sooo crowded its hard to find seats and the lazy leave your food at the table when you are done thing cause there isn't that many garbage cans around. They hire people to take your trash. \n\nO there is a Bristol Farms there for anyone who needs to do grocery shopping... Weird... I know.. I like browsing and looking at some of the ridiculously priced things they sell.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-26", "description": "OK, I've added a star because it certainly has a few better choices than the food court at Stonestown or Tanforan, but besides 'Out the Door' most of the food seems uneventful and overpriced, plus, you have to scout out a table holding a tray and the atmosphere sucks.  \nAnd you still have to go inside the Mall to get there.  Anywhere else, please.", "author": "Rob B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "This is where I get dragged because my friend adores the muscles and fries a restaurant here makes.\n\nThey're her addiction.\n\nAnd I don't argue least I get teeth marks in my arm.\n\nSo I searched vainly for either Dim Sum or Sushi. And didn't find either. I did however find a Thai place and ordered the cashew chicken and pad thai.\n\nI must tell you, they were delicious. Rivaled Osha on Union, they did. And *cough* for around half the price.\n\nI went and picked up some fruit from Bristol and I was set. Thanks Westfield.", "author": "Meg T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-05", "description": "High-end shopping center food courts such as this one are fairly common in other parts of the world (a couple that I've been to in Sydney and in Singapore immediately come to mind), but other than this one I don't recall having seen any in California.  \n\nI've only eaten at the Japanese and Korean stores here (if I don't include Beard Papa and Pete's), and I can honestly say that they're as as good as any reasonably priced Japanese or Korean restaurants I've been to in the Bay Area.  Given the shortage of truly decent food options in this touristy part of town, and the number of times I've found myself in the area and completely famished, I'm quite thankful this emporium exists.", "author": "Zain K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "Maybe on of the most eclectic food courts in a mall I've encountered. Not counting the Mall of America which is the size of corporation headquarters, this place has many ethnicities, high brow, low brow, quick and sitdown. The tri tip at Buckhorn, the puffs at Beard Papa, and the Seafood at Catch are alone enough to have a decent meal, but there's tons of other things that I would try and then other I wouldn't touch with your ten foot pole. Again, something for everyone...", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "This mall is beautiful and huge! I love this place =)", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-14", "description": "Unlike any other mall food court in the States. That I've been to. In my head the Mall of America, which has a roller coaster inside, probably has a kicking food court. But that may be just in my head.\n\nThere are not only vegan choices (Loving Hut) that distinguish this food court from your typical mall food court filled with sbarro/mcdonald's/taco bell/chinese fast food options, but they serve with real china and silverware for environmental reasons. Staff is always floating around to bus your dishes and keep the place neat and clean. There are no harsh florescent lights giving everyone a ghastly pallor. Instead, the soothing decor and lighting almost invokes zen. In a mall food court, I know! \n\nFood vendors are also located in the middle of the seating areas, creating a nice flow and separation. But it does make it hard to avoid temptations when two of them are Beard Papa and Gelato stands. We failed miserably to resist Beard Papa. Trying to hold a meeting at a table next to Beard Papa as they crank out fresh and delicious pastries is not a good idea. But man, caving in to that can hardly be considered a weakness... right?\n\nFor the most part, prices are fine. $10 avg pp will get you a hearty meal.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-04", "description": "This is my favorite Friday night out place w my husband. we love coming here to see a movie at a century theater, grab a bite at a food court downstairs or if we have more time- at one of the restaurants on the third floor. You can also do some shopping in between, or walk around this beautiful mall. Sometimes we can grab some truffles in one of the chocolatiers, or an ice cream, or a smoothy.... You can find everythingunder one roof here and have a great night out.", "author": "Diana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "This mall houses quite possibly the best food court I have ever seen in a mall.  You could have something different every day for two weeks and probably still have options left.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "I always visit this place in the \"Emporium Basement\" as we used to call it. My favorite is Sorabel, the portions are huge enough for two people to eat. Love the Korean dishes and noodles! I'm only in San Francisco once a year but I never miss it!", "author": "Rob G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "Probably one of the best food courts, huge selection and many different ethnic foods. You also got your healthy and your comfort, your made to order and your pre-made. You may also drink in the food court, and when you are done you leave your mess!!!!", "author": "Tim V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "As far as food courts go, Westfield's food court is a pretty good one. You get the usual overpriced mall food but the court is large and has a good variety of eateries.\n\nWhat puts this at four stars is all the free samples! I repeat free samples!\n\n+ Buckhorn Grill's free tri-tip steak sample. Chomp! Delicious!\n+ Jody Maroni's free samples of sausages! Chomp! Chomp! Chomp! Delicious!\n+ Free crepe sample... chomp!\n+ Free chicken teriyaki sample... chomp!\n+ Free Korean sample... chomp!\n\nDo you really still need to buy something after making a round? I'll let your tummy decide.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "Great mall if your looking for anything. They have the upper end items and the lower end items for everyone who visits. Their food court isn't all that great, not many options that appealed to me.", "author": "Kia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "Definitely, the nicest food court that I've ever been to in my life, life, life....\nToo hard to pick what kind of food I wanted but settled on Hana..... (forgot the entire name).  Some good shrimp tempura with rice and veggies - $9.99.  And what surprised me is that they serve their food in actual dishes, not some styrofoam or paper product.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-31", "description": "Really bad the service, very expensive! No friendly!!!\n\nI asked them question and they were rude answering! No friendly, very demanding.\n\nSushi bad.", "author": "Mauro P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Great place to grab a meal anytime during the day.  They have so many options to choose from that anyone can find something they like/want.  Personally I prefer Charlie's or Andele.  Andele has really good Mexican food (and not fast food type Mexican).  Charlie's is like a Great Steak Escape and offers a wide range of delicious sandwiches.  Prices are a bit high but normal for SF.  Great dining option in Downtown SF.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-01", "description": "As far as a food court goes, this is as good as it gets. I worked a conference this week, and a bunch of out-of-towners asked me for suggestions on good places to eat & quite frankly, I think the SF Center Food Court is the best option. Union Square isn't known to be a location for good, casual dining - it's filled with tourist-trap restaurants. NO ONE from SF actually eats at those restaurants unless it's the high high end ones. As far as walk-in casual dining, definitely not. I would frequent the food court when I worked at the mall, but by no means did I ever complain about having to be subjected to \"mall food\" because let me tell you - SF mall food is not your typical mall food. I would suggest:\n\n*Beard Papa's cookie crunch cream puff with vanilla bean custard\n*Amoura's pesto pasta salad\n*Melt's gelato (strawberry, pistachio, & cookies-and-cream flavors in particular) -- the best gelato I've ever had\n*Buckhorn's tri-tip steak sandwich \n*Sobabol's Korean BBQ ribs & clear noodles\n\nI heard the Vietnamese food at \"Out The Door\" is great too, but I've personally never been. \n\nNo plastic forks or paper plates at this food court. Nope - real silverware and nice plates to go with it. Leave your tray at the tables and the nice staff will come and clear them away for you. This is a great food court that can accomodate your cravings - no matter what they are.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-09", "description": "This food court is nuts. It has EVERY type of cuisine known to mankind on top of the \"straight to my hips\" desserts. Higher end restaurants. No McDonald's or Panda Express (which can be found at the other end of the mall) but places like Andale and Beard Papa. MmMmMm...\n\nEverything looks so elegant. No need to bus your own table as there is a waiter-type staff who stand around ready to pounce on your utensils once you leave. Very professional, very friendly, and I appreciate what they do.\n\nThe first time there, I saw people bring their own wine, pop it open, and sit in their small tables. I wasn't sure if I should have held a tray with my food piled on top in fear that I was looking bad or not elegant enough. Should have worn my prom dress.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "This is the nicest food court I have been to. No matter what restaurant you get food from, it feels clean! I don't know of any other malls that can pull that off.\n\nI've been to a 4 or 5 restaurants in there, but my favorite dish is from the Mexican food place, Andale, their shrimp nachos are awesome. The rolled tacos from there are really good too, but the place is a bit pricey. Bistro burger has great burgers too, and of course you have to try a crepe from Melt...", "author": "Brandon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "I'm a fan. \n\nThe reason I like this place is because it's right next to a huge parking lot. Everything is easy to get to. I can park and then walk across the street and it's Westfield Food Court. \n\nIt's one of the better food courts that's available in San Francisco. Lots of selection and has 2 coffee shops (starbucks and peets).", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-01", "description": "Upscale design on the inside. The food courts were nothing cheap. It was about $10 for a plate of fried prawns and french fries at one place - which were quite good, actually. \n\nFriend noted that their bathrooms - architecturally speaking - are very upscale.\n\nThis is someplace that I wouldn't mind taking some out-of-towners if we were already in the mall and hungry for food. Dinner would still be in the Mission, though.\n\nThe only reason this is 3 stars instead of 4 is the price.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-05", "description": "Skip Amoura.  The sandwich I had was mostly bread and tasteless.  In addition, the prices were high.  $11 for sandwich and drink only.", "author": "Djl D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "When you step inside this food court, your eyes wander everywhere! Where do you start?  Ahhhhhh...Free tasting samples! \n\nChomp..Chomp...Nom..Om...Om....!!\n\nYour eyes and stomach are telling you to get this or that...no...wait...how about... that looks good...wait...I see....Cream puffs (*drool), pizza, Korean BBQ, sandwiches, burritos, pasta, tri-tip, gelato, crepes, salad, hot dog, smoothies, and more and more....(*double drool*) \n\nThis food court is a great place to grab yummy and affordable food if you have no idea what you want, but you have so many choices to choose from all the varieties.  \n\nEnjoy eating and sampling those yummy bites!", "author": "Deborah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "Compared to most other malls I've been to, the Powell St. Mall seems to have much better food at its food court. I've been to Coriander Thai a couple times - and it's impressive for being semi-fast food. And the cheese and bacon-bit fries at Charley's are mouth-watering. Other restaurants include San Francisco Soup Company (bread bowls! although you could go to Boudin's at Fisherman's Wharf nearby for something even better), Sorabol Korean BBQ (pretty standard), a mediterranean restaurant, an american-style burger and sandwich restaurant, and even a vegan restaurant. There's a Bristol Farms inside the mall next to the food court as well. Although it gets very crowded, it's definitely worth checking out.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "By far, thee best FoodCourt around.  Picture all your favorite sit down restaurants, minus the waiter and cheaper!  You even still get real plates and silverware!\n\nYou won't find any Hot Dog on Sticks or Sbarros here!\n\nMy favorite is Sorabol Korean BBQ and Teazme :)", "author": "Earlene C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-12", "description": "Well, what can you say? This is straight out of an episode of \"Extreme Food Court Makeovers.\" Beard Papa, Askew Grill, Bistro Burger, Buckhorn Grill, etc. Lots of options, something for everyone, and it ain't fast food.\n\nSo why only two stars? Well, although the food has potential, the food court itself is the perfect setting for someone to get something stolen, which is exactly what happened to a friend of mine the other day. Though it probably wasn't a good idea to hang her purse from the back of her chair, whoever did it had no regard for the four people at the table, as well as the hundreds of people that were around us. Hey, I should give them credit, no one noticed a thing. Some kind of inside job, perhaps? I guess desperate times call for desperate measures, and I understand folks gotta survive by any means necessary, but I would hate to go back to see some other would-be thief try to take it up a notch. \n\nThanks, but no thanks.", "author": "Jack D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-11", "description": "the workers of westfield mall need clean up the trash when people finish eating, were talking about pile of pile of tray of left over food from customer... saw some tray sitting on tables for 20 minutes plus until some notice or no westfield people can be found. FAIL!", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-28", "description": "A great place to shop and hangout. The food court has great choices along with a Jamba Juice. Bloomingdale and Nordstorm for high end window shopping. There is also great mother's room in Nordstorm to tend to babies.", "author": "Gopi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "As a yelper I love food and hearing the word \"Food Court\" may sound like a negative connotation because I associate that with cheap fast food chains at the mall. However, going to the Westfield food court in San Francisco will blow you away.\n\nThe food court reminds me of those in Asia that are situated in high end cities and malls and are decorate beautifully. This food court has a modern decor feel with a wide range of quality restaurants serving you dishes in a fast and efficient manner. Almost all of the places serve fine wine to accommodate your meal. They have Korean BBQ, fancy Thai food, Beard Papas, steak places, seafood places, fancy market etc. Unlike other food courts where you need to clean up and place the plates back by the trashcans, they have people come and take your plates for you! The dishes that the places serve you are real forks and knives, no plastic and paper stuff.\n\nI would think this food court is comparable if not better than the one in Century City mall near Beverly Hills.", "author": "Charles P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Coriander Gourmet Thai and San Francisco soup company best places to eat. Order sweet basil chicken, spicy catfish it's great.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "As far as food courts go, it doesn't get much better.  I'd give it 5 stars if they would have had the foresight to build it all the way upstairs under the dome instead of in the basement.  It needs natural light.  Aside from that, if you're hungry for it, you'll find it here.  Great healthy options as well as burgers and BBQ.  Lots of comfortable seating and for as much traffic as this place gets, it's always very clean.  Custodial staff are plentiful clearing and cleaning tables quickly even at peak hours.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-01", "description": "Other than shopping and eating at their food court...The Westfield San Francisco Centre Food Emporium for me is a really neat & very cool place to hang out!!! The one place that, I like the most of all at The Westfield is going to the top floor and to sit down on the chair that they have and to relax and stay away from the busy & noisy streets of Market Street!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-28", "description": "The food court is pretty awesome and will satisfy even the most indecisive person.  Me.  I like how they have a variety of food options and it's not your usual food stands like Panda Express, Sbarro's etc.  Umm...I guess if you're craving that, you can just walk across the way to the SF Centre Food Court. :P\n\nThe dining area is pretty huge and I like how they have counter height seating, which helps if you're a party of one.\n\nOne thing however that I like yet dislike at the same time is that many if not all of the food stands use actual plates and silverware.  Yeah, it's better for the environment, no doubt but, I just hate leaving a tray on the table just for someone else to clean not to mention, trying to find a table or spot and there's a tray with dirty plates on them with nowhere to move them to.\n\nOther than that, it's a great spot!!", "author": "Nick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-11", "description": "A plethora of food to choose from :) I do stop by for the food whenever I have time or whenever I eat out with a friend/s or just me solo. \n\nIt's an upgraded version of food court. They just need extra cleaning crew.\n\nI recommend this one for the food choices :D", "author": "Pierre B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-12", "description": "I went down there once and I was very hungry.  I felt totally claustrophobic and then I saw the name of one restaurant, Beard Papa.  Ok, I think I just lost my appetite.  I felt like I wanted to get the hell out of there.\n\nI'll try to go back again and actually eat something and update my review.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-24", "description": "In general I despise food courts, buffets and chain restaurants.  They always lack originality, any sense of healthiness and are general all the same old shtick.\n\nThis food court however is a lesson in what proper planning and visionary management can do.  Most of the vendors are off shoots of already established local eateries, most of whom are committed to local and sustainable product.  Although sadly the public in general seems clueless to this fact.  The place is perpetually busy which is a compliment to the wide variety of foods (no duplications) and the quality.  None of the places I've tried have been bad.  Some better than others, but taste is subjective.  I also find it quite an achievement there has been little turnover in vendors since its inception.  \n\nKudos to Westfield management for doing something special here.  Now if they could just import that same sensibility into the rest of their malls across the country .... one can hope.", "author": "Russell D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-29", "description": "Best food court ever! The only thing I don't like is how crowded it gets. It's a victim of its own success. I read in some urban planning blogs that the best way to ensure availability of parking is to charge for it. Maybe that's why there is never any seating here... there's no cost to people to sit here.\n\nBeard Papa is so very good. Melt is pretty mediocre gelato. Froots has good smoothies. Bristol Farms has great prepared foods. Coriander, Sorabol, and Asqew Grill have generous portions of restaurant-quality food. What's not to like?\n\nBased on all of the \"don't take your booze past this line\" signs around the food court, I think some of the places even serve beer and wine. And that can only adds to the feeling of dining in an actual restaurant, right?", "author": "Sharon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "In the basement of the Westfield Mall in downtown San Francisco, there is a food court with a number of restaurants providing good quality food at great prices. The Buckhorn Grill is one of these restaurants. It is known for its world famous tri-tip but they also have a number of entree salads that are delicious and very filling. I recently had the Crispy Chicken Avocado and loved it!  The dressing is delicious and the romaine lettuce is crisp. If you want a salad that is filling and fresh, just try one of their 7 entree salads. You will not be disappointed.", "author": "Joanne F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-13", "description": "Yesterday, for the first time, we visited the food court (or Emporium, as they call it rightfully so) @ the Westfield Centre by Market St. We were SO impressed: we expected the traditional franchises yet found none of them (fortunately). There were so many great options to eat that it made it really hard to choose, but we settled on Buckhorn a great place to eat Trip-Tip (Punta Trasera, para los venezolanos) at a \"reasonable\" price. We got a plate with the meat, veggies and a glass of wine for a little over $13.\n\nWe will be coming back: to Buckhorn and the Emporium, in future visits to the city.", "author": "Manny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "So my lunch hour usually goes a little something like this: \n\nWeave through the crowd to seek out the following: A sample of Buckhorn's tri-tip. A sliver of pizza. Teriyaki chicken. And if I'm lucky a crepe sample (my favorite!). \n\nAfter purchasing food, if for some reason the sample person was not there the first time around (most likely to refill their platters), a 2nd attempt would be needed. \n\nYep. It's like going to Costco every day! \n\nOnto the actual review: One of the nicest food courts I've seen so far. Most of them seem more like mini restaurants versus the usual fast food crap you have come to expect. However, that all comes with a price. 4 stars because I'm going broke spending all my money on lunch.", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "Shit this place is always packed especially during lunch hour. Love what everybody has to offer but I do miss Asquew and Tom's cookies. Been meaning to try Papa beards cream puffs", "author": "EmmettsGuRL C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-21", "description": "This is a pretty decent food court especially for a MALL. They have a couple places I like to grub on. Such as Buckhorn Grill Salads, Bristol Farms Soup & Salad, Sorabol for quick already made Korean BBQ, Out The Door for different Asian dishes, and Catch something or another. A seafood place of some sort. I wouldn't probably come here very much if I hadn't worked upstairs in the mall, but the food is decent. While some places are a definitely no go (Mr. Hana) the other places make up for it.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-17", "description": "Best \"food court\" you'll ever find. We got there twice during our weeklong S.F. trip to get a sweet treat (espresso gelato) from Melt was good. My husband liked the cupcakes from Bristol Farms and the cream puffs from Beard Papa. If you're looking for something fun and fancy had to the other end of the Westfield mall and go to the cafe at Nordstorm's and try their Goat Cheese Tart...Yum!", "author": "Carrie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-23", "description": "definitely one of the best food courts to hit. In fact, I cant' think of a better one here in the states. Most of the restaurants are totally different and upscale from the usual.  In other words, you WILL NOT find Sbarro, Burger King, Hot Dog on a Stick, Panda Express nor nameless barely-in-business hoagies here.  Good Riddance. Instead, there are some great high quality ethnic food choices (Thai, Vietnamese, American Grill, etc)  and a couple of excellent dessert snack places (Gelato, Beard Papa) to boot. \n\nIf you are from out of town, say, here for Oracle OpenWorld or any other convention over at Moscone,  this is a great out-of-the-way from the convention place to sneak off to to get a quick bite in between presentations.   Again, it's not the ordinary mall food court, and that's why I like it.    The only food court better than this is the one I experienced in Singapore - but that's a story for another time. =)", "author": "Harry W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-20", "description": "What a shit-show this mall is. I go for the spectacle, which isn't Felliniesque at all. Who are these people? I don't know but I enjoy them. I never see these people anywhere else in the city. The girls here are amazing, -- the greatest knockouts have the most terrible boyfriends I've ever seen. I see girls who look pretty classy arm in arm with these waif-thin, veiny, sallow-skinned punks with the standard unbent baseball cap, jeans around the knees, and UFC shirt XXLarge. Now, teenagers will always dress like assholes and that's fine and how it should be. But teenagers have been dressing like this for 20 fucking years. I want to see this evolve a little. If you're going to sag your pants, why not pioneer something new? I have some ideas. Sure you could increase the sag and drop them around your ankles, -- that's pretty brave. But if you want to take it to the next level, why not try the Ectopic Sag? You take a pantleg and tie it around your shin and just drag the rest of the pants behind you. \n\nNone of this really matters because I missed my own point: these teenagers are in their fucking 30's. \n\nThe guy from Hotchickswithdouchebags.com should assign an intern to camp out here. \n\nLet's look at some positives: this is a hipster-free environment. No irony here. There's no a millimeter of art or self-consciousness to be found inside this space. There's also a kind of game to be made out of dodging the barrage of perfume/cologne sellers and massage therapists. And lastly there's a food court downstairs. \n\nI like Jamba Juice. I like the vegan asian place. There's a nice ramen place too. Panda Express is the Taco Bell of chinese food, which is either an insult or a compliment depending on your tastes. I have little nice to say about Bristol Farms. However, if you're too lazy to scramble some eggs on a Saturday morning and go buy some in a box at Bristol Farms, maybe you should be charged $20. The cheesesteak place tastes good but somehow too rich for my stomach. I really want to like the soup place (it's a chain) but none of the soups do it for me. I've really tried, though. \n\nThere are I think five or six frozen yogurt places throughout the mall and four or five chocolate shops. \n\nThere's a movie theater upstairs. \n\nThere are some restaurants upstairs also but I haven't tried any of them.", "author": "Bill G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "Food emporium sounds very lah dee dah doesn't it? However, let me assure you that this is no ordinary food court.\n\nThere's not a golden arch in sight! Instead, you'll find a variety of eat in or take out options of great quality. I spent an age wandering round Bristol Farms which offers a supermarket as well as ready to eat food.\n\nBeing SF, there are a lot of oriental options with Chinese, Japanese and Korean food represented. There's also Mexican and Italian as well as steak and seafood outlets. To be honest, at lunchtime, you could probably just wander round and fill up on the many free samples being handed out.\n\nIn the end, I settled for a bowl of Korean noodles with assorted BBQ meat and what else for dessert but froyo from Cefiore. I almost succumbed to a Beard Papa pastry to compare it to London but my very full stomach told me to stop!", "author": "Yee Gan O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-15", "description": "Ok, so I hate malls.\n\nBut this one has a nice food court.\n\nSo I hate it a little less.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-09", "description": "OK, should I be embarrassed that I like to spend my Friday nights (and money) at this food court?? \n\nNo, because as the other reviews say, this isn't your typical food court.  I expected the prices to be sky rocketing high, but it is reasonable for the proportions. It's family friendly, hired help cleans up after you, and I love how there are many options and I don't have to drive all over the place (and find parking) to just taste these meals. You will see restaurants such as: \n\nOut the door\nCatch Isle\nCoriander gourmet thai\nPasta moto\nMr Hana\nAndale\n\nAnd my current fav: \nMelt gelato & Crepe Cafe   \n(Who doesn't like crepes?!   The \"street crepe\" + scoop of gelato is my favorite).\n\nAfter a good eat, you can go catch a movie at the movie theatre in the mall, or stroll around the mall and shop.", "author": "KatsuCat D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-16", "description": "Pretty decent food court! Found just what I was craving", "author": "Rosie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-16", "description": "When I first moved here, my man said to me, \"Hey, why don't I take you out to the mall food court?\" I thought we'd reached a new low in our relationship. The words 'MALL....FOOD....COURT\" strung together in a sentence bring to mind thoughts of awkward high school times, greasy fast food, free Chinese chicken samples, and maybe 80s movies..... but not any sort of date-related venture. \n\nWhile you may run into free chicken samples (and quite a few other delicious free nibbles to try), this is not your momma's food court. High end, TONS of options (yes, even for vegetarians like myself)- all of them delicious and for the most part reasonably priced. Bristol Farms is not exactly cheap, but this is the type of market that kind of makes me want to run around, pick up apples and toss them around and sing \"The Hills are Alive\".... or something. Anyway, it's nice. I recommend sandwich counter, pizza, fresh salad, or any of the fresh fruit & veggies.\n\nAs someone who is perpetually changing ingredients on menu items, I am also a huge fan of the SF Soup company's salads- SO MANY great fresh things to shove into, on, around, and generally all over your mixed up greens it could make you satisfied all day. \n\nThere's also a slew of other choices - Mexican, Chinese, Japanese, Crepes... you name it, it's here. Just don't look for McDonald's, cause this place is too good for that.  \n\nAnd while, yes, this is still a food court- I'm not doing a total 180 here claiming they've got white tablecloths and candles- it is a much, much better food court than any other I can remember (save for one in Switzerland.... yes, SWITZERLAND. But they had really good icecream)- good enough even for a date. Well, a lunch date anyway. But not a first date. More of a \"I've known you for ten years and don't really need to impress you anymore\" date.... oh wait, I didn't say that. \n\nGood stuff. Go. Eat. SHOP.", "author": "Kristen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "My absolute favorite is Sorobol's Spicy BBQ chicken with the clear rice noodles. I think its around $9, but the portion size is HUGE. I always have leftovers after leaving here. This is my go to spot when I'm in the city. If you are unsure of what to eat at the mall, ask them for a sample and I can guarantee that you will fall in love with that chicken just as I have.", "author": "Erika L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "This place is absolutely ridiculous. Its a love hate relationship, really. \n\nIts always packed, the employees at the food stands arent the brightest but the variety is amazing and they usually have quite a few sample people out!", "author": "Britney K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-18", "description": "I come here almost everyday since I work only half a block from there.  I love that each place gives out samples.  If I wanted to, i can just do 3 rounds and I am sure I would be full.\n\nHere  is the list of the favorite places:\n\n1) Buckhorn - Salad with beef\n2) Peets - coffee\n3) Bristol Farms - poki salad\n3) Andale - chips and guac\n4) Pasta Moto - salads and roasted veggies\n5) San Francisco Soup Company - salad wraps\n6) Coriander - spring rolls and chicken wings\n7) Out the Door - I like this place, but its rather expensive", "author": "Janet S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-31", "description": "Coming here during the lunch rush on a week day I couldn't help but feel overwhelmed with a sense of deja vu. Where was this odd familiarity coming from? Oh, now I remember. It's like a grown up high school cafeteria. \n\nAmongst all the downtown types there was an air of frenzied eating and social activity before having to head back to the office (chemistry 2.) The cliques were easy enough to spot. There were the ladies of leisure who shop professionally (cheerleaders,) the suits (jocks) talking about how much money (ass) they pull, IT guys (nerds,) high school kids playing hooky trying to look cool (freshmen) and the lonely secretaries eating their lunch in blissful solitude (me.)\n\nThere's a wide variety of watered down, ethnic-type chain restaurants. You can get an $8 Vietnamese sandwich or a $10 burrito. I'm not going to bemoan the fact that most of the food is overpriced in a city that is saturated with great, cheap ethnic restaurants because we are, after all, talking about a mall food court. So, by that standard, this place is pretty fucking swank. All I'm saying is don't expect to find a Panda Express or Hot Dog On a Stick here. If that's what you're looking for, go next door to the old San Francisco Centre, you fucking juvenile. This place is for the big kids.\n\nDespite my less than fond memories of high school I do have to give the Westfield Food Emporium an extra star for the marked absence of wedgies and wet willies being freely and indiscriminately doled out.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-26", "description": "Wanna have a really great laugh here?  Do what I did this past Saturday, 8/25/2007 at 6.17pm.\n\nFirst, gather a small group of friends, two or three should suffice.\n\nNext, go there at a PEAK meal time -- lunch or dinner during the weekend -- and make your way past the screaming babies, portly tourists, and poseur hipsters who think hanging in the food court of the Westfield Mall is the NEW new place to be seen.\n\nAs you are walking through the court -- I chose the spot between Mr. Hana and Bistro Burger, but you may prefer another locale -- scream the following in the most obnoxious, queeny voice you can muster: \n\n\"WHY THE FUCK DID YOU BITCHES BRING ME TO A FOOD COURT?!? I'M A FUCKING ANOREXIC!!!!\"\n\nGood times, good times.", "author": "d s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "I saw a, long light brown-blond-ish hair + face lift, late 30, Asian woman w/ very short & tight light blue vinyl-skirt , red high heel w/bare feet, of course, nice pedicure though, white tank top w/ perfect round cantaloupe like bosom, very skanky lookin',\nshe was sitting right next to ......\na family, 2 babies were crying so hard in a stroller, the pap, about 40, lookin White-male was w/ shorts & sports sandals w/ socks, look like old female. The mom was also white, tired, late 30, No make-up, looked,  like...... a guy.\n\nAnd some teenage girls were showing off their cleavage and navel and followed by a bunch of boys look like...... such a...... Dumb Ass Mutha Fokers, ....reminded me of that when I was the age.....\n\nWhat a awesome view.\nGreat! Just great.\n\nI think food is a bit pricy but not too bad in here.\nBut I like the produce market and large deli.\nKorean BBQ place was good,\nGrilled Steak place was good,\nBut, the Japanese place calls \"Hana\" is a tipical Pseudo Japo by Korean, the poke over rice was $12.- ! that's rip off !", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-03", "description": "High-end mall cafeteria. \n\nThere are people hired to bus the table when you're full from eating and you can't take your own garbage to the garbage bin.  Most of the servings are HUGE and placed on nice white ceramic bowls and plates, instead of the paper plates and togo boxes you would get at other cafeterias. \n\nBut if you don't want to spend a whole lot of money on a delicious burrito, go to the mission. It's cheaper, better tasting and people I feel sorry for aren't hovering over you waiting to take your plate and clean your table after you.", "author": "Caryl C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-09", "description": "Two stars for the great variety and higher quality standards than typical mall food fare. \n\nIf you have children or very short people in your party, leave them at home. The pack of wild animals in this \"emporium\" are rude, inconsiderate, and harried and your miniature loved ones will pay the price. Some suit knocked over my friend's baby's stroller (with the baby in it!) and just kept walking. My itty-bitty friend Sara was physically moved out of some woman's way near Beard Papa. The crowds are unmanageable and the noise level makes my head spin. Love Bristol Farms and that's the only reason I venture down here. I'd rather walk up to the other end of Union Square for lunch and maintain what sanity I have left. \n\nI guess if I worked in the area, I would be inclined to get takeout here but that's about the only way I can imagine spending more time here.\n\n**There IS ample seating, but you will pay the price in hearing loss and anxiety attacks.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-28", "description": "I would love to give this place 5 stars as it is the best mall food court when it comes to the quality of the food. However because it is all so \"trendy\" and \"fancy\" they all use sesame seeds/ oil or peanut oil/ peanuts in everything. So I can eat a tri tip sandwich, some of the Asqew items, or a salad (not tossed cause they tongs all put into one water bucket and the miso sesame salad dressing washes off in it and gets on the tongs and makes me sick). So yeah... today I had a cobb salad and tried for about 5 minutes to have the lady understand what an \"allergy\" is. Food industry- teach your workers to understand the word ALLERGY. The last place I want to stab myself with an epipen is a food court with thousands of people pushing and shoving and not caring what my problem is. \n\nI WANT TO EAT PAD THAI LIKE EVERYONE ELSE.", "author": "Ali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-13", "description": "My review of Coriander pretty much said it.  \nhttp://www.yelp.com/biz/AVmip4P8l2i7HheKuniWvA?hrid=KbMY91ZmucCb5vbOW59m5Q\n\n It's expensive for a mall food court, but then the mall itself is expensive.  The food down here is a cut above what you'll find in the older part of the mall just to the west.  There are real sit-down eat-in restaurants, as well as the fare that is relegated to the common dining area.  When was the last time you saw real metal tableware and granite table tops in a food court?  The clientele is self-selecting, too.  People eating here appear to be more well-heeled than the people eating in the other food court in the older part of the mall just to the west.  All in all, it's a more upscale dining experience, regardless of the fact that the \"food emporium\"  is actually ... a food court!", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-04", "description": "Every time I go in this place I am amazed that it can bring together so many different vendors selling so many different kinds of food, and still utterly fail to offer up anything I really want to eat.\n\n(Exception: Bristol Farms has an amazing hot food bar - but they are union busting scum and I refuse to eat there)\n\nThree stars for mediocre execution of a great idea.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "I don't get the hype about this \"food court in a mall\" thing. Food courts in a mall is pretty much everywhere in Australia where I live. This food court is very small compared to the ones over here and even much smaller compared to those in Asia. Food is just so-so. The only one I like was the crepes. Delicious and cheap! Well...all food is cheap in the US (compared to Sydney).", "author": "SC O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-29", "description": "Is this not the BEST mall food court EVER? \n\nWe wandered in here by accident one day, on our way off of  BART.  Now, when we BART, we make it a specific point to get to the city or leave the city RIGHT at dinner, so the family can go to this food court.  So far, I've tried the raw bar and pizza at Bristol Farms (picks by the kids), coffee at Peet's (yeah, can never seem to pass by Peet's without getting a cup), Sorabol (but I think that's kind of standard mall fare, actually), andale, and buckhorn grill (yeah, this one is kind of standard mall fare, too, but I was in the mood for one of those huge salads).\n\nThe kicker is that this place is ALWAYS bustling; the only table that we found was this mini table w/ little chairs.  Perfect for 5 year olds.  Except that I'm not five.  My kids loved it, and I -- well, I had good food, so who cares?\n\nI hope I discover more ACCIDENTS like this one.", "author": "Patty W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "Best food court ever!  \n\nI live really close by and come here whenever I don't want to make dinner.... that means, I'm here a lot.\n\nThis is the best food court ever - from Coriander to Buckhorn.  There are some places I don't like though like the Salad/Mediterranean place.  I got food from there once, I think maybe a dip plate or dolmas or something and it was gross.  \n\nAlso, another bad thing is that they closed down Tom's cookies, so now I have to walk! (boo exercise) all the way to Macy's to get my fave cupcakes.  \n\nCheap + quick = wonderful", "author": "F K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-13", "description": "I really cant stand mall food... No matter how fancy they try to make it. \n\nThere are long lines, dirty tables, messy condiments bars... and a smelly mixture of Chinese food, pizzas, french fries and beyond...\n\nYou can never go wrong with the Nordstom's Cafe. :)", "author": "Dee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Good food for those on a budget!  Buckhorn Grill has salads that are a healthy & delicious alternative to fast food that's bad for you.  They tend to get busy, but that is simply because others see the value that I do & want good food that's affordable.  In this day & age, that's reason to celebrate.  Have been going there for the past 3 years or so & not been disappointed in any of my choices.", "author": "Thomas O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-01", "description": "What the hell am I doing giving a mall food court five stars?\n\nHas the world started rotating in the opposite direction?\n\nDid I trade in my fancy-ass messenger bag for a knapsack with \"Kimmie\" embroidered on the back?\n\nDo I now show up at the roller rink every Saturday at 2 pm so I can jealously dig my nails into my hands as my crush Andy Tiller skates around, hand in hand, with Robin Papigan, to \"Last Dance?\"\n\nNope. The food court at this mall - yes, this mall - is that amazing. Tom Colliccio has a restaurant here. There's an outpost of the Slanted Door's fast food concept. There's a full blown Tom's Bakery (the people who make that frozen dough you buy at Trader Joe's). A Korean Fast food concept...like Chipotle, but Korean.  A fish joint. A tea joint. A boring old Peet's. A Bristol Farms (ah, thanks for that little piece of LA flash, yo). Upscale burgers. And a nasty-ass gelato joint that, if I reviewed separately, would fall into the one-star \"heartbreakingly bad gelato\" category. \n\nI've never seen such a collection of interesting, high-end restaurant concepts grouped into one place in the US, ever (for those of you who have spent time in Japan and wandered the top floors of department stores, this is old hat). For anyone wondering what's \"in\" in restaurant concepts these days, this is a must-stop on your itinerary.", "author": "Lindley E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-03", "description": "Best American mall food court yuppified for downtown SF. \n\nOr is it?\n\nAs I said before, a huge no prize to the intern who came up with the $6 word EMPORIUM to replace food court during the Westfield Marketing Meeting.\n\nThere were no Roman gastronomicas here or Swedish smorgasboards. Not even a Roman orgy.\n\nIf Westfield SF is supposed to represent the very best of San Francisco, what's a meh BBQ place doing here, or an unheard of place that does pasta, and pizza. Or a pseudo Korean Sorabol mall court place? Or a case of ID crisis of Mr Hana that's not so Japanese and not so Hawaiian (for sure not a little bit country and for sure not a little bit rock and roll).\n\nThe crepe and gelato vendor stop is probably the most attractive place of the lot, but does it really represent SF? Andale has fantastic tasting Mexican plates, but $9? Ouch. That's what you get for getting good stuff in a clean environment downtown. And Out The Door? C'mon Charles you can do something better than that....how about something authentic Vietnamese and not a cross fusion of Cantonese comfort food (like congee and oil sticks) with more cases of ID crisis.\n\nIf I were able to re-do or re-select vendors I'd pick something like:\n\n1) Get Zuni Cafe to do a food court stall, scaled down, but keep a few signature offerings. Let's face it, Zuni *is* an SF institution amongst foodies, snobs, and people in the know, and I only ate there once years ago (wasn't blown away then, but I respect what they do).\n\n2) Have one of the great Italian places come sign up, and also offered easy scaled down but good food. A16, Delfina, etc come to mind. Heck even Pizzeria Delfina sounds good.\n\n3) Get at least one of the vendors from the SF Ferry Building. Blue Bottle would make a killing here if they could set up shop there. Pranther Ranch would sell chicken sandwiches like crazy I'm sure. \n\n4) Get the best Chinatown restaurant to the \"Emporium\" and do strictly authentic Cantonese fare like won ton noodles, cha siu or BBQ meats over rice plate. MAYBE a little bit of dim sum but don't push it. No Mr. Chau's fast food, no Happi House Teriyaki, no Sorabol, no Panda Express, and no crappy steam table supermarket fare.\n\n5) At least several representations of the best ethnic food SF has to offer. I'm sure you have your faves, whether it be Peruvian, Ethiopian etc. But you won't find that in the yuppified mall court.\n\n6) Try to court Thomas Keller into opening an even more scaled down Bouchon kind of place here. After all, what's SF without the signature restaurant, restaraunteur and the cooking they represent? If Tom won't play there are many other worthy contenders.\n\nBristol Farms? Hmmm too Whole Food-ish, but at the same time not quite. Doh....", "author": "Ken K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "I've unabashedly raved and recommended this food court to my friends and family. Though, I always have to preface with, \"This may sound weird but...\" And it does, but if you've been to Asia and experienced their malls (think Taipei 101), then you'll feel right at home at this food court. (Because Asia knows how to do public spaces.)\n\nYes, it's still a food court but there's nary a Mickey D's or Orange Julius in sight. You want Korean? You want Thai? You want tri-tip with a glass of wine? And some gelato for dessert? Indulge yourself here amidst the refreshingly calm interior design. Yes, the lights may be florescent but the light covers have a lovely leaf design.\n\nThey even have an extremely helpful and attentive staff clearing the tables for you. Now that's a food court!\n\nMy only complaint (besides closing at 9pm)? The cacophony of the nice wood chairs' metal legs constantly scraping against the faux-marble (?)/concrete floor can drive sensitive ears nuts.", "author": "Viv C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "Waking up after my SF DYL I was a bit hung over and extremely thankful I had until noon to check out of my wonderful hotel.  I used every last minute in there to rest and recover from the night before.  When it was time to meet GBF#1 in the lobby I finally went down and we deiced on where to grab a bite to eat.  I thought why not check out the Westfield Food Court, I'm sure there would be something down there that my hung over ass would want to eat.  Plus I wanted another Teaz Me ice tea, ice tea is a great hangover cure if you didn't already know.\n\nI think this is the most amazing food court I've seen in the US and they use real plates and silverware.  Plus the tables are kept clear and clean and people didn't mind sharing their space.  Yet another plus the variety of the food they have is amazing, something for everyone.  Salads to Thai food to Korean food to crepes to Mexican food to even Panda Express.  If you're shopping in the area and need a quick bite to eat stop into the Westfield Food Court I'm sure you'll find something to satisfy your hunger, I sure did.", "author": "Me H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "I love food courts and this one too.  Before this food court opened, our lunch selection was quite limited while shopping downtown.  \n\nI also love Peets!", "author": "HY L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-20", "description": "plenty of food choices and it does become overwhelming especially when your stomach is growling.\n\naverage food that's a little high on the price but the seating arrangements and REAL plate & silverware makes up for it.\n\ni rather have lunch here than the old food court on the other side of the mall. \n\nfavorite places to eat:\nCoriander Gourmet Thai\nMr. Hana\nBRISTOL FARMS", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "Think what you want about eating in the malls, but there's no denying that the Food Emporium is the best food court. Not the best in the world (I believe those are in Hong Kong), but the best that SF has to offer. \n\nThe decor is aesthetically pleasing with its natural color scheme, modern chic tables/chairs, and all the bamboo a panda could eat. But even if you are not a panda, you'll find plenty to eat here. The offerings are more upscale than fast food you will normally find in a mall. No Dairy Queens or Panda Expresses. What you get instead is gelato, Coriander Gourmet Thai, Beard Papas, Asqew, etc. \n\nIt's the little things that make a difference here. You have people taking your tray away for you. You get real silverware. You get to pay a little bit more for a lot better food. This is a great place to meet friends, take a break from trying on clothes, or grab a quick bite before your movie. Those small things make this place a favorite outing of many, myself included, of course.\n\nSo why not 5 star? Well...\n\nDidn't think you could go back to the pre-cell phone days? This place just may prove you wrong. The lack of cell phone signal (depending on your carrier) could be an issue. Better be clear about the exact time & location you want to meet your friend, and hope that he/she will show up as planned. Cuz if he/she doesn't, I hope you still remember how to use a pay phone.\n\nSome time last year, I also discovered that the chairs are painfully annoying. When the tables around you slide their chairs in & out on the tiles (and there is a lot of this action going on at any given time), it results in a loud, high pitched scratching sound. Hear enough of this, and you'll be deaf in no time. Rubber stopper things needed badly here to cover the ends of chair legs. Either that or cotton balls for your ears.\n\nThe women's bathroom line is notoriously long. Go to one on another level instead. Legs need to be stretched to sprint toward any open seats. Until you are seated, you need to be in \"city parking\" mentality at all times. If you don't know what that means, maybe you shouldn't be eating here at peak hours.\n\nThe negative things are minor, but could just make enough of a difference when it comes to star ratings.", "author": "Rona J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-20", "description": "If you and your friends can't make a decision on where to eat, head to the food court for the variety. I've been here too many times to count (it's near my job), and I have yet to eat at half of these establishments.\n\nIt's extremely busy between noon and 1 p.m. and pretty pricey, but also strikingly clean for cafeteria atmosphere.\n\nTIP: Instead of ordering a bottled water or soda, you can save $2-3 by asking for a glass of water at any of these places.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-04", "description": "I didnt like at all.... the personal was not nice with the customers (especially with the old lady just before me..). The food was really disgusting.... First time and last time there", "author": "California G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-14", "description": "Sure it's loud and noisy.  You feel like you're in one of those Asian malls. No, not like Pacific Mall, more like, in Seoul or HK. \nBUT...\nWhere else could you get a meal that includes Mac n Cheese from Bristol Farms, delectable Pumpkin Curry from Coriander, Asian Slaw from Mr. Hana, ending with one of those PB and Banana cookie thingies from Tom's,  all washed down one of those Supposedly Healthy Berry Tea drinks from That Tea Place?  \nI LOVE THE WESTFIELD!!!!!!!!!\nAnd after stuffing your face full of shit you shouldn't be eating, your fat ass doesn't even have to get out of the chair until you're good and ready because some nice person in a bow tie and white shirt comes to take your dirty tray away. Hence , you are privy to some interesting people watching (i.e. make mental caricatures of all those people around you) as you burp away your worries.\nUgh. Sucha glutton.", "author": "Joyhan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-13", "description": "Think ultra modern underground cavern of a cafeteria makes preppy shoppers feel sexier while they nurse their purchasing hangovers and gnaw on the bones of their second rate Korean BBQ short ribs. Now in a German accent, \"Oh how dirty! I sink I vill take a baath.\"\n\nSuck down neon green tea with beans in it, grub an over cooked plate of pasta, or wait in a really long line for a cream puff while having a wet dream about posing for a Crate and Barrel catalog. \n\nOne extra star for opening stupid close to my apartment -- tripling the number of inexpensive places to consume calories in my ever so slowly gentrifying crack den of a neighborhood.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-20", "description": "This is by far THE BEST food court that I've ever been to.  It's not your typical food court which has the sbarro, hot dog on a stick, etc, etc...   This food court has restaurant-style food at decent prices.  They have selections ranging from sandwiches to Korean food, to Thai food, to seafood specialties! \n\nI opted for the Korean food.  For a little under $10 I got a huge plate which included rice, Korean noodles, steamed broccoli, and I chose the spicy chicken  (also had a bottle of water). I was pleased with the way the food tasted and was pleased with the quality of food (you seem to forget that you're eating in a shopping mall food court). \n\nBe careful if you choose to eat here on a weekend as it's usually packed and finding a place to sit is a little difficult... it is, afterall, a tourist spot! Also, be prepared to have bus boy service after you've finished your meal.  They serve your meals on real plates with real silverware (if you state that it's for here) and after you've finished your meal, people take away your plates and clean up your table... gotta love service!", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-22", "description": "Holy mackeral...THIS is what  a food court should be! I've never seen anything like it..in a mall, that is.\nEvery \"stall\" has food that smells and tastes great. There are no food chains that exist in here ( no East coast chains, at least). I heart the Thai iced tea... Although there isn't much else besides Asian cuisine...they all serve wine! Yes. WINE. At a \"food court\" in  a mall. And the mall staff cleans up after you. You don't have to go looking for the garbage...if you do, you'll get weird looks...like I did. Anywho, if you're not into shopping then at least hit the food court for a feel. If you're not into Asian food then go to the crepes/gelato stall! They make the crepes in front of you. Hope you enjoy!", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-04", "description": "Wow!  This is the nicest, quality food court I've ever encountered. For food court food, it's top notch.  They even use real silverware and plates.  They don't have a bunch of businesses crammed next to each other but quality before quantity, right?\n\nWent to Ouththedoor and also got $5 fish n chips.\n\nThe only thing they can approve on is MORE seating.", "author": "Rich E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-02", "description": "Damn you Westfield Food EMPORIUM. \n\nWhew! and to think I almost called you a foodcourt! \n\nYou're the reason I'll never be satisfied with a foodcourt anywhere ever again. Thank you for partially ruining my existence. \n\nI'll be back. Finding a table on the weekends is a bitch!", "author": "Tushar V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "After I got over the initial opening of the food \"emporium\" (\"oooo, shiny!\"), I realised this place isn't really that bad.\n\nNever come here on a weekend! I mean, that's like common sense when it comes to malls. You'll end up sitting at the kiddie table with your beer and pizza if you don't heed your common sense. I speak from personal, awesome experience obviously.\n\nYeah, it's a little dim and what little lighting there is gives me a headache sometimes. Yeah, it can get really loud, so much so that if the adage \"if it's too loud, you're too old\" is right, I must be a billion years old.\n\nOh! But the cushion seats are comfy once you get over the possible sanitary issues and they have hand washing stations OUTSIDE the restroom. And it's not too difficult to find a glass of water around here. If you have kids, they have a \"family room\", whatever that is.\n\nFood prices can put a dent in your wallet if you eat here every day. But it's easy to get to from the Mission garage through Bloomingdales and you can get here directly from BART/MUNI without stepping a foot outside.\n\nBest part: you don't have to bus your tray. Makes me feel fancy.", "author": "Grace-Monday B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "OMFG...who would've thought that a mall food court could be this good!  I love, love, LOVE everything about this section of the mall.  I came here on my last day in SF & I really wasn't expecting it to be so tasty & inexpensive.  I really didn't know where to begin or even what to select so  I walked around a bit & had lots of samples....more than once:) \n\nI settled for this Korean BBQ place where I got 3 huge pieces of short ribs, rice, noodles, & vegetables.  I couldn't finish it all so I had more than enough to eat on my flight (which ended up being my meal before my flight at the airport since my flight got delayed 2 hrs).  Anyway, the food was great & it only cost $8.95 before tax!!  \n\nThe one annoyance I had was with the huge crowds.  I was with a group of 11 so it was obviously hard trying to sit together.  We managed to collect chairs & tables while people bought food so by the time everyone had their food, we had sucessfully acquired 5 small tables  & 11 chairs.  (FYI...I do not recommend trying this if you're really hungry because it took awhile to make it happen).", "author": "Shelly C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-20", "description": "Tons of choices\ngo to buckhorn...and get the tri tip salad, its rather yummy!\n\nscoring a table is going to be drama, just accept this and try to find one.\n\nand yes, you will be asked be a lot of people if you are using the chair...\n\nonce while waiting for the hubby to bring his food, (I should note this was around the holidays) i could not take a bite, because person after person interrupted me to ask if they could take the chair, one person went as far as to take the chair without asking! i was a bit pissy! like do you really think I am eating here all along, and did you not notice the 30 other people who just came up to me to ask for this damn chair!! oh it was awful and I could not wait to leave!!\n\ndine at your own risk!", "author": "Deirdre P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-28", "description": "Yeah its exactly what its called its a food \"emporium\" not a \"court.\"\n\nThis place is IMPRESSIVE. \n\nIt may have just been that I was there during the holdiay season but this place was buzzzzing, it was so packed that people were just eating where ever they could find a place to sit, even if that meant on the floor. \n\nThe other reviews are right, you will not find your normal food court establishments here, no Sabarros, no Hot Dog on a Stick, no major fast food chains, no dollar deals. Your meal will probably not come cheap, but if you ever wanted that you could always walk down to their other food court which carries the typical mall fare.", "author": "kate r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "OK my little secret is out. I HATE shopping at  the mall, but I like eating there. Kind creepy, I know. Just hear me out before you judge.\n\nI am one of those people who needs to eat every hour or I get cranky. I tend to walk home from work from time to time with my guy and the mall is right on our way. By the time I make it all the way over to 5th and Mission, I am STARVING! So one day on our walk home, a moment of cranky hunger (my man likes to refer to it as something else that begins with a b) over came me. We just so happened to be in front of the mall. I was dragged quickly downstairs to get a quick bight to eat. \n\nI staggered up and down the court checking the food out with my tummy grumbling. All I can remember in my daze, was that to my surprise, there was some pretty decent looking food. We ended up eating at Coriander Thai and had a yellow curry and a veggie tofu dish. Pretty yum yum.\n\nMy blood sugar started to rise and I looked around the food court area now a sane and somewhat rational person. Whoa. I noticed people drinking wine and laughing like they would at a restaurant. How cool is that? I also noticed a gelato stand right smack in the middle of court. Even cooler. I looked at the tables surrounding us, not everyone had a shopping bag. This meant people were coming here like we were, just to eat. Interesting. It dawned on me then that this place was not a regular food court. We continued our walk home that evening with full bellies and lots of cheer. I had found a new drop-in-and-eat destination in the most unsuspecting location.\n\nNow I regularly stop down here on my walks home with or without company. It's great. Of course I try to avoid the rest of the mall as much as possible. The other day I got sprayed with some obnoxious perfume on my walk out from dinner, but it is a small price to pay for some decent food.", "author": "Ali K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "I'm convinced they have everything you could possibly want at the food emporium. Not that this shocking but all of the choices  are organic and fresh. Hard to decide what to eat but something for everyone.", "author": "James Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-26", "description": "I tried the Seafood Tofu Soup (Soon) at the Korean food vendor.  It was such a huge bowl I thought I would only consume half of it.   Well, I consumed practically all of it - it was pretty darn good.  Comes with a bowl of rice, and cost less than $8 - Lunch special of the Day.\n\n Since most of the reviews mentioned Coriander, I'd thought the Tofu Stew was worth pointing out.\n\nBest Food Mall court in Northern California for sure.", "author": "A. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "Went to the Westfield Centre today and had lunch at the Buckhorn Grill.  It was just perfect!  I had the Roadhouse Salad and it was terrific.  It had lots of chicken breast (no cheapo dark meat) and other fresh ingredients like gorgonzola cheese, walnuts, and tomatoes.  My boyfriend had the tri-tip sandwich with fries and raved about it.  It came with a dipping sauce and tons of fries.  The service was quick too!  After shopping we returned and went to Beard Papa's (weird name!) for a cream puff.  Excellent!! There are so many choices at this food court that it's hard to pick where you want to eat, but all of the food looks fresh.  Bristol Farms has some great looking fresh turkey sandwiches and pizza.  I'll try there next time.  Definitely not your \"Sbarro/Chick-fil-A/Burger King\" food court.  This is top notch gourmet-type food which I guess, is why they call it an \"emporium\" instead of a food court! A+++", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-30", "description": "Fresh vegetables but tri-tip was little rough. Good food for mall food", "author": "Yello I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "food court! AHHHHHHHHH! so much variety! AHHHHHHHHH! i love it! pricey, but i would come here once in a while. maybe once or twice a year. definitely pricier than normal food courts though. however, the interior is pretty modern. \n\nVERY crowded, you would have to look around for a while for a seat. there might be a few times when you're so close to snatching a table, but a family and a couple of their slower walking kids would have snatched it by then. \nfood after walking around in the mall. just what youll probably need.", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-16", "description": "The BEST food court ever. It's not like that fast food hot dog on a stick kind of shit. It's sit down restaurant quality food. My favorite is Coriander, the Thai food. RESTAURANT QUALITY. For two entrees, rice, thai tea all costs $13. Another favorite of mine was Teaz Me Tea, that had the BEST blended frozen mint tea smoothie with big chewy boba. This is no ordinary food court. And to satisfy your sweet tooth (as if the boba werent enough) the cream puff place has light sweet creamy melts in your mouth cream puffs. ahhhh. heaven.\n\ni repeat: THis is no ordinary food court.", "author": "Laureen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-08", "description": "Food court seems OK, but freakishly busy.  We usually end up - ok, the few times we've been here - getting stuff at the Bristol Farms and carrying it over (because they have real fresh sushi). The food court, while busy, is pretty clean. I've always seen people around clearing and wiping tables off, clearing away food trays for you while you're still there but finished eating (nice!)  \n\nThat said, they do seem to have a pretty good variety of \"upper end\" food court places - not your typical stuff, but different is sometimes refreshing.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "The spiral escalator is nice and the dome view is pretty.  7 story mall wow, and the food court has really good food. One of the better westfields i've been to for sure.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-03", "description": "BE AWARE!!!\n\nMy purse just got stolen yesterday at the food emporium.  There seemed to be young girls who hangs out at this public place and grab your purse when you're not looking. They don't work alone, they would hand your purse to their friend so even when you recognize her, she will no longer has the evidence. \n\nI couldn't find even one security after I realized it happened. I had to go to Bloomingdale's and ask somebody to call a security. Just got to look out for yourself and be more cautious and suspicious.", "author": "Herdah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-19", "description": "This place has a lot of nice stores and an awesome food court. Beware of the salesmen and saleswomen at the booths and their aggressive sales techniques though. It makes shopping very unpleasant.", "author": "Yoni D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-21", "description": "my team at work and i go here every friday to try a new place each week. even though we know we will be back the following week, we can never decide what we want to eat! the food all looks & smells soooo delicious. \n\nthis food emporium is completely amazing, i dont think anyone will get sick of it. there is sooo much to choose from. the environment is VERY nice, it's very clean (note: the sinks outside of restrooms! how convenient!) and there are a lot of workers there to keep it up to standard. it's well designed and the vendors are well chosen as they offer a good variety. it's very efficient with the \"beepers\". although a bit crowded, i still plan to frequent the food emporium as a place for takeaway.", "author": "Stella C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "Is it sad that I often eat here when I'm downtown? The location is convenient, the prices are decent and I love the choices. Seating can be rough at peak hours, and somehow I always end up in that back right corner by the Japanese place, right next to the doors that all the employees go through. I love the smell of warm Pamolive as I munch on a chicken ceasar salad or the spicy green beans from the Thai place. \n\nThe soups from Bristol Farms can hit the spot on cold days (or when you need a medium-sized snack, one that will make you feel fuller than you actually are). The bathrooms often have lines (but not usually for the dudes). If you feel particularly daring, try the family bathroom. I'm sure no one will think you're creepy.", "author": "Jared S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-15", "description": "I've lived in Ohio, Portland and Vancouver, WA and they all have Westfields with food courts, but this blew me away.\n\nClassy food, nice seating area and even the trays were stylish. While you do pay more for nicer food, it's a welcome sight when compared to the usual Auntie Anne's, McDonalds and other shops that populate most mall food courts. First time in my life I was excited about mall food!\n\nOverall, it was a welcome rest from unhealthy eating and made me wish that more food courts were like this.", "author": "Jamila C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-21", "description": "Sorabol, the Korean restaurant, is DISGUSTING. The meet is chewy and fatty - some of the lowest quality meat I have ever had in a food court. The bulgogi was dripping with oil and in edible. I should have returned this awful food as I will need to eat lunch again. There is no excuse for a restaurant to serve this kind of food to paying customers.", "author": "Laurence S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-20", "description": "I normally hate food courts (and indoor malls) but this place is so well designed and the choices are excellent!   \n\nDid I just give a food court 5 stars?", "author": "J J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-23", "description": "If you go here you are bound to beaten up by their incompetent Gestoppo llike security guards.  I am a 49 yr young handicapped female.  I have GBS that keeps me in an electric wheelchair that dies.  I came up from bart into the food court where my boyfriend was to meet me.  The chair was dead.  SO i have just started to walk and decided to walk very slowly to the bathroom.  The toilet in the handicapped bathroom is always broken - full of tissue and god knows what.  So i went outside.  There were 2 ladies giving out free samples.  I only took one.  A security guard came and screamed at me because my shoes were not on.  I told her i had a wheelchair and she would not listen.  She refused to let me walk towards my wheelchair.  She shoved me because she wanted me to walk faster.  Finally, 4 more guards came.  They drag me through the food court screamimg for help and dragged me into tables and chairs.....", "author": "pilou o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-03", "description": "There are so many choices here.  I haven't had a chance to try all of the different restaurants in this food court, but so far, I haven't had a bad experience yet.  There's everything from American to Italian to Korean and just about everything in between.  The prices are OK and you can always do your shopping after having something in your belly.  Either that, or head home via BART.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-29", "description": "A must visit while holiday shopping. Korean BBQ to Bristol Farms deli choices, this basement food court will have what you are looking for. A glass of fine wine will put you in a great mood before shelling out more dough at the mall. Be sure to save room for dessert.", "author": "Annie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "This stuff is the bomb...Love the original flavor. It's a little pricy but great snack/breakfast food.", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-29", "description": "This place is like glitter: fun to look at but bad for digestion. I'd rather eat at the bottom of Macy's where I can actually find something I want to eat.\n\nFOOD: I've been there several times & had to walk round & round trying to find something I wanted to eat. No good deals to be found. \n\n~First time I wound up with Buckhorn Grill, which wasn't that great. \n\n~2nd time I did Sorabol Korean BBQ, which managed to make Korean BBQ untasteful. \n\n~Most ppl will disagree, but I'm not even that fond of Beard Papa--too light. I prefer the heft of the frozen cream puffs from Costco (after defrosting of course)!\n\n~Walking past the baked goods section at Bristol Farms, we were overwhelmed by a stinky garbage smell when usually the smell of baked bread is what entices people to buy. I thought it might be the cheese? Anyways, ew.\n\n~Everything sucks!\n\nDECOR: It looks pretty, for sure, but it's all style, no substance. Even the banquettes are getting filthy. Disappointing.\n\nBATHROOM: n/a\n\nSERVICE: n/a\n\nOVERALL: I'd rather eat at the bottom of Macy's, where I love the sushi & garlic mashed potatoes (not together, of course) from Wolfgang Puck Express.", "author": "miss b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "Much like SFO, this food court is filled with a variety of local places - and just a few chains. Like Beard Papa but, you know, they get a free pass anywhere.\n\nI really like the variety here. Burgers? Yep. Gourmet sausages? Yep. Italian, Thai, Vietnamese, American? Yep. Sushi? Indeed. And Bristol Farms, a full (small) grocery store? You got it.\n\nSeating is plentiful and comfortable. It's really a pleasant place to eat, and it's nice that it's not just another silly food court.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "Wide selections of delicious food, desserts and drinks. I love eating here; it's not your typical food court food. They offer high quality food selections e.g. Catch Ise (I love their Salmon BLT!), Sobabol, Buckhorn Grill, Cafe Bellini, Askew Grill, Bristol Farms, Beard Papa's & etc. Also, check out Witchcraft next to Bloomingdale's - they have very good grilled sandwiches that are not your typical ham and cheese!", "author": "linh d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-20", "description": "I was pretty hesitant when my friend suggested that we go to a food court for lunch for my only day in downtown SF. After some clarification and how she promised I'd be pleasantly surprised, I went along for the ride. Once we went down the escalator, I felt like a kid in a candy store! I walked around 3 times just to sink everything in and to try and narrow down my choices (do I want Thai... or Korean BBQ... no wait that pizza looks so good!... &@!%!)... After getting 2 platters to mix things up and a smoothy, I was satisfied. I will be definitely coming back here during my next trip!", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-25", "description": "let's start with what is bad....\n\nMalls, in my lifetime, will continue to  support and cater to what is already established, franchised, and trendy.... see the ed hardy shop on your right as you enter this multiplex of everything for the childless, maintly white, possibly cohabitating ( = extra grand or two for retain therapy), upper middle class of SF. ( no credit to the old school tattooers who generated a huge amount of classic flash, and yet aren't reaping the benefits of these classic designs being recreated in screening ink and rhinestones on american apparel( esque) t-shirts, at the tune of over $200 for a hoodie...\n\nStraight up - yes, it caters to the demographic in which i place my living room. And there are so many aspects i love. That the dome is historic, the the architect for this building took care that from every level you could appreciate the dome, and yet at the top level, you can hang out underneath it... on couches.\n\nMAD PROPS for the correct seats in the movie theatre..\n\nMAD PROPS for promoting local cuisine in the food court\n\nWAY TO set the standard for what a mall can be for....\n\nmy, select, demographic.\n\nIn a sense, i wish that i enjoyed the Westfield less. I feel like i'm letting  my punk history down.\n\nAnd yet, as a woman in my thirties, i meet my friends here and feel pampered and comfortable.\n\nSo when do i gain weight and start fucking the poolboy? ( or pool trannie, i guess, i mean, we ARE living in SF... right ?)", "author": "Domini A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-15", "description": "The food selection in the old Emporium is great, but I just wanted to Yelp the busers and security guards that patrol the area and give them their credit  for actually caring about the people who shop there even though half  of them (present writer excluded) are \"douche-bags.\" \n\nOne of the many security guards approached my friend who had her bag hanging from the back of her chair.  At first we thought he was hitting on her but then he told her, \"ma'am its not a good idea to put your belongings there... there have been a lot of thefts.\"  \n\nI was impressed by the service.  As we were leaving, my friend commented on the huge mounds of gellato that where on display, and how they were made.  The buser over heard her question and was willing to ask the workers at the gelato place how they made the mounds.  Even though we declined his offer to  ask the workers it made us laugh that they would even make the effort. \n\nI expect customer service like that at places like the Ritz or the Four Seasons, but not at a food court. I just wanted to say thanks and I am a fan of this food court or to use a dumb-ass euphemism: \"In-mall Dining Cuisine!\"", "author": "Nino P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "I'm not a mall rat and generally-speaking I avoid them as I do unmarked freeway exits and the mid west in general. My experience with malls tends to involve headaches and parking lot exiting difficulties that have \"city folk\" written all over them and which bear more resemblance to that first demerit we all earned while getting out of the DMV back at the age of sixteen. In itself a cruel and discombobulating rite of passage that should mark the only time you'll find an adult in uniform in the passenger seat, with a clipboard and an unmistakeably nervous demeanor. \n\nI dont know if there's parking at this place though I imagine if there is it's more of the sort sporting only one way in and one way out, each perilously close to the other. \n\nI take the muni which rocks, and which also involves a uniformed adult up front, though hopefully sans clipboard. I don't think there's a passenger seat up there. \n\nThe mall itself, what's left for it here, is splendid urban capitalism at its shiniest. If you can't find what you're looking for here, you need to hit one of the many optometrists within. The cupola offers a great place to hang out and people watch. And the basement has a great selection of foods. Including that inaptly and ineptly named cream puff shop, Beard Mama. Oops. Beard Papa. Heck, maybe it's a family thing.", "author": "adrian c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "Like the rest of the Westfield center, this place has got great design and is filled with people who do not know/do anything else than window shopping.\nThe franchise restaurants are on the high end and offer great food, you won't find your typical yucky mall court food here.\nAnd it's probably the most crowded area of the mall: finally somewhere trendy teens can afford spending money other than on buying stickers at Hollister so they feel good about it and can fall asleep at night after watching the OC with a satisfied grin on their face for being so complete in their life.\n\nAh and watch out for your belongings, one of my friends got her purse stolen there which seemed like a sad routine for security.", "author": "Damien J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-04", "description": "Great place to get upscale fast food. Also one of the only malls that have bussers to bus your food for you. Love to eat Korean food at Sorabol...Get a lot of food for the price you pay and very tasty.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-12", "description": "I would give it 5 stars, but:\n-if you're not from the area, you have to commute by bart, which is $9.90 from where I board.  that is, if you don't drive.\n-food court is pretty expensive.\n-super croweded.\n\nThe GOOD:\n+Zomg, such a breath of fresh air considering the malls I'm used to going to (Newpark, Southland...lol).\n+Sprial escalators! AMAZINGGGG! (:\n+Multiple elevators!\n+A bunchhhhh of stores. Three stories, I believe. All kinds of stores with names I've never heard of before.\n+The people who clean up in the foodcourt wear ties!! WHAAAT!?\n+Right next to Powell St. Bart.\n\nI wanna go back, and actually buy things other than food. Lol.", "author": "Ava A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-19", "description": "It's like a tiny bit of Singapore here in good ol' Frisco! And what variety, and you can walk around and check it all out and talk with people waiting to buy food and find out why they like it and maybe you'll like it... Wonderful, fresh, inexpensive food, clean surroundings, fast paced (slower on 4th floor) and usually crowded. Welcome to San Francisco!", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "When you think about mall food courts you think fast food - burgers, pizza and the like - not here! Top notch eaterys - all served on real plates, glasses and silverware! And you don't clean up after yourself - they have attendants all over the place to clean and remove your place setting!", "author": "Peter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "Wide selection of food ! Korean,Mexican, American, Italian, Sandwiches, Pizza,Sushi etc. I always don't know where to eat at when I'm here because they all look so good. The best food I had here was  Sorabol Korean BBQ & Asian Noodles, a lotta food, good korean food! If youre ever in for asian food, you gotta try it.", "author": "Maddie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-23", "description": "In the food court of my hometown mall, we had things like Hot Dog on a Stick, Mrs. Field's cookies, and Panda Express. \n\nThe Westfield Food Court (oh, excuse me, EMPORIUM) is another experience all together. Beard Papa? Asquew Grill? Gourmet Mexican food? Whoa.\n\nThe prices here definitely reflect the \"food court plus\" atmosphere, but it's a great place to stop for a bite when you're shopping downtown.", "author": "Vandana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-14", "description": "People - you're in a mall! The BK Lounge is a 1/2 away, if you're missing the ambiance of a traditional food court. Anyway, it's better than what you get in any airport in the US, and convenient to boot. Which, I'm guessing,  is their main goal - fast food, fast $$$.\n\nWhy 5 stars? It works for me. The reviews of food don't make sense to me, 'cause it ain't date/business/family event dining venues. It's 'I gotta' get my ass back to work in a hurry' food.", "author": "Rene D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-16", "description": "I never thought I'd be promoting a mall while living in SF.  That was, until I found this spot.\n\nSure, it is expensive, but so is everything else in this city.\n\nThe Bloomingdales is absolutely huge and great for getting gifts for my girlfriend.  I like the other stores as well, a mix of ultra-trendy to punk stores.  The jewelry stores are very fun to window shop as well.\n\nI haven't used the spa before, but have heard its very nice....may get my girlfriend a gift there.\n\nI love the movie theatre, and the seat comfort puts the Metreon to shame.  \n\nBristol Farms has helped to redefine nice store shopping in the city and is a pleasant alternative to Whole Foods.\n\nThe food court is often too crowded, but has a great selection (not your typical mall food court with hot dog on a stick).  I can get a great burger, sandwich, salad, Thai, Vietnamese, Chinese, Korean, Mexican, crepes, smoothies, etc.  I love it.  I can actually walk there from my place to grab dinner too if I want something tasty, don't feel like cooking and don't want to spend $100 at a local restaurant.\n\nFinally, you've got to check out the dome.  Its the old dome/skylight from the Emporium that closed down and this really pleasantly integrates historical elegance and modern luxury.\n\nAlso, this mall is a hop, skip and a jump from Union Square, for even more shopping and restaurants.\n\nHands down, five stars!!!", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "This place is great if you can't decide what to eat...they are definitely much better than any other food court, thats why you pay the prices.  I like the thai food place which has the yellow curry chicken with rice, or the sweet basil chicken with rice.  The korean food place is good too, but they give you too much food, and I think their marinade on their meats are too sweet.  Catch has a good salmon risotto and seafood soup.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-19", "description": "I work in front of the Westfield Centre.\n\nOnce in a while I make it to the food court for overpriced lunches on china plates. \n\nI didn't like Coriander very much.  Their pumpkin curry was mediocre. \n\nBut I usually head to Askew because their salads are good and filling.  Not a fan of their meat skewers, but their veggie one rocks.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-16", "description": "It's a beautiful, lovely...food court.  And that kind of makes my mental wiring short-circuit a little.  Mall food courts should always be the same, involving things like Sbarro, even in San Francisco.  I thought they were supposed to give you a sense of consistency in this world.  But Westfield has to go and try to be original in the food court world, and I'm not sure how I feel about that.  \nI've eaten here a few times because I used to go to the SFSU campus a few floors above.  Food is average and overpriced.  $9 for a burrito?  Come on.  It's in a food court.", "author": "Lego S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-27", "description": "heres a place that WOWed me like there was no tomorrow. my friend and i were here after the remodel and she was telling me that i needed to check out the food court. i was like 'what the hell? whats so special?' and then i went down there and i was like HOLY CRAP!!! every step i took revealed something more and more. this place was not only made to look especially nice, but all the restaurants here are nothing like you've ever seen (more or less) definitely not your typical panda express, and sbarro stuff but it had japanese, korean, thai, steak and among other things. they use REAL plates and give you REAL silverware! after you're done eating, no need to take ur plate in, they have bussers to bus tables! what kind of crazy is this?!?! \n\nevery one of my friends i've brought here have had the same reactions as me. at first they're like 'really? a food court?' then when they see it its like 'wow... wow.. wow'\n\nindeed it is.. wow", "author": "edward k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-24", "description": "This food court in the expanded S.F. Shopping Centre is the best shopping mall food court I've ever encountered. The selection is incredible, there are several higher-end establishments that serve very good food, and it even looks snazzy. \n\nNotable spots include: Out the Door (a mini and way cheaper Slanted Door), 'Wichcraft, a Sorabol that actually serves decent-tasting Korean food, San Francisco Soup Company, Buckhorn Grill, Mr. Hana, Andale, and Beard Papa. Not to mention the Bristol Farms (yes, I know it's non-union) and Peets Coffee.  \n\nFar and away better than your average food court.  It does get very packed and crowded and it is often difficult to find an empty seat during peak meal times. Still, the Food Emporium is definitely worth stopping by to get some good ass grub.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-08", "description": "This is the nicest, most exclusive food court I've ever seen. No fast food, no junk. everything's organic and/or gourmet. Pretty cool, but not if you're in the mood for a burger and shake or a warm oozy pretzel.\n\nThe Thai place is pretty good, and cheap: 2 items for like 10 bucks. And the servings are ample enough that you could share with a friend if you're looking for a light meal (as to fit into all those nice clothes upstairs in Bloomies).", "author": "Christy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "As my review of the Shopping Centre itself stated stay out of this side of the SF Shopping Centre as much as you can, but cross over for the food because its amazing. The selection is great and you don't have to settle for panda express, steak escape, or rubio's anymore you can finally have some better more upscale food in a shopping mall. \n\nThe best part is of course the Beard Papa's. Soo good.", "author": "Ali L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "What a food court! There are so many choices and not enough time or stomach space. My girls and I wanted variety for lunch and we decided to take a bus ride over here. The three of us went our separate ways, my cuz had the Thai place, my friend the Mexican and I had American fare. We were all pleased, getting a table took a bit of maneuvering but we ended up with a nice spot to gossip and people watch. This place is great and we'll be coming back for more. Oh and for dessert we all indulged in some beard pappa, yum.", "author": "La C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-14", "description": "This food court will redefine your expectations of \"mall food.\"\n\nActually, every other mall should pay attention.  This not-so-little court has a sample of some San Francisco favorites.  You won't find your Wendy's, MacDo's, or any of your typical fast food mall fare here.  The food here is not a punishment, but a treat.\n\nFrom Asqew Grill, Out The Door, Coriander , to Bistro Burger you can treat yourself to some pretty good eats.  This is a great place to take and seat a large group of friends, if you're in the area.  Everybody can scatter and get what they want.\n\nIt's hard to leave without at least sampling Beard Papa's flavor of the day, or some gelato from one of Melt Gelato & Crepe Cafe's many flavors.\n\nFour stars from convenience, and good food!", "author": "Shea G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-30", "description": "3.5 stars.\n\nFor a mall food court, this is good selection of mostly high-quality places. \n\nCons:\n-It's overpriced. Yes, I know it's in a mall. That doesn't mean that I want to pay $11.50 for lunch. \n-Few vegan options, and no really, really good ones--unless we count the garlic fries at that burger bistro. That's hardly a meal, though. And yes, since this place is trying to be a cut above yer average mall food court, i DO expect vegan options.\n-It's in a mall. That means that you get the dirty little tables, noise and long lines you would elsewhere.\n\nThe bathrooms are clean, though.", "author": "Ramon E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-18", "description": "It's a big and beautiful mall, but I could not find a nice pair of white sneakers. Also the male selection at Bloomingdale and Nordstrom SUCKS!\n\nMy favorite thing about this mall is the relaxation area on the top floor and that yummy chocolate store.", "author": "Chatree T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "Janice says-  Finally we're catching up:  a mall with a market and good food choices in the food court downstairs just like the malls in Asia 10 yrs ago.  Anyways, I like the food court better than the mall.  I mean at least I can afford a sandwhich since I can't afford anything else at the retail stores!  \n\nprops:\n-lots of selection obviously and tastes good.\n-lots of people cleaning up and nice (in a food court?!!)\n-more or less well orgainized.\n\ncons:\n-hard to find a seat\n-$$$", "author": "Janice's A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-15", "description": "(around 11:30am otherwise known as when my stomach starts to eat itself)\n\nMe: \"LUNCH??\"\nFriend: \"where?\"\nMe: \"Oh baby, KOREAN BBQ!!\"\n\n\n. . . when I'm looking to procrastinate from work, me and my buddy go here to get decent korean bbq or my favorite cellulite-maker, Bearded Papa. There's lots of seating, if you don't mind sharing a long table with other touristy/workywork people and having them stare intently at you when you're having a private conversation and interjecting \"Oh that's happened to me to! *giggle*\"\n\nPluses: KOREAN bbq, Bearded Papa, pretty chairs/decor, lots of choice\n\nMinuses: I broke the butter knife cutting the tri-tip from one of the places .", "author": "Glamorous D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-19", "description": "I can move in there today!!  We loved the food court so much that my friend and I were there every day for lunch and sometimes dinner while we were visiting SF for 4 days for work.  \n\nGreat service, wonderful choice of food, and huge seating areas that are clean and well attended.   I'm writing my local LA Westfield begging to bring the same food court to my hood!!", "author": "Yoko M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-02", "description": "PROS:\n\nVariety of restaurants....take your pick\n\nThere are employees cleaning tables and trays promptly when you leave\n\nService is quick\n\nSometimes people watching can be fun.\n\nCONS:\n\nFull of people.....you can barely walk\n\nThe food doesn't seem too appealing\n\nPrices are outrageous\n\nNEVER eat at Asqew. Please read my review on this horrendous place.\n\nhttp://www.yelp.com/biz/asqew-grill-san-francisco-6#hrid:d9DkEPsiKOyt41mUbljCRw", "author": "? ?."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "Are you old enough to remember the old Emporium -Capwell from back in the days? Well, I have. I am glad that they kept the original arch/dome in front of Market Street, It brings back memories. The place is breathtaking for me. The shops are certainly has changed  for the better. Theres a movie theater inside as well. I believe a multi-plex. Food court on the lower level, super market...Good God!\nThe Westfield is connected to the SF Centre. Close to Bart, and Muni.\nGo check it out if you have done so yet.", "author": "Smooth R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-08", "description": "I'm usually an everything eater, even if I don't really like it, I'll just eat it and think of something else.. But the food here is just not for me. The food is tasteless or just gross. The whole place stinks, the tables are dirty and there are way too many people. \nI'd rather skip dinner than going here...", "author": "Helen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "One of the nicest food courts I've been to.  There's something here for everyone: American to Italian to Korean foods, plus desserts and Bristol Farms.  Most of the restaurants are chains, but they're nicer than your typical mall chain -- no Sbarro or Hot Dog on a Stick here.  There are lots of places to sit but it can be hard to find a seat during peak hours as it can get crowded.  Workers usually come around often to bus tables.", "author": "Arthur C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "LOVED this place the first time I wandered in to it on Powell Street muni/bart station. There is so much to chose from and all of the eateries are a bit upscale. Ive probably tried something at every restaurant. The downside however is this place can get packed and during the lunch rush it can be difficult to find seating especially if you are carrying around a tray of food.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "this food court is very good....not like the normal ones we find in all the malls. I enjoy the shopping there too.\n\ntime to get hit the mall again.", "author": "rasaka s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-20", "description": "The best food court I've ever been too. Period. High quality local chains, make this 3 steps up from the Sbarro/Panda Express/Subways/Burger Kings you see in every mall in the country. The mall itself is nice but a  little too trendy and high end for me, but I love good food and will pay a little bit more for it. It gets quite crowded but there's plenty of seating throughout this basement level emporium. Bristol Farms is down there too and you can get even more food to eat there or take out. Asqew, Buckhorn, Pasta Moto, SFO Soup and Bistro Burger are top notch. There's a seafood place I need to try next time. They have a great bakery with real fresh scones, brownies and cookies.\n\nThe clincher for the 5 star rating is the use of regular plastic plates and real silverware. Not as much paper and plastic waste. I hope not too many forks and knifes are swiped from there.", "author": "Jim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "It's expensive. It's crowded. It's also what my friend calls \"The Food Court of God.\" \n\nWhat makes it so godly is the wide selection of non-chain food restaurants. They aren't all spectacular, but it's certainly unique and certainly better than nearly any food court you will probably find anywhere. If you go down to the other end, you can find more chain restaurants. Don't be dissuaded by this- they have one of the only two Rubio's (with crack-laced chipotle salsa) in SF.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-05", "description": "Well, they have tons and tons of stores..... several floors......but it's always crowded.\n\nI haven't just wandered around everywhere yet, but it's so big I could totally get lost.", "author": "Stacy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-14", "description": "The food is definitely not your normal food court food.  It actually bummed my brother out that there wasn't a Hot Dog on a Stick.  Whatever.  Lots of choices for decent prices.  Trying to get a seat was a whole other issue.  The place was crazy packed with people and we had to hover around groups that looked like they were almost done.\n\nThey did have lots of staff around cleaning up the moment people did abandon a spot - so snaps for that.  Had trouble finding food that my six year old niece would eat.  She's one of the picky eaters.  Luckily they did have a pizza place but nothing to buy by the slice.  You had to order and get a buzzer.\n\nI had a combo plate from the Thai food place that was great.  Lots of food and fairly good for eight bucks.  If your in a pinch and in the area, not a bad place for a decent lunch.", "author": "Dawn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "Yum yum is the gelato, also the crepes.  Don't hate on Bristol Farms.  They bring good things to good people.  10 points for the speedy clean up crew, since it is usually hard to find a table.  \n\nOne guy sat down at the table next to me while I was waiting for my friends.  He then informed me he didn't want to sit next to me, since I had a \"bad aura\".  He left, my friends arrived, we ate.  A few minutes later he came back, apologizing, saying he was \"just PMSing\".  I said I understand, it happens to me too.", "author": "Ariana N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-06", "description": "As far as food courts go... this is just pretty damned amazing. \n\nI dont know, but when I was told that we were going to a food court, suddenly I just lost my appetite. Visions of General Tsos chicken under heat lamps and bad pizza were called to mind, while the sound of children running around with hot dogs on a stick echoed through my mind. *shudder*\n\nThis was nothing like that... very modern looking, open space, and a variety of food that... well, as compared to the food court in my mind... that I actually wanted to eat. Everything from Korean to Mexican, from Thai to Salads. \n\nWhen we were in a pinch for time (headed out drinking, priorities here, you know), we needed to get something in our stomachs (one must be responsible, after all) and needed to appease seven diners (though, luckily none of them are picky). Thus, one of us recommended the food court (and was prepared for the reeling looks of disgust on our faces, and to talk us off the ledge (or onto the escalator, as it were)). \n\nGive it a shot...  its a good step up from Food Court food... I think I might even head back there for lunch today (the Thai place is calling to me)", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-04", "description": "Had food from Bistro Burger: Great! Loved the variety of vegetarian burgers.\nHad food from Pasta Moto, also nice, but way to much garlic in the Penne Pomodoro. That says a lot coming from me, because I really adore garlic. But I think they burnt the garlic as there was a bitterness to the taste and also my boyfriend could smell the garlic from my mouth while sitting at the other side of the table. Bit embarrassing this time, usually I don't care if I smell like garlic, but this time it was a bit TOO extreme. My boyfriend enjoyed the Panino Caprese, but we thought it was weird that you get salad and POTATO CHIPS with the sandwich. But still, good food.\nWe also went to the Out the Door restaurant since we couldn't order noodle soup to go. Weird. Our waiter was helpful and friendly. My boyfriend enjoyed his chicken, not very special though, and I found my vegetarian noodle soup quite bland, definitely not going back it's way too expensive.\nAlso had a mint choc chip ice cream at Melt which was nice.\n\nOverall the food court at the Westfield is clean and most eateries aren't expensive but do have tasty food. So 3.5 stars.", "author": "Bekkah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "WOW! This place blew me away! We started our mini vacation here by grabbing a coffee and waiting for our room to be available. We couldn't believe the amount of people at the food court! This was the only downside of this food court. We pretty much had to fight for our seats. If you do not like crowded places this is not the place for you!!!!\n\nThey had all types of food choices, Soup and salad, gourmet burgers, fresh japanese, Hot dogs, Vegetarian, Crepes, Thai, bbq, Mexican and a few others I can't recall. \n\nSo I had the Japanese and the hubby had the bbq. \n\nThe japanese food was amazing for just being food court food. I got the teryaki chicken with rice and stir fry veggies. YUM.\n\nHubby got a Tri-tip sandwich and onion rings. YUMMY!\n\nSo if you want to kill some time and do some shopping this mall is awesome, the food court was amazing and its really clean. Also you can catch the MUNI and BART right off the food court so that was awesome! We had lunch on our way out of town and grabbed the bart back to SFO!", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "There are a lot of great places to eat here if you happen to be shopping at the Westfield Mall and just don't feel like leaving the mall for lunch or dinner. I usually go to Bristol Farms and buy one of their prepackaged Salads, Turkey Rolls, or a Falafel Sandwich. They're  not actually cheap, but the good quality and convenience is worth it. I also sometimes go to Sorobal and order the Korean BBQ Chicken with Noodles. It's kind of a pain when looking for a table when it gets really busy--that's why it is best to try not to eat there at the peak of lunch or dinner or else you may find yourself spending as much time running around looking for a table as you will eating your meal. Also, the restrooms have attendants and have those great efficient Dyson Air Blade Hand Dryers--no more wet floors to slip on.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-03", "description": "I like their big mixed salad that includes guacamole, sour cream, meat, lettuce all in a crispy shell. The other Mexican stall sells a better version though. Cost was about $13 but well worth it. I could eat about 3/4th of it so I can't share but I cant finish it either.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "The best fast food-dine-in style place around with good quality food!!.. Price is high but if you were to buy this kind of food at an actual dine-in restaurant, then you would be paying double on what it is.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "This is probably the most diverse food court I've seen...ever. It's got almost every single type of food you could want on the bottom floor. It gets pretty crowded around lunch time, but it's still a great place to stop for lunch.", "author": "Eugene H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-24", "description": "Oh yeah, it is one of the best places to dine. Look at the prices too. $2.50 for an Eclair, $9.00 for a small bowl of Korean BBQ, $9 per pound for fried rice and chinese food from Bristol farm, etc., Overpriced fast food court in San Francisco.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-17", "description": "How sad that Westfield has turned SF into just another big city maul... I've seen the same stores in Chicago, NY and all over the country - none of these chains creates a sense of place or really reflects the uniqueness of San Francisco.\n\nThe food court is really nice and the movie theatre is all plushed out with the latest mod-cons (Like LEGROOM!)\n\nI'm glad they kept the dome but everything else is just too generic...", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "This mall food court is probably one of the nicest and most luxurious of mall food courts I've seen in California. Lots of seating, lots of food selections, I'd recommend dropping by for lunch or just to check out when cruising around Wesfield mall in SF.", "author": "Uland L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "I come here more often then i like to admit, a food court?? srssly you may say, but this one is a bit more upscale. Lots of great options like Out The Door, Coriander, Korean BBQ, Japanese bowls, pasta, buckhorn, beard papas, oh my!   Tons of seating as you would expect from a food court but what is nice, is that you can get what you want and your friends can as well.  All the while you can share a table. Worth a visit to the westfield to have some food court fun!  afterwards you can go shopping to work off those lbs.", "author": "Ka C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-20", "description": "Yeah, it doesn't have Auntie Anne's, Orange Julius, Cinnabon or Mrs Fields, so what exactly is this food court good for? If I wanted to eat real food, I would not be at the mall.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-20", "description": "Expensive and people don't throw away their trash after they are done.  Too much people and its nice.  Rather go to Jack in the Box on Mission near 4th st.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "This food court is the bomb! It doesn't really look like your typical food court. The place looks really trendy and sophisticated. The variety of food here is more upscale than other food courts that I've been to. I ordered from the Coriander Gourmet Thai and Sorabol Korean BBQ & Asian Noodles. Both place tasted awesome and their prices were not bad- about $10 for a combo plate at each place. I would definitely come here again. Next time I will try the gelato at the Melt Gelato & Crepe Cafe. Seatings could be kinda hard to find if it's busy. If you come here in a large group, good luck with finding a table to fit all of ya'll.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "I can't imagine a food court getting much better than this one. I mean, how can you really judge it outside of variety, prices and seating? It has the most selection I've ever seen and I've been to A LOT of malls...a lot, a lot; nothing compares. The prices are reasonable, I wouldn't go as far as to say they were cheap but really, outside of Taco Bell, what's considered cheap anymore? I'm paying $7 for a cup of soup now for peets sake. Lastly, there is plenty of seating. Even on a Saturday I've never had any problems finding a place to rest my tired, shopped out feet.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "Great high end food court when traveling in a group and not sure where to eat in the area. They have wide selections for everyone. They don't have your typical food chains like McDonald's, but something a little more expensive and fancier.  It has a nice clean feel to it since they use real silverware and they're all the same for all locations in the court. They have people coming around to pick up after you so you don't need to throw your garbage away like normal food courts.", "author": "Annie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-05", "description": "Definitely not your typical food court. For a food court, this place sure gives you some great options. There are some over-priced stores, but some of them come with good quality food and large portions (see my review of Sorabol in this food court). We like Sorabol's korean food, Corriander Thai's thai iced tea, and Beard Papa's cream puff.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-24", "description": "I'm especially fond of the salad bar at Bristol Farms, but love that the food court caters to all different tastes: salty, sweet, and fried!  You can't beat the variety of quality food choices plus there isn't an additional 20% tip tacked onto the prices of a regular restaurant.  I didn't realize there are alcohol options too, so I will need to seek that out next time.", "author": "catherine g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "If we're downtown and it's time to eat, I'd say half the time we end up here.  Why?  Because they have a great selection of places with decent prices and a reasonably nice atmosphere, for a food court.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-08", "description": "i have never been to a food court, er, i mean emporium, where they serve alcohol.  it's amazing.  now, i'm not a lush lush, but i do like my wine.  and the meals here are worthy of being had with wine (and not an O.E. in a paperbag like other, less sophisticated food courts).  \n\nhowever, most of the restaurants close at 9 which is a bummer if you are going to see a late movie.  and i have to take off one star for the possibility that i might drink first then shop while lacking all inhibitions and spending way too much money at bloomies.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-27", "description": "Any food court that does not have a Panda Express, Nathan's Hot Dogs, Cinnabon, Sbarro or Taco Bell gets 5 stars from me!", "author": "Marina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-26", "description": "For the most part, I avoid the greasy, overcrowded, calorie laden crap they serve at malls.  The smell of sbarros next to some Japanese teriyaki   joint literally makes my stomach churn.  Especially when the smell of over-sugared 3yr olds are thrown in the mix.  But one day I found myself in need of substance after a long afternoon of working out my credit card, and decided to descend the escalator into the underworld.  And to my surprise I discovered a smrgsbord of delectable cuisines.  So I did it...I gave the \"food court\" a shot...and you know what....if was good! Sure the price is a little high...But after spending $350.00 on an amazing pair of Marc Jacobs, 4 inch, peep toe heels, what's another $10 for a great salad?    After all...shopping takes alot out of a girl!", "author": "Charisse F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-10", "description": "Don't recall seeing a better food court with richer options. And they have people cleaning up your trays & tables during and after!", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-18", "description": "Despite the basement food court ambience, a delightful choice for a casual meal. So many choices, and some are exotic: Pad Thai, kimchee, hummus, grilled salmon and salad, gelato - find it all here. This food mall is noisier but better-lit and more active than the much smaller one in the Metreon across the street. Both have nice, friendly staff, though. Excellent value for the money, and who doesn't value that, these days?", "author": "Cecily B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-16", "description": "Wow..some of the below reviews about this food court are hilarious (in an I'm laughing AT YOU sorta way).   \n\nI didn't know that UNTASTEFUL was a word!  haha...\nthe spellizations and grammaticizing is excellentable.\n\nOKAY..back to the place.\n\nTHE AMENITIES.\nThe food court  was very clean, very nicely furnished and has a high end contemporary feel.  Lots of wooden chairs, grey metals, etc.\n\nMISCELLANEOUS OBSERVATIONS\nDid no one else smell the STRONG WHIFF of synthetic sweet/sour sauce smell??   My friends and I could smell that from all the way inside Bloomingdales while walking past the women's bag section.   It was so strong..it almost made us turn around and NOT go into the food court.\n\nThe cleaning staff around the food court were attentive and for the most part really nice.  Except for the guys toting out the big rolling  trash bins.  Those guys were from the wrong side of the hood rehabilitation program, and were mouthing off at patrons \"Get the hell out of the way...man!..Damn!\" as they carted their trash bins through.   Their manager seemed to look the other way.    I'm not so sure how long that will last before getting addressed.\n\nTHE PEOPLE (*sigh)\nAt the same time, if I had to encounter the patrons like the ones at this food court, I'd probably be yelling like those trash guys were too.  (Not to condone what they did..but I UNDERSTAND...=) )\n\nSNOOTY SNOOTY SNOOTY.  \n\nSprinkled all over the footcourt was like a casting call for all \nthe young girls who wanted to be on the show Laguna beach.\n\nLots of Abercrombie Blondes, and the token azn who could look very slender chic, or could be lumbering w/turnip like ankles.  Depends on which food they were eating =)\n\nLots of big sunglasses, tight jeans, rhinestones, and hoop earrings.\nOh and lots of purses w/Coach brand \"C's\" plastered all over.  Just spells CLASS.\n\nLots of blazer wearing sneaker heads w/a skull cap if you're hip hop..or spikey hair if you're not.  Holla if you hear meh!\n\nPeople sit, and look at or THROUGH each other..if you will..in a very pretentious way..as to check what other people are doing...but make a futile attempt at faking it =)   \n\nAmidst the faking funk, you'll find some upscale burger joints, salads, pastas, etc.\n\nThe most popular restaurants seemed to be Sorabol (the sweet/sour version of korean food..hence the popularity)..  Barebecue'd meats, sugary sauce w/brocooli and some rice.   Yum.\n\nCoriander Thai food (see..Sorabol)...Some of the smells there though..yikes..putrid.\n\nand Buckhorn.   Buckhorn was the fast food version of an awesome steakhouse chain up in the Sacramento area.    The meats are still very good here, and if you want to sit and oogle the cute laguna beach patrons..you'll find them here.\n\nThe foods around the foodcourt are more upscale than a regular run of the mill foodcourt w/corndogs etc....but you also pay for the upscaling.  Meals are 10 dollars minimum (that's w/drinks included)..which people happily pay ..for the ambience.\n\nCheck out the center aisle's gelato shop.  The ice cream is displayed in giant rotund containers and neately pack into thimble sized cups for 3 bucks a pop.\n\nPricey mall food, pricey ambience, overly blatant patrons fronting to the extreme.   But hey..maybe that's what you want??\n\nIf you drop 800 bucks on a ready made suit in Bloomingdales, or get a 800 dollar handbag there...what's another 20-30 for lunch?", "author": "Michael L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-15", "description": "I liked the idea of them making you a salad with your burrito and the presentation was great. However when I sat down to enjoy luch I picked up the burrito and it was covered in green oil from what ever was on the salad. then i take a bite and it not the meat or beans that I orderd WTF", "author": "Donyell T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "Ken and I played hooky on a work day. Our first time to walk through the new Westfield SF Shopping Centre Food Court. It was absolutely breathtaking. kinda.sorta.notreally. But seriously, it was an awesome experience to walk around and look at different menus. It was busy on a Monday afternoon. It was definitely a treat, granted I had never gotten the chance to go walk around here while I was working in the FiDi. I wished I had sooner.", "author": "Mika D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-29", "description": "OK - I love the food court here at Wesfield.  Still love it now, though I had a really bad experience at Corriander - the Thai place.  After finished shooping and feeling tired I wanted to go home, but thought I'd stop by at Corriander.  This was probably my fourth time going there.  I got the usual Chicken Basil dish with rise, eggroll and Thai ice tea.  This time I decided to take it to go.  I couldn't wait to eat when I got home.  After few bites, I realized myself kept chewing, chewing and chewing but the thing I chewed I thought was chicken, it just wont break away in my mouth.  I was curious I spit it out and examined what I was chewing.....until...then I realized...it wasn't chicken...or bone...or plastic that maybe somehow got in the food...but what I was chewing was......\"A huge frieking french manicure fingernai!!!!!!!\"  I was grossed out, I felt sick right away and I threw up big time.  I was feeling sick with the thought that i was chewing a human being's fingernail....someone's fingernail....that maybe belong to the cook?   That was pretty DAMN GROSS!!  I was thinking going to them and tell them what I ate and that it was unacceptable, but it was always late in the night - around 9 pm, so I decided to just forget it and not think about it 'cause it makes me feel sick everytime the thought of me chewing someone else's fingernails makes me wanna throw up and I did many times.\nSo, from then on, I decided not to go to back to Corriander.  It's too bad because the food was good, but after that point on, I don't think I can ever eat there again -I just think that whoever it is the cook that prepare the food, they should probably wear gloves.  I am a health freak - now I trust only my own cook/caterer who prepares my daily food.", "author": "Jasmijn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-17", "description": "2.5 stars. Been here 4 times, and each time I tried something from a different stand/stall? I've tried the Soup, Thai, Korean, and Mexican. Not the best quality in food but had a better selection than your regular everyday mall food court. It does get overly crowded and the prices are much higher than you would expect for fast food at the mall. 2.5 stars for the concept and the variety of the selection.", "author": "Em T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-24", "description": "Yes, I am giving it a 5 star. The food might not be restaurant quality, but this is truly the best out there, a five start food court compare to other food courts. The decor and the food is unarguably the best I have seen in a food court. I guess that is why they named it food emporium.", "author": "Jose K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "Coriander Gourmet rocks for mall Thai food!  Though slightly overpriced, they actually give generous portion sizes and the quality is very decent.  I ordered rice w/eggplant and tofu for myself and the noodles w/chicken for my friend, and we both were very happy with how everything tasted.  Though the food court looks great, the noise and crowds are not my scene.  I say this is a solid take-out joint, esp. if you went shopping and want to grab something to go that's quick and on the way to BART.", "author": "Swetha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-12", "description": "im wondering why as a whole this place has such high ratings (4-5 stars) but when i look up individual restaurants they are mostly, if not all, 2-3 star average places? \n\nive tried enough places in this \"food emporium\" (sorabol, coriander, andale, melt, buckhorn grill, and that sandwich place next to sorabols) that i think i can safely say that this place is a collection of overpriced food masked in a \"fancy food court\" facade. yes the presentation was good, yes the quality of the food is fresher than say, taco bell or mcdonalds...but for like 5 times the price it better be better.  I think people are better off going to places that serve good thai food (king of thai) elsewhere than a place where they serve meh thai food but if everyone wants something different and cant agree, then yes this place would be ideal.  but just seriously be blown away by the prices. NOT cheap.", "author": "Peggy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-14", "description": "This posh food emporium won this out-of-towner over. Best food court in America, folks. Classy, modern decor + excellent food + tons of vendors to choose from = win, win for me! You San Francisco people disgust me over how much you take for granted here in this city! Food court, schmoocourt, this place is gooooooood. If I had wanted a Taco Bell, Sbarros, and other cheap eateries, I'd be in Milpitas.\nMy local friend introduced it to me since we were \na) on a budget  and b) undecisive about what we wanted to eat. The choices were outstanding: gourmet burgers, tasty thai dishes, korean bbq, beard papa's, japanese sushi/bentos, american comfort food, crepes...wow...it was like the United Nations of food here.\nYou totally have to try Tom's Cookies, wow, they were damn good. I ate like 8 of them in 2 days.\nSince it was so near our hotel, this was a great place to go get some respite from shopping/sightseeing and honestly, all the food here was good. I sampled it all...Bristol Farms is a great place to grab snacks for the airplane ride, it was tres gourmet. I applaud this city for making even its smallest food experiences exceptionally fun, pretty, and tasty.", "author": "cindy w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-13", "description": "Ah, it's that time of the year again where the egg nog flows and the mistle toe hangs and the sweet smell of ginger bread fills the air and of course there is the dreaded holiday shopping.  Westfield however does not satisfy all my shopping needs as I thought it would.  The shops are not all that great because you can find flagship stores around the corner in Union Square.  The food emporium downstairs is absoluety amazing though.  I just wish that there were better stores.", "author": "Darren I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-01", "description": "This place is amazing. It's big and beautiful, and almost impossible to decide where to eat. I have only been there twice and the first time I decided it was just too much and went to eat at Panda, and the second time, I decided to splurge and headed to Coriander Gourmet Thai. The food. Was. FABULOUS. So good. Considering that it was the most expensive food court food I'd ever gotten, I was thoroughly satisfied. I only gave 4 stars because of the crowdedness, the trays (I agree!) and the prices.", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-07", "description": "CLASSY CLASSY CLASSY, thats all i have to say about thie food emporium.  I stepped in and in minutes i was battered by the many delightful smells of fine dining. lol okay maybe not fine dining but it is really really good. Theres ample room to sit and eat and the surplus of choices makes it an excellent place to dine anytime of the day. I also heard the gelato was amazing.", "author": "Kalvin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "For the most part, this is a lovely place to dine in -- I just wish that there were different dining options. I feel that this could have been a fantastic way to show that San Francisco has a great history of culinary options, instead we get a slew of the same old restaurants, SF Soup Co., Bistro Burger, Asqew. They are good but with this fantastic new building, they decide to place restaurants that are already available out the front door of the mall within a few city blocks?", "author": "Taylor P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-14", "description": "Fanciest food court ever!  I'm sorry, \"Food Emporium\" (my bad).  Seriously, this is a very pleasant and convenient place to grab dinner before going to the movies upstairs.  Actually the Emporium is so clean and shiny, I would probably eat here even if I had no business in the mall.  I mean \"Centre\".", "author": "Anna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-20", "description": "I am amazed at any food court that serves food on real plates and give you silverware - wowwww!  I love coming here during my lunch and shopping for the food - feel like a kid in a candy store.  Love Coriander Thai - amazing spicy food and Andale - large portions of Mexican food.  Also love Beard Papas - be careful when you eat the puffs  - you will get a beard of sugar - muahahhaa!  Skip the gelato place - does not taste like gelato, but pretty looking ice cream.", "author": "Ramoners D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "I really enjoy all the different options available, but seating is always a pain.  The only time I have been where I was able to find a place to sit easily was during breakfast time (around 10AM).  The Mexican place has a great breakfast burrito.", "author": "Jenna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-03", "description": "I can't give a food court 5 stars, but so far everything I've tried here has been really good.  I work half a block away so it couldn't get much more convenient. While more expensive, it definitely beats the Lee's deli rut I was in for years. On my last visit I had a spinach salad from the burger place, it was huge and delicious and worth the money(although next time I'll get a burger from the burger place).", "author": "Jen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-12", "description": "i thought i loved the food emporium. 'bristol farms' is great for a quick mac 'n' cheese, 'out the door' has scrumptious chicken buns and 'peets coffee' will take care of your post-lunch food coma. \n\nbut today, when a friend and sampled 'mr. hana' and sat at the south end of the emporium, we were surrounded by fruit flies! fruit flies take all the fun out of of an otherwise lovely lunch of  tender teriyaki chicken.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "Wow! This \"food court\" makes me want to move to San Francisco.  I got food from the Korean BBQ restaurant (ribs and spicy pork combo), and it was fantastic! Then I topped it off with a cream puff from Bearded Papa. It was almost as good as my grandmother used to make them back in Russia. I'm a fan!!!", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-28", "description": "Usually food courts in malls consist of McDonalds and Burger Kings. This place has a way better food selection. It's a pretty big place and lots of places to sit. I try and go eat here everytime i'm in SF. My cousin lives in SF so i want him to take me here. haha.", "author": "Garrett L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-16", "description": "I like Coriander Thai but the other stalls seem to serve Asian food too.  I think there's only a few vegetarian choices, like curry or side dishes.  Its always busy in here so there are long lines and noise.  My boyfriend gets too overwhelm to remember to order wine.  This is the reason I always get a hotel that has a microwave/refrigerator instead of going MacGyver with an ice bucket.", "author": "Ai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-27", "description": "I am not a fan of mall food courts but this is by far the best food court in the U.S. that I have ever been too.  Nothing beats HK food courts.   But in terms of food quality and variety this place has it all.  You can pretty much get anything you want here.  If you can't find it all the food stalls then I am sure Bristol Farms will have the rest.  When people come up to visit and ask me were to eat in downtown I always tell them to come here because food in the downtown area sucks unless you want to spend some dough.  They think I am crazy.  But look at me!  Have you seen my big belly?", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-04", "description": "Best food emporium on earth, hands down.  The vast selection is crazy.  Huge portions.  Minus one star for the insane crowds and noise.", "author": "Hannah G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-26", "description": "How difficult is it really to grill a chicken breast, throw on some sauce, put it on rice and add steamed/bland veggies..? I was disappointed at the lack of flavor the spicy chicken bowl had.  I guess that's what you get for trying to catch a quick meal at the mall.  However, there are a ton of other places in the emporium area to try that seem like they don't fit that stereotypical \"food-court\" stigma.  Definitely won't come back here.", "author": "Candice M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-25", "description": "My goodness! This place is so fancy for a food \"emporium\" in a mall! I LOVE IT! It has Beard Papa and some awesome iced tea place, I forget the name of. They also have Bristol Farms market here which has just about everything you could ever want!", "author": "Krystal N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-14", "description": "I love the variety at this place and it was really quick. The quality leaves something to be desired, but overall for a food court it's great.", "author": "T G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "I just enjjoy this food court so much! When my boyfriend and I take my son there for the 3D movies, my son loves trying the different foods. He seems to enjoy trying the sample foods and then asks to eat what he likes. He likes the Korean food for some reason. I have no idea how to prepare Korean food at home. This makes me laugh b ecause he will be cooking for us befoe long. Great Place!", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "I'm also not sure what the big problem is with this place.  Plenty of places with food a step above typical mall food courts.  Definitely a decent haven if you need some place to catch your breath while your girl is on some shopping frenzy.", "author": "Shon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "FINALLY!  A food court I enjoy and even look forward to going.  Today is my brother's birthday and he requested us to come here to celebrate.  Dang it, that sounds ghetto!  But I agree with him that this place is so much fun to go. We are especially fond of the court that serves tri-tip (i forgot the name).  Being from Hong Kong, we're used to food courts of this scale and have always been disappointed by most American mall food.  I'm so happy we finally have something like this to show my foreign friends.", "author": "R A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-25", "description": "Love the food emporium! Very good food court so far.. a little too trendy and modern for a food court, but, it's SF.. and it's in Westfield... so, I guess!! Quite a few of Asian cuisine =) and they are pretty good. Couldn't believe that I am excited about going to a food court now!!! They also have good dessert places such as Beard Papa.. yumm.. love their cream puffs, especially with the cookie crunch in it! Man, I'm addicted to the thing! and it's cheap too in here compares the one in Hawaii (honestly, only in SF I tried it and gosh.. oh, soo good!!) And, there are plenty of seat so you don't really have to wait for people to get up.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-05", "description": "SO MANY CHOICES! I love this food court. Everything is good.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "not at all your typical run of the mill mall food court.  this one has a better selection and is far more upscale (and pricier) than any mall food court i've seen. you won't find the usual mcdonalds (ewww) and sbarro (kind of ewww too) here.  instead there's a branch of andale, bistro burger, a good pizza/pasta joint (forget the name) and buckhorn grill.\n\nthe variety makes it a really great place to meet friends for a meal - everyone can find something - yet it's not fast food.\n\nthe atmosphere can be a bit off putting at times, it's loud and crowded.  but trust me, you won't find a nicer food court in a mall.", "author": "Karen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-28", "description": "Not bad for a food court in a mall. I liked the real silverware and place-settings, nice touch. Good place to grab lunch or an easy dinner before a movie. My fave: Coriander Gourmet Thai (mmm green curry chicken, so damn good!). Least favorite: Out the Door- I felt that they missed the mark on this, food was sub-par, especially considering the yummy goodness that is Slanted Door.", "author": "Dana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-25", "description": "Some M-Fdays I am sooo over the workingbs that I need a respite from it all and go here for some foodspiration! Surprising that this foodcourt actually thought about OUT the doork, TEAz, BristolianFarming, Bearded papazpuffies...oh what a paradise the CITY can be...now what about that Trust Fund, sweet babykinz?", "author": "miriam b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-04", "description": "It's alright, but what is up with the seating, namely the microfiber booths?!  They are downright filthy!!!  Someone needs to wipe them down immediately.  I guess that's where all the families with kiddies sit.  Consider yourself warned.  Find an open table with the wooden seats if you can.", "author": "Poker B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-15", "description": "Not a Food Court... but a Food EMPORIUM!\n\nAll the regulars are present; burger, Chinese, Japanese, Italian, Mexican, pretzel, etc... with a little extra Korean or Thai twist thrown in. Of course the names have all been changed so you can convince yourself you are eating something fresh and exciting.\n\nSure the food is a step above typical shopping mall fare, but the prices are a few steps higher. Good for a quick bite after a long afternoon of worshiping at the mighty temple of consumerism, but if it is dinnertime, do yourself a favor and try some of San Francisco's great restaurants. I hear Yelp has good recommendations...", "author": "M. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-05", "description": "Ok, it's just a food court but it's not like your typical food court you'd find like at say, Serramonte or Stonestown. It's a little more 'upscale'. You just have to try it yourself and see how you like it but be warned; this place gets really crowded for some reason.", "author": "Conrad C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-27", "description": "Okay. As far as food courts go, this is amazing. All you have to do is knock down some poor, starving picketers on the way to Bristol Farms to get yourself some ahi poke salad or a tri-tip sandwich.\n\nOr, if you're not cruel and heartless like me, you can go to the Slanted Door take out and get yourself some really overpriced but yummy rolls and buns.\n\nOr, if you're a cheap bastard like me, you'll just wait in line at Sorobol and eat some fast food Korean. Yum. Big portions + cheap = good date food right before the movies upstairs. Just remember: kim chee NOT = good date food for both its garlic effect and it's cabbage effect. (Unless you're already married, in which case, it's their own damned fault they married you, stinker.)", "author": "Tracy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "Nice shopping complex.  Can spend a whole day shopping, eating, reading at Border's, and catching a movie.", "author": "Dylan's Aunt E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-08", "description": "I didn't expect a good Korean restaurant in a food court in a mall but Sorabol managed to do it.  It's cafeteria style and the line moves fast.  I had the calamari one time and the salted fish another time, and both were good and really spicy but high sodium city.  Large portions and also all the kim-chi that you want.  The price was above the usual food court cheapo but, hey, this isn't Panda Express.  And no tip is necessary.\n\nSo, if you're hungry and aren't ready to get on BART for the burbs--the Powell St. station is about 50 yards away--try this Korean place.", "author": "Murray S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-15", "description": "The roadhouse salad with tri-tip is amazing! My boyfriend and I split the salad and felt full and satisfied. The tri- tip was cooked perfectly and all of the veggies were fresh and crisp. Good times!", "author": "April H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-12", "description": "H.E.A.V.E.N.......I have been here so many times and its always been so much better.... or at least comparable.... to the pricey restaurants in S.F. The hi - lite? Mussels and clams over french fries. In a slightly creamy white wine sauce. For food court price. O....M....G. I've tried to re-create this food court wonder but it's never quite as jaw droppingly amazing. And all of the food vendors serve your food on chic white CHINA (... or great imitation) plates.. with REAL silverware..... and the booths are so comfy! Even a shorty like me can reach the table and still sit back in comfort. All of the food I have eaten has been FRESH and top quality. I just can't get over the fact that for the years and years I have been coming here... hung over from the crazy S.F. nights before or after a foot murdering day of shopping,  their food has been CONSISTENTLY amazing, satisfying, clean and fresh. If only you weren't a horrendous traffic drive away food court... if only...", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-15", "description": "This is not a food court, it's a food haven . . .a glutton's dream (like me!). Descending down the escalator into the sweet smelling lair, I have to keep myself from jumping and clapping my hands in glee. I don't go to the Westfield Shopping Center for Bloomingdale's or the Juicy store, I'm there for the food. I know it's not Gary Danko's or House of Prime Rib, but come on . . .it's a food court in a mall, and this one is at good as it gets. There are no Hot-Dogs-on-a-Stick, Mickey D's, or Sbarro's (if that's what you want and are complaining about here, then go to Hilltop Mall!) It does have a Sorabol however, which substantiates it as a real food court.  Everything else- the real plates and silverware, the larger-than-normal portions, the gourmet vendors, and the busboys that clean up after you- sets it apart. My mission is to eat at every spot here (except for the Mexican joint, but just because I don't like Mexican food). So far, I've only made it to Coriander Thai, Bristol Farms, and Teaz Me because I have a problem of always sticking to what I know and like. I have to get a little more adventurous if I want to reach my goal.", "author": "Alice P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-11", "description": "I have a built-in aversion to food courts (and shopping malls in general), but if you live in the city, sooner or later, you're going to find yourself in one.  And as food courts go, this is about as good as you're going to get.  Maybe things have changed & I've not been around to the food courts & shopping malls lately, but I can't remember the last time I ate at a food court off of REAL plates, knives & forks, and was able to get a REAL glass of wine (served in a REAL wine glass)!  As for the quality of food, I haven't eaten at EVERY place there, but what I HAVE tried was more than passable (and a lot better than I'd expect from the setting).  I went to Coriander Thai, and had the mixed vegetables & spicy green beans with fried rice (...and got a glass of white wine from another establishment, which was also better than I would have expected).  I must confess, my food was tasty.  Usually, in such a pedestrian, mainstream sort of setting, you would expect spicy dishes to be really toned-down for the masses, but my spicy green beans were PROPERLY SPICY and tasty, and my mixed vegetables were about as good as one can expect for such a boring dish.  And I would say that it was reasonably priced, as I got a literal MOUNTAIN of food for about $10.  Much more than I could finish.  Beyond the food that I had, the options in this food court all look like food I could actually CONSIDER EATING, unlike most food courts, which offer crap after crap after crap.  So, I won't be making any special trips TO this food court, as I will always prefer to be in a proper restaurant setting, NOT surrounded by all the mainstream, bridge & tunnel peeps & screaming kids, but if I find myself in the area again, I do know that I at least have decent options available to me when I get hungry.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-04", "description": "i love this food court.. or i guess they call it a food emporium, since it's so nice! the first time i came here was during a usual trip to SF for shopping, and i noticed that the westfield had been extended and the new section was finally open. ok, so the new side of the mall wasnt anything to be too surprised about since there are many malls that look about the same. However, the food court was definitely something I hadn't seen before. There are so many food options, and they are all differet from the usual food court choices. also, the food at many of the places are actually pretty damn good. the food comes in generous portions, and if you got me take out from this place , i would have never guessed it was from a mall food court/emporium. ive only tried the japanese and mexican options here. both were pretty good. but i love how the gelato/desserts and tea place looks.. also, they have a beard papa's! WOOHOO! (:\n\nalso, instead of waiting in line waiting to hear your number, each place gives you the flashing/vibrating pods that you get at restaurants. neat for a food court. also, there are people who bus your trays and items. good service. i just feel bad that the majority of the people working in this area are on the older side. \n\n\nif you're in SF and dont want to spend a lot of money at a restaurant, definitely visit this place. pretty cool.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-08", "description": "I like this food court . It's very extensive and has a lot of options . The new side of the mall is the more expensive , more gorumet , and nicer part of the food court . The older side is the cheaper part of the food court and has more fast food . Overall , there's a little something for everyone . There's sandwiches , pizza , pasta , burgers , soup , cream puffs , Korean , Japanese , Thai , pretzels , etc.  I like the food court on the newer side of the mall more . I haven't seen a food court inside a mall in the bay area that has more gourmet foods like the one in this Westfield does . Most food courts only have cheap fast food . I haven't seen one with so many options either . I almost forget that I'm in the food court sometimes !! Why ? Because they have people cleaning up after you like in a restaurant . Also .. on the newer side of the mall ,  you can get your drink  or food \" For here \" and they will give you a glass cup and plate instead of a to-go cup or to-go box .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-04", "description": "this is really is a food emporium...better then any mall food court i have ever been to\n\nandale mexican restaurant- super good, great guac. fantastic chicken quesadilla's; good for sharing\n\na little bit expensive, but aren't all food courts/emporium's expensive...\nat least this one feels a little bit justified", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-19", "description": "Oh, Westfield food court, why do you keep pulling me back into your arms?  I wade through the swarm of people on Market and make way to your unusually heavy doors and to your escalators.  The molded plywood chairs are just high enough so that I can watch the people roll in and around between the tables and alleys of the food stalls.  There are mall workers and business travelers and tourists and local software hotshots and of course the gorgeous women refueling between bouts of shopping.  I am breathless and hungry for the seafood, the soup, the Thai fare, even Buckhorn who teases me with big chunks of beef but not that Askew place and indulge every so often, and once too many times, in a shouting match with that person who just cut me in line.  Don't get between me and the food court you animal!  Did I mention the folks at Peet's Coffee (OEM) are superb at pulling shots and making that Americano just right and hot?  Go forth; indulge your senses and feed.", "author": "Iqbal Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "its a very cool place to shop and eat. my kids love the 4ht floor its very beautiful and fancy.    the food court is excellent except there is lots of table but not enough chair, it took us awhile to sit down and eat.", "author": "Lancy L."}
