{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "KOREAN in the MISSION!? \n\n:: The crowd goes crazzzyyy::\n\nLadies and Gentleman, you may need a new pair of undies for this review; this is one of those panty-dropping places, baybee; given the ladies a lil' twist with the wild and foxy décor on the walls and the sexy red dim lights, and the BOMB Slushies that they are known for (be careful, they do catch up to ya'!). \n\nMy Yelp bud introduced me to this place during my birthday weekend. I was in ahh once I walked in. The artwork on the outside of the walls will have anyone believing that it's an abandoned mural building (totally normal in a City like San Francisco). Walking into Foxsister takes you to a whole new world; a place where you can find delicious food, great service, and a festive atmosphere! Everything from the red booths to the purple glitter bar and the fun slushy machines definitely gives this place a unique look and feel. \n\nFor food options, we started off with the Foxsister Kimchi Nachos with the Pork Skins. The cheese reminded me of the queso sauce that was blended and topped with Korean Chili Flakes, scallions and jalapenos.  The Dungeness Crab noodles were EVERYTHING! Talking about DRUNKEN food, whoo! Make sure you order the POG slushy that goes well with all the tasty food items on the menu. Foxsister is truly known for their fun Korean vodka slushy drinks! \n\nFoxsister earns ALL 5 STARS because of their fabulous customer service. Once our lovely server found out that it was my birthday, the next thing you know, the server arrives with a birthday treat filled with ice cream, **coconut mochi, and other tasty toppings. It was the sweetest thing; THANK YOU TO OUR AMAZING SERVER FOR MAKING MY NIGHT! \n\nOther reasons why I truly love Foxsister...\n\n-Close proximity from the BART station\n-Parking is easy to find around the area\n\nLast but not least, it's a true hidden gem in the Mission! Do yourself a favor and go check this place out for yourself! \n\n*The coconut mochi was enough for me to decide that I WILL be coming back! I can eat that alone and be right in heaven; YUM!", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-02", "description": "The restaurant is a very hip and modern Korean fusion restaurant. I came on a Thursday to catch up with two of my friends, and parking wasn't too bad since it was night time. The hostess and servers were also friendly.\n\nThere were two items that we wanted to get but they didn't have it, so make sure that you have a back up dish in mind.\n\nKimchi nacho cheese dip - The chips were huge but this appetizer was a  good start before the meal. The cheese was tasty and the jalapenos had the perfect amount of spiciness.\n\nHalf chicken - We had two of each flavor, but I only tried the sweet and spicy since I was too busy talking. It was pretty sweet, but also crispy. One thing to note is that the chicken is a little smaller than many other Korean restaurants.\n \nSpicy pork bulgogi - These came with lettuce to wrap in which was nice since the pork was dry. I wasn't too fond of this dish since I've tried better at other places.\n\nSichuan short-rib egg noodles - We ate this dish last so it was somewhat cold. The noodles were a little hard and dry, but the short ribs were tender. There wasn't too much meat on it so I ended up only eating very little of this hard noodle dish.\n\nOverall this is a cute place but the food is not the best. For the price? I think I'd rather go to a spot that is cheaper and yummier.", "author": "Julian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Amazing Korean bar food. I split (with fiancee) Kimchi chicharron nachos, dumplings, wings, black bean noodles, and bulgogi. All of it was fantastic fusion. Pretty large beer selection too!\n\nThe wings (get original flavor) were a standout.\n\nDefinitely coming back. Good service, great decor.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-11", "description": "Food: 2/5\nService: 4/5\nAmbiance: 3/5\nOverall:  Would rather trek to the Richmond district for better food.\n\nThe extended review...\n\nFood:\n\nPork Fried Rice - Very standard dish.  Nothing too special about it.  \n\nKalbi - Definitely presented nicely in comparison to a regular Kalbi dish but the again nothing special.  The cuts of meat were a little different than the typical shortrib.\n\nMungbean Pancake - This dish was very bland.  We didn't finish even a third of it...\n\nService: Friendly service.\n\nAmbiance: a darker setting and very casual.", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Really enjoyed dinner here\n\nFood: ordered kimchi, pork buns, bok choy, kalbi main, and the noodle kalbi special. All delicious. Noodles could do with more meat in them though. \n\nDrinks, ambiance, and service were great!", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "Came here to try their fried chicken and it did not disappoint! It's really crispy and flavorful, and not overly sauced. They have a lot of other Korean dishes with a creative twist, and although we didn't try much everything tasted really good. And the soju slushies are super yummy! We tried both the POG and Blackberry flavors, and the POG was definitely much tastier (ie: less alcoholic-tasting) than the Blackberry.\n\nThe main downside is that everything here is quite pricey given the portion sizes. The soju slushies, at $12 a glass, were much smaller than we expected, and the BBQ plates were also pretty expensive given the amount of meat and sides.", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "I was excited to try this modern Korean restaurant in a neighborhood that's mostly known for its taquerias. The front of the restaurant stands out, painted with big, colorful geometric shapes. There's also a big window with a hanging Tiffany lamp and a neon sign that reads \"POW!\" \nI was immediately drawn to it. \n\nOnce inside, all the walls and tables are a polished black- which makes the perfect reflective surface for all the sparkling lights hanging from the ceiling. There's a black & white Audrey Hepburn mural, a Virgen Maria beaded curtain, and a disco ball in the bathroom! A cool playlist adds to the fun hipster vibe but it's not so loud that you can't have a conversation. \nI took all of this in with pleasure before I even sat down to eat. \n\nOn my first visit, I ordered the Dungeness Crab noodles. However, I didn't realize they were glass noodles, which I dislike very much. So after giving them a try, I apologetically confided in my server that I just couldn't eat them. She was super nice about taking them off my bill and asked if I wanted something else instead. And though I didn't have anything else that day, because the service was so good, I decided I'd give them a second chance. \n\nThe second time I came, I was equally impressed with the service and this time, my food and drinks were REALLY good!\nI had the Royal Mushroom Rice Cakes with soy glaze, pea vines, and sesame seeds. I couldn't get enough! The soft chewy rice cakes paired well with the crunchy greens and had a delightfully sweet, toasted flavor. \nIt was vegetarian and gluten free. Therefore, it was also Guilt Free. \n\nI wanted to order a Soju Slushie but couldn't decide on a flavor so my server suggested we combine the Pina Colada and the Passion fruit together. Genius! They were beautifully layered together and delicious! \n\nFor dessert, I ordered the Neapolitan Banana Split. I expected the classic version but this was much better- The bananas were completely coated in a crunchy caramel coating! Topped, of course, with whipped cream, sprinkles, peanuts, cherries, and chocolate syrup. \n\nIt was the perfect way to end a perfect dining experience. The lights, music, food, drinks, and service were on point and I can't wait to come back.", "author": "Mitzi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-06", "description": "We had a good meal here!  Tasty food, good service, and a pleasant (though dark!) setting.\n\nMy husband and I shared the following dishes - we liked some more than others (note, we had enough leftovers for a full meal for the two of us the next day):\n\n1) Ribs - flavorful, with a nice kick\n2) Shrimp dumplings - okay, nothing special (unexpectedly pan fried)\n3) Wings (Sweet and Spicy) - good, but lacking any spiciness\n4) Garlic noodles - delicious, though rich \n5) Bok Choy With mushrooms - simple and tasty \n6) Blackberry mojito soju slushee - surprisingly great!\n\nThe service was friendly, attentive, and prompt. They were welcoming and accommodating of our 4 month old baby in a stroller, which we appreciated (we went around 6pm on Labor Day, and it seemed to be a slow night for them).\n\nThe ambiance is pleasant enough, though I personally wasn't a fan of the shiny black tables and super dim lighting.\n\nOverall, this is a good place for a solid meal!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "When I saw there was a new Korean spot in the Mission, I got pretty excited and decided to check it out with two friends. I made same day reservations for a Thursday and 6:30 pm and there was plenty of availability.\n\nThe restaurant itself looks pretty cool. It's very dimly lit with strings of lights and paper lanterns hanging from the ceiling. It's a large space and feels quite spacious, as the tables are fairly spread out and there is a lot of room to walk. We were seated in a booth in front of the small bar which had two TVs, so theoretically you could come here for a game. They were playing two different movies when we were there.\n\nSo why the low rating? My friends and I all agreed the food was way overpriced for the portion and taste. My small bowl of crab noodles set me back $19, and it was very mediocre. And did I mention the portion was pretty small? Good thing I wasn't hungry, or I would've walked out still hungry. I had asked the server prior to ordering whether it was spicy or not, and she said no, but it would've been nice for her to mention that it does come with some sliced red peppers and jalapenos. I had to pick out all the red peppers and accidentally bit into some jalapenos, so not a great meal for me.\n\nMy friends shared two dishes including the shrimp and chive dumplings. It was pretty ridiculous to all of us that you only get 5 dumplings for the $15 you pay, which averages out to a pricey $3/dumpling. Our server asked if we wanted to get an extra dumpling to make sharing easier, and sure enough, they charged $3 for the last dumpling.\n\nThe one positive I did notice was that their menu is very vegetarian friendly for a Korean spot with both veggie apps and entrees. I have some vegetarian friends, so it's something I've started paying attention to. \n\nI am generally willing to spend money on good food, but the whole experience here was very lackluster and not worth the ridiculous prices they charge.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Hard pass. Wish I had looked into some of the yelp reviews before coming here with a bunch of friends. This place is insanely overpriced hipster korean fusion. 2 stars for the cool vibes and friendly service, but it's hard to like a place when the food is such a let down \n\nRed flags: \n1) Looked around and saw nooooo ethnic customers, minus our party. I always correlate this to the authenticity of an establishment lol\n\n2) Soju bombs were served as a shot of soju next to a beer can. Wtf? It's supposed to be a shot of soju IN a pint of beer. \n\n3) $12 soju slushie....... is a single drink. Literally my whole table thought that this was a large cocktail type drink, as usually seen in soju establishments. We ordered 2, thinking that it would serve 8 of us\n\n4) You have to pay for the banchan (side dishes) here. I have never seen that before in my life\n\n5) Food itself was mediocre, and again, insanely overpriced", "author": "Nicolette E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "I've been having food cravings lately...which is super weird, since it's never really happened in my life before. Anyway, today the item was octopus?\n\n50 minutes later, I'm looking at a small takeout box of octopus rice cakes. Well, focus on the rice cakes. For $18, you get 10 penny sized pieces of octopus (really tender, well cooked), and a decent snack size portion of rice cakes. Edit: Actually, I found some more octopus slices below-- so maybe 15% octopus to 85% rice cake ratio.\n\nThe color certainly looked promising, but I found the whole thing to be quite bland for Korean food. It was slightly spicy, had good wok flavor / oily smell, but was lacking in the tastebuds department. The thinly sliced carrots and onion they threw in there added some good sour flavors to the dish. The rice cakes were a good amount of chewy and were decently separated.\n\nIf the prices dropped a bit, I think the place would be more appealing to a wider variety of people. I want to like this place - for now it's around a 3.3 for me!", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Yelp reviews were spot on.  \n\nWe asked the server to suggest and ended up liking our selections quite a bit.  \n\n- fried chicken basket of 5 - combo of the OG (seaweed and salt flavors came through in a subtle but delicious way, lightly battered and dry in style but perfectly moist in taste) and the sweet and spicy (tangy and spicy, covered in sesame seeds, wet in style, also tasty) with some daikon pickled radish\n- kalbi with lettuce, sliced daikon, a Korean paste.  This was actually quite moist and tender, although correspondingly not as lean as we had expected.  Great dish\n- bok Choy and mushroom- bok Choy is hard to make exciting, so it wasn't, but it was their only real vegetable option so we chose it. There was a great sauce and the mushrooms were delicious.  \n- black bean garlic noodles - these were really saucy and tasty - nice to have the carbs/starch.  I think the dungeness crab noodles would have been a bit lighter.  But we enjoyed this selection. \n\nThe decor is definitely a little trendy and funky, and the music was pretty loud (we caught 80s music).  My husband appreciated the large screen showing very old surfing footage.  \n\nAll in all we enjoyed the meal and given that my husband has never been a fan of Korean, I was glad that he loved the food.  We would come back.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Fixsister is a new, modern Korean restaurant a few blocks from 24th Street Station that is hard to miss between the style and music and the lines.\n\nI had a date in the City and was looking in the Mission for something new and based on all the criteria Foxsister seemed the best. Make sure to get a reservation (a tip I learned in Europe) as this place can get packed and have a wait. Also realize this place isn't on the cheaper end. Also because of the volume of the music, this might not be the best first date spot, but it worked.\n\nHouse Made Kimchi's - They no longer do bonchon, but do offer a selection of pickled cabbage, radish, cucumbers and mushrooms.\n\nBok Choy & Mushrooms - Love bok choy, hate mushrooms, but more delicious veggies.\n\nShrimp & Chive Dumplings - If there are dumplings, I want them. You get 6 an order and they aren't bad, but not sure if $15 good.\n\nSpicy Chicken Steamed Buns - We debated on buns or fried chicken and found a common ground. Really good!\n\nSpecial Black Garlic Noodles - Our server mentioned one of the specials of the day was black garlic noodles and we needed a noodle/rice dish. These were also really good, but not sure how often they have them.\n\nOur server was amazing. Providing recommendations, refilling water, no waits on anything. Considering the poor service at Lao Table, this was really a treat. Would definitely come back with a group of friends.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "My 400th review! Easy reservations can be made online. About 3 blocks from the Bart station, it's the most colorful spot there. It's pretty warm and dim inside. Also warning, your clothes will smell like you went to kbbq upon leaving this establishment. Service is great. Pretty pricey for the portion size.\n\nThoughts:\nPina Colada $12: Pretty good flavor. Your standard pina colada.\n\nDragon Bowl Z $15: A lot of ice on top. Fruity but decent. Best to share with the table if no one is sick (they give you straws to drink from)\n\nDungeness Crab Noodle $22: My favorite dish of the night. Prob because I like jap chae in general. An OK amount of crab. I just didn't like the small bowl portion for the price.\n\nA lot of chicken $36 (whole chicken): I tried all 3 flavors. They gave about 3 pieces per flavor, 9 pieces in total. Huge pieces tho. I wished they were smaller so we can get more pieces for everyone to try the different flavors. Like instead of 3 big pieces, have 6 smaller pieces. The garlic soy was the most flavorful in my opinion. So I'd get that over the other 2. The sweet and spicy was not really spicy at all. The OG recipe was super dry.\n\nPork Fried Rice $12: This was spicy but was good. Small portion tho.\n\nSpicy Pork Bulgogi $18: Not too spicy but was definitely spicier than the chicken. This dish was accompanied by lettuce wraps, radish, jalapenos, raw sliced garlic, and I think miso paste. It was ok, a lot of pieces were stuck to the plate and burned.\n\nOverall, price was high for portion size. I recommend getting the crab noodles. Everything else was just ok.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "love the dry wings, booth setting, decor, friendly service. good concept.", "author": "Xiu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "They had me at the tropical alcoholic Slurpee machine. \n\nYes, they have a machine that doles out delicious frosty creations like pina colada, POG, or watermelon slushies spiked with soju.  They. Are. Epic.\n\nBut there's food too; crazy good asian fusion stuff.  Everything we tried was pretty tasty: the kimchi nacho cheese dip was off the chain, the dungeness crab noodles were perfectly made, and the kalbi short ribs were savory goodness.  We also did some shots of soju because, well why not?  It took the evening in a fun and unexpected direction with some old friends.\n\nHad been wanting to try this place for quiet a while.  Wish I had gone earlier and looking forward to heading back.", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-24", "description": "Super, and I mean, SUPER overpriced \"fusion\" food. While the interior is cool and moody with neon lights and lanterns, I'm absolutely appalled by how Foxsister might set the standard for how Korean food should cost / taste. \n\nThere was a 1 hour wait around 7pm, but by the time we came back at 9pm half of the seats had opened up. We ordered the octopus and rice cakes, the Korean fried chicken with spicy sauce, a watermelon soju slushie, and a can of Icing. Thinking back to this now, I would've given drunk me a good slap in the face for paying $7 for a can of underwhelming soda. \n\nThe fried chicken had a good crunch, but the sauce didn't really do much. The octopus was strangely soft and not chewy, although the rice cakes were good. The slushie had a strong soju taste that didn't go well with the artificial watermelon flavor. Next time, I'll just mix my own drinks at home.", "author": "Sophie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "OVERALL: Fun spot, pretty good modern Korean food, though nothing really blew us away and the most expensive entree (the short rib) was the biggest let down. I'd go back just for the festive vibe and easy access to Korean food in the Mission.\n\nRESERVATIONS: Made online a few days in advance for dinner on a Wednesday for 5. They were crowded and we waited about 10 minutes for our table, but there didn't seem to be a wait throughout the night.\n\nTHE COST: $41.24 total (including tax/tip) per person for 5 drinks, 1 starter, 5 entrees, and 2 desserts - split 5 ways. \n\nSOJU SLUSHIES\n* Peach Daiquiri ($12) - 4 stars\nRefreshing, lightly sweet, not too strong. Great!\n\n* Pina Colada ($12) - 3.5 stars\nGood flavor, much stronger-tasting than Peach Daiquiri. \n\nDRINKING SNACKS\n* Fried Oysters ($14) - 3.5 stars\nGood crunch, good burst of flavor when you bite in. \n\nNOODLES & RICE\n* Dungeness Crab Noodles ($19) - 3.5 stars\nThis is fine if you like vermicelli, the bok choy & crab weren't especially fresh, and there wasn't too much crab if that's what you're excited about. I did like the flavor of the sauce.\n\n* Crispy Mung Bean Pancake ($12) - 3.5 stars\nCrispy on outside, soft on inside, good dipping sauce. \n\nFRIED CHICKEN\n* Basket of Wings (we got Sweet & Spicy and Garlic/Soy $14) - 3.5 stars\nBoth were good, moist meat, but the Garlic/Soy was a bit too salty! The Sweet & Spicy wasn't too salty\n\nMAIN EVENT\n* Grilled Kalbi Shortrib ($25) - 2.5 stars\nWhile we liked the flavor, we immediately noticed how tough the meat was! This was overpriced.\n\nSWEETS\n* Boba Tea Custard ($8) - 3 stars\nFine but not much of a standout. The flavors don't really pop, and this is just more of a novelty the way it's served (visually looks like a savory dish). Don't go out of your way to get this, but this works if you really, really feel like custard.\n\n* Giant Chocolate Cupcake w/ sparkler ($10) - 2.5 stars\nFun dish, but the cupcake was very dry.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "We made a reservation for 4 on a Saturday night for 8:15pm. We got there at 8pm and we were able to get seated right away. Our entire group was awed at how trendy it looked inside. It was dark but had different  LED string lights strung above the room with mirrors all on one wall which bounced off the reflection. It's a cool place to take your friends out for some soju and to have a bite to eat. They even have party lights inside the bathroom. Once we ordered, it took 15 minutes for the majority to come out: watermelon soju, rice cakes, crab noodle, half chicken and another 20 minutes for the last dish: ribs. By the time the ribs came out we had finished everything else. Everything tasted delicious. The watermelon was sweet, soju was strong, the rice cakes were crispy and chewy, the noodles had a good amount of crab meat, chicken came with 3 different flavors: original, honey garlic and spicy and the ribs were tender with a bit of a kick. I would return to try their other menu items.", "author": "Vinkin Ken T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "A girlfriend and I try to get together for a monthly dinner. We always try to check out new spots. This month, we decided to try Foxsister. I made a reservation about a month prior for a party of two on Wednesday, November 15th at 6pm. I did check the same day to see if we could change the time and there were plenty of openings, so it doesn't seem hard to get a reservation here.\n\n*Kimchi Nacho Cheese Dip: pork cracklings, lotus chips, jalapeno ($12)\n*Crispy Mung Bean Pancake: spicy ground beef, bean sprout, chive, soy dipping sauce ($12)\n*Grilled Kalbi Shortrib: garlic & pear marinated, flame broiled, served with lettuce wraps ($25)\n*Some Fried Chicken - OG Recipe: seaweed salt; Sweet & Spicy: gochujang, honey; Garlic / Soy: ginger, toasted garlic ($19)\n*Altesse Brut: dried apricot, white flowers ($13 glass)\n*Chardonnay: pineapple, toasted oats ($13 glass) ×3\n*Froze Soju Slushie ($12)\n*Chamisul Classic Soju ($15)\n\nI adored the nacho cheese! But I am a queso / cheese sauce addict. It was creamy and comforting. The kimchee flavor wasn't too pronounced as my gf doesn't like kimchi. I also love fried chicken, so I'm glad they let us try all the flavors in one order. The some chicken had pieces of breast, a drumstick, I think a wing, etc. We got two pieces each of the sweet & spicy and soy garlic, and one of the og. The og was actually my favorite. It was salty, savory, and crunchy. I normally love soy garlic, but it was a little two salty. My gf doesn't really eat Korean food, so she wanted to try the other two dishes. I enjoyed the kalbi, but part of the fun is eating the meat on the bones. I did miss that as this dish was boneless. I'm not a huge pancake person, but my gf liked it.\n\nAs for drinks, I decided to start with a glass of bubbly and then try one of their soju slushies. It unfortunately didn't taste very alcoholy and was too sweet, so I ordered a bottle of soju to add more liquor to it. Tasted much better afterwards. My gf had never had soju, so she enjoyed it. They bring it to you with a whole lemon which I loved. I didn't even have to use the cap to cut a hole as they already did it. The bottle does arrive open, so if you wanna do that tornado elbow thing, you're SOL.\n\nFun place to have Korean food with a slight modern twist. For the staple dishes, I'd probably rather go to a traditional Korean spot. But for that nacho cheese and those chicharones chips, I'd come back!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-30", "description": "Good but expensive hipster Korean food. After living in LA for some time, I just can't find any Korean food that hits the spot in SF. Foxsister was pretty good but expensive! My friend and I ordered dishes to share - GRILLED KALBI SHORTRIB - garlic and pear marinated shortrib. Good flavor, small plate of meat. BASKET OF WINGS - OG Recipe (seaweed salt), Sweet & Spicy (gochujang, honey), and Garlic/Soy (ginger, toasted garlic). Wings were crispy and not overdressed in sauce which was great. \n\nI would recommend making a reservation for this place, it can get pretty busy. We walked in and were told a 45min wait, ended up waiting 15min... smart of the hostess to set low expectations and then over-serve! Worth checking out.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Foxsister is incredible. I've been gluten free before it was cool and I always dreamed of a place that served Korean food. Now I've finally found it. \n\nService 5/5\nAmbiance 5/5\nFood 5/5\n\nHighly recommend the Kalbi, Dungeness crab noodles, and the pork fried rice\n\nDrinks 4/5\nThe drinks were delicious (Passion Fruit Orange Guava slushie) but they're pretty small and expensive so one point off for that.\n\nOverall, couldn't recommend enough and definitely coming back. \nTo quote my Gf, \"this might be my favorite restaurant in SF\".", "author": "Diego L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "New Korean food bar recently opened in the Mission.\n\nTo be honest, the food was a bit expensive for the portion size...but hey it is in the Mission. But like seriously, they charge $8 for banchans....which is unheard of for a Korean place, usually those come out for free.......\n\nBesides from the price, I think the food was really good, but very salty...Everything was salty to me. But then again, I dont eat a lot of salty food to begin with. Others might just say it's flavorful.\n\nOne of their banchan is a mushroom dish. IT WAS DELICIOUS. The flavor of this mushroom dish was explosive. A must try. \n\nKimchi tofu soup: quite spicy. $12 for just the soup and the tofu. Egg is extra and pork is also extra. Again salty. It goes good with rice though\n\nSpicy pork bulgogi(~$21): it comes with these buttered lettuce pieces and radish so you can kinda of make wraps. I think rice paper would be a nice addition though, since the pork was salty, the lettuce itself is not enough to absorb all that salty juice..\n\nThe place was very nice and clean. Perfect place for date night since it's pretty dimmed in there with candle lights and such. The environment is very different from other Korean restaurants I have been to. The service was great.", "author": "Veronica N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "VIBE: Trendy & Fun!\nWHY: Korean fried chicken & amazing egg benedicts on the weekend\n\nI've been craving a tasty new brunch spot every since Schmidt's closed down the street. I miss those waffles. But I am so happy that Foxsister is doing brunch now! I tried their Mission version with Al Pastor and it was SO delicious. I can't wait to try all of the other kinds. Their tomato salad was also very nice & fresh.\n\nI have also been here many times for dinner, and it's an awesome vibe. Great spot to take friends for drinks - their slushy soju drinks remind me of being in Las Vegas lol. Great food & perfect for sharing in a group. The ambiance is super cool too.\n\nSo happy this place opened up on 24th :)", "author": "Eve D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "The food here is good, but the prices are way too expensive for a normal dinner.  \n\nI came here twice, both times just for dinner and not drinks.  Each time, I found the chicken and appetizers too expensive to get my own entree but had to share w/ friends", "author": "Craig V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "This is a super fun place to start out a night out in the Mish!  The vibe is cool, fun, and the stoner movies playing in the background add more flair to the scene.  \n\nThe menu offers sharable dishes, which is great because my friends and I prefer to dine family style.  The kimchi queso dip was a table favorite-- it's simple, salty, and just plain awesome.  The wings were delicious- saucy and crispy.  We also enjoyed the dungeness crab noodles and the bulgogi. The slushy drinks were fun!\n\nSpecial props to the staff for finding us a table on a booked-up Friday night.  I'm glad we called!", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Overpriced, underwhelming, hipster overkill fusion food.  I didn't see any Korean workers.  I sort of prefer an authenticity touch. Meager portions and bland for Korean food.  Spend your money elsewhere.  1.5 stars, half star for decent service on a Tuesday night. \n\nWhen my friends and I were done, we were in concurrence that it's the final visit :/", "author": "Bailey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "3.5 STARS\n\nFinally, a Korean place in The Mission! \n\nGrand opening in the former Montella Pizzeria space, Foxsister is serving Korean inspired drinking snacks, soups, pajeon (korean pancakes), noodles + rice plates (hello, crab japchae!), meat entrees (e.g. bulgogi, bossam), and KFC! \n\nI made reservations through Reserve for our group dinner for opening day. The staff kindly accommodated changes because Mr. Diva was being his difficult self (we all have that one friend who thinks they're Mariah Carey right?) Thank you, Kristina! \n\nI love Korean food so we went in a group to sample more things on the menu. Aside for charging for banchan, the prices are reasonable for Korean food in The Mission. \n\nFair warning, don't go in expecting traditional Korean food or anything similar served in typical Korean restaurants because you'll be sorely disappointed. It's has more Korean elements than Namu Gaji though. \n\nWe wanted to try a little bit of everything so our group ordered half of the menu (listed from Fav to Least Fav):\n\n*Banchan: Kimchi, pickles, snacks ($8): http://bit.ly/2yUHoaz\n*Garlic Fries w/ spicy kewpie ($7)\n*Basket of Wings ($12 each): http://bit.ly/2fXDF4s\n--O.G. Seaweed Salt\n--Sweet & Spicy\n--Soy-Garlic\n*Oxtails in Bone Marrow Broth w/ pickled daikon, [missing] rice cakes ($16): http://bit.ly/2zbl0L0\n*Grilled Pork Belly (Bossam style) w/ daikon wraps, spicy miso paste ($18): http://bit.ly/2i17cOY\n*Fried Oysters w/ spicy kewpie ($12): http://bit.ly/2yCHI1J\n*Kimchi Hellfire Soup w/ tofu, pork belly ($12 + $2 egg): Sorry, no pic.\n*Spicy Octopus Rice Cakes ($16): http://bit.ly/2yby2tM\n*Slow-Cooked Ribs: Braised, Grilled, Glazed (Stack - $14): http://bit.ly/2yCx8Yo\n*Pork Fried Rice w/ egg, scallion, kimchi ($12): http://bit.ly/2ycXaQy\n*Grilled Kalbi Short Ribs w/ garlic + pear marinade ($22): Never came so it was removed from our bill.\n\nTable favs was the banchan, particularly the kimchi which was perfectly fermented and very flavorful, and the dried anchovies w/ almonds. I know some people will shake their fists for having to pay for something that's traditionally complimentary and bottomless at all Korean restaurants but these were very well-made. \n\nWe also liked the Garlic Fries which were hot, crunchy, and had good garlic and onion flavor.\n\nI loved the O.G. Seaweed Salt Wings for the simplicity. The Sweet & Salty and Soy-Garlic Wings were too salty. \n\nThe Oxtails in Bone Marrow seems to be their take on Sullungtang. The oxtails were meltingly tender with a milky broth. Sadly, it was missing the rice cakes and it was odd to find pickled daikon in the soup. \n\nI was most excited for the Pork Belly (Bossam) but it was very chewy and oversalted. The daikon wraps were fantastic though...nice and pickley. \n\nThe Pork Fried Rice was wet and clumpy. It had lots of eggs + onions but missing the pork. \n\nUnfortunately, the other dishes were crazy salty or burnt. I hate sending back food and felt terrible for doing so but we had to send back the Kimchi Hellfire Soup (aka soondubu), Spicy Octopus Rice Cakes, and Slow-Cooked Ribs (strong acrid flavor) which were inedible. They ended up taking these off our bill which I appreciate. \n\nOhhh make sure to try their Soju slushies aka silent creeper. One glass of the Watermelon Ginger-Lime slushie ($8): http://bit.ly/2yCKLH1 and the room was spinning...in a good way. \n\nThe staff is really friendly and receptive to feedback which I really appreciate. Some of our orders were wrong and one dish never came but it's their first day so they'll get into their groove soon. \n\nCute, retro vibe with string lights and hooker red leather booths. \n\nParking...not bad on weeknights in this part of The Mission. \n\nDefinitely stop by Foxsister for their KFC and Soju slushies! Geonbae!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Food was more of a 3.5 in my opinion.\n\nThe food is good, but small portions and pretty expensive for korean food. \n\nGranted it's fusion and the spot is really cute. So if you're in it for the atmosphere, they have super friendly waiters and it would be a nice place to catch up with friends or go on a date.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "I came across this spot off a SF eater article and it definitely didn't disappoint! The decor and theme is really fun and very appealing. Most of the food was on point and overall we had a great experience.\n\nWe ordered the pork and beef dumplings and they were delicious! It's food for a part of 2-4 and they're on the heavier side being fried. But the flavors are amazing! \n\nTo share we had the: pork bulgogi, crab noodles and octopus rice cakes. Our fav was the bulgogi they came in a lettuce wrap with jalapeños and a sauce to add - very tasty! The pork meat came on a skillet I loved he flavors. The crab noodles were delicious but for price on the skimpy side. Although I felt like we ordered a lot of food the portions were kind of stingy for the inflated price. The octopus rice cakes weren't good I wanted to like hem but they lacked flavor and all fried and heavy. I wouldn't order this again! \n\nThe wine list is somewhat limited but given we went on a hot day they had some chilled red ones that paired well.\n\nOverall, good food and ambiance a little stingy on portions but a fun spot to try!", "author": "Priya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Great place. Fun casual restaurant with fine-dining level food. Executive chef Brandon Kirksey used to be the Chef de Cuisine of the famous San Francisco modern Vietnamese restaurant. As an American, he was wow by the bold flavor of Korean food. Then he traveled to visit Korea. After so many years being in fine dining Italian and Vietnamese food, he decided to open a modern Korean restaurant to bring the fun Korean feeling with fresh ingredients and lots of homemade techniques to have a modern twist of Korean food. Is fun, is casual, and is delicious.\n\nHighly recommend the following dish: \n\nKorean side dish combination \nFried oyster\nFried chicken wing OG flavor with sweet spicy source in the side\nCrab noodle \nOctopus Rice Cake less spicy\nBeef Bone Soup with kimchi on the side\nPork Rib\nFried chicken wing garlic flavor\n\nLoved the environment, service, and fun food. Some food is slightly too salty but I guess the point is having a drink align with it. Give it a try!", "author": "Anya C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "I really enjoyed this place.  I loved the ambiance, the service was excellent and the food was really good.  A tad bit pricey for the servings, but a really cool date spot.  \n\nMy boyfriend and I started with the soju slushies at the bar while we waited for our table.  They were pretty good.  I had the peach daiquiri and I can't remember what my boyfriend had.  Some kind of margarita I think.  \n\nWe ordered the kimchi cheese dip and that was really good.  We ordered the small order of garlic/soy wings (kinda of salty) and the dungeness crab noodles (Jap chae).  The noodles were ok.  Their white rice was amazing.  I'm asian and that had to be the best white rice I ever had.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "SOOOOOO GÜD!!  Totally random ... key word, RANDOM place with the vibes and decor and video choices; RoboCop and some Arnold Schwarzenegger movie.  The food was EXCELLENT. Dumplings with shrimp were superb.  The Dungeness Crab noodle dish was delish.  The nacho cheese dip w lotus chips and pork rinds was  AHMAZINGLY tasty. \n\nI will come here again.....aaaaand again. \n\nAlso the drink list is extensive considering it's only beer and wine. They got creative with some Soju choices and even slushees!  I had a Frozé that was sour and sweet and yumskies5000.   \n\nTwo very enthusiastic thumbs up.  Fine holiday fun.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Brunch is great. The burger is incredible, along with a bottomless mimosas and sunjo.\nAt dinner, fried chicken and various salads are amazing.", "author": "Elad O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-06", "description": "new place : food is ok, nothing wow. The drinks are good and our waitress is super nice and cool. 3.5 star. Oh for two dish, one soju and one slushy cost around $70 not including tax which is a bit pricy. Anyway I feel plenty of better food places in SF with better price.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Excellent food and some really awesome vegetarian options too. We went with a group of 6 and had 3 vegetarians who also loved all the options. \n\nThe wine list is really disappointing but everything is top notch and the chef is creative with a lot of great options for everyone to pick from. The next time I go I want to try more things but the most memorables were the noodle soup and the fried chicken which even my kids loved a lot. \n\nDefinitely go at least once.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Visited on a sunday night, around dinner time to celebrate a friend's birthday. \nPros: \n-Great decor and ambiance. It's colorful and quirky, while keeping a classy and intimate/candlelight vibe. Love it!\n- Staff is great! We were very well taken care of and our waitress was very sweet. \n- Foos is delicious! \n- THOSE BEEF DUMPLINGS  they are hands down the best dumplings I've had in San Francisco. \n\nCons:\n- Pricey. Compared to the food you get at other Asian restaurants around the Bay, this seems to be a bit overpriced in terms of value.\n\n\nOverall, if you don't mind paying the price, definitely worth a visit.", "author": "Rim K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-16", "description": "Restaurant is really beautiful with an existential hipster vibe. The banchan is thoughtful and super delicious, but it stops there. \n\nFor a Korean vibe restaurant, the banchan should be a part of your meal. It's not. You pay $8 for it and don't even get re-fills. I get that it could be costly to do so, but if we ask for extra kimchee, is it really going to break the bank to give us more? You should at least offer 1 re-fill. (We were 2 people) We thought our server was friendly-- but she wasn't great at attending to us. \n\nWe had to ask for white rice three times. Each time the runner dropped off the food, she looked stressed at how our table had so much stuff on it. If that's the case, please be thoughtful to shift things around -- or, the server should've helped you. (The restaurant was not that busy for a Monday) \n\nThe short rib was good (but they should clarify there's no bones), the soup wasn't very flavorful. Don't call it \"hellfire\" if it's not that spicy. Give the option for levels of spiciness. It's was literally just tofu soup, without much tofu. Then they charge you an additional $3 for pork belly and then $3 for egg (which was the best part of that meal). Make it that great so that we are licking the soup from the bowl.\n\nWe also had a basket chicken wings, all 3 flavors, which was recommended by the server. I didn't even get past 1 -- they were huge, over battered, and didn't have much sauce on it. I would've rather it be smaller and more flavorful.\n\nOverall, great vibe, first Korean restaurant in the Mission, but I won't come back. I love Korean food and go often in LA. If they're going to charge these prices, they need to be excellent about the quality of the food to match it. With so many other restaurant choices in the area, and the location not actually being on Mission Street, I recommend that they need to fix these things to get repeat customers. To reiterate, I wouldn't be so price sensitive if your food was extraordinary.\n\nOn top of this, for a $100+ bill after tip/tax-- our server didn't even remember to give us our leftovers.\n\nWe didn't remember because we left the restaurant to go to a divey bar 3 blocks away because the wine she poured me for $13 didn't even come up to half the glass. We would've stayed there for more drinks if you were more thoughtful about your pours. Also, $15 for a bottle of regular soju? You know you can get the same bottle at a Korean store for $3, right? Recommend re-pricing this. \n\nWe finally remembered about 30 minutes later about our leftovers, and didn't even bother to walk back to grab it. It solidified my thoughts on this place.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-14", "description": "The food was fine, but not exceptional. We also had to wait 45 minutes despite having made a reservation.", "author": "Meredith H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Food is great. Cute ambiance. A little pricey. Our waitress was super friendly and fun. She helped us out with the menu and helped everything we had was super tasty. \nYou can never go wrong with the shrimp dumplings.\nOrder the wings with mix flavors- sooooo good!", "author": "Rox N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "I would give 3.5 star if they have. The food was good but it was pricy with a small portion. Panstricker was good and too expensive :(\n\nPS. They charge you with SF mandate on your bill.", "author": "Pinarat S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "I was really excited about this place but ended up being pretty disappointed. It is simply not worth the price. All the sake is $14 for a 4oz pour and the appetizers are a bit pricey as well. My favorite thing here was definitely the fried chicken - if I came again, I would probably just get the fried chicken and nothing else. Besides the food, the service was a bit slow and the ambiance is not spectacular. Overall would not recommend.", "author": "Erik B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "This place is fantastic! \n\nFood the food was really great! The hardest part is smelling orders as they come out and you are waiting for your food!\n\nService - the service went above. The hostess made us feel right at home and made up for the extra long wait which was totally worth it!\n\nAtmosphere - it's a cool vibe in a small and funky spot! I love the neighborhood! \n\nPrices -  a little pricey but not for the area. 15 for a pour of wine and entrees ranging from $15 a $25. \n\nTotally worth the visit!", "author": "Adri L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Absolutely adore this place. The food is amazing! My favorites include Sweet and Spicy Fried Chicken, Pork Belly Steamed Buns, Pork and Beef Dumplings, and the spicy Pork Bulgogi​. Ok. I swear I don't normally fall in love with pork that much. \n\nAnyway, the environment is incredibly fun, the servers are nice, and the food is a great fusion of Asian flavors. The prices are reasonable for San Francisco, as far as I'm concerned, especially for a night out with friends and a round of soju. \n\nDefinitely putting this one in my rotation.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Hipster bordering on grunge-style spot (cool and rebellious, but still incredibly clean) to enjoy Korean food + soju slushies--loud and fun vibes and people watching. \n\nFOOD:\n- Crispy mung bean pancake--our favorite! Crispy on the outside, soft on the inside. Loved that the \"stuff\" (ground beef, bean sprout, chive) was on the inside rather than piled on top. Dipping sauce was a lovely balance of salty, sour, and sweet. \n- Grilled kalbi short rib SSAM (lettuce wraps)--meat was flavorful, but slightly overdone (dry, charred). I loved the accompaniments--chili sauce was a healthy level of spice, and the thin-sliced daikon (white radish) added a refreshing crunch where the softer end of lettuce leaves can't. The pickled garlic was awesome--I was eating clove on clove by the end.  \n- Bok choy--bok choy was chopped up into small pieces, which made it difficult to eat more than a bit at a time. Would appreciate the choice between whole and chopped. On the oily side, though the flavors were nice and the presentation (microgreens are go) was lovely. \n\nDidn't have the chance to try the soju slushies, but from the menu alll concoctions sounded compelling, creative, and tasty!\n\nSERVICE:\nThe server was polite enough, but when we had gone 45 minutes without our food (and watched adjacent tables seated, receive their food and leave within our seating), we at this point decided to leave, and asked if we could cancel the check. At this point, the manager came over and offered to comp most of the meal. She was incredibly courteous and empathetic and apologized for the ait. The server for the rest of the meal maintained a strained but perfectly cordial relationship with us (sounds like she may have been reprimanded--it's definitely chaotic starting out at a restaurant, and I hope she knows we did not mean anything personally. We were just hungry.) While obviously the service was far from ideal, their handling of the situation was so graceful that I cannot ding significantly. This kindness ensured I would be a repeat customer versus Foxresister each time I walked by on 24th :). \n\nAMBIANCE: This is both a hip and cozy space--the exterior is a geometric quilt of color with a leather-upholstered bench outside for people to wait. Loosely strung chili and lantern lights illuminate the darkly painted walls, and artwork is loud and bright, popping sensation in your field of vision like good gochujang does on your taste buds!\n\nideal for a first date, especially if you don't have much to talk about (decor is stimulating and the music's loud. Plus slushies!).", "author": "Helen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-09", "description": "Was very excited about this place opening but was pretty disappointing.\n\nExpensive expensive prices for nothing really special or interesting. I ended up having Korean food again the next day somewhere else and the total for three people was HALF of what dinner for two cost here.\n\nOne main issue is we ordered a bunch of items (Fried Oysters, Crab Noodles, Short Rib, Bubble Tea Flan for dessert) and the short ribs took FOREVER to come out. The staff had zero accountability on how slow it was to get to our table. The first two dishes came within the first ten minutes and then twenty five more minutes later the last dish finally comes out. The timing was sooooo off and we were awkwardly sitting there with no food for so long. Our waitress said they were purposely timing it like that but wtf? We were cold and hungry. \n\nThe drinks were good. We got a bottle of soju and two slushies. The slushies were bomb but the bottle was over priced. I do liked how they came with a lemon and the waitress squeezed the lemon into our shot glasses before pouring the soju but she also squeezed out lemon seeds into my shot glass and kept pouring soju over it like did she think I was going to take the shot with lemon seeds in it? They should get those lemon seed sieves I've seen at seafood restaurants if they're going to do that. \n\nThe decor was great and I love the disco light in the bathroom. It was very easy to get a last minute reservation here and was able to park right around the corner from it. I love how they label the GF options which is super handy but I can't get over how slow the food was to come out and the crazy prices. Around $140 for dinner for two. Mehhhhh.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "Korean food is my favorite food. But, were Foxsister the only Korean restaurant around, I'd have to get a new favorite cuisine. It is overpriced, tiny portions, pretentious waitstaff, and they make you pay for banchan.\n\nI wanted to love it so, so badly. But their approach to dining is inauthentic bordering on misanthropic.\n\nSeriously, don't come here. There are N better Korean restaurants in SF, where N = 1 - (total count of Korean restaurants in SF).", "author": "Zach M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-27", "description": "Red flag #1 = This is a Korean spot that makes you pay for banchan....what? The ambiance is lit (literally), they play fun music and have sweet drinks like soju slushees with gummy bears. \n\nMy friends and I shared a few dishes here including the kimchi nacho cheese dip, the octopus rice cakes, the short rib and the basket of chicken wings. The only thing that felt super fusion-esque was the cheese dip and then maybe the rice cakes. Otherwise it felt like super overpriced non-authentic Korean food. I would rather go to Cocobang, and that's exactly what we ended up doing after we went out lol go somewhere more authentic y'all~", "author": "Hana S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-08", "description": "We decided to try this Korean fusion restaurant as it was relatively new in the neighborhood. Food was decent and flavorful. Our gripe was the service. My GF's entree arrived quickly but my entree didn't get to the table until 30 minutes after. She had already finished when mine arrived. I ordered the pork bulgogee plate and being part Korean myself, I assumed it came with rice. When it didn't, I asked for a side of white rice. It took service an additional 15 minutes to get the rice. It was my birthday and the whole experience was a bummer. I just wanted to get out of there and my GF and I got into an argument over the issues. I hope this was a one-off and that your dining experience will be better. I will give them a free pass since they have only been open 9 months.\n\nUpdate: Brandon, the owner/chef got back to me when he saw my review. I really appreciated his concern. It shows that he cares and I am willing to give it another try!", "author": "Edric C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "I've been meaning to try this place and I had the opportunity to finally check it out on Thursday night.\n\nWe were able to get a seat in the middle of the restaurant. I liked the hip interior and the DJ was playing some pretty decent beats.\n\nI was able to order an IPA right off the bat and then my friend and I ordered the following:\n\nBasket of Wings (OG recipe)\nDungeness Crab Noodles\nSpicy Pork Bulgogi\n\nThe best thing was the chicken wings but wings aren't that hard to mess up. The noodles didn't really have a kick or special note to them. Plus using the slick metal chopsticks with those noodles was a tricky endeavor. The bulgogi was ok but seemed a bit too spicy. Now I like spice in general, but the spiciness overwhelmed everything else and I didn't get a sense of the other flavors.\n\nAt the end of the day, the place is a bit pricey for what you get. I'd give it another try some other night but it won't be any time soon.", "author": "Art O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "Came here for Xmas dinner with my girlfriends last night for Xmas eve & this is by far my favorite Korean-Fusion restaurant.\n\nAnd I've been to plenty Korean-Fusions!! From attending Irvine for college and eating my way through OC & LA. And being from Oakland and trying all the Korean-Fusions there. The price to portion is a little pricier but hey, it's San Francisco. The fried chicken was so BOMB .. I have to bring my BF here lol\n\nWe got the OG fried chicken, the bulgolgi lettuce wrap, octopus rice cakes, all 4 flavors of the soju slushee (YUMMM), the jap chai, mung bean pancake, and it was all so delish.", "author": "Shayna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "For fusion food it is rather expensive and the portions are small , but they did a great job with the Korean fried chicken - the breading was to die for! I could have probably easily eaten two orders by myself (heh.) \n The atmosphere is cute but the music is very loud, hard to hear each other talk. I like the whole concept but I think it could have been executed better.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-17", "description": "Korean fusion tapas is how I would describe it. Portions are smaller but their soju slushies are dangerously delicious. I think it's worth it for the drinks alone. The food is definitely good and maybe I'm just a cheapo but I don't think the food is worth the price. I would go back for their drinks though and I love their modern, dimly lit atmosphere and decor.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "What a place! Met up with a friend who recommended this place for dinner and the food was delicious. We each for a slushy and the nacho + chicken wings to share. That nacho was on point and the drink was super yummy. For the entree, I got the kimchi pork fried rice and I wish I could have the recipes so I can make it at home! The price is a bit pricey and the service was good. Our waitress was super nice but I think she forgot our order of chicken wings until we said something. It was the last thing that came to our table when we finished our entree already. So, we had to boxed it up. \n\nCool place nonetheless! The decor was super funky and interest. The sign in the front is small so make sure you keep your eye on that!", "author": "Suthida K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-16", "description": "Wow. I have never been so disappointed by a Korean restaurant.\n\nParty of four, we ordered:\n-spicy octopus rice cakes (serving was for half a human at best, with maybe four pieces of octopus to be found)\n-kimchi stew: overly salty\n-some chicken: the waitress suggested we try all the flavors( sweet and spicy, garlic soy, seaweed) but neglected to inform us that for $19 we would only get five pieces of chicken including two wings...so really we wouldn't be able to try all three sauces\n-short rib: $25 for a really skimpy portion and some lettuce.\n\nThis was a ridiculous meal. As small Asian women, we were all disappointed and underfed. What a feat, Foxsister. Bravo.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "Went here for a special date night on a Friday evening - decided to try something new. I understand how busy a Friday evening in the mission can get, HOWEVER - it took about an hour to get the first appetizer. That was a big red flag to leave. \nAn hour passed and I was only able to have 1 beer and 1 appetizer. I asked how long it would take for the rest of the meal to come out and she said sorry they are being proactive about it as she was delivering an entire meal to the table next to us that sat down about 45 minutes later than us.  I decided to leave feeling hungry and as if the staff did not want our business or cared. It's imperative in the restaurant business to not only provide delicious food, but also a positive service level.\n\n- service: inattentive, not proactive, extremely long wait for food: expect about an hour for at least your first appetizer\n- food: I ordered a few things, except I was only delivered partial and an apology. Not something to do to someone hungry... we left and ate elsewhere. \n\nLast word: I'm open to try this place again, but first impression was terrible and left a poor poor taste on someone who loves to eat out and try new places. You guys are in a very foodcentric city and part of town - I'm disappointed. \n\nAlso next time you fail your guests and only able to deliver partial meal - comp what was given and send them on their way instead of just a sorry and waste both our time.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "dunt duh duh! foxbrethren come again!\ndunt duh duh! FOXSISTERen come again!\n\nguys you know you betta, dineout\nsome grrrlz, some grrrlz eat only, about\n\nko-rean, ko-rean, ko-reee-e-e-an!\nko-rean, ko-rean, ko-reee-e-e-an!\n\nand lick 2 plates in the atmosphereeee\n\nheard ownerbro wants \"trash glam\" x \"rambunctious\" af thr4 i came w all ratchetmode switches flipped to the ON position ffff rrbody. ;p\n\n(^_^) F.S. Fried Chicken $12S / $18M / $32L\ngreat portions. gochujang honey\n\n(-_^) Slow Cooked Baby Back Ribs $12S / $20L\nlittle sweet! it's the sweet one!\n\n(v_v) Crispy Mung Bean Pancake $10\nNOT crispy at all; like a meat fig newton\n\ndope ATMOS. vivrant thing apexer welcome mural. yurple lowrider metalflake bar keep it grime but still stay shine. bizzald audrey hepburn collage i fink u freeky but u do u grrrl i'll always be on ur team.\n\nfor the desired #teardaclubup ambience idky it CLOSES AT 10pm (11pm weekends) ::shrug:: must be the fine line btw \"rambunctious\" vs \"rowdeh rowdeh boudet boudet\". rltktho is it city permits or?\n\nvibe is so forward #twss yet menu sneaks some very TRADITIONAL OG korean dishes. u can take the son out the omma but u can't take the omma out the son. #waitwhat kamsa hamnida!", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "POPUP WEEKEND BRUNCH 11am-3pm!\nFoxister is amazing, yes. Also, the pop-up brunch they've been doing all month, \"Benedict\", has been such a treat. And a hidden gem. Last day they may do it is August 12th so get in while you can. \n\nEight different Benny's: my favorites so far are The Mission (al pastor pork shoulder, avocado, lime, hollandaise) and the The Crab Roll (fresh dungeness crab, avocado, buttered brioche, herb hollandaise). They've got a burger, delicious bacon, and an amazing heirloom tomato salad with cucumbers, edamame, mozzarella, and fermented chili (it's refreshing and light, but has an incredible flavor that is very unique).\n\nHow could I forget...bottomless mimosa's and bloody mary's. Yes please.\n\nI'm posting this because I want others to come check it out and, selfishly, I want these guys to continue and extend the popup!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "Keeping in mind that Foxsister opened this week, there's still some kinks to be worked out! \n\nIt's real loud in here, the service is friendly but slow, but get one of their alcoholic slushies in you, and you won't even notice. I had the peach daiquiri one, and it was delicious.\n\nMy friend and I ordered family style so we could try more food.\n\nBanchan (kimchi, bean sprouts, anchovies, mushrooms for $8): If you're expecting to get your banchan for free, Foxsister is not the place for you! You get four small dishes, and the best one is the kimchi. Not worth the $8.\n\nBasket of garlic/soy wings ($12): These wings are lightly breaded and incredibly delicious. They come with daikon (yes!) and they're crispy, hot, and perfectly flavorful. We wanted more than we got! In the basket, you get six wings, and it's the whole chicken wing!\n\nSpicy octopus rice cakes ($16): I love Korean style rice cakes, but these weren't the best I've ever had. They were mushy and not crispy, and the octopus was a little overcooked. The flavor was good thought.\n\nGrilled kalbi shortrib ($20): These are meant to be lettuce wrapped, which I personally dislike. The kalbi comes off the bone, and I wish they had given you the bone portion - that's where the most flavor is! The kalbi itself was a little burnt and didn't have any sauce or flavoring on it, so this ended up being a pretty bland dish.\n\nOverall, Foxsister is promising, but I would steer you towards trying some of their more unique and fusion-y dishes, rather than the more traditional-style Korean dishes. I'll definitely be back for the wings and the slushies!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-30", "description": "Was really excited to try this place but left a little disappointed and don't think we'll be back.\n\nAtmosphere is fun and casual. Servers were nice, friendly and responsive. Food was pretty good. Alcoholic slushies were delicious (but very small). Biggest thing is how expensive it was, especially relative to other Korean options in the city. Based on the menu pricing, we were expecting much much bigger portions. For the 5 of us, came out to $200+ for what amounted to 2 rounds of drinks and a couple of apps. \n\nIf you do want to come would recommend coming with a few people so you can share things, making reservations ahead of time and being prepared to spend a little more than you want to.", "author": "Sarina Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-05", "description": "Trendy, hipster, Asian fusion, organic, over-priced mediocre food. Atmosphere definitely feels like a club/lounge...really dim lights and lots of lush decorations. We were the only Asian-American representation in the restaurant...and honestly felt a bit out of place at a supposedly Korean restaurant.\n\nFor a party of three, we spent over $100 and I left hungry. The portions are insanely small and the prices outrageous. We ordered:\n\n$14 - Pork Belly Buns (3) - This was a special that was not printed on the menu. This was my favorite of the night--good flavor and juicy pork belly.\n$19 - Dungeness Crab Jap Chae - Jap Chae was mediocre and served in a small bowl, but somehow adding a few pieces of crab in it justifies an outrageous price. Jap chae is often served as the free banchan at other Korean restaurants so it's outrageous to me that a SMALL portion would cost $19.\n$19 - Some Fried Chicken - We got the mixed flavors. They were alright. Chicken was juicy but I didn't find it to be especially crispy and this is supposedly what they are known for.\n$25 - Kalbi Short Rib - I suppose the flavors were good, but it was a small portion and I'm also used to this being served on the bone--more authentic that way! Also, they sliced it up super thin--maybe they're trying to make more pieces so it looks larger? This was a small plate and served without rice. The waitress kept on trying to push us to order rice...which was an extra $3 charge. Hard pass on that because umm...I can make rice myself.\n\nAlso, charging for banchan is just wrong to me on a philosophical level. The waitress explained it was because the ingredients they source are organic but it still didn't explain the hefty price tag.\n\nNow, I really don't mind paying more for good food. But, the thing is, is that this Korean fusion food was NOT all that great, served in outrageously tiny servings, and the price tags were literally double what I'd be willing to pay. \n\nAfter ordering 4 dishes for 3 people, and eating every last bite on all of the teeny tiny plates, dropping over $100, we each left unsatisfied. By the time I walked out the door, I was already hungry again. I would not come here again. This restaurant basically epitomizes everything that annoys me about SF food culture: cares more to be hipster/trendy than delicious/authentic and slaps on an outrageous price tag with less food.", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "Didn't get to take any pictures of our food, because it was pretty dark inside. I definitely enjoyed the vibe i got from this first experience here. They serve you a good amount of bonchon and if you want more, you can always ask for more, which i loooove. My favorite were the marinated shiitake mushrooms, and shredded squid. My favorite dish that we ordered was the chicharrons with cheese dip. Huge pieces, and super crispy, served with a side of warm cheese to dip, just lovely!  I wasn't too big on the wings cause they weren't as crispy as i imagined. The flavor was good though. The room is really dark, i think i would have liked a little more light, but I'm sure other people enjoy it. It's a cute little spot, so i did enjoy it. Price wasn't too bad.", "author": "Priscilla Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Great Korean wings, solid kimchi rice but the star of the show was the insane nacho cheese + pork cracklings.\n\nNice decor, they played great music and the staff was super friendly.\n\nPersonally I'll be staying away from the soju slushees as they are too sweet, not alcoholic enough and too expensive for my tastes, but I'll be back for the good food and beer selection.", "author": "Dennis A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-31", "description": "First thing I want to say is that the food is good, but small portions. Cool vibes. So, if you're used to portion over quantity, then this place is not for you.\n\nPricing sucks. How are you going to charge banchan for $6-8? If you read one of the reviews down below, even if you order the banchan, you won't get free refills. All other Korean places are complementary. Mexican Coke, Tejava, and other beverages for $5? I understand for the other real food options you have on here, but that's stupid ridiculous. \n\nAlso, one of the waiters was extremely rude to a patron, when they were waiting for more than 30+minutes for their take out(might've been Postmates). You honestly didn't need to raise your voice at him. You can even read the other reviews about the waitstaff.\n\nI find it hard for me to come back here.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "In the Korean fable titled \"Fox Sister\", a fox takes over a woman's body and goes and eats people's livers. From this fable the name of the restaurant was derived. Upon entering fox sister, I did feel as if a fox took over my body. It did not force me to eat livers, but instead piles of chicken wings, ribs, and delicious soju slushies. To balance out the meal,\nwe also enjoyed the fox girl salad, a spicy mixture of noodles and greens that made us feel slightly less carnivorous and more the herbivores we strive to be. Our server Ashley and the host Matt were wonderfully attentive and knowledge on the unique menu options. Feeling throughly foxy, we retreated back to our den with full bellies throughly satisfied from tonight's restaurant hunt.", "author": "Alisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "I spent $118 on:\n\nPeach soju\nKalbi lettuce wraps\nPork bun 3 piece\nBasket of wigs\nDungeness crab noodles \n\nEverything was shareable for 2, I think max could be 3 peeps but nothing more or else you need to order doubles or more. \nThis place had a cute atmosphere, it was different, loved it had a Dj. Such a nice place to try out! Would come again for drinks and a snack.", "author": "Rob V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "We stopped in for the first time and really enjoyed our meal! Our server was awesome. Actually, everyone working the floor was warm and friendly to us. Definitely worth a stop in. \n\nWe ordered: \n- Kim chi nacho dip, comes with friend lotus roots and pork crackle to dip with.\n- Fried chicken - ask for the sampler of all of their flavors, but the garlic/soy was my favorite. The server asked if we dunked our chicken in the nacho cheese. We were like \"duh\". She giggled and said \"My people!\"\n- Pork and beef dumplings, delicious.\n- They had a special of house made ramen noodles cooked in garlic and a black bean sauce. Honestly, they were the best \"garlic noodles\" I've ever had in SF and I go out of my way to try garlic noodles all over town. These were like what I want all garlic noodles to taste like. We told our server they have to add it to the menu.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-17", "description": "I recently tried Foxsister with a colleague visiting from Asia who has worked for years in Korea.  The mission district is a good  location, and they actually have a innovative blind wine list, certainly a novelty in a Korean restaurant!  While our discussion about the veracity of the cuisine to its heritage was at times overshadowed by the visual overload and music, we both agreed that this modern interpretation is in keeping with a good soju bar with fresh, imaginative street food.  \n\nOne of my favorite Korean restaurants (outside of Korea) is Modern Korean in Vienna.  When you travel to Vienna, it is a must try restaurant. There, the food is elevated to a gourmands palate, however both places strike me with their personal attention to their guests and shared joy in the complex flavors.\n\nA few of the standouts that we ordered were Oxtails in marrow broth,  spicy octopus rice cakes, and dungeness crab noodles.  Of course we had to try the blind wine list and were not disappointed!", "author": "Frank S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-14", "description": "I felt like I was transported to a late 90s Korean bbq spot/soju bar in LA- the decor is brash and the music just as loud. It's a fun spot with decent food but don't come here if you are looking for a traditional Korean restaurant. My friend and I stopped in for a late Sat dinner around 9pm and were seated right away. \n\nWe got the rice cakes with octopus, the ban chan and some drinks. We liked the pina colada slushy (did I mention this place feels like the 90s?) and the octopus rice cakes; the sauce on the rice cakes reminded me of really good orange peel chicken - kind of sweet and citrusy while also being umami rich and just a little spicy.  The ban Chan ($8) were the only disappointment to me- the kim chi didn't taste fresh/sweet (more just vinegary) and the other sides were also uneventful - I think the usual stuff they serve in Santa Clara's K-town for free is better. \n\nStill, I'm happy to have a fun spot to satisfy late night spicy food cravings in my neighborhood!", "author": "Jean L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Dinner last night, and we were pleasantly surprised.  Maybe they reworked their spice level (seems like some folks on Yelp were complaining about that), but the dishes we had were nice and spicy, tangy, and well balanced.  \n\nWe did the rice cake with octopus (really tender octopus), and pork bulgogi.  The rice cake had a very good sauce and the crispy sweet potato gave it a light crunch component that really put it over the top.  The bulgogi was sizzling, saucy, and perfect with the fermented miso and pickled daikon. (I wish there had been a bit more of a char on the bulgogi, the parts that had a little char were outstanding.)\n\nDefinitely recommend both dishes!  And the portions were large enough that with the two of us splitting those dishes, we were quite full.\n\nCompletely traditional Korean? No, it's an interesting mix of some trendy and traditional.  Very tasty, though.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-13", "description": "Visited FoxSister on it's 4th night of their opening, came from Hayward because someone recommended we try it.\n\nVery nice layout and decor was definitely inviting! We were seated in about 5min considering it was around 8pm on Thursday night. Our female server had such a great personality!\n\nThe music was hella loud and had to do a little yelling to talk but wasn't such a bother, definitely made me feel like I was at a bar with food which made me want to drink some more lol.\n\nIt is Korean inspired so don't expect authentic Korean food (take it from someone who was in Korea not so long ago) It was good to share amongst two people, however for the price it felt like servings were a bit small.\n\n\nHere's what we ordered\n**2 Soju Slushies $10 each\n**Mung Bean Pancake for $12 about the size of a small pie then cut up into slices\n**Pork Dumplings $14 for about 6 small rolls (not in the \"traditional\" dumpling shape) \n**1 serving of white rice $3 \n** \"Some Chicken\" soy garlic $14 which is considered the \"medium\" order and it only comes with 6 pieces of chicken we got a couple of boneless in there which was nice the soy garlic sauce on it was so good\n\nTotaling our bill to about $80 excluding tip \n\nIf I'm in the area I'd try it again, but I'm not sure I'd drive out just for it", "author": "Vicky G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "Tldr; expensive and the kimchi jjigae ruined it for me.\n\nGot their fried chicken (all 3 flavors) and it was pretty solid. I'd give the wings a 5/5.\n\nTheir kimchi jjigae (kimchi hellfire stew) was incredibly disappointing, probably one of the most disappointing soups I've ever been served. It tasted like watered down gojuchang / hot pepper paste and had no flavor (or kimchi flavor) at all. \n\nThe server at the bar was friendly (almost too friendly), but overall this place is not very good if you're feeling Korean soup / food (banchan is $8 lol). If you're just looking for chicken + beer / bar food this place is probably solid during happy hour.\n\nHonestly, the kimchi jjigae ruined this place for me and I probably won't come back because of that one dish.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Amazing food.  Our server was great.  She was super nice and friendly.  There were 3 of us and we ordered 4 dishes.  We ate everything and even licked the plates.  All for of these dishes were amazing.\n\nSoba salad\nCheese dip\nPork fried rice\nHalf chicken with OG recipe (sea salt and seaweed)\n\nThe price were reasonable.  I'm definitely coming back.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "We were excited to try this new place. Just in case it get crowded, I rsvp a table for 2. We got there 10 minutes early....as time goes by more ppl arriving. 6 of us waiting outside in the rain - they could have let us in.\n\nThe door finally opened. We walk in to an empty restaurant. I saw the booth for 2 and requested to be seat there. The hostess made up some lame excuses how she can't seat us there and gave us a regular table. The funny thing was the customers came right behind us was also for 2. They got the booth. 3 vacants was available. It was bad customer experience n extremely rude. We stayed for over an hour the restaurant was not filled. My conclusion was we could have gotten the booth.\n\nThank God our waitress was friendly and knowledgeable. That make the experience better. Food were mediocre. We were offer a sample of the slushee which was pretty good. I will not recommended this place. Sf have no shortage of restaurants when you have a rude hostess and mediocre selection of food, why would I ever come back. Not to mention the bill came out to be $80 for 2 drinks n 2 plates.", "author": "anita s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Came here for brunch and the burger was delicious. The servers were very friendly and accommodating.", "author": "Donovan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "One of my favorite spots in the city for a night out with good friends. The vibe is fun, relaxed, and chill, and the dim lighting mixed with the hip-hop background music is perfect for catching up. I'm stoked about this place based on the atmosphere alone.\n\nThe food and drinks are fantastic, too. Came with a group, and we ordered the fried chicken, dungeness crab noodles, spicy pork bulgogi, and the pork fried rice. Everything was amazing. You've also got to try the pina colada or peach daiquiri soju slushees or the grapefruit makgeolli.\n\nHave gone several times, and it's always a fun time. I'm a big fan!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "I went to try this place tonight, but had such a bad experience that I felt compel to write a review. My 3 friends and I came at around 7pm. It was not crowded at all with 4 tables open, but the hostess told us it was 1 hour and 45 mins wait for a table and 45 mins for the bar. Now it's Friday so we understood and put our number down to be notified of a free table. We stood around the waiting area and even befriended an Uber Eats driver. The whole 40 mins we waited, two more tables left and no one new seated. When one friend asked about the free tables, the hostess gave him a lot of attitude and assured him he would be texted when a table was available. We ate around the neighborhood instead (for four hours) and we NEVER received a text about a table. \n\nI am just sad that a hostess would lie about putting us on a \"list\" (and lord knows what else). I don't know why she did what she did but I recommend everyone make a reservation beforehand so you don't get the same treatment.", "author": "Karina N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "Another disappointing foray into the SF Korean food and drinking scene. The food is not Korean, and the prices are pretty high. Nacho cheese dip with kimchi in it? Pork cracklings and lotus root to dip? That's Chinese + American, with a smattering of kimchi inside the nacho cheese. Mung bean pancake? Where's the kimchi and/or seafood pancake? There's no corn cheese or spicy chicken/pork in cheese. They don't have chamisul fresh or even pitchers of OB/Cass/Hite. I'm super confused as to why this place is advertised as Korean. At least their slushies are tasty?", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "3.5 or 3.75 stars is more accurate. 3 too low, 4 too high.\n\nIt is dive-bar dark in there and punk rock plays during dinner, which I thought would be problems for reading the menu and talking but not so. We scored one of the plush red booths after the host looked long and hard across a mostly empty restaurant and deliberated whether a table could be made available to us. One was and it turned out to be a great place to sit and watch everything going on. \n\nWe ordered a basket of the O.G. recipe chicken wings, the kalbi shortribs and a side of rice. Oh, and peach soju. As bar food it made sense, nothing complicated or at a high level. If looking for inspired or even representative Korean food, my guess is that Foxsister misses. There wasn't nearly enough vegetables on the menu, and the wings were salty as the Sahara (but plentiful, I can't agree with other complaints on this score). But we ate what we ordered and liked the taste, and had a good time. \nPrice was a little high but not prohibitively so, I think I'd agree to return.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "This place has done wonders with what was a deadly cavernous space when it was a pizzeria.  The decor is warm and inviting now, with lots of cheerful cherry red booths and strings of lights.  Our group ordered a bottle of the plain soju- I tasted the soju slushies and they were too sweet for me, so we went with plain- $15 for a small bottle.  We ordered a basket of mixed wings, Kimchee stew, Dungeness crab noodles and octopus rice cakes.  Chicken wings were $14 for 5, but they were the large full chicken wings not just drummettes.  That was the only thing that was large.  Everything else was painfully small.  Delicious but small.  Tiny flecks of crab in the noodles, little bits of octopus in the rice cakes.  We decided we wanted dessert after since we were still kind of hungry, so we ordered what was described by one wait staff as lime donuts and another as lemon donuts.  They were actually completely devoid of citrus, just plain donut holes.  They came with a spicy Chocolate dipping sauce, that had nary a whiff of spice.  So why the four stars?  The place was really cosy and festive, and the staff was friendly.  The food was all quite tasty, just very small - with the exception of chicken wings, and it's got a more festive atmosphere then going to a real Korean place with free banchan and big portions.  A good place to have some drinks and Chicken wings before a night out, or a good date spot that won't give you food coma.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "This place can't really be called Korean.... there are moments of inspiration but the food and flavors all fall flat. AND it's expensive. \n\n\"Hellfire\" kimchee stew: It was basically kimchee and tofu in hot water - it doesn't have any of the flavor that Tofu soup usually has, and wasn't spicy at all.\n\nThe kimchee nacho cheese dip: It's pretty hard to scoop melted cheese with chips that literally have holes in them (lotus chips), but they taste great. Once you get past that, you'll find the queso has NO kimchee in it. it's not really even spicy except for the sliced jalapenos sitting on top. \n\nMy favorite thing was the mushroom rice cakes, which was a fun little stir fry that has exactly those ingredients. Again, nothing to get excited about.\n\nFor a $12 slushie, you'd expect it to be at least the size of a pint, but I'd be pressed to say it's even half that (I'm sorry if it is, I'm not good with measurement) \n\nThe decor is great, the service was fine, but this was just not the place for food.... or drink?... ESPECIALLY if you like Korean, because then it's just a stab in the back.", "author": "Austin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-15", "description": "I was excited to try this place with its stellar reviews but was disappointed.\n\ngarlic soy fried chicken basket: extra crispy so that was a plus, but very little garlic and way, way too much soy that the wings were extremely salty. the pickled radish that comes with are bland.\n\nspicy pork bulgogi bossam: decent. also on the saltier side.\n\nfrozé slushie: a half pour of slushie with strong berry flavors and not much alcohol. tastes good but not worth the price tag I'd say.\n\nservice overall good except for the side rice that came out after we were all done with the food. came here on a Wednesday night at 7 and we had to wait for bar seating because people tend to reserve tables.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Good for 2 people if vegetarian! Not many options for a larger vegetarian group! \n\nDont miss boba custard.\n\nAmazing food - fox foo salad,yuba bulgogi and mushroom rice cakes (best)\n\nIn drinsk dont miss peach soju ...\n\nGreat modern korean ...", "author": "Priyanka L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "We walked in to this place with no expectations but were pleasantly surprised. The decor is quite interesting - very club/ pub like- colorful. The restaurant was pretty empty at 6 pm, so we were seated promptly. We ordered the octopus rice cakes and the pork shoulder bulgogi. The octopus was nicely cooked with the crispy rice cakes in a medium spicy sauce base. Really delicious dish. The bulgogi came with some condiments and lettuce wraps, which was perfect to calm down the heat of the bulgogi. The flavors again were perfect. The service was pretty good as well. Will definitely try this place again.", "author": "Chet L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-30", "description": "The best thing about this place is the fried chicken. Food is waaaaaay over priced for what it is. Clearly they are just taking advantage of the lack of Korean food in the area. They charge $8 for banchans which are always free at Korean restaurants and the bulgogi was too soggy and saucy (the meat was too thin). You can hardly taste the meat it feels more like you are eating sauce/paste. \n\nService is definitely great and staff was really friendly. Might come back again but if we do will just get more fried chicken. Was really hoping the food would be awesome because this place is so close!", "author": "Julia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Like most in San Francisco, I'm a total sucker for trendy takes on Asian cuisine (Burma Love, Hawker Fare, Dancing Yak), and Foxsister did not disappoint! Brought a crew here for my birthday dinner after having a wonderful experience the first time around. The kimchi nacho cheese dip was beyond my wildest appetizer dreams, and the soju slushies were a fantastic vehicle for what is usually not my favorite form of booze. If you're looking for totally authentic Korean food this probably is not your place, but if you are interested in fusion interpretations in a fun atmosphere I would definitely recommend!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "quick tips:\n- the frozé (rosé slushie with soju) is just perfect\n- quick, friendly service\n- it's pretty loud and dark\n\n- HIGH LIGHTS -\nThe frozé was actually incredible. It was the perfect consistency: thick, but easy to drink. The rosé flavor was not too strong, and the drink as a whole was light and refreshing.\n\nThe sweet and spicy wings were very flavorful and the skin was thin and lightly crispy. A basket came with 6 full wings (drumette, wingette, tip).\n\nThe beef galbi was juicy and boneless, and came on a sizzling plate.\n\n- low LIGHTS -\nThe kimchi stew tasted flat, like a generic tomato soup. I wish I had nicer things to say, but it was too watery and we couldn't find the pork belly it was supposed to come with. Also, I'm not sure where the tomato flavor came from. Unfortunately, by the time it reached our table, it was not bubbling/sizzling.\n\nBanchan costs $8. Yes, this is San Francisco, but I'd love to see the tradition of complimentary banchan upheld. Head's up, it includes 4 dishes: kimchi, bean sprouts, dried anchovies, and mushrooms. I wish the menu listed these.\n\nThe watermelon slushie was just ok for me. It tasted like watermelon that was too ripe (lol, I'm a princess, I know). But it's hard to compare another drink to the perfect frozé.\n\n- re: HIGH LIGHTS -\nThe service was great, especially for their 2nd day. Our waiter was attentive and fun to talk to.\n\nThe space had a fun party vibe. There were strings of little lights and fun artwork on the walls. The music is pretty loud, making this a great location for a group dinner. Probably not the best place for a serious date.\n\n- OVERALL -\nI can't get over how awesome the frozé was. Can you tell? I've only mentioned it 3 times. While this restaurant seems great for groups, I can't wait to return to Foxsister and get a frozé and basket of wings for myself.", "author": "Jiann M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "Overpriced and their \"fusion\" Korean is a nicer way to describe underwhelming not-even-close-to-authentic. Went with 3 friends for dinner and the live DJ's music was so loud, we couldn't even hear each other at the table even though we were screaming at top of our lungs to talk. Definitely not coming back here.", "author": "Lara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Everything from the food to the decor is fun and unpretentious. The chef-owner Brandon is a badass with an amazing vision to bring approachable Korean street food to 24th Street. Get the dumplings, the fresh crab noodles, and the wings. The BBQ shortribs are to die for, and don't you dare skip the boozy slushies !", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Great Korean Food in the Mission District, service was outstanding too. Really enjoyed the Fried Oysters and the Mushroom Rice Cakes. They actually mix really well together.  I would totally go back as this was a great atmosphere and value.", "author": "Carrie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-20", "description": "i had a nice time at foxsister, but definitely wont be suggesting this spot for serious eats. it's a nice place for friends to gather and drink soju/beers and have a few snacks, but that's about it. wait for 2 people for bar seating even was 30 minutes last saturday.  the place was popping. we got a bottle of the peach soju (DELICIOUS) for $15 and shared it standing at the ledge they had at the back. when the bar finally cleared, we sat down and ordered the medium sized wings (half n half is offered, which i appreciate, because i can never decide on a single flavor), the oxtail soup with rice, the banchan ($8!!) and the pancake, which came last and it was burnt on the bottom.  the wings were pretty good, but a slightly on the salty side. i also dont particularly enjoy the shape of the wings, makes it super hard to eat. the oxtail soup came out next, and it was pretty good - especially on a chilly evening. the rice cakes are nice n soft, but the soup base itself was a little bland, and the veggies in the dish werent integrated with the soup at all. banchan was good - but shouldnt this be free, or at least cheaper the $8? dinner for two was a little over $100 for mediocre korean food in the mission in a loud space. i think things are generally going in the right direction, but have room for improvement for sure.\n\nthe decor of the restaurant is very cute though, and makes me think that i need lanterns and string lights in my apartment as well!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-16", "description": "as a korean-american who grew up eating korean food errday, i don't get the hype. i wanted to love it, i really did, but this place left me sad and still on the search for a korean spot to call home. \n\nthe kimchi stew tasted flat and lacked depth in flavor. the shrimp and chive dumplings were just ok...the mungbean pancake was aight. the best thing was probably the kimchi fried rice, bc pork belly makes the world go 'round. overall everything was mediocre and waaaaaaaaaaaaayyyyyyyy-y-yyyy overpriced. i was legit sad when the bill came. \n\nthe only thing i really enjoyed was the ambiance and the bazaar fantasy movies played at the bar. i really wanted to like you foxsister, but it seems you will be joining my growing list of b-team korean restaurants in the bay.", "author": "Christa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "I was totally blown away by this place. Didn't know much about it and hadn't read about it before, and I was so pleasantly surprised by it all. The ambiance was super cool and fun and whimsical - kind of a nice escape from the craziness of life and city. And the food was excellent. Each dish was full of flavor and delight. I will go back again and again!", "author": "Beth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "what a super fun dinner- I went back twice in 1 week. I really love casual, tasty restaurants with friends where I can be loud, listen to my good music and chill. Foxsister does not disappoint. \nloving the soju slushies- watermelon is my favorite, beware they sneak up on you. \nplus they serve hitachino- a Japanese white ale that's hard to find. \n1st time we ate the nacho cheese , dumplings (really liked the shape/texture), fried chicken wings (the sticky sweet sauce, not the OG recipe) and short ribs (sooooooo delish). \ntonight we ate the nacho cheese again, dumplings again, the stew and oxtail marrow soup plus the tofu bulgogi that are my new favorite. \nthe broth is so favorable and rich- I could just drink it ! \n\nThe ambiance of the restaurant is also worth noting as being inviting and perfect for a group. I'll definitely be back!", "author": "Marissa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "Random dinner on a random night lead me here.  Korean fried chicken, pickles, crab noodles...ya you name it. Not totally fair to compare it to a standard Korean place because it's got a twist or two.  But oh man, that fried chicken was pretty legit. It's kinda dark and the menu I got was black text on red paper...so be ready to be that jerk with the iPhone torch reading the menu.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "I love this place! I had my birthday dinner here and they were so accommodating through the whole process! Kristina was very professional and responded to my emails very quickly during the planning process and she worked with me on the menu to accommodate for vegetarians. This is the place you take people from out of town that want the local SF experience aside from the touristy shit. Atmosphere is on point. Not only is the staff friendly, the food is Amazing! Get the mushroom rice cakes. Sorry for throwing my doughnut holes, I was a bit tipsy by dessert.", "author": "Melody A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "This place was fantastic!!  Right from the get go, I really enjoyed the experience.  The booth seats along the side and front gave the place a great look.\n\nThe wait staff was super friendly and helpful in recommending quality dishes.  They could not have been more friendly and attentive; truly enhancing the experience.  \n\nAll the food we got was delicious!  An amazing combination of authentic Korean and modern takes on dishes.  All the dumplings and the pork bulgogi were fantastic, but the fried chicken was the best.  Both styles are amazing!\n\nI cannot recommend this highly enough!", "author": "Jason F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-22", "description": "I'm a huge fan of Korean food, and perhaps I'm spoiled by NYC and NJ pricing, but I think the food here is very overpriced. It's a nice cozy spot to come and get drinks and snacks, but I wouldn't say that a full course dinner here is worth the $$.", "author": "Justina E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "The food was great but the service was eh. \n\nWe ordered the crispy mung bean pancake and an order of \"Some Chicken\". Both were really delicious and I'd come back for the food. \n\nIt was the service that left a bad taste in our mouth. We received the chicken pretty quickly which I was delighted as I was pretty hungry. After 25 minutes, our pancakes had not been delivered. I finally flagged someone down which they said it was on the way. \n\nAfter 10 minutes, the waitress apologized and said she didn't hear our order and it would be coming shortly. \n\nMy question is, if she didn't hear the rest of our order, why were we sitting around for 25 minutes? It wasn't very busy during this time at all. \n\nThe pancakes finally arrived and it was a crispy slice of heaven! \n\nWhen we got our bill, there was a beer we didn't order on there. So not only were we ignored for 25 minutes, the rest of our food arrived 45 minutes after we ordered, they had made another mistake. \n\nCome for the food, but try to ignore the bad service like how you'll be ignored.", "author": "Enoch L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Great meal, many items had a gluten free option and all very tasty. Everything prepared with great care and served timely with a smile and friendly attitude!  The frozen beverages were fantastic! Atmosphere was friendly, inviting and fun!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "Holy shit y'all the chicken. So next level. It says I have to keep writing but really that's it. Try all the sauces.", "author": "Kaia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Great service and staff. (Ashley was sooo nice!) Yummy food. Order the mushroom rice cake and garlic soy fried chicken.", "author": "Lesley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-19", "description": "I had my eye on this restaurant ever since it was announced. Maybe I hyped it up too much, but I left feeling that everything was ok or good, but nothing was great for the price point (except maybe the frozen drinks). \n\nWe ordered the banchan, oxtail and bone marrow stew, fried chicken wings (both the spicy and sweet and the garlic soy), the mung bean pancake, crab noodles and pork bulgolgi. So we definitely tried a lot on the menu. Probably my favorite thing was the garlic soy wings. \n\nWe also had kind of a weird service issue - may just be because it just opened. We didn't receive a glass of wine that we ordered and we requested it removed from the bill. The server's initial response was \"I could have sworn I brought it out.\" So, that was more of a battle than expected. \n\nWe will probably try this place again since it's so close by. I will revert back once we do.", "author": "Brigitte J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-20", "description": "TL;DR food was decent but expensive. Wings are good, but slightly on the salty side.\n\nSoju was $15. I can't get over the fact that a bottle of soju was $15. At a Korean market you'll find soju at roughly $2 just for reference. At most Korean bars the price ranges from $3-8. \n\nThey also charge for banchan which in my book is a huge no-no for Korean restaurants. The only thing keeping this from being a 2-star rating is my compassion for restaurant owners who have to pay high overheads due to soaring rent and cost of living.\n\nPitchers are served here and are actually much more affordable to than the soju, so if you want to drink some beers and enjoy wings with friends this could be the place for you. The wife and I ordered the Garlic soy wings, sweet & spicy wings, pork kimchee fried rice, fried oysters, and a bottle of $15 soju. \n\nThe wings are good. 5 actual wings (or 10 if you go to an American wing place) are served with each order. Sweet and spicy was our favorite. Fried oysters were delicious, crunchy yet juicy on the inside. The fried rice was meh. \n\nIf I were to go back, it would only be for the wings and pitchers, and the fact that it's walking distance from where I live. \n\nThe restaurant is also located very close to the 24th/mission Bart station. Parking sucks in that area so try to take public transportation or Lyft.\n\nLastly there is a bar and TV if you want to come watch a game, but fyi half the restaurant is out of view from the TV.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "This place is a literal gem in the mission because it's hard to find Korean here, especially got Korean. Kimchi nacho cheese with pork rinds. That's what sold me. You get a huge portion so share with a friend. The wings are awesome too, Ask for \"around the world\" style if you want to try all the flavors. Batter is light and crispy. I am also a huge fan of the spicy pork. It comes with lettuce, thinly sliced daikon, fermented bean paste, garlic and jalapeño to make a little taco. You gotta try this place!", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "Very good good all around. The potstickers were exceptionally delicious. A little expensive but probably worth it overall. I plan on going back.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Delicious half-order (\"stack\") of ribs, enough to satiate a late-night craving, though a bit pricey at $16.\n\nPleasant bar service.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "The place looks like it would be a lowkey cheap bites place, but is actually really pricey for the amount of food that you get. I shared the Dungeness crab noodle and mung bean pancake with a friend, paid about $21 and was still hungry afterwards. Regardless it is a pretty cool atmosphere inside. Fried chicken might be more worth it here", "author": "Claire L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "Nice place to try out. The food was pretty average here. Wasn't a big fan of the stew-soup. The black bean garlic noodles were good.", "author": "S K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "First time trying this place, upon recommendation by my friend. Hands down, one of the best dining experiences I've had in a while. The space itself is lit with colorful string lights and lanterns, all reflected by the black tiles and tables, creating a vibrant wonderland. We ordered the Fox Food salad, spicy tofu buns, a basket of fried chicken, and the octopus rice cakes. AMAZING. The tofu was excellent, perfectly seasoned and soft. They also offer three different types of fried chicken, but you can get multiple kinds within one order. Our favorite was the garlic soy, with sweet and spicy a close second. The dessert menu was enticing, but we were too stuffed full of great eats to try any. Next time!", "author": "Odette N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-20", "description": "$8 for banchan (kim chee, pickles and snacks oh my!).  Any korean restaurant that charges for kim chee should be shut down.  Enough said.", "author": "Eddy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-27", "description": "Delicious food but expensive for what it was and the neighborhood. I ordered a glass of sparkling wine and my husband a mug of Tecate. We split the dumplings which were delicious! He had half a rack of ribs with a side of rice... and it couldn't have been more than 1/3 cup of rice... I ordered the crab noodles which were also tasty but lacking in the crab area. \n\nAll of that was $84.... which didn't feel appropriate. \n\nService was great, food delicious but not worth the price.", "author": "Kyra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Had a work event here for 50 people and everything was great! The food was tasty, there was a lot of variety, and the flavors were really good - Korean influenced but not just a regular run of the mill offer. We had:\n\n-Banchan (5 different options, all tasty- those marinated mushrooms !)\n-veggie dumplings\n-pork and beef dumplings (so good)\n- Dungeness Crab noodle (jap chae noodle- could have used more crab but I would always say that about dishes with crab)\n-Mushroom Rice Cakes (a tteok dish)\n- Pork Fried Rice (noms)\n- Grilled Kalbi (flavorful and not overly fatty)\n-Yuba Bulgogi \n-Grilled Pork Bulgogi\n-Rice\n-Garlic Soy Fried Chicken - really nice\n-Sweet and Spicy Fried Chicken - love the flavor!\n-Rack of Ribs\n-Bok Choy\n\nWhat's amazing was the level of service here. The dishes were timed well with banchans being out when we arrived and everything coming out at a nice cadence where we didn't have too much food sitting out, but were never waiting on anything either. It's a great skill to serve 50 people in a reception style and have things go well so if you're thinking about an event here- do it!\n\nMy favorite was the soju slushies. We had a lot of people that were fans of the Watermelon Ginger Lime but the clear, clear winner was the Froze. I don't know why it's called a froze, it's not really rose flavored like all the other frozes I have had (mostly at pool parties/ cabana service in Vegas) but was a thicker, raspberry flavor and amazing. I don't think it should be called a rose but it should be ordered as it's very, very good.", "author": "Kajal G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "should've made a reservation, waited for an hour, its alright were just chilling, the place is looking cool with all the lanterns, painting and lights i was pretty entertained. Parking is not easy, as it was the day of the dead event/parade. Didn't get to take pictures of food we just dug in, pretty good amount to share for two people, we got the kalbi beef ribs. Yum! soju slushies were great too! Great service as well. Cost will have to pay more than $100 just for two people. Would come back (and will make a reservation) next time lol", "author": "Chey I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "A great time and a fun atmosphere.  Tasty food that scratches the itch for tasty wings, bar food, etc. I'm not sure I would order pickup from the restaurant as a large part of my enjoyment is the atmosphere and experience.", "author": "Bret H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-20", "description": "Arrived at 7:40, reservation at 8. Didn't get seated until 8:20, didn't get to order cause I don't know what the waiter kept doing in the back, until 8:40. Waiter came by and looked at us and still didn't get it, i had to ask if we could order. The food was ok, I'd give it a 4/5. Not going back.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "I've been coming here quite a bit lately and I've always had a great time. Love the Korean bar bites. Some highlights are the pork cracklings with cheese dip, all the dumplings are great, crab noodle is delicious, and the garlic and soy fried chicken is amazing. This is a great place to go in lieu of a formal dinner. You get great food paired with beer and soju in with a lively atmosphere.", "author": "Phil C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Let me start this off by saying I was previously very intimidated by Korean food, the whole fermented thing freaks me out. The Foxsister team talked me through the menu and found the perfect meal for me and got me to try new things--which I ended up loving! yay for expanding palettes! \nI loved the Soju Slushies (so much that I tried all of them). Super innovative and delicious. My favorite was the peach while my dining partner loved the watermelon. \nI have to say that my favorite part was the vibe of the whole place. The chef, Brandon Kirksey, was in and out of the kitchen throughout the night. Super sweet and TALL dude. I loved the energetic punk playlist and bold decor. So many places in the city go for the minimalist thing it was a great change of pace. The team was great and down to earth. \nI could go on! Check it out yourself!", "author": "Molly S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-18", "description": "Overrated & over priced. YES for Slow cooker ribs, but NO for fried chicken, rice cakes, or cast iron dishes. You are definitely not getting what you paid for, all spicy flavors for different dishes were the same, nothing interesting.", "author": "Ellen h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Roommates took me here for my bday in April. Super cool vibe! We had the kimchi nacho cheese dip = amazing love the pork rinds! We also had the tacos which were a little too fatty for me. Roommate liked them. The shorts ribs were probably my favorite and my roommate ate all the dumplings. Lately we had \"some chicken\" that was a mix of garlic and the sweet and spicy. Good stuff! Definitely trying to get back here ASAP!", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "The service and atmosphere were excellent. The food on and off menu was pretty unique in my dining experience. I was really impressed with the calamari jerky, I am looking forward to getting back here again.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "In a sea of sameness, Foxsister sticks out. \n The food is killer, the atmosphere is fun and they have booze slurpees!! \n The kind of place you can drop in for a bite and a beer or celebrate a birthday with friends.  Don't miss the octopus rice cakes, bulgogi and dank fried chicken. \nI can't wait to go back and I just left.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-20", "description": "We had fried chicken, octopus rice cakes and kimchee nachos.  We were disappointed at food.  They were not tasty and not authentic korean food.  Food came out super slow and overpriced. Soju Slushies were good.", "author": "EunJoo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Tasty food and pretty fun ambiance but small portions for the price. If they just gave you more food it would be perfect. Probably will return.", "author": "Carolyn N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-23", "description": "I love fried chicken, unfortunately, just not here. Underwhelming take on korean bar food. Flavor was lacking across the board - calamari, rice cake...  Excessively overpriced for what it is.  Service was excellent so thanks for that.", "author": "E L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Love this place. Can't get enough of their soju/hite boilermakers. Go for the fried chicken, stay for the kimchi & ribs! Nom", "author": "S S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "So yummy. The pork buns were amazing as were the short ribs. In fact - everything was so good. Also the pina colada slushie? YUM! Such a fun girls night location.", "author": "Tali F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Up beat R&B Music on point along with some tasty amazing food!  Soooo good! Love the fact the menu changes up every few weeks too...to try new things!", "author": "Robert G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "This restaurant has become one of my favorites in San Francisco.. The service is superb, the food exquisite. My dish I will be sure to order again is the pork dumplings and kimchi cucumbers!!! Let's not get me on the Sojus.. Those are Devine!!! I would recommend this restaurant for anyone who would like great service and excellent food and atmosphere.. The Chef and his staff are friendly and approachable.... Can't wait till I visit again!!", "author": "Sheryl K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Good expensive korean food for non Koreans.  Great idea for having a hipster korean restaurant. Makes it sound expensive.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "The korean chicken wings are amazing! Also loved the ribs! This is a very lively place in the evening and they have great and unique drinks as well: alcohol containing slushies, whiskey barrel aged soju, sparkling apple/grape wine, and of course Hite beer. Our waitress Ashley was great, I kept accidentally dropping a chopstick and I think she would hear it and come running back with another chop stick for me. Also she had soju shots with the table! Great vibe in there and I will be back again soon!", "author": "Mike O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "Honestly the worst Korean spot I have ever ate at.  Don't waste your money on this place, a ton of better spots and cheaper places also.  Coco bang, toyosey, manna, etc.  Come here for Korean and you will waste your money on unauthentic Korean food.  \n\nWorst in the city....", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-10", "description": "The ambiance was really fun but the food was very disappointing.  The pancake was soggy.  The hellfire soup was very bland. The fried rice was pretty tasty. But overall the meal was disappointing especially for the price.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "Dive hipster Korean fusion.\n\nGood drinks.  Food so-so, trying too hard to be innovative.  Service was nice and they came around within delicious slushy shots, but forgot the rice I ordered.  Pricey compared with traditional Korean food.\n\nBanchan meh\nFried chicken meh\nEgg custard pretty good\n\n3 stars, where most of the good Korean in SF gets 4 and I'd give five to the best in LA, Tokyo and Seoul.", "author": "adam s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "I want to like this place because it's close by and I like the food but the 4 of us got food poisoning :(", "author": "That G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-17", "description": "The soba salad I ordered was tasty.\n\nBUT\n\nThe restaurant was WAY too loud. \nThe food is a bit over priced.\nDecor is distracting and overwhelming.\nThe ambiance will deter me from coming back.", "author": "Lily A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Ok... I'm giving Foxsister a 5/5 but not necessarily for the food but the environment, decor, and staff. Foxsister is a super fun spot to go with a few friends, kick back a few beers, and enjoy some fried chicken. I wasn't over the moon for everything I've ordered here, but a) there is very little (see: basically none) good Korean food in the Mission, so as a local I'll take what I can get, and b) the entire experience was just so enjoyable that I can give a pass on not totally amazing Korean food.\n\nI'm not a big fan of flavored Soju... but their slushies are delicious. Just ask for a sample if you don't want to take the plunge.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Wowza! This place is frikin rad. Korean inspired deliciousness that surprises you with every bite. Awesome service, fun atmosphere, and the slushies... #Frozeallday. My favorite fare so far...Short ribs be hella tender.  Melt in your mouth. The homemade crisps n cheese dip is ridiculous. Best I've had in years. Oxtail soup...so rich. I hear the chef preps it over 3 days! Wings...sweet n spicy for sure. Dessert:the rice pudding was great if you're not looking for too sweet. But that tea custard topped with toasted pine nuts and boba ballz...Dayum! Welcome to the neighborhood Foxsister. You are damn fine.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "So happy to have a great Korean place in the Mission!\n\nI went here with a friend and was really impressed. The atmosphere is lively and fun. Our server couldn't have been nicer or more accommodating. \n\nWe ordered a few things and shared everything:\n\n- Kimchi Nacho Cheese Dip: unexpectedly delicious! Pork cracklins + hot cheese dip. Can't go wrong with that.\n\n- Pork Fried Rice: simple but great - the pork was nice and crispy\n\n- Grilled Kalbi Shortrib: excellent flavor; this is meant to be put in lettuce wraps with soybean paste\n\n- Some Chicken: half a chicken - delightfully spicy, and I liked the fact that they provided some boneless chicken pieces as well\n\nWe had the Soju Froze slushies which were good :) We also had the Hite beer - came out super cold which is awesome.\n\nService was a bit on the slow side but given that they just opened, I'm sure that won't be an issue after a week or two.\n\nWill definitely be returning!", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "Really yum, quality food. Went for a pre xmas family gathering, they took reservations and sat us in a comfortable booth. Very fun interior and concept-- ordered a ton of stuff but highlights were the bulgogi, anything with rice cakes, and those mushrooms in the box choy. Chef came out and picked up dishes just to check out the floor, seemed like a great environment to work.", "author": "Nina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "This place is Awesome! It provides a fantastic flavor explosion with strong Korean influences while offering something for everyone. Probably the best ribs I've ever had, fantastic fried chicken, amazing oysters and Wow, the frozen drinks were incredible. Very excited I can now enjoy all of these things in the same place; Ill be back for sure; ENJOY!!!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "We loved this place! Great atmosphere, friendly service. The red booths, the purple glitter bar and slushy machines are a nice pop of color. As for the food: The Kimchi Nacho Cheese Dip with Pork Cracklings was a great way to start. The Dumplings and Dungeness Crab Noodles were delicious. The Sweet and Spicy Chicken was fantastic. The Slow Cooked Ribs were my favorite. Fall off the bone, melt in your mouth tender. I should have ordered a rack instead of a stack because they were so good I ordered another helping. I might have ordered a 3rd but the Pork Fried Rice sent me over the top. Filled with big chunks of pork and lots of flavor. My daughter loved the chocolate cupcake with the sparkler. We can't wait to go back and try some more of the menu. Foxsister is a hit! Try it for yourself you'll be glad you did.", "author": "Gene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "I'm so happy to support great food and a good atmosphere in my neighborhood. Foxsister serves up comfort food realness! The food and service are worth the wait! Basically, order everything and try it for yourself! No leaks!!", "author": "Ali E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I love, love, love this place.  The food and drinks are fantastic.  The venue is energizing.  It has quite an eclectic vibe to it. I can't wait to go back!", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "By far one of the best restaurants I have ever dined at! The ambiance was amazing with its dark unground look and bright neon signs. The food was spectacular, especially their delicious sauces. I could get enough until I saw the bathroom... IT WAS THE BEST BATHROOM IVE EVER BEEN IN! But I'll let you see it for yourself. Definitely will be visiting fo sister again and bringing more friends!!", "author": "Sophie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "I've been here a couple of times since they opened - once sat at the bar and ordered food, second with a larger group for food & drinks. Both times I had very positive experiences. The atmosphere is fun and lively. The food is delicious (a few of my favorites are the pork bulgogi, garlic soy chicken wings, and pork & beef dumplings). To top it off, staff is super friendly and attentive. I'll definitely be back in the future!", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "This place is amazing, the food is totally different and it's amazingly well crafted. You may think it's another Korean place but you'd be mistaken if you think that. For example, take the wings, they're not just any wings but coated with sweet n spicy gochujang sauce was out of this world. Writing about it makes me crave it even more. Then the Dungess crab noodles, now these came with potato starch vermicelli that were actually clear. I'd rate these 4.5 stars but the five star dish and the winner of the day was spicy octopus rice cakes. If there's only one dish you're gonna order here, this is gonna be it. I wish I'd taken pics, but man the food is worth coming back again and again. Also, I've been told that the executive chef is from The Slanted Door so I guess the finesse in the food is understandable.", "author": "N N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "Decently tasty Korean food with an element of fusion. But dessert were lacking and pretty loud. Would go back! A good option for Asian food in the Mission.", "author": "Eve H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Best food in town!!  great neighborhood spot. Love love love it. Soju slushies!!! Soju slushies! Soju slushies!", "author": "Brianne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "This place rips! I had chicken wings, 4 soju drinks and a rad kimchi thing that I can't recall the name of. Nice to have a Korean chicken spot in the Mission, and it's nice that another DIY Mom-and-pop spot is open in the neighborhood.", "author": "George R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Lots of fun, played movie classics like Big Lebowski and fear and loathing while serving fun food. Dumplings were on point, got the rib (lettuce wrap version) and very tasty but would have preferred duck and pancakes from yank sing. Soju and rice wine were shared at the table. The rice wine was unfiltered sake meets squirt so we didn't run it back but the soju kept pouring. They did this funny thing where they scooped the top of the lemon, which makes sense but think I will remain a wedge man. Let's see, also had crab noodles and fried chicken. Noodles were tasty but since this is the flour and water crew I expected avant-garde. Dried fried chicken, which I guess was the classic, was lovely while the wet was overwhelming with flavor.", "author": "Brendan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "This fills a need in San Francisco for a hip, fun dining experience with great food, great service, great ambience. Go with friends expect to talk loud over hip hop, take plenty of soju shots and grub on some good Korean (even by LA standards)", "author": "Jacob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "My husband brought me here for my birthday, and it was a treat from beginning to end. It's my new favorite restaurant and I can't wait to go back.\n\nWe started with the kimchee & pickles, which was an array of small dishes, including outstanding marinated mushrooms and squid jerky that my son could not stop munching. The dumplings were delicious and came with a salad that was surprisingly refreshing and rich. We also had the chicken wings, a good sized portion of crunchy goodness. The kalbi lettuce wraps were so good we practically licked the plate. We also ordered a stack of ribs that were sticky sweet hot and melted in our mouths.\n\nThe service was excellent as well, attentive and helpful. I can't say enough good things about this place!", "author": "Meghan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Absolutely loved our dinner experience! The chicken and ribs were amazing and the frozen cocktails were delicious.  This place has a great vibe and will definitely be coming back.", "author": "Zack S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Just went to this new hotspot in the Mission for the second time.  Very lively atmosphere with great food and friendly service.  Foxsister provides comfortable seating in large red booths or great action at the bat. The menu is a mix of some authentic dishes as well as some with a little more American flare. If your menu choices lean to the hotter side, be sure to get one of the soju slushee to quell the fire ( watermelon-ginger is my favorite). Had the same server on both occasions.  She was super friendly, very well informed and knowledgeable about the menu.  Will definitely go back!", "author": "Kraig B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Had dinner here last night and really enjoyed it. Very busy but the service was great, from the hostess and server :) Fried chicken and spicy pork was pretty good. Drink selection was a big plus. Fun and great variety. Coming back soon and definitely recommend for a fun, casual dinner with friends.  Only con: one bathroom for men and women so that wasn't really good for such a busy place but I guess that's not too unusual for SF.", "author": "N. V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "This place is awesome !! As soon as you walk inside you are transported to a world of 1980's punk with disco glam and a punch of nostalgia from a place I had no idea I was missing. This all is just to get you in the mood for what's to come from the kitchen and bar. \nThe menu is playful yet true to Korean cuisine. Meant to be shared family style and enjoyed by everyone in your table. The fried chicken is amazing !!!! I recommend it you get \"Around the world\" so you can try all three flavors. (Sweet & Spicy, Ginger soy, OG). The Banchan, pork & beef dumplings, Oxtail Stew, Kalbi short rib, Pork fried rice was what we ordered. Every bite was on point ! One bite better the the rest. From the bar the soju slushies are so refreshing and surprisingly strong ! Our experience was unbelievable!! We are coming back tomorrow", "author": "Jacinto C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-27", "description": "Saw this new Korean restaurant on Yelp with excellent reviews. Brought my fellow foodie friend to get an extra set of taste bud. To our disappointment, they were out of the glazed pork ribs and the spicy octopus rice cakes, but there were plenty of other mouth watering sounding items on the menu. We ended up ordering the kimchi nacho dip, the sweet chili chicken wings, the kimchi hellfire stew and the spicy pork bulgogi. The kimchi nacho dip came with lotus chips and giant pork grinds, very creative. The dip was pretty good but we really couldn't taste any kimchi. The kimchi hellfire stew had little spices, which begs the question why call it hellfire? The sweet chili chicken wings were large, crispy and juicy. However, they were too salty and really didn't taste sweet nor spicy. The spicy pork bulgogi we thought was on point. Had very good flavor! The lettuce leaf wraps were an interesting side as opposed to the traditional steamed rice. Overall, we both agreed the food was good but not great, being on the pricey side.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Amazing restaurant with a friendly and knowledgeable staff. Try the Soju Slushies and the fried rice.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "I wanted to take my boyfriend to a new spot in SF for an early birthday celebration and I came across Foxsister. I made reservations for 2 at 6pm without realizing the restaurant didn't open until 6pm so it was actually perfect timing! We ordered white rice, a Stack (5 pieces) of Slow Cooked Ribs, and Spicy Pork Bulgogi to share. The ribs had incredibly rich flavor and the meat was literally falling off the bone. They were well-cooked, well-coated in sauce, and we finished them off easily. The Spicy Pork Bulgogi was sizzling when it arrived at our table and came complete with lettuce wraps. It was a refreshing relief from all the heat (flavor/temperature) and my boyfriend was absolutely in love with the flavor. We definitely crave spicy foods so this pair was perfection. Our server was fantastic, checked on us multiple times, and gave us much needed extra lettuce wraps to eat up everything! I also loved the décor and ambiance. Normally I gravitate away from establishments that are low lit but with the mirror mosaic, candlelit tables, and Bone Thugs-N-Harmony bumpin there really was nothing to complain about. No photos of the food because it was THAT amazing. My bf really enjoyed himself and we will definitely return!", "author": "Becca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Just what the neighborhood needs! But really, it is! Its fun, its got amazing food and Korean food is so under represented in this area! The ambiance is amazing.. they have a HOT PINK GLITTER BAR!! They also have a birthday cupcake for dessert because every day should be your birthday! If you knew me, you would know this is my life motto!! Also my friends joke that I am a vegetarian on the inside because of how picky I am with meat stuffs and let me tell you I ate the shit out of some ribs here.. they were so juicy and tender they fell of the bone and so i wasnt creeped out!! Also the dumplings! and the noodle salad and the chicken in 3 flavors! OMG! I died and turned into a ghost while at FoxSister because it was too perfect. I dont drink but if i did soju slushies would be my #1 beverage of choice guaranteed! Literally best new restaruant in SF!  HANDS DOWN!!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "I'll give this place another shot at some point -- especially since I live pretty close. Main gripes:\n* music way too loud\n* too trendy\n* foods good but not $50 per person good (app drink and main)\n\nLikes:\n* great decor\n* good service, everyone friendly\n\nThe food is Korean-ish -- definitely catered towards the western palette, while also being reminiscent of Korean. \n\nIt's a nice place -- just not a staple at this point.", "author": "Sumeet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "The food and the ambience is here is fun, creative and a great place to chill with friends. Classic Korean dishes with a twist. \n\nThe soju slushies are the best thing on this earth and a must try. Especially that Rose, it is fire!!!", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "- having to pay for ban chan at a Korean place is wack\n- overpriced for what you get. Dinner for two with two entrees, ban chan, one rice, two alcoholic drinks came to ~$50/person after tip\n- there is much better valued Korean food in SF", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "a large group of us had dinner here last night to celebrate a friend's birthday.  we arrived early for drinks, enjoyed a sampling of slushies, all of which were amazing, and then had dinner.\neverything was DELICIOUS and the service was thoughtful.  no doubt all 13 of us will be back for more very soon!", "author": "Kelly O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-27", "description": "Finally a Korean place in the Mission. Well, not really. The Banjan is not free and kind of pricey for what you get. The menu is pretty limited though judging by other peoples comments they seem to change it. Many of the dishes were too salty, none were spicy even if \"fire\" was in the name. If you are dying for Korean tasting food and don't have time to get to a good place, this will do if you don't mind the high prices.", "author": "Marlin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "First time having Korean style food and loved every dish. Especially liked that it's served family style. Great service, great food, great atmosphere...5 stars!", "author": "Lissette I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "Edible but aggressively mediocre. Then banchan was ok. Pork fried rice was bland but ok. The fried chicken was oversalted.", "author": "Noam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-18", "description": "Went here 2 weeks ago with my 7 year old   Place was almost completely empty. I asked for a table the host asked if I had reservations I did not. She looked at my daughter and said we don't have any available tables until 10pm. The hostess was unfriendly in her delivery and it was obvious from her look that we were not welcome. This place is definitely not family friendly. Don't bother.", "author": "Kyra I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Delicious! We had a reservation on Friday night at 6p when the place opened, and there was already a line forming when we arrived early. When we were seated, it seemed like entire restaurant was already full! We ordered the chicken \"around the world\", a few pieces of each flavor, octopus rice cakes, and the kimchi nachos for an appetizer. Everything was delicious, but I would say that the octopus and kimchi nachos stood out to me the most even though the place has been blogged about for their chicken. We split these items among two of us and had leftovers--I think this would have been perfect for three hungry people, or expect to bring food home. I found myself talking about this place for a few weeks after I went and have already recommended it to friends. Be prepared to talk loudly--it's got a bit of a clubby scene, and there's only one bathroom, if that matters to you. Anyway, it's great and I'll be back again soon!", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "It had been a long day of being on my feet when I decided to rest by popping into Foxsister. I didn't know what to expect as I'm fairly new to the city and hadn't been to this part of town before so I went in with no expectations. Upon entering I was greeted by an ethereal goddess of a woman. She had short, bleached hair and an eyebrow piercing that highlighted her strong brows and stunning ice blue eyes. Suddenly, I was hungry for more than the  Korean food I could smell coming from the kitchen. She sat me at the bar and I couldn't take my eyes off her the entire time I ate my spicy octopus rice cakes. I will hopefully return soon with enough guts to order her octopus cakes.", "author": "Noah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "They have makgeolli! We fell in love with that stuff in Korea. It's kind of like carbonated unfiltered sake. We shared a bottle and a Hite beer. The decor is so kitschy and awesome. The mural outside is punchy and gorgeous, and all the little decor elements inside make it feel funky and fun. The menu is hard to read - we almost couldn't find the fried chicken because it's in a different color than the rest of the items. The drink menu had a ton of great beer (some Asian brands and some local craft stuff) and soju slushies - it might be one of my favorite drink menus ever. The banchan were all wonderful - must order to go with everything else. Korean Fried Chicken was great - the sweet and spicy sauce was perfect with a citrusy note that made them addictive. The order of fried oysters was large (probably 10-12 oysters) and the breading was phenomenal. We got talked into the yuba bulgogi by the server but I wish we had ordered the crab noodles like we originally wanted. I think if served with rice the yuba bulgogi would be good but it didn't really work as a wrap. Service was fast and friendly. We will definitely be back - I want to try the crab noodles and kimchi nacho cheese dip! One small drawback is that it's pretty expensive - but Korean fusion in SF tends to be pricey. Luckily the delicious food and awesome atmosphere make it worth the $$.", "author": "Tanya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "This is one of the best restaurants I've been to in a long time! We had fried oysters, tofu kimchi dumplings, pork dumplings, crab glass noodles, fried chicken, ribs and pork bulgogi. Every single dish was delicious!! I loved the ambiance, dark walls, dim lighting and great music. This will definitely be a regular spot for me!", "author": "Jen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Holy moly! So happy to have them in the neighborhood. Innovative, modern and hip. The Yuba bulgogi blew my mind.", "author": "Tatiana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "This place is truly amazing. It may be the most unique restaurant in the city. The design is rad, they call it \"trash glam\" and the term totally fits!  The food is both casual yet there is a sense that the ingredients are of a higher caliber than at typical Korean restaurants and the cooks in the kitchen are clearly professionals. This may be the perfect mission district restaurant!", "author": "DG G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-04", "description": "worst korean food experience i've ever had. we got the banchan (probably the best thing out of everything we got), oxtail in marrow broth (the meat was tender and good), grilled kalbi short rib (came nearly 50 minutes after everything else because of a kitchen delay; was mediocre to say the least), and some fried chicken which was well cooked but bland as a banana. now this may seem like an ok review, but i had diarrhea 20 minutes after we left the restaurant. maybe they had an off day but i'm never going back. the service was not outstanding either, the waitress just never bothered to update us on the main course delay. 2/10 rating for the whole experience.", "author": "Brenda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "While we waited for a bit for our table even though we had a reservation, it was well worth the wait! The ambience is loud with some bass thumping hip hop which I loved. We enjoyed the salad they had on the menu, the dungeoness crab noodles and a rack of ribs and everything was really delicious! Definitely will be back, the service was outstanding!", "author": "Lia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Delicious and celiac safe! Really nice to have multiple options to pick from that are gluten free. And there are tasty options with gluten for non celiacs too.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Great fun and hip spot. Excellent for a drink and some ribs. Great vibe, cool place to bring any non sf peeps to feel some city energy. Also great place to catch a game and a beer. It's busy on a Friday or sat so check it out on an off night to really stretch out and chat up the bar tender!", "author": "Gabriel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "This place rules! Man, I read some of the 2-3 star reviews and the you guys are cray! $8 for 6 banchan isn't a bad deal. I could tell they use the best ingredients (unlike regular K BBq) kimchi was on point, delicious chewy squid jerky, kimchi cucumber, sweet potato salad, soy mushrooms (my favorites) and pickled soy bean sprouts. The decor was fresh! Sparking purple bar, awesome wheat paste art, killer punkrock play list, and super helpful excellent service. Good beer and wine selection. I had a glass of Lambrusco and it was thee best I've ever had. We had the octopus rice cakes which were excellent, then we had the kimchi stew which had these delicious little chunks of pork belly. We also had the ribs that just fell off the bone, a little sweet and a little spicy. The Kalbi short ribs and pork Bulgolgi were served with lettuce wraps and were definitely the star of the show.  Everything was seasoned perfectly. It cost about $50 a person which if you've ever gone out to eat in SF ain't that expensive. I usually don't Yelp much but after reading some of these ridiculous low star reviews I was compelled to set the record straight. This place is a Newley discovered gem and I highly recommend it.", "author": "John R."}
