{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Absolutely amazing. The ramen was perfection. Went with the family and everything was good and having the waitlist option is amazing because you know when you will be up. I had the spicy miso ramen and I wanted more and more. \n\nHot sake was delicious and we also ordered the chicken teriyaki, and salmon teriyaki. Yummy yummy! Can't wait to go back.", "author": "Alex A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-18", "description": "Not really Japanese. I am used to Non-Japanese owned Japanese restaurant by now but I really did not like their mediocre ramen (Don't ask me why but I visited Fumi for 3 times). I am almost sure it is not 100% house made (probably they use / add pre-made soup base). Their Curry is OK especially with the Katsu, but nor really worth the visit.   \n\nFumi - please use correct Japanese on your menu. I will help you if you like.", "author": "Chie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "Fumi is a great affordable place to have a quick Japanese dinner with friends or a significant other. The lighting is dim with a cozy ambiance. \n\nThe menu has lots of options. We got the Chicken Katsu with Spicy Curry, Shrimp Tempura with Spicy Curry and the Chicken Teriyaki. The curry dishes all come with lots of curry and not enough rice/protein. Definitely order more rice or an extra side of protein with your order because the plates are large and swimming in curry. In addition, each order comes with a side of salad. \n\nThe Katsu is fried nicely and does not give off that frozen chicken taste. The tempura was nothing special so I would not recommend ordering that with a curry dish. The Chicken Teriyaki was fresh and also not frozen. It was juicy and not dry.", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-02", "description": "I was craving curry and my friend was craving ramen so we decided to give Fumi another try. After looking at the menu, I decided to get the teppan chicken katsu curry and my friend got the spicy miso pork belly ramen. \n\nThe food came out super fast! The curry came out on a sizzling plate consisting of a thin layer of egg, topped with rice, topped with the chicken katsu on top, then the waitress pours some curry on top. This dish was alright, I've had better curry elsewhere, but the chicken was the star of the dish! It was very tender and fried perfectly! The ramen was okay as well. Nothing too special imo. \n\nOverall this place was alright, I would go again if I was in the area, but not trek all the way to the mission for this.", "author": "Stacey Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-03", "description": "I've been to Fumi a couple of times now. On my most recent visit, I came on a Sunday afternoon and was able to get a table right away. My friend ordered the Chicken Katsu Teppan Curry and I ordered the Spicy Miso Pork Belly Ramen.\n\nThe Spicy Miso Pork Belly Ramen was decent. The broth had a little kick to it and the pork belly was alright. I did wish there were a little more noodles though. Nothing too memorable but if you are craving ramen, the ramen here might hit the spot. \n\nThe Chicken Katsu Teppan Curry was also decent. The katsu was crispy but it did get soggy pretty fast. The curry flavor was good, but nothing that special to me. I did like the presentation though. The katsu came with rice and eggs and the server poured the curry around the hot teppan when the dish arrived. \n\nOverall an okay spot to grab a bite to eat if you are in the area.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "The curry was decent here, not the best or the most interesting, but it was a really enjoyable experience cause of how it looked on the plate.\n\nI got the grill plate thing they were doing for the tonkatsu curry rice, and overall the dish was pretty good. The curry itself wasn't anything special, it tasted about the same quality as what you would get from a curry box, so I don't give it many points there.\n\nBut by putting onto the grill (with the egg around it), it kept the curry reasonable warm, and everything else on the place was done quite well that overall the dish was enjoyable, especially given that I'm in San Francisco and the options are limited.\n\nThey do have quite a few vegan options, my friend got one made of gobo and liked it.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Came here on a Friday evening with 3 other friends. We ordered the tako octopus balls and chicken karaage for\nAppetizers. They were both delicious.  I've never seen the tako balls on \nThe menu so had to order. We also had two large bottles of beer. Their prices for beer and sake is really reasonable!  I ordered the fish katsu teppan curry with egg. I loved how they poured my spicy curry on the platter and my plate just sizzled!  And spicy curry is not too spicy. The waitress said it was really medium. The rice Actually got a crispy crust on the bottom. It was yummy. My husband ordered the hamburger teppan curry.  The Hamburger wasn't as good as my fish. My friend got the tonkatsu broth ramen with chicken Katsu. She enjoyed her dish a lot and also added on pork belly. \n\nTIP:  for dessert we opted to walk over to Mitchell's for ice cream.", "author": "Donna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Third time here, and I've been very happy with my experience each time! Whenever I come here with my boyfriend, it's usually never crowded. We're able to be seated right away. The atmosphere is very modern. The only complaint I have is that the tables are really close together so you don't get too much privacy, but it doesn't bother me too too much.\n\nI've gotten the teppan chicken katsu curry, the tender chicken curry rice, and their ramen and you really can't go wrong with any of these! I usually get the regular spicy for curry and it's not spicy at all, so don't worry if you're a spice wimp like me. The curry is always really comforting and hits the spot. I make my own ramen bowl with the tonkatsu broth and chasu. The broth is very light, not too heavy like some other ramen places I've been to, so I never feel too heavy and weighed down after finishing my bowl. \n\nOverall, I'd definitely recommend this place if you're craving some bomb Japanese food! I'm excited to come back and try their omurice next!", "author": "Amberly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Nice Japanese style restaurant to have a hearty bowl of delicious ramen or a crispy pork cutlet in a thick curry sauce. The ramen noodles were nice and tender, and the broth flavorful. I loved the fresh ingredients including veggies, bamboo shoots, and half an egg. My friend enjoyed her pork cutlet. Next time I'll come back to order the pork cutlet. Also, great customer service!", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "Was in the mood for ramen and Fumi was open and could do takeout.\nLocated right on 29th. The inside decor was sparse but ok, see pictures. There is seating inside.\n\nThe menu has plenty of options, and even within categories like ramen there are many to choose from.\n\nThe person that took the order was very patient and friendly. \n\nI order some gyoza $7, edamame $5, chicken teriyaki, $12.50 and 4 ramen dishes, including chicken, chicken katsu, pork katsu, and pork chashu each about $12.50. total about $80 and fed 6 easily with some leftover.\n\nThe edamame was just like edamame ordered anywhere else, good, but nothing memorable. I didn't try the gyoza but everyone else liked them. \n\nThe chicken katsu ramen and chicken ramen were good, nice flavor, I like the toppings with green onions, corn, etc. but the ramen and pork broth were just ok, but not bad. They were prepared ok but nothing spectacular.\n\nThe chicken teriyaki was ok, tasted nice, but just like chicken teriyaki you could get anywhere else.\n\nThe food was fine, helpful cashier, so 3 stars.", "author": "Keith A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "Dish: Pork Katsu Teppan Curry\nCost: $13.50\nDish Rating: 4.25/5\nReview: I love Japanese curry  I've only had a handful of Japanese curry spots in SF and I must say I was surprised by this spot. The curry is good, but the pork katsu stayed consistently crispy even after the sauce was on it for so long! Normally it gets soggy at other places so quickly but this pork katsu held its own well  I wish it was a little more moist and tender tho. The curry itself usually tastes the same to me everywhere I go (if they're good) so this one didn't really differ too much from other good spots. This came on a sizzling platter which was cool! It's a little out of the way for me to travel to, but if I'm ever in the area I'll definitely come back! They have so many things on the menu I wanted to try! (Ramennnnn!) Came here on a Wednesday night around 5:30pm and there was no wait  we were there for 2 hours and during that time a lot of diners came in, but no wait. Parking isn't too difficult around this area as well.", "author": "Valerie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "I came here on a Hinge date so I didn't take any pictures but I wish I did! \n\nWhen you get to Fumi go straight to the pad on the wall on the right side across from the bar and check-in! There's most likely a line and the line may include people waiting in the back (there's a back room.)\n\nAll regular ramen bowls come with bean sprouts, bamboo shoots, kikurage mushrooms, sweet corn, spinach, and green onion. \n\nThe teppan curry ramen dishes came with different toppings according to which dish it was. I tried the chashu teppan curry ramen because I hadn't seen it at most ramen places in the Bay Area, but was also eyeing the chicken curry ramen. It came with roasted pork (yum! Not too fatty, which I like), bean sprouts, sweet corn, bamboo shoots, and an onion sunny-side egg. \n\nThe egg was delicious! Very runny. The broth was rich and warm, and noodles were just the right amount of chewy. \n\nIt was a good-sized portion for $14.95. I didn't finish the bowl and I was hungry from waiting to be seated for so long! (It was probably over half an hour, but it was after 8 soooo.) \n\nMy date gets the same meal each time he goes to Fumi: seafood with black curry omurice (Japanese omelette with curry and fried rice inside.) I tried some and it was really good, but beware--the black curry will stain your teeth! \n\nFumi also has lots of tea drinks, like crazy macha milk tea, sexy strawberry milk tea, creamy taro milk tea, beautiful Thai milk tea, and love fumi milk tea (you can add boba to all of them!) but I'm not a fan of having to pay $1 for hot brown rice tea. I think it should be included! \n\nThey have a pretty good dessert menu including green tea cheesecake, mango mousse, tiramisu, Mochi, and regular ice cream. \n\nIf you're in the Mission, check out Fumi for top-notch ramen and curry plates!", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "I am usually not a huge curry fan, but I was surprised to have really enjoyed my experience at Fumi! The restaurant is very small and can be easily overlooked. We came on a Friday night at around 7pm and we were luckily able to get a seat without waiting. \n\nI decided on their fish katsu teppanyaki, which came on a hot stone plate with a side of curry. I chose to add spice, which ended up not being spicy at all for those who enjoy spicy food. The plate came to the table boiling and hot, and the waitress poured the curry on top. It came with a ring of egg as well, and they gave a generous portion of katsu. I really enjoyed the fish katsu! It was very moist and the flaky crisp of the fish was perfectly fried. I also liked the griddles rice from the hot stone pot, which really elevated the whole dish to a new level. \n\nOverall, I would definitely recommend this place. I would probably come back next time to try the soft shell crab shoyu ramen.", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "From the exterior to the interior and the menu, Fumi gives me a good first impression of how modest this dining place is!  \n\nIt is not too busy here on a weekday during lunch hour, we got seated right away and food was being served less than 15 mins after the order was taken.  We ordered a chashu teppan curry and a Katsu curry.  Generous portion. Quality curry with good looooking!  I guess this is all I look for in this place :) \n\nVery satisfied and I believe I will be back!\n\nPro: One of the highlights is their menu, which is very cartoony and easy to comprehend! I like it a lot! \n\nCon: Spent a while to look for parking! If you don't mind walking for a couple blocks than paying for meters, you may park at the residential areas :)", "author": "Shuyi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-11", "description": "We went there on a Sunday afternoon. There was no line. And super easy to find a street parking.  The pork curry was definitely better than the soft crab ramen. The katsu was perfectly cooked. \nCompare my soft crab ramen photo to other photos. Yep.. missing my fav woodear mushrooms. If they didn't forget the mushrooms, I would have given a four star.  Make sure to check your bowl.", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "The food here was good, buuuut....\nService absolutely matters to me.  Hence the 3 star rating. \n\nI came as a party of four and was third to last from ordering. I ordered the tonkatsu broth with chasu inside and my bf who ordered after me asked for the same. Okay, all is fine and well. Servers leaves, we catch up with our friends. \n\n\nWhen 2/4 bowls of ramen arrive..another server tried to give us the tan tan men. We politely declined and said that wasn't what we ordered. The lady left and we thought the situation was handled.  The first lady who took our order down then comes back to our table with the same ramen and says that was what we ordered. I again tell her I ordered tonkatsu with chasu and my bf also agrees that was what he ordered as well. She leaves and I think they'll just correct the order but NO. This lady comes back to our table again and brings her notepad telling us we ordered the tan tan men. She was already super aggressive the first time but this time she basically told me what I ordered. My other two friends also jumped in to say we all heard us order TONKATSU. Come on, lady! It was poor customer service and she was so aggressive in handling us. \n\nWhen our food came, I'll admit that it was pretty good...but sadly the experience left a bad taste in my mouth already.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Easily one of my new favorite restaurants! My friend brought me here finally, after raving about this for months. It's one of her favorite places to eat and now I understand why.\n\nI ordered the shrimp tempan curry dish, and it comes out piping hot on a pan. When the server pours the curry (you can ask her for a specific level of spice) over the egg, it starts sizzling. The curry is a tad bit sweet, and spice is concentrated on the bottom, so mix! But as your food sits on the plate, the egg and rice becomes crispy, and stays hot. Yum!!! And the shrimps are battered in panko (not tempura), but crispy to perfection. I'd definitely come back and order again. \n\nAlso! They have \"every green\" and vegetarian options on almost all dishes, so options for folks! They have ramen, sushi, and curry for all my friends who wants a place with a variety of food.", "author": "Melody W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "My favorite local ramen place.  Service is friendly and quick.  I love their ramen but also love the sizzling curry dishes.  Great atmosphere with a great mix of clientele", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Such a cute little restaurant with delicious food! They used to serve more food here but now they only focus on ramen and curry. \n\nI ordered the tongkotsu ramen with chashu pork, and it was very delicious. My girlfriend ordered the chicken katsu with curry and she loved it as well. I would recommend both. \n\nThe shop itself was small with a few tables and a bar, in which you could choose where to sit. I would definitely come back here again now that I live here (:", "author": "Phi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "It was 11am and like always, nothing went according to plan. We arrived at the \"planned\" restaurant and realized they were not open til 5:30pm, silly me. \n\nWe were all hangary and frantically looked up this place. Walked in and noticed this guy eating curry over rice! Oh WOW it looked delicious! The entire table ordered chicken katsu, how unoriginal right? But, we all loved it!\n\nFor the spice level, mild does not have much of a kick to it. I suggest going one up on spice! Service was alright, they seem to have only one waitress on a Sat morning waiting tables and taking phone orders.", "author": "Shirley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "The curry here is outstanding- whether ramen or rice plate... DAMN. My partner said it's the best Japanese ramen he's had. I thought it was delicious I'll definitely be coming back!!", "author": "Nas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "I always wanted to go here when I lived here, but never had the chance. Now that I'm here visiting and staying at an Airbnb close by I got it delivered! The food got to me 20 mins later than expected through GrubHub, but it was piping hot so therefore I cannot complain.\n\nI got the Pork Katsu Curry extra spicy...\n- The pork was juicy and not fatty, perfectly crispy\n- Huge portion of rice\n- Large portion of salad\n- Curry was sent in a separate container (thank goodness) and it was hot with the right kick, but it could be spicier. I would also say the portion of curry is much more than Volcano or Muracci's, so I was thoroughly impressed!\n\nThat meal gave me dinner and lunch so be ready for big portions. I'll be back again and hope to update this review with an in-person experience. Overall the food was awesome and highly recommend for delivery!", "author": "Jackie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Ordered the vegetarian curry ramen, added side of garlic topping.\n\nThe veggie curry was pretty intense and quite flavorful, certainly tasty. It became kind of a lot of the same intense curry-ness after a while of eating though. The ramen noodles were just absolutely cooked perfectly, and had that nice chew. Oh, I was disappointed that the side of garlic was the roasted, almost burnt garlic, I was expecting fresh garlic. :/ \n\n\nI would probably go back to order the veggie meat tempura curry thing next time, that looked good, cuz I love the fake meat soy stuff. I might order the veggie curry noodles again.", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Ordered:\n\nPotato Croquet\nVeg Tempura\nTeppan Curry Ramen (ever green) \n\nAll Vegetarian. The food was great and enjoyed every bite. \n\nWill visit again to try their Soup Ramen.", "author": "Prateek R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "Wow. Feedmi some Fumi. \n\nTheir chicken teppan curry was pretty good but also familiar. Reminded me of the japanese curry at Volcano in richmond. However, unlike Volcano, the rice/curry is served in a moat of egg and there were no veggies. The meats were alright and nothing special but there was a fair amount in proportion to the rice served. Speaking of, the bottom of the rice becomes crispy towards the end and that was probably the best part of this whole ordeal besides the sizzling curry. \n\nI'm excited to try their noodles next time--looks very filling. The spicy sauce condiment on the table is probably what they use to spice their noodles so use that to adjust if you want more spice level!\n\nOther tidbits: parking in this area is hard to find as the street has mostly bars, service was good, was seated immediately at 9pm on a saturday, and the takoyaki balls were kind of small.", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Great service, great variety of dishes, Especially the only mushroom Ramen I have heard of.\nLiked the chicken karrage & edamame but especially the hamachi carpaccio! I usually order this as an appetizer and share it because it's not enough as a meal.", "author": "Elpie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "I ordered from grubhub again and they were fast.  Mainly I wanted boba drinks, but I wanted some good quality snacks or food.  They still have great ramen soups. I ordered their Chashu Ramen with an added pork belly. They separate their sooo tasty still hot broth from the bowl of noodles, veggies, meat.  Once you combine them, they are a great fresh combination from the bamboo shoots to the half boiled egg to the meat & noodles.  Their taro boba, matcha latte(iced), and thai boba drinks are all great.  Their chashu ramen at $16 (since I ordered the pork belly adding $3 to it) was pricey, but well-deserved for such well prepared, tasty, fresh food.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-28", "description": "My husband and two other friends decided to try this place out after seeing a few other friends go to this place. It is a very small restaurant in the Mission. We were seated right away on a weekend but it varies on what time you arrive you may have to wait. For starters we ordered the Kakuni, garlic broccoli, fried squid legs and soft shell crab. The broccoli was made simple pretty much cooked in garlic with I believe sesame oil so really couldn't go wrong with a veggie dish but not sure how I feel paying $6 for a small plate of it. The Kakuni was alright as well, it was basically pork belly in soy sauce I wasn't too excited about it. I liked the fried squid legs, it was not too chewy or fishy tasting. The soft shell crab was too battered or fried so it was not to my liking. For our entrees we each ordered a teppan with curry as follows: steak rep-an, hamburger teppan, pork teppan and ground pro teppan ramen. The food came out pretty quick considering the waiter told us that the kitchen was a bit behind. All curries came out on a hot sizzling pan and you pour the curry onto it. I thought the curry was alright, I asked for mild spicy, while everyone else had ordered spicy and it was not as spicy as they thought.  Each teppan, came with an egg as well. All in all I thought the food was ok, I was not too excited about the curry even though its pretty popular here. I want to say service was great, I would recommend to try it at least once if you like it great if not, move on. For the most part parking is hard on the mission so come a time you think its not as busy , since there are many other surround restraints in the area.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Had a craving for some ramen and Fumi hit the spot. I had the Chicken Katsu ramen with the pork broth. The Katsu came on the side and the ramen came with bean sprouts, bamboo and corn. For an extra $2 I added two slices of chasu (pork). Omgeee so savory and flavorful. Hubby had the seafood ramen and it came packed with fish, mussels and clams. We ordered take out and the ramen, broth and Katsu were packed separately.", "author": "Mai N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "YOU MUST go for the teppan curry over the orginal curry plate!  There's a miles difference.\n\nProceeding onto the pork katsu teppan curry.\n\nThe sizzling cast iron plate brings out the flavor of the curry and enriches it.  There's definitely something soothing about eating food that's hot and ready.  I was delighted to find that the heat produced a beautifully crisp bottom layer of rice!  Cooking around the rice, you'll find a light fluffy layer of egg to pair each bite with.\n\nI substituted for the black curry because why not?  I was curious how it tasted.  The color black comes from the infusion of squid ink btw.  So don't worry, it's not poison (:  I enjoyed the multiple spices of the sauce that gave it a nice kick.  Extra spicy wasn't too bad but beware of their homemade spice on the table, it's pretty intense !\n\nThe pork katsu was nicely breaded and tender.   I was heavily on the edge about ordering the hamburger but thankfully my friend did instead.  It's unique because they use a mixture of ground beef AND pork.  I took a bite from my friend's and wow.  The meat is so soft you could probably eat it if you had no teeth.\n\nService was exceptional!  The weather and food was blazing hot yet the waitress never failed to continue quenching our thirst.  She probably served at least 5 rounds of water to my party of 11 #madprops", "author": "Derek L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "I love the curry here very much !! Friendly service! Clean restaurant!!! Absolutely delicious curry ! The best curry in San Francisco!! I had try the chashu teppan ramen ! The new teppan ramen on the menu also they have omurice !! Absolutely going next time !!", "author": "Agnes S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "DON'T BOTHER PUTTING YOUR NAME ON THE WAITLIST REMOTELY!  The live waitlist showed a 14-24 minute wait and we got there in 10 minutes.  The RUDE Chinese waitress said we already missed our call and would have to wait.  After asking how much longer, she said 10-15 minutes.  She then proceeded to seat two other tables in that time span and ignored us.  When I asked her again, she was only interested in knowing if we were leaving and didn't bother telling us she had a table leaving and that we'd be seated in a second.  WE LEFT WITHOUT EATING.  NOT WORTH THE WAIT - especially when they had a whole empty back section that they apparently didn't staff!", "author": "Bea Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "More of a 3.5 stars for me. Got lured in by their teppan curry from the pictures I saw on yelp. Came with my bf and we ordered the chicken katsu teppan curry and fried chicken teppan curry. \n\nThe chicken for both was just eh-dible. We did enjoy the curry, but I just wished the curry was a little more rich. My favorite part of the teppan curry experience was the egg, and of course it's on a teppan. Love how you get the sizzling crispy rice after. \nBe careful as it is super hot. I ended up burning my tongue because I was too inpatient.\n\nOverall, I love the concept, but the food didn't wow me. Might come back to try their ramen if I'm ever in the area. Too bad parking can be hard to find.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-20", "description": "I've eaten here twice for lunch.  First time I had the curry hamburger teppan rice.  Something was lacking, best part was the egg (on the bottom).  The pickles on the table helped a lot, I ate most of the jar!  Service was good, water glass always filled.  Second time, I had the tonkatsu ramen, broth was too salty.  Ramen had nice chew, chasu was tender and nicely flavored.  Service (different server) was so so, didn't check on us.  Was told their credit card machine not working and asked to pay cash.  Wiped out my wallet.", "author": "R K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "We were in San Francisco for an appointment and it was time for lunch, we wandered around and wanted to go to the Peruvian restaurant but it did not open until 11:30. The time was 11:00 and we were very hungry. We looked on Yelp for an alternative restaurant, we saw Fumi Japanese Curry and Ramen!!! And it's open!!! We quickly walked there, and we were overwhelmed by the delicious smells inside!!!!! \n\nThe menu has great selections!!! I chose Ramen with Curry Broth, with broccoli, gobo, and deep fried tofu. My fiancé ordered Salad, Karaage, Tempura. First to come out was a huge, beautifully arranged salad. We gobbled it up!!!! When my Ramen arrived my eyes and nose were very happy!!! The broth was savory and Curry-ee!!! It was delicious!!!!! Great amount of toppings too!!! This was so yummy, I was actually very quiet!!! I was totally into this Ramen!!!!!! I will definitely be back to try more items on their menu!!!!!!", "author": "Kitty-Chan I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "Food was pretty good. Order ramen and I guess they were close because the broth was still hot. Curry flavors we're good. We had take out so I imagine eating here would be even better. Fast, delicious, and decent portions.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "A gem\n\nPork Katsu Teppan Curry!!!!!!!\n- let me preface that I've never really been a fan of Japanese curry,  having grown up with the more flavorful Thai and Indian curries,  but this curry was tasty on point!  I got it spicy,  but it gave a perfect amount of flavor,  savory,  a little tangy. It sizzles so nicely when poured on the iron plate and with no splatter at all!  The Katsu was perfectly crispy with a light layer of panko, great execution!  The egg layer around the rice was nice,  especially since it was separated from Katsu.  I've been unsatisfied with Katsu don before when the egg makes the Katsu soggy.  \n\nSeafood curry ramen\n-hella good as well and the noodles were good bouncy consistency! I felt like it was perfect recovery fluid for my friend who had a cold at the time\n\nService was friendly,  and thorough\n\nAtmosphere was intimate,  as we were seated at the bar\n\nWould definitely come here on a cold day next time!", "author": "Tina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "My friend invited me here and I was a little skeptical. First off, I've been to many ramen joints and the broth is either too salty, too bland, or too \"porky\" (if that makes sense? lol). Additionally, I didn't wanna smell like curry when we go grab some dessert afterwards.But hey...I was looking for an adventure and I didn't mind trying something new.\n\nBoy, was I glad thst we tried it out. Appetizers were a hit or miss. Like the salad were ok. Tempura was good but nothing out of the ordinary. And the takoyaki were simple and prepared as they should be. Bottomline...the appetizers were ok.\n\nAs for the ramen........omg..............I didn't stop talking about how delicious it was. Bite after bite, I told my friend: This is realllllllyyyyy good. It was getting quite embarrassing as I couldn't stop saying it lol. I LOVE THE SOFT SHELL CRAB RAMEN!!!!! Please get it with the toasted garlic oil...it's worth the extra $1! So aromatic & so flavorful! Best ramen I've ever had!\n\nMy friend ordered the chicken katsu curry on a sizzling plate. It was a huge portion and was delcious as well! We kinda wished though that the server allowed us to pour how much sauce we wanted on the chicken. Make sure you request that to control how much sauce is placed on your entree.\n\nVerdict? I will come back. In fact, it's 80 degrees today in SF but wouldn't mind going there tonight for dinner. It's THAT GOOD....trust me:)", "author": "Ralph N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Came here on a Saturday around lunch and surprisingly not that packed. The curry is phenomenal and has a really nice heat to it. We ordered the shrimp tempura curry rice and the teppan chicken katsu curry rice. The teppan is totally worth it because the hot plate adds a really nice crisp to the egg which gives a nice crunchy texture! Definitely don't miss out in that. \n\nParking wasn't too hard to find because there are a lot of meters but there is a Safeway not too far so if you wanna buy something there and swing by after that works too.\n\nI added pictures of the menu in case people are interested!", "author": "Augustus Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-29", "description": "Just barely okay. Packaged noodles. Undercooked chashu. Very weak and thin (and salty!) \"tonkatsu\" broth. Very small portions. And very antagonistic proprietors. We (and another table) asked about their \"black curry\". They were unwilling to let anyone try it first. I asked for a common ramen condiment and they said they weren't sure they had it but never came back.  There are far better choices in town.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "This is a great place to get your curry craving. Don't let the size of the shop fool you they actually have more tables in the back! Very cute and down to earth feel. I never had to wait for a table for the times I came. The waitresses are attentive and comes by so often to refill water.\n\nI tried their Black Curry with Soft Shell Crab. It was delicious. The squid ink is just for aesethic if you want to take photos, but it DOES NOT affect with the taste. People might think it does only because your brain psychologically think so! I got their Katsu Teppan Curry too and that was great as well! Everything was seasoned well. I love the crispness of my sizzling egg. Their karagae is juices and crispy. They are great at frying their meats for sure ;)", "author": "Grace Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "It feels like places usually specialize in curry or ramen, but not both.  The curry was the clear proficiency here while the ramen was a kind of middle-of-the-road.  Definitely a unique find in a neighborhood filled with Latin American options.\n\nTakoyaki: Tasty appetizer.  Like a doughy Munchkin® with octopus inside.  Great variety of texture and flavors.  \n\nTonkotsu Ramen: A little disappointing.  It looked the cloudy white part but didn't have anywhere near the richness of Ippudo.  Also, found the noodles to be a bit too big and chewy.  It'd be fine as a bowl of ramen where they don't really name the broth, but it is a letdown for the tonkotsu label.\n\nChicken Katsu: Perfectly crispy all around.  Thinly pounded meat to maximize fried surface area while still remaining moist.\n\nSpicy Curry Sauce: I paid $4 extra for this side just so I could soak up my chicken katsu in this delicious sauce.  It seriously gives Marucci's a run for the money.  I was literally spooning it like soup, so good!", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "3.5 stars\n\nGet the pork katsu teppan curry over the other curry plates for the pour over curry visual and sizzling sound effects. It looks and sounds so amazing, you'll be drooling. \n\nLet's talk portions. My friend's regular beef curry was sparse in meat, and after he saw my sizzling plate presentation, I knew he instantly regretted his choice. His beef curry dish looked lonely compared to my mound of pork katsu. I shared mine with him of course :) \n\nOverall, I liked my dish. Don't eat too fast, because I burned the top of my mouth (my bad for my impatience). The egg and pork katsu combo was delicious, but I felt that the meat could be more tender. \n\nCard is accepted for transactions $10 or more. Service was great, and I would come back if the craving hits.", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Go to comfort food! I always get the hamburger sizzling plate (if you get the curry- make sure its teppan- that is a must!). Good amount of curry- sizzling hot- love the egg on the plate and the rice as it sizzles and gets crunchy over time. Only wish the patty was thicker- a little too thin in my opinion. Never tried the ramen- maybe one day. Yea- service is not the best, and there are Chinese workers? But curry is so good, I don't care!", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "With every bite, all I could say was.. \"SOOOO GOOD.\" We waited about 30 minutes since it was table for 5. Any parties larger then 4, will be seated in the back and theres very limited seating, even more limited then the front. We had parties of 2s,3s, and 4s get seated before us. The wait is worth it but it's better to go in 2's. \n\nI tried the chicken katsu teppan curry and was blow away how delicious it was. Better believe that I ate the WHOLE thing.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Came here and ordered the chicken katsu curry. The dish was fresh and crispy, being just the right texture for katsu. There was also a good amount of curry that went with the rice so that you don't have an overbearingly amount of curry left. Definitely would recommend based on the taste and portion size and freshness of the katsu.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "My favorite is their Curry Beef Patty sizzling plate! Just the right and generous size of the beef patty, rice, egg, and curry gravy is perfection! I like how you can adjust the level of spicy from low, medium to HIGH! I always order medium just to be in the safe zone. \n\nI come here quite often and have also tried their ramen. Their pork belly ramen simply just melts in your mouth like butter. \n\nService is splendid, everyone is kind. Overall, marking this as one of my go-to places for brunch and dinner.", "author": "Johanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "Everybody's saying to get the teppan curry but I didn't.. because I'm a rebel or something. I had the squid ink black curry with chicken katsu and my friend had a make-your-own ramen. The portions for both were good with both of us leaving bloated. \n\nThe curry was good - though I'm not sure what the point of the squid ink is. It tasted the exact same as normal curry so the additional $2.50 was a bit of a hit for me. The menu had a great selection of entrées that I wanted to try them all. Service was prompt and patient.", "author": "Myles C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-21", "description": "Surprised I'm writing a lackluster review because the ratings are high, but my family and I weren't fans of the food.\n\nWe ordered simple chicken teriyaki dishes (the kids like simple) and the dish was dry and overly salted. \n\nWould have been nice to have a little teriyaki sauce on the side to take away the salt and add moisture.\n\nHad a few bites and then discarded. :(", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Got the teppan pork curry (spicy version) and takoyaki.\n\nTakoyaki. stay away from. Not much flavor on the outside, expected more of the dashi flavor, less dough, and A LOT more octopus. Overall, just let me down. It also had square bottoms. Who does that?!?!\n\nTeppan pork curry. That's where it's at. It's on a stone plate that's sizzling hot and there's a layer of rice in the middle and egg on the outskirts. Then the meat is placed on top of the rice. There's some curry they pour around the meat so that the pork katsu isn't drenched and is still crunchy (but there's a container that has curry sauce on the side). Some of the rice is extra crispy since it's on the stone and that was a nice touch. Definitely a very enjoyable experience and I would opt for this over the other curries.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "It's really a good place to have lunch!\nGood quality!\nAnd fast speed!\nThe waitress came to me right after i walked in. \nI ordered the kare kastu...... it came out in about 10mins and I can feel kastu was really fresh! And it taste good!\n\nDefinitely come next time!", "author": "Yantong Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "My favorite vegetarian ramen!! The curry broth is so amazing. I always RAVE about this place to everyone", "author": "AnaMaria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-12", "description": "Fun idea to make the curry teppanyaki style. Get that camera ready as the waiter pours the sauce and the curry sizzles in your face. Unfortunately the chicken katsu was nothing amazing. I think the hot plate added a slight burnt flavor to the sauce, which I didn't prefer.\n\nYou can blacken your curry for $2.50 but I wouldn't recommend it. It tastes the same and all you'll get is black teeth.", "author": "Vans C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Came here on a weekday night around 6pm with le bf. We were seated right away in the area near the front of the restaurant. If the front looks full, there is also a back area where people were seated, so don't be discouraged right away if you see the front full. \n\nWe ordered:\n1. Soft shell crab appetizer ($12)\n2. Mild Pork Katsu Teppan Curry ($13.50)\n3. Spicy Chicken Katsu Teppan Curry ($13.50)\n\nThe soft shell crab appetizer came out very quickly. It came out hot and crunchy, just the way we like it. Though a bit pricey, we would both order it again. \n\nI ordered the pork katsu teppan curry and asked the lady who brought it to our table to not pour the curry, I wanted to do it myself. The portion was sizable, and I was shocked at how large the actual pork katsu was. Normally, at other restaurants, the pork katsu portion is very small. I thoroughly enjoyed my teppan curry. I also really loved how there was a mini jar of pickled daikon (?) at the table. I nearly finished the jar at our table. \n\nThis was the second time that le bf has visited this restaurant. He knew exactly what he wanted and said that his spicy chicken katsu teppan curry came out perfectly, and exactly like the last time.\n\nOverall, this place offers up some very tasty curry at a very reasonable price. The staff was also super friendly and attentive. We will definitely be coming back. They also served ramen which looked really good when we saw other tables ordering it. We may give the ramen a try next time.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Fumi is a total gem in the otherwise dull collection average restaurants in this part of the Mission. Come here for the curry and appetizers at lunch and the sashimi for dinner. Ramen is good, definitely better than its neighbor Coco, but I would say not my first choice when thinking of other options in the Bay Area.\n\nTheir teppan curry is excellent. Food comes out sizzling hot and when the curry is poured on your plate, it combines with the egg and rice in a way that really helps the entire dish become flavorful.\n\nSashimi tasted buttery and prepared correctly. Plus the portions for the amount you pay is quite fantastic in my option, especially for being right in SF.\n\nAlso to the staff and owner: the lady who works during your lunch service is lovely. I rarely feel like commenting on service is necessary in a yelp review, but she's always so sweet and attentive. It always encourages me to come during the lunch service specifically.", "author": "Nikki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "This place isnt super gourmet, but it's the definition of comfort food for an Asian palette. They specialize in curries, ramen, teriyaki etc. I have to especially recommend the curry ramen, with your choice if protein. Gosh. Its the yummiest thing you can eat: its just full of an absurd amount of goodies. In fact I usually get the vegan version (every green) and its full of so many toppings, and a rich curry broth, that I don't even need the soft boiled egg that I usually get. If you can't handle spice, you can relax, Japanese style curry is super mild, its just very flavorful. For people like me who love spice, they have a delicious hot sauce on the side that I haven't seen anywhere else.", "author": "Crystal Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "***3.5 stars***\n\nmy bff wanted to come here for her birthday meal, so we came here for lunch on a sat afternoon.  i was a bit concerned about parking, since this was outer mission than bernal heights, but fortunately, was able to secure a free, untimed space about 2 1/2 blocks away.\n\ni had made a reservation at 13.00 since i wasn't sure how crowded it would be, but upon arrival, realized that i could have gotten away without calling in advance...good to know for the future!\n\nas soon as we were given menus, we were informed that they do not serve sushi at lunchtime.  i was quite disappointed to hear this since i had my heart set on ordering some rolls for lunch!  oh well...onto choice #2!\n\nwe ordered edamame ($5) to start, but we barely touched this appetizer since it wasn't long before our entrees were ready.\n\nmy friend ordered the r3 - chashu ramen with tonkotsu flavor ($11.50).  her bowl was colorful with three generous sized pieces of chashu pork, half of a soft-boiled egg, corn, onions, bean sprouts, spinach, bamboo shoot, and mushrooms.  i know she enjoyed it b/c she finished every last bite!\n\ni ordered the salmon teriyaki plate ($14), which consisted of two pieces of salmon, a flower-shaped scoop of white rice, and mixed green salad.  it was very pretty and colorful, and tasted pretty good, but i felt the portion of salmon was a bit on the small size.  i was actually left wanting more, and not quite full at the end of this meal.\n\nservice was prompt and accurate, and we were always greeted with a smile.  restrooms were in the rear and generally pretty clean.  i saw some additional seating in the back, although very few customers were here.\n\noverall, a reasonably good place to have some japanese food.  ramen is probably the way to go, and the biggest bang for your buck at this establishment.", "author": "Ellen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "I'm not that much of a fan of katsu but if I ever did want some I'd come here! Cozy place and their donkatsu is actually good (again, coming from someone who isn't the best katsu critic).\n\nToday I got their soft shell crab ramen just for fun because I wanted to try something new. Usually i stick with the basics and get shoyu with chasu but this intrigued me. And it was fun and satisfying and pretty delicious! They used REAL CRAB which was impressive. The broth was a little saltier than I like it, but the noodles were the perfect chewy. I wouldn't get it again just cause crab ramen is not my thing but if you want something different than this is definitely a fun option.\n\nAnother ramen place to add to my list of ramen places outside of the city city!", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "First off, don't be discouraged by the long wait if there is one, the owner does a great job of communicating how long you're expected to wait and tries to ensure you get seated quickly without rushing the people dining. (We came here with 3 people signed up before us, but were seated in 10 minutes).\n\n//Food\nI got the Pork Katsu Teppan Curry (13.50), which I recommend on your first time, because it's definitely worth trying. You'll find yourself  oohhing and ahhing as the curry hits the sizzling plate. Just be careful to let the plate cool off a bit despite your strong desire to dig in right away because your mouth will be in for a hot shock! Overall the flavor was great I chose the spicy option which was manageable.\n\n//Drinks\nWe also had a few rounds of their house sake (warm) which was good for the price (6.95).\n\n//Service \nThe food took a bit longer than expected once there but I think it was because we were in a party of 5 and they wanted to serve us all at the same time, which I appreciated so someone didn't have to awkwardly wait while everyone kindly coaxed them to \"just eat.\" The servers filled the water cups multiple times and were timely when we we needed something!\n\n//Overall\nNice restaurant, with good food and good service, but a little bit of a wait that is totally manageable.", "author": "John A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "My cousin brought me out here. We're both Punjabi- indian and this was perfect. The server was great and made recommendations for me any cousin who's been here before.", "author": "Harmen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "Not a bad place! Yelped around before settling on this spot to take my family for dinner, and we all enjoyed our meals. There are some pros and cons I want to post though...\n\nCons: Little space, long wait for everything, and Katsu could use a smidge more seasoning... \n\nPros: Friendly service, very trendy atmosphere, curry has nice flavor, and orders were all perfect. \n\nObviously in San Francisco at dinner time with a party of 6, it can be hard to accomdate such a big group in a tiny flat so I applaud the two waitresses who did the best they could. But it still took a while for us to order, get drinks, and get our meals... Although when they arrived it was all worth the wait. My only other personal complaint is the curry ramen had no heat, but they have a delicious chili paste that quickly resolved that issue.\n\nSo, end result is a good restaurant with a bit of a wait, but good food.", "author": "Chloe G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Came here for a quick dinner on Thursday night. It was pretty packed the entire time we were there. \n\nI ordered the Pork Katsu with mild curry and it was delicious. The pork was perfectly fried. Not greasy or soggy. The curry was good. It tastes like the Japanese curry cubes you can buy from the grocery store. \n\nThe portions are pretty big and my Katsu came with a side salad and corn. I really liked the piece of deep fried lotus root.\n\nThe prices are fair and the location is convenient. I will def return and try the other dishes on the menu.\n\nEDIT: I came back and tried the Tonkotsu ramen and it was meeh. The soup base was flavorful, but not in a good way. It wasn't rich and lacked the right flavors. It just tasted like salty soup. The noodles were good. The right kind of chewy. The egg has lots of flavor. I ordered my ramen with the pork katsu instead of the traditional chashu. The pork was still yummy, but a little drier than the last katsu that I had with them.  \n\nOverall, I'll still come back for the curry, but not the ramen. Maybe next time I'll try the sushi.", "author": "Junella T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Small place, friendly staff, and good portions. I like that they have a kids menu. \n\nMy son liked his chicken teriyaki.\n\nThe chicken karrage was ok.\n\nI got the soft shell crab curry. The soft shell crab was big and crispy, but I would ask for my sauce on the side next time because I don't like my rice drenched in sauce. \n\nHubby got the pork katsu teppan curry. Comes on a sizzling platter and you pour the sauce on top while it sizzles with the egg on the bottom. Delicious.\n\nTried the tan tan ramen-it was ok. Broth was decent and noodles weren't bad, but wouldn't come back from ramen again.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Adorable Japanese curry house with tasty teppan katsu curry and friendly service! \n\nService // \nI came here with my bf on a Thursday night and thankfully it wasn't too busy as we easily got a seat. The waitress brought us menus and waters upon sitting down. Service was friendly and attentive and our waitress would check up on us now and then to make sure we were doing ok. \n\nFeel // \nAtmosphere was cozy and intimate feeling. There were a few families and couples eating in the restaurant in casual wear. I was in jeans and a sweater. \n\nFood // \n-As an appetizer, we decided to get the takoyaki. I thought it was pretty good, came with a decent piece of octopus in the center of a perfectly cooked doughy and well seasoned with sauce ball of delight. \n\n-Because of the yelp reviews, my bf and i decided to cave in and try the teppan pork katsu curry at spicy level. It was delcious! I didn't think that the curry was overly spicy, so I would probably be a bit more bold and try the extra spicy. My bf on the other hand was sweating and sniffling through the night, but he also just doesn't handle spice all that well (but he loves it). The pork katsu had a nice crisp to it and I love that the teppan curry had a blanket of egg surrounding the rice. The waitress made a wonderful show of pouring the curry onto the sizzling plate for us. Beautiful. \n\nOverall // \nI really enjoyed this place. There aren't a lot of japanese curry houses in SF so having one so close to us is pretty nice.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Nourishing and satisfying, everytime.\n\nFumi not only delivers fabulously savory ramen, but is kind enough to accommodate my vegetarian needs to their mushroom lovers ramen.\n\nSolid place for your ramen needs, and an inviting aesthetic, as well.", "author": "Wendell A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Fumi has great ramen! Who knew such a place existed in Bernal Heights. I live in San Mateo than a lot of places there.\n\nI ordered the Spicy Miso ramen. And WOW. It didn't taste super heavy", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Probably one of the best ramens in Bernal Heights/Mission area! The broth and meat perfectly blend together and the ambience of this place is excellent Next time you come don't forget cash cause they'll give you 5% discount on your first visit!", "author": "Moorissa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "This was my second time here, and the experience has been consistently good!  Great curry, decent service, and a cozy atmosphere.\n\nMy husband and I shared two dishes for lunch - both were generously sized:\n\n1) Black curry with tempura shrimp - excellent!  The squid ink curry was delicious, the tempura was great, and I appreciated the fact they served it with a side salad!\n\n2) Teppan curry with pork Katsu - good.  This was a novel dish for us - served on a sizzling grill, the dish contained an egg base, topped with rice and pork katsu.  The curry sauce was then poured over the dish by our waitress, sizzling in front of us!  The flavor of the dish was good, but we didn't like it as much as the black curry.\n\nThe service was decent - polite but a bit slow.\n\nThe setting is modern, clean, and pleasant.\n\nOverall, a great spot for Japanese curry!  So glad to have it in our neighborhood.", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Nice curry spot!\n\nThis place specializes in curry, and it does not disappoint!\n\nWe saw the yelp photos of the legendary black curry, so had to give it a try. It's actually pretty good, and even though it made my teeth black for a while, the taste is actually like actual japanese curry. It's also pretty funny to see the soft shell crab \"swimming\" in the \"black sea\". Ha ha ha\n\nWe also got the normal pork katsu curry rice, which was served on a hot plate teppan that sizzles when you pour the gravy over ALL the rice and ALL the meat. There is even a lotus root on the top of the plate. Niceeeeee\n\nThe portions are ok. Slightly more than you need to be full. The price is a big high, since it's $14 for a plate of soft shell crab curry rice, for lunch. But hey, you have to try it at least once right? So the price is worth it.\n\nThe service is ok. The food took a while to come out, which was odd because we'd thought they'd have the curry ready on \"standby\" in the back. Perhaps not. The tables are clean, as are the restrooms etc. The inside is actually pretty big, with a huge \"back area\" that has more tables than you see in the front.\n\nThey have a huge variety of food on the menu, like ramen. Have to try it some other time.\n\nGood for some japanese curry cravings!", "author": "Henry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "This place is legit for curry. I prefer it to muracci's and like it as much as Volcano Curry (context: I only get medium or mild spiciness, so this may be different at the top end). I go for Katsu curry, and the katsu is crispy and has a nice light batter and the curry is nice and flavorful.\n\nDon't get ramen here though. It was pretty underwhelming.", "author": "Ray N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "The restaurant itself is small. The food however is yummmy! The curry can be mild, spicy or very spicy. \n\nThere are different options available for ramen. The broth is delicious.\n\nThere are only 2 servers so there could be a wait.", "author": "Alyssa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "I had a craving for ramen and decided to try this spot bc it was right by my friend's home.  It's a small venue and we quickly got seated when we stepped in.  I ordered the chicken karaage and the spicy miso pork belly ramen.  The broth was indeed spicy and the pork belly was cooked well.  Service was very quick and I really want to try the curries they have next time! I would definitely eat here again.  =)", "author": "Honey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "It's a solid curry house. Doesn't seem to be an authentic Japanese run but it's pretty hard to mess up Japanese curry.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-19", "description": "I'm all about that sizzle sizzle life.\n\nYou need to get the teppan curry rice!  For a few dollars more than the regular curry plate, you get egg and that wonderful sizzling hot plate that adds a glorious layer of crispy rice to your already delicious curry experience.  I got the katsu curry and it was probably the best curry I've had in San Francisco (Muracci ain't got nothin on Fumi!).  I'd go more often, but it's a little out of the way for me.\n\nTips and Tricks\n-You can tell your server to pour the curry slowly and get a pretty bomb Instagram video, just saying", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "Flavorful and fulfilling Japanese curry in the Mission. \n\n[FOOD]\n- Takoyaki [1/5]: I had high expectations for the takoyaki but they just came out looking very sad and deflated. Flavoring is okay but it lacked substance inside (not enough octopus, tempura scraps, etc) and out (not enough picked ginger, green onion and sauce). It was disappointing. \n\n- Fried Pork Japanese Curry [3/5]: Pork was tender and flavorful, with a good amount of rice and curry. It also came with a small side of salad. \n\n[PRICE]:\n- Appetizers ranged around ~$6, and curry around $11-14. Decent price for Japanese food since they tend to a little more expensive.\n\n[SERVICE/SETTING]:\nFriendly waiter and food was served within 10 minutes. We arrived at 6pm and was able to be seated immediately, but a crowded started forming around 7pm. Free street parking nearby.", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-29", "description": "Just my personal preference, but this was by far the worst tasting \"ramen\" I've ever had. Service from staff was friendly and helpful, which is the saving grace of such an awful meal. Ordered tonkatsu tender chicken ramen--broth tasted nothing like the rich pork base that gives tonkatsu its distinct flavor. Instead, broth was overly salty and just tasted like salty chicken\nbroth with some chicken fat thrown in to thicken it up; not something I ever want to consume again. \"Tender chicken\" was just boiled chicken, completely tasteless, devoid of salt, and on the other extreme end of the salty broth. I ordered because it was within walking distance but ended up just feeling angry that I spent money on such an awful meal.", "author": "Evelyn S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-14", "description": "A friend and I ate here on Sunday Feb 11th for lunch, and ordered the \"vegan curry\" combo. This is the only meal that we ate together. \n\nThe next morning, we both had the following symptoms - \n\n1) diarrhea\n2) abdominal cramping\n3) headache\n4) low grade fever \n\nI then checked their health report, which shows multiple high risk violations. Beware.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I LOVE Fumi! I usually order delivery but I've dined at their restaurant once. When I order takeout I usually have a predictable, awesome experience and usually my food arrives earlier... but something happened yesterday that I found strange. \n\nI pre-ordered my usual before the store opened (ordered at 4:53, Fumi opened at 5). Placed my ordered via yelp that would be fulfilled by grubhub, said I would get it by 5:35 pm. Yay! I waited.\n\n5:45 rolls around and no phone call no nothing, so I call the restaurant and they my order was taken so I hang up and wait.\n\n6:18 rolls around and I'm hangry. I call the restaurant, they say it's been taken and I should call the driver so they gave me his information and I call him. He doesn't pick up. \n\n6:25, 50 minutes LATER than the estimated time of arrival (1 hour and 25 minutes after the restaurant opened) I received my food. The driver apologized, I asked what happened and he blamed the restaurant. I walk away starting to assume it was his fault and he used it as an excuse, but I take the food and go inside.\n\nI open my meal to see how fresh it was. The salad was soggy. I don't know what that cool vegetable thing they put on it, but it was soggy too. The chicken katsu was like warm but luckily the curry was still very warm. \n\nI have my suspicions of what happened. I don't know if it was the restaurant or the delivery guy's fault. I've never had a problem with Fumi delivery so if it WAS his fault, they should NOT use him anymore and is more than willing to throw a restaurant he works with under the bus. If it was the restaurant's fault, I don't know what to say other than I'm really disappointed. \n\n4 stars instead of 5 for this strange ordeal, but when the food DOES come out fresh and hot it's soooo good!", "author": "Krystle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Go to Fumi for their teppan curry rice, it's the bomb! The teppan curry rice arrived on a cast iron pan sizzling and kept the curry rice hot.  Definitely a winter comfort food but nothing wrong with eating it in the summer too.  The curry sauce was thick and had a nice depth to it unlike some other places with runny curry sauce that taste generic and store bought.  The burnt crust around the edge was a bonus!\n\nRamen was lack luster and the pork belly was so dry can barely bite into it.", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "I tried the chicken katsu ramen my first time here and the pork katsu curry my second time around.\n\nRamen is good, felt like a good meal after a hangover.\n\nPork katsu curry rice is amazing. It comes with a nice small salad and corn. There was definitely more than enough curry for the pork and rice.\n\nService is great!! The waitress greeted me, checked in on me, and was smiling the whole time. She's great! And this was both occasions with the first and second occasions being about a year apart.\n\nOverall:\nRamen: 4/5\nCurry: 5/5\nService: 5/5\n\nDefinitely no reason to not come back here. I know I'll come back when I'm too lazy to make my own curry or am sick of my own curry.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "The only place I know that has a whole soft shell crab as ramen and curry rice topping. Black curry is pretty tasty.", "author": "Ari C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "I loveee that they give every table a whole pot of fukujinzuke pickles!! My FAVORITEEE thing to eat with curry.\n\nI read that their teppan curry was the thing to get, but I love noods so I had to go with the chicken katsu udon curry. Curry was very subtle in flavor but the katsu was fried really nicely. That spicy stuff they have on the table is really good too, a savory spice which I enjoyed.\n\nI'd definitely come back again, even got my husband a pork katsu to-go and he demolished it. \n\nWaitress was really nice, and kept refilling waters, she even gave me a little sauce container for me to fill up on the pickles. HEHE", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "My overall experience was very nice. I came here on a Sunday afternoon and was seated right away. I didn't expect anything out of this place because this was not the original lunch place I wanted to go to but it definitely exceeded my expectations. The atmosphere was simple and soft jazz was playing. The waitress was very nice and got our order right away and brought out our drinks fast.\n\nI ordered the Pork Katsu Teppan Curry. The waitress brought it out with a boat of curry and even poured it on for me. I am always amazed by things that sizzle. The pork katsu was very moist on the inside and perfectly crispy on the outside. The rice was also made very well to where it wasn't too soft and mushy. \n\nMy boyfriend ordered the Chashu Tonkotsu Ramen. I tried it out and tonkotsu soup base was so flavorful. It had a hint of herbal taste but very very slight. The soft boil egg was perfect where it was still runny on the inside. Not many places make there soft boiled eggs correctly but this one was good. The noodles were not too soft and still chewy. The chashu was was good nothing too amazing but everything went together nicely.", "author": "Ada N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Everything here is ridiculously on point, but the Japanese Curry is the star of the show. As soon as you sit down in the restaurant, you will be seduced by curry aroma. My favorite dish is the Hamburger teppan curry, which arrives in a cast iron dish, anointed in curry, with a 1950s style gravy boat of more curry to the side. You will eat all of that curry, and wish for more.\n\nAs you start to develop a dangerous curry addiction, you can branch into the excellent sushi and noodle options also available here.\n\nThey also serve a nice array of beer and sake.\n\nService is consistent, friendly, and courteous. The music is always the same cycle of classic jazz.", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "I came because one of my friends posted a video of the teppan curry so I knew I had to come here as soon as I got a chance. I ordered the katsu teppan curry, which is a bit expensive, but it was delicious. I love the rice and how crisp it gets on the pan. I just wish I got more curry to eat with the meal. Still, I really liked the food here and I have to say, while I have never seen them do this in Japan, it's my new favorite way of eating Japanese curry!\nMy bf tried the ramen and I took a sip of the broth and it was pretty decent. No complaints. This was great for lunch and we came here at around 7PM on a Friday and didn't have to wait!", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "If you come here and don't get the Teppan Curry, you are making a huge mistake. I've tried the other dishes, including the ramen and sushi, but the Teppan Curry is one of a kind. Literally. \n\nTeppan Curry is served on a sizzling hot plate. In the center is a mound of rice topped with your choice of meat (I always, always either go with Chicken Katsu or Hamburger steak), surrounded by sizzling egg, and once it arrives to your table, the server pours a gravy dish filled with Japanese curry on top of the egg making for an instagrammable delicious meal. \n\nLet me break down each component for you. It is that good.\n\nThe chicken katsu is perfectly fried and seasoned. Not too salty, not soggy at all, and the perfect thickness. The hamburger steak (Japanese style) has all the right flavors, is tender af, and will make you crave more. \n\nSome Japanese curry places are clearly from a base out of a box, which is not always bad. But Fumi curry has almost a tomato base, making the sweetness balance with the salty of the topping. \n\nYes the ramen may be alright, but the Teppan curry is the thing to get. You can't get it anywhere else.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Ordered hot plate curry noodles--really good!", "author": "Maggie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-24", "description": "Stopped by Fumi on my trip to San Francisco. I was recommended this place by a friend who said that there curry is delicious. The ramen was not. I order the California ramen - which came with little to adequate portion of avocado and crab meat.\n\nNothing amazing compared to other ramens I had. The broth was really salty, which made my experience poor. Maybe next time I'll give this place another shot by ordering a curry dish.", "author": "William T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "I'm conflicted writing this because I don't want this place to blow up and then I'll have to wait 1-2 hours\n\nLOVED: aaamaazing curry, tasty flavors, best Japanese curry I've had in my life, vibe, sake selection, even got free edamame bc we spent $15+ on drinks, service was great, absolutely the best! Don't come here lol\n\nEEEH: they were closed for 2 weeks so I couldn't get my fix but finally got some yesterday!", "author": "Jul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Very good! Seated right away. Chicken Katy's curry was good! Seaweed salad good. Tempura good. Hard to find parking but eh, that's the mission. Highly recommend", "author": "Jose V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "Had lunch here last week with a colleague. The first impression is that the decor is sparse and in no way inviting. Honestly if the food was a standout I'd be perfectly ok with that - gotta love a good \"joint\". Unfortunately the meal was equally disappointing. I was feeling the mood for Japanese but not ramen.  Ended up ordering the Teriyaki Chicken. Perhaps that was my mistake as other reviews for Fumi are pretty positive. That said, Teriyaki Chicken is a staple - it's gotta be done right. The chicken was dry and tough and had no flavor. I ended up pushing the meat to the side and just ate the rice - pretty hard to ruin but it definitely could have benefitted from more teriyaki sauce which was very sparse. I don't have reason to be in the neighborhood often but if I am, likely i'll opt for a different restaurant.", "author": "Karen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "The best vegetarian Ramen I have ever tasted! Curry flavor is strong with lots of great toppings! DONT add fried garlic since the taste is strong and competes with the broth. Other than that simply delicious with reasonable prices!", "author": "Shasha K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "To find a curry as hot as chef curry is difficult. \n\nCurry involves harmony between all the different spices with not just one tone of flavor, but a burst of it all. Curry is such a comforting food that it should take you through your childhood memories as you take your first bite. Curry is something that you hope to never finish as you just want to keep eating more and more. \n\nIt's very hard to find authentic good curry in the Bay. So far my FAVORITE is Muracci in Chinatown with the chain Curry House in Los Angeles as my second go to. \n\nFumi's namesake includes curry and ramen. With Coco's ramen right nearby, I'm safe to say that Fumi probably does curry better. \n\nI ordered the Fish Katsu Teppan Curry. \n\nWhat is teppan?\n\"The iron plate\"\n\nYou want curry, might as well go all out with the Teppan. It comes sizzling hot and the egg is cooked around the rice. The sizzling creates a nice crispy bottom layer on the rice to resemble those of clay pots. My senses arouse as the sizzle and smoke continue in front of me. \n\nA mild curry was definitely mild as I regretted not ordering a level up. Their curry was great and so was everything else! Fish katsu was fried perfectly. I managed to finish the whole thing without a single piece of rice left. Towards the end, I was running out of curry but I wasn't sure if it was due to my proportional errors. \n\nThis place is definitely a treat located in Bernal Heights. They also have ramen and sushi, but I'd stay away if possible. \n\nFifi approves and suggests to also try their black curry. \"Once you go black, you can't go back.\"", "author": "Fiona L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Just go and try one of the hotplates. I would add pickled radishes next time if it's offered on the menu.", "author": "Cheech B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "First time eating here and so far I am satisfied! Their curry is good... I did try Pork Katsu Teppan Curry and Spicy Miso Ramen. Over all Iam happy with the taste and quality. Will definitely recommend curry and ramen .... oooops!I have also trued their dragon roll and its impressive.", "author": "Mikoyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "Been here a few times and been pleasantly surprised by the quality of the food here each time!\n\nDefinitely get curry and consider skipping out on ramen here (Coco's Ramen next door is better imo). Fumi's curry is their forté, and it's better than Curry House in Cupertino! The curry sauces (both squid ink and regular) are extremely flavorful, spicy (not in the hot sense, but full of aromatic spices), and not too heavy or salty at all! Wonderfully made. Even the rice is worth mentioning - they cook it to a perfect texture that complements the curry so well.\n\nWe ordered the fish teppan curry last time, and boy it was sooo delicious. $14 was well worth it! The hot griddle also has an egg on it, which just sizzles with the curry sauce, making it so yummy. You won't regret ordering it :) \n\nAlso tried the hamachi kama here before, for $10 it was very worth too. Good portion, and very well-handled with the charring and doneness. :D", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "The little restaurant in the Mission splits its menu between ramen and curry. If you are curious about black curry, this is the place to try it. A few years ago, there was a fad for black food in Japan: black burgers (including black buns), black spaghetti, and black curry, to name just three. All this blackness is courtesy of squid ink, which is plentiful in Japan, and lends a pleasing, mild flavor to savory dishes. I've tried the black curry at Fumi's and it is quite good, although it does impart a startling black hue to one's tongue. My favorite though, is the teppan shrimp curry. The curry rice option comes with deep fried prawns and lotus slice atop a hill of rice with a moat of raw egg, which quickly cooks into an omelet on the iron plate. The curry comes on the side, allowing you to pour as much as you wish. The egg noodle teppan option comes with boiled shrimp and a fried egg on the side. Again, the curry comes on the side. Both dishes are satisfying, particularly on a chilly San Francisco summer day.", "author": "Priscilla O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "Harassment the day Saturday September 29 at 7:00 pm I went to pick up a delivery to this place, I was waiting for more of the time they told me, until I approached the person who was packing more orders, the expo, told me that I came out, I shout and I push twice in front of everyone, I clarify that I stay still and he did it again, pushing me back in the chest, it is a lack of respect that these workers have, rude and uneducated in this place so I take the trouble to leave the photographs, the exact time and place where everything happened, in my way of seeing is a rude person who should not continue working in this place, the person would think that I was going to fighting with him like in a street fight, I was very wrong because I am an educated person and I do not have to do what he does, I am writing this so that the owners of this place do something with this person, due to what He did, I as a person can I ac Going to the LAW of California where this type of acts are not allowed and severely punished, in the next few days I will go personally to find the owner to know if they took the corresponding measures with this type of people, I will attach the photographs of This gentleman and it is good that the people of the administration of this restaurant that have an employee who PUSHES other people and screams in front of the clients without caring about anything else, I clarify that I do not leave it here but also in the rest of the networks social until they do something about it.", "author": "Nicolas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "I came here and we ordered the chicken katsu curry and chashu ramen. Both tasted kind of bland. The curry tasted like sour potatoes for the most part, wasn't too flavorful, but the chicken katsu was pretty crispy. The salad on the side lacked dressing. The ramen was ok. A little bland as well, the chashu had no flavor to it. But the broth was more flavorful and was a concentrated broth. The restaurant itself is lovely, very homey and clean. I was bummed they didn't serve sushi items for lunch. Overall, it's an okay place. Would not recommend the curry however, you're better off ordering the ramen. Wish I got to try the sushi. And finally, this place doesn't really give me much incentive to come back.", "author": "amy k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "You guys.. this curry takes me right back to Tokyo! Delicious and ultra fast delivery. So good! Arigato!", "author": "Jess L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "The sad thing is, I like the curry here. I ordered their curry several times for pick-up. But recent visits were VERY unpleasant by the way waitress treated me when I was picking up my order.\n\nI ordered online and after 20 min or so I walked into the restaurant. The two waitresses seemed to be pretty busy, so I was waiting at the counter. They walked right in front of me bringing foods to the tables, after several times I still got no words. \n\nAfter 5 min or so, another customer walked in. And then, one of the waitresses greeted her right away, and asked her if she's there to pick up. The waitress knew that I have been there for a while, but she somehow decided to still ignore me and greet the customer who came after me.\n\nAt this point I was really frustrated (especially because this happened last time I was here) I asked this waitress why she was ignoring me. Then she just looked at me and bluntly said, \"OK SO ARE YOU PICKING UP OR WHAT.\"\n\nMy last two visits to here were very similar to this. Both times this same waitress treated me the same way. I felt like I was very un-welcomed. I don't know what made her treat me differently than this other customer, what made her think it is ok to ignore me and not to ignore this other customer. I wonder if this restaurant thinks it's ok for their waitresses to treat their customers differently based on whatever it is.\n\nAgain, I liked their curry. But unfortunately, after what had happened to me and it seems it's a recurring occurrence, I don't feel like going back there if i know I will be treated like a second class customer for them.\n\nI thought of giving one star because my experience was so unpleasant. But added one more star because of their curry.", "author": "Haiden I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-11", "description": "Sister dearest was craving curry so curry place we went. Ordered a couple sushi rolls and appetizers before our entree. Sushi rolls were just okay. Hamachi carpaccio was slightly fishy and not as thin as expected. The main entree that I decided to order was the curry ramen with chicken katsu. Ramen was perfectly cooked, chewy, al dente noodles. Curry was slightly bland, but complimented the chicken katsu alright. Other dishes that my party ordered were the black curry teppan with tonkatsu and regular curry teppan with a side of chicken katsu. The presentation looked great, but taste was either too bland or did not have any curry taste at all (this was the black curry). \n\nNote- if you order the black curry, you might not taste any curry at all... the sauce is soooo interesting,  I still don't know what it is made from... mystery taste right there.  \n\nOverall, the ambiance was alright (didnt turn on AC until an hr or two into dinner service.. place is small but cozy.. service was great, but the food was just okay but forgettable. \n\nPs- matcha milk tea did not taste like matcha at all... it was more like sweet soy milk with a hint of tea. skip if needed. It wasn't even green!!", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "YES YES YES. A veritably CHILL and reasonably priced general asian food restaurant that mainly serves curry and noodles. This errs more on the side of comfort asian food, which SF honestly needs more of. There is a lot of transcendence across geo-political food boundaries here (Korean and Japanese and Chinese all in one menu), but I ain't even mad.\n\nChicken Katsu and beef curries give off Go!Go!Curry! vibes. There are many, many vegetarian options as well. It's a nice place to come for a filling dinner, boozy asian drinks, and classic izakaya fried fare (tempura, takoyaki, agedashi tofu, karaage, etc.) \n\nThis is the kind of restaurant you come back to time and time again for consistent food and service.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Black curry is their special!! So good! My wife and I usually share the sushi and order our own entree! Cozy and clean restaurant!", "author": "Marleet P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "This place has the best Japanese curry! We have gone here on date night, and recently for a party, and service was outstanding ,despite our large group with high demand, and noise...There is a back area for parties which feels more special for events!\n\nFood came out promptly and was, per usual, super yummy! They have amazing vegan options as well.\n\nThanks Fumi, you are ForMe!", "author": "Nika C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "If KFC chicken deserves a 1.5 stars, this place gets a 5. All my reviews will revolve around KFC. \n\nI ordered a fish katsu curry over rice. The food was $11.95. The curry was what you can expect from a good Japanese meal. The sauce was smooth and had good flavor. Portion size is pretty filling too. Considering that a typical meal at KFC is around $10, this cannot compete. \n\nThe service is good too. Our waitress probably refilled our water jugs five times or more. The place seems pretty clean too. Thanks!\n\nI came on a Sunday evening and the place is not too packed. There are multiple tables in the private room for larger parties. I do like to mention that we had 11 people and the 18% tip was already posted on our bill. A SF standard.\n\nI would not say that this is the best Japanese curry I've ever eaten, but it's still pretty good. If you do end up liking this place, I also recommend Usagi in San Mateo and Volcano in SF", "author": "Geoffrey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I really love their food here (traditional Japanese curry). I get their teppan steak every time. It's a low-key place and their service is mind.", "author": "Terrie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Great ramen, noodles taste fresh and the spicy broth was delicious. The location is closer to Mitchell's ice cream so get dessert there.", "author": "Mathieu G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "We ate curry at Fumi ramen one Friday night, and the Warriors won a game during the finals ^^V (Curry pun intended... hahahaha)\n\nFrom our visit, the star was definitely the curry (no pun intended this time). For a city with a prominent food scene, SF is surprisingly scant in legit, worthy Japanese curry. Japantown is mediocre and tastes like box curry; Volcano is underwhelming and seems like a joint that would belong in a mall food court; Murraci's is just about the only decent place, but it is a very small and more of a hole-in-the-wall pit stop than a comfy sit-down dinner like Fumi.\n\nWe got the chicken katsu teppan curry, and it was outstanding--a cloud of smoke rose as the server poured the curry over the sizzling teppan plate. (Exciting! I suggest capturing a video to oneup your food porn) The housemade curry had excellent umami flavor, a tantalizing spice blend, and wasn't too salty. An equally impressive aspect was the heavenly interplay of textures. Not only was the rice perfectly charred like the bottom of clay pot rice or dolsot bibimbap; the egg was crisped as well. Together with the katsu featuring a crunchy panko exterior and juicy meaty interior, this was a very satisfying dish. The pictures of the curry rice plates do look a bit small, as other reviewers have pointed out, so I would recommend sticking to the more avant-garde teppan curry. \n\nThe ramen turned out to be just alright; it will do to satisfy ramen cravings but I do prefer Coco's in Bernal for the wow factor. The broth was attenuated in tonkotsu flavor, mildly creamy, and less salty (to our liking). The portion size was just sufficient, conveniently leaving space for dessert at Mitchell's afterwards P: Although it came with the basics of half an egg, 3 chashu slices, menma, kikurage, corn, and spinach, it could definitely use a larger quantity of each topping. My favorite part of my ramen was the soft-boiled egg, which was on point with its mastery of the liquid gold yolk. They also have more unique ramen options, such as the California ramen with avocado and soft shell crab ramen (The boo was interested in this, but I thought the soft shell crab looked creepy like it was about to walk out of the ramen bowl any moment.)\n\nDinner totaled to $24 pre-tip, very affordable for quality noms in SF. They also have happy hour 5-7pm with BOGO dranks but unfortunately we didn't notice until we left and saw the poster outside (and they have Asahi black!!). The ambiance is nice and relaxing, with traditional Japanese decor that is homey but not flashy and abstract like many Japanese places these days. (Plus, nothing can beat an ambiance of Totoro music in the background) Service is efficient and attentive, and the owner is very friendly. Hurray for small businesses--even though Fumi is newer to the neighborhood, it feels very personable and non-gentrification-y while adding delicious traditional Japanese curry to the SF food scene.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Delicious orders of curry rice with katsu pork and tempura shrimp. I ordered mine at medium spicy and could have gone for the spiciest setting. \n\nWe liked the food so much we went home and tried our hand at it the next night. It was good, but Fumi's was much better.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "Lady assigned to serve customers dining at the backroom area needs major training on customer service. She's flat out mean , not pleasant & is mad all the time. Stopped going here for 3-4 months because of her but found out last night that nothing has changed.", "author": "Cesar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "Had their Californian Ramen, which included a few crab legs. Overall, very delicious.", "author": "Darren W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-02", "description": "Came here for dinner on a weekday around 6. Was seated immediately at the bar. What I liked about this place is that it allows you to customize many aspect of your meals. Choose your broth, choose your protein and finally choose your toppings. Same goes for the curry dishes-- choose your sauce and protein. They also have sushi here, although I personally wouldn't recommend it since I sat at the bar and didn't think the fish seemed that fresh here. \n\n I ordered the regular chashu ramen, which came with half an egg. The broth overall seemed like it was watered down where they added in salt to compensate for it. The pork itself was kind of dry. Overall, I would say that the ramen is only 'okay' and would probably recommend getting a curry dish instead because that's what the seems like this place is known for. \n\nTLDR; Ramen was only okay, would come back to try their curry dishes. Good and fast service.", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Wow the Teppan Japanese Curry with Shrimp was amazingg. I'm not one to get over-impressed by food presentation. When it came out and the waitress came over and started pouring the curry over the sizzling omelette, I was like 'kay this is cool. Now how is it going to taste?' Reallly good. \n\nI'm a fan of stone cooked dishes like stone hot bibimbap. The heat from the plate below gave the bottom of the rice a crunchy burnt texture and mixed with the egg, curry, and shrimp. Just really great. It may not be authentic Japanese curry, but it's pretty delicious and definitely worth trying.\n\nAmbience-wise, the restaurant is small but not cramped nor overcrowded with people. It's a good place with to have dinner conversations since noise-level isn't bad at all.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I order this every time I'm missing Cocos Curry. It's as close as we can find to the cherry we fell in love with in Tokyo.", "author": "Chase L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Ok. I've upgraded Fumi to 5 stars. This place is consistently delicious, has a really nice vibe, and always has good service. I was sold on that extra star when I opted for a different order--I tried the curry udon (substitute ramen with udon noodles), medium spicy. It was exactly what I was looking for! Fumi folks sure know their curry. Get yourself here in a hurry! (rhyme!)", "author": "Kate V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "I wanted ramen, I wanted curry. They put all my hopes and dreams in a bowl and made them come true. Thank you Fumi!", "author": "Jess F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "We wanted a chill dinner that we didn't have to cook or clean up after, because we are permanently tired. Because we have a two year old. And the irony is that almost every time we try to go out for dinner it's more stressful, not relaxing. \n\nBut Fumi was great! There was room so we didn't have to either wait with an impatient toddler or be shoved into some tiny bistro table that keeps getting bumped by bustling waiters. \n\nThey had a baby seat right away. They let us order her kids meal (see photo) right away while we were still deciding on our food. They brought plastic utensils and a cup with lid and straw right away. The music was nice and chill and it wasn't loud or echoey in the space. \n\nOur food was great. Had the Dragon roll and salmon teriyaki. Baby had kid's curry rice, which came with salad and corn and half a smoked egg.", "author": "Oscia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Food is delicious but service is really slow. Waited 30 minutes for a table, and 50 minutes for our main entrees. The table next to us were seated after us, ordered before us, finished their food and left the restaurant before we got our food. The curry ramen with chicken katsu are bomb. I'd definitely come back but probably during off hours.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Tasty combinations of ramen and katsu dishes with really yummy thick slices of sashimi. Took my cousin here who loved it. He had the curry ramen with pork katsu on the side and I had the mushroom special ramen with chashu. We split edamame and salmon sashimi. Great food without the fuss, nice gem in Bernal.", "author": "T L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "The worst ramen I've ever had. It was so salty and blah. The chicken in the soup had an odd texture and taste and the noodles were one giant clump. I was so disappointed.", "author": "Shara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "First time here, I have to say their servers is great and fast.\n\nI ordered a custom curry and my friend ordered a California ramen.\n\nBoth soup are on the salty side of it, not sure why it's very salty.\n\nmy next visit I will try something else", "author": "Mack A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "5 stars for food which tastes authentic and prepared by experienced cooks. 4 stars for the atmosphere and ambience, nice Japanese style interior and it's pretty quiet. 3 stars for service that could be better. I didn't like the attitude of staff. Price is 4 out of 5 only because of the service.\nOverall, the food is perfect, service has to be improved. Will give it one more chance later and update this review.", "author": "Mark K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "I had a Pork Katsu Teppan Curry, and found a hair in it. I was wearing a baseball cap so it was certainly not my hair. The waitress took the plate away and brought me a new one. But by that time, it was unappetizing. And they charged me.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "Fumi is a decent Japanese place that is very walkable for those in the Mission and Bernal Heights. However, neither its curry nor ramen are that authentic, and the flavor profiles are a bit off.\n\nI've had the chicken katsu curry and tonkotsu ramen. The chicken katsu curry came out looking great, with a generous serving size and some mixed greens dressed with vinaigrette on the side. I asked for the extra spicy option. As I began eating, I noticed red streaks in the curry, and the curry tasting unusually sour. It dawned on me that they simply poured Tabasco sauce in the curry to accommodate \"extra spicy\". This was a pretty unfortunate discovery. If you're going to offer three different spice levels, it makes sense to make the different curries at those spice levels rather than just adding hot sauce. I could just do that myself.\n\nThe tonkotsu ramen looked great as well. However, the broth was overly salty and lacked the rich flavor emblematic of tonkotsu ramen. It was almost as if they felt the need to overcompensate with excessive salt to make up for the light-tasting broth. The chashu pork was a bit chewy and lacked the soft, melt-in-your-mouth texture that I look for in tonkotsu ramen.\n\nFumi is clean, well-managed, and a nice spot to grab a bite in Mission/Bernal. But based on their unusual flavor profiles of what are meant to be traditional classic dishes, I won't be returning on a regular basis.", "author": "Tim X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Loved it! Came in with some friends for ramen on a Friday night, and the place was surprisingly empty so we were seated immediately by the incredibly friendly staff.\nThe menu has quite a bit of variety, and it was hard to pick anything but I finally settled on the curry ramen with chicken katsu.\nFood came out pretty quickly, and it was SO GOOD. The chicken katsu was super crispy, and the ramen itself was amazing. I got the 'spicy' level, and it was enough to give the ramen a kick, but not mask all the delicious curry flavors. The base ramen doesn't come with a ton of toppings so you may wish to add you own, but I was still pretty satisfied. \nMy friend got the milder-looking tonkatsu ramen, which was reportedly also delicious. High praise for the pork chasiu, as well! \n\nLiving down the street, I don't think I can resist coming back soon to try the rest of the menu!", "author": "Gautam G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "My favorite go to spot for japanese curry! Teppan Curry is delicious and perfect for a cold windy SF day!", "author": "Austin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Love love love this place. Truly a hidden gem. First off, I've tried a handful of the highly rated *cough* more like overrated *cough* places in SF and those just do not compare to Fumi. First off, the quality of their ramen and curry are great especially for their prices which are a steal for SF. The ramen is perfectly balanced and the noodles are always cooked to perfection. Can you believe I had ramen in Japantown and the noodles were served SOGGY not remotely al dentè?!?!\n\nAnywho, to add on, the waitress who I've seen both times I've been during lunch is so attentive and sweet. I'm so sad I found out about this place the last two weeks I had in SF before moving. Currently dreaming about a bowl of their tonkatsu ramen with some of their perfectly juicy on the inside chicken katsu on top :'(", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Japanese curry is my comfort food, especially on cold days. I was craving something warm and spicy during this rainy week so I placed an order of CHICKEN KATSU CURRY (SPICY) through GRUBHUB. I didn't want to venture out in the rain and opted for delivery of food to my office.\n\nThe CHICKEN KATSU was breaded and fried perfectly. Chicken can be hit or miss in terms of texture and dryness, but this chicken breast was moist and the breading remained crispy, even in a delivery box. I enjoyed the spiciness of my CURRY--it really warmed me up on a rainy day! Fumi's curry also had an extra citrusy/vinegar flavor to it that went well with the chicken katsu and rice. This dish came with a side of green salad.\n\nThings to note for DELIVERY:\n\nI am unsure if the driver was from Fumi or Grubhub, but he did not follow my instructions for delivery. I work in a building with security so people have to be buzzed into the building. I was very specific in my instructions to call my cell phone upon arrival so I can come downstairs, OR give the security desk my extension so they can ping me. The driver buzzed himself in and just left my food on the counter. He didn't even provide the front desk with my name so they did not know who to call. Good thing I was keeping an eye out on the app so I knew when the food arrived and was able to run downstairs to get it in a timely manner.\n\nFor future visits, I think I'll pop into the Bernal Heights location and eat inside the restaurant. However, I am still impressed with the quality and taste of my meal so I may opt for delivery again if I have a strong Japanese curry craving at work.", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Most delicious curry ramen I've ever had. Even though it's the first one I've tried, it's the best. I've been here twice and I've ordered the curry ramen with chicken katsu both times now. This place is great, you should try it!", "author": "Gerald P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "I came here yesterday, (Saturday) around 7ish for dinner. I have not had Japanese curry in FOREVER and was so psyched to finally find a place in the mission that has it! Right when we walked in we got seated right away next to the window. This place looks small but there's actually a lot more seating in the back. Service was A1 as our server asked us for our drink order right away, asked for order and we got our food super fast!\n\nWe ordered a Sapporo and an Asahi. I got the Chicken Katsu Teppan Curry, best decision of my life. Lol pretty much a sizzling plate with rice in the middle, chicken katsu on top and then on the bottom is an egg. The server then brings the curry and poured it around the egg, wowww. It was super bomb. My friend ordered spicy ramen which looked bomb. I plan to definitely come back and try the other curries!!!", "author": "Veronica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Decent local Japanese food.  Love their curry ramen and rice plates! Reasonable price.ls.  They get busy after 7pm, but do have extra seating in the back", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-25", "description": "The food wasn't very special. I have to admit the teppan curry does change the experience, the rice and egg is crispy! However, we waited 30mins+ for food.. It would be nice if the waiter had warned us about the wait. Parking was also difficult in this area.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Their curry is amazing. I tried it with the rice and chicken katsu and it goes really well. Their salad is also good, with a crispy lotus root on top.", "author": "Vattanak C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Love the Pork Katsu Teppan Curry!!! It's brought out on a sizzling plate and you pour curry over the egg around the bed of rice & pork katsu. The warm plate and the spicy curry is a perfect combination especially on a colder day in SF. It's absolutely delicious and not to be missed!\n\nSmall restaurant, but they have a larger space in the back so don't be too concerned if the front room is packed. We've never had to wait more than 5 minutes and frequently come on busy Friday/Saturday nights. \n\nPrices are very reasonable for SF. A large beer (Sapporo / Kiran / Asahi) is $6. The Teppan curry is $13.50 and a solid portion. I always feel very full leaving here!\n\nHighly recommend Fumi Curry next time you're in the area!", "author": "Caroline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "I ordered Fumi curry using Seamless the food delivery service so I can't review everything but I'll do what I can!!!  =D\nTime of order: 8:15 pm on Friday night\nArrival of food: 8:55 pm\nMenu Selection: Such a variety: ramen, sushi, and Japanese curry; usually places that make too many things don't specialize in anything but their curry was excellent, extra points for being able to substitute white rice for brown rice\nFood: I got the teppan hamburger curry and my wife got the seafood curry\nTaste:  Very authentic tasting Japanese curry; not many places that make this delicacy but it was awesome!  My wife's seafood curry came with a good variety of lots of seafood.  My hamburger curry had below average to average burger (I think I like when there is more bite to my burger and there are chargrilled marks on it, like at Volcano Curry); however, the cooked egg under the beef was so good.  A little on the salty side but a really good complement to the burger and curry!  \nTemperature: my wife's was still hot!  Mine was on the cold/warm side but it was delivered so hard to complain\nSimilar Restaurant: Volcano Curry (Richmond District); Fumi's curry taste was great but it was more expensive but had more quantity and more variety (there is no seafood curry at Volcano), also I always order extra curry at Volcano but not necessary at Fumi, I'm stuffed...", "author": "Kentaro T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "visited fumi again on sunday.  my family can't get enough of this place.\n\nordered a couple of katsu curries and a couple of ramen.  the quality has not slipped at all in the years we have been coming.  this speaks to the continuity in the kitchen/family that owns fumi.  well done guys. \n\nthe interesting thing is that we noticed that a third ramen joint has/is slated to open within 50 feet of fumi.  to us, this is the highest compliment to fumi who was here first.  those with no vision copy a good thing and hope for similar success.  \n\ni would recommend you stick with the original as the wanna be's try to siphon off business from the \"OG\"...", "author": "C C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "The curries tastes great! We recently ordered from the sushi menu and it was just okay. Probably wouldn't order sushi from here again. \n\nAnyway, you come here for the curry and the curry is on point! Service is good and will definitely come back.", "author": "Ruby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Absolutely no complaints here! Fumi is a cute little spot that would be good for small groups (would probably not recommend larger than a group of 6?). The menus are adorable!! \n\nWe had:\nCurry ramen (medium spicy) with udon noodle + chicken katsu\nCurry ramen with ramen noodle + chicken katsu\nAgedashi Tofu\nGyoza\n\nEverything was delicious. The katsu was lightly battered so it wasn't too heavy. Didn't get to try their other ramens, but if you are in the mood for curry I would recommend this spot!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-11", "description": "Came here on a Saturday for lunch and the restaurant had a decent amount of people. \n\nIt's the second time I've been here and of course I got the same thing again: teppan curry chicken katsu. I got medium spicy which was enough to make my lips tingle. \n\nThe sizzling dish was served by the waitress with the curry in a gravy boat, then poured onto the dish- I enjoyed watching it sizzle and form bubbles.\n\nThe curry was a little too salty in my opinion. The chicken katsu was nice and crispy, the meat inside was tender and easy to cut with my spoon. I enjoyed it, it was comforting and great for a cool winter day.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "My grandson and I went here based on the good reviews. We really wanted sushi in the neighborhood. The service was excellent. We ordered chicken appetizer which are fried chicken bites which we love. I know some people like fatty chicken but we don't - forcing us to leave half the order. The ramen was very good. They didn't have such a good selection of sushi so I guess the hit is Ramen. My salad dressing was bland and the corn tasted canned. Why not just sell the best? A win-win for everyone.", "author": "Eva R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-01", "description": "Small modern nice place.\nIt wasn't busy...only one other party when we came in. \n\nEdamame...$5. Came out smoky/hot. They probably microwave it cause i heard it from the kitchen a few time. \n\nCrab egg rolls...$7. They cut the egg rolls in half and put the crab top\n\nChasu ramen with tonkotsu flavor and regular spiciness...$10.95. I thought the bowl was kinda small for the price. But it varies on ramen restaurant.\n\nGreen tea mochi ice cream and stick cracker. Since i came with my mom and brother and only order 1, they were nice enough to cut it 3 ways for us. It was nice to end out meal with this dessert.\n\nTo me, i thought the foods were average. But satisfy my ramen fix. Certain food items were kinda expensive. There were only 2 workers working with the customers. They were nice. Service was average", "author": "Julie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "I have to admit a certain and probably unfair prejudice when it comes to pork tonkatsu. You have to know that I like it best when it's served in a homey setting like Kitchen Kura where I can pretend like my Okasan made it. It just feels more authentic to me that way like I'm living in a Yasujiro Ozu family drama where over a low-lying dinner table on a tatami, I'm scolded for not finding a proper wife at my advanced age. I was hoping there would be a bit of that feeling at Fumi since I considered it a good sign that it shares the name of my Okasan. Yep, my mom's name was Fumiye. But no, it's quite modern in here with a lot of hipster-style touches and a young staff all dressed in black like a \"Sprockets\" sketch. Touch my monkey!\n\nIt was pretty busy at around 6:30 on a Tuesday evening with the median age of the diners, I'm guessing, around 22. I had to sit up at the three-seat counter, which wasn't necessarily a bad thing, except youngsters would sit next to me in utter despair waiting for their takeout orders. I felt it was essential I order the $10 Pork Katsu, even though it looked identical to all their curry plates in the photo menu. It was presented on a strangely immaculate plate where the katsu slices were fanned out decoratively on a small mound of rice sitting in a pool of watery curry sauce. On the side was a tuft of mixed greens with a dribble of corn kernels (photo: http://bit.ly/1i4o2r7). A food stylist's work of art but...\n\nThe pork was a bit dry and flavorless. It looked like it was pounded into submission to make it look symmetrical, and the coating lacked the crunch that would have excited me to no end. I was bummed because my \"Tokyo Story\" fantasy of a home-cooked meal went poof. I was also disappointed that a $2.50 Diet Coke amounted to one of those Lilliputian aluminum bottles because I usually finish those in ten seconds flat. The surprising highlight of the meal turned out to be my side dish, the $5 Garlic Broccoli because it was fresh and crispy with the chopped garlic providing just the right seasoning (photo: http://bit.ly/1U8eI6C). Gee, I think I could actually make that at home. There are other dishes to consider. Perhaps.\n\nFOOD - 3 stars...pork katsu was marginal but the garlic broccoli almost made up for it\nAMBIANCE - 2.5 stars...the set of Sprockets...\"Now is ze time on Sprockets vhen ve dance!\"\nSERVICE - 3.5 stars...nicer than you would expect given the ambiance\nTOTAL - 3 stars...Okasan?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "A good spot for lunch; portions are on the small side. Service is good.\n\nTruthfully, I wasn't impressed with my teriyaki chicken. It was edible but not memorable. I would've rated this place 3 stars if not for my dining companion, a Japanese citizen who'd moved to the US half a year ago, who said the curry was delicious.", "author": "Barack O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "A decent Chicken Katsu Curry option that doesn't require a trip to Japantown?\n\nHELLS YEAH.\n\nAnd if the place offers brown rice, clean environs and friendly service?\n\nEVEN BETTER.\n\nAnd if the Chicken Curry Noodle is underwhelming and has only one sad little stalk of broccoli?\n\nOH WELL.\n\nAnd if it can appease your curry crazed cravings despite being crazy tired?\n\nTHANKS FUMI.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "My latest obsession is watching Million Dollar Listing San Francisco (MDLSF). I like to fantasize about the day I can buy a house in the city where I was born and raised in for oh you know, a million or two. I figure if Mr. NSS and I both sell our kidneys in the black market, we would have just enough for one quarter of a house at Bernal Heights, the \"hottest neighborhood of 2014\".\n\nTell that to Andrew from MDLSF and he'll probably shudder. Can that guy be any more of a douche?\n\nTeam Roh! \n\nOk, some parts of Bernal Heights isn't exactly the nicest and the some of the streets are as tight as a virgin's whoohaaa but the neighborhood is cute and most people are very friendly. Plus, you can't beat the breathtaking, panoramic from Bernal Hill. One area that Bernal Heights is lacking in is solid Asian restaurants. Ichi doesn't count unless you have a daily food allowance of $80+.\n\nOpening a week and a half ago, Fumi Japanese Curry & Seafood took over the old Eagle Donuts space, next to Pizza Hacker. The space is tiny with seating for 20 and three counter seats. This is not a place for groups larger than 4 but they do take reservations for 6 or more people. \n\nOn the menu are Apps (popcorn shrimp, karaage, gyoza, spring rolls), Salads (Asian crab and ceasar), Soups (kabocha, miso, clam), Curry Rice, Curry Noodles, Teriyaki, Teppan Curry, and Whole Crab. Except for the crab and seafood dishes, everything is less than $12. Portions are filling for the price. They also have kid meals for $6-$7. Vegetarian and brown rice options available. No booze available. \n\nWe started with the Chicken Karaage ($8) which I would pass on: http://bit.ly/1Jfygip. The garlic and ginger flavor was there but I wasn't keen on the batter they used. Instead of using the traditional potato starch coating that produces a deliciously crunchy crust, the [wet] batter was doughy and on the softer side. \n\nThe Pork Katsu Curry Rice ($10) was surprisingly very solid...for Bernal Heights: http://bit.ly/1EAgyR6. The curry sauce is housemade and contains no msg.  I ordered it extra spicy, and it seems like they hiked up the spice levels per earlier Yelp reviews. The curry was nicely thick and fiery with a subtle sweetness. The spices could have been more developed but it was satisfying nonetheless. The katsu was perfectly fried. It was golden, crunchy, and very tender. Just as important was the rice to soak up all that curry, it had just the right amount of stickiness. I added an egg (+$2) which was overcooked. Next time, I would request it sunny side up for some egg yolk porn. Make sure to enjoy your curry with the fukujinzuke pickles that are hidden in a metal container next to the salt and pepper shakers.  \n\nAgainst my recommendation of sticking with the curry dishes, Mr. NSS ordered the Beef Teriyaki ($11): http://bit.ly/1MwhxIJ. He said it was kinda chewy but alright. I had a piece and it needed more of a sear at a higher temperature and more sauce. \n\nTo cool down the heat, we ordered the Mochi Ice Cream ($3 each) for dessert: http://bit.ly/1KtSFNf. It's just sliced and plated Mikawaya Mochi Ice Cream which I saw them pull from the freezer. The batch they got was old as the mochi was hard, and didn't have that chewy, toothsome chew. \n\nService was typical Asian service. Staff was cordial and timely when we asked for things though. We were the only ones there during dinner which was kinda awkward. I think if they offered delivery via Eat24, it may drive more business. I know I would order regularly if they did offer delivery. \n\nGood luck with parking. It can be a hair puller but we eat like old farts so we had no issues at 5 pm.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "Gyoza: 4.5/5 - nicely grilled on one side and chewy on the other, flavorful\n\nPork katsu teppan (ordered spicy): 3/5 - fun presentation but katsu was a bit soggy\n\nRamen with chashu (+ pork belly, substituted udon, ordered spicy): 4/5 - broth on the lighter side, udon nicely chewy, skip the pork belly, was very tough\n\nHouse salad: 3/5 - not super fresh, not really seasoned", "author": "Laurent P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "This place is so good! I had a miso base ramen noodle bowl, some chicken katsu, and some gyoza that were fantastic. It's a tiny bit on the pricey side, but absolutely 100% worth it. I would come back in a minute. Excellent and quick service, too!", "author": "Charles L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-01", "description": "Ordered takeout at 9pm and it was ready in 15m, but the food tasted and looked like it had been sitting there for hours.\nCan't believe this place has a 4/5, just go next door to Coco it's easily twice as good for the same price.", "author": "Jo V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Been here a couple times and am really impressed. Great neighborhood spot with yummy ramen, katsu curry rice (must try!) and sushi that's really fresh too! Omg it all the things your mouth wants!", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Damn Good curry and ramen! What else does my review have to say?", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "Fumi opened a year ago and competes with Coco's Ramen which is only a few doors down. However, Coco's Ramen only has ramen for lunch and Fumi has a wide variety. You could get sushi, rice, curry, etc. I tried their unagi rice for a company's staff lunch and liked it. At $15, it's pricier than other neighborhoods with more Japanese restaurants competition. A nice addition to the Bernal Heights neighborhood.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Came back (a week later) and we came with a large group. I talked this place up so much and when we arrived the restaurant was packed so I was afraid the service and food would come a bit short. \n\nThe servers and kitchen were definitely feeling the pressure. However, the service was still great and they accommodated our custom orders. To be honest, the extra wait for food really worked out for us since we discovered that their SAKE selection and pricing is VERY REASONABLE. It's not like the best in the world, but pound for pound GREAT VALUE. \n\nI upgraded it to a 5 star rating because of the service and the hidden gem that is their SAKE selection.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Every Green Curry Ramen add fried garlic: the stuff dreams are made of. Excellent vegetarian option; super flavorful, filling, warming, life affirming.", "author": "Nashelley K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-31", "description": "Max the owner is a really nice guy. He treats every friend as his friend. The teppan curry is awesome. Try the spicy black curry not the extra spicy one. The curry's taste is rich, round and powerful with seafood undertones.", "author": "Q C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "I love curry. I love spicy foods. And I love this place. Having just recently moved to the city, I am blessed that Fumi is so close by. Actually it was the first restaurant my roommates and I first ate at once we were moved in! But other than having sentimental value, Fumi makes some bomb curry. \n\nI usually rotate between to pork katsu curry and the curry udon with chasu. The pork katsu and chasu are just alright to be honest. The best thing is very obviously the curry; I DON'T KNOW HOW THEY DO IT. It definitely has a unique taste to it that I haven't found in japanese curries elsewhere. And the best part is when you ask for spicy it is actually spicy! A+\n\nAppreciate the condiments that they leave at the table. Those red pickled radishes are the best sides to have with curry rice. \n\nI'm lucky that I live close enough that I never have to worry about parking, but it is located in one of the lesser packed areas of the Mission!", "author": "Ellen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "From the videos of the curry dishes I've seen, i had super high expectations.  Well, when your bar is set that high it usually isn't met lol.  All in all i thought everything was average from service to food.", "author": "Hugh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "3.5 STARS!\n\nDropped by on a whim as we were walking in the area looking for a place to eat but didn't wanna deal with parking in the Mission.. saw the new signage and a sign for happy hour so we popped in!\n\nDidn't come in with any expectations considering I hadn't heard anything about this place (I read all the local food blogs, trust mehh)\n\nWe ordered:\nTempura (appetizer) - it came with 2 big pieces of shrimp and like 3 pieces of veggies. Batter was light, crisp, brown and just perfectly fried. A lot of places tend to do the thick yellow batter (yuck!) but not here. It was decent!\n\nWe ordered two entrees and I forgot what the other one was (those dranks really kicked in!) - but the hamburger teppan curry was AMAZEBALLS. It's pretty much a sizzling plate with rice topped with a hamburger patty and a bun. The curry sauce is poured upon being served. The sizzling sound is music to my ears :) UGHHH. SO FREAKIN GOOD. Why doesn't SF have more teppan places? The creaminess of the curry and rice and the running egg and the savory bite of the hamburger patty... HEART HEART HEART. I mean, you can't really go wrong with that combo...\n\nOverall, the prices were pretty standard and the food was decent.\nIt's a good casual spot to visit if you're around the area but I wouldn't make a special trip. Small and clean restaurant, seems like mostly locals who pop in.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-04", "description": "I honestly love this place and the ramen is fantastic. But lately service had been so horrible I have to post a review and give it 2 stars. Hope it improves because I used to be a regular but will not be coming back.", "author": "Kibet M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-20", "description": "This place has pretty terrible service. They forgot the miso soup in my takeout order and when I called they tried to deny it. The lady unceremoniously handed me off to her boss who also denied it. He ultimately offered me a refund but with no apology and hung up on me. The curry itself had a burned taste and the salad had no dressing-- overpriced for 10.95. Will get my refund on principle and ask for the tip I left as well-- and never go there again.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "Delicious vegetarian ramen option. The broth is delicious! The service was ok. They didn't check on us at all and it felt a little rushed when ordering, but the food is so good, it's totally worth it!", "author": "nisha k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "Ordered the agedashi tofu, chicken karaage and pork belly tonkatsu ramen. Developed a bad stomach ache afterwards. Was hoping this would be my go-to spot in the neighborhood but now unlikely to return.", "author": "H S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-29", "description": "Ordered takeout. The worst teriyaki I've ever had. It was like boiled dry chicken with a tablespoon of sauce! Couldn't eat it.", "author": "Jax L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "One of my new secret (and favorite) spots. My boyfriend found this on a whim because we were both craving sushi and ended up ordering something completely different. My boyfriend usually gets the chashu ramen while I order the chicken katsu teppan curry. I'm always stuffed after the curry because they provide a pretty big portion of rice on top of an egg with a generous amount of chicken katsu pieces. We've tried the sushi (sexy mango) and it was just ok. Definitely come here if you're craving curry or ramen! Also, on the times I've visited, I've always sat next to Japanese people and for some reason that assures me that this place seems legit lol.", "author": "Jiwon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "New favorite spot! Had the every green curry ramen and it was delicious. Ramen portion not as big as some others but very tasty and very reasonably priced. ($11 I believe)\n\nService was a bit slow but friendly.", "author": "Teresa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "Was craving Katsu and found Fumi nearby. Ordered the chicken katsu ($10) while my friend got the pork teppan for about $13 (only difference was it was on a hot skillet and had an egg). Paired with a large Ichiban beer ($6) and plum wine ($5 which was a bit sweet for my taste).  Both dishes were great. Huge portions and great prices so definitely coming back here again!", "author": "Lisa X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "I wanted ramen for dinner. These guys had excellent ramen. I got tonkatsu with pork and then some fried garlic on top, great flavor. Wait staff was kind and fast. Location was chill. Honestly at this point I'm just adding more words so Yelp will let me hit post. This is good ramen, go for it.", "author": "Brady S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "It is march 25 2016 and this is my 3rd time coming here. If this review is too long, I'll just summarize it real quick. Food-DELICIOUS and surprisingly not too salty. Staff-Great service and very nice. I highly recommend giving this place a try.\n\nThe restaurant is smaller and intimate. The staff is amazing! They are nice and they check if everything is great. \n\nI have tried the curry chashu ramen, tonkatsu chashu ramen, katsu teppan curry, and the chicken katsu curry plate. The pork in the ramen was soft and flavorful! It was like it just melted in your mouth. The broths were nicely flavored and not too salty or bland like other places I've been to. The chicen katsu comes with a nice portion of chicken, curry, rice, and has a side salad. Curry was full of flavor and the salad had some cute carrots cut into a flower/star shape. I liked the teppan curry. It's served in a sizzling plate with egg, rice, katsu, and the curry is poured in front of you for that sizzling presentation. The only thing about it....is that it was sizzling, i like to dive into my food when i get it...so  needless to say i burned my tongue haha. If you got the patience, then I highly recommend it!\n\nFor dessert we tried the iced thai tea and the green tea cheesecake. The thai tea is served in a nice little goblet type glass and a bendy straw! (The inner child in me enjoys bendy straws) The green tea cheesecake was just a tad too small of a slice for but it was delicious! Sometimes they run out, the first day I came here they were out, but today they had some.", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-17", "description": "Slow service, good food - but by the time the food came out, anything would've seemed good.\n\nSat down - waited for menus, then waited to get our order taken, and then waited, got our drinks, and waited and waited, got drink refills, and waited and waited for food. From the time we sat down to the time food came out was almost an hour. \n\nMy pork katsu curry ramen with a smoked egg finally comes out. The pork katsu was fried nicely - juicy on the inside, crispy on the outside. The curry ramen was just ok. The smoked egg was a perfectly done soft boiled egg, but we weren't able to pick up any hints of 'smoke'.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "Ramen was needed on this cold day! \n\nOrdered the pork katsu curry ramen, the curry was the perfect amount of spice and gave a great flavor!  I wasn't crazy about the katsu but that's partially because I had fomo over the soft shell crab that I saw after I ordered. \n\nFumi roll came as an appetizer- it was warm with crab on top and so delicious. \n\nFor dessert we got the green tea mochi and green tea cheesecake- THE CHEESECAKE IS WHERE ITS AT!!!!!", "author": "Christina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Solid, well prepared, consistent Japanese lunch classics. Attentive staff, and a pleasant atmosphere complete the experience. If you like Jazz standards as background music, so much the better.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Disclaimer: I only ordered one item and had it takeaway so I can't speak for the service or anything else on the menu, although the woman who helped me was very nice when I picked up the  food. \nWith that said- the ramen I ordered was AMAZING. I got the curry flavor with chicken and it was different than usual ramen but in the best way possible. I had no other add ons but think an egg would've been nice in retrospect. HIGHLY recommend. My sister had a few bites too and agreed. Will certainly be back!", "author": "S E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Mmm... yummy. I like the Every Green Curry and I like it very spicy, which is spicy indeed. The black curry was fun but I don't think the squid ink adds much flavor to it, aside from adding color. Service is good. A nice little local restaurant worth checking out.", "author": "Mei L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-18", "description": "Ended up here because our usual place (Coco's) was closed. We were pleasantly surprised.  They only have one kind of ramen: tonkotsu, but it was good, you can add extras and it comes w/your choice of sides for just under $12.  My son had the chicken katsu curry which was a very generous portion and quite tasty. Gyoza was good too!", "author": "Teri K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "The food is absolutely wonderful. I had chicken katsu and a Thai iced tea. The chicken was divine. It  was cooked absolutely perfectly and the curry sauce was the most delicious gravy. The portion was well sized and filling. The Thai iced tea was also wonderful. So why three stars? The service. The service was horrible. We came in at lunchtime with a party of five. We were seated within five minutes which was great. However, we didn't place our order for another twenty. We weren't even asked for a drink order in that time. There appeared to be one waitress for the entire restaurant during the lunch rush aka highly understaffed. The people I was with said that is typical. That means it's a problem that needs to be addressed. Even having one more waitstaff would have solved the problem. Our waitress engaged in zero pleasantries, didn't offer refills, and was eager to give us our check. It is hard to want to return someplace when the food is amazing, but the service is one star.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "Came here yesterday in a group of 5. This place is kinda small with three tables that can seat 4-5 and a couple of tables that can seat 2. At first we were seated right by the door and it was chilly cold every time that door opened. When space opened up, we asked to be reseated to another table and they kindly obliged.\n\nI got the tonkatsu chashu ramen and I thought it was extremely bland especially when comparing to ramen places like orenchi or santouka. The chashu was good but not the melt in your mouth kind of chashu.\n\nAgedashi tofu: 4, lightly battered which added a nice crunch layer without overpowering the tofu\nPork katsu curry rice: yum! The pork katsu was cooked really well with a good ratio of batter to pork plus the pork was not dry at all inside. The curry had a kind of added citrus flavoring to it.\nClam miso soup: reported as delicious\nHamburger teppan curry: reported as delicious\n\nOut of our table of five, 3 of us said it was alright but wouldn't come back and 2 of us said it was delicious and would return (those two ordered the hamburger teppan curry and the clam miso soup)", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-01", "description": "Had a busy day in the office so we decided to order through doordash. We orders 3 curries and 1 chicken teriyaki.\n\nThe food arrived quickly, hot and the katsu was still crispy! There was a mixed salad with each meal. It was pretty nasty. This was due to putting fresh greens next to hot food in a box. The greens were wilted and inedible. I would suggest putting the salad in a separate container like most Japanese restaurants do. \n\nThe teriyaki chicken was quite dry and didn't appear to be the same portion size of meat as the curries. Definitely a place we'd order from again but will request no salad next time", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "I like this place tho! I got ramen for my lunch that was so good. Next time, I will try curry. It looks yummy :)", "author": "Pinarat S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Came here on a Thursday afternoon, easy to get a seat, pork tonkotsu ramen was delicious! Not too salty, just the right amount of ramen, plenty of thick chasing slices, just the right portion. Street parking available right out the street, though it's $2.15 an hr, it was quite worth it.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "After hiking bernal heights, fumi was within walking distance. \n\nVery clean, friendly staff and the atmosphere was great. \n\nThe good looks great and tastes great too. \n\nEverything was decently priced.", "author": "Fran C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "This is my 10 y.o. son's favorite restaurant.  He loves the pot stickers, ramen with crab and hamburger on sizzling platter with egg and curry sauce.  They always remember him and we go maybe once a month.  It's a casual joint, but the food is consistently good and prices decent.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-02", "description": "Curry was great! We got katsu and it had egg with it which was awesome. The ramen was very mediocre which is what I'd expect from a place that served both ramen and curry??\n\nWe didn't try the curry ramen though since it didn't sound too authentic, I think that's their spec", "author": "Linn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "Service was a bit slow; gyoza were average (and perhaps a bit too \"springy\"); chicken karaage was OK, but the texture felt like that kind of chicken they use in nuggets, i.e., pressed back together rather than an actual piece of chicken breast. I had the tonkotsu seafood ramen. It was good, but not outstanding. I tasted the curry flavor and that's better. I'd be in no hurry to go back.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Both kinds of Ramen broth are great and the chicken katsu was like the most perfectly katsued chicken I have ever seen... go see/taste for yourself. I didn't know that every other restaurant sucked at chicken katsu so much. Will not be able to order chicken katsu at other places in good conscience now because there's just no point. I don't even like chicken katsu that much and now I suddenly see the hype.  Also, the gyoza was tasty. The chashu pork is stupid good, too.\nFriendly staff and fast service. Not sure about the sushi, I didn't try it.", "author": "Katie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "What I got:\nCurry ramen w/ chicken katsu\n\nWhat I thought:\nI came here not expecting much, but it actually turned out to be pretty good!\n\nThis was my first time trying curry ramen and definitely won't be the last! The broth was really flavorful and not too salty.\n\nThe chicken katsu was extremely crispy and tender. Went very well with the curry ramen.\n\nNot sure if I just have a big appetite or if the bowl was tiny, but I felt like I could've eaten an entire extra bowl. Portions weren't the biggest, but good quality food if your looking for a decent chicken katsu place.", "author": "Tony V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "I came and ordered the Japanese curry fried shrimp rice plate last week. It was yummy, very much satisfied my craving for Japanese curry. This place gives me a new lunch option since this place is not that long of a drive from my workplace. I ordered the extra spicy which the server told me it would be level eight on a scale of 10, and I think the description was quite accurate. I can enjoy the spiciness without burning in my mouth. It's great that the plate comes with a side of salad with some vinegar dressing.\n\nThe decor of the place looks nice too. It appears small on the outside, but I went to use the restroom before leaving I found there's a dining room in the back too. Therefore the capacity is probably what one would see in the front area.", "author": "H K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-27", "description": "Have had my eye on this place for a while and now I can check  it off my list. Tried spicy pork ramen and gyoza. Ramen noodles were undercooked and pork was tender but 85% fat, broth flavor was okay. Gyoza was similar to what we have in the freezer at home. Nowhere near the quality you get in Japan or even in SF Japan Town ramen shops. Probably won't be \nback.", "author": "Elisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "3.5 stars.\n\nNice little japanese place with friendly service and decent food quality.\n\nThey nail a lot of the little touches like the tea selection and really rich miso soup. Where they fall flat is in the quality of the curry. The curry itself is too watery and doesn't have the rich  thick texture that you get at a really top-notch japanese curry spot. Also, the tempura they served us with the curry had clearly been pre-fried and then reheated prior to serving. This would be understandable during a lunch rush at a busy place, but was not appropriate for dinner on a slow night.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "I've only had delivery and take-out curry from this place, but their curry is oishi desu yo! Japanese curry is one of my comfort foods and the chicken katsu and fish katsu curry does not disappoint. Love how their spicy curry is actually spicy and the katsu is still somehow crispy after being put in a take out container. Can't wait to dine-in to try their sizzling teppan curry dishes and sample the black curry!", "author": "Greasybones V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "We came here on Tuesday night! It was ok at first. They first serve us two water without asking, but I wanted hot water! The ramen is ok, but it's the worst part. The noodle and the soup is kind of salty anddddddd there is a pice of plastic on ramen!!!! They offer free desert for us, but who has the mood for a desert when you just have a plastic ramen.", "author": "Yinru P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "This place was okay. I got a spicy tuna roll which I would never get again. The color of the tuna was not right and I don't know what exactly it was mixed with. the California roll was good, pretty basic but I did not like that the basic rolls had fish eggs all over them. Unnecessary to me. My girlfriend got the chicken ramen curry and it smelled so good, it was so warming and delicious. I would definitely get the ramen here, it was fabulous. Super quick service too!", "author": "Gabby M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Wow.\n\nThis has really quickly risen to one of my favorite spots to eat in the neighborhood. I tried to come to Fumi for the first time with my neighbor but it was closed (Monday, boooo!) and finally got a chance to try it last week. It was so good, I went back again today and realized I don't typically do that! Last time I got the Shrimp Teppen Curry and it literally came to me sizzling and delicious. This time I got the Chicken Noodle ramen with curry...holy crap, this stuff is delicious. \n\nWhat I like about Fumi is that it's no nonsense--you get some delicious Japanese food in a sizable portion for a decent price. Living in the mission I cannot tell you how many times I got to a restaurant and somehow end up with a quarter plate of slab of chicken breast with blueberries and goat cheese on it. So frustrating.\n\nI went to Japan last year and honestly, didn't understand why people were so into ramen. Some ramen in the Kyoto train station turned me on to it and I've been looking for good ramen ever since. Now, I'm not necessarily saying this was Japan-level ramen because what do I know about that? But it was downright delicious and definitely worth your time. Love you, Fumi!", "author": "Sarz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Saturday night dinner time, walking down a crowded Mission street into this cosy little place, completely transformed from the old donut shop.  The menu is katsu and curry with either rice or noodles, and whole crab done a few different ways.  They don't serve alcohol, but I overhead them saying you can bring your own.  I got a nice pot of Gen Mai cha for $1!  We split the chicken katsu with rice and curry and splurged in a whole crab with garlic and basil.  The katsu was crispy and perfectly done, not greasy.  Curry sauce was tasty, but you have to like Japanese curry which is a whole different animal from Thai or indian.  More like a curry gravy.  \nThe crab was pretty decent, and a fun way to spend an hour leisurely picking and slurping.  It wasn't the most amazing crab experience, but well priced for off season, and tasty.  Service was extremely warm and friendly and everyone around us seemed to be also enjoying their food. As a side note they have several kids meals that look good for $6.  A solid addition to the neighborhood.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "I went here for lunch the other day and was pleasantly surprised. It's mainly a curry place, but they do have some crab and noodles if that's what you're into.\n\nI ordered the chicken katsu with curry over rice which was good. The chicken katsu was perfect so I was pleased. I ordered \"spicy curry\" which I didn't think was very spicy at all, maybe my spice level is a lot stronger than most. The actual curry flavor i thought was a bit vinegary.\n\nMy biggest con was that the curry got cold quick, and the worst thing in the world is cold curry. With that said, I'm not sure what the restaurant could do besides serve burning hot curry. D ordered curry on a hot plate instead which was curry rice with egg over a hot plate. The hot plate kept the curry hot throughout the menu, would definitely get that instead next time.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "As a vegetarian I have found it difficult to find a ramen place that has fried tofu (I am not a fan of raw tofu) so I was extremely happy to find this place and to find that they also have a curry option for broth. I got the every green noodle with curry and I am in love! I will definitely be going back here to satisfy my ramen craving! \n\nI also tried the matcha mochi ice cream and it was amazing!", "author": "Carissa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "The best ramen broth... I tried ramen for the first time here, it ruined me for anywhere else! Both the curry and tonkotsu broths are amazing. I crave this curry ramen all the time. They play classic bossa nova music too, love it!", "author": "Eva D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "I had never really been exposed to Japanese style curry until my friend took me here. he was in the states for a few months from Japan and told me of all the places he had been in SF, this was definitely the most authentic and made him feel a little less homesick. \n\nwell, I can say that I loveddd the food here! it's really fresh and served STEAMING hot. if you don't like spicy food I would recommend getting your spiciness as mild. i would consider my own heat tolerance pretty high and the medium is more than enough for me.", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "Ramen is good here as is the hamburger steak. Skip the desserts, seems store bought (Costco frozen cheesecake?) if you can handle spicy, don't even other with the mild.", "author": "Long C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "We came here on a Sunday afternoon and it was surprisingly quiet since the food was pretty good!  We tried the curry ramen with pork katsu and the tonkatsu ramen with chicken katsu.  Both types of katsu were fried well- not too greasy and nice and crispy.  The curry ramen was good and not overly rich and heavy as other places I've tried.  The tonkatsu broth was also light, but still rich in flavor.  If you prefer heavier, fatty tonkatsu broth, you might not appreciate this style as much, but I did think the pork and garlic flavor was still pretty good!\n\nWe'd definitely go back to try their curry teppan dish, which they're supposed to be well known for.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Had a good experience here couple days go.  Place was clean, service was fast, and the food was pretty good!  \n\nI liked the garlic flavored edamame and clam in sake sauce, both I would recommend since I haven't had those else where\n\nParking could be a problem, and right now space is limited (place was packed most of the time when I was there on a Wednesday at 7pm).", "author": "Bo Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "I ordered the Chicken Katsu ramen curry and it was really tasty. Ramen noodles with curry instead of broth and the chicken on top. Paired with a house-made Thai iced tea and some green tea ice cream at the end. Delicious! \n\nFood came out quick, the wait staff was exceptionally nice and attentive and the location is spot on. A wonderful addition to the neighborhood!", "author": "K. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "I have been on a ramen kick so have been checking out as many places as possible, especially in my neighborhood, and I have to say this place has grown on me. To be fair, it was great the first time I went, but my ramen quest started after an exceptional broth and noodle experience in San Jose so I am a tough cookie. I did the standard tonkotsu ramen and it was delicious, but not noteworthy. I then did the curry ramen with pork katsu and it is definitely noteworthy. I have to say though, and this is a huge compliment, that I can never finish a portion and the leftovers taste even better. I am a fan from the noodles to the broth. Have been back and will continue to be a patron.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Came here on a Friday night and there was no wait (they had a few empty tables that filled up by the time we left), and was pleasantly surprised. Fast service and very attentive. I ordered a spicy curry ramen with pork katsu - the soup was like a thinner version of their curry and the katsu was lightly fried and juicy. Would definitely come again for a quick bite.", "author": "Ada C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "I've gotten ramen a couple times, always to go. \nI'm no expert, but it's tasty to me, and they're quick and polite.", "author": "Charlie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "The vegan everything green with gobo ramen is so good! Will come back and try the vegan rice plate curry.", "author": "Joshehann W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Fumi is by far the best Noodle place ever! My stomach melts and my tongue sizzles with each bit. Haha I'm serous that's how delicious it is. Max and the staff are awesome! I've gone almost since I heard of them over a year ago and recommend all my coworkers and friends to it as well. I'm just hoping and praying they open a Fumi in the East Bay. Maybe call it 'Fumi Twice'", "author": "Susanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "Do not get their sashimi/nigiri! It's not very good, bland, not tasty, and seems like its basically just old frozen fish. I got the 12-piece for $26, tasted pretty bad, that I didn't really want to eat it. The other people in my group ordered curry rice, and seemed happy with it.", "author": "Geobio B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-08", "description": "My boyfriend and I went here on the recommendation of a friend who said the curry was delicious. And it was! I got the vegan chicken katsu curry and boyfriend got the pork katsu curry. We both really liked our meals. My only complaint is the wait staff. I asked the waitress if they made their vegan chicken in house and I was also curious to know generally what was in this fake chicken. Before I could even ask about what was in it..she cut me off and told me \"I don't make the food so I don't know.\" And legit..somewhat ran away from me after giving me that terrible answer (and we went on a weekday when the restaurant wasn't very busy). ok....what if one of your customers had a severe allergy to something? To be clear, I don't but a lot of people do. Another waitress told me the curry was vegetarian but I'm not sure if I have that much confidence in anything they say now. I believe the wait staff should be familiar with the menu as well as the chefs. As someone who has some restraints with my diet, I appreciate when the wait staff is knowledgeable because it shows that they actually care about their customers. But..the food is tasty so I'm torn.", "author": "Margaret Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-06", "description": "So much for National Noodle Day! Worst ramen ever. Completely flavorless! The Top Ramen packages are 10X better. Save yourself the money (and the calories)...go to Coco Ramen instead, if you're in this neck of the woods.\n\n(10/18/16: There's no place to publicly respond to the owner's comment, so I'm posting it below)\n\nHi Max, Thank you for your response. I can be more specific if you'd like. First off, the only reason why my cousin and I chose to try this place was because the name of the restaurant on Yelp is \"Fumi Japanese Curry & Ramen.\" We found this to be misleading because the name outside the actual restaurant is \"Fumi Japanese Curry & Seafood.\" Anyway, we both ordered the Chicken Katsu Ramen, hers was spicy and mine was mild. The broth was so flavorless, we could (not) even finish half of it. It tasted like water. The chicken katsu was pretty bland and dry, too. It was also a little disappointing that some of the items that are normally standard at other ramen places, like the brown egg, are an additional charge at Fumi. Again, had we known that ramen is not a specialty at your restaurant, we wouldn't have ordered it. Hope this message is more thorough.\n\nCindy", "author": "Cindy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "The space is new and clean, but the dining area is fairly small.  The kitchen appears to be twice as big.  I wouldn't come with a group larger than 4.\n\nI've dined in and gotten take out, and the food has been consistent so far.  The takeout order of curry with fried shrimp seemed massive to me.  The teppan hamburger curry was tasty but the sauce was thicker than I prefer. Tintin liked the curry ramen.\n\nService was good and prices were average for the area.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "First visit. Great service, lovely decor. Seating is a bit crowded -- this place is very popular. We arrived shortly after opening and the front room was already full. By the time we left, it was packed. We ordered the large sashimi platter; portions were generous, incredibly fresh. We each had a ramen bowl with pork; both the cutlet and the roast pork were great. We will be repeat diners!", "author": "S R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Okay... so SURE the other items on the menu are good, but I'm just going to save you some time looking at the menu. You really only have one option.. the Teppan Curry. Actually, there are 5 or so meat options, so I guess you have a few. But for realz, Japanese curry over crispy rice, meat and egg on a sizzling hot plate. No joke, I've been here 5 times this month. AND 5 people responded to my Snapchat because it looked so good. Score!", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-30", "description": "Oh we were so hopeful. 6:15 arrival on A Saturday night with a party of seven. We were the only ones in the restaurant and they started to fill up after we were seated. First of all they charge you a dollar 50 for a tiny cup of tea which is typically complementary everywhere else. Server eventually  brought a teapot so that the 6 of us could have refills. Staff was very nice. Our order was taken and then we waited. We received 3 appetizers in a timely manner. Yakitori, hamachi Kama and salmon sashimi with \"salad\". 3 yakitori skewers. Two takoyaki and a Kobe sausage. The octopus the was very hard and the sausage and was equivalent to three anorexic little smokies. Exact same flavor. \n\nSalmon sashimi $12 for 5 pieces and garnish!! Expensive!! And Just ok. Then we waited and everyone around us was being served. We inquired and they said soon. Other people getting food but not us. 7:20 and our 4 kids are crumpled and starving. We ask for the bill. They beg us to stay and apologize profusely. they admit there was a screw up food coming soon. We try to leave and they promise it's coming. They stated they were new, there was a mistake with the order and the food was almost ready. The server was very apologetic and genuine. She tried to explain to the kitchen why we're leaving and they argued with her. She was caught in the middle. We agreed to wait and within a few mins the food came... But food was wrong. Sent it back and just asked for the bill. They promised a discount and could we please wait. They were so kind but kindness only goes so far. Food came back correct but so bland and portions for the ramen were so small. We left hungry. The bill came and the discount they offered covered the tip. They are very nice but have so much to work on. Wish them the best of luck but we won't be back. Sorry no pictures. Wasn't worth it.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "The Curry is just as fire as Stephen. Both in spice and in goodness. You feel me?!!!!!!! Fumi Japanese is a spot hidden in your belly. It's the urge that tells you, \"Hey bud, I think it's time we get some great Ramen or Curry. Fumi?\" Me to belly: \"Fumi!!!!!!\"", "author": "CJ A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "After seeing a snap of the sizzling teppan curry we had to try it. We wanted to try different things so my wife order the Pork Katsu Teppan Curry & I tried the Soft Shell Crab Ramen. While I did enjoy both, I would definitely give the edge to the curry. The katsu was nice and crunchy...until I sauced it with the curry! The ramen broth and noodles were good as well, although I didn't care too much for the soft shell crab (surprisingly). While not a large restaurant, we didn't have to wait very long to be seated and once we were the service staff was excellent.", "author": "Ritz D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Been a regular since this place started. Love the friendly staff and enjoy my staple order of Fish Katsu Teppan Curry.", "author": "Ali Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "It's hard to find ramen that mimics the taste of the ramen you can only find in the small hole in the wall ramen shops in the heart of Shinjuku, but THIS was it! Kind and fast service was appreciated. I ordered the Every Green Curry Ramen and there were so many layers of flavor, it was delicious. The tofu was the perfect texture and the spice was perfect. Definitely coming back :)", "author": "Nai M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-24", "description": "I tried twice in past 3 weeks and food was okay and price were too high. My friend and I spent $90.00 for Dinner with one bottle of beer. Service was very slow", "author": "JJ w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "My first ramen experience was at Fumi's. While I ordered the chicken, the pork ones ordered with the ramen and the udon were simply superb. the experience was wonderful with the staff being helpful and efficient. \n\nThe ramen, being my first time, I had not benchmark to compare it against, but being the first experience it has created a very high bar for other ramen :). They have an interesting collection of ramen, burger and curry and sake. They also had some really nice green tea. \n\nThe restaurant was neat and the open kitchen allowed one to see the cooking of the food. Yet, it was nice not to have the smells of the kitchen come into the restaurant area.\n \nWhat was pleasant was that after we finished our dinner and were enjoying our sake, the staff were in no hurry to see us out of the door and actually said \"enjoy your drink\". \n\nI'm a fan and will visit again! \n\nService - 5/5\nAmbience- 4/5\nValue for Money - 4/5\nVisit again - 5/5\nRecommend to a friend - 5/5\nOverall - 4.5/5", "author": "Madan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "My friend and I get Fumi every Sunday night. She always gets the Katsu Chicken Curry Rice and I usually get the Katsu Chicken Ramen (Curry Flavor). It always hits the spot, and we're always looking forward to it each week. Do yourself a favor and go check this place out, definitely get something with the curry sauce in it, or just get the sauce on the side.", "author": "Charlie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "How does a curry restaurant run out of rice at 630P? 4 of our party of 6 were served their entrees while the other 2 were told if they wanted to eat now with the rest of the group, they'd have to switch to brown rice; they didn't really have an option. We ordered a bottle of sake and as it was a rainy night in San Francisco, asked for a recommendation for a warm sake. Our bottle was brought out with half the sake warmed in ceramic sake bottles. \"Let me know when you are ready for the 2nd half of the bottle, and we will warm it, too, \" said our server. When we were ready for the 2nd half, after asking 4 times, it finally arrived when we were almost finished with our meal. \"I forgot about it and left it in the microwave\" was the response.  Food was decent but the service, haphazard at best.", "author": "Rich S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "This review is for the Japanese curry. My favorite Ramen place (coco's) is up the street and so I pass by Fumi all the time. And one day decided to poke my head in. And was astonished at how good the curry was.", "author": "Collen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "I came here with a friend of mine on a Friday night around 8:30p. it was pretty empty inside with just 2-3 tables filled, so we were seated pretty quickly. I got the curry ramen with chicken katsu (extra spicy), while my friend got tonkatsu ramen with chicken katsu (spicy). \n\nwhile noodles and chicken katsu were good, the curry \"soup\" (more like sauce) was hella heavy so I felt like I was eating like a lo mein kinda dish. I was bit disappointed in the amount of vegetables given also because it seemed like it was just a dash of everything. \n\nspice-wise, my friend and I were underwhelmed. we were both kinda like \"I thought we said spicy or extra spicy...\" I added the red spicy powder that they have on each table, which helped a little, but I wish it had been extra spicy like mentioned on the menu.", "author": "Victoria N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "Decided to try this place out since it replaced what used to be Eagle Donuts.  Came here around 7 and the place wasn't packed but it had people inside. It's pretty small inside, fits about 20ish people I want to say. The remodel wasn't bad, compared to what it used to look like. Anyway, onto the food.\n\nShared the chicken karage. The karage wasn't bad, was actually probably my favorite dish of the meal. Hot, moist, and flavorful... yum. Shared the pork katsu curry over rice, medium spicy. The curry wasn't flavorful, but it wasn't completely bland. It needed more curry to flavor everything, especially since you're eating it with rice. If you eat it with the rice, you lose the curry flavor. The pork katsu wasn't bad, crispy and was pretty flavorful. We also got the beef curry over noodles. The curry sauce was pretty bland with the noodles. It was pretty bland when I just slurped the curry sauce too. Some of the beef pieces were tender while others were chewy... I'm not sure how that happened. Both the spiciness levels need to be worked on too... there was no kick to it either. We even ordered a very spicy curry over rice for someone to go and they said the very spicy wasn't even spicy! So either they forgot to add the spice or they need to add more! Overall, the curry here was... average. Kind of runny, which probably explains why the sauce is bland. I'm probably happy with making curry at home out of a box. Maybe it was grand opening jitters... but I think they can definitely improve the flavor for the curry. Service is pretty good, place is clean, and parking can be a hit or miss in the area.", "author": "Johnson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "I love this place! Reminds me of Japan, all the decor is very modern and elegant and the workers are very nice and polite. I got the tender beef curry ramen and tried a bit of the chicken katsu rice plate and both were delicious. The spicy level was perfect and all the meat was cooked really well. Highly recommend :)", "author": "Angela K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Came here on a Friday night around 7:30, and surprisingly it was half empty. I ordered the Chicken Katsu Udon an and it was really good. The server was also extremely friendly.", "author": "Guorui W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "This place is the best! The teppan curry is out of this world. Some of the best ramen I've had in the city. The waitstaff is always very friendly and attentive. Can't say enough good things about Fumi!", "author": "Eric D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "Curry is authentic. Waitress is super sweet. One drawback is the background song. It is so sleepy. Would recommend the place to change the song:)", "author": "Aim-on S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "This is a cool little spot, very nice inside and very great customer service. Love coming here during my lunch breaks", "author": "Mona Lisa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-03", "description": "Ed U. sums up the curry review well.  Hubs and I were excited about this place opening. Not having to go to Japantow made me hopeful. \n\nThe clam miso was terrible. No dashi, just hard boiled miso. It shouldn't look like it's going to be gritty. Overcooked, chewy clam. I only ate one and was proud of myself for not spitting it out. \n\nThe curry was decent but nothing I'd pay for again. The pork katsu was bland, pounded flat and not crunchy.  The curry tasted like they made it with a curry block (not a particularly good brand).  It had the spice flavors but no umani or the hint of sweetness you expect with Japanese curry.  I'm pretty sure I make a better katsu curry so I guess I'm eating at home the next time I want Japanese curry.", "author": "Mona M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Service was super fast and the waitress came by to pour more beer and sake for us every once in a while. The tonkotsu broth wasn't aggressively thick which was nice, and the noodles were delicious. The calamari was a little under salted but the sauces on the table helped that.", "author": "Maureen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "The food here is tasty!  My friend and I shared a mixed green salad and the spring rolls to start...  I had the seaweed salad and pork katsu udon (she had the seafood udon).  YUM!!  The matcha cheesecake was delicious, too.  The decor is very nice and the ambience is super relaxing.  The owner Max is very friendly and always has a smile on his face.  Our server (I didn't catch his name) was very attentive, pre-bussing our plates and kept our water glasses full.  There is a back room for larger groups/private parties.  A delightful experience.  I definitely recommend this place and will be back.  :)", "author": "Alisha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-24", "description": "The server was lovely and extremely attentive. She worked that dining room with elegance and grace. The hygiene of the place was outstanding. The Kirin was cold and they have the large bottles. The curry, I ordered extra spicy, wasn't as spicy as I prefer. No shakers of spice-it-up on the table. The katsu pork was as one would expect from the photos, not authentic. But the server was really lovely.", "author": "Stanley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Nice service, good food. Their chashu is nicely crunchy along the edge but soft on the inside. Their eggs can softboiled as well. Their spicy level is a bit safe; I ordered a Very Spicy and it was at most a medium.", "author": "Topher C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-23", "description": "It's a very nice new Japanese restaurant. I'm not a Sushi guy so I ordered the regular Teriyaki Chicken and the appetizer, Shrimp and Vegetable Tempura. The food was very tasty and very nice presentation. However, I dropped two star because after spent almost $20 bill and I was still hungry. The portion was very small.", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "This place is solid and having a solid Japanese curry spot within walking distance of south Noe Valley is a dream come true. I ordered the noodles and curry with tender chicken and a side of veggies and it was everything I wanted in a casual lunch. Ramen noodles were perfectly QQ chewy and the \"spicy\" spice level definitely has a kick. My husband got the mild pork katsu rice plate which came with a little salad on the side. Rice was also perfectly cooked and chewy - pork wasn't blow your mind like what we've had in Japan but it was crispy and tender. Our dishes came within five minutes of ordering which was great because we were so hungry. Service was super polite. Will be back often!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Delicious ramen and delightful ambiance! I wandered into this establishment on a quiet Saturday evening with a party of six, and was immediately seated at a nice table in front. I ordered the pork katsu curry ramen and it was delicious! Tried the gyoza and tempura appetizers as well, which were great. Highly recommended!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "All the products were fresh and the dishes had the warmth of home-made Japanese Curry. The chefs take great care in selecting the best quality ingredients. The restaurant also caters to all tastes, including vegan and vegetarian options. The service is not only prompt, but also friendly, and most importantly, genuine. The flavors and pricing are phenomenal and I recommend this place to everyone I know. I love this place! I go at least 3-4 times per week. I live very close by! Enjoy!", "author": "Joey I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-04", "description": "To be clear, this review is mostly directed at the owner / non-existent management. I've been in the restaurant industry my whole life and have managed multiple restaurants. I never leave 1 star reviews when it's not warranted. Here's the breakdown:\n\nLet's start with the good. Food: good.  If you are deciding to eat here based on the food, go for it! I honestly liked the quality and taste of the food. \n\nService: Good-bad..or gbad. \n\nLet's start with the good: Their attentiveness was great (we were one of two tables in the restaurant). \n\nThe bad: And this may not be their fault, but they apparently have no authority to replace wrong items. When ordering ramen you pick the soup base, ingredients, then order the spicy level. I ordered curry, pork, then spicy. The thing is they have 2 types of pork - Chashu or Pork katsu aka Tonkatsu pork. This may have been an oversight on my end by not specifying which one. However, the server did not ask clarification but rather assumed which one I wanted. Fair mistake on both our parts, fine. So out comes the order. As you can guess, it was the wrong pork. I politely said it was the incorrect one, can I please get the correct pork. The server responded that they could add the Chashu (for an additional charge). I said \"no, sorry, this is not what I wanted.\" They refused to replace the pork. I then asked to speak to a manager. Their response, \"We do not have a manager here.\" \nI replied \"Okayyy.. Can I speak to the owner?\" \n\"Sorry, the owner is on vacation.\"\n\nI seriously have never experienced this in my life. If a customer ever came to me and said, \"this is not what I ordered,\" I would immediately replace it, no questions asked. I have advised my staff to do this immediately if this were to happen to any customer. Sure, sometimes it's the customer's fault... SO WHAT!! You replace it!  You replace it to keep your customer happy so that they return!\n\nSo basically they refused to replace the pork, no manager or owner there to correct this or try to amend the issue, the servers have no authority (apparently) to correct this mistake, and really, this would have been the easiest thing to fix. \n\nThere's more details to the story but for the sake of not writing a novel, these were the cliffnotes. Honestly, please get a manager and have that manager present at the restaurant and/or properly train your staff to deal with these situations.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Hamburger curry rice is really good. My son likes his teriyaki as well. Everything is fresh and authentic!! Good family restaurant.", "author": "Fion S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Came here for dinner on a Saturday night, there was no wait. I ordered their curry ramen and it was amazinggggg. I really like thick creamy broths, so the thickness from the curry was just perfect! I think I got the chicken katsu as the meat option.. it was either that or pork katsu... Which ever it was, it was perfectly done. YUM! Also, staff was very attentive and friendly, that's always a plus.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "New favorite place in the world. Get the Hamburger Teppan Curry, amazing.  And curry ramen... What?!  So good.", "author": "Bernard W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "I love the curey here. I think it's one of the better places for curry outside of Japan", "author": "Deepankar K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Really fantastic curry. Great drink selection (loved the iced milk tea), nice environment, the food is spectacular.", "author": "James M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-14", "description": "A new ramen and curry restaurant appeared in our neighborhood, so we have been wanting to check it out. Our backgrounds are Asian American with ancestry in China and Japan, FWIW. I saw the softshell crab ramen on the menu and had to try. It is hard to find softshell crab, and it is a delicacy where I am from. Others in my group ordered curry rice and tonkotsu ramen. The restaurant is nicely appointed, modern trendy vibe, pan Asian, but not Japanese. Service was prompt and courteous. Dishes looked beautifully presented and in a manner that we usually see when we go to Japan (no piles of raw greens or veggies that don't historically exist in Asia such as tomato!). My softshell ramen seemed tasteless. The broth was soy sauce based ('shoyu ramen'). I couldn't quite figure out what was missing. It was salted well enough, but it was as though some ingredient were missing (MSG? kelp? No idea). the softshell crab was crispy, but also tasteless. I sampled a bit of everyone's fare, too. Curry rice was ok, with a hint of heat, but it tasted like the kind that comes out of the box--something I could easily whip up myself. For those with food allergies, the server did mention that the curry mix included peanut powder, so maybe those with peanut allergies should take heed. The tonkotsu ramen was also flavorless, even though the broth had the right milky consistency. The tonkatsu was served on the side, which is a good thing when they do that, because the tonkatsu (the fried pork cutlet, not to be confused with tonKOtsu, the pork broth in which the ramen is served) gets soggy if served on top of the ramen and the eater is slow. Oh, and I got the runs a few hours after I left, although my dining partenrs were fine, so I don't think I will be ordering the softshell again.", "author": "和子"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "I just went there with my girlfriend tonight, I've tried curry noodle! It's so dame good! My girlfriend order pork katsu curry on special tappan, I like curry, especially japanese curry. But this place I give them 5 star cause their food is good and services friendly with impartial price. Will be back,", "author": "Louis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "THIS PLACE GIVES ME LIFE!!! The service was excellent! Everyone was so sweet and attentive! The Ramen here was everything I've been looking for in San Francisco!! So amazing, I will absolutely be back here over and over again!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "Pork Katsu Teppan w/ curry sauce was delicious! I will come back here to try other menus.", "author": "EunJoo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-08", "description": "This is a good way to get some Japanese style curry. I wonder where the cook learned how to make this or if it comes from a curry mix.", "author": "tomohisa w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "I was looking for a tonkatsu ramen place, but stumbled upon Fumi Japanese Curry House. I've never had Japanese curry ramen before but it was delicious. I'm not a big curry fan, but Japanese curry has fewer spices making it less offensive to my palate. I ordered the pork katsu ramen. The pork cutlet was nicely breaded and very flavorful on its own. My only complaint is that the curry broth was high in sodium. Less salt, please.", "author": "Howard H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Ordered both a curry plate and Ramen and they were amazing. I lived in Japan for 4 years and can honestly say this is the closest Ramen bowl I have had that taste authentic in the city.  Very delicious curry as well with a great presentation. The staff were amazing. They delivered our food within a reasonable time despite it being busy. The restaurant is clean and the prices are reasonable. It's 11 dollar for a Ramen bowl vice the usual 12 or 13 other restaurants charge.  DEFINITELY GIVE THIS PLACE A TRY!", "author": "John U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Convinient location, modern clean restaurant. I came here with a group of friends. I was glad they were not busy because i was very very hungry. I ordered ramen curry with chicken katsu - just the right amount spice and flavor. My friend ordered chicken teriaky and spring rolls, he was ok with his food, said nothing spectacular. Staff is pretty helpful, casual atmosphere, and pretty good food that is not expensive - i will come back here again to try other items on the menu.", "author": "Brook R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "Very nice curry. probably 1st or 2nd best in SF.  Japanese curry is not only one kind, Kuro curry, and other special curry.  I recommend this place for Japanese curry fun. it was so delicious.!", "author": "Elli S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Best meal I have had in a long time.  Vegetarian curry ramen was so good I cant stop thinking about it.  Garlic edamame was also fantastic.", "author": "Debra T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "This place was amazing. It was the best chicken katsu I've had so far. It was small and cozy, and the service was very friendly! \nDefinitely recommend!", "author": "Atzay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Really liked the chicken katsu, very crisp with good quality meat, and curry was yummy. Curried chicken was tasty. Kid's meal is a fantastic deal, with fruit, rice, protein, and salad. Curry fried rice was just ok, a little bland. Have to take down one star for service (fast and friendly, but server forgot things or they were out), but I'm hopeful that'll improve. Many restaurants have uneven service their first few weeks as they work out kinks in their processes. I've been twice and hope to go again soon.", "author": "Jen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "The ramen here is excellent. Also tried their pork katsu teppan curry and would recommend it.", "author": "Suraj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "The big question in my mind was, of course, how this would stack up to Muracci's. Not quite, but very close and close enough to nail four stars.\n\nOf course I had the curry. They have two vegetarian curries in addition to several with meat,  fish, or seafood. I ordered spicy, which I expected to be medium given the choices of mild, spicy, and extra spicy, and it was, about similar to Muracci's medium. The \"every green\" has tofu, carrots and broccoli. The default is fried tofu. I asked for un-fried and that's what they did and it was good. Nice they have a brown rice option, too. I'll be back to try the vegan chicken (gobo root). And curious about the curry noodles as well. Anyway, the curry sauce was good enough that I soaked up the generous portion with the remaining rice.\n\nThe one fish item was deep fried. It would be nice if they had a grilled option for the curry, though it looks like they have that in the teriyaki version. I'll ask next time.\n\nAlso got a side of steamed veggies, which was mostly broccoli and pleasantly al dente.\n\nThe print on the menu is small, so if you need reading glasses, bring 'em along. They also have a blown-up menu without pix in the front window before you enter.\n\nDo let them know if you want the curry sauce vegan if you're not getting the vegan curry.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "We ordered the veggie ramen, pork katsu and a kids meal. We ordered spicy and everything had a lot of flavor. The service was wonderful too. I think this is better than Muracci's downtown.", "author": "Jesse W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "Quite underwhelming. Mediocre noodles and rice. Curry was lacking flavor. Service felt rushed at times", "author": "James K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-20", "description": "Don't get the sashimi here. It cost me $26 for 10 pieces of Sake. The curry is pretty good and worth the price.", "author": "Ruha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "I'm not a huge fan of curry but all my roommates wanted to go. It's DELICIOUS. The chicken katsu curry was really good. We also got it with the ramen noodles and it was surprisingly good. Decor is clean, service was really nice, would definitely go back again.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "Yummy Japanese place that specializes in curry. Although the katsu curry rice dishes are great, consider trying the curry udon- really warming and hearty! Service is good although the location is sort of out there (unless you live in the deep Mission)", "author": "J L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "Solidly OK Japanese curry. Definitely satisfies my craving when I want some Katsu curry, but it's nothing special. The curry is a little on the looser (more watery) side, but the flavors are there. The pork katsu is good though.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "I had the hamburger and egg sizzling curry plate, and it was GREAT. I'm usually not that into hamburger, but this one was excellently flavored. In SF there's few Japanese curry options, so I'm happy this place opened up!", "author": "Brian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "Service and food were both good. Worth a try. I went there for curry pork katsu over rice, pumpkin soup and Asian crab salad. They have different spicy levels, so if you want to try other level of spiceness.", "author": "A C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "I have to say this is a welcome addition to the neighborhood. Never had Japanese curry before and it was surprisingly good. Not that I expected it to be bad, but in my mind curry is a little played out and is sometimes a miss. Fumi, on the other hand is worth a try! Their curry is rich and complex and the right amount of spicy. I ordered the curry with vegetables and tofu over noodles and it was the perfect solo dinner. The restaurant is warm and inviting and the service was efficient and polite.", "author": "Leslie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "The pork katsu was on point. Good atmosphere and friendly/attentive service - worth a stop if you're craving Japanese curry.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-20", "description": "$2.50 for iced down tea with NO FREE REFILL! Tender Chicken Curry had something they tried to pass off as chicken. It was slimy, fatty & some pieces couldn't be cut. Awful, will never go back there.", "author": "Claire B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Stumbled upon this place one Sunday evening. We got the back area to ourselves. The staff are very friendly! The food is tasty!", "author": "Joseph P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Loved it! Got the pork curry. The rice was perfect and everything tasted great. Will definitely be coming back!", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "A lovely coworker suggested this place, and I'm glad I went.  Mind you, I haven't been to Japan (not yet), so I don't know what I'm missing.   I had the ramen with curry (spicy) with chicken katsu, and it was delish!  I found the restaurant to be rather charming too.  Give this place a try! :)", "author": "Adisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Seafood noodle curry and Thai ice tea hit the spot for a casual lunch. Nice addition to the neighborhood.", "author": "Adrian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Super-friendly, tasty neighborhood Japanese place. We tried a noodle curry dish, sashimi, and a kids' meal, and all were delicious. The service was fantastic. We brought two little kids, and the staff seemed legitimately happy to take care of them. Very fair prices too, like $10 for chicken katsu curry noodles in broth.", "author": "John Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "my boo thang  got the curry beef ramen noodle. nasty he says. i got the udon noot curry with beef. gross. It tastes like a gas station meal. My boo thang asked for beef with no fat. he got nothing but fatty pieces. curry sauce itself saves the whole meal. they need to shut down the resturant and use the remaining investment into bottling and selling sauce it would make the more money than the mediocre dishes they serve, he says \"im over it\" as he closes the box.", "author": "Chenea P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "we tried this place for lunch and were underwhelmed\ni has the curry soup with seafood which and although it had several clams there wasn't much of anything else. the curry tasted just ok - i asked for mine hot and it was but very little flavor.  also they didn't offer any thing to wipe my fingers with not even more napkins and after opening the clams m\ny hands were a wet mess. the other order was the same only with steak which was tender according to my wife but we probably won't be going back. we really wanted the place to be good since it was so different from the other great japanese restaurants in bernal heights - but it was just so so.", "author": "jaime r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Great customer service. Food was delicious. Curry was amazing. I had the pork katsu yeppen and it was fantastic.", "author": "Grumps H."}
