{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "I absolutely love this place! I live a few blocks away and come in here a for coffee and breakfast sandwiches (ham and cheese is my fav!). The decor is quirky but incredibly charming. The baristas are so sweet and always greet customers with a smile. I am so glad this place is in my neighborhood! \n\nThe only thing to note is that it is cash only, but they have lots of signs warning you and an ATM to make it easy to make a purchase.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "This review is a long time coming. I live a block away and even in coffee desperation I try not to come here because it is THE WORST. Here's some of the top issues \n\n* The coffee tastes burnt and always gross. \n*They don't take credit cards, the ATM in the corner never works and wastes your time with stupid signs written on it \"if it doesn't work, try it again\". Are you kidding me? Take my credit card like every other establishment in 2018. At the very least, have an ATM machine that works. \n* the staff is always rude. Always. \n* I was the only person in there once and they made me move tables cause I was at a no laptop table. I'm not exaggerating... I was the only human inside. \n\nI ain't no snob, but I do expect more than this half assed and poorly executed shop with mean staff and nasty coffee.", "author": "Jeannine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "CASH ONLY!! \n\nStopped by for a coffee. Cute quirky interior, discourages use of laptop. Lots of boardgames and toys for lil kids. \n\nAmericano was great.", "author": "RachEl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Local corner coffee house.  Family owned business which I love to support . They have pastry and breakfast sandwiches along with salads and also vegetarian sandwiches as well.  Place is filled with people who live in the neighborhood or tourist stopping by the cable car museum.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-07", "description": "It's great that they provide WiFi and plenty of outlet. However, it's a \"cash-only\" store! And the coffee wasn't that good to be honest...If you don't mind and just need a place to work, it's not a bad choice.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "This is one of the best-looking coffee places I have been in. The coffee is good and the staff is really friendly. It is also very cozy and friendly for computer users. But if you don't want to use a computer you can socialize, with playing board games or do some other things that they offer.", "author": "Špela Š."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "I love coming here and getting my morning coffee fix. The staff are very friendly and they already know my by name! :) love this neighborhood gem.", "author": "Ly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Wow. This place is such a find! Came in hungry with my husband and two small children, and was so impressed with the friendly service, delicious food, and fun kid-friendly atmosphere! This spot obviously caters to the \"big kid\" in all of us, as it's stocked with board games, vintage toys, and fun decor, but the staff welcomed my small active kids and encouraged them to play with the awesome toy trains. This was probably one of the most relaxing meals out we had with our kids during our trip. \n\nWe will definitely visit again!", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Step back in time and enjoy a forgotten era of American history influenced by the age of World War II. Complete with hanging comic books of Amazing superheroes, the music of the Andrew Sisters, Tommy Dorsey, and an antique cafe full of books and other nostalgic memorabilia. It's a true step back to an era where America stood tall, proud and united. A historical vintage television sits im front of a movie screen with a hand taped sign that reads \"Creature Feature Tuesday\" while the San Francisco trolly cars bustle past and rounding the corner just off the cafe entrance. \n\nThe menu caters to all diets. Granola and yogut, egg covered english muffins, drinks, and handsome meals a plenty to offer any patron. \n\nThe aromas pour out the open glass doors towards the Cable Car Museum. Such an amazing little treasure. Easy to miss. So make a point to put the Gallery Cafe on your breakfast /lunch/ brunch must visit list when you visit San Francisco.", "author": "Marc B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "In A Nutshell:\n\n-Stopped by Gallery Cafe during a segway tour of the city.\n-This is a corner shop that is filled w/ nostalgic items like old games, b&w T.V., etc...\n-Just grabbed some cold drinks since it was San Francisco's 10th ever hottest day (100+ degrees).\n\nOverall, nothing too fancy to report about this place, it's an average spot.", "author": "Romeo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Everything under $10! This cafe is sooo cool! It has a friendly, quirky vibe and playful decor. The breakfast bagel and sandwich we tried were very good! We would definitely come here again.\n\nP.S. The cable car museum (free) is right across from the cafe :)", "author": "Cyrina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Great neighborhood spot with a mix of tourists (cable car museum is across the street) and locals. Playful clutter with board games, books, and movie nights. The hot chocolate is a win, the coffee is okay, and the bagel options are delicious.", "author": "Jay K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "I was considering a three star just because my husband ordered an iced coffee and got a hot one lol .. but he said the coffee was still good. I asked for an iced tea and was offered green or black, my green tea was perfect! I don't like sweet things and there was minimal (if any) sugar added, with options to add if I wanted. The atmosphere was great, very low key and relaxed with a fun barrister on the counter. If back in the area I would return. But would confirm my order just in case ;-)", "author": "Sarna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "If you are looking for an interesting coffee shop this is it! I wouldn't come here daily, or maybe I would...? But I definitely felt amused and enjoyed the hour and a half I spent here one afternoon while on a trip to SF. This is unusual to the max! Crazy decor, funny little notes, and no laptop signs on certain tables. Board games for days, unique music, and they have bad yelp reviews hanging in the bathroom! \n\nDon't become a review on the wall of shame y'all! Come enjoy a nice mocha made w Ghirardelli chocolate, play some board games and chat with friends!\n\nImportant: they don't take cards!! Clean bathroom . Oh and across the street is the free admission cable car museum definitely check that out as well!", "author": "Faisal A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-16", "description": "Pricey + Rude people working there . Those Asian ladies are a nightmare to deal with , you gotta go there and ask them for something to know what I am talking about .\n\nIll give you 2 stars just for the creative decoration.", "author": "Martin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Don't be fooled by the \"cool atmosphere\", this place doesn't deserve your business. Why?\n\n- Extremely rude service consistently\n- Doesn't accept credit cards, cash only\n- Way overpriced\n\nToday, I had another terrible interaction with one of their rude baristas. Not coming back.", "author": "Levent S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Great coffee from a staff who is personal and friendly. They remember exactly how I like my cappuccino even though I don't get in very often.\n\nWhat a refreshingly local difference from corporate coffeehouses!\n\nGreat bagels and top quality espresso.", "author": "jack l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "First of all, do not come here underdressed. There is a dapper gentleman named Robert (a regular) that is always dressed \"to the nines.\" Once you see his plethora of stunning outfits, you will be forced to question your own wardrobe, and quite possibly your life. \n\nSecond of all, it's okay to come here underdressed. There is a long-haired fellow that works here that wears \"Lion King\" and \"Superman\" t-shirts, and he's not a child. \n\nThird of all, if you do not have a stellar singing voice, do not come here. There is a cook that has an amazing singing voice and will often belt out tunes (singing along with the music in the cafe) that will make you feel musically and vocally challenged. You'll quite possibly wonder if you truly have any talent at all.\n\nFourth of all, if you are absolutely atrocious at singing, it's okay to come here. The aforementioned long-haired fellow has a singing voice that's worse than you've ever heard. Far worse than even your own. Guaranteed. It may actually be the worst humanity has ever heard, but it does not stop him from utilizing it. I believe he does this to clear the place out when he wants to go home and play video games.\n\nFifth of all, there is what appears to be a nice young woman behind the counter, but do not be fooled. She is a savage, ruthless gambler and will take you for every last penny you have. Be warned.\n\nAll in all, a great place, although they only accept American Express Black Cards and Bitcoin.", "author": "Kurt A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Don't be fooled by Levent S. Or the guy who recently left a one star review. I can attest the baristas are super nice, very polite and have a great sense of humor! I can see how an old man with a stick up his butt could confuse their humor for rudeness but I frequent this cafe and often come to play chess and have a bite to eat or a latte so I'm usually in there for an hour or two at a time and I have never seen a rude interaction between baristas and customers. I hope to see levant's review on the wall 'O shame soon  keep up the good work y'all!", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Wow what a fun quirky place great food and drinks ... Checkout the wall o shame in the bathroom", "author": "Tom I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "My go-to coffee shop for studying. Close but just far enough away from the busy streets of Chinatown. There are plenty of outlets alongside one wall, and they don't kick you out or make you repurchase food/drinks every couple of hours if you're using their wifi (though it would be nice if you did!). It can get noisy with the Cable Car museum right across the street, and with the steady flow of traffic from tourists coming in and out, but this place has solid food, coffee, and I'm a fan of their unique and cool decor. Cash only! ATM machine inside (for a fee).", "author": "Vickie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "This place has a really cool vibe.  Lots if funky stuff along with small jokes...  \n\nThere are tables with poles in the center showing a card :   \" No laptops - conversation table\"\n\nlots of books , games ( saw customer playing chess with barista) , and free New York Times to read ( with note asking you not to steal it)\n\nBut the most important part was coffee was great, food fresh and good, and pretty reasonable.\n\nCASH only - which is common in Chinatown (which this is next to) but ATM right by registrr\n\nAnd the inside decor was probably best I've seen!\n\nNot generic- that's for sure.   Gallery Cafe is across the street from the Cable Car Museum, and it looks like someone who cares decorated it.  Yeah, obligatory trains, but also very cool photos of SFO.\n\nMusic, unusually enough is 'roots' Country.   \n\nI would never mix all these ingredients- which is why I don't own the coolest / best coffee shop I've been in", "author": "Steve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "Food is delicious... a bit pricey for what you get but wonderful atmosphere and amazing customer service!\nLots of fun games for the kids and adults alike to play to pass the time. Also no cell phone and computer rules at the tables! Forcing people to actually interact with one another want to eat! Love it!!!", "author": "L G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Wow! What an incredible place! I felt my inner child come to life as I was surronded by the vintage toys and games. The service was incredible and I had the most delightful cup of cappucino. I highly reccomend this local and unique experience.", "author": "Lizzie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Hidden gem. \n\nMy favorite spot in the city.  Great atmosphere, great food, great beer, great coffee, fun decor, friendly staff, and tons of board games.\n\nThe patrons here always seems super happy.  Its a great coffee shop that you feel like you can just \"hang out\" in.  Reminds me of that coffee shop in Friends, except with a lot of kitsch knick knacks all over the place.  You could call this place hipster, except I haven't really seen many hipsters here.  The Gallery attracts all types: Nob Hill yuppies/techies typing away on their laptops, old friends from Chinatown catching up in Cantonese while sipping a beer, parents who want to grab a coffee while their kids play Connect Four, tourists taking a break after checking out the Cable Car Museum across the street, couples on dates, and even a gang of motorcycle cops!  (There is great people watching outside as well, like the time I saw a tourist try to get a picture ON one of the SFPD motorbikes...)\n\nThey have a bookshelf that you can borrow books from.  I really appreciate this on days that I want to grab a coffee by myself and not get distracted by my phone, like I would at Starbucks or Peet's.  \n\nIf you're here with a friend, they have loads of board games including: Battle Ship, Connect Four, Stratego, Candy Land, and more!  They also have Rubik's Cubes and other puzzles for those flying solo.\n\nBefore getting distracted by games and books, take time to explore the place, there are fun knick knacks everywhere including an old movie projector, an electric train set, and much more. They also have movie nights, which I haven't attended yet, but want to check out.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Had roast beef sandwich.  Great little cafe with a great vibe.  Nice staff and clean restroom.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Holy wow cutest and most creative lil cafe I've ever seen. Not to mention food and drinks are amazing! Recommend the joe sandwich !!", "author": "Chloé B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Yesterday I had the pleasure of stumbling into this gem. We had one day to explore SF and I'm so glad this place made it in the list. Dexter was amazing and made my boyfriend and I feel at home.  Nothing short of chatting with an old friend. \n\nThank you so much for letting us step back in time!", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "This place is hilarious with it's attitude! loved the door o' shame, cubicle and silly talking tables. The latte wasn't anything special but i loved the grilled chicken sandwich on sourdough! \n\nIn general fun atmosphere!", "author": "Kartik T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "This place does not give a $hit about keeping up with the Joneses, and I respect them for that- expect the staff to be a bit gruff with you, the place a bit dingy (or loved, however you want to see), and the menu simple. No iced coffee, but they will pour some hot coffee over ice for you-\n\nIt's also cash only, but there's an ATM on site if you find yourself short of cash.\n\nI imagine this is exactly the type of place where you could become a regular and that the owners would come to your wedding. If you're used to snazzy coffee shops and posh espresso drinks, then this isn't the joint for you.", "author": "Elliott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Found this Great cafe while walking around on a Sunday.\nWith some good beers and a funky eclectic vibe. \nPlus board games available and friendly staff this was a great find", "author": "Chris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-11", "description": "Walked in on a whim with an almost finished $3 iced tea from Starbucks, ordered $9.50 veggie chili, told to take it to go since we had \"outside food\". I was floored. \n\nIf we had stayed to eat, I would have purchased another tea. \n\nRude & money lost for them? Not returning...", "author": "Katie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Excellent Coffee, Fast Service, Good Place To Work/Chill.  The kitchen makes good simple food from a short menu.  I live around the corner and drop by often.  Once a month they play an old movie at the end of the day.  Last night it was the original King Kong, on a movie projector!  I get the impression the owners are not doing this only for the money.. clearly there is an expression of creative energy and passion they have for their cafe.", "author": "M B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Great little place for morning coffee and bagel.  Fresh squeezed oj was yummy, eclectic atmosphere made for a fun experience!", "author": "Laura K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "What an awesome experience we stumbled upon this place on our way to the wharf. We decided that we wanted to have a drink and popped in for someone the prices are amazing for the location. But the best part about it is a customer service and the people working there specifically Dexter. I highly recommend this place if you're in the neighborhood. And sw", "author": "Kerin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Love this place! Stumbled in it on our way to the cable car museum. Very fun relaxed vibe and yummy breakfast!", "author": "Deb S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "My favorite community atmosphere in SF after a year of being here. Leaves behind the sterility of 3rd wave coffeehouses and embraces a personality local to the people who work there. \n\nLove that tuna melt", "author": "Zane J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "Sweet little spot with plenty to look at while sipping my tea. Right across from the Cable Car Museum. Great lunch spot too.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Great local food in an eclectic restaurant! Want wifi? You got it! Want to play board games. Travel no further. Got kids? Perfect spot. Kind owner who takes orders and serves his customer. Right here. Vegetarian? He's got it! He even has a vegan dish that is gluten-free. Need a book to read while eating here? He's got that too! Customers who are kind to you even if they don't speak your language? The atmosphere brings the best out of people here. Great restaurant, owner, atmosphere, and food! It was worth it for us to drop by here as a part of our trip to San Francisco! Before or afterwards, check out the Cable Car Museum right across the crosswalk.", "author": "Nathanial I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "This is my favorite cafe in the city! It's located right across from the cable car museum, so you hear cable cars and wheels and bells outside - very San Francisco and very romantic (in my opinion).\n\nThe cafe itself is really quirky and creative. There are a lot of board games, old toys and odds and ends (like a projector, a typewriter), books, and lots of decorations and posters with funny quotes. They even posted up all the terrible yelp reviews written about them, which was pretty amusing.\n\nThe owners are father and son. Haven't met the father but the son is friendly. It's nice to go to a cafe and talk to the owners - makes it more like something you can only find in the neighborhood!\n\nHave yet to actually try their food. Chai latte wasn't bad - pretty typical. The overall vibe of the place, though, makes it totally awesome for just sitting and chilling in the city.", "author": "Julianna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Cash only. Well known to locals. Encouraging their guest to talk to each other while dining. Lots of table games to play and books to read.  No sport games allowed  on their tv.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Quaint little eclectic old-school SF experience. Typical menu of espresso drinks, breakfast/lunch, and dinner items. Didn't have it, but the Mac & Cheese looks amazing! \n\nI went at a very busy time and my order got lost in the shuffle, which wasn't a big deal. The staff and owner felt so bad, they offered to refund my money, which I didn't accept, so they upgraded my order for free and comp'd my 2nd coffee and a pastry! Truly above and beyond my expectations!\n\nThere's some cute outdoor seating under the trees across from the Cable Car Museum, which is fun to watch the cars roll by from both directions! There's also boardgames and books for available, which great to keep the kids occupied.\n\nI'm a fan!", "author": "Derwood A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "This is a very chill place. Been here a few times for their tuna melt sandwiches and it has never failed to amaze me. I have yet to come here for study purposes, however I feel like this Café  would make a terrific place for it. Seriously though, their tuna melt sandwiches and a cup of coffee during a sunny afternoon is PERFECT!", "author": "Johnny N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Coffee is nothing special, but the place has a nice vibe, staff are cool, and is laptop friendly. There's power strips along the bench on the wall, and wifi speeds were 12d/3u one morning I was there, with a few others scattered throughout also on laptops. Beatles tunes were playing in the background, bonus. Decent spot for the neighborhood!", "author": "Linus W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Super laid back coffee shop located right across the cable car museum. \n\nI come here whenever I am in Chinatown to pick up a decent cup of coffee for an affordable price. \nI usually stick with a small coffee, I love how they have all different choices of milk for free and don't Nickel and dime you if you want some almond milk in your coffee. \n\nThe setup of this shop is a bit weird, it is located on different levels And the cashier is like 1-2 ft lower than you.  They have a lot of books and board games here as well ! \n\nCome here if you're looking to grab a quick cup of joe to go or want to chill before exploring the rest of sf.", "author": "Tiffany Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Came here for breakfast on a sunny Saturday morning. Great choice of food - chose the egg and cheese on a muffin and we had a great cappuccino and the biggest cup of tea. Helpful staff and cool interior with film posters and an old film showing on the TV. A few tables outside too. Will definitely visit again.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Hands-down this is our new favorite café in San Francisco. We came across it during a Sunday walk in Nob Hill. In fact a neighborhood resident on nearby Clay Street suggested we head there when we asked about local spots for casual, healthy food. The BLTA on focaccia and a salad with fresh chicken and a latte -- all for under $20!!! -- lovingly freshly made. Yummers!  Love the signs that indicate where you can sit with your laptop and those tables reserved for chatting. Lively without being loud when we were there, friendly and unhurried service, outdoor seats if we had wanted.  Simple, like home, if you cook healthy. Not precious.", "author": "Joan O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "Advertises fresh coffee but my Americano was worst than Starbucks! Never going back.\n\nThe place was nice, and they had tons of games. It seemed cool, but no no to the coffee quality.", "author": "Liana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "Love this accidental find. Fun and friendly staff. Great kitsch, cold beverages, plenty of power outlets and a real neighborhood feel. We only had tap beers and cold beverages during our hour stay. \n\nWe didn't have anything to eat as they were out of a few things. Could have been more sanitized but one staff member was constantly washing his hands which brought me joy! \n\nThe interior had so many fun things to relax about, old movies, fun games, amusing seating, friendly banter. I will try to come back to this off beat place across from the Cable Car Museum.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Wait Time: 5-10 Minutes for Food. \n\nUnique Factor: 3/5 - Gallery Cafe feels like a time capsule when you walk in. The interior decor is strategically cluttered. Some of their menu items are somewhat random, feels as if the kitchen staff decided they wanted to try a recipe, so they added it to the menu for the day. In a way, that is what makes the cafe feel like home. You can get a panini and a chocolate bomb all at the same place. \n\nService: Friendly Staff, with a lot of local customers. Cash Only.", "author": "Vivian Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "I really really want to love this place, but there are such glaring problems that it's hard to. I live about 30 seconds from this spot, so I've been in a few times over the past few years. I visited again today because I needed to do some work on my laptop, and didn't feel like staring at the usual scenery. \n\nThe Good: \n* The decorations and atmosphere are super cool. There is a large area for books and magazines, creative wall accessories, board games, and I'm pretty sure they screen classic movies on some nights in this little area with couches and movie theater seats.\n* They recently added a \"cubicle simulation\" corner that is slightly separated from the main seating. It's only enough room for 1 person, but it's a cute sectioned off area for someone looking to use their laptop with more privacy. \n* They have a decent amount of outlets and extensions cords for plugging in devices.\n\nThe Bad:\n* The food. The food is incredibly pricey for a café. Yes, even in San Francisco. The breakfast sandwiches are small, and VERY bland. I don't think they use salt or pepper at all. To make the most out of your money, I suggest getting a bagel with cream cheese, as it seems to be the only affordable option in terms of quality and quantity. But get there early, because they only allot a certain amount of bagels per day, and they run out of options quickly.\n* The coffee (depending on who is making it). It's just...not good. I've had drip coffee from here a few times and it's usually very weak. I was surprised when I had an amazing latte from here this morning. The ratio of milk to espresso was perfect, and there was an adequate amount of foam. I decided to get another because the first was so good, but the woman made it this time, and it was really bad. Tasted burnt, and there was no foam at all. Not even a hint. I couldn't finish it. She was pushing out coffee drinks so fast that I doubt anyone had any quality to their coffee order.\n* The \"Cash-Only\" policy. If things weren't so expensive, I could get over this. Can't you install a square reader? Apple pay? It seems that this might be a nod to their attempts at making this spot more nostalgic of older times when stores only accepted cash, but I think they'd get more service and even be able to up-charge more if they offered other ways to pay.\n* Finally, the service. I've had good experiences with the guys here, I'll give them that. They're polite and friendly- what you'd expect from any basic customer service interaction. But when it comes to the ladies who work here, that's another story. I'm not sure what her name is, but there's an older asian woman who dresses with lots of cleavage (totally fine, just not sure how else to describe her). Anyway, she's INCREDIBLY loud. She screams everyones order, it's really alarming. I've also found that she is only nice to the male customers. I've witnessed this more than once while there. She gives the female customers a ton of attitude for no reason, and then openly flirts with the men. I even overheard her today joking with a random guy about how he should have said \"thank you ~princess~\" instead of just thank you. Super weird. She also openly yelled at this younger girl working the register, in front of all of the customers. Just really unprofessional and off-putting.\n\nIt seems that they do try to present this \"hard-ass\", \"dgaf\" attitude on purpose, like it's part of their schtick, but the atmosphere of the place seems oddly contradictory to that kind of demeanor. If this were a café connected to Zietgiest, I'd get it. But it's not. It seems like they really need to re-think their staff, as well as their menu. Focusing on at least putting out good coffee would really be a step-up.\n\nP.S. they print out negative Yelp reviews and tape them to the back of the bathroom door for you to read while using the facilities. So, I'm sure this will be on there at some point. Hi everyone!", "author": "Ally H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "A whimsical little cafe located right across the Cable Car Museum.\n\nAs soon as you walk in, you're greeted with friendly faces, and it's occupied by the local regulars. It's easy to spot the owner's love for comics and monsters with a rendering of Godzilla in downtown NY on the roof of the entrance. There's a book shelf filled with classics donated by the owner, and you can even do a book swap if you're feeling nostalgic.\n\nWhat really did it for me was that this was something unique that you could probably only find in SF. The chicken noodle soup was home-made and outstandingly soulful. Loved every sip of it. If I had space in my belly, I would have ordered a few more helpings. Actually, thinking about it right now, I'm missing it already. \n\nThe service was super friendly and immediately made us feel like we were at home. Definitely will be back... especially for that chicken noodle soup.", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "This place had amazing food and great decor. The walls would be covered in funny signs and pictures. If you looked up you could see fighter planes shooting off rockets with cotton smoke. Besides the decorations the food was great. I had the egg and cheese sandwich on a English muffin. The egg was cooked to perfection and it tasted just right. Overall the Gallery Cafe was a great place to eat.", "author": "Eli B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "Whereas I would describe most cafes in the city to feel modern and new, Gallery Cafe is one I would describe to feel vintage and cozy.\n\nI used to come here on Saturday mornings with my dad when I was working part time for him on the weekends. It always felt comfortable to just sit within this cafe, sipping away at a cup of coffee. There would be other people chatting, reading, on their laptops, and some high school students helping each other out with what I presumed to be SAT prep. It's just like any other cafe, but with a nice vintage look. There's an old TV set in one corner, some record players lying around, a bookshelf of old books, some old artsy photographs of the city, some board games, etc. I just love the feel of this place as it makes me feel calm and as if in a different time. And before I get lost in all this atmosphere talk, the coffee is great too! :D", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "Gallery Cafe is located right across from the Cable Car Museum. If you're around the neighborhood, good spot to grab quick breakfast sandwiches, croissants and bagels.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "Probably the most nostalgic cafe for 90s kids. Cash only, mouse trap, toy train sets, and a plethora of mismatching chairs. Insanely charming spot, and the coffee and food is just fine. Cash only is still a bug for me, though.", "author": "Winston S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Very cool, completely unique spot filled like a museum with eclectic games, records and posters. The owner is very friendly and food well done. If your looking for a completely unique place to visit in SF, wander in here.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "I live and work near by.\nThe new owner is very kind and friendly and has really made the cafe much more friendly.\nI think know the food is way better and my Son really enjoys coming here.he loves there soups..\nI have never been told I can't sit at any particular table with my laptop.They have even stayed open later so I can have a quick beer and a bit to eat when they have already started to turn off the oven.\nI have had nothing but very nice service.\nThank you Gallery Cafe.", "author": "Connie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "Four stars only because my husband did not like his breakfast sandwich. The lady at the front counter was pretty bitchy but I didn't mind it. Even the yelp review they posted on the bathroom door said that service was bitchy! Lol \nThe lattes were phenomenal and the rest of us (three other people) enjoyed our breakfast. We also liked that we were able to play games during our breakfast and hang out without touching our phones!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "Annoyed at their service. Hubby bought a $4 mocha. While he drank it, I fed the baby some bread (admittedly that we bought earlier in the day from another store). The manager came over and asked us to leave because the baby was eating \"outside food\". It's a baby - come on....", "author": "Wendy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "My daughter and I were looking for a coffee and breakfast place while waiting for the Cable Car Museum to open. We found Gallery Cafe right across the street. The menu is simple yet complex. The food is excellent and the decor is eclectic. I appreciated all the power strips under the tables so we could charge our phones. The wall of yelp sham in the bathroom is a hoot! Great place!", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "Rude, cold, uncaring and impersonal service from the lady who takes orders at the register.", "author": "Reena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "My new favorite café! Board games & boardgames! Hot chocolate is a must, the vibe is super chill & the workers are amazingly welcoming/friendly! \n\nI will frequent this cafe on a more consistent basis..", "author": "La Mont D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "It's my 1st time visiting San Francisco and found this gem after visiting the cable car museum.  Small town feel in the big city! Friendly staff,  good coffee, comfy chairs, and cold beer. What more could a person ask for?", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "FOOD:\nArtichoke quiche = yumm hella good  comes with a little salad too \n\nSERVICE\nOrder at counter they bring it out using sailor moon playing cards haha. Downside cash only. \n\n\nATMOSPHERE \nkinda basic but spacious has couches tables outdoor sidewalk seating bar seating handful of boardgames to choose from would be great place to play boardgames gas wine and beer too and good food. If coming in daytime great place to catch a drink or bite and go to the cable car museum right next door!!!! So cool. Also can see and hear the cable cars strolling by on Mason & on Washington. And get to feel like one of the tourists on an adventure in Nob hill central", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-30", "description": "Just a typical non descript café in SF I'd say. Games to pass the time so I suppose they're ok with an extended stay and the usual offerings of a small local coffee joint. Located right across the street from the Cable Car Museum we stopped in for a recharge during our touristy day. I liked the little corner with the projector and the movie theater seats.", "author": "Desmond F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-31", "description": "Quite possibly the worst coffee in the city. Maybe their food is decent but I've never tried it. This spot is right down the street from my friend's apartment and I've grabbed coffee here a few times for convenience but it's never good, tastes like dirt and water, and I keep hoping it improves but it never does.", "author": "Stefany V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "We had the Americano and coffee, my son and I were on vacation and decided to stop here to eat. The food, service and atmosphere was nothing short of superb!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Just across the road from the Cable Car Museum we decided to get an iced tea then stayed for a sandwich. We had a BLT with avocado and a beef on sour dough. Both were very nice. There are plenty of places to sit and books to read. There is even a lounge. The pick of the spots for us was at the window where you can see the cable cars come down Washington or swing into Washington from Mason.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Love spending my WFH days at Gallery Cafe... good coffee, food, atmosphere! I think the talking/computer tables organization is great for those looking to socialize, vs. study or work. \n\nAlso, make sure to check out the hilarious Yelp reviews posted on the bathroom door.... the owner clearly has a great sense of humor. :)", "author": "Patty M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "stopped in on a whim for lunch, wont be back.  \n\n\n(+) \npretty decent roast beef sandwich.\n\n(-)\nhad boba tea drinks with us, the owner/mgr when serving our food says gruffly, \"for future reference we don't allow outside food or drink\". it's not exactly a competing product and we spent 20 bucks there regardless??\n\nnot cheap enough to be cash only, sorry.\n\nsurveillance camera staring me in the face literally 12 inches away from our table. OKAY.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-21", "description": "Four stars for location, three stars for memories, two stars for new customer service.  \n\nThe old owners served mediocrity, but everyone was treated equally.\n\nI came in today to experience huge smile towards another patron before me.  When it was my turn to order, I was greeted with a stiff smile and explanation of my order to confirm whether I knew what I ordered.  \n\nI confirmed my order with an awkward yes (Yes, I can read.  Yes, I know what I ordered.  Yes, I drink dark and strong coffee.).  \n\nIt's sad my old stomping ground has become such an unwelcome place.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "I like the vibe at Gallery Cafe much much more since the new ownership. It's no longer snoozeville. The old-timey & monster sci-fi flair is exploding all up in here. It's super cute. Staff is friendly. I wish the menu had more options and that they stayed opened later.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "Stopped in to purchase a Gatorade and use the restroom :)\n\nItem reasonably priced, restroom clean and roomy - nothing to complain about here. I likes the local art on the walls - and the cappuccino made for the person in front of me looked fantastic!", "author": "Kenneth B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "Pretty solid little cafe.  Over priced for the quantity/quality of the food, but it has lots of window seating, plus outdoor seating, and books to read/games to play while you're there.\n\nAdorable place, good coffee, okay food.  I'd go back if in the area, but not going to rush back.\n\nCash only, too.", "author": "Jes G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "Had a lovely time here eating a breakfast bagel. The place is very adorable and comfy. Would like to play board games at the tables near an antique TV set if I am in the area again -- the day happened to be epic and sunny , very nice and fresh air coming in around us", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Great atmosphere with lots of nic nacks. It's in a classic part of San Francisco's Nob Hill, right across the street from the cable car museum. I am glad there's still places like this in SF.", "author": "Mikee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Nice quiet and cozy cafe to catch up with a friend or to spend an afternoon working. Would recommend. \n\nHighlights: \n- Drinks and food are decently priced\n- Free wifi\n- Quite a number of tables to work on\n- Clean washroom\n- Staff are friendly and helpful (keys to washroom or wifi password)", "author": "Bernard H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "Awesome place - the tables in the windows are perfect if you can get them. Great board game selection though I haven't gotten a chance to play any of them yet.\n\nRight across the street from the Cable Car Museum / operation center - you can actually see the big wheels inside pulling the cables from some of the tables here.", "author": "Ken R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Great coffee and ambience, we didn't have any food but the coffee (latte and Capp) was on point. Loved the old tv playing and the board games. Great little spot to relax in.", "author": "Summer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "This place turned hands in April, and they've made a lot of improvements to give it a great cozy, neighborhood feel with a lot of vintage touches. \n\nNew additions to the menu include soups of the day, sausage cannelloni, eggplant parmesan, and a meatloaf sandwich all at fair prices. I've been told drinks can be made iced too (not sure if this was the case previously).\n\nIt's a great place to unwind and grab a beer to relax and read the newspaper! I like what they've done with the space. Only wish is that it wasn't cash only.", "author": "Denise R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-07", "description": "My friend lives next door to this place, and I've made the mistake of going here twice.\n\nOur first visit, we got the breakfast sandwich and lattes. We asked for no cheese yet both came with it anyway and they wouldn't remake it. I worked in coffee in college, and their espresso and steaming techniques were subpar.\n\nThe first time I thought they were just having an off day and gave them a second chance. Again, the sandwiches came with cheese. I asked for one latte to be made with soy yet it was made with milk. I came back from next door to have it remade, and the barista had an attitude with me. She made it correctly the second time. \n\nIf you want rude, impersonal service with terrible coffee and only passing through as a last resort... Keep passing and go somewhere else. \nThis place is only open as a tourist trap to the cable car museum. If you want real coffee with great service, go anywhere else.", "author": "Mitchell R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "I almost never post reviews but after stumbling on this cafe on a day trip to Nob Hill, I can't help it!  \n\nI showed up with my husband and two young kids (4&6) before going to the cable car museum. The owner was super welcoming, and several customers happily guided my kids through the multitude of treasures and entertainment spread all through the cafe (trains, mini movie projector, old timey phones, etc.). It just had a warm welcoming vibe, completely not touristy, very much a neighborhood feel. And the music was eclectic but fun and conversation-worthy!\n\nThe food was simple but good and well priced. When my daughter rejected the Mac n cheese (because of some cayenne), of course this place had the perfect substitute (edible by child plus not very expensive)-- a bowl of fresh oatmeal wii dried fruit!  Very happy with this find. We'll definitely be back.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "The service / team is always super nice, the place is full of humor and antiquities and the Wifi works well. Add some great sandwiches to the mix and some board games and you have a kickass place to go to.", "author": "Fabien-Pierre N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Nice cafe, good coffee, cool staff.  The music selection will make you want to blow your brains out.  I didn't know it there were that many songs by female vocalists accompanied by wishy washy folk rockers.  3 hours of continuous ear worming, weepy drivel.  My advice, is bring head-phones.", "author": "Bob F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Very cool location, new owners, hugely improved the place. I ordered a breakfast sandwich, and woofed it down. \n\nStaff is very friendly. Lots of tables and and great wifi.\n\nKeep up the good work!", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Loved this place! Stopped in for a coffee break while legging it around San Fran. Lucked out huge! Friendly service. Great coffee. Coolest decor ever. And cool tunes playing all the while.", "author": "Jim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Nice place to go for Saturday morning coffee. Plenty of space to sit. Very comfy seats. Just in front of the building is cable car museum. Nice and friendly staff.", "author": "Veronika J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-15", "description": "Located across the Cable Car museum, this cafe gets a lot of foot traffic from tourists. Casually decorated, I like the spaciousness of the cafe with the big windows facing Mason st. Makes for great time looking out the window while watching the excited tourists riding the cable cars  =)\n\nLunch time called for a healthy grilled chicken wrap on wheat ($7.35)  I had it to go and ate it while roaming around the neighborhood. Nice chunks of grilled chicken breast, lettuce, tomato and cucumber topped with caesar dressing. They went overboard on the dressing, so by the time I was done eating my wrap, my take out bag was also soaked and breaking apart :/\n\nTheir happy hour looks enticing since this area lacks watering holes. Maybe I'll come back for that!", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "The owner/manager who took my order was rude to me and made me feel uncomfortable.  He was hesitant to serve me because the shop was closing in 40 minutes, which I thought was plenty of time. I was going to pay with a credit card, but the woman who takes payments pointed to the \"no cash\" sign and didn't even say anything.  So rude!  I had a roast beef sandwich and a tea, and while the food tasted pretty good, I don't feel like going back again.  They clearly don't want people to work on their laptops, given the \"no laptop\" signs \neverywhere.", "author": "Galina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "I live in North Beach and walk by this cafe daily. This neighborhood bosts so many amazing cafes and places to go! Gallery Cafe has all the looks of a cool spot which is why it is such a shame the owners/managers of the cafe make the cafe uncomfortable for its patrons - in my experience. In general they just seem like rude people. Their few servers have always been nice but not the Woman who takes orders at the register or the Man who works in kitchen and serves. Just this last month I have gone in 3 times.  Each time I was treated incredibly rude by the staff.  Today I ordered a tea and tried to pay with my credit card, the only way in which I could pay! Instead of understanding and being kind, they treated me like I was a criminal and I was aggressivley and rudely told to leave by a man from the kitchen who freaked me out a bit and caused a little scene as I tried to finish out a time sensative task I had started before leaving.  Gallery Cafe is the only 'Cash Only' Coffee Shop/Cafe I know of in North Beach and to make a customer feel bad because of their probable tax fraud is plain and simple - not right.  This place is always filled with tourists as the Trolley Museum is across the street. I honestly think the owners/managers of this cafe know they can get away with being rude,outdated and having bad service because of proximity and tourist demand. I wish the service matched the quirky cool decor of this corner cafe because I would like to hang here myself.  Alas - for me and for anyone visiting looking for authenticity, its just not worth it when theres 1 million other way better truly local spots within blocks.  #treatyourpatronswell #begoodtopeople\n\nHere is a totally spot on list of the 10 best Coffee and Tea spots in Northbeach - via yelp \nbit.ly/2e09UAu\n\nFor the owners/managers\nhttps://www.thrillist.com/eat/nation/cash-only-restaurants-the-case-against-cash-only-restaurants", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-11", "description": "Yesterday I was there for lunch, I had a coffee, the which is from La Colombe and a scrumptious lox on a bagel served with cream cheese, cucumber, capers and tomatoes. I would have given four stars if the cashier were cheerful and less snotty. Sorry", "author": "Francesco R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "A great spot to get some work done, to have a casual conversation, or to take a little break on your travels. Fairly quiet, rarely overcrowded, service from staff has always been friendly from my experience. It's not a hipster, gourmet coffee joint, and I love that it isn't.\n\nDepending on my mood, I get a coffee or a beer. This is one of the few cafes in Nob Hill to serve beer. I also like the sandwiches here. I've never been disappointed with any of the food or drinks. They're not the sole reason you would come here, but they taste good enough and the price is comparable or cheaper to other cafes around San Francisco.", "author": "George L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Ordered my cup of coffee, walk over to the ATM, then noticed that it was out of service. The proprietor gave me the coffee for free. That's good service. The coffee tasted great. I'll be back here with some cash to spend some money.\n\nThe coffee is dark roast, so I got a large cup half coffee half water. It was great.", "author": "scott h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Awesome Lox Bagel, and very nice people working there. I ate breakfast here every day during my last stay in SF.", "author": "Johannes B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Cute classic movie decor, friendly service, and tasty drinks. I had a cubano (espresso with brown sugar) and a hot cocoa. I liked that I could get the cubano decaf. The prices were very reasonable for the city.\n\nIt was good place to study. Nice to know where the talking tables are so you can steer clear if you want more quiet to focus.\n\nA bit chilly on a winter day, but OK away from the door with a jacket. Maybe they could close the front door to keep the place warmer?\n\nBy the way, they have lots of board games! Plus it was fun to see the cable cars passing by.\n\nOverall I really enjoyed my time here and hope to return next time I'm in the area.", "author": "Alisha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "Quaint little cafe right across from the cable car museum. The decor inside is almost set about 60 years ago. There are games, and places to play cards. I typically do my laundry next door and order a latte during. Good coffee, good food, friendly service.", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "This is my new place! I love that it's not a small crowded coffee shop. Very big and lots of seating options. Every time I come in I actually try to sit in a different seat!(: cute little tables sit in the widow area, my favorite spot so far, pretty secluded. Usually the window seats are filled with people doing work on their computer, but lucky us they reserved one window table for coffee sippers only. \nEmployees are very so awesomely friendly, always greeted with a smile. The young man (dex? Dax?) is very sweet, accommodating, very friendly and always up to something making this great coffee shop even better. \nThey also have wifi, books and games on a shelf to look or play with while you enjoy your meal/coffee. \nOh and they have beer! On tap for sure, not sure about bottles or wine. \nIt is cash only but have an atm inside.\nComfy couch and outdoor seating, too!\n\nso sad I'm only in a sublet for this month, I wish I had a gallery cafe on every corner of the block of which I live on!  Can't even think of a single bad thing to say about this place. \n\nGet coffee here! They also have (haha, sorry,not sorry! I can't stop raving about this place!) delicious cookies!!!", "author": "Molly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "I love this place. Little spot across from the SF Cable Car Museum, quiet and enjoyable. Highly recommend", "author": "Michael O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-27", "description": "Incredibly off-putting owner, who made not only patrons but also staff feel uncomfortable. Some staff members didn't know what \"vegan\" is - concerning for a food industry professional. Not that it really matters considering the total lack of nourishing vegan options. \n\nWatched the barista pour one espresso shot into a drink that I had ordered and paid for with 2 shots. \n\nOverall, weird and exclusive attitude from the establishment, and certainly don't come if you or any of your friends are vegan. I'm going to finish my dry \"veggie\" sandwich and look forward to eating a real meal elsewhere.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "I love to stay in the cafe. Always nice environment and relax! They have the separate room table for love buds and alone time. There is a laundry place next to it so I love to stay here when I am waiting for my clothes. XP they have a lot of arts and books that feel free to take look!", "author": "Yuzhen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "This is one of our favorite breakfast places where my husband and I can relax in the morning.  Every staff at the coffee shop is very friendly and welcoming. We love the ambiance and get to enjoy the free books !", "author": "grace k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "Great customer service with a comfortable and inviting environment. English tea and americano was just right.", "author": "Michele G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Laid back cafe, fun view of SF tourists as it is located next to a trolley route. Staff is super friendly.", "author": "Maria A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "This is place is great but not perfect. The last time I was here, I found the customer service a bit slow at times especially at lunchtime. I like how they have a wide variety of board games though to kill time while waiting for the order as well as to have a little fun with friends.\n\nWould come back though since this place is near where I work at.", "author": "Terrence C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "I often come here to work in the daytime as I find the space unique and creative. I love it's real neighborhood feel and friendly staff are very kind. The teas are cheap compared to the hipster/tech cafes that charge an arm and a leg for a simple green tea... Plus, all those cafes look the same.... !", "author": "Stanley B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "I come here often for breakfast. Typically the staff is great and the food is good. Today I called to check what time they close, I was told 6. Their hours recently changed so I wanted to make sure. I got there at 5:50 and was told they were closed. Ummm it's 5:50 you told me you close at 6! I was told by the man working they do close at 6 but the kitchen closes at 5:45. Why would you not tell me this on the phone when I called? I would have gotten there 5 minutes earlier. I really enjoy the atmosphere and coming to this little local spot, they just lost a customer.", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "This is my go to study cafe. It has everything I could possibly want in a study cafe: seats, table, wi-fi, outlets, bathroom, real food, good cup of tea and great service. If you're like me and you need background noise to study, this is the perfect place to study! \n\nThere is cute little space that seems like it's own little private study space. Good for two people, but it just feel very homey when you go alone. \n\nThe tea selection isn't huge, but you don't need it, the coffee is great as well. The food here is pretty good for cafe! It can get noisy because of the Cable Car, but it's part of the San Francisco experience right? \n\nI would come here again and again, just to do a bit of light reading. Trust me, you will feel like you are just taking a lazy day at home. The decor is so inviting and warm and bright all at the same time. They even have a couch area.", "author": "Cynthia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "Adorable corner cafe. Lots of vintage artifacts. Friendly service. Sidewalk tables. Right across from the Cable Car Museum.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "Great gem in the city for a cozy spot. Breakfast here is great especially if you love bagels and the coffee is good. There is also free WiFi here so it's a great place to study / do work.", "author": "Esty Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "We had lunch here before visiting the Cable Car Museum.  The food and coffee were good but the best part was the fun decor.  It is creative and humorous.  Even in the bathroom!  Kudos for someone letting their creative juices have some fun.", "author": "Cheryl K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Wow! I didn't know a cook could blow me so well! I ordered the veggie sandwich. Because I am vegan, I asked whether there was dairy in the artichoke spread. He assured me there wasn't, so I ate it. Later, I thanked him and asked him what is in the dip. He said \"cream cheese.\" Thank you, Gallery Cafe for the bout of diarrhea that is sure to follow. Here's a tip: if you are vegan and you read vegetarian, do not even ask any questions. Just do not eat the shiesse.\n\nSo, thank you, ignoramus cook, who doesn't know that there is dairy in cream cheese or doesn't know that dairy is what it is.", "author": "D M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-31", "description": "Ya sorry but not good\nThe regulars seem to only come in for a drink\nSmart as the food was, not good\nMy order was even wrong\nThe coffee was nothing special\nThe price was to much for what the place is,\nKind of, almost, run down\nNot comfortable at all\nIt is right across the street from the cable car museum, \nWhich is why we stopped by\nHas got to be better places is the area\nTry some and give us a review, for when we come back\nto the city", "author": "John R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-04", "description": "Cash only. Coffee tastes burnt. And they run out of bagels before 10am like every day!", "author": "Emily B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Delicious almond milk latte and Americano drinking and great people watching across the street at the cable car museum. This cafe has big tables with games to play and space to work. It's cozy and friendly and a lively spot to stop and rest.", "author": "Karen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-30", "description": "This is an OK cafe. The fact that it's a big space is a great advantage, but the service is always kind of bitchy, the ATM rarely works, and everything is about $1.00 or $2 more than what it is down on/around Union Square. \n\nSucky for locals but great business for tourists.", "author": "Cody R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-05", "description": "This coffee shop has a really cool vibe with antique posters and lots of toys/games for the kids and the young at heart.  It looks so inviting like a nice place to casually enjoy some coffee or hot cocoa and play some board games with your kids.  If you want more than that, however, this is not the place to go.  We were lured in by the atmosphere but the breakfast was barely edible and in fact my kids refused to eat any of it.  There went over $10 down the drain as the breakfasts here are overpriced (about $8 for the lox bagel sandwich and about $5 for an oatmeal).  The bagels were very generic and low quality according to my hubby.  I had the veggie sandwich wrapped in lettuce which was blah and the egg was a dried up little puck.  I ate it because I was hungry but did not enjoy it.  The latte was ok but not great.  Bottom line:  this is not a place I would recommend for actual food.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "A spacious corner coffee shop across the street from the cable car museum. They have an assortment of breakfast sandwiches, bagels, oatmeal and cereal for breakfast. The coffee is piping hot, so beware.  A medium coffee (12 oz) before tax is $1.85. Coffee sizes are 8 oz, 12 oz, 16 oz and 20 oz. \n\nThey also have 4 beers on tap, wine and a refrigerator full of sodas, juices and water if you're just looking for some hydration. \n\nMost of the employees are somewhat friendly, although there is one female employee who always greets me with a sharp \"YES?\", no matter how hard I try for a smile and a hello. \n\nCash only. ATM available inside, fee is $2.50, best fee in the neighborhood!", "author": "Kaylie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-28", "description": "I heard this place had new owners or a refurb or something to freshen it up. Not. There is crap in every nook and cranny, including an old toy train set on the bar. What???  . $7.50 for two coffee drinks coupled with two older Chinese men smoking outside (at the tables that have a big sign saying no smoking) makes this just another Chinatown dump. Sad because it could be a really cute place.  Oh, I forgot to mention the two overflowing trash canisters in the food prep area.", "author": "Holly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Great little spot to visit before or after the cable car museum. Good food, lots of board games available to keep little ones busy, etc.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "This place is a great place to grab a latte and watch the cable cars! My husband, 6 year old and i walked down the hill from the fairmont hotel for a casual breakfast. Nice selection of pastries and assorted bagels plus great veggie egg sandwich! Prices were inexpensive. They are wi-fi friendly and also have chess and board games to play while eating - it's directly across from the cable car museum ( which I also recommend stopping in as its free )", "author": "Kim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "Best croissant sandwich I've had in a while. Also, best and cheapest breakfast we've had while visiting San Francisco. So good, we're back again before we leave. Forget the fancy Fairmont buffet!\n\nNot 5 stars only because it's not very visually appealing inside.", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "I went here 7/5/15 and got to watch the US kill it in the Women's World Cup.  I stopped in to visit the ladies' room before driving back to LA and wanted to have a beer instead of just using the facilities.  I'm glad I did -- the soccer game was highly entertaining and I had a great conversation with a guy sitting next to me.  I unfortunately was in a bit of rush and didn't get his number, but Mark and Dexter were kind enough to help me get in touch with him after the fact.  I'll be sure to stop in next time I'm in SF!", "author": "Teresa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "My wife and I stopped in for a late afternoon snack on Sunday after a long day of traveling. We each had a delicious California salad. They had a nice selection of local beers, friendly service and a great atmosphere. Board games available was an added plus.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Great place! Ambiance is perfect, with all the old stuff cluttering up the walls and nooks of the inside. And the corner location with the big windows and recessed seating... Perfect for reading a book. I take one star off for the annoying tourists that shuffle in from the cable car museum across the street. This is somewhat mitigated by the owner's designation of 'talking tables,' although that is rarely enforced.", "author": "Carter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "I'm new to San Francisco and decided to search for a cafe near my place that has nice ambiance, food, drinks, wi-fi, and isn't too expensive.  I found it at Gallery Cafe!\n(This isn't to say other places would be similarly excellent though)\n\nUpon walking in, I saw plenty of seating, and found a nice little table for two (though it's just me) in a banquet window.  There are actually two of these little alcoves, both with power-outlets for my laptop and good lighting.\n\nI ordered the Grilled Chicken Panini which comes with tomatoes and caesar dressing, as well a side of mixed greens and balsamic vinegrette.  I also ordered a latte with a hint of syrup (they have a nice syrup collection) and everything came to less than $10.  The wi-fi is secured but they aren't shy about sharing the password.\n\nThere is an ATM available here and it's right on the corner of Mason & Washington.  Great Nob Hill/Chinatown location!", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "I love Gallery Cafe. It is a quintessential San Franciscan owned by a third gen SF'er. I encourage everyone to come here. The people are nice and kind and the decor is so creative and unique. I can't get the feel at any other cafe in the city that I get in Gallery Cafe.", "author": "Dom R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-25", "description": "For some reason Gallery Cafe doesn't show up on the Yelp search for nearby coffee and tea. It took a while to try it, but we finally stopped by on Christmas Eve.\n\nOrdering was a pleasant experience. The folks behind the counter were nice and unpretentious. We ordered one espresso, an espresso macchiato, and a \"Big Oat Bar\". I enjoyed the presentation of the espresso drinks - it was simple (no latte art for the macchiato) but not in a bad way.\n\nThe macchiato itself was quite good; it didn't taste burnt or too bitter. The Big Oat Bar complemented the espresso...although I wouldn't get it by itself.\n\nThe cafe has many seating choices. There's a communal section made up of small tables lined up parallel to the counter. There are also many 2-seater tables along the large windows and in small nooks. A comfy-looking couch section is set up in one corner.\n\nAs other reviews have mentioned, the music is a little bit loud. If I came here to work I would probably bring earplugs. The acoustics make the cafe feel a bit empty, but it's easily overlooked. I enjoyed watching the cable car swing around the corner, and the big windows offer a lot of natural light and the promise of people-watching.", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Great place. Friendly service and comfortable with a great selection of teas and beer on tap. Nice art, too!", "author": "Drew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "AMAZING! For 2 years I walked past this gem without every going, major regrets. When I finally went to the Gallery Café I was so impressed, I made it a daily routine to get my coffee. I am really picky about my coffee; I think Starbucks has gone downhill with their white mochas. This place knows how to make REALLY GOOD iced white mochas! The food is pretty good too. It is right across from the cable car museum so naturally there are waves of tourists that come through, but where in SF are there NOT tourists? Every time I've gone in around 2:30-3pm it was pretty busy, but generally there are plenty of open tables. The only downside is that it's cash only.", "author": "Meghan N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-03", "description": "I was very upset with the situation i encountered at this cafe today. I used to really enjoy this neighborhood cafe and invited a group of friends to study together. It was freezing so we attempted to close the door near us which was causing a draft. The cafe manager/worker would not allow it. We then switched seats to a warmer location and he made us switch seats to a cooler, boxed in location because of these silly talking table signs. There were plenty of talking tables open. Being excessively strict/anal about rules for no good purpose is not respectful or considerate to customees.", "author": "Shaheen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "I like the atmosphere and I tried to like the place. But people here including the lady at the cashier are just always rude. I would not recommend this place.", "author": "Mai S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-21", "description": "Not impressed with service. Caters more to tourists, and doesn't seem to care much about local/repeat customers.  But, it's a cute place with decent small menu.", "author": "Erin I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-03", "description": "Blown service. For an extra $1, your Organic chai latte turns into an non-organic almond milk flop.\nAuction off food by screaming across the counter. Make people pick up food from front of service counter line (no pickup spot), so it's super awkward having to dodge eager customers waiting to order. Place needs to sink and sprout something new. Food is decent at best.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-14", "description": "Maybe I was just starving (had skipped dinner the night before and then breakfast that day), but the grilled eggplant panini was phenomenal. The sundried tomatoes and pesto sauce perfectly complemented the eggplant. \n\nThe place was cute too. Only 4 stars though b/c the iced chai was super overpriced.\n\nOh! It's a cash-only place.", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Cash only!!\n\nThe biggest thing I loved about the Gallery Cafe was the building.  I know if you live in SF or any older city this may not impress you but the building is seriously old and beautiful.  Yes, the paint is peeling and the place has a sort of 'worn' feel but it is located on a corner with lots of windows and light. \n\nThe baked food items are okay.  They don't make them there or anything special so if you want to be blown away by that you probably won't.  They serve your average drip coffee and lattes but they are good.  Lots of people were working away on laptops so it seems good for that.  Lots of tourists thanks to the Cable Car museum so good for people watching.", "author": "Heather F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-21", "description": "Everything about this place is average. The food, drinks, and service is all fine, but what bothers me is the overall decor of the place. The Gallery Cafe looks like a rundown hostel, from the old, mismatched chairs, to the cheap floorboards. The place really needs some TLC. I usually only stop there if it's on the way and I'm desperate for caffeine.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-28", "description": "Cheap, fast, and delicious drip coffee. My boyfriend and I walked in here around 9am on a Friday morning and it wasn't very busy at all. Everything is cash only, and two coffees were around $5 or so.\n\nI was happy to see that they were brewing La Colombe coffee, which is a favorite of mine. I'd definitely venture back here if I was looking for a quiet and relaxing reprieve and to take advantage of their free wifi for customers.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Love the bathroom door with all the \"wall of shame Yelp reviews\" can't make everybody happy. The dragon lady who rang up your order was hysterical, dare anyone to cross her. Her interactions are no nonsense but Definitely with a smile. One guy came back up to the counter. Complaining  that there were raisins in his girlfriends bagel. I dared her to pick out the raisins and toss them at him... she must have been Feeling nice because she just got him a different bagel. But she laughed st my date and gave it a serious nod.  Fabulous latte and great atmosphere", "author": "Redd G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-07", "description": "My companion and I stopped in for a warm drink and a snack on our way to the Cable Car Museum across the street. It's an unpretentious little neighborhood place, with tables, a small lounge area, and wi-fi. The place has a \"shabby chic\" vibe, and the walls could stand to be repainted and the floor touched up. \n\nThe menu sports the standard cafe fare: Sandwiches, pastries, cookies, tea, coffee, and muffins. I had a latte, which was warm. What else can you say about a latte? Anyway, it was a perfectly pleasant place to stop for a snack on a chilly San Francisco day.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "Come here on business about every other month and was staying close to here. I ordered the grilled chicken panini. There is no crunch to the bread at all and it's actually cold. Very average. Cute nice place to get some work done but being from Arizona, surprisingly I find it to warm in the cafe. It's cooler outside. Just okay. Wouldn't come back unless I couldn't find anywhere else quiet and nice to work out of...", "author": "Lynsey T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-28", "description": "Stopped by here on a whim, and with a craving for an iced coffee. I ordered a iced soy latte. It was lacking so much flavor. I even added two spoons of brown sugar in hopes that it would add some sort of flavor in it, and it did not. I wouldn't get coffee here again, but it does seem like a nice, chill place to do homework.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "I love this cafe .. friendly service .. good strong coffee.. ambience.. breakfast. . Sandwiches. .sweet. beer n wine .. a lot of choices. And most important is Free wifi and a lot of space. Just place you can hang out .. work and meeting people also watching cable running in front of cafe", "author": "js w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-29", "description": "The breakfast sandwich is served cold, with rubbery eggs. The coffee is decent, but the place gets crowded with tourists coming in and out from the cable-car museum across the street. Definitely not a good place to sit for a while to get work done. But decent if you need to grab a quick coffee.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "The Gorgonzola Salad was awesome! Warm walnut and a pretty mix of cheese and green leave with a wonderful splash of balsamic dressing.", "author": "Rob J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-01", "description": "I am often here as it's just a block away. Great place to do some work. Rarely crowded. Full of locals.. I general like it - decent espresso and pastries but\n\n1) a super unreliable and unstable Internet\n2) cash only\n3) now a terrible live music on Sunday", "author": "Irina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Great food and coffee at a great price. Sourdough bread was great for the chicken sandwich. Coffee and atmosphere were perfect for idling.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-28", "description": "Pretty standard. It's great for a quick pop-in as service is pretty fast and friendly. Standard prices for standard coffee, maybe a little more on the high-end.\n\nWas very disappointed with the oatmeal, because it was pretty much a $5 bowl of milk. Sure, there were oats in it, but I like my oatmeal a little on the (really-)dry side and this wasn't even remotely dry. In the end after finishing all the oats, there was at least an inch of plain milk at the bottom of the bowl. Ew. My boyfriend did like his breakfast sandwich though, so maybe that would have been a better choice.", "author": "Katie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "Cash only... other than that: Great seating, decent outlet access, Wifi - and great coffee. PERFECT for a rainy day! Some tables are surrounded by little glass nooks - making it a perfect spot to study without headphones... for once ;P", "author": "Matt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "I love their lattes. At times there's a serious language barrier, and everything is rather expensive, but other than that I love going here.\n\nThe cafe is small, intimate and relaxing. Also, they serve beer(?!)", "author": "Tyler H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "This is the best cafe in nob hill. The food is great, staff is friendly, and the owner is almost always on-site to oversee the entire experience. Definitely try the breakfast sandwiches; they're tasty!", "author": "Brady G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-07", "description": "A solid 3 stars from me. \nHit or miss on the service and food. \nGood soy lattes, reasonable drink prices. \nBagels, cereal, a few pastries, quiches, sandwiches and salads as well. Their bagels are purchased elsewhere and they run out sometimes. \n\nThe people watching is great - it's right across the street from the Cable Car museum. \n\nFree WiFi password with a purchase and outlets (very important!) making this a great 'work from home' spot.\n\nCash only.", "author": "Sara P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-19", "description": "Good if you want to freeze, they insist on keeping the Windows open and when I asked if there was anyway of closing it, they just put their hand up and walked away.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "The Gallery Cafe is a great place to start your morning with a strong cup of coffee, or flavorful tea.  The breakfast sandwiches are delicious, I particularly like bacon, egg, and cheese on an everything bagel.  The location has free Wi-Fi and is a great place to watch all of the tourists riding the cable cars.  If you need to escape the everyday mediocrity of Starbucks, or Pete's, give this place a try.", "author": "Adrian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "This was my first time visiting \"The Gallery Cafe.\" I ordered the Gravlax Bagel with cream cheese and a small latte.  The bagel was very tasty and the latte hit the spot.  Peter, and the rest of the servers were very friendly, I will be back to try the Grilled Panini.", "author": "Marry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "This place is literally just a block away from me so I end up here quite often. It's a great place for a to go coffee, working/studying or just chillin' a few minutes while watching the happy tourists swing by in the Cable Car. Free WiFi. The outdoor seating in the sun is nice!\nIt's a bit pricey but the chill lounge music and hipster art inside makes up for it.", "author": "Niklas A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "This cafe is literally a block away from my apartment, making it the most convenient spot to grab coffee/a bit to eat when I don't feel like venturing very far.  The grilled cheese with tomato is my favorite sandwich there, and the lattes are pretty good.  There's some seating outside, and there are cool tables alongside the windows.  Good local spot.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "I've only had their almond milk latte here. The ladies behind the counter were nice. I came in when it wasn't busy so I got my order pretty fast. Having to pick up your order back at the counter you ordered from was a little weird. Usually cafes have you pick up from another counter. The latte itself was well-balanced (not too milky, not too strong on the coffee and has a solid foam on top). Serving size was a bit small than average, but if you're in the area and need coffee, this is a good place. Cash only.", "author": "HM N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "Just ok food and ok atmosphere. 3 stars at best. Place doesn't look very good either.", "author": "Armin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "I ran in needing to use the restroom...Got myself a drink so I would be a paying customer. After I paid, I was told the restroom was out of order. Sigh. \n\nThe cups are a bit on the smaller size. However, the chai tea is pretty good. The woman who runs the place seems very sweet.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-19", "description": "Overpriced. The lady cook dropped a bagel bottom on the floor and still served it to customers without telling them. Major health code violation, who knows what else everyone drops and still serves. Stay away!!!\n\nDown the block is a nice store called cable car corner. Family run store, never dropped anything. He had to raise his prices to compete with gallery. Please support them instead. \n\nBad gallery cafe. Stingy and overpriced. \nGood Cable Car Corner!!!!", "author": "Valerie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-22", "description": "I really like coming here to get some work done. Prices and food are reasonable. \n\nI ordered a small drip coffee today and the guy literally gave me 3 fingers of coffee in a smaller than usual paper cup. (The cup was only filled 2/3 to boot.) I said something like, \"wow, that's a small coffee.\" And he just said \"yep.\" And walked away. \n\nSo...get a medium?", "author": "Colin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-06", "description": "Yeah, MEH. \n\nThe sandwiches aren't bad, the pastries are eh, and drinks taste like they should..nothing special. But for their size, it really isn't worth it. I do like coming here to get some work done. I come here probably 2-3 times a week and always order a drink with my sandwich. So I would consider myself as a regular. However, I think I am done being a supporter of this place. After an incident, I don't think I will be coming back.\n\nI was tutoring a student here because the local library was not open at that hour. I haven't had a chance to order a drink yet because I was in the middle of tutoring session. While I was working with a student, one of the owners came up to me and rudely interrupts our conversation to ask if I wanted to order something to drink. I told him \" I will in a little bit\" and turned back to my student. I thought he would just go after that, but he continues to talk saying how I can't sit here for this long and not order anything. I looked around and I noticed this place was half empty. I have NO idea why he felt the need to tell their regular customer to order something, especially when the place was not even packed. I told him again \"I will in a few minutes\" and he still found the need to say that I have to order something if I wanted to sit here. After that I just said ok. I thought it was VERY rude and unnecessary for him to do that. Sure, I sat there for 30 minutes not ordering anything, but I did give him the confirmation that I was going to order something in a few minutes. That and I am a freaken regular, what the hell! \n\nHonestly, even if I hadn't ordered anything, I was still helping the business by attracting others to come inside. Hell no I am not giving this place any more business. RUDE owners. They do not know how to appreciate their customers.", "author": "Annie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-10", "description": "The Gallery Cafe has me hopeful about my new neighborhood. Stopped in while on a break from unpacking this week and ordered a lemonade to match with the sun. It was perfect. I am looking forward to sampling more from their menu.\r\n\r\nLove the space. Dig the boy workin' the counter (his eyeliner added extra flair).\r\n\r\nWill definitely be back.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-11", "description": "Note to self: Never hike up Mason St. from Market.\n\nThis place served your everyday sandwiches. A little expensive and cash only. Not really a place I would go often. But you know who would?\n\nHipsters.\n\nSuper chill music, crazy art on the wall, quiche, coffee and expensive sandwiches.\n\nIt might not be my cup of tea, but if you wear thick framed glasses and tight pants; shop at Goodwill or Salvation Army; and ride a fixed gear bike, this place is for you.", "author": "Dorian T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Pleasant stop for a coffee or tea. I liked the apricot bar.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "A little over-priced but really good... I used to frequent the Gallery Cafe when I lived right around the corner. It's also right next to a good laundromat so it's a great place to hang out while your clothes are sudsing. \n\nI highly recommend their iced coffee and cappuccinos. The panini sandwiches and salads are really good too. They also serve beer and wine and I believe they have a happy hour special on alcoholic beverages too :). \n\nThe cafe is really comfy for reading, studying, chatting with friends, etc and provides free WiFi too! :) You can pick a table in the sunny windows, outside, or in a darker corner. \n\nYum, yum, yum!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "Lately, I've been on a small quiet cafe hunt. \n\nI use to live on the same block as Gallery Cafe, but those were back in the days .. way before I became a caffeine addict. Since I was in the neighborhood on a early Tuesday morning, with hours to spare, I gave this place a shot. Right when I entered, the server was so energetic, friendly, and attentive. My skinny latte was made to perfection and topped off with a beautiful swirl. The setting is very chill, with relaxing music, and plenty of chairs. Adding on, they have outdoor seating, so on a nice day .. you'll be able to enjoy a nice cup of coffee while watching the Cable Cars go by.", "author": "Brenda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-20", "description": "Ordered the pesto tomato parm sandwich. It was weak. Sister had the grilled cheese, even weaker and for some reason, had tomato in it. \n\nThe coffee wasn't very flavorful but the location is nice... except for random trash everywhere.", "author": "Dominic C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "There are worse ways to spend an afternoon than nibbling on a turkey cranberry sandwich, scooping a generous bowl of granola and yogurt, keeping up with the world thanks to the free wifi/plentiful outlets and sipping a good nonfat vanilla latte.\n\nAll while lounging at tables inside this friendly and roomy cafe that look out onto the cable cars crossing the Washington/Mason intersection.\n\nThere are much, much worse ways to spend an afternoon.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-07", "description": "Cash only and the employees are pretty rude. Coffee is good but I wouldn't bother with any of their eats. Alright environment, if your in desperate need to go somewhere with WiFi.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "OVERALL:3.4   FOOD:3   SERVICE:3.5   AMBIANCE:4   VALUE:3\nAcross from the Cable Car Museum, this is a spaciously cozy spot to people-watch, catch some Vitamin D on the sidewalk tables, enjoy some breakfast/coffee, and maybe even a cold pint at the bar!  Great balance of neighborhood locals and the occasional trickle of Euro tourists.\n\nMostly solid coffee (espresso drinks vary, depending on who's manning the steam wand), but I come mostly for the convenience, abundant seating, GQ library (I know, guilty pleasure!) constant art rotation, low-key vibe, and free wi-fi.  Menu features variety of simple sandwiches, salads, pastries, daily quiches, limited wine selection....haven't tried the breakfast, but looks reliable.  Sandwiches are pretty unremarkable and mostly just disappointing (think homemade, but not in the impressive way)....stick to the liquids.\n\nGreat place to spend a relaxing weekend!", "author": "Amy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-26", "description": "Coffee is only mediocre. And... the barista had no idea what a \"dry\" cappuccino was... I tried to explain... and the drink I got was very much a wet capuccino. This is why people so many people want to go to Peet's or Starbucks for good coffee!! and they rarely make a drink wrong. get it together! make your coffee good!\n\nPS there are some exceptions, ie blue bottle and philz....", "author": "Claire b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-23", "description": "\"Gallery\" Cafe.  More like \"My-semi-retarded-child's-crayola-fingerpainting-nonsense-hanging-on-my-refrigerator-because-I-feel-guilty-when-he-pulls-that-shit-from-the-trash-can-and-looks-at-me-with-his-big-bovine-eyes\" Cafe.\n\nI didn't notice any \"gallery.\" I checked the website--oddly, there is no mention of said eponymous gallery, only an asinine bio for Vincent Van Gogh. Pretension is a dish best served...not by the Gallery Cafe, the culinary equivalent of seven popped collars. \n\nI did, however, notice the potted-plant topiary decor.  No doubt aphid infested and ripped off from some local marijuana horticulturalist.  And the overpriced menu.  And the bad panini.  And the cardboard to-go cup in which I was made to enjoy my English Breakfast tea while sitting outside due to the cafe's unbearable heat and humidity, a function of its biodiversification, perhaps?\n\nIt was lucky that I was sitting outside eating my lackadaisical Mozarella Tomato Pesto panini, made with marshmallow for bread and anthrax for the rest, watching Amanda F. eat her anemic mixed green salad, because it was there I saw the only redeeming quality of the establishment and the only reason to write this review (otherwise, it would not have even deserved the generous star I've granted).\n\nIn front of the restaurant on the sidewalk, beyond the overhead scaffolding supports, with a backdrop of the historic Cable Car museum, there stood a city garbage receptacle, and a surprisingly kempt-looking elderly Chinese gentleman performing his civic duty and collecting the recyclables carelessly deposited in the trash can.\n\nThere were so many things that were right about that moment--me, suffering through the sulfur and brimstone on my plate, drinking from my Mother Earth destroying cardboard tea-cup, already scratching at the bug-bites I expected to leave with--and this guy, Champion of the Elements, Son of Man, earning a living while saving the environment even in his waning years, wearing a thick, rich overcoat of dignity.\n\nMy sandwich, ashen in my mouth.  My thirst only whetted by this soulless tea. And behold, this giant in front of me, crushing cans with his fist.\n\nPlaces like the Gallery Cafe should be bulldozed like a Palestinian city block.", "author": "Donny S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-09", "description": "The two stars are simply because it is convenient and they provide WiFi.  But unfortunately I have been coming to this place for the past 5 years and it has not changed in cleanliness or decor.  It is sub-par if even that and it is not the cleanest place.  The only advantage they have in getting customers is that they are across the street from the cable car museum and tourists know no better.  The staff used to be nice but has turned rude.  The woman who works the cash register is only friendly to men and you almost feel like you are in a nail salon where you are being talked about behind your back.  I would appreciate it if the owner could put a bit of time and effort into cleaning up the place and making it presentable given this is almost the ONLY coffee shop in Nob Hill, minus the one in the Fairmont.  And needless it is over-priced.", "author": "Shirazi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-23", "description": "Nice quite stop to take a break from walking Around. Ok sandwiches and drinks, cold beer.", "author": "Laura O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "I always thought that Gallery Cafe is one of those cute little local places that would be fun to work at. Serving coffee, toasting bagels, all the while watching patrons sit outside in the sun drinking their lattes. \n\nGallery Cafe makes a mean bagel and they always put on the tomatoes and red onions for me just right! The coffee is nice and strong, but a little expensive. They make breakfast sandwiches too with bacon that are delicious on a hungover Sunday morning. I live in the neighborhood and love to stop by. You can even wander into the cable car museum across the street if time allows.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "Regular coffee is ok and their ham egg and cheese is exactly what is expected. Toasted bagel properly, didn't have the sesame, not a big deal. Overall solid place for breakfast but not memorable or worth coming back for $5.35.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "Love!  My new favorite coffee shop to study in.   With the exception of the cable cars rattling by, this is a relatively quiet cafe where you can relax, and unwind or study.  The people working  there are super nice and I get a nice ego boost when ordering (the people behind the counter look like dwarves because of the weird platform they've set up).  The coffee is pretty good as well as the sandwiches and bagels.  \n\nThere is free wifi here, and depending on where you're sitting, the signal can be pretty spotty....this is totally fine b/c wifi just sucks away time from the studying.  The music is usually very mellow.\n\nYou can totally hang around here the entire day without anyone really bugging you.  The only minus is that they only accept cash.", "author": "Guava C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-31", "description": "I love small cafes like this and decided to try it after visiting the Cable Car Museum. They have a decent selection of sandwiches, panini, coffee, tea, and pastries. I'm always a fan of any place that serves grilled cheese, so I ordered that and an iced tea. The sandwich came with a good amount of cheese and tomato on white or wheat bread. My only complaint (and many a restaurants are guilty of this) is that the cheese was not all the way melted. It's a huge pet peeve of mine. If you offer grilled cheese, keep it on the grill long enough so it's completely melted! It was still good, though.\n\nThe inside had a decent number of seats inside and outside, plus a couch and it was still difficult to find an empty seat at lunchtime on a Saturday. I loved that they had books and magazines there so you could enjoy your food or drink with some reading material. I think they also had some games, too.", "author": "Marjie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "This is my neighborhood cafe / coffee shop. I subtracted one star because it does not accept cards. Otherwise I love this place. The staff is always friendly. The coffee is always good. The food is always delicious. If you're in the neighborhood, stop in and grab a bite.", "author": "Danie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-17", "description": "Another of my walk-ta-work steadies.  The service is quite friendly and the coffee is also good.  I've got to knock 'em back a little since the sandwiches are not as good as some of their neighborhood peers.  The wheat bread really is just plain old, from a plastic bag wheat bread which can get a little soggy if you're on the go!\n\nThey are a great study stop though and have MUCH more space than any of the other places in the neighborhood.  Also they keep very regular hours.", "author": "Eric J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-16", "description": "About a year ago this place saved me from starving. I was in the area looking for some food and all the other nearby establishments were tourist traps. I was so relieved to have stumbled upon such a nice little cafe where I could have a decent sandwich and get my caffeine fix. Definitely an added bonus that they now serve beer and wine, great for those lazy afternoons. Cheers.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-02", "description": "Everything about this place screams 'eh'\nThe food?   eh\nThe coffee? eh\nThe staff?   eh\n\nI come here from time to time since it's the closest cafe to my house and they have outdoor seating.  Other than that?  Eh.", "author": "phil h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-19", "description": "I liked the general layout and the sofa area.  I didn't much care for the cramped, rattle-y little tables in the windows.  The neighborhood is definitely a challenge but there's lots of residential in that area and they deserve a good cafe.  I've only been for an event, but I would definitely come back for the free wi-fi and decent coffee and comfy sofa seating in front of the big teevee.\r\n\r\nI also liked the amount and kind of art they seemed to be selecting for the walls, particularly the Filipino-American artist who is up there now.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-18", "description": "This place is screaming for a makeover. Apart from the filth in every container and crevice, there's this overwhelming malaise ... the ghost of something past, I don't know.\n\nIf there's one plus it's the location: right next door to a laundromat, which means you don't have to watch your clothes go round and round and round and ....", "author": "Max A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-08", "description": "So-so coffee house with a few sandwiches, breakfast items, salads, etc.  The big space is underused.  Not a fan of the dercor of exposed plywood, spray-on ceiling plaster, a ladder and, office depot / target level furniture.  The couches are shady as far as spillage and vermin population.  Music volume to bearability ratio is off by half.\n\nPlus side is that it's sunny and open in the afternoon, it's across from the Cable Car barn, and the wine selection is good if a bit expensive when not on happy hour.\n\nFree wifi.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-28", "description": "\"Shiho!  I found my new coffee spot!\"  I had found Gallery Cafe thanks to Emily H. my roommate when we lived on 800 block of Mason.  This was back in 2005.  I recently found my frequent customer card while doing some cleaning (yeah I know... stuff from 2005 emerged like no other).  I loved trotting over the hill to visit this cafe.  Great soy lattes and treats.", "author": "Shiho F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "This is my neighborhood go-to breakfast spot. It's a bit overpriced and cash only, so come prepared. They've got good quiche and overall a cool atmosphere. Sit outside if it's a nice day.", "author": "Adam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-16", "description": "Sort of an odd location, but a cool one right by the cable car museum.  They have free internet for those like me that shun laptops.  A nice big screen projection TV with the A's game on when I was there.  Comfortable and varying types of seating and tables.  Friendly workers, good clean bathrooms.  Would have to return again to give another review when free wine not available which may be biasing my opinion.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-15", "description": "I enjoyed the drinks & HH at Gallery Cafe, but the truth is I still see it more as (surprise) a Cafe and maybe a Gallery. At the Yelp event, one of the barristas/bartenders made me a special mango concoction (amazing)...besides that, I think I'd stick w/ a tea or coffee if I was to return. \r\n\r\nThe best thing about this place (besides the wonderful smiling staff) is the cafe itself. I adore all the windows..And those intimate NOOKS & CRANNIES..oooh!  With the numerous large windows and the front door coming to a point, I felt as if I was on a wooden deck of a classic ship... I wanted to hang off the edge with my hair waving like Leonardo...\r\n\r\nComforted by the narrow streets of Nob Hill, and the passing trolley cars, I felt like a true San Franciscan at the Gallery Cafe! In the rare case I'm back in that area, I'd definitely stop in...but, I'd wear my slippers & PJs and get all snuggly in a corner.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-25", "description": "I don't eat oatmeal unless I need to regularize myself, you dig? Of course you do. Or unless I'm at work and don't want to be poisoned by cafeteria food. I believe in breakfast, even when it's covered in brown sugar.\n\nHOWEVER Gallery Cafe? They make theirs with soy milk and honey. It might sound unimpressive, but holy shit this is oatmeal?? It's candy in a bowl! I'd eat it every morning if I could be super late to work and always had cash on me.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-28", "description": "Gallery Cafe, situated at a cable car crossroads, is the first checkpoint after the initial steep descent from the tip top of Nob every morning on my walk to work.  I am renewed with a hot cup of house dark roast.  Bringing a commuter cup is always preferable-- their cups are a bit small (order a small and you will get TINY) and are prone to coffee jumping out of the spout and onto your work shirt. \n\nThe floor behind the counter is almost a foot lower than the rest of the cafe, which gives me the extra boost of self-confidence I need to kick off the day.  There are computers available for use in the corner if you didn't bring your laptop to enjoy the free WiFi.  The enjoyment is cut off around 7pm, and you'll have to migrate to another hotspot up and over the hill if you want to keep surfing.", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-13", "description": "Im sad to say, but the gallery cafe is on the road to dumpsville...the new owners, while cool, nice guys, have turned it from a great neighborhood cafe into a tourist trap...goodbye good sandwiches, poetry nights, cute cafe boys and awesome music...hello crappy music (I swear I heard the backstreet boys, at 8am no less) played at deafening loud levels, higher prices and good coffee, plus these annoying frappacino or whatever the heck they are signs everywhere. \nPlease gallery cafe, bring back the good sando-s (and I dont mind paying $8 for a sandwich if its tasty) coffee and music...its not too late!", "author": "Kelly F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-07", "description": "I'm always pretty happy when I make the trip over to this sunny cafe on a quiet little corner. The coffee is pretty great,  the sandwiches are good (if a little overpriced for what you are getting) and the staff is always easygoing, enjoyable and cute. I could easily see this being a good place in your neighborhood to do whatever-it-is-you'd-do-at-home but when you would rather do it somewhere else.\r\n\r\nThat said, the BEST part about the GC is the counter where you order. Let me explain. Clearly they have the customer in mind, because the person that takes your order is standing about a foot below you. This makes you feel super tall and really really good about yourself, which in turn makes your food & drink taste that much better and therefore your whole day takes a positive turn. Why don't all establishments do this?? The world would be a more peaceful place if they did, FO SHO.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-16", "description": "A nice little place in an unexpected location - it definitely fills a void for the neighborhood. I thought the alcoholic drinks were actually quite nice, and the restaurant was comfortable, if not a tad bleak. The food was respectable too. A-OK, but not soul-shaking.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-31", "description": "Hills, cable cars, coffee, tea, picture windows, free wifi, outdoor seating, AND art--they thought of everything here.  I order up their chai latte.  Milky spiced tea warms my tummy as I nestle into a window seat.  The blissful smile I wear lets the world know there's something good going on here.\r\n\r\nNote: They close at 7:30pm during these winter months.  Too early for my taste.  Stay open later, GC!", "author": "M A N I K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-02", "description": "Stopped by to kill some time before a movie this afternoon. They had what we needed: \n\nA bathroom, complete with gianormous pipe attached to the key\n\nEspresso, complete with pretty latte art\n\nCouches to curl up on and bitch about boys\n\nThe desserts and food looked yummy, but we were too stuffed from dim sum to eat anything.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "Our cable car had a maintenance stop, so we hopped off and wandered into the Gallery Café. Was a great spot for a healthy and tasty breakfast bite.  Bagel sandwich with lox & cream cheese was great, as was the goat cheese Panini.  Coffee and Espresso too.  Casual, neighborhood spot with tables indoors and out.  Nice find!", "author": "Carolyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-07", "description": "This is a cute spot to grab a coffee before walking down to bart in the morning. My friend lived right by here and she took me here often to grab a nice iced latte and a breakfast pastry. There's always people here on their lap top or reading a book. It's a nice place to check out if you are in the area.", "author": "Stephanie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-02", "description": "Perfect spot for a Saturday Suduko marathon.  Mellow, good natural light, relatively quiet, and plenty of tables.  I cheated on my coffee detox here.  It was worth it!  The coffee is really good!  Other reviews are right.  Not at all overroasted or bitter.  \n\nI almost subtracted one star because the barrista gave me some attitude.  He looked annoyed because I spent more than 32 seconds contemplating the merits of poppy seed bread versus an egg and cheese sandwich.  Understandable if there was a line but there wasn't. I hadn't had coffee for days.  My brain was operating at the speed of a 386.  Give me a break!  Nevertheless, Mr. Sourpuss did not ruin my morning.  And after a few sips of Joe I was back to myself.", "author": "sarah k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-28", "description": "Over priced for what it is. Adequate food. Cash only. Would only go back if it were close to where I was and if I were starving", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-17", "description": "One of the best chill cafes in town.  \nThe clientele is quite, intellectual and cool.", "author": "Peter O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-04", "description": "Great spot. I love that you can avoid the hub-bub that a downtown S-bucks has to offer. Free wi-fi...beer...so yea, thats about all you need. That and quiet.", "author": "Josh A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "I enjoy setting up shop here every couple of days or so. Very cozy place for working on your laptop (with the requisite free wi-fi, of course). Lots of seating options, including outside tables if that's your thing. The food is good (I love their egg and bagel sandwich), and the coffee always hits the spot.\n\nIt's right across from the Cable Car museum and a crossing -- I saw some people remark that it's noisy, but I personally love the ambiance the location brings.\n\nonly caveat is cash only, but there's also an ATM inside.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-09", "description": "I stopped here for an iced americano as I was walking home from the Chinatown library. The drink tasted good, and I appreciated how much room he left for milk. I'm intrigued by this place because I really like the layout. There are all these nooks in separate bay windows for two people to sit, a nice patio, and the inside is really spacious. They have a very similar menu to the Chameleon, similar pastries, but I'm not sure what coffee they use. I also appreciated the huge wooden drum with free novels for patrons to read. I will probably stop by again to sample other drinks and see how skillful the baristas are.", "author": "Merrilee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "Cozy atmosphere. Good sandwiches but expensive. Good coffee. Lukewarm staff.", "author": "Travis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-22", "description": "I used to live around the block from this place, so this review might be a little dated. When I was there, though, this used to be my second home. \n\nThey pull a great shot of espresso, and with the cable car museum right across the street this happens to be a pretty swell people watching spot. Good wine/beer selection...tasty food and pastries...the white chocolate macadamia cookies...mmmmm....", "author": "Geof M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-13", "description": "Back when Estrella was pulling espressos this place was five stars.  But she left for another business and the quality has been in gradual decline since.  They still use great beans but the newer Baristas don't seem to be as conscientious as in the past.\n\nStill, Gallery cafe has great price to quality ratio for their coffee and food, especially compared to the competition down the road in North Beach.  And the scene is great -- an even mix of locals, tourists from the cable car museum, and even the occasional group of cable car operators getting their morning cup of Joe.", "author": "Phill W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "This cafe is never crowded, so it's very quiet and relaxing save for the cable cars rumbling by.  Service was always friendly.  The counter has a strange setup where the barista seems a lot shorter than you.  Subliminal message of subserviency..?\n\nI think their drinks are a little pricey for the size you get, but they make some mean sandwiches!!  Their lox bagel is a favorite of mine and the bacon, egg, and cheese bagel comes complete with big, fat strips of bacon dripping with grease.  I tried the asparagus quiche, and it was o.k.  I'd stick with the bagels, mmm toasty.  Oh, and remember- CASH ONLY.", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "This is a great place that feels like a quaint, neighborhood cafe, with the added perk of watching tourists go by on cable cars.  \n\nAND you've gotta love a cafe that serves beer and wine.  Don't miss the happy hour starting at 3p, where they serve beer on tap for $2.50!", "author": "Tara T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-25", "description": "You know that local coffee shop that if you go to enough people start knowing your name?  The other day the sweet lady at the counter asked me \"the usual?\"  I knew I was in.\n\nGallery is a great place to bring a laptop to work (free wi-fi) or just to have a nice cup of Chai Latte on a nice day.  It is spacious, nice staff, and good food.  \n\nRemember to wave the the tourists as the cable car rolls by.  They love it.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "I'd have to say this is one my best kept secrets.  The staff are friendly and they have lots to offer....light music, quiet place for studying, free internet (if you bring your own laptop), and a variety of food.  I like this place because it's never busy and it's so quiet.  Ok, I haven't tried everything on the menu...but I always get the gorgonzola salad (pretty big).  The other times, I just get a pastry or whatever is left in the display case (almond croissant and apple filled pastry???).  Otherwise, I just order a drink...black iced tea, french soda, or coffee.  Ok, I'd have to admit, the coffee stinks (watery...blah).  But it beats going to Starbucks where they blast the music and a not-so peaceful atmosphere.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-05", "description": "I moved north of Market a little more than two months ago, and I finally have begun exploring the neighborhood. \n\nI took a walk over to Gallery Cafe today to meet up with a friend who had been there before. What a gorgeous walk over there! Coming up Powell Street I had a great view of St. Peter and Paul Church - the one on washington square with two spires - and the bay, and even that bridge that isn't the GG or the Bay Bridge, north of the City. whatever it's called.\n\nBack to the cafe: it is very cute, spacious, and does have little nooks and crannies where you can sit and be somewhat hidden from everyone else by plants and half a wall. They have a good, typical selection of espresso drinks, teas, juices, italian sodas, a decent breakfast menu (mainly eggs and meat on bagels), panini, pastries, and cake. \n\nOh, and free wifi. They're across the street from the cable car museum which is a very cute all brick building. I'd definitely come back.", "author": "Jacqui M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-09", "description": "Location is probably the best thing about Gallery Cafe.\r\n\r\nSituated directly across The Cable Car Museum, a laundromat, and only a block away from the Chinatown Branch Public Library, Gallery Cafe is about the only coffee place in the entire Nob Hill.\r\n\r\nThe cafe itself is rather spacious and has got a nice neighborhood feel to it. It's a comfy spot to hang out with a friend, read a book, work on the laptop, or just watch the tourist go by on the Cable Car.\r\n\r\nThe coffee and pastries are a bit sub-par for people like me who are used to the conglomerate tastes of Starbucks, Peet's, or Coffee Bean. Nonetheless, Gallery Cafe is a nice little coffee shop for those around the area.", "author": "Tommy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-10", "description": "This place is a winner.  Pleasant intersection, with big windows for loads of non-glaring, natural sunlight.  Internet and just the right amount of ambient noise and music. The food was pretty good and the staff was very friendly.   I'm gonna be a regular.  If repeat experiences match my first one, I'll bump this up to a fiver.\r\n\r\nUPDATE: Alright, so I'm bumping this up to a fiver.  Repeat experiences were up to par.  Get the chicken dishes (panini, salad).. they are tender and moist!  The only complaint I would have is that it tends to get pretty hot inside the cafe on sunny days.  But that is to be expected given the large windows, open kitchen, and lights.  I would look into installing some quiet fans to help bring in outside air.", "author": "Calvin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-25", "description": "Its right around the corner from my house, and also across from the cable car museum.\nAll barista can do the lovely espresso art.\nIt's a nice place to go relax and chat or do some reading.", "author": "Mai K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-25", "description": "I stumbled across this gem while going for a walk around and about in the Nob Hill area. Plenty of natural light, seating, and non-obnoxious music playing in the back ground.\n\nI ordered the mocha and caramel apple pie, both of which I think about to this day, and took a seat in a window alcove while my snack was being made.\n\nThe staff seemed friendly enough, though I seemed to get a little bit of a 'tude from the cashier. I think I had the tourist look going on that day, so I won't ding them a star for that.\n\nThere is a large bottled beer selection as well as wine, plenty of seating, and EZ access to the Hyde Cable Car. Don't try to drive here, there are no garages to spare and most of the block is permit parking for Cable Car drivers(?!). \n\nI didn't test out the wifi, but one person asked about wifi and informed it was \"free to use\", no passwords!", "author": "Mark B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-03", "description": "When I saw the Turkey Cranberry sandwich on the menu it brought back delectable memories of The Bobbie (http://www.yelp.com/biz/I3yzZhtKfRMuUHWHDBqHGA) back home.  I was never expecting it to match the culinary perfection that is The Bobbie, but I was hoping for close.  Not so much.  The sandwich wasn't bad, but had way too much balsamic vinaigrette - I'll be trying something different next time.\n\nIts quiet and has free wi-fi so locals come here to catch up on school work or just surf online outside of their homes.  I'm not a huge coffee drinker but proximity, price and a decent menu will keep me coming back.", "author": "Chuck C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "Yes, it is the closest establishment to my apartment and that may create a bias, but I'm ok with that. I still love my corner cafe. The tables in the windows are great for pausing for contemplation while doing whatever it is you are doing on that laptop. The sights and sounds of the cable cars are soothing to me, but if you aren't used to it, bring headphones. \n\nPrices aren't bad compared to a lot of places. Love the little leaf they make in your latte foam... or maybe I'm just easily entertained.", "author": "Jenn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-05", "description": "The coffe is okay but service takes a little longer than it should.  I've had pastries and breakfast bagels; I would steer you, gentle reader, towards the breakfast bagels rather than the pastries.\n\nThere are plenty of places to sit, usually.  I have not yet checked out their wifi/internet offering.", "author": "Ian T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-12", "description": "I've been to Gallery Cafe more times than I can possibly remember. Seated right across from the Cable Car Museum, Gallery Cafe is a nice neighborhood cafe. there's free wifi and its cash only.They've changed ownership a while ago and now runs more organized than before, but also lost the personality they uniquely had from the previous generation of employees. The current staff is nice and friendly, like any Starbucks.\n\nThe coffee remains a good quality, food is ok and there are delivered desserts, but sadly seems to rise in price faster than gas. The cafe is laid out well inside and out, the window table are especially nice little spots to read or work on your laptop. Local artists show there, and they rotate them frequently enough. Its the main appeal of Gallery Cafe, the ambiance. The location, sound, light, and locals (with a good mix of tourists)...  Its a good place to spend your afternoon.", "author": "Ivan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-22", "description": "I would love to give this 5 stars since it's round the corner, but I can't even give it one....or maybe one..........it does not have an inviting atmosphere at all.....I popped in for a happy hour wine, but oh dear, wine is not on the happy hour list ...$6.50 for a glass of medicocre wine from trader joe's, ...i guess I am an idiot........maybe they should write that on the chalkboard outside - only beer..............the music was way too loud, radio channel even though there were a total of 2 inside....night club bad music......I eventually had to ask the guy to turn it down...what a shame it is such a dingy place, such a great location......", "author": "carl c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-18", "description": "I used to walk a lot at lunch when I worked downtown. Sometimes my route would take me up Mason Street from the Union Square area. I remember seeing this cute cafe on the corner across from the Cable Car Museum many times but I never went in. I did not know what I was missing!! Nice ambiance inside with a lot of comfortable seating. Its a great place to go to have a good cup of coffee or an espresso drink and a snack. It's also a great place to bring your laptop and get work done! I love the free and fast wifi that they offer!!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-11", "description": "A bit of a letdown. It was the first time I've ever left a mocha unfinished. It tasted a little odd. I went back a few days after and the experience was a ton better. Three stars.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "Great coffee and pastries and you can watch the cable cars turn a corner.  Its close to Chinatown and across the street from the Cable Car museum (worth a visit).  Despite its proximity to so much tourism, it still has a local feel.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-28", "description": "This café is at a very convenient place at the Nob Hil. It provides you with free wi-fi but the service is very weak. Check the opening hours before entering, as they might sell a cup of coffee and tell you to leave after 10 min due to the business hours.", "author": "Matti P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-08", "description": "Nice small cafe in my neighborhood. Similar to all the others around here, has wifi and a decent selection of sandwiches", "author": "Luke R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-04", "description": "Stopped in for a quick lunch. Reasonable selection of sandwiches, paninis bacon and eggs on the menu board, some baked items which didn't appear house made. I thought my sandwich was average at best.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-18", "description": "When I was a little girl I always wanted to play with the life-sized mannequins in Macy's display windows in Union Square. Unfortunately, I never had the guts or the brains to figure out how to get in there. Much to my delight, however, I was able to sit in a display window at this cute little cafe. The tables in the nooks are so cool - and they made my childhood dream come true - sort of.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "This little place is right between my office and home.  Cute litle place, with decent coffee. Love sitting outside, especially in this area.", "author": "Dee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-01", "description": "It's really nice to have such great place to enjoy coffee and go online while I white for a phone call to meet up with my freelance.  If not for this I would not know what to do.  Good thing it's only two block from where I have to meet up with my freelance.  It's right across the street from the SF cable car museum.  By the way, I have to say the guy that works at the Cable Car Museum is super nice, that's what I'm gonna yelp about next.", "author": "Xiu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-15", "description": "Sweet little spot in Nob Hill to kick back and relax with your laptop over a cup of coffee or casually woop it up with some wine or beer. Can you casually woop it up? Well, a bunch of us Yelpers did on Friday and it makes a great space for whatever you feel like doing. It was nice and cozy and clean. And the help was super cool, even to all of us who hopped off the goofy Yelp train. I'd like to come back and spend a rainy day here on my computer with their coffee...", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-17", "description": "Warm cafe setting with friendly staff and good food and drink options.  I'll definitely go back when I'm in the neighborhood.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-16", "description": "First, I'll say that I like this location simply because it brings me to another corner of the city - I am all about exploring new places.  The cable car also adds an element of \"Oh how very San Francisco.\"  Loren, the owner is very nice, as were the bartenders.  I'll definately go back and sample more of what this cute little cafe has to offer.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-22", "description": "They meet the first cafe requirement admirably, which is that they have tasty, strong coffee.  (Extra points for the staff's ability to do that cool, swirly pattern trick in latte foam.) This place is on my route to work, so I can say that the coffee quality is consistent.  The atmosphere is great, with big, sunny windows, window tables on an elevated platform, and interesting, non-intrusive world music playing.  I wasn't impressed by the one sandwich I've had there (ham & melted brie), but the variety of sandwiches makes me want to try again.", "author": "Martha T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-20", "description": "hmmmmmmmmmmmmm...\n\n\nthis place is outrageously expensive. $3 friggin dollars for a SNICKERDOODLE????????????\n\nuhh... no thanks, i'll get an italian soda for $3.50+tax. THAT is reasonable.\n\nthe sandwiches take too long to make. \n\nenh.\n\nits not wonderful, its not crappy, its....\n\nenh.\n\ni dunno. \n\n: I", "author": "Inari T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-13", "description": "First of all, I came here because it is literally a few doors from where I live.  However, the amazing coffee and free internet access keep me coming back!  I detest overly burned coffee beans like Starbucks, Pete's (spelling?), et al.  These guys have it just right.  Moreover, the water pitchers usually have lemon, lime, or even cucumber slices in them.  I never thought cucumber water would be good, but now I find it more quenching than Gatorade.  Interesting particleboard floors and a friendly staff cap the experience.  Absolute tops!", "author": "Alex H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-10", "description": "I started coming because of the proximity to my house, and keep coming back for an occasional latte or beer on tap! they do a happy hour 3-6, i think, where the beers are pretty reasonable. a great spot to sit out on the corner and watch the tourists and cable cars go by. Super friendly staff and location makes up for the  mediocre coffee", "author": "mike s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-28", "description": "This place is good if u wanna work without disruption for a few hours but the hot drinks are always soo hot that u burn your mouth - i never had such hot coffee or tea drinks somewhere else and i feel its annoying as u have to wait 10 min to be able to drink it and then the coffee is really nothing special and not really tasty.  But as said - if u wanna work quietly and have a chai latte (which is good but way too hot too) u can go here", "author": "Johana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-13", "description": "Beer, Wine, Coffee and free internet access...how can you go wrong?  Great service and nice atmosphere.  I walked from Bart up the hill and took the cable car back...I felt like a kid again.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-13", "description": "I'm definately going back to this place. Very nice neighborhood and extremely friendly and attentive bartenders. This is a place where you can casually walk in, watch a game, go online, sip a cup of coffee and relax for the weekend.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-01", "description": "Excellent coffee and atmosphere.  Fun photographs litter the back wall and the internet access is free and fast.  The cookies are AWESOME!  Only glitch...I've never had service with a smile.", "author": "ellyk E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-05", "description": "My neighborhood cafe. Great coffee and a charming staff.  The GC is an integral part of my morning ritual.", "author": "Kezia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-28", "description": "Gallery's a nice chill out place.  It's even better if you can nab a window seat.  It's fun watching the tourists roll by, their faces in awe, as they hang onto the cable car.  The projection screen is cool, too.  The coffee is good, and staff are friendly.  If you're hoofing it, depending on where you're coming from, you can get a good workout due to its location as it's surrounded by hilly streets.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-23", "description": "One of the few cafes that have La Colombe coffee and make it as it should be made...the lattes are foamy and full of flavor and if the barista is really daring he will make a little design for you with steamed milk (oooo, aahhhh)!  Their quiches and sandwiches are yummy and the owner is always trying new things with his menu...This place is evolving into a neighborhood destination--it plays movies at night, offers good beer and wine, and has different events with artists.  It's also good place to sit in the sun during the day and watch all the tourists pass by in cable cars...", "author": "Jaena G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-17", "description": "Holy meatballs!!  Really, they were freaking good!  I am a pseudo vegetarian, but I still mananged to eat about ten of those meaty bites of love!  Great place to hang out, snack have a beer or a some.  Take the cable care if you can.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-22", "description": "This is my favorite little local cafe. Every time I come here I'm just instantly relaxed and happy. Free Wi-Fi, excellent cappucinos, amazing-looking quiches (...I haven't actually tried one yet), and great service... There are a couple of places nearby that feel rushed and anxious; Gallery has the perfect coffee shop atmosphere.", "author": "Ali T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-04", "description": "Finally, a cafe in my neighborhood that reminds me of Berkeley's Strada or Milano.  They have free wireless here, which is totally deserving of 5 stars, in addition, their coffee is a great medicine for hangovers.  I love the tables outside, perfect for a nice breezy day in the city.  If not, there are comfy couches indoors, ideal for fulfilling any desire to finish a great novel.  For me, this is my spot for some journal writing.  They also serve great food here and dessert to die for.  The only downside to this cafe is the possibility of running into an ex-bf, but any true and honest yelper would never let that be a reason of one decreasing star.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "the space is large and comfortable and well lit from light streaming through the large expanse of glass in the front. there is ample seating around the place (17 tables/33 seats, plus a big couch area) which includes two nice, private-ish nooks in the front window which would great for a date or hanging out with your significant other. the entire space is clean and organized, but maybe a little too much... like i'm at a someone's house who has painstakingly aligned everything with a ruler. (4)\n\ntheir food selection is ok - i saw a lot of quiche available at the counter... i guess they haven't read that one book. ;) (3)\n\nthe WiFi is free and was definitely cranking when i was last there: 11650/2100 (5)\n\nthe place is a little off the beaten path and there's not a good way to get there by bike - it seems to be uphill in all directions. though once you're there the place is brightly lit and welcoming. the bench seating is slightly padded so it's good for longer work stretches. there is some power for laptops but you might have to look; the window seats are a good bet for that. the staff behind the counter are nice and seemed to be really efficient. (+1)\n\nso, as part of my search to find a great cafe in which to work, Gallery cafe gets a solid 4.3 stars.", "author": "FrOg SoU P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-02", "description": "Not really my favorite coffee, and it's somehow more expensive than starbucks. Be that as it may, it's the only cafe within a block from me so I go here most days and the people who work there are really nice. They also make good sandwiches but I've always stayed suspicious of the pastries.", "author": "Constance C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-27", "description": "This place is quite nice, lots of windows and places to sit along with some internet access. Though I must admit I've only been here once and it was for a Yelp event.  Not that it's a bad thing but it just happened to be well off my beaten path and so it's probably not a place I will frequent.  They put on a nice shindig for us all to get together with some nice drinks and yummy appetizers.  I would definately recommend it to anyone in the area looking for a drink or some coffee and a snack.", "author": "Derek D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-08", "description": "Nice location, good place to work, friendly staff, not crowded, but fairly weak wifi and they only accept cash.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-17", "description": "this seems like the sort of place i'd go to if i lived in the neighborhood.\n\ni do not live in the neighborhood.  i am not moving anytime soon.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-01-17", "description": "Strong coffee and a nice place to do some work, it's right outside a cable car stop too, that's really cool. They just started serving beer and wine, which makes Gallery Cafe the perfect spot to unwind for a casual happy hour amongst good friends, also to heckle/wave to tourists as they cable car on by.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-28", "description": "The coffee is weak and the food is uninspiring. But it's the closest cafe to where I live so I end up going there quite a bit. It's well priced, never crowded and there's free wi-fi so that totally makes up for what it lacks. Cute little neighborhood cafe that covers all the bases but doesn't quite hit a home run in my book.", "author": "Natalie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-05", "description": "This cafe was awesome when Violet, Shane, Shawn, and Kyle worked there. It was the neighborhood cafe, with a great art vibe, awesome coffee, and those guys who are awesome to talk to. Unfortunately Lauren sold the cafe, and things have changed quite a bit. The cafe went from neighborhood friendly, to tourist friendly, which is a sad phenomenon here in San Francisco. Lauren used to give the locals small discounts and perks. That all went away. The cool guys that worked there were fired, and replaced by coffee-shop clones with no personality. The prices went up, and the quality of the food choices went down. The sandwiches used to be made on this heavenly bread, now they are made on cheap supermarket bread. The bagel breakfast sandwiches used to be extraordinary, now they are mediocre and oily. \nGone is the delicious strawberry rhubarb pie from Aunt Nettie's, now replaced by some Costco lemon cream concoction.\nThe new owners are nice enough, but obviously concerned with making money instead of keeping the integrity and character of this business.\nThe coffee is excellent still, as they use La Colombe which is hard to screw up, but still I get the odd espresso shot that has been burned.\nGallery Cafe, your golden years are gone.", "author": "Caro T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-02", "description": "I've had better coffee, but what a fantastic location! I sat there for 2 hours today watching the cable cars pass by and the tourists come and go. I'll have to go back and get something dessert-ish and see if that bumps up my score another star.", "author": "Fawn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-19", "description": "This is my local coffee shop and it has a special place in my heart. The staff is really nice, hard-working, and positive. Often they have huge lines of customers and they never huff or puff, they just do the work with a smile and even manage to bring dishes to the tables while servicing the line. They are always sweet to my rambunctious two year old, and the wifi is a life saver when mine goes down (which is often). The owner is always there working alongside his employees, and the vibe is great! The art changes regularly and its usually inspiring. Most of my mornings begin here and I wouldn't have it any other way! The only change I would make is I would bring some more progressive items to the menu, like gluten-free treats and healthier breakfast choices. The menu just needs a little inspiration to make this place perfect.", "author": "Virginia J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-05", "description": "great ambience and location - just up and over the hill from my apartment, with cable cars going by and progressive / down tempo beats in the background, and great lighting.\ntheir food is ok - their oatmeal, served wtih steamedmilk was a kinda runny.  their organic chai was very smooth.\n\ngreat place to \"work from home\" - free wifi too.", "author": "Haru K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-28", "description": "i actually like this place, its kind of fun to watch the turon action outside everytime the cable car stops and occaisionally a cute girl wanders in to distract me.\n\nunfortunately, distraction by my computer is hampered by a horrendously slow internet connection. they stream music to itunes and frequently there are a bunch of laptops and their own rental boxes using the same slow connection. it seems to me that they ought to spend the extra 10 bucks and open up the pipe a little.  i talked to some of the employees and with a clueless smile they looked at their computer. obviously not worth the effort. \n\nso for internet and coffee, i now go elsewhere... too bad.", "author": "tommy p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-04", "description": "Good paninis, good quiche, good beverage selection, and there's always a place to sit. I'm deducting a star because there's not an avocado to be found on the premises, and I think that's just ridiculous.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-29", "description": "Nothing Earth-shattering about this place, but it was a perfectly lovely spot to meet up with some out-of-town friends who were staying at a hotel nearby. I ordered a cafe au lait and a water and when the total was only $3.50 I thought maybe the guy forgot to ring me up for the water because it seemed like such a value. But nope! $3.50 for the whole enchilada!", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "Lovely little spot to enjoy on a nice day and just people watch and enjoy the city. The desserts and drinks are pretty tasty and from a non-sandwich person, the sandwiches were actually pretty good! Prices are extremely reasonable, there is free WiFi and the people are nice. I can't say anything bad about it at all.", "author": "Anita B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "Awesome little place!! Excellent for people watching, coffee and chit chat. Very laid back vibe with outdoor and indoor seating to enjoy the gorgeous San Francisco weather. I ordered the soy latte and it was pretty good. Not happy that they didn't have brown sugar but oh well. We sat in one of the cool window seats and seriously, that's what sold me on the place! I would have given it five stars yet the service was not great at all. In fact I think the woman who took my order hates her job. She may want to rethink her options. Otherwise, well worth the cable car ride out of the hood for a little catch up with an old friend!", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-08", "description": "I stumbled upon this place in my usual search for food, drink, wifi, and power outlets. What a gem! The food is basic but classy. There's plenty of seating. You can sit on the sidewalk and watch dorky tourists getting on cable cars. Nice place to relax if you around china town looking for a place to rest. Lucky I have cash though, it's cash only. You get another star when you take my plastic.", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-29", "description": "The coffee and food are strictly OK but the ambience is lovely. I just wish they would be open later........they close at 7 pm!!!! Its one of my favorite places to study but very inconvenvient during weekdays when I barely get home by 7 pm.", "author": "Rumesha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-03", "description": "monday night once a month (1st monday maybe) there is a poetry night. well i was there a few days ago for that.  very creative people, some with their own published poetry books even.  and their creativity extends beyond writing clever reviews on yelp!  ;-)  the cafe opened extra late that night to accommodate the open mic. even though the people there didn't really eat or drink much and other customers didn't come in during the poetry hour.  in other words, the cafe didn't just stay open for the pursuit of capitalism.  i will take that over any chain coffee place any day.\n\nmost importantly - how were the eats?  since i was there late at night, and i can't drink coffee past 3 in the afternoon w/o being jittery all night - i can't speak for the coffee.  the quiche there was really good - with black olives, artichokes, *and* mushrooms (three of my fav. veggies) - and a bit of side salad with balsamic dressing came with it too.", "author": "Celeste L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "Another day at a new cafe and I really enjoyed my afternoon at Gallery. First off, it's very spacious and clean, and I was able to find a great spot to plug in right by the window.  Internet is free and the staff is very friendly. I ended up ordering a turkey/cranberry sandwich and then treated myself to a slice of pumpkin pie.  It was all VERY good!", "author": "Shawna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-07", "description": "I'm sitting here, enjoying a delicious tuna melt sandwich, listening to a mix between tribal and 80s music, and surfing on their free wireless. Can't beat that!", "author": "andreas b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-08", "description": "When I lived in Chinatown I went here EVERY SINGLE DAY.  My roommate and I would meet our friend to do our laundry at the Fashion Laundromat (best name for a laundromat EVER) and while we were waiting for our clothes to dry we would drink way too much coffee.  Then, I got a job there.  And I loved it even more.  This is a place that takes its coffee seriously.  When I later worked at La Boulange on Union street  I was appalled by their espresso crafting.  At gallery, they gave me a series of videos on how to make espresso drinks.  Videos.  Like I was supposed to go home and study how to make the perfect cappucino.  Like I said, very serious.  And you can definitely taste the difference.\nThe actual space is really lovely.  I love the big windows, the sun reflecting off the honey colored tables, the (usually) really cool art on the walls.  Also, it's a good place to get a beer at happy hour.  If I remember correctly they have some sort of two for one deal.  \nI was so sad when I moved away.  The coffee at Gallery is so good it pretty much ruined me.  Since then, no other coffee has compared.  It's some special coffee that they only serve at like the French Embassy or something.  \nThe only reason I'm giving 4 stars is because it's no longer a block away from my house.", "author": "melissa r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-17", "description": "This is right around the corner from where I'm currently staying.  My friend told me that if I was in need of a wifi connection, I should check this place out.  At first I went there for a cup of coffee for breakfast, but having been in this city for a little under 2 weeks, I have been going there at least once a day.  My favorite has been sitting down to one of their books (they have reading material ranging from books, magazines to the newspaper for cafe dwellers) and enjoying my fare.  They have plenty of seating available, with tables, benches and couches.  A great spot to relax with a cup of coffee/tea and your laptop!", "author": "Aishah I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "Perfect place to lounge! Loved the sofas, smoked salmon sandwiches with mixed greens salad, italian soda, cafe mocha, paintings on the walls (it changes every two weeks i think), seasonal live musicians, nice background music, perfect place to get free internet access, friendly servers,  no boring moments!!!!", "author": "christy c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-27", "description": "this is my favorite cafe and place to study! free wi-fi, loads of outlets for laptops. i've been coming here for years now. it used to be very stuffy, but they recently added sliding windows that keep this place cool. the grilled chicken panini for $7.25 with a side salad. overall a great place to get some studying done. there is also beautiful art for sale that are displayed all over the cafe. they also have two computers for use if you purchase their wi-fi card. oh and its cash only!", "author": "Jen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2004-12-09", "description": "great coffee and bagels...i miss this place  sunny egg with turkey bagel...", "author": "Dawn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "*great* coffee, perfectly made lattes with the swirly little heart of foam, tasty little fresh-baked treats, free internet, and a laid back atmosphere.  my kind of place.", "author": "B R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "What a pearl!  This cool little cafe is nestled in between the honking cars and busy establishments, offering a little bit of Europe.  In search of coffee one Saturday morning during a weekend overnight in the city, my husband refused to go to Starbucks.  So in search of something more ambiance and less mainstream, we saw the open door and heard music coming from the Gallery Cafe.  The owner couldn't have been more personal, the coffee hit the mark, and the surroundings brought us back to wonderful memories of Europe.  We'll be back!", "author": "Mary R."}
