{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "This is the place to get some delicious Italian Gelato. The service was great and I got chance to taste a few samples of the Gelato. I finally decided on the pistachio and cookies and cream gelato. It was so yummy.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "I came here on a Friday night around 9pm and it wasn't too busy. There is a nice selection of flavors and they let you sample them. We got pistachio, creme brûlée, and a chocolate flavor I can't remember the name of. It was $5.50 for a medium. \n\nIt's in a very lovely neighborhood, so this is a great spot to come after dinner. \n\nOnly reason I gave 4 stars is because the woman working was not very friendly to us. Also, cash only!", "author": "Liza H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "This review is base in 2 factors, \n1- service: poor, horrible, bad, rude, the lady helping there was super rude, we ask for napkins she just throw them at us some of them fell in the floor. I had my kids with me and even them felt uncomfortable with this ladies attitude. \n2- the elati: In my opinion it was very basic. Like the one you get at the market store but more expensive.  the problem was that felt almost like you were eating melted ice cream.  Super over price. A scoop is almost $5 and they only take cash.!", "author": "Kriss M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "I like to come here whenever I'm in the area.\nsmall shop, good gelato, convenient.\ntonight I had Ginger Gelato and Pistachio medium size.\nthey're good!", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Stopped in this sweet little shop on my walk home last night for one last taste of gelato. The owner was adorable and told me with pride that they are the oldest shop in the area- 43 years! He was so sweet and offered me samples before deciding. I ultimately tried a small cup with dark chocolate gelato and raspberry sorbet. They were starkly different but especially delicious swirled together! If you find yourself walking around North Beach- look for the ice cream cone and stop in!", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "Coppa mista is the bomb diggity here. They were just dropping a new one in when I got here much to my delight.\n\nThe lady working behind the counter was very sweet as well. Solid place for Gelato.  \n\nSo many good ice cream/gelato/chocolate spots in the city. Here is my ranking but they are all pretty darn good.\n\nWho doesn't love Chocolate and Ice Cream? (If you're raising your hand you can stop here ) \n\nI like making lists what can I say. I have lists for Ramen, Steakhouse/Brazilian , Milk Tea, Egg Tarts, Chicken & Waffles (super random list right). Give my profile a follow if you like them. \n\nRanking explained:  #1 (listed at the top)  is my favorite/ #?  (listed at the bottom) is my least favorite. Check out my latest reviews for my latest up to date Rankings. \n\nRod's San Francisco Chocolate and Ice Cream shop Rankings: \n1 Mr. and Mrs. Miscellaneous\n2 Marco Polo Gelato\n3 Dandelion Chocolate\n4 Polly Ann Ice Cream\n5 Salt and straw\n6 Milkbomb Ice Cream\n7 Garden Creamery\n8 Chocolate Covered\n9 Loving Cup\n10 Smitten Ice Cream\n11 Teuscher Chocolate \n12 Humphry Slocombe Ice Cream\n13 Over the Moon\n14 Lush Gelato\n15 The Ice Cream Bar\n16 Coletta Gelato\n17 Cako Creamery\n18 Bi-Rite Creamery\n19 San Francisco's Hometown Creamery \n20 Miyako Old Fashioned Ice Cream\n21 Alimento \n22 Mitchells Ice cream\n23 St. Francis Fountain\n24 Gelato Classico Italian\n25 La Copa Loca Gelato\n26 Z Cioccolato\n27 Joe's Ice Cream\n28 Christopher Elbow Artisanal Chocolate\n29 The Baked Bear- Custom Ice Cream Sandwiches\n30 Ghirardelli Ice Cream and Chocolate Shop\n31 Recchiuti Confections \n32 Poco Dolce Chocolates", "author": "Rod M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "The women at the front was very rude and denied me more than 2 testers so I was unable to even see what flavors I wanted and had to leave to a better gelato shop blacks away- I definitely don't recommend being disrespected by this staff I am assuming I was being discriminated against as I did not here her once tell her older couple that came in following that they could only have 2 if the owner is available to reach out an contacte I would like to address your staff and how to hire employees in the hospitality industry in general. The gelato is NOT worth your staff. Thank you-", "author": "Arianna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "Came in around 8:30 pm with no customer. A bit hesitant, I tried the cappuccino chip and it was exactly what I wanted after 2 dinner meals. I thought double espresso bean would pair nicely with it so I got that too. \n\n4/5 cappuccino chip gelato\n3/5 double espresso bean gelato\n\nThe cappuccino chip gelato gave me the coffee taste that I craved. Although the double espresso bean did not quite rival the cappuccino chip, it was not bad.", "author": "Lon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "This gelato was very interesting and tasty! It was more grainy than I was expecting but not in a bad way, it is still very creamy and almost has this homemade feel too it because of how rustic and flavorful it was. I tried strawberry, cookies n cream, chocolate, vanilla, and copla mista. All delicious flavors!!! I think my favorites were the strawberry and cookies n cream, they were very creamy and savory. It had chunks of actual strawberry and chocolate bits in it! Give it a shot, it won't disappoint!", "author": "Alejandra A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Super yummy gelato. I had a scoop of espresso bean and a scoop of vanilla bean. Perfect combination. For an extra 25¢ I got a crisp wafer cookie of some sort stuck on top which was delightful. The gal at the counter was very friendly and helpful and was happy to let us taste flavors we weren't familiar with. They had probably 18 or more flavors of gelato and sorbet to choose from. This shop is located in the North Beach neighborhood, which was like a mini trip to Italy. I could've spent several days just eating in this region.", "author": "Jenny P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "This was my partner and I's last stop on what was a beautiful Italian-themed date night in SF (North Beach). Who could turn down delicious gelato to top off the evening?\n\nIt was a small shop, but there were a few seats inside and outside. We staff was helpful and patient as we scanned through the flavors and tried samples. \n\nWe ultimately picked a variety of flavors. The mint chocolate and salted caramel were among my favorite. \n\nFor the amount of ice cream, the price was reasonable. Looking forward to coming back (Italian day part two!).", "author": "Nicholas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Pretty solid gelato. The shop is tiny and lacks air conditioning but they have 5 different sorbet flavors in addition to the gelato flavors. Great for those who are lactose intolerant.", "author": "Sara J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Nice little gelato shop right by Tony's Pizza. The place is small and is cash only. Cash only in this day and age?!?!?!?!?!? Why!?!?!?!?!?! It's an inconvenience but I know the Mountain View location is the same.\n\nThe lady who was manning the store let me try the flavors and seemed nice enough about it. Usually they are so impatient with you as you select your flavor of choice.\n\nDecided on a pint of Creme Brûlée and Cookie Dough to serve for dessert for that night's dinner. The gelato here is silky and just the right amount of sweetness.", "author": "Connie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "THE BEST GELATO in North beach period. Maybe even San Francisco but I have yet to try them all so I don't feel qualified to say that yet. I got the rum raisin gelato and it was literally the best tasting gelato I've had since I went to Italy last summer (I realize how pretentious that sounds don't @ me)", "author": "Cindy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "This is tiny shop has amazing gelato!!! I got the Chocolate Covered Strawberries and Crème Brûlée in a small cup. Both were excellent~! Do note for people who tend to use their card, this place is cash only.", "author": "Jodi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "I don't really eat ice cream or Gelato but boy, when I'm in the mood, I'll come here!\n\nI got spoiled a long time ago eating Gelato in Europe. It was divine!\n\nBut after eating at Tony's pizza in North Beach, my son and his girlfriend wanted gelato. We found this little spot and loved the assortment of flavors, samples, and the hospitality of the server.\n\nMind you, this a cash only establishment so be prepared!\n\nBeyond that, this is some of the best Gelato outside Europe!", "author": "Ron C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-25", "description": "Pros: Two freezer one displaying fruity flavors and the other creamy ones. Located near a bunch of other restaurants so convenient place to stop by after a meal.\n\nCons: Cash only. The girl who was working must hate her job. I mean her service wasn't horrible but she wasn't helpful and seemed more annoyed than anything. Came here around 1pm and there was no one else inside the small shop as well. FYI only two sample tasting per person and you can have two flavors for a single scoop in a cup but not cone.\n\nOrdered: Single scoop of creme brulee on sugar cone (~$4.50). Was too sweet for my taste.\n\nWould I recommend: Not really. Maybe check Yelp if there are other nearby dessert place since there's nothing special about this place.", "author": "Terry N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-21", "description": "Yummy gelato place in the North Beach area of SF. Love the gelato statue in front of the store. :)\n\n3.5 stars", "author": "Amy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "When I rate a place, I normally pay more attention to the quality of the food than the quality of the service, for one main reason, we are all humans, we can have a bad day and not everybody deals with the stress in the same way. So, I 'm going to not rate the lack of patience and smiling of the lady behind the ice cream counter, who served us with a very grumpy attitude. May be it was just a bad day for her, right?\nWhat really did upset me was the complete lack of flavor...in 2 we had a total of 4 different flavors, we really couldn't appreciate any difference! Are you kidding me? In our opinion it was totally tasteless, and watery. We wasted our money since we decided to throw them away after few steps. Why having calories and sugars for something that isn't satisfying at all? May be fruit flavors are better, I 'm only rating the 4 flavors we supposed to enjoy :chocolate, tiramisu, hazelnut and cookies and cream, for our well educated palates it was just a total disappointment.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Quaint small and open late..yummy gelato..since 1970's so that alone says something. There can be a line, but it moves along quickly. Just eat right there on the sidewalk. Bon appetite!", "author": "Dan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Delicious flavors, delightful combinations. This place alone will bring me back to SF.", "author": "Bobby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Stracciatella excellence. Italian ambience perfected. With every lick, thoughts of Roma, la piazza, amore.", "author": "Joe W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "DELICIOUS DELICIOUS GELATO. The elderly man that served my delicious cookie dough gelato was super sweet and bubbly. The gelato was delicious with the smallest cup containing 1-2 flavors and the most I believed was up to 4 flavors for the largest cup.", "author": "Uyen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "This gelato was very good as you would expect. Right across from Tony's where we ordered a full pizza. Price was also fair and comparable to most places; $4.75 for a small and about $5.25 for a medium size. You can also choose multiple flavors. Hits the spot after a good meal.", "author": "T B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "My friend and I were craving some gelato after brunch and walked into this small gelato shop. There were a decent amount of flavors. Ask to sample before you purchase. I ordered the cookie dough gelato tasted good, but to me it tasted more like regular ice cream. It did not have the gelato touch to it. I do like that you can order a size small and have up to two different flavors, but I chose to stick to one flavor since the other flavors I tried were ok.My friend ordered a small scoop of strawberry and was not fond with it. My advice would be to try this spot if you don't mind paying for regular ice cream flavored gelato, but if you really want the true gelato fix try a different place. Im not sure if I'll come back here since we walked into it randomly. The guy working there was friendly and helpful, but the flavor was lacking our expectation.", "author": "Danika P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This probably my best experience trying gelato classic italian. Unique flavors. I tried the creme brulee, ginger and raspberry limonade. My wife tried chocolate covered strawberries. All of tje flavors were sooo good. Highly recommend this place", "author": "Wonka M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "5 stars for the selection of gelatos, probably 10+ variations of chocolate and  another 8+ variations of fruit.  Nice service, a little pricey, still good gelato.  I'll go back.", "author": "Jim I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "Best ice cream anywhere, so why only 1 star? Lady told me they only accept cash for the last 40 yrs.  LIAR. John Heffernan, the orig owner of Gelato Classico was my next door neighbor and friend in Tiburon. He was a great guy. He owned the Union store and he took credit cards and that was about 25yrs ago.", "author": "Jacko F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "Pretty good gelato. The funny thing was I read about how rude the person serving you is before I got there. I kind of get it. We're all trying to try a few flavors before getting a cup but he goes past our group of 5 and keeps saying \"I can help someone if they know what they want\" over and over again granted there is another server ready to help us if we need it. The problem is you try one flavor and he's already yelling this out. Might be faster if he just let you try 2 and then pick out the ones you want. \n\nBorderline deal breaker", "author": "Arlene H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Recommended by Tony's Coal-Fired pizza, this cute little place served up some delicious sorbet! The flavors tasted very natural and made for quite a refreshing dessert. Great location right near the park. Very enjoyable.", "author": "Danielle P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "I rushed to get to this shop 15 minutes before it closed and there was still a customer there. After the customer left, the lady that was working just shouted we're closed and close the door behind me. That's just bad customer service! They should hire friendlier and not rude employees!", "author": "Mike O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Im not big fan of ice cream or gelatos but this place has great selection of different types of flavors, so i could not stop trying it. I loved strawberry flavored sorbetos and dark chocolate gelato. And staffs Ulya and Aidai are great, easygoing fun girls. Place is clean. Recommend it to everyone", "author": "Akylai A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Kids say it's the best gelato in the world especially the chocolate covered strawberries, cookies and cream, peanut butter cups and mango!  It's rich and creamy, seems to be handmade.  Yummy!!", "author": "Isabel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "Sugar in its holiest form!\n\nOn unusually warm days in San Francisco when you may decide to take an easy walk around North Beach, you are not likely to find better gelato around! Pick your flavor(s), number of scoops, and then take an easy stroll around Washington Square Park to watch all the fun! If you get a sugar rush, not a problem! Just join the doggies who are chasing their favorite toys around the park! Don't bite them though!", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "A quick drop in for dessert.  Flavors are great and despite some interesting and rude customers the lady was patient and courteous.", "author": "Crystal G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "I am giving it 3 stars because my strawberry Fresca gelato was really good! But there was no customers and It was my first time trying gelato so there were 4 that I wanted a sample of and the guy was so strict about only letting me have 3 samples, I didn't like the 2 other ones I sampled and didn't want to risk trying something new. Asked for some napkins for my husband and I and he gave us 1.. Customer service could be better and the man  shouldn't be so greedy!", "author": "Stacy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "I like the variety and I'm glad this establishment has been around for so long\nThis time I had half refreshing strawberry sorbetto with half espresso gelato", "author": "Vange B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-15", "description": "For the second time this week I traveled across the city to eat at Gelato Classico, and for the second time they are closed! \n\nThey say they are open until 10pm. Yelp says they are open until 10pm. Google says they are open until 10pm. But they just choose to randomly close the store early. Boo", "author": "Michael O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "Gelato Classico Italian is a small gelato shop in North Beach/Telegraph Hill.  To find it, look for the small green awning and the larger-than-life gelato statue on the sidewalk.  It's less than a half-mile away from Washington Square Park.  This tiny, cute neighborhood shop serves up delicious gelato (Italian ice cream).\n\nThe gelato here is rich, creamy, flavorful, smooth, and somewhat thick/dense (in a good way).  There are about 20 different flavors to try.  They include:\n\nStrawberry fresca\nBurgundy cherry\nStracciatella - Italian chocolate chip gelato (finer sized chips)\nWhite chocolate raspberry\nRaspberry\nCoppa Mista - chocolate, vanilla, almond, pistachio\nVanilla bean\nDark chocolate\nTiramisu\nCreme brulee\nSmores\nMint chip\nSpumoni - cherry, pistachio, chocolate with cherry bits\nBavarian mint\nPeanut butter chocolate\nPeanut butter cup\nPistachio\nCookie dough\n\nIf there's not a line of customers behind you, ask for several samples.  You'll may find it hard to decide what to get because all of the flavors taste great.  I personally go for the sweeter, creamier flavors over the fruit flavors.  My favorites are the vanilla, spumoni, pistachio, and cookie dough.  The spumoni has real cherry bits and the pistachio has real pistachio bits.\n\nPricing is as follows:\n\nPint - $7.95\nLarge (1-4 flavors) - $5.95\nRegular (1-3 flavors) - $4.95\nSmall (1-2 flavors) - $3.95\nWaffle cone - $4.25 (1 flavor), $4.95 (2 flavors)\n\nUnless you're really hungry or can eat a lot of gelato, I think the small size should suit most people just fine.  I like to get 2 flavors.\n\nSpace inside the store is limited.  There are only 2 tables (seating 2 each) inside and a bench outside.  That's OK because the park is only a stone's throw away.\n\nSo, if you're in North Beach and looking to fill that sweet tooth, Gelato Classico Italian should fit the bill.  Don't forget to leave a tip!", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "Would have given 5 stars for the gelato, but the owner had such a bad attitude...\n\nWe had a large group of 8 including 4 kids ages 5,6,8 & 8.  The kids were taking a little time to decide and the owner seemed very hassled by that.  Plus, he kept saying that he needed to finish the order so that he could help other customers but funny enough there was no one else in the shop during the entire 25 minutes we were there.  I almost walked out of there but we were already half way through getting our gelatos and the kids would have been very upset.\n\nOne of the ladies working there apologized for the bad behavior of the owner.  \n\nAnyway, I believe that customer service is either a 5 or zero rating so these guys get 1 star because at least one of the employees was apologetic.  \n\nAnyway, hopefully the owner reads this review and rethinks his approach to doing business.", "author": "Ajay R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-23", "description": "Gelato is decent but the service was horrible. Was served by this girl who did not smile the entire time and looked like she she'd rather be elsewhere. Her lack of proper customer service and attitude made a stick up the you-know-where feel like the best feeling ever. Btw, they limit you to only 2 samples per person.. which is ridiculous since the small size cup allows up to 2 flavors. Who the hell only chooses the 2 flavors they tried??? Especially if I wanted a size or two larger? Pretty stingy if you ask me.. also, they don't inform you of this limitation until after you tried it. WTF!?!? Lastly, cash only. Bad customer service, limited sampling, and no credit card machine equates to 1 star in my book.", "author": "Yan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "Creamy, subtle and delicious!! Tried the dark chocolate and strawberry fresca combination small cup and it was so good!! I was I'd gotten the bigger cup. It's a little on the pricier side at $4.25 for a small, but it was so good I didn't really mind!! Mmmm my mouth waters...", "author": "Ashmita V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-07", "description": "This place was across from Tony's and my friends and I decided to eat here while we were waiting for our food.\n\nThe gelato here was decent, but it otherwise wasn't that much more memorable for me. There's a big ice cream cone outside so it was pretty easy to find for me.\n\nWith Naia so close by it makes it harder to come here for me.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "I knew I liked gelato, but I didn't know I loved it this much until I came here. Let me try to write this review in between bites of deliciousness--and trust me, it's harder than it sounds. \n\nI got the dang chocolate covered strawberry and mint (you can have 1-2 flavors in the littlest cup) and man, was it a fabulous mixture. I loved the consistency of it, thick and creamy; yet, each bite melted in your mouth right as it reached your tongue.  \n\nThe employees were awesome as well, they took the time to talk with us and make sure we had been fully helped before they moved on to the next customer. Which is rare, I feel people are constantly trying to keep us moving, and it was nice to slow down and enjoy the entire experience. \n\nTIPS & TRICKS: \n* Ask for a sample. There is nothing wrong with making sure you like the flavor you purchase. \n* I wish they had a \"check-in\" coupon for you Yelpers, I would be there so often though...it's probably good they don't have that (however, Gelato Classico Italian, if you are reading this now, COUPONS NEVER HURT ANYONE--just saying). \n* Recreate this photo. Tag me in it. Become my BFF.", "author": "Haley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Good quality gelato and Italian ice sodas\n\nProfessional and polite employee helped us on Sunday (7/31/16)\n\nClose to most Little Italy restaurants - within walking distance of all of them and about a block away from multiple bus stops\n\nYou can taste test any gelato flavor you want before ordering", "author": "Cory H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "It was a hot day. This is an old, nondescript place. All the stuff here looked gross as it was melting. I was just back from Italy, picky as heck. The banana walnut was really delicious, so the gelato itself is spot on, despite the presentation. My friend's mint wasn't as awesome, but still OK. Curious to go when things are less melty!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "This is by far my favorite gelato shop.  Whenever we are in SF and in the mood for some great gelato, Gelato Classico it is...\n\nThis time around we had, Strawberry Fresca--wonderfully fresh strawberries in a great smooth gelato.  I had the Cappuccino Nibss--Think coffee ice cream with great espresso bean nibs throughout. \n\nEvery here gelato is great.  Will be back again!", "author": "Iakona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Wow\nBest Gelato outside Italy\nA lot of places say that they serve gelato \nBut most it's just ice cream . \nIf you have never been to Italy and had real gelato, you wouldn't know. Real gelato is very dense and creamy . The flavors come alive ! This place has real gelato and its GREAT !!!", "author": "Frank M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "I sampled the Double Espresso Bean and Caffe Moca flavors first. Knowing that sampling more flavors would make my life so much more difficult than it needed to be, I ordered a small cup split between these two selections. I liked the Double Espresso Bean the best out of the two - it was light and refreshing, with ground espresso flecks speckled throughout each creamy and silky bite.\n\nCurrently regretting my decision to not try the Tiramisu. What is this life!?", "author": "Megan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Delicious, creamy gelato! Friendly staff too. I definitely think this place deserves more attention, I love it here:)", "author": "Kaylee V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "This is a great gelato spot near the North Beach area. We had just had a fantastic Italian dinner and were in the mood for dessert. There was a short wait, but it was worth it. The gelato was very good and they had a good amount of flavors to offer. It is cash only!", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Delicious and refreshing after walking all day in San Francisco! Great service ! Many flavors to choose from too! A sure winner for anyone in your party. No room to sit so you'll have to take your gelato to go...", "author": "Colleen I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "Love their sorbets, especially the blackberry Cabernet. It's my sisters favorite place too. She's more of a gelato lover. \n\nThe loss of star- the servers could smile a little and be more interactive and went there twice last week and it was closed - despite of their hours showing they're open till 10pm. What a bummer!", "author": "Wildeflower M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "This cute, humble gelato shoppe adds to the ambiance in Little Italian town of North Beach!\n\nThey keep it simple by just serving gelato and I love their cup of Mocha gelato!  They provide a lightly sweetened miniature cracker with it and it adds an Italian touch to the whole cup! \n\nLocated near Washington Square Park, it's a great spot to order up a cup of gelato and to enjoy while possibly lounging at the park!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "Creamy & delicious!  Came here after a Father's Day brunch for a sweet treat. I ordered the chocolate & peanut butter & it was the perfect texture. Tasted divine too", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Maybe other places have more ambitious or avant-garde flavors, but for texture, this place as no equal, and their tastes are pretty good too!", "author": "Bruce C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "My favorite gelato shop in North Beach. They have classic selections and friendly staff that will let you sample a few flavors before committing :) Just remember to bring cash since they don't accept credit cards.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "I got a chocolate milkshake that was pretty good. They had a lot of flavors of gelato so if you're craving stop through.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "We found this gelato place tucked away as we were heading out of Chinatown. The favors are fresh and varied and the service was excellent! She was so patient with my four- and five-year-old, sampling flavor after flavor. We ended up with vanilla ban, dark chocolate, and raspberry. Very tasty!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Came here on a Thursday night and they have amazing gelato with a good amount of choices. You can mix a couple of flavors in one bowl and it is packed in. Service was nice. They are cash only, so be prepared.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "After a carb-loaded meal in North Beach, I needed dessert of course!\n\nCame upon this cozy little gelato shop and ordered a small Coppa Mista, which consists of chocolate, vanilla, almond, and pistachio! Yum! Seriously some of the best gelato I've had in awhile. \n\nMinus one star for the girl behind the counter who had no personality whatsoever.  But, besides that, awesome gelato!\n\nReminder: CASH ONLY!", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "It's gelato and a block from where I spend a lot of my summers. How can I even complain?", "author": "Toni J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "OMG! This gelato was AMAZING!!! So delicious! I wish I could take it with me to Texas! Too bad it wasn't near my hotel, I would have gone everyday!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "This place is a real treat. The gelato was thick and yummy and they have lots of flavors to choose from! Girls that work here are super nice. Only downside is it's Cash Only. There's an ATM inside for your convenience though. It was really great picking this up after dinner in North Beach and then walking through the park while eating it. I felt like I was on a date in a movie.", "author": "Dusty N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Great place to enjoy some amazing gelato after a pie at Tony's.  And you can mix 3 flavors for $4.95.", "author": "Russell C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Gelato is decent. However, I literally saw the girl who took my money put a dollar of my change in the tip jar. UNACCEPTABLE", "author": "Barry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "Some friends and I stopped by this place after grabbing dinner at HRD. We were just looking for a place to get some dessert and I wasn't expecting much, but I was pleasantly surprised. I got the creme brulee and my friend got the strawberry lemonade, both of which were pretty good. I'm not a huge fan of gelato, but I love ice cream in general, and I was impressed by the simultaneous creaminess and lightness of my creme brulee gelato. I don't remember what our other friend got, but because I don't, it was probably pretty forgettable. \n\nAll in all, Gelato Classico was a great after-dinner stop, but I probably wouldn't go out of my way to go there again.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "Had hazelnut and mango (weird combo, I know, but my two favorite flavors). The girl behind the counter was friendly and had a cute European accent. \n\nI usually love hazelnut gelato, but I think Italy ruined it for me. That's where I had the best hazelnut gelato, so the bar is raised so much higher for that flavor now. The hazelnut here was very light and there were some tiny gritty pieces of hazelnut, which provided a nice texture but there were too many little pieces... I like it in moderation.\n\nThe mango was so refreshing and tasted like fresh mango juice from Hong Kong... but with syrup. Either way, I loved it and it was nice to sit at the nearby park and watch the world go by.\n\nMy friend had the tiramisu and it was very nice- I tasted a bit of rum and espresso. Delicious!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Such amaze! Very gelato! So wow! Best serve! Tongue smile! Extremely flavor! Very taste!", "author": "Christyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "Why not....Mommas down the street, Tonys right across and Gelato??!?!?!  Are you F$&@?!$& Kidding Me....I might as well kick my shoes off right after and sit at the park right across the street and think about what I'm gonna eat next!!", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Unique flavors I hadn't seen before. Really crazy gelato. No regrets on a cold San Francisco night!", "author": "Chance T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "The gelato here is delicious! I especially liked their pistachio flavor. The customer service was great. There was a long line when I came and even longer when I left, probably due to its popularity and proximity to nightlife in the area. The only downside is the crazy parking. Anyway, I'd come back!", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "Good gelato reminds me of my time spent in Florence Italy. Great flavor! This will be my stop for sure next time I am in the city and need my gelato fix! \n\nBonus points: \nWhen the lady working here wasn't busy she was taking care of everything making sure the cooler was stocked with drinks refilling the quarter empty gelato tin cleaning the glass, windows, and mirrors! Very clean place thanks for a great cool rest stop.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Dang!  A warm Sunday night, craving Gelato, so we walked passed the other spots, quickly on my recommendation, and the girls that work here decided to close early!! We couldn't get gelato even though posted hours say they are supposed to open for another 20 minutes!  Major bummer!", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "One of the most authentic gelato shops in Little Italy.\nWARNING: CASH ONLY.\n\nI came here after having dinner at Tony's Woodfired Pizza a street down but didn't have any cash. My friends and I debated whether or not we should go to Naia (a chain gelato shop that took credit card) but the women who were in line at Gelato Classico warned us that we'd regret not getting it from here. PLUS they had a yelp sticker outside the store... how can you deny that. So we trekked over to Bank of America and got our gelatos from here.\n\nAMAAAAAAZZZZZINNNNNNNGGGGGG. The store has so many flavors you can choose from and it tasted SO authentic. Can't recall the specific name but I got an espresso coffee flavored one: definitely one of the best.\n\nPlease try if you are out in the area! It's like a trip to Italy for $3.25 :)", "author": "D S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Cute little place. Large selection of flavors. The woman working was very helpful and was able to suggest great flavors that went very well together. I love their pistachio gelato. Of course parking sucks because you're in the city. But if you're ever in the area, I'll recommend it.", "author": "Kayla A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "try their Pistachio Gelato... I became a regular here after that lol. must try if you are in little Italy!", "author": "Roy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Great tasting ice cream: I prefer the fruits (lemon, strawberry etc) but all are great. Small is $3.95, $1 more for each size up.\nCash only.", "author": "dean d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "Stopped in here after exploring the North Beach area for some pistachio gelato. The service was pretty quick and there was a bench for is to sit outside with our pooch. The gelato was good. I'm not sure I would leave my neighborhood to return here when there are closer gelato places to my home, but there was nothing wrong with it. Plus,\nit had a bench outside!", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "Came here on a busy Saturday night so parking was hard to find, but the gelato definitely made up for it! My favorite is the pistachio flavor  My new go-to dessert place in SF!", "author": "Vivian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "cold, creamy, rich, to-die-for gelato!! The man that served us (the owner it seemed?) was extremely unfriendly. i still dream of this gelato though.", "author": "Melissa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "Had gelato from here for the first time the other day and I'm a total fan! \n\nUmm...can we say Coppa Mista gelato please? That would be a combination of chocolate, vanilla, almond and pistachio. It's kinda like heaven on earth. I also got the cherry as well. \n\nBut that Coppa Mista?! DANNNGGGGG. I want to try other flavors that they have but that Coppa Mista will definitely keep me going back to Gelato Classico for more. \n\nFriendly man working the place. Cash only.", "author": "Christine R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-04", "description": "pretty ok, nothing knock my socks off.\n\nonly takes cash, which, always rankles my ankles.\n\nYa feel me/", "author": "Johnny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "Expensive for fro-yo/gelato, but freaking creamy as heck. The cookies and cream flavor is delicious, as are their sorbets. You can't go wrong with gelato on a nice, sunny SF afternoon in North Beach.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-17", "description": "Oldest best gelato in little Italy - that hand pumped stuff.  \n\nFavorites: cookies and cream and peppermint bark Mmmmm", "author": "Rayna A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "The way Gelato is supposed to taste!  Creamy,  sweet and delicious.  Didn't see the sign that sits cash only until after we ordered,  however there is an atm in the shop which worked out!", "author": "Rena A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-02", "description": "As the Holidays start to get into full swing, I find my seasonal addiction to pumpkin proportionately growing.\nThere is little doubt that by the end of December I will have an IV drip filled with some variation of pumpkin or pumpkin spice stuck into my arm.\n\nAnywho, I was first introduced to this amazing pumpkin gelato when I had the Ginger Cake at Park Chow.  It was so good I had to ask our waitress where I could buy a gallon . . . which lead me here.\n\nNow before I go any further, let me just say my rating is not for the gelato itself - the pumpkin gelato alone easily deserves five stars.\n\nHere's the reason they got one star:\nI got a late night hankering for something sweet so I journeyed to the opposite side of town to try Gelato Classico.\nI was elated to find the place was open and walked in with great anticipation of finding my sacred pumpkin gelato.\n\nNow although the door was open, the store was empty.  No worries, right?\nI got a little scared when no one answered after I said hello several times.\nThen thoughts of something sinister happening in the back had me running out the place.\n\nWorst of all, I did not get my GELATO!\nWhat a wasted trip. \n\nThe thing is this little hiccup won't prevent me from going back.\nLike I said at the beginning of the review, I gots to get my pumpkin fix.\n\nHere's hoping the next trip yields a better result.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "Since traveling in Italy and falling in love with gelato my wife and I have been doing our own tasting tour of gelaterias in southern and northern California. After trying about 12 places, many of which were quite good, Gelato Classico is our favorite.\n\nWhat we most liked is that the texture of their gelato is just like the good places in Italy. It has very little air, and has a \"sticky\" consistency, that might be compared nougat or melted cheese. It doesn't taste that way of course, but this is a rich, authentic gelato.\n\nLike most good gelaterias this place is not cheap, but the quality is there. Good flavors, nice service. I no longer live in SF but visit often, and I'm sure I'll be back to Gelato Classico.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "My favorite gelato place. I always order half vanilla bean and half hazelnut. I don't care how much they raise the price. I will get my taste of heaven!", "author": "Irene C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-20", "description": "Seriously big deception,\n\nI was there tonight and the gelato was ok, i was surprised to find pieces of water iced in my gelato, for the price we could think it was a better Gelato.  The server was not very smiling and we haved the baby with us very impressed by all the flavours available.  Probably bored to serve the tourists...  I'll go next time at Swensen 5 blocks away but there's a better experience offered !", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "Really great gelato - my favourite in the city. My kids love it here!\nBut minus 1 star for not very friendly service. My 6 year old son asked to use the bathroom and was told it's not open to customers. I get that, but he's a kid and was pretty desperate.", "author": "Miss M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-22", "description": "Hands down, probably the best gelato I've ever had. The flavor was so rich and creamy, with a smooth texture. I had the crème brûlée and spumoni flavors which were absolutely amazing. The service could be a little better; we were served by some teenaged girl who acted as though scooping gelato was a cruel and unusual punishment.... I've worked in customer service for a long time. Rule number 1: ALWAYS SMILE! And be nice to the customer even when you don't feel like it. Someone here didn't get the memo.", "author": "Brandon W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "So rich and creamy.  Tasted great.  From the car...\n\nThere is absolutely no parking there!  I had to drive in circles for 20 minutes looking for parking while they went inside, at their icecream, and finally brought one out for me as they finished, on my eighth lap around the block.", "author": "Burrito M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-07", "description": "Key Lime Gelato: you are a treat\nYour mix of lime and crumb is just so sweet\n\nI thought to myself, \"key limes are for pies!\"\nBut the ice cream man said, \"give it a try!\"\n\nMmm, mmm, mmm, with each lick of the spoon,\nI became weak at the knees, began to swoon\n\nGelato Clasico lives next to the boy,\nand it's a debate over which gives more joy.\n\nThe little sweet shop is just so quaint;\nWith all of the flavors I should be in restraints.\n\nI'll be back for key lime, probably real soon,\nSo get ready, North Beach, to watch my bottom balloon.", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "THE best gelato ever.  I've never been able to find anything compared to it, which is why I've been a loyal customer for over 25 years.   Don't forget to bring cash.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "Yum!  Yummy Gelato!  I tried a bunch of flavors and you really cannot go wrong.  Once my boyfriend and I got our gelato we did not speak until we were finished.  \n\nIt is great to go after a date to finish off the evening or to go with friends or family.  There are lots of places for dinner nearby so this is a great after dinner spot.  The park is close by so you can get your ice cream then eat it in the park. \n\nPrices were reasonable.  I think it was around $2 per scoop.", "author": "Vagabond V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-20", "description": "Meh, nothing to write home about. The gelato was so so and there wasn't a wide selection. A forgettable experience......", "author": "Kim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "Most gelatos all tend to taste the same to me, and for the most part, most of the gelatos here are all just as good as any other gelateria, but the standout flavor for sure is the pistachio. It's unlike any other pistachio gelato I've ever had - they grind up pistachio nuts into almost a pistachio meal and mix it into the gelato. Fantastic!", "author": "Tiffany F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "I've had gelatto all over the country... this is the real deal.\n\nSilky smooth, caressing all of your senses at once... literally orgasmic.\n\nSome of the most unusual flavors & blends I have found.. along with old favorites.\n\nI had the spumoni... a new take on an old classic... the flavors burst out like fireworks on the 4th of July.. truly the best of the flavors I sampled...\n\nI may have to move to San Fran just to be close to this gem!", "author": "Gregg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Good gelato, very creamy and gooey. I had cookies and cream and rocky road and enjoyed both!", "author": "Erin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Gelato Classico is very good. It has an amazing location and is right next to a good taco place. The shopkeeper is very friendly and served us quickly. It is quiet and delicious. I had the dark chocolate in a small cup. It was more than enough and highly rich. It was an amazing end to a great night.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "Gelato Classico Italian changes the \"Gelato Game\". Tried the vanilla bean, strawberry, coppa mista, and caramel chocolate crunch. My absolute favorite was the coppa mista, but all of the other flavors were just as good. I felt like such a fatboy licking every little bit of gelato left in my cup. But that's how good it was...", "author": "Desiree B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "So yummy! My hubby used to go here as a kid and still as good as he remembers. I highly recommend the coppa mista and the mocha almond fudge!", "author": "Erin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "Yummy, great place to sit and share a gelato with your better half (or like us, have dessert first while you're waiting for Tony's to text you and let you know your table is ready)! Friendly lady behind the counter, and you can pick multiple flavors for your gelato creation. Stick a pirouette cookie in the top, they are tasty!", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-09", "description": "During a day trip in San Francisco I searched Yelp for the nearest gelato shop and landed upon this little gem among more mainstream ice cream shops around the city. My recent trip to Venice has made me quite a gelato addict, and the gelato at Gelato Classico Italian did not disappoint. I had half strawberry lemonade and half mango gelato, both of which were quite natural and tantalizing flavors.The mango gelato was by far my favorite, as it truly had the authentic taste of a pure mango. I only wish there were gelato shops like this in my small hometown!", "author": "Lindsey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "One of the best, smoothest, and most authentic gelatos I've had in the city! I have nothing more to say than GET IT!! Rain or shine you will not be disappointed!\nMy all time favorite flavor is the expresso coffee. \n\nWith union square near by, it's more the reason to enjoy your gelato!", "author": "Annie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "Yay! I love Gelato Classico! Everytime we stop by North Beach to Zioccolato's taffy, we gotta end up with gelato! I'll make this short and sweet (pun intended?)\n\nGood:\n- staff is friendly and accommodating\n- fast service!\n- cookies and cream is a must-try!\n\nBad:\n- we had to turn on our blinkers and park illegally because parking sucks\n- small space, I don't think you and your huge group of friends can eat inside =[\n- $3.50 without crv. Pricey but they serve such small portions\n\nWe always come back anyway!", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "At least a dozen flavors. Cafe mocha was my favorite. A little pricey. One scoop cone and a one scoop cup were almost $10.", "author": "Malika A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "I've always enjoyed their gelato, it's fairly priced and it's oooh so good. Their Pistachio and Raspberry white chocolate cheesecake is mmmm!", "author": "Bahar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-18", "description": "Gelato Classico in Palo Alto was having some issues last night and shutdown at 9pm instead of 11pm. I was so disappointed because i wanted to try the Honey Lavender gelato. So what'd we end up doing?\nDrove allllllllllllllllll the way from Palo Alto to North Beach, SF.\n\nThis location has GINGER gelato. TRY IT!! At first I was very skeptical, but the ginger taste is very light and the chunks of candied ginger in the gelato are truly heavenly. \n\nI want more now just thinking about it.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Excellent gelato. Strawberry Fresca is delicious and refreshing-just the right amount of sweet and tart fresh strawberries.", "author": "Debbie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "I remember going here as a little girl. It was always an exciting treat! \nAt the time I barely noticed the hill. Now on visits I do. :-)\nI always loved the Glace triangular shaped wafer cookies. They are a nice touch! I tend to favor their Vanilla Bean Gelato! \n\nDelzioso!!! :-)\n\nI love gelato & have eaten it in Milano, Roma/Rome e Firenze/Florence Italia/Italy, New York, New Jersey haha, San Francisco & Los Angeles, CA\n* It is cash only.", "author": "Christina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "I am not sure how I haven't written a review for this place...one of my favorites. I know there are about a gazillion and one gelato places in the city. And there are new ice cream places popping up everyday but there is something about this place. I just love it. The gelato is so creamy and perfect on the sunny day. I love getting a cone and laying out at the park. It's a favorite pastime during the summer.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-22", "description": "Great gelato, I love the spumoni which tastes as good as the traditional ice cream i had in rome! My fiance is a fan of the bavarian mint. mmm....\n\nTip! Be sure and get a frequent visitor card (buy 10 get one free!)", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "YUMMMM...it was a hot day and your gelato is GOOD.  The price for a small is relatively pricey - about $3.75 for a small (1 or 2 flavors).  They have a good mix of different gelatos an they also have some wafters you can buy if you want some crunchy stuff. YUM!!\n\nI had the Tiramisu and Mocha/Almond mix. Both were tasty...although the sun melted my gelato too quickly. I got a nice soup from it though...not as tasty.  I subtract 1 star only because my gelato had started to melt before I even dug in...\n\nIf you live/work/end up in the neighborhood often, don't forget to get their card for buy 10 get 1 free!", "author": "Lily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "Huge chocolate fan, so the dark chocolate didn't disappoint. It was rich, smooth, chocolatety. This will easily satisfy any chocolate lover. And the consistency of the gelato is legit. If you're not, there are plenty of other good flavors to choose from.\n\nCash only!", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "This gelato place has the best gelato I've had yet to experience. The flavors are widely ranged from chocolate to fruity to mint choices, so everyone can be satisfied. It's about $3.50 for a small, but since gelato is so creamy you don't really need anything bigger. There are only two tables inside so there's not much room to sit down, but walking around little Italy is always nice. I can't wait to come back again!", "author": "Samantha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-30", "description": "A sunny day in North Beach calls for gelato. \n\nAnd gelato we got. \n\nSadly, the service here was HORRIBLE. We were kept waiting for minutes before the girl behind the counter came out to stare at us for our order. There was no greeting, no friendly smile, nothing. \n\nAfter picking out our gelato, she would wipe the excess with a towel that was just laying on the counter.  Fortunately, she didn't wipe mine. Otherwise, I would have pitched a FIT because, ew, did not know if the towel was clean or not.\n\nI picked a lemonade sorbet and it was really refreshing, perfect for the warm weather.  I would give this place more stars if not for the cleanliness and service issues.", "author": "Julia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "CASH ONLY!\n\nMy wife and I got a small with Peanut Butter Cup + Chocolate Peanut Butter.  It was chilly (and they leave their front door open), so we walked a block over to our car and ate it - lol.\n\nVery good gelato.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-07", "description": "On a hot summer's day walking up Union street away from the crowds of dogs and babies and baby dogs in Washington Park we stumbled upon this place, neatly tucked away right near Jasper alley.\n\nThe gelato looked a little melt-y through the display windows, but the gelato was still delicious. I had the Pomegranate, the girl had a ginger hazelnut/chocolate blend. Both were quite delectable.\n\nThe price was right on, and the service was friendly. This is a small place, about the size of a shoe box, which adds to the ambiance a bit (if gelato shops can have ambiance).", "author": "Wes T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "We stopped over late last night after dinner and they just closed shop...or were they? She kindly opened the door for us like puppies out in the rain at your doorstep.  Sweet gal for taking us in.  I had the Bavarian Mint and Pistachio.  Creamy, Gooey, Goodness!!", "author": "Alvin J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-27", "description": "Boo on you Gelato Classico:\nThe service was horrible.  She didn't greet us-not even a smile, not even a smirk. Actually, I probably wouldn't even notice if she had a nonchalant attitude, but she just had an annoyed look the whole time she was helping us.  It felt like we were an inconvenience to her by just existing. Grrrrr to you too girl!\n\nGelato alone: there was an assortment of flavors and varieties of sorbet, but unfortunately everything was melted and runny.  The consistency was similar to a milk-shake.", "author": "Thao T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-14", "description": "Got the pistachio and mocha - 75% of the cup was pistachio.\n\nThe textures of both were off - they were grainy, which took away from the otherwise good flavor.\n\nThe lady was all business - not much charm to this joint. No point in coming here over Naia or Ciao Bella from the freezer case.", "author": "Shal J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-05", "description": "Pretty good gelato.  I especially liked the limoncello poppyseed - yum yum.  \n\nServer was super nice and let me taste like at least 4 different gelatos (because I'm indecisive) and they were generous scoops too.\n\nHowever, I have to confess my heart belongs to Naia (how could it not when there's one down the street from me in the Castro?) and I was really sad to find out after I got Gelato Classico that there's a Naia just down the street.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "This is my favorite gelato place! Rich, creamy and delicious, you can't go wrong with any of their flavors. I love their Espresso and Coppa Mista and even their plain old Vanilla Bean is amazing! Also, if you want to get something fresher and lighter, they usually have a great selection of sorbeto, too. My favorite is the Strawberry Lemonade, but again, you can't go wrong. Definitely try this place next time you have a craving for something sweet!", "author": "CJ J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-22", "description": "Good place for gelato. I don't really like the hours, though.", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-13", "description": "This low-key, tiny gelateria is much more superior in quality and taste than Naia. \n\nAlthough I enjoy the wide array of flavors at naia, the gelato here tastes better, has a better consistency (naia can be kind of slimey)  and the flavor selection, although small, is much tastier. \n\nFavs include Mango, Limoncello Poppy seed, and Strawberry.", "author": "lauren j."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-07", "description": "I thought it tasted like ice cream, not gelato.  My husband is from Italy, so this was just another ice cream shop in the Bay Area to him.", "author": "Shelbi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "After relaxing in the park for a bit we decided to come here to chill out a bit. I like the tiramisu here and the mango is quite good if you're looking for something more refreshing. The flavors are all on point and make for very delicious gelato.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "Delicious:) over 15 flavors. Small and not a lot of space. But the gelato is perfection! I forgot what it's called but it had caramel and chocolate!!:) try it whenever you find yourself in the area. $5 for a regular cup & 2 flavors!!", "author": "Corina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "Who needs Ice Cream when you can have Gelato!! When my boyfriend and I first started dating six years ago we found this little place. We both lived in the East Bay and would sometimes race the clock from Hayward or Alameda to get over the bridge, through the woods to the Gelato house we'd go! Now that we live in SF, we go there anytime our sweet tooth aches. In fact, our families love it too! Whenever anyone comes to visit, we have to be sure and take them for Gelato. \n\nIf you ask me, the best combo is chocolate, hazelnut and raspberry sorbet. The boyfriend LOVES the cabernet sorbet but they don't always have that flavor in the tank. \n\nYou have to try this place!!\n\nCon: The girl who usually works in the evenings in not very friendly at all but we've come to laugh at it now. I am a firm believer in good, old fashion customer service...but I guess if your product is good enough you'll stay in business. We keep going back, LOL.", "author": "Tiffany G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "Forget Naia and other gelaterias trying to emulate the real thing... Gelato Classico, for as simple as its location is, is also the San Francisco gelato closest to the real thing found in Italy! \n\nOf course, even in Italy you can have bad gelato, but this is the closest to some of the freshest gelatos made with the most wholesome ingredients. \n\nIt's delish! Go have some.", "author": "OcchiDiGatto S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-15", "description": "Sorry Marco Polo....  \nI know,\nyou're only a few blocks away....\nYou give me what I need...\nI love you.\nI had a weak moment this past weekend.\nI was at the North Beach Festival on Sunday...\nI was hot,\nsweaty.\nI was in the mood.\nGelato Classico and I...\nwe made eye contact.\nShe flirted with me.... said she could give me what she knew I needed...\nYeah.\nWe f----d.\nWe F-----D!\nYou happy???  YEAH!\nI F----D HER!\nbut....\nI \"love\" you... =P...\nummm......\nuuuggghhhh...\nmaybe we should just be.....\n 'friends'...\n\npssst.  Gelato Classico....\nc-ya next weekend baby!", "author": "Barry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-14", "description": "Tiny walk-in place with lots of varieties of Gelato.  I'm always in the mood for ice cream when I go to the city so when we walked by this place I thought I'd give it a try.  The last time I had Gelato was in Granada Spain so I was skeptical if I could ever get anything that good again.  I asked to sample the hazlenut but didn't care for it.  Then I saw the mango - yes, I'll have that!  And as it turned out, my instincts were correct, you can never go wrong with mango anything!  It was heavenly and for $3.75 I got a perfect scoop in a cone that filled me up until dinner time - NUMMIES!", "author": "Ruthie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "We stopped by here after hanging out in Washington Square Park for the North Beach Festival. \n\nI had one scoop of Caramel Chocolate Crunch and one scoop of the mint. It was very, very good. The place is super small but luckily, the bench outside was empty so we parked ourselves there and ate. \n\nThe price was a bit high but not enough to deter me. I'll go back again if I'm ever in the area.", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "I was playing chauffeur for the day and while I was waiting in north beach I decided to find a parking space and get me some gelato.  \n\nMy friend first introduced me to this place when he surprised me with a pint! MmmmMm! When I walked in the first thing i noticed was how expensive it was!! I quickly looked in my wallet to see if i had enough cash (I don't ever carry cash!).. luckily i had exactly 3 dollars and some quarters that i didn't use to feed the meter. \n\nI got a small - vanilla bean and hazelnut.  I'm a very plain person, and besides when my friend got me the pint before I remember fighting with him over the vanilla bean, cause it was sooOo good!  I actually really liked the vanilla + hazelnut combo, that might just be my usual order because i don't like to ruin a good thing =)", "author": "JUDY L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "S P U M O N I.\n\nA FXXXin Bitch was working there gave ma a nasty look.\nI just couldn't say that \"Spumoni\" FAST. OK?\nAssHole!\nShe gave me eye Fxxx sayin', \" I'll get you FXXXin' Spumoni so get a FXXXOutHere!\"\nI could tell by just lookin' at her that she hates the job but, The eyes, she gave me.\nGet laid FXXXin' Bitch!\nShe looked like ugly version of Sara Palin without glasses.\n\nI don't care.\n\nI asked to my GF instead, \"What's Spumoni my darling?\"\nShe said, \"Oh My dear, it's a...... let's look up.\"\nSo, she was surfing with her Iphone.\nAt the same time, she sent a message to her Italian frind asking same question about Spumoni.\n\nHe replied, \"Nasty.\"\n\nI didn't know that Spumoni is senior people's favor.\nWell,.......\nEven though I got the nasty Bitch gave me Spumoni, but that's NOT GOING TO STOP my craving for Gelato.\n\nI'LL BE BACK!\n\nI have heard that the place is the original Gelato in SF?\n\nPatty W. said, \"So, Did you like the Spumoni?\"\n\nWell, I ate it. it wasn't that bad but I'm NOT going to get it again for sure.\nI'm not that old yet.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "First gelato place I went to after moving to North Beach, and I will NOT be looking for another! Friendly older man seems to run the place most of the time. \n\nI had the banana split and my boyfriend had the peanut butter. We both loved them! Definitely check out this place!", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-30", "description": "I absolutely LOVE gelato... My all time favorite is the mint chocolate chip. There was no line when I went there and it was just perfect. Only flaw is parking.", "author": "Anji W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "Really yummy and decent prices. I had the double espresso. It was really good. My friend enjoyed it too. For under $5 it sure the hell beats Tuttimelon..lol", "author": "Bella B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-19", "description": "It's hard to believe I still haven't been able to find a gelato shop in San Francisco that is better or at least as good as the gelato shops in LA/OC I liked (e.g., Pazzo in Silverlake and, even though it is a chain, I like Gelato Paradiso in OC).  \n\nAs is the case at Dolce Gelato on Sutter and Ciao Bella in the Ferry Building, Gelato Classico Italian does not offer creative flavors. What you find here is pretty basic: strawberry, banana, vanilla, chocolate, etc. In addition, I can't quite identify what exactly is missing or wrong with the gelato here, but it just tastes like they took a shortcut when making it. I had their tiramisu and creme brulee flavored gelato, and it left a strange aftertaste. Was it corn syrup instead of real sugar? I don't know. \n\nHence my quest to find a perfect gelato shop in the city continues....", "author": "Nana N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-21", "description": "I know I'm on an island here (given what the other reviewers have said versus where I'm headed), but I've been very disappointed in my experiences here. Prices aren't great and the staff, well, the staff can be kind of rude. I live a block away from this place and I've been there three times (I always make sure to give the local place an opportunity to succeed). Every time has been worse than the time before. There's simply too many other options. \n\nSorry Gelato Classico.", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-29", "description": "All you lemmings can line up for the latest Fro-Yo grand opening...I'll be at Gelato Classico throwing back the tastiest gelato this side of Rome.\n\nI know, I know...gelato isn't the best thing in the world for a man watching his waifish figure but when I'm in the mood for a treat (aka wandering drunk around North Beach) I'll take some creamy gelato goodness and make it a double.", "author": "phil h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "The Coppa Mista is amazing!!! \n\nThis is my favorite local gelato spot and the inspiration for my running. They have a nice selection of light and 97% fat free gelato that I generally look at before ordering my regular Coppa Mista.", "author": "Thel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "I've never known such a thing as \"bad gelato\". I don't think it exists. I think it's impossible to have bad gelato... like bad ice cream. Can dessert ever really be bad?\n\nThe shop is cute and right in the heart of north beach. It's only a block away from Naia and if you have the choice, go here over Naia any day. The prices are standard for gelato: about 3.50 for a small and 4.25 for a regular. Same small portions and same small spoons, but very rich, creamy taste.\n\nI sampled the lemon poppyseed and unlike many yelpers, I was not a fan. But I do love the coppa mista. Amazing combination that was rich, nutty, but not overly sweet at the same time. I had that with the hazelnut, which was the best I've had but I'm sure there are better ones out there.\n\nGreat little place, but my one complaint is that they nickel and dime you to death. 25 cents if you want a waffer cookie no bigger than 2 inches diameter to go with your gelato... you think they could at least give it to you complimentary if desired. I did not want a cookie. That was not the point. The point is I'd like to know that I wouldn't be charged extra in order to get one.\n\nOther than that, great shop and great location. Good flavors. Have not tried their sorbet, but I will at some point.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-10", "description": "I highly recommend that whenever you come to North Beach for dinner, skip the dessert menu and walk over to Gelato Classico for some authentic Italian gelato instead (it tastes just as good as the ones in Italy).  The walk itself is a treat because you get to browse all the fun shops (day) and hot bars (night).  \n\nThey had many great selection, and they allow you to get 2 different flavors for small cup, 3 flavors for medium cup, and 4 flavors for large cup.  Not sure if I want to recommend that as the flavor all gets co-mingled and I can't tell one flavor from the other.  \n\nBring CASH because this is a CASH only establishment.", "author": "Gin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-10", "description": "When frequenting Gelato Classico Italian, I order the Chocolate and Peanut butter.  I want to try other things.  When I go with friends, I steal some of their delicious Ginger or Tiramisu, but I keep getting the same thing.  \n\nLeave room when going out in North Beach and head over here to try out the goods.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "It's gelato, how can it be bad?  Seriously people!\n\nit's off from the main strip and away from the crowds but this little gem remains and plenty people seek them out or come upon them in their good fortune.\n\nCurrent favorite is the lemincello poppyseed, SO refreshing yet very creamy *drool*!  My niece loved her strawberry fresca.  It was her very first gelato and it was a pleasure to see her enjoy every bite of it.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-03", "description": "They serve the same brand of gelato you can find a million other places (Caffe Classico's Gelato Classico).  It's good gelato - I love the Caramello Chocolate Crunch.\n\nThe prices are exorbitant and the service was poor.  The lady working the counter didn't do anything in particular that was so bad, but she was devoid of niceness to the point of rudeness.  My son's gelato seemed to have suffered from improper storage and handling, turning it gummy.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-01", "description": "I have been going to this place ever since I was a little girl. The ice cream here is absolutely fabulous. It's nice to get a scoop of my all time favorite coffee flavored gelato and stroll down to Washington square park. I always find a nice bench to sit and watch people. It's always a relaxing moment for me. Once in a while I become a good Catholic and go into my favorite church, St. Peter and Paul which is just around the corner.", "author": "Helper C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "I love frozen treats. This was very much a treat, but it didn't stay frozen for very long because it was San-Jose-hot in San Francisco this past weekend (craze). The spumoni was very delish and dark choco gelato never does me wrong. Enjoyed my snack in the park right across the street too. :)", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "Love the White Chocolate Decadenza.  Not to mention that I top it up with Limoncello Poppyceed.  Word up!  It must be the ice cream rush cause I'm still kinda high untill now.  They are very creamy and thick.  \n\nThere's limited seating available but there's a bench right outside of the shop.  As the matter of fact, sitting out has so much better view.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-05", "description": "Really really really yummy hazelnut icecream- which is all I have had so far.  Next on my agenda is the dark chocolate.\r\n\r\n9/19 Ok so now I have had the dark chocolate with pistachio and almonds. My god, it's good stuff.", "author": "Carrie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "The gelato is great.  My favorite was the banana walnut and the blackberry... something.  Something blackberry wine.  Great stuff.  Too bad LA doesn't have gelato everywhere.", "author": "Elizabeth A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Great gelato at a great price. $3.95 for a small with two flavors. Plenty for my husband and I to split!", "author": "Kayla C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-15", "description": "gelato is damn good, and you can get some at this place. although why is it after they scoop it in the cup it is flattened out. meaning they remove the excess that goes beyond the cylinder of the cup?!?!\n\ngelato is already damn expensive and this practice makes it even more so. \n\nit taste good here and on par with others, but the shady practice of flattening out the cup led me to deduct 2 stars right away.\n\nToo bad too because the rest of the place looks promising. looks like a nice neighborhood ice cream shop.", "author": "Eugene N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "I love Gelato. Walking through North Beach makes me think about my trip to Venice. When I was in Venice I had gelato everyday! The Gelato here was awesome. I had hazelnut chocolate and pistachio. I would definitely come back for more. The sorbet flavors looked awesome too!", "author": "Annie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-21", "description": "This is the best gelato i've had in San Francisco.  This is a small ice cream shop in the heart of North Beach.  While the service may not be the best, you don't go for the service, you go for the gelato.  \n\nThey have a decent amount of flavors.  They prices are a bit pricey , but in my opinion, you pay for what you get.  And this is some good gelato!", "author": "Ferdinand B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-18", "description": "This is the 6th highest rated ice cream establishment on San Francisco Citysearch, so I had high expectations. I won't argue with the fact that this place does have some excellent flavors (of the ones we tried, tiramisu was probably the best). However, the gelato has two major weaknesses.\n\n1) The texture is rather chalky. The lower the milkfat content, the harder this chalkiness becomes to avoid, but I've had a lot better executed gelatos.\n\n2) Many of the flavors feel too weak. For example, I could hardly taste the strawberry in my strawberry!! There is a crucial distinction between a subtle flavor and a weak one. For well-executed subtlety, try a good hazelnut ice cream, such as Toscanini's Nocciola. These flavors were a bit uninspired (and in the other direction, the dark chocolate was too obviously just a whole lot of cocoa powder chucked into an ice cream base).\n\nAs a third point, the serving temperature is probably a squeak on the warm side, just past the soft / melting line. However, many people prefer this, so it's more of an informational point than a direct criticism.", "author": "Amal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-11", "description": "Always EXCELLENT gelato. Need I say more?\n\n(Oh yeah--try the Key Lime Pie)\n\nBetter than Naia down the street, by the way. Naia's good too, but I think they try too hard with some of their funky flavors.", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-09", "description": "Tiny. Hidden. But oh so tasty! Gelato is perfect for any after dinner desert, whether the weather (ya' like that?) is hot or cold. The woman behind the counter was friendly and more than happy to serve up taster spoons for us so we could waffle and be indecisive before making the perfect gelato choice.\n\nI can't belive I went by this place for years and never went in. Talk about needing to make up for lost time. I definitely recommend this place for a quick fix.", "author": "Gregg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-26", "description": "I finally found some REAL ice-cream in North Beach. \n\nA bit out of the way and not very well-lit during daytime, but who cares? \nCreamy, yummy ice-cream that really tastes the way is supposed to. \n\nExtra credit for having a gigantic ice-cream cone statue outside, very photo-friendly.", "author": "Tomas V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-07", "description": "Heavenly.  Decadent.  Quality.\n\nThere's not really much to say about Classico Italian except that it's the best gelato you'll get in San Francisco. \n\nPeanut butter fans MUST get the PB.  It's like frozen peanut butter infused with sweet cream swirls. Melts in your mouth and melts your heart too!\n\nI've sampled many  other flavors (all of which are exceptional) but I can guarantee you that one half of my cup will always be filled with the peanut butter.\n\nKnow Before You Go:\n1. Get the peanut butter!!!\n2. A small is PLENTY for the average dessert lover - they really pack it in.  Crazy gelato fans may venture to the medium or large.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-13", "description": "Yeah! This is my favorite gelato place in North Beach (though I have to admit, I haven't tried them all). I try to hit this place up every time I'm in the area. I always tell friends to look for the place with the giant ice cream sign on the sidewalk, but they can never seem to find it for some reason.\n\nAnyway, the prices are pretty good here, the selection is tempting and you can put up to three flavors in a cup! It's so luscious. Why don't I have some in my hand right now!?", "author": "Lea B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "I'll agree with the last reviewer that two flavors intermingle, though the woman at the counter did try to have two distinct halves in my cup.\n\nI got the strawberry cheesecake and the white chocolate decadenza so they actually mixed well. \n\nI lived 2 blocks away from it in San Francisco, so I'm kind of embarrassed that I never tried it until I was a tourist. \n\nWhat I had was very tasty and I would go back the next time I'm jonesing for something sweet in North Beach.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "came here after a big brunch. The gelato are creamy and delicious! love!", "author": "Jessie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-14", "description": "Gelato Classico has been in this same location for years. I remember my dad bringing me here when I was a child. \n\nAnyway it is a really small little store so it is often stuffy inside. But the Gelato is really good. I don't really like to explore new things when I go to a place that I haven't been in awhile. Because if I don't like it then i'm pissed because I wasted my  money on some bullshit when I know if i would've got what I always get I would be much happier! \n\nAnyhow I Love the Coppa Mista with whipped cream, chocolate fudge and a cookie... it is so good.\n\nSooo if you're anywhere near North Beach it''s worth a try.", "author": "Nette A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-31", "description": "North Beach isn't North Beach with out a stop for Gelato at Gelato Classico. I used to order the large with Dark Chocolate and Raspberry Sorbet. Now I'd settle with a small (perfect amount) and you can still choose a couple of flavors to combine. Espresso really compliments your frozen treat so fire one of those up too while your at it. Tiny place, parking blows, but well worth it!!", "author": "Matt E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "This place has become bad news for me. Not because it's bad, but because it's so freaking good I want to stop there every time I walk by. And I pretty much do... which is way too often. \n\nI can't really suggest a certain flavor because I haven't had one that I don't like. But I will say that I really enjoy that the pie flavors actually have chunks of crust in them, so I'm a pretty big fan of the strawberry cheesecake. That being said, can you ever go wrong with peanut butter cup or cookie dough?", "author": "Ben R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "As promised, I gave this place a second try, this time on the 4th of July after a hilarious fireworks show that went something like this...\n\nHear: \"bang. bang. BANGBANGBANGBANG!!!\"\nSee: NOTHING but an opaque sheet of fog\n\nUnlike the fireworks, Gelato Classico did not disappoint this time:\n1. Our server was super nice and offered us many try-before-you-buy spoons of gelato.\n2. They did have the limoncello poppyseed gelato everyone raves about...tastay!\n3. They had a new lychee flavor...also tastay! (although since it was untouched before I went around 10:15pm I'm guessing that flavor's not coming back)", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "I went here today while I was roaming around downtown and North Beach. After hanging out, loafing around, and people-watching in the middle of nearby Jefferson Square, we decided to head over and get some gelato. We were in the mood for it: we had caught some rays, spotted the store as we walked up for a late lunch at North Beach Pizza, which is also nearby, and we just decided that we had a collective sweet tooth. We weren't disappointed.\n\nThere was a man who was quite charming and rather friendly giving us the gelato. The prices are a little high but given gelato, they're actually quite decent or \"regular,\" for lack of a better term. I had two flavors in my regular-size: white chocolate decadenzza and strawberry cheesecake; they both sounded (and tasted) rather good. They also mixed quite well. My best friend also had a regular with cookie dough and chocolate (something or the other), which she said was super fantastic as well.\n\nWe left pleased. Pick up a card, as they have a buy ten, get one free special. You'll probably come back a lot.", "author": "Rick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-23", "description": "I have hot flashes when I think about the Pear-Chardonnay flavour... SERIOUSLY, if they are packing Pear Chardonnay you get some, then get a couple pints and drop them at my house.  It's AMAZING (far superior than Ciao Bella's very weak vino-inspired flavours.)\n\nMagnificent, real-deal gelato.  (Which means more REAL than Ciao Bella, Copa Loca, Tango on Fillmore and even Naia (which is tasty but not as real).)   \n\nOne of the few purveyors of authentic Coppa Mista flavour-- an italian gelateria tradition-- hazelnut and pistachio blended with vanilla and chocolate.  They also sell coffee in the shop and candy.  There's a reason it's the featured gelato of various small shops in SF.\n\nIt's location overlooking Washington Square Park is all the more brilliant for those romanticizing foodie freaks... order some gelato and stroll through North Beach discussing DiMaggio and Monroe.", "author": "E L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-02", "description": "3.75 star maybe. Pretty good gelato! \n\nThe very unique one is the lime poppy seeds. It's so refreshing!!\n\nI still like Holy Gelato the best in the gelato catagory.", "author": "Yuchi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "22 years later, and the gelato is still yummy. Pistachio was great, but the spumoni was off a bit. Strawberry is always good.", "author": "Angela V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-15", "description": "Mmmm.  I should NEVER have stopped at this little gelateria just around the corner from my house.  Though I'm generally a fan of light, icy freezes, the Caramello Crunch was a thick, sticky ball of deliciousness I know I'll come back to!  Rarely do I finish a cone and immediately crave another, but it was a monumental feat of willpower not to get a second cone for the road!\nSkip Naia and come here!", "author": "Kri B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "Tiny, almost tucked away yet such a good find!\nPro: Damn yummy, near the park, plenty of flavors.\nCon: Cash only", "author": "Not U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-05", "description": "Yea yea, this is a chain gelato store but guess what?  WHO CARES?\n\nWhen I lived in North Beach, I LOVED walking to this gelato place either on a hot summer day or a warm summer night to get a scoop of some tasty gelato!", "author": "Keika L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-15", "description": "As part of my ongoing quest to find decent gelato in the Bay Area (after returning from my third trip to Italy), I made the trek out to the city to try Gelato Classico. Word on the street is that it's pretty good. Of course, most of the gelato you can find in this greater metropolitan area is bafflingly awful compared to the real thing in Italy, so I take any gelato recommendations here with a colossal grain of salt. \n\nAt any rate, I was pleasantly surprised by their gelato. I had a cone with gianduia (a cioccolato and nocciola combo) and a scoop of the tiramisu. The texture was smoother and creamier, and closer to authentic Italian gelato, than the grainy grit or hard-as-a-rock iciness of other gelaterie around these parts. The biggest problem with gelato in the US is that no one seems to get the texture right and it's usually either too hard and too cold and/or icy, or strangely gritty or chalky. But Gelato Classico seems like they are trying harder to replicate the super smooth consistency of Italian gelato. It was almost a wee bit too goopy or gooey, though, as if they were overcompensating or something. \n\nThe flavors were decent. Not quite as rich and potent as they should've been (for example, the hazelnut tasted weak), but overall, things tasted okay. \n\nBut wait, there's more! We asked if they made their gelato on the premises. \"No!\" they said. Shock! Horror! Of course every self-respecting gelato snob knows to avoid shops that don't make their own gelato right there in the back room. They said their gelato is made in Concord. Yeah, that had us scratching our heads too. But strangely, bizarrely, their gelato is still far superior to Gelateria Naia (who's inferior gelato, they claim, is made on the premises). It's still inferior to the best gelato you can find in Italy, but I give them points for trying.", "author": "Giofreddo W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "I've had a lot of gelato in the U.S. and Italy, but the two flavors I tried here were more like ice cream out of Cold Stone than the light, soft, glossy & flavorful stuff I would consider gelato. \n\nIt was tasty, but not my idea of real gelato.", "author": "Sara W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-13", "description": "Tried the strawberry lemonade, nah too sweet. Tried the tart yougurt, disappointment.. too sour... So ended up ordering mango n lemon gelato. O... My tummy hurts!", "author": "Monika T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-22", "description": "I'm a sucka for a good ice-cream.\nTried green tea, mango, coffee and ginger gelato - never dissapointed!", "author": "Cat of a Donut J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-16", "description": "It was alright. Not as good as Frost in Tucson, but it was pretty great having gelato at Washington Square.", "author": "David J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "Love this place! Love LOVE LOVE....I LOVE those wafers on the counter you can get...and the Gelato is by far the best! Truly Gelato at its finest.", "author": "Lina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-20", "description": "When my boyfriend lived in North Beach, we used to drop by here on late summer nights. The gelato never failed to hit the spot. The tiramisu was my favorite.", "author": "Nathalie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-22", "description": "FREAKING GOOD GELATO!!!  I am usually more of an ice cream fan, because it tends to be creamier than gelato, which can be watery.  But THIS Italian gelato is thick, creamy, and SUPER chocolaty (I had a sample of the dark chocolate gelato and HAD to get it).  I would chose this over chocolate ice cream any day.  My friend recommends the ginger gelato, too.  On a hot day walking through north beach, whether you're a tourist or an SF native, it's a perfect place to stop!!", "author": "Laura W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-07", "description": "I would pick gelato over ice cream any time.  The gelato here is really good.  Very rich and creamy, and the flavors are great.  I am a vanilla person myself, and not very adventurous, but a friend of mine always gets the cherry flavored, and it's really delicious.", "author": "Honey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-19", "description": "Boo!  I asked the grouchy lady behind the counter if she had Tangerine.  She practically spit on me and said, \"NEVER.\"  Wow!  Does she not like tangerine?  After that awful question she wouldn't even make eye contact.  I ordered the bourbon cherry/dark chocolate combo for $3.95.  She told me my total and barely said thank you.  I was in such a good mood too...thinking that after reading the favorable reviews that this place might hit the spot.  Then I tasted it.  SOOOOoooo disappointed.  People giving this place high marks must not ever have had good gelato.   If I have to deal with someone with a bad attitude, at least make it worth my while and serve good gelato.  It tasted like the soft icecream that I can get at Frosty's, which I like but I was looking for gelato.  Felt ripped off at that point.  The Dark Chocolate was good soft icecream BUT the bourbon cherry completely lacked flavor.    HEY Grouchy lady!  Maybe you should swap out that completely bland bourbon cherry and replace it with Tangy Tangerine.  Anyway, won't be back.  Still on the hunt for GREAT/GOOD gelato.", "author": "Edyn O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "Creamy, yummy and delicious. Delicious, creamy and yummy. Yummy, delicious and creamy. No matter how you put it this place is good, I love it that I live in such a cool neighborhood and this place only makes the neighborhood even sweeter.", "author": "Troy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-03", "description": "While I don't sense the commitment to quality ingredients, like you'll get at Naia, Milano, or Tango, I love Gelato Classico. I'll bet they add some thickening agent to the gelato, because this is the gooiest ice cream on the planet. The dark chocolate and the espresso are sublime by themselves or even better together; vanilla bean, hazelnut, and straciatella are also strong choices. Sorbettos are okay - stick to the gelato. More flavors would be welcome, but I'm always happy with the classics.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-04", "description": "Always good, but expensive for such a tiny cup.  Cute shop, and they serve hot tea, too.  I kinda like that combo, a cup of hot tea and a cup of frozen delight.  But next to the cup of tea, my cup of gelato looks even smaller.  Patience, i keep saying, patience... damn it sweet tooth, heel damn it.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-10", "description": "I love gelato so much that I spent my remaining $3 in change, set aside for bus fare home, on a cup of chocolate mint upon my lucky discovery of this place.  I thought of it more as a double bonus:  get to enjoy some amazing gelato AND walk off the calories by the time I'd reached my front door.  I think I also made everyone I passed on the street jealous.  And  hungry.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-25", "description": "This has the best gelato in the neighborhood.  Not only does it have the standard, American-style, chocolate and vanilla flavors, but the traditional Italian fruit flavors.  I love finding apricot, or pomegranite or mango on a hot day.  No (or, rather, limited - I think there is about three chairs) seating and cash only.  And don't forget to get the punch card next time!", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-13", "description": "Um, excuse me, creme Brule gelato....are you f-ing kidding me? hey, hey, hey! so freaking amazing. I didn't used to be a big gelato eater. I was more into the un-stringy ice cream of yore, but Gelato Classico Italian has perfected making the flavors of my dreams in the consistency of the heavens. Yes, cliche's galore, I know, but the word gelato didn't mean a damn thing to me before this bitch. Oh ya! Way better then Naia, just up the street. Naia tastes alright, but it's just a plain old Jane compared to Classico. Like comparing Jell-O with, um, well, Creme freaking Brule! Which Classico has! Yum...going tomorrow, who gives a flying swan fuck if it's raining.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "I had a small cup with Spumoni and Tiramisu and I loved it, really great flavors, chunks of ladyfingers in the ice cream, more than I could ask for.  The only thing I had a little trouble with was that the lady working there wasn't overly friendly, and this was the first time I've had gelato in the states so I was a little surprised by the price, $3.50 for a small cup.  Good stuff though.", "author": "Asha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "Excellent! Have seen photos on yelp, but it seems that they have remodeled. Good flavor choices - too many good ones to pick from. We got two small cups. One had half Strawberry Cheesecake and half Tiramusui. The other cup had half Cappuccino and half Coppa Mista. Both cups were delicious!! Highly recommended. But too bad no inside seating...only had one small bench in front of parlor. Overall, great family owned gelato shop.!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "They supply the gelato i like but i dont know the companys name. Powells sweet shop in burlingame supplies the same brand too...but its yummy! i looooove love love the bavarian mint. omg theres nothing like it. shop is super small about the size of my closet. i dont remember the prices but it wasnt expensive.", "author": "Ame C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-25", "description": "Food fit for Zeus himself, but the only way you can eat the ice \"dream\" here is to have worked out 20 years consectutively and not a single piece of junk food can go into your mouth, then and only then may you eat from this place because 1 gelatto will give you the fats", "author": "Jimmy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-08", "description": "Rich, creamy and delicious. This gelato place turned my sweaty day into a relaxing mellow day. I was in heaven when I had the cherry flavored one. =]", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-31", "description": "By far the best gelato I've had in the city!  Its North Beach location is great if you have dinner in the area beforehand and want a quick dessert nearby.  Service is friendly and the gelato is creamy, maintains a consistent texture, and fresh.  There is also an ample selection, ranging from low fat sorbets to different kinds of gelatos.  Try the tiramisu or chocolate/hazelnut flavors for a gelato delight, and enjoy it nearby in Washington Square Park!", "author": "Megha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-19", "description": "OMFG this place is amazing. The Bavarian Mint and Dark Chocolate combo are literally to die for. Gelato is perfect late at night and on the two days a year it's hot enough to sit out in Washington Square Park. I keep losing my free card, but I must've merited myself so free gelato by now. The people who work here seem to typically be exchange students, but sometimes the owners are staffing it -- all the employees are really friendly and very generous portion-wise. There's never a wait and the hours are really reasonable. Don't bother trying to park, though.", "author": "Mairead J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-23", "description": "It is GOOD STUFF. My favorite is chocolate peanut butter, but they've only got it certain days of the week. Has anybody figured out the flavor schedule? I heard that if you smile extra wide when you order, they'll throw one of those little gelato cookie wedges in for free. I like to grab a cup and eat it in the park. Make sure you get a green spoon. And don't forget to take a nappy.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-23", "description": "I can't bring myself to ever order any other flavor than the coppamisto. It's so good! It's chocolate, vanilla and I think pistachio. I could be wrong about that last one inthe combo but it's just tasty! One day I just might try something else. One day, I tell you.", "author": "cyndi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-26", "description": "good gelato...but ah...it really sucks to walk inside here in the summer....it's a hot, sticky and smelly sauna inside this little place....i don't get it..even with the doors open it get so hot in here...for such a tiny place...odd....but again....good gelato....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-23", "description": "for san francisco's crazy heat wave, gelato completed me. there's so many flavors. and he brought out the creme brulee when asked for. and thank goodness he did, cause it was delicious!\n\ni would go back even with the sf fog!", "author": "Natalie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-08", "description": "We had half Cookies and Cream and Coppa Mista. It was heavenly!! Definitely a great treat on the way down from Coit Tower or Washington Square day.", "author": "Angela Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "Coppa Mista + Creme Brulee = Godhead.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-26", "description": "Best decision ever to get some gelato at the North Beach Festival.  This place is great, it's homey with a friendly staff and great selection of gelato flavors.  Loved the pistachio/chocolate type flavor I got, didn't mix well with the pomegranate sorbet but I'm not complaining :).", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-23", "description": "Was craving some gelato today and stumbled upon this in North Beach. Ordered a small cup with a half of coconut and hazelnut with another half of banana with walnut. It was delicious and cute little place to grab some gelato.", "author": "Yan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-16", "description": "The Pomegranate sorbetto is hands down the best within the San Francisco city limits. Its so fruity and tasty - all the taste and none of those pesky seeds!", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-17", "description": "On a sunny day, mid 70's with no breeze (absolutely beautiful outside), the inside of this place was stuffy and overly warm. I can stand the heat but not stuffy. Couldn't wait to get back outside for fresh air. Since it was so warm inside, my gelato texture was a bit icy in certain places rather than the usual smooth sticky texture that we're all used to. With other gelato places nearby, I'd try somewhere else next time than to return here.", "author": "Sabi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-04", "description": "Had a small half Creme Brulee half raspberry white chocolate. Very good, but for $3 a little pricey. I'll definitely be back to try some different flavors...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-19", "description": "Consistently good.  If I feel like Gelato, I will endure the parking search to have it here.  The Dark Chocolate is amazing, and if you get them to mix pistachio with chocolate, it is good also.", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-15", "description": "Everytime I'm in North Beach and want some gelato, this is the place I go to.  The store is quite small and only has a couple small tables and chairs.  It tends to get a bit stuffy in the summer too.  So, I usually just order for a small cup with a  scoop of chocolate and a scoop of mocha gelato, walk over to the park and relax under the sun.", "author": "Ginni S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "We stumbled upon this place after a long night of drinking in north beach and right after eating a greasy phili cheesesteak sandwich.   There's a little couch for you to crash on as you try to sober up.   Some how gelato tastes so damn good with alcohol in your system!", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-09", "description": "I don't ever write reviews if I have not had an opportunity to try the food.  Unfortunately, the service was so horrible here, I was unable to try the gelato, so I am writing this review anyway.  The girl behind the counter was counting the money.  No one else was in the shop.  I said, \"Hi.\"  No response.  I perused the gelato choices.  Five minutes passed.  I said, \"Are you still open?\"  Maybe I had wasted five precious minutes choosing the Tiramisu gelato.  She looked over her shoulder, annoyed, and said something largely unintelligible.  I deciphered that potentially the shop was still open, but she was busy and I had interrupted her work.  I don't like it when people interrupt me when I am trying to count, so I could sort of understand her response.  But let's be honest.  Being non-responsive and dismissive at a gelato shop is an unpleasant experience.  Gelato shops are happy places, but unfortunately this woman was in a bad mood.  Maybe something happened to her today.  I will give her that.  But I also work in the service industry, and even when I've had a bad day, I put on a positive face, because that is my job.  The gelato looked good, so I wish the best of luck to others who try to purchase some gelato here.", "author": "esther r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "I would walk through a pride of starving lions, climb over an electric fence and swim across a river of piranhas to have the creamy deliciousness that is Gelato Classico. Can't wait for next fall when the pumpkin flavor comes back.", "author": "Fabian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-13", "description": "My god!  The ice cream here is soooo good.  So creamy and delicious.  Only thing keeping me from coming here more often are the prices, which is a good thing or else I'd be fat as a house.", "author": "Doogie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-09", "description": "Gelato is okay. I don't think it is directly made here. They have a lot of chocolate selections. I think the gelateria on Columbus is much better. It's over-priced, like everything in SF.\nBut I'm more of a Pinkberry, non-fat fro-yo fan.", "author": "CaliforniaGrown R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-22", "description": "Have never been to Italy, but if the gelatos at Gelato Classico are any indication of what I'd find in Italy, then I'd catch the next flight out!!  Tried different flavors and all were great.  Great location in North Beach -- just grab a cone or cup and head to Washington Square park right around the corner for a delightul afternoon snack.", "author": "John c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-10", "description": "maybe it was because I had just gone to Bi-Rite the night before and immensely enjoyed the ice cream (coffee toffee & salted caramel, FYI).  yes, I know, gelato is not ice cream. but for the amount that I paid, I got a tiny cup. and it was too sweet for me. it's not terrible. but it's not mind bogglingly good either.", "author": "ray e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-08", "description": "I live a hop skip and jump away from North Beach yet for some reason I haven't spent much time here. But that is about to change since summer is here and we all know what that means...gelato! I first saw this place while dining at Cafe Divine a few weeks ago and remember thinking to myself that I would much rather have been eating gelato than eating whatever it was I was eating at the time. I suppose if you knew me well enough, you'd realize that I always would rather be eating gelato than doing the task at hand since ice cream is my true calling. In any event, today, being a rather hot one, seemed like a fitting day for some after work frozen delight. Taking the cable car over to Washington square park, a huge grin across my face (just thinking about ice cream makes me smile) you might have mistaken me for a tourist (minus the map and camera). Stepping inside the small yet charming shop, I was greeted by an extremely friendly girl at the counter who was patient enough to allow me to sample quite a few flavors before deciding on the final scoop. I ended up choosing the banana walnut and mango sorbet, stuffed nicely into a sugar cone. This rather small confection cost me a whopping $4.15. Now I don't mind paying $4.15 if I am getting a large, but come on, this was the smallest size they had, on a generic cone (not home made waffle or anything exciting). The gelato and sorbet was definitely tasty, the mango being particularly special. However, I don't think that it was worth the price but on this particular warm evening, it definitely hit the spot.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-04", "description": "Damn good italian ice cream.  This has become my favorite spot to pick up ice cream, no matter what part of the city I'm coming from.  They have lots of good flavors to choose from...vanilla bean....cherry burgundy....tiramisu...orange creamsicle...but my favorite is my old standby, vanilla gelato and oreo cookies.  Creamy, rich, and delicious.  I'm getting excited just thinking about it....  The best part about this place is while they have great ice creams, I've also fallen in love with their sorbettos (aka sorbets).  I usually get half rasberry, half lemon, but I tasted the passion fruit the other night and I'll have to work that one in as well somehow.  The place is small with a couple of tables to sit down at inside, the owners are friendly enough, and it's located on the outskirts of the North Beach restaurants so it's never crowded (in my experience) and touristy-feeling.  Like I said, damn good italian ice cream.", "author": "LaSha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-27", "description": "i loved the Bavarian mint, it was delicious, like eating Andes! the chocolate hazelnut was okay.  the perfect way to cool off from shopping. i gave it 4 stars cuz its cash only!", "author": "Jen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-22", "description": "It was a beautiful day and what could be better than wandering North Beach with gelato in hand?  I popped into Gelato Classico for one of my favorite foods and although I had reservations - the gelato looked a little droopy - I ordered a small cup with dark chocolate peanut butter and Turkish coffee.  Hmm, it is rare that I find a gelato that disappoints, but this one did.  The temperature and texture were completely off (problem with refrigeration?) and it was a runny and not at all creamy.  It was very disappointing.", "author": "Lori G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-27", "description": "the gelato tastes so creamy and good! some choices are the traditional italien flavors,and then there's the spot of orange creamsicle. small place, but walk around north beach and enjoy! i love the coppa mista. mmmm.", "author": "Janelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-29", "description": "I've had ice cream in Italy- this is BETTER! It's the best ice creamin the universe!", "author": "Christine L."}
