{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "tl;dr amazing sandwich spot for quick, casual lunches when you don't feel like going anywhere far.\n\nMy boyfriend and I used to live in Bayview, and I swear the ONLY good things about that place were the small businesses around, one of them being a convenience store and deli. When we moved to the sunset, I didn't think we'd be so close to one of those, until we found Gene's! Gene's is even better, in my opinion.\n\nBut yeah, I assume the guy who's always there is Gene, and you watch him make your sandwich. It seems like a lot of people who go there are regulars. Gene is friendly but not at all annoying or overbearing.\n\nThe sandwiches are HUGE, the bread is nice, and there are all the fixins for subs without being really expensive. Also, as a side note, I asked for extra cheese on my sandwich and Gene(?) is one of the only people I've ever ordered a sandwich from who actually puts EXTRA cheese and not just one little half slice on a gigantic sub. The secret sauce is also really good--it's like an Italian dressing but seems to me like it's more suited for a sub than a salad since it didn't make the sub overly soggy or weird. My boyfriend usually gets the atomic sub, and it's great for people who love meat.\n\nSo excited to have found my new go-to convenience store/sandwich place!", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Large atomic sub. That's it. That's all you need.\n\nIt's a decent sized sammich and it doesn't hurt your wallet. I always get the large so I can save the other half for later. The secret sauce they have in it is like a dressing and has a nice acidic taste. Been going here since high school and I'll always come back.", "author": "Marie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Been coming here for about 15 years. The sandwiches never disappoint. Can't go wrong with any of them but the atomic in particular is great. Convenient location and hours. One of my favorite sandwiches in SF.", "author": "Henry K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "This sandwich does NOT follow the Little Lucca / Roxie's sandwich formula consisting of a hearty helping of meat (and everything else) on Dutch crunch bread. The amount of meat is seriously underwhelming, however the rest of the sandwich comes together very nicely. I'm usually a fan of cold sandwiches, a la hero subs of NYC, and this sandwich reminds me of just that (soft roll, oil / vinegar), only heavily toasted.\n\nThe picture below shows an atomic sub, made of three meats. There are 1-2 slices of each meat, making the meat flavor simply a complement of other flavors in the sandwich, rather than the focal point. For the price, this felt like a scam. But, the sandwich does set itself out from the rest due to it's unique flavor, which is heavily driven by oil / vinegar, mayo, and onions. Skip this sandwich if you don't like these profiles, or if you don't enjoy heavily toasted, flaky bread. Ordering these cold is just not worth it.\n\nHomeboy behind the counter is super cool, and I whole heartedly recommend giving him your business. Times are tough, rent is high, so I'm not trippin' too hard about a couple slices of deli meat.", "author": "Douglas Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "I've been getting sandwiches with Gene and the crew for more than a decade now, since before high school. I've been meaning to write my gratitude for a while. The folks behind the counter have worked very hard throughout the years, and I have grown to consider them as part of my neighborhood family. Gene's sandwiches still have the same amazing taste since my first visit - the secret sauce promises a satisfying sour tangy kick. \n\nOf course, being a corner store, they carry a nice variety of snacks, ice cream, sodas, wine, beer, heavier liquors, canned foods, cooking ingredients, and a few essential items by the window. They also are selling Gene's Liquor merchandise now! I've bought a t-shirt myself! \n\nIf you're around the area, do pay Gene's a visit for an excellent sandwich experience. If you really want to treat yourself, I highly recommend the Atomic Sub (turkey, pastrami, corned beef) with added avocado, jalapenos, two strips of bacon, and extra cheese (please). One sandwich is usually ready under 10 minutes.", "author": "Johnathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Great sandwiches. Hamik does a great job every time.  Break is always fresh and tasty", "author": "mick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "From the outside, you would not know it but this is a gem of a location for Irish and UK expats looking for a fix of their fav foods from home everything from potato crisps to soda, chocolate bars to biscuits canned foods to sausages and Back Bacon you name it this place seems to have it and if there is something you are looking for that they do not have just let them know and they will get it for you. Their prices are very good compared to some of their compeditors.", "author": "Frank B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "If you live in the neighborhood and have not/don't go to Gene's, you might need to re-evaluate your life choices. As someone who has grown up in the City, I can honestly say it is HARD to find a place that reminds me of what it was like growing up. Thanks for reminding me of \"the simpler days\" with a sandwich and some neighborhood vibes.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Best turkey sandwich in the city!! The staff is really nice and helpful.  Go to Gene's liquor ASAP!", "author": "Michele R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "The absolute best sandwich in the city.\nThey also carry lots of non-standard snacks, and will order you just about any alcohol you could want.\nStand up guys, drop in and get a bite to eat.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Good and satisfying vegetarian sandwiches are hard to find, but Gene's is a really good one! This is my go to place for sandwiches after a busy weekday and it sure will not disappoint you. I wish it opened up before I hop the muni for work, it would have become by go-to breakfast sandwich too!", "author": "Shruti B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Gene's was of my favorite lunch spots back in high school; we ate there far too often. On Saturday, I found myself back in the neighborhood and decided to grab a sandwich and see if the magic was still there. It was!! The Gene's experience was just as wonderful as it had been back in the day. Don't let the initial appearance dissuade you. Yes, it is a liquor store. But damn, do they make incredible sandwiches!! The same two guys have been working there for years and they are always in good spirits. \n\nThey have a long list of sandwich options, although nothing too crazy or fancy. But really, when your secret sauce is that delicious, why overdo it? I always get a regular turkey with everything except onion, plus avocado. You really can't do wrong with an order like that. Their sandwiches are toasty, crispy, messy, and freaking delicious. Id' like to think of myself as quite the sandwich experience, and I think they make some of the best sandwiches in the city. They have a good drink and snack selection as well. Really the only thing missing is place to sit and eat, but with the various nearby parklets (as well as Ocean Beach), it's not that big of a deal.\n\nThe price is right, the sandwiches are filling and delicious, and the wait is never super long.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Gene's has definitely stood the tests of time since my day-drinking afternoons as a young adult, but this place is awesome. Accessible by most points in the city via the L or Sunset/19th Ave. Bus lines, quick service, personable atmosphere, and there' s a 7/11 across the street if you like Slurpees.\n\nSizeable subs at more than affordable prices. Quite enjoy the spicy sauce (probably something simple but has me fooled) as well as the portions, everything feels just right and it's not one of those sando experiences where the damn thing gloops onto your lap. \n\nFavs are the Tuna and the Atomic Sub, both compliment the sauce.\n\nPlus the customer/cook side-comments are always great to listen to, lot of fun asides to hear, and the jocularity never sounds mean.", "author": "First Name L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Lines are long most of the time and the guys don't work at lightning fast speed but they're super nice and the SANDWICHES ARE DELICIOUS! \nA large is $9 add extra meat $3.75 and additional avocado $1.20.... Comes out to be a pretty expensive sandwich but try it and you'd be a loyal customer for life.\n\nTip: only one type of bread here and it's the perfect one. Soft french toasted =)\n\nAlso tip the guys they really appreciate it!", "author": "Liz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Taraval St institution.  Excellent subs, similar to the subs I grew up on at Marina Submarine.  Enough variety to keep things interesting!  The sauce is similar to Italian dressing I think and it works really well on the sandwiches.  I dunno where they get their bread but it is also perfect for their sandwiches.  And fantastic selection of snacks, beers, drinks to accompany your food.  Love this place.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Sandwiches taste great - I dont care what anyone says I will always go back.\n\nSunset's Best Sandwiches!", "author": "Nicholas V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "My favorite place to get sandwiches in the sunset! The owner is a very nice older man and I love supporting family owned small businesses \n\nMy go-to sandwich is: roasted turkey, lettuce, tomato, pickles, and their special sauce on a toasted roll :p mhmmmmm", "author": "Chung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Best sandwich I have ever had! The bread is crunchy the sauce is good and everything balances each other well. Highly recommend!", "author": "N K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "The sandwiches are so yummy. It is no fuss, a straight up good sandwich. Been trying to come get one for 3 weeks, but because I live farther now, I really have to wait until I am in the area to grab one. The turkey sandwich with everything is my favorite. :3", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Best sandwiches I've ever had. The secret sauce is bomb AF, and so is the bread. And the guys working the counter and making the sandwiches are hilarious.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Why does Gene's subs taste so good?? Unfortunately he'd have to \"dispose\" of me if he was to tell me, so I'll keep quiet and eat up the goodness. Simply the best subs I've had anywhere in the world.", "author": "Roger F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "This is my favorite sandwich spot in all of SF. The bread and sauce combo is yum yum yum. Delicioso mama Mia!!", "author": "Max F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "Toasty goodness, plain and simple. CRUNCHY shredded lettuce and melted cheese, works for laundry days :)", "author": "Dianne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Cheap and delicious sandwiches. If you are in the sunset, it's worth a stop on your way to the beach! Try the tuna and bbq chicken. Best on the menu!", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Among other foods, sandwiches always remain a heated debate between my friends and I. But no matter what, I consistently find myself keeping Gene's in my Top 5. An institution of some sort in the Sunset, Gene's Liquor stands unassuming on the corner. It may seem like a regular liquor stop, but the sandwiches here are great at its core. Simple, no frills, made from the same 2-level oven for years, these sandwiches keep the neighborhood and the surrounding schools satisfied.\n\nMy personal favorites are the atomic sub and pastrami sandwich, which I order 90% of the time. These two and most of the sandwiches on the menu come on toasted bread with the inclusion of mayo, mustard, lettuce, tomato, cheese, and choice of pickles, peppers and secret sauce. This addicting and always dripping sauce is along the lines of an Italian dressing with a little kick. That straightforward combination make for a classic sandwich, no matter what meat is included. Of course, it is still is a liquor store, so it won't be hard to find your preference of chips and drink. Explore the short menu, but you will not be disappointed with the pastrami. Ask the multitude of hungry, after-school, high school kids that frolic and back up the line out the street to the Muni stop. They will tell you, especially since the average $8-9 per sandwich is a large chunk of their allowance.\n\nThe last thing I have to include is Hamik, the store owner and \"head sandwich maker\". He may give you that glazed look and seems like a disinterested liquor store attendant. But stop and have a conversation with him. HE makes Gene's what it is, and what makes this sandwich special. Once you become a regular, he'll remember your order, how many napkins you need, and even the Arizona tea flavor you always get. Maybe he'll make fun of your hat or ask why you're dressed so nicely. Almost 15 years later, Hamik still does the same for me. Sadly, shops like these do not exist anymore, making Gene's a must-stop in the Sunset.", "author": "Carlo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "I've lived in the area for a year now and I've heard about these amazing sandwiches over and over again. Today, I didn't feel like cooking dinner so I decided to walk on over and FINALLY give these sandwiches a try. \n\nWhen I walked in, there was a tiny line so I wandered around. BUNCHES of drink options, lots of places for chips, but only a small selection. Looked like maybe they were about to restock within the next couple of days.\n\nFound a Beverage and some chips, grabbed dessert (candy bar) while I was at it then stepped up the the counter. Ordered the small Salami. It was made really fast and professionally. \n\nGene, or whom I assume is Gene, was really polite and friendly. \n\nMy sandwich ROCKED! Tones of meat and cheese, good amount of mustard and secret sauce. It was perfection. WAY better then the French Bakery's Salami Sandwich I had up the street last month.\n\nI will totally be back for another sandwich. \n\n$10 minimum on cards, if it is less then $10 you are charged $0.50 to use a Debt or Credit  Card.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Amazing local sandwiches, for a good price! A Pastrami sandwich from this place and a dr. pepper and your set right for any meal!", "author": "Adam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-14", "description": "Came here for lottery tickets but picked up a sandwich. Didn't get to it right after it was toasted but it was still good. Need to try it fresh after it comes our from the oven.", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "Gene's Liquors offers large deli sammies (6), lots of liquors, snacks, convenience food items.\n\nlots of mainstream beers, microbrews, german singles too. pricing average or slightly higher.\n\nbuys: mexican ice cream (coffee flavor 1.25)\n-seems all stores in s.f. carry it.\n\ndrips:\n-friendly acknowledgement, service.\n-sammie look huge....", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "I dont care what anyone says, this is the best Sandwich in the city.", "author": "Arshia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Love the sandwiches here.  Used to be in and out, but now there's a line.  Still worth it.  Best sandwiches in the neighborhood for sure even with the new places opening up nearby.", "author": "Warren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "I've been living near here for almost 3 years now and the sandwiches are still amazeballs. Perfectly toasted, carefully crafted and fresh ingredients. I always get roast beef, hold the mayo and tomatoes, add avocado. Grab your favorite bag of chips and a drink, and you're good to go. It's perfect for those rare but beautiful warm SF beach bum days or when you're just not in the mood for cooking or ordering pizza. Thanks Hamik!", "author": "Daisy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "You think that any place that claims \"best whatever\" is hyperbole, but here, it is one of the best subs in SF.  Even though the prices have gone up over the past few years, you can still walk out with a large Atomic (the most expensive sub) with a drink for the same price as a combo at Subway, but more filling.  If you order a large, bring your appetite because it is packed.  I have failed to eat a single sub that didn't squeeze out meat and sauce, it is that full.  They're so consistent with the subs too, they're exactly the same every time.  And the bread is always perfectly fresh and toasted.\n\nSupport your local businesses!", "author": "Dylan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "My brother in law was getting some work done at the house and we needed to grab a bite of grub to get through the day. There's a popular deli at the corner so we walked over to check it out. There was a big sign out front calling their sandwich the best in town, so you know I had to give it a try.\n\nI ordered the large atomic sub for $8.35 with some chips and the whole thing came out to about $11. Not the cheapest sub in town to be sure. However, they did load it up with three kinds of meat and all the fixin's and it was a pretty darn good sandwich. I don't know if I'd call it the best though.\n\nIt's a really convenient place to grab a quite lunch before hopping on the train, but all items are significantly marked up. Sandwich quality was excellent and the ingredients were very fresh. I'd drop by again in a bind but it wouldn't be an everyday thing. Service was outstanding though and the boss was extremely helpful and happy!\n\nFood: 7/10\n\nService: 9/10\n\nPrice: $$\n\nAtmosphere: 6/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-29", "description": "2 years ago this place was THEE place for hot sandwiches. When Hamik was making the sandwiches, he would give a fair to generous amount of meat. I went there yesterday and had a really bad sandwich. For $9.00 I got a large pastrami sandwich with 2 very thin pieces of meat. Really disappointing and I will take my business back to west portal's submarine center where they still do it right.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "I used to come here all the time for sandwiches when I was in high school. At one point, the man behind the deli memorized my order! All I had to do was walk in there, and he'll start making my sandwich! I usually get a turkey sandwich with swiss cheese and everything and occasionally avocados if I'm up for it. A can of Arizona sweet tea is also my personal favorite companion to my sandwich. The sandwich is always packed with flavor thanks to the secret sauce and very filling and satisfying. Sometimes I can't finish the sandwich and I cry a little on the inside because it would go to waste.\n\nUnfortunately, going out of state for college have deprived me of the great sandwiches that this place has to offer. But it only makes these sandwiches that much more delicious every time I get one when I'm back in the city!", "author": "Julianne Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "I love this place because:\n\n1. The subs are really yummy! I wish yelp had sound so I could record that amazing noise when you bite into it and you hear that crisp from the oven toasted goodness...\n\n2. The owner is always so nice and friendly which is amazing considering that it appears he never takes a day off.\n\n3. It is a very welcome departure of so many overpriced, pretentious places in this city.", "author": "Naomi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Usually, me and my brother buy sandwiches from Ike's. However, we decided to give Gene's sandwiches a chance and honestly, we might love it more than Ike's. Although there are only two people working, the line goes by quit fast and there's plenty of snacks to purchase as you wait for your sandwich. I love the vibe in there and the owner is super sweet. People usually call in to place their orders ahead of time. These are quite pricier than other sandwiches but the sandwiches are quite massive. We recommend the atomic sub! Warning: You might need all the napkins they offer! :) Messy but delish!", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Sandwiches from a liquor store?  Are you sure about this?  \n\nI ordered the large atomic sub with no onions.  The bread was toasted which gave it a crunch on the outside but still soft in the inside.  It's the perfect size and good amount of meat and veggies.  Make sure you're sitting down while eating because for people like me, it might get messy.\n\nDon't judge a book by it's cover!", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "SANDWICHES! Enough said. I'm super lazy and try to avoid walking as much as possible but I do not mind walking my lazy self over to Gene's and that says a lot! I get too excited about my sandwich and before I know it, I'm already back home ready to devour my food. \nI love how the bread is always perfectly crispy. The sandwiches are consistent and they never skimp on the fillings. You have an option of choosing between a regular and large size. You can also add extras such as jalapeños and avocado. \nYou might want to call in and put an order in advance if you want to avoid waiting because there are waits sometimes. \nBut if you order on the spot, Gene is usually working alone so service can be slow but be patient because it will all be worth it!", "author": "Joanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "The sandwiches are really good here.  I'm kind of impartial to the large atomic.  Just call in before you get there if you want to skip waiting around.  \n\nThe prices have gone up by a good deal but the quality didnt go down like at a lot of other places, so its still a good spot.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Love the sandwiches here especially the hot pastrami with everything including the secret sauce. I love the place and everyone who works here is super nice. I also like,that the owner gets to know you after awhile so he'll sometime know your order if you order same sammi. Did I mention prices are very reasonable. Try it you'll like it.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Love this place for sandwiches....the ONLY place I get sandwiches.\n\nThe owner is a sweet guy and provides great customer service =)\n\nDef a place to grab a quick delicious sandwich and go to ocean beach to eat it! My roommate and I would do this!", "author": "Shanitte N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "1st time. Goooooooood stuff. Got the atomic bomb sandwich.  A great sandwich in a liquor store?  Awesome", "author": "w t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "I just had a extremely tasty sandwich.\n\nI just ate it a few moments ago, and I could not wait to write about how great the sandwich was. It happened like that when I went to Grubbin' Sandwich on the same street about 10 blocks up.\nMatter of fact that I was heading the grubbing' today but when I was driving, the sign for Gene's saying \"Best Sandwich in town!\" got a corner of my eyes. And I found out that there is no parking meters!!!\n\n9.5 inches long a large size oven toasted combo sandwich (turkey, pastrami and corned beef) calls Gene's Atomic Sub w/ everything, was A REAL A-BUMB! \n$8.85 include tax.\nThe sandwich roll was crunchy and a bit chewy, that was nice, and the 3 sliced meat were great with the roll when I bite into it. I really like the special sauce w/ the fresh chopped lettuce and tomato.\n\nThis out of nowhere Outer Sunset Gene's Liquor is out on Taraval Street. \nThis area, Dirty Harry might say VFB, very few blacks. \nThe place looks like an ugly old liquor grocery store that I don't think I'd pay attention but the sign. \n\nSorry Grubbin' I'll be there later, but Hello to Gene!!!\nI think Gene's sandwich is a buck cheeper than Grubbin'.\nI like them both though.\n\nMade my date today. Thank you Gene so much!\nI will be back for more.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-13", "description": "When I walked in, I spoke with the owner, who was extremely personable and friendly. Ordered the Atomic, along with some basic sundries (hey, it is a liquor store, right?). Very quick turnaround, went back to work and unwrapped the sub.\n\nH-O-L-Y S-H-I-T. This is what a sandwich is all about. The bread with it's toasted to perfection, crunchy and flaky deliciousness. Ingredients that are in the right proportions - not an abundance of lettuce and a lack of meat , but everything just right. A dressing that ties it all together. This was sandwich perfection.\n\nI'm glad I live so close, because now I know the go to sandwich shop in the Outer Sunset. This place is top notch!", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "If you like sub center at West Portal, you will love the sandwiches at Gene's! \n\nSandwiches are amazing! Ask for extra of their \"secret sauce.\"\n\nPros: parking is easy and the wait is usually better. You can also buy alcohol and other items that can be found at any convenient store. \n\nCons: for those that eat meat, they give you less meat (I don't have to worry about that since I always get a veggie). Also, the owner  looks like he's going to kill himself (I wish he would hire more help).", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Great little hidden gem! Sandwiches are delicious! Nice selection of candy, chips, and beverages...both alcoholic, and non. Great customer service. Will definitely be coming back!", "author": "Halina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Legend has it that Sub Center copied Gene's...that's according to Gene.\n\nWhatever.  It doesn't matter who started it because Gene's Liquor is solid on their atomic subs.  I'm so jealous of San Franciscans who have sandwich shops like this and don't even know about it because they don't have places of this caliber in Phoenix/Scottsdale.  No complaints.  Friendly people.  FIVE STARS", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "This place is directly across the street from 7-Eleven and right in front of a bus stop. Their prices are higher than 7's, but they have more kinds of certain stuff, such as hard liquor. \n\nTheir sandwiches and being right in front of a bus stop keeps this place in business. Their sandwiches are pretty good and sometimes it is better to spend a little more than risk missing your ride.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Our pal, Hamik, is without a doubt the heart of the 32nd block of Taraval. His sandwiches have been there for us when nothing else could fill that void. You know--just...there for you. Bad break-up? Gene's! Crappy day at school? Gene's! Just graduated college? GENE'S CATERS! (JK, Hamik, lol!) \n\nBesides all of this, he has the memory of an elephant and always remembers the orders of my roommates and I. The best combo is a drink, a bag of chips, and a good ol' sub. \n\nI recommend grabbing a Gene's sandwich without reservation! YUM!!!!!", "author": "Alina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "The guy who works here is great. He's always pleasant to talk to, he gives you dead-on estimates on how long it will take him to get your sandwiches ready, and he makes pretty awesome sandwiches, too!", "author": "Karina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "I cannot believe Gene's wasn't in my life when I went to school just a couple blocks away from this corner market! I've had sandwiches from convenience stores that doesn't differ much from Genes appearance-wise. That being said, the sandwiches totally sets this place apart from the others! If it's your first time here, you must try their specialty atomic sub - perfect for meat lovers since it includes pastrami, corned beef, and turkey. Every sandwich comes with their specialty sauce but don't hesitate to ask for more if you like your sandwiches on the wetter side, or if you're just craving an extra kick of flavor. My only suggestion to you is to tell them to go lighter on their onions unless you don't mind that full-on raw onion flavor in sandwiches. Order the regular size if you have a moderate appetite, but go for the large if you're especially hungry or if you're sharing. \n\nOnce you try their atomic, I would also recommend trying their other sandwiches. I personally think their pastrami sandwiches alone are super satisfying, especially if you add avocado. All their sammies are about $6-7 which is reasonable for a good lunch. \n\nLunch times can get really busy. I usually call in and place an order so I can just pick it up and avoid long lines. However, sometimes (peak lunch hours), it gets so busy that they tell you to either call back or to place your order in-person. It'll be worth your wait though, so don't be scared of the extra 15 minutes you'll spend in here.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "I love this place!! \n\nWhenever I need a quick lunch close by work, I stop by Gene's. I love that they take orders over the phone and sandwiches are normally ready within 10-15 minutes. BUT, keep in mind that they get VERY busy when there's a sports game going on.\n\nI love the service here; everyone is always friendly, welcoming, and funny. They are very enthusiastic, personable, and kind of tired looking. (Small private shops, it happens) I really didn't expect that from a liquor store, it's a great plus.\n\nThe sandwiches here are absolutely to die for. I love the salami sandwich with pepperjack cheese and avocado. It's my favorite combo!! The bread is always perfectly toasted and their secret sauce complements the sandwich so well. Definitely glad they give napkins cause it can get a bit messy.  \n\nThe regular sized sandwiches are a decent portion if you're not trying to food coma at work. If you're looking for sandwiches piled with a ton of meat, I don't think this is the place to go to. But even with that being said, I still think they give a fair amount for what you're paying. \n\nIf you're ever in the area or trying to have a picnic at the beach or something, stop by and try their sandwiches, you won't regret it. Unless you don't like sandwiches, then you should just opt for something else. :P", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-06", "description": "Passed by this place a hundred times and bought vodka from this place a hundred times, but never ordered a SANGWHICH (what my grandma calls them). \n\nWas too lazy to make it to Freddy's, so I decided to try it out, I mean check out all the sweet reviews! \n\nI ordered the Veggie and yea it was good, but It was not making love on a sunday afternoon good, it was just regular good, A-ok good.  I mean for a nondescript deli on Taraval, yea the tosty bastard was yummy, but I do not really get all the 4 and 5 star reviews?  \n\nAgain, still good and by far the best sang I have had out of a liquor store, but I'd say next time it is worth it to make it to Freddy's.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-15", "description": "Maybe I'm not a believer in hot sandwiches. \n\nI really feel like Guerra's is one of the best sandwiches in the area. \n\nGene's liquor sandwich was good, but not fantastic. The line was long and I had really high hopes, but usually that is a bad sign for me. The hype didn't match the sandwich IMO. \n\nI can see the appeal, but the sandwich isn't that massive and is kind of expensive. \n\nWould consider going back, but there are so many sandwich places to cross off my list still. \n\nI will add, I really do like that this is a friendly neighborhood shop with a lot of locals visiting and ordering. Thank you Gene's for the neighborhood feel.", "author": "Alison N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-24", "description": "Lights flickering & a liquor store that kind of smells like batteries...that's Gene's for you.\n\nI didn't want a Safeway sammich so I drove over here for an Atomic Sub. What's in it? Turkey, Pastrami, & Corned Beef (my fav)...Gene's special sauce, onions, mayo, mustard, lettuce, cheese, pickles...last time, I was just guessing, but this time I actually saw the menu. For $8.35, you get a large ATOMIC SAMMICH, big enough for 2. I've never actually ate one alone, I've always shared it.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "Local corner store with a side sandwich bar inside. How good could it be? Surprisingly, it was pretty decent. \n\nI was a bit skeptical at first. Drove past it for years and I never went in. Finally, we decided to try it. We went on Friday night, and there was no line. I think it is typically pretty quiet there. Simple menu with regular and large size options customers can choose from. We tried the Gene's Atomic Sub with turkey, pastrami, and corned beef. The sandwich comes with mustard, mayo, lettuce, tomatoes, onions, cheese, and their secret sauce. \n\nI was questioning their bread choice, but I was most surprised, their bread works for their sandwich content. They toast the bread and it totally holds up all the meat and sauces. The secret sauce is mild flavored, but worth trying if you are in the neighborhood and craving a sandwich. This is a surprising find and pretty good for being a side bar inside a local corner store.", "author": "Janice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "Gene's is the best! Awesome sandwiches, reasonable prices, and great location. Oh, and the owner, Hamik is very friendly. He's great at recognizing the regular customers and even remembers what sandwiches you like to order.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Best sandwich place in the neighborhood! The secret sauce is AMAZING! I always ask for extra. Awesome customer service. The owner is always there making the sandwiches and he always tells me he is about the quality. Since i'm a regular he knows my order! Even when I was off to college he still remembered my order.", "author": "Jade T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "I've been to Gene's to pick up a six pack or a snack on the way to a friend's home nearby but didn't have a chance to get a sandwich until tonight. Clearly I'd been missing out.\n\nI ordered an italian combo and it was great. I ordered it with everything (minus tomatoes) and it was exactly what I wanted and the price was a super bargain in these artisan curated overdone times. I can't stress enough how good this was. \n\nThey also have a good selection of beers and such, and they even have Strongbow in .5 liter cans. Everyone needs to know how great this place is!", "author": "Greg D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-24", "description": "Sandwiches are overrated. The bread is ok but very little meat and did not taste the \"secret\" sauce", "author": "Gir G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "LOVE LOVE LOVE gene's. I was first taken here my freshman year of college by two friends from San Francisco, and have fallen in love ever since.\n\nThe sandwiches are delicious. I never have liked toasted subs in my life, but something about Gene's is delicious and perfect. \nI always order the turkey with everything on it.. that includes cheese! Unlike most places that charge for cheese. \n\nThe outside would turn you off from buying a sandwich, but do NOT let that turn you away from this amazing place. \n\nThe man who works behind the counter is such a friendly nice personable guy; he makes you want to come back everyday just to talk to him!\n\nLove this place and I highly recommend it.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "I have been going to this store since before he started making sandwiches.  The owner is not Gene, his name is Hamik.  Every time I walk in, he greets me by name.  I just ask for the usual, which he has remembered without fail for years.  The only question is if I want the regular size or the big one...  \nSince this is a popular place around mealtimes, I would recommend calling in your order 5-10m before you get there.  When they say, 'do you want everything?' they mean - cheese mayo mustard lettuce tomato onions and secret sauce.  I am a 'no mustard no onions' type of guy.  You can always add avocado, peppers, or jalapeno as well.\nIn my opinion, this is the best sandwich spot in the sunset.  If you like a good sandwich, check out Gene's Liquor.  \nMy favorite is grabbing one to go and taking it to the Giants game to eat in the stands", "author": "Mike Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Kyle N. here, genes is amazing amazing! Super friendly and SUPER FAT KID!  Order any sandwich large w/ everything BAH!!!", "author": "Laura P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "Best sandwiches in the Sunset (and one of the best in the city), better than Guerra's, little hidden treasure.", "author": "Adriana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "Yummy Sandwiches! The Italiano sandwich is delicious. Yes, please everything on it with jalapenos. Ooo, that garlic sauce and fresh meats & toppings. Oh, that warm toasted lightly crunch bread! I'm salivating right now and want more. Wish there's a Gene's Liquor or Hamik's Sandwich Shop in Oakland. Next one to try will be the Atomic. Can't wait to be back. The old guy behind the register may look grumpy but he's a very nice man.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "Pretty standard submarine sandwich. \n\nI've been passing by here for the last 10 years and never walked in. The other day, I thought why not? So I did. I got the large atomic sub like many have suggested. It was good, but pretty standard. There were three types of meat in the sandwich, but I only tasted the overwhelming pastrami meat versus the others (turkey and roast beef). As usual, I always get \"everything\" on it and it was pretty standard as well. I would come back if I was craving an all around standard sandwich. This place was pretty good. The large could easily feed two people. It took me three separate occasions just to finish the whole thing!\n\nAt 8 bucks and some change it was worth it. It fed me 3 times that day! Well worth it.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "what a great find! I always order the hot pastrami with lettuce, tomato, cheese, light mayo, and their secret sauce. it's a must!", "author": "Ann T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "Maybe the five star is a bit excessive (because I rarely employ it) but if so, barely. It's definitely a five star place.  I always get the Italiano. The sandwiches are great. A lot of people wouldn't expect a liquor store to have great sandwiches but these guys have perfected their art. \n\nAlso it's got a good beer selection and the guys behind the counter are the best. It's well worth it to take this place over 711.", "author": "Brendan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "This place is your one-stop-shop! Beer, wine, liquor, chips, sandwiches, and tic tacs! The sandwiches are really good! The secret's in the secret sauce which is probably Italian dressing, so it's not such a secret, but it's really good. If you're in the neighborhood and feel like a tasty affordable lunch, try it out.", "author": "Janu A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-17", "description": "I've been coming here for sandwiches for almost 8 years. Yeah it's a corner store, but the sandwiches here are delicious! Reasonable priced too. You can pick up a bag of chips and a drink while you're waiting. Yum!\n\nI usually get a turkey or a roast beef with mayo, mustard, lettuce, and tomatoes toasted. \n\nYou can call in.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-08", "description": "Two words: Yummy sandwiches (:\n\nConveniently located at a MUNI stop, this little corner store carries slightly overpriced chips and candies and make tasty sandwiches!\n\nI really enjoy the Atomic sandwich; the 3 types of meats are a perfect combination. The bread is very toasty AND the cheese is melted! I personally think the veggie portion and meat portion is okay, not too skimpy, but definitely not meat heavy. But the secret sauce is probably the star of the sandwich, because it's a bit tangy and that adds to the yum factor! \n\nThe sandwiches here is what made me give them 4 stars. Sandwiches are at a decent price, about 7 bucks for about 6 inches. The rest of the store is quite dingy. So, be warned that they don't take card unless you have a $10 minimum charge, so bring cash unless you plan to buy more than just a sandwich or use their personal ATM machine.  Don't expect a dining area, it is a corner store!", "author": "Raven L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "After 10 years of coming here, they are still the best damn sub sandwich I've ever had. They are consistently good-the bread is always crunchy, ingredients are always fresh, and I still don't know whats in that secret special sauce. \n\nThe people who work here are so friendly, always greeting with a smile and a good attitude. \n\nThis place is definitely a secret treasure of SF.", "author": "Denise W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Everything is overpriced except their sandwiches!!\n\nOne time I paid $36 for a bottle of Jameson, yeah I know bad idea but we needed drank and since this place is next door to my house, I said why not!? While you're there picking up an overprice bottle of booze, you might as well pick up a delicious sandwich! Those things are amazing! Make sure you get extra special sauce because that's what makes the sandwich. Gene is nice enough but he won't make you a sandwich if it's past 10 P.M so make sure you get there before that. Frankly, I think Gene needs to take some time off because I see him there every damn day! Like come on bro, take a vacay or something haha. \n\nThey have anything you need or at least anything you can't find at the 7-11 across the street. The place is located in front of the L stop so that's very convenient. \n\nIt's a liquor store that offers awesome sandwiches so what do you expect?", "author": "Javier G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "The staff are amazing the sandwiches are INCREDIBLE .. can be busy because theres a queue for sandwiches (around lunch time\nusually) but worth the wait as they are fab, with their \"secret sauce\" ...and everyone is so friendly love this place !", "author": "Paula M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-07", "description": "Gene the guy who makes your sandwich is a very nice guy.  Ive been going here for a very long time and I got to say that in the last few months the quality of the sandwiches really went down :(  hope the quality goes back to what it was otherwise im going to look for another spot in the area soon.", "author": "Diana s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "Gene's is the shit.  Any haters can suck it.  If you feel like it's not all that awesome, then I suggest you stop coming, go back to your shitty hometown, and eat at a chain because you are clogging up the sunset. \n\nI love Gene's!! Been going since high school and I am never disappointed.", "author": "Bonnie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "Hidden in what would normally be your average liquor store lies one of San Francisco's best deli sandwich shops. Mysterious like the dark side of the moon, this sandwich making ninja \"Gene\" holds the secret to a perfect sub.\n\nNow I may not be a hoagie connoisseur of sorts, but I've had my fair share of awesome sandwiches. This place ranks up there.\n\nConveniently located near the bus stop, what better way to wait for Muni than with a good salami sandwich? For best results, combine the sandwich with Slim Jim, a bag of Funyuns, and a Snapple. You're welcome.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "Really good sandwhices!!! The special sauce they put in it is awesome.\n\nFamily owned and the owner is really nice!", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "Hooch and sandwich... yeah!!!!\n\nGene's Liquor looks like your usual seedy corner liquor store, but in the Sunset, you can get a prettty tasty sub sandwich with your smokes and mini tequila bottle.\n\nI must comment on how neat the guy made my sandwich.  Even smears of mustard and mayo and even the way he folded each slice of turkey was so pleasant to watch.  It was like he was doing laundry.  He didn't allow too much over hang and even the lettuce was kept within the borders of the bread.  I really hate it when ingredients are piled on so high that it squirts out after first bite.\n\nHe toasted it just right so it's crunchy and hot and for the final touch, a squirt of \"secret sauce\".  It's a good solid sub, but the secret sauce wasn't very pronounced.  It looked like a cousin of Italian dressing, but I didn't taste any of that tang and herbs.  \n\nThe bread was good, but I hate to compare, it isn't SubCenter bread.  The crackling crispiness, where the crumbs break off and dissolve into your tongue at the same time isn't there.  I bet the fog has a small effect on it... soaking in all that humdity.  But still, it's a good 2nd place and nice alternative when I don't want to circle for parking and want to avoid a thick ass line.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-27", "description": "Mehhhhhh!!\n\nI've heard so much about this place and its sandwiches, and although yes -- they are good, they are not sandwiches sent down from Heaven. I feel like the friends that I know that constantly talk about how great this place is overrate it heavily..\n\nOn the two or three times I've been here, I've gotten the pastrami sandwich on sourdough and it's been solid each and every time. The prices are fair, the people behind the counter are nice, and yes -- the sandwiches are good. But there's definitely other places in the Sunset and nearby areas that serve better custom made sandwiches.\n\nI will tip my cap, however, to the fact that Gene's has been able to make a strong reputation off its' sandwiches despite only being a small corner store.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "The sandwiches here are really really good. They can toast em and they have lot of options. Also, you can get beer and wine. Win win.", "author": "Petey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "Reluctant to review because of how amazing this place is, I almost don't want to share.\n\nThe sandwiches are done RIGHT, super affordable, they have a great selection of drinks--just magical. (Sandwich + drink for $6.50!)\n\nGreat turkey sandwich. Be sure to order with everything on it!\n\nIn summation, don't eat here.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "a decent alternative to ike's sandwiches due to lack of wait time \n\nI got the large atomic sub sandwich with avacado (+$1.20 for about 1/2 an avacado), which was about a footlong with turkey, pastrami, and corned beef. The sandwich also included cheese, lettuce, tomato, mayo, mustard, and onions. You also have the option of toasting your sandwich. My total came out to $9.55 and wait time was about 5 mins around 1pm on a sunday. \n\nThe sandwich itself was almost as dirty as ikes sandwiches but gene's version of their dirty sauce was a little more watery and not as flavorful compared to ike's. Their meats wasnt too special but I wish they could have given more. The toasted sub bread ended up being kinda hard and too crunchy for my taste. \n\nSince its a liquor store also, you can also purchase a wide selection of alcohol and or other snacks and chips to accompany your sandwich. Since I live less than 5 mins away from this place and since the L passes by this place also, I think the location is better than ike's. Not to mention the decrease in wait time by 30x compared to ike's. \n\nI would recommend this place as an alternative to people wanting a nice dirty sandwich who doesn't want to wait hrs to get one.", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "A great place to grab a quick hot lunch and snacks. Also a really nice owner.", "author": "Lawrence Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-11", "description": "Sandwiches, Subs, I toss them all in the same category.  Gene's Liquor is a small, quiet corner store in the heart of Sunset, on Taraval and 32nd avenue right across from the 7-11. I must say that the deli counter isn't very attractive to someone who's coming in looking for lunch and the selection isn't tremendously vast neither.  I will say that if you're in the area and looking for a bite that's not taquitos or big bite hot dogs, Gene's subs are definitely a consideration.\n\nGene's Atomic sub comes with turkey, pastrami and corned beef (i think salami too? i could be wrong), along with cheese, your normal everyday condiments and their specialty sauce.  I usually request no mayonnaise but toss in pickles and jalapenos instead.  Lastly, they will toasted it.  You can request for it to be not toasted but why not? Overall, the guys working (owner) are super nice so if you have special requests, they're not gonna give you a hard time about it.\n\nThe sub costs ranges from $6 to $9 for a reasonable size sandwich.  This tends to be a busy spot especially during the school year and after school.  And since this is a liquor store, you can buy your chips, drinks, etc along with your sandwich.", "author": "Keith N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-30", "description": "Gene's was once my FAV go-to deli sando spot.  In a very deceiving corner store, was one of my oh so yummy beloved classic sandwich...the ultimate hot pastrami sandwich....\n\nBUT oh how the years have changed... \n\nThis past weekend I called in my order for 4 large hot pastramis.. Got there in 15 mins with them all ready packed in a bag.. cool...\n\nAs I broke out the sandwiches on a nice sunny Sunday..still hunger from the night before... ready to devour a fat juicy Gene's sando.... Instead I got what appeared to be a wet salad between two pieces of bread.............. WTF\n\nOK OK there was like 2 slices of meat I think... but seriously?!?! for $7.48 I expect a little more then that!!!  Ok..maybe it was just MY sando... but nope.. all 4 had skimp helpings of pastrami... \n\nLater my friend mentioned it was because I called it in, and wasn't STANDING there to look on the making of my sandwich.. shady....\n\nBroken down looking liquor store, with suspect looking veggies and skimp meat portions.....charging gourmet sandwich prices...... OVER IT.", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-11", "description": "For all your quick needs. Condoms, Booze, Blunt Wraps, they got it!\n\nBut what really stands out is that Gene's is the Sunset liquor store that offers a mean sandwich. I always stop by to pick up a hot pastrami sandwich. The bread is toasted in the oven, and the meats are hand cut by Gene himself. Try one with everything, I'll assure you that you'll be quite surprised at how good these sandwiches are. Most people would like to compare them to Submarine Center on West portal. I'd agree myself. The only thing that sends me to Gene's is the good price and quality service. Remember, ask nicely, and you will receive nice things.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "I love sandwiches.\n\nLike many other liquor stores, they make fresh sandwiches. Their specialty, the atomic sub, is especially good. It consists of three types of meat: salami, pastrami, and something else. You get your choice of cheese and condiments. You also get the choice to have your baguette toasted or not. (I recommend that you do.) Don't forget to ask them for more of their specialty sauce on your sandwich! All in all, the sandwiches here are yummy. Typically, it's a little under $6 for a small sub and a little more than $8 for a large sub.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "Ike's is the best place for sandwiches, in my honest opinion, but Gene's is a decent substitute if you're too lazy to drive over to the Castro. The first time I had a sandwich from Gene's was a year or two ago with my cousin and we were left unimpressed. I haven't gone back until recently, and that's only because I work two blocks away, so it's convenient for me and my coworkers to walk over and grab lunch when we don't have time. My coworker claims that they make the best pastrami sandwich, so definitely try that! Overall, not bad, and I'm always down to support local businesses!", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "I go to Genes all the time. Gene and the rest of the staff are all extremely friendly, and the sandwiches are absolutely delicious. I used to go to the the 7-11 across the street, but after going to Genes have chosen to support his business instead. \nThere is a good selection of beer/wine/liquor at decent prices, a wide variety of deli options for specialty sandwiches, and is fully stocked with the typical items found in convenience stores. \nI definitely suggest going here. Genes is a great local establishment in the Sunset, and has a Muni stop for the L-Taraval train right outside the door! \nMy only complaint is that this place is not open as late as some liquor/convenience stores...but thats totally reasonable since it is not a huge chain with tons of employees. You can look forward to seeing familiar and friendly faces at Gene's.", "author": "Gina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "They provide the best sandwiches in the sunset! Even when they have a line, they are friendly and maintain a sense of humor. They make the best sandwiches in the area and its always worth the wait!!", "author": "cory a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "Gene's a great guy, and the sandwiches are fantastic. Nothing super fancy, but great deli cuts, great bread, great service.", "author": "Caleb O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "First off, let me say I am on a hunt to find the best sandwich place in SF that is not too far from where I live. This place REALLY hits the spot! I'm starting to learn that sometimes the sketchier the outside, the better the sandwich! I would never before assume that a liquor store would make good sandwiches but this place does a GREAT job. It's not too pricey...the portions are large...and you can go to the same place to get your liquor as your dinner! Only reason I did not give it 5 stars is they could put a little more meat on the sandwich and take it easy on the dressing. Mayo, mustard, and secret sauce is a bit much when the focus should be on the meat.", "author": "Kelsey Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-09", "description": "Everytime I see Gene's liquors, it makes me want to buy a 22 because then I can think to myself, \"I didn't buy this Fat Tire from Safeway. I am subverting capitalism.\" Complete nonsense, but it makes me feel better inside. I would like to make it my personal cause to get young folks to buy liquor from small businesses. If you're going to buy the devil's juice, why not make it slight the man just a little? Gene's liquor is exactly the type of small busines I tell myself to support.\n\nSandwich update: I tried the subs at Gene's. They are huge, wet, and toasted (like i like my men), but seriously folks, this was a very decent sandwich. The service is abrupt, but neighborly. (They remembered who I was). If you're in the hood, check out Gene's!", "author": "Netty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "The place is a total dive; I mean even by liquor store standards, this place looks like the pits. But the sandwiches rock, and by sandwiches I mean the ATOMIC. Don't even think about getting anything else, just stick with the atomic coz it's got all the goodness in there. Great sauce and toasted perfectly in their italian mini-oven. \n\nThe only thing that pisses me off is that every time I go, the prices seem to go up, and the sandwich seems to be shrinking in size. Oh well.\n\nPS. A little tip for you - call ahead with your order.", "author": "Dom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-30", "description": "Gene's is the spot if you need a sandwich or a couple swishers for a discount price. Wait, let me clarify... swishers are at a discount price and the sandwiches are about average price.\n\nAnd damn, dude still knows me after not going in there for like 5 years. Maybe he's just faking, and if he is, he's got me fooled. \n\nShot out to Hamik!!!", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-27", "description": "Once upon a time quite a few years ago, I lived less then two blocks from Genes, I would go there for sandwiches and vitamin waters almost every other day.. \nGene can make a sandwich like nobody's business. The Atomic sub btw, kicks ass! I also suggest the salami and cheese if you aren't into Atomic spicy. At any rate, if you are on Taravel @ 32nd hit up Genes liquor store and definitely try a sub he's been making sandwiches for decades and they are superb.", "author": "Tawnya C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "Yes, it is weird that a liquor store in the outer avenues makes a freaking delicious sandwich but so be it. I can't count the number of times I have gotten a veggie sub sandwich from this place and it has consistently been good. Nice toasty bread, generous with the avocado, yum! It is the perfect sandwich.\n\nI've gotten other people hooked on these sandwiches too. So far I've only eaten the veggie but I have heard the meat ones are good too.\n\nWriting this review and seeing the pictures is making me hungry for a veggie sub!", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-25", "description": "Gene tightly converted a corner of his behind the counter space into a sandwich shop. His shop is old, small, and the smells are questionable but his deli ingredients are AFAP(as fresh as possible). The pastrami and corned beef are great quality. The turkey is so so. Mix them altogether and you got an Atomic Sub.\n\nThe Atomic Sub is his specialty. The combo of meats with melted cheese and special sauce is a hearty filling for a warm toasted sub. My regular Atomic Sub, water, and kettle chips cost 8 bucks. \n\nAll Sandwiches are toasted and hot with special sauce. Gene says \"Ask me for a cold sub and I'll send you across the street to 7-Eleven.\" \n\nThe special sauce is a runny vinegar style that helps soften the crunch of the toasted bread.\n\nNo hurries here or tables for that matter and a line can be expected but if you happen to be on Taraval and 32nd with a hunger for something to go, give Gene's a shot.", "author": "R J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "If you're in the area, pop into this liquor store for a sandwich! Menu can be intimidating at first, but you pretty much choose the size of your sandwich, your meat and cheese and say what you don't want on your sub. Pastrami was delicious and my husband's atomic sub was great too. Love that they toast the sandwiches too. The bread is a bit lacking in chewiness, but you can't beat the neighborhood feel and the love that goes into their toasty subs!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "Best sandwich in the city? No, I wouldn't say that but it is pretty high up there taste-wise.\n\nThe bread is some of the best I have ever had. Untoasted, it is soft and not too chewy. Toasted, it is flaky and warm but not too hard where it scratches the roof of your mouth.\n\nI had the Atomic Sub and it was pretty damn delicious. Their special sauce is basically just Italian dressing, but it still makes it taste good. There's tons of meat in this sandwich - definitely a plus and a good serving of lettuce to balance out the mountain of protein. \n\nWould I drive halfway across the city to go here? Nah... but since it's only a matter of blocks away, I don't mind scampering over there to grab another Atomic.\n\nAn alternate sandwich shop to try: Lou's Cafe on Geary and Park Presidio - blows this place out of the water!", "author": "Christina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "I officially popped my Gene's-Liquor-sandwich-cherry recently. Why have I waited for so long? I have a friend that lived down the street that would rave about this place and I was always reluctant. Shame on me.\n\nI had the veggie sandwich and was stoked to see them toast the bread to order. I wholeheartedly believe that the bread can make or break a sandwich and Gene's have got it right. \nThey have a great beverage selection and other such munchies to accompany your sandwich, all for a decent price.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "The guys here ain't the friendliest, I'll give ya that. BUT!!! I'm not here to make conversation with them, I am here to get a delicious mouth-watering sandwich. The atomic sub, to be exact ;)\n\nLike most liquor stores in the area, the things you find here can be found at safeway as well. Oh! But one big difference, the things here are probably 15 years old. I never touch it because it's dusty. How long do you have to leave things out before they accumulate enough dust to be a carpet for ants? Well, I usually ponder around while waiting for my ATOMIC SUB! :)\n\nIt is absolutely delicious. When I used to go to Lincoln, I'd get off the L taraval here to grab a sandwich and hop on the next one home. When I get home my sandwiches are usually still warm which is a definite plus. They're SO good that I have to get the large ones so even if I don't finish it, I'll probably want more later during the day.\n\nI definitely recommend Gene's.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "I was out waiting for next door to open and remembered that one of my coworkers said that Gene's sandwiches are good.  I went over to Hamik and ordered up the Atomic Sub with everything.  I ordered the large size cut in half so I can take it home to share with the daughter.\n\nTo make a long story short, the toasted wonderfulness of the warm meat, lettuce, tomato and onion sandwich did not make it home.  I could not stop.  I quickly finished all evidence of the sandwich and wondered if I should go back for more.   Nah......I probably would have eaten that one too!  \"The Daughter\"  will have to be happy with a piece of fruit or something for her snack.........", "author": "Curtis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "Damn, I had almost forgotten about this place until I got my Yelp spam this morning.\n\nWe used to (like 10 years ago now--writing this is a total \"holy shit, I'm old\" moment) call this place Juice's, even though it is really called Gene's and the guy who runs the place is called Hamik. For some inexplicable reason Hamik was nicknamed Juice by my boy Vinny, which is a good name for someone who is good at giving other people nicknames. Point being, you can call Hamik (proprietor of Gene's) pretty much any name in the book and he probably won't blink an eye. Thus concludes the most convoluted paragraph in the history of the written word.\n\nAnyhoo, you can get a very good toasted liquor store sandwich here. Not quite as good as Roxie on San Jose Ave., but a spot-on knockoff of the Sub Center in West Portal. Also I remember the beer selection sucking pretty badly (even though I was still drinking 40s at the time), but there's a 7-11 across the street.\n\nP.S. Several years ago Gene's had a fire under mysterious circumstances, and when it reopened it was considerably nicer. Like C & C Music Factory said, it's one of those things that makes you go \"Hmm...\"", "author": "Trav W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "Really cheap sandwiches and the guys here are great -- really appreciate your business. Definitely a hidden gem.", "author": "Niran L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-23", "description": "Definitely great sandwiches when I need a last-minute meal...\n\nI always compare every deli to Roxie Sandwiches, and I was pretty satisfied. The bread was toasted just right, and my stomach was craving for more. \n\nIt's a small rundown-lookin' deli, and you'll have to keep repeating yourself to the workers on what you want in your sandwich, but there's not much to complain about.\n\nThis will be my back-up deli spot when I don't feel like driving all the way to Roxie's.", "author": "Milz T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "...AND DELI!\n\nFriendly guy, and a good place to grab a bite while waiting for the L line on Taraval.", "author": "Chris I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "Really cool that this liquor store also has sandwiches. Love that it's just a mom & pop shop handling the business! The sandwiches were worthy of my mouth but they were just too ordinary for me to keep coming back. If I lived in the neighborhood, I would most likely come in for a quick meal but other than that, I wouldn't trek out here for them.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "I love this place... Nice people and great sandwiches.\n\nI just put a serious hurt on a veggie sandwich for lunch and it blew my hair back.\n\nThe veggie has loads of fresh avocado, an assortment of veggies, cheese, and their special sauce (which is awesome) on a toasted roll.  You really can't go wrong with this place for a sandwich to go.\n\nSandwich, bag of chips, and a can dr pepper ~$7.50", "author": "Joseph H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-04", "description": "If you blink while driving past Gene's, you'll miss it completely, which would be a damn shame because this Sunset neighborhood liquor store is a front for one of the BEST sandwich shops in San Francisco. \n\nI popped in here for my 2nd visit, and once again ordered the wildly popular \"Gene's Atomic Sub\" which consists of pastrami, turkey, and corned beef, my newly favored triumvirate of the sandwich world. You also get your choice of condiments and fixins.\n\nFor roughly $7, you get a fresh sandwich, made to order and toasted right before your eyes. What more could you ask for? Well, I'll tell you what I would ask for..... \"I just wish there was more yummy meat between those warm buns!\"\n\n(Oh....you can also buy liquor here. Shhh!) Let's keep that between ourselves, mmkay?", "author": "Rory O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-05", "description": "Ok read all the great reviews and decided to try in on Saturday night. \nI was hungry looking for a great sandwich in the area. I tried the Atomic Sub and yes it satified my hunger needs. But no it was not all that. I've had better and nothing stands out on this sandwich. He put some special sauce which just looked like italian dressing. Anyways, no hype here I've had better sandwiches and this was just ok. Will I return probably not. It also wasn't cheap for a large automic sub it was $8.35", "author": "Larry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "Update: Day old Gene's sammies are a tad soggy if you get the Special Sauce on it - but....but but but. Still delicious! \n\nPlus...there were 4 of us in the store when I went... the owner knew ALL of our sammies plus my boyfriend's pick and he hasn't even physically been there yet. \n\nLove this place! I go outta my way for a Gene's sammie and I'm never disappointed.\n\nOH! and ...triple win for the STACKS of avocados he puts on your sammie when you ask for them... layered and stacked all the way down the sammie. YUM!", "author": "Katy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-02", "description": "Everyone likes to compare Gene's to Subcenter in West Portal, primarily because \n\n1) Their flagship sandwich is also called the Atomic Sub\n2) There's rumored to be a family connection between the two\n3) Subcenter is, you know, like too popular now, and people need a new underground cult sandwich spot.  \n\nAnd Gene's, being a one-man show (what's up Hamik!) in a corner liquor store far out into the avenues, is plenty underground...for now (I don't know how much lunch traffic they could really handle if word gets out).  Of course, I couldn't try the atomic sub as I don't eat beef anymore, but the Italiano, with 3 kinds of salami, makes a fine substitute.  I'd describe it in more detail only I ate it too fast to remember much.  Note that the large can definitely feed 2 people.\n\nOf course, living two blocks from Yellow Submarine these days renders the whole Subcenter vs Gene's debate largely moot for me, but Gene's certainly earns its place in the LSS (liquor store sandwich) pantheon.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-22", "description": "mmmmm sandwhiches are bomb, I never go anywhere else to get sandwhiches, because no one else can compare.\n\nLove the workers!", "author": "Porsha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-18", "description": "Great sandwiches, can vary depends on who makes them.\n\nGenerally Hamik makes the best.  When he makes them, they are definately the best I've found in the Sunset.\n\nCan't recommend buying much other than drinks and sandwiches there.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "BEST SUB SANDWICHES I HAVE EVER HAD! Everything is so fresh at this place. I ordered the hot pastrami and I absolutely loved it. The bread is amazingly delicious and toasty and the pastrami is some of the most premium cuts that I have had on a sandwich. They put a ton of meat and they coat everything in a nice italian dressing which perfectly compliments the Hot Pastrami. If you are not sure about the dressing, ask them to go light or maybe give you a side because they put a lot of it. I like it but maybe some may not like so much. I don't know if they automatically put Mayo but I asked that they do because a lot of places don't on this sandwich. So if you happen to order a Hot Pastrami and they don't put the mayo.. make sure you add it! It makes the sandwich like 10 times better.\n\nThis place is not exactly where you would expect to go for a delicious Sub Sandwich. Its located way off the main streets (though Taraval St is kinda a main St I guess.. but its really not) and its inside of a FREAKIN LIQOUR STORE! I don't know why we don't have any places like this around Fremont but I sure do enjoy taking the extra drive to grab one of these subs from Gene's.  I also heard that this place lucky for lottery tickets so I grab one each time I go. Haven't won yet but I'm looking forward to when I do. \n\nOverall I had a great experience here. I absolutely love their sandwiches and appreciate that they do make a good sub due to the fact that so many places these days get it soooo wrong. If I'm craving a tasty sub... would I drive from Fremont all the way to this place?? Yes... yes I would. Its that good! The great toasty bread also makes it that much better.\n\nGood Job Genes Liquor... and Deli!", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "My usual- Atomic Sub, it has like three different meats. Its a liquor store so be ready for people buying a 40 or cigarettes or lottery tickets while you wait for your sandwich being made. Overall, the sandwich was good. The secret sauce is pretty much like a watered down italian dressing. I believe they only have two types of breads (the roll and sliced bread. I wish they had dutch crunch.\n\nPrice- About $8 bucks for the large\n\nTime- Its a liquor store so come right in and order and they make it for you right in front of you.\n\nWill I come back?- Yes", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-01", "description": "Getting a pastrami sandwich at Gene's was an interesting experience to say the least... \n\nWe walked into the corner deli and there was a short line. There were 2 guys working behind the counter, one cashier (we'll call him Skinny) and a sandwich maker (we'll call him Cool). The line died down and Cool was still finishing up some sandwiches. We are the only ones left in the store.\n\nSkinny looks at Cool. Then looks at us and back at Cool again.\n\nHe looks around the store. \n\nLooks back at Cool again.\n\nSkinny: Wait, who are those for?\n\nCool: What? \n\nStops what he's doing and looks at Skinny like Are you serious?\n\nSkinny: There's no one else here.\n\nLeaves counter and looks around the store. Comes back.\n\nSkinny: Oh, nevermind. I know who it's for. He'll come back...\n\nSo Cool finishes up his sandwiches.\n\nSkinny takes our order and rings up another customer. \n\nPretty soon, the little deli gets busy again.\n\nSkinny helps Cool start another customers order. \n\nOkay, you wanted the vegetarian right? Wait, you didn't want what? Wait, what?\n\nCool's over there just cool, calm, and collected. \n\nHomeboy skinny was getting all frazzled, pacing back and forth.\n\nCool finished up our sandwiches and Skinny started to bag them. Because he was in the middle of making someone else's sandwich he was wearing mustardy gloves and got mustard all over the the bag. He proceeded to wipe it off with a napkin but instead just spread it everywhere and made it worse. So he sighs and takes off his gloves and gets a fresh bag. Hey, at least he's wearing gloves though right?\n\nHe finally bags everything up and rings us up. I hand him a 20 and he looks at me and goes oh ho ho.. I thought this was a 100! Umm okay, I'll take it.. you can give me change for a 100! I just laughed cause he was getting really stressed.\n\nAll in all, the sandwich was pretty good. Pastrami with added avocado. Only one choice for bread but they toast it. Trust me, it tastes so much better if you're enjoying it oceanside by the beach!! \n\nMaybe Cool should've indulged in some of Gene's liquor to chill out a second!!", "author": "Angela W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-22", "description": "mmmmm..... \n\nMy sister told me that Gene's is the new after school hangout place for SI kids ... back in my day, we all headed to Sub Center in West Portal, so I was interested to see what the kids do these days. (I know, totally lame!) \n\nSo my sister and I took a little field trip to Gene's. We picked up some random gummy sours, a turkey and a salami sandwich - just mayo, meat, cheese, bread and special sauce. Hopefully I'm not ruining any secret (SO DON'T READ IF YOU DON'T WANT TO KNOW) but I'm pretty sure the secret sauce is Italian Dressing. \n\nOur sandwiches were money, but I'm deducting one star because it was overly mayonaised. I like mayo, but it seriously had like 10 little drops of mayo all over my plate when I was done. Too much! I'm definitely going to be back though, and this time I'll order light on the mayo and probably no on the secret sauce :)", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-04", "description": "ok, so this is the perfect example of a place on yelp getting too many extra ***** for being a dollar cheaper.\n\nThe nitty gritty truth:\n\n- it's a cheap large sandwich\n\n- it's a solid sandwich made with fresh ingredients\n\n- it's just a sandwich and there isn't anything special about how it tastes\n\n\nSo if we're ACTUALLY rating on a scale of 1 to 5 stars, with 1 being Subway or Quizno's (i.e. total shit, DO NOT EAT) and 5 being Ike's (!@#$%^ DELICIOUS and tastes unlike any other), instead of on the standard Yelp scale, which is 4-5 stars if you just like something and it's cheap, 1 star if you got too drunk, vomited and/or got kicked out ..... Gene's is a solid 3.  Eatable and good, but not anywhere near tasting unlike any other.\n\nThe owner & employee are super friendly, and worth giving your business to, get a sandwich if you're in the area and craving a regular sandwich, but don't go out of your way to get it.", "author": "Greg J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-04", "description": "THE BEST SANDWICHES IN THE CITY!  \n\nI've eaten just about everywhere in the city that claims to have \"great\" sandwiches.  This little mom and pop liquor store blows everybody else out of the water.  The crispness of the bread mixed with the \"special sauce\" makes it the prefect sandwich.  Makes my mouth water just writing this.  I usually order the large size atomic sub, and it's big enough for my wife and I to share.  If I could give 6 STARS I would.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-20", "description": "This place doesn't look as much, but if you are hungry and want the best sandwich you can possible find in the entire Sunset district. I'll take that back. In the entire San Francisco, and I've lived here for 13 years! Tuna sandwiches ROCK! Subway or Quizno's wishes they have something that good.\n\nGene, You probably don't know me, but know my face, Thank you very much for making your sandwiches great and staying open all the way till 10pm. Your the BEST!!!", "author": "Vadik M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-22", "description": "It is the BEST SANDWICH in the city in my opinion. \n\nI know why people love sandwiches from places like Ikes: big portion with tons of meat and sauce. But the downside is the bread would never be crunchy even if it's toasted because there's way too much sauce and veggie. Also, I can never finish those sandwiches without getting all messy.\n\nSandwiches from Gene's,however,is very neat. He gives you right amount of meat/veggie/sauce which you can actually enjoy your sandwich without using a fork. Everything is at a right portion that nothing is overpowering and the flavors work very well together.\n\nWhat I like most about the sandwich is the bread!SUPER CRISPY CRUST. The bread is always toasted to perfection. Like what I have mentioned above, I don't think I have ever eaten a sandwich that actually have such crispy crust!\n\nMost sandwich is $5.50 for regular and $7(??) for large. I have yet to try their famous atomic sub but a simple roasted beef sandwich from Gene's is already enough to wow me.", "author": "Ris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-25", "description": "I've been coming here since high school. The sandwiches are surprisingly good! The bread is soft on the inside and nicely toasted on the outside, the meat and other ingredients are fresh, and the sauce brings everything together. You can choose from regular or large. There are good amounts of ingredients in the sandwich and everything is nicely balanced. The prices have stayed fairly low and the service is still wonderful. Although I enjoy sandwich spots such as Ike's, Little Lucca's, and Roxie's, I will always stay loyal to Gene's. The sandwiches are simple but delicious!", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-06", "description": "I go back to Gene's every single time I visit my alma mater St. Ignatius, the sandwiches at Gene's are delicious! The L stops right outside, so it is easy enough to get there if you don't want to walk or don't have a car. There is a great variety of sandwiches and anything else you'd expect in a liquor store. I miss this place when I am away at school. Be sure to get the \"secret sauce\"!!", "author": "Emily G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "A few years ago, I visited a friend up in the city and he took me to Gene's.  Apparently, lots of SI high school kids call this a regular eatery.  He told me the sandwiches were amazing but I was a little skeptical because 1. I was a much pickier eater at the time and 2. Gene's looks a little sketch, especially when I was used to living in crisp and clean suburbia, getting my sandwiches from MollieStones.  \n\nSuffice it to say that I was wrong and Gene's is delicious.  This was also the first time I'd had my sub toasted (as I had yet to travel to college and partake in the wonder that is 24-hour Subway.)  You should check it out for lunch, if you're in the neighborhood.", "author": "Katharine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-28", "description": "After reading all the reviews about the sandwiches here, I decided to give this place a try. I am so glad that I did! The atomic sub was really yummy! I got the small size (which was $6 something...i think, large was $8 something) and it consists of turkey, corned beef and pastrami, their special sauce and with the usual tomato, lettuce (?), onion, mayo and mustard. They make the sandwich in front of you and they toast it too, which is always a plus =) I didn't eat the sandwich right away so I thought that the whole sandwich would've gotten soggy, but it didn't! I ate the sandwich about 20 minutes after I had bought it and it was still warm and the bread (which I LOVE!) was still crusty on the outside. I enjoyed every bite of it. I think next time I'll get a large, just because it's THAT good.\n\nCaveat: If you're sensitive to sodium like I am, have a gallon of water ready. It's totally worth it!", "author": "Maryann T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "upon moving house and thus not going to the laundromat next to the 7-11 across gene's anymore, i have not had the atomic sub in quite a while now.\n\nhowever.\n\nthere is no forgetting the beautiful flavors wrapped in white paper, and the inevitable mess that happens during consumption. ace taste. leave elegance at the door, and your sauce-stained fingers and face away from your fresh laundry.\n\nextra sauce, get the bread toasted, grab a cold drink and extra napkins, devour while chaining youtube videos or while watching a movie on your laptop as you wait for your laundry to get done, wipe fingers and face clean before handling clean clothes.\n\nthis routine will make you WANT to do laundry.", "author": "Eliza D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-13", "description": "I've been coming here for 4 years.  The sandwiches are pretty good.  But the only problem I have is the quantity of the meat.  They barely give you 3 slices of meat!.  For god sake, please add more meat for your customers.  Sometimes, I feel like i'm eatting a vegetarian sandwich.\n\n3 Stars because of barely any meat.  Would've gave this place 4 stars.", "author": "Steven T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "The sandwiches......... are. so. good. Mouthwatering is an understatement. The whole ride home after buying one of these bad boys is a constant struggle with myself to not devour it while I drive.\n\nAnd maybe I'm easily entertained, but I love the way the guy scoops the avocado onto the bread. Haha. This place is great. Extraaaa secret sauce pleeeeease!", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "I've lived by Gene's for 2 months now, and its every bit as tastee as my friends have told me.  The workers are awesome humans, and the sandwiches are equally as good.  Hint: get no tomato, helps w/ eatability. \nThe Italiano is killer.", "author": "N O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-26", "description": "Remember that episode of Friends where Joey walks around with this sandwich, and he jumps in front of Ross after they hear a gunshot (which turned out to be a car back-firing), and Ross thinks Joey saved his life but really Joey was just protecting his sandwich? Well I thought that episode was stupid... that is, until a had one of Gene's sandwiches. \n\nI never knew how much love a man could have for slices of tender pastrami, provolone cheese, perfectly toasted bread and oh so yummy mystery sauce. I truly believe that if my sandwich was in danger I could call upon an inner super-human strength (powerful enough to lift a small car off a baby) to punch the fool who tried to take a bite.", "author": "Sang N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "The jewel in the crown of the Sunset. I've been a proponent of Gene's since 2001. Gene's hot pastrami, everything on it with jalepenos, swiss & avocado will be my last meal on the planet even if its through a feeding tube. Gene's is generous with its toppings and meat and is consistently toasted to perfection.", "author": "Nicholas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-30", "description": "ok the word is getting out now. yelpies like subcenter. i love subcenter. only problems is exactly that, too many mofos are eating subcenter. today, i stopped by to pick up lunch. its not that i dont like kids, but this kid in front of me was driving me nuts. mustve ordered like 15 sandwiches, each with specific instructions like only mayo on half of one side. good god. the kid was about my size, would it have been wrong if i smacked him? anyways, this is the kind of day i wish i went to genes.\r\n\r\ngenes is a 'set secret. im letting you guys in on it. you cant tell from the outside, but this place rocks. sandwiches are very similar to subcenter, without standing room only policy. one of the 'sets urban legend does say that theres family ties between subcenter and genes, like my buddy hen a aka bob says in his review, but until adam and jamie proves it to be correct, itll stay a 'set legend to me. \r\n\r\nsandwiches and beers at one place. how can you say no?", "author": "Euge L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "Me: \"Are these sandwiches toasted?\"\nHamik: *creepy smile* \"All our sandwiches come toasted. Hehehe.\"\nAnd thats how I fell in love with Gene's Liquor. Came here in the middle of a random day because my girlfriend wanted a taste of her childhood, so we got the atomic sub and a roast beef sandwich.\n\n-Atomic sub was pretty good. Salami, turkey and pastrami I believe. Might be wrong. I only got a regular size but it was filling. My main beef with the sandwich is the messiness. I know thats a lame complaint but I was eating it in the car and it gets everywhere and yeah. \n-The roast beef sandwich is amazing. Roast beef is my favorite type of sandwich and they do it justice. Long thing slices of roast beef piled thick on a warm toasted bun in vegetable layers that don't slide around. It was one of the better made roast beef sandwiches I've had. And I do consider myself to be a roast beef sandwich connoisseur.  \n-The secret sauce is delicious. Its some type of vinegar based sauce. Really tangy, but works well with in both sandwiches.\n-They SLATHER on the mayo. He scooped this HUGE dollop of mayo onto a spatula and paints it onto the bread. And I'm watching there, my mouth drooling but my muffin top horrified. Just be wary and ask for less if your love handles can't handle the love.\n-I asked for pickles and peppers which are complimentary but don't come with the sandwiches. But he also piles on the peppers. I love spiciness but I swear, every bite I was eating 2-3 jalapenos. \n-I like the toasted bread but sometimes, if you bite into the sandwich wrong, the bread will cut the roof of your mouth. I hate that feeling!\n-I think the total for two sandwiches was $12. Both were regular size and my girlfriend and I were both really full. So I can only imagine what a large would have done to our stomachs. \n\nTry it out! If you like sandwiches, Gene's Liquor has tasty varieties. Plus Hamik is really nice and its pretty cheap for what you get.", "author": "Aron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-30", "description": "Gene's Liquor where the guy who owns the place ain't even named Gene. Go figure! He may look like a crusty old fart that hates dealing with people but he's actually not that bad of a person. Always polite and courteous to people. And who can hate a guy that watches Al Jazerah on the toob?\n\nI have yet to ask him what his name is but that's not really that important. As long as he gets my order right, it's golden. And how hard is it when he makes most of the sandwiches here himself? I'm pretty sure he can do this blind folded if he wanted to show off a little. Not too sure if that will work out when he gets to the oven, though...But all in all, he makes good sandwiches. Can't complain too much about them because I like what I order and what I order I like. \n\nOh, and he sells Moon Pies! I haven't seen Moon Pies in forever!!! And he has both flavors in stock!!! How cool is that? And the Rocky Road candy bars? He has multiple flavors! Total Awesomeness!!!", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-14", "description": "This is the first time I've had a sandwich made inside a liquor store and I must say it was a treat (thanks Jo for the tip).  \n\nThe ingredients are not gourmet but they are fresh and for $5 (regular size), you get a satisfying sandwich packed with veggies, meats, cheese, etc.  I like how toasted the roll is - it's as toasted as I've ever received (without being burnt).  The bread to filling ratio is good - not too much bread, generous amounts of filling.  \n\nI had the veggie sandwich with avocado, cucumber, two kinds of cheese, mayo, mustard, onions, tomatoes, lettuce and the special sauce.  The special sauce tastes like Italian dressing and it gets squirted on your sandwich. \n\nIt's a messy experience, but Hamik gives you napkins.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "The short:\n-AWESOME sandwiches (Italiano is the one to get, with everything)\n-Right on the L line\n-Very consistent in their sandwich making\n\nThe long:\nThe S.O. used to live two blocks from here, and upon seeing their sun-faded sandwich sign I dared myself to go into Gene's one Saturday before heading to his place.  Unbelievable was the first word that came to my mind while consuming the Italiano, and ever since I've been a fan of this place.  The sandwiches are great, and when I have time, I will ride the L line all down here just to grab one.  My favorite is the Italiano, and it's been made the same way every time (even though different members of the family who owns Gene's make it).  If traveling to the beach or the zoo or whatever, make a trip to Gene's!", "author": "Stacey H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-13", "description": "11APR08:   *****************************************************************\nRead most of the reviews before heading out to Gene's tonight.  The intent was to come out here to pick up one of their highly raved about gourmet sandwiches.  I was REALLY looking forward to trying this place especially after reading all the recommendations.  I grew up with and really like the Submarine Center (SC) on Ulloa St.  (see my other review on SC) Some were praising Gene's as better and costing less than SC which was why I was excited to try this place.  I really wish this was true because as much as I like SC, I do admit that I feel their submarine sandwiches are expensive ($7-8+ !).  \n\nAfter trying Gene's, I must say that I was a little disappointed.  I placed the take out order Friday before making my way out to AT&T Park to see the Giants game (what better way to see the game than with my Gene's Liquor sandwich? :)  The bread was still crunchy from being toasted but the rest of it, unfortunately, got soggy probably from the Italian dressing secret sauce and was pretty messy to eat.  \n\nI ordered the large Atomic Submarine sandwich (which I thought was kinda funny since SC had their own \"Atomic Sub\" as well) and set me back approximately $8.37 (these are SC prices we're talking about!)!  The sandwich wasn't bad, the service was friendly, but wasn't what I had envisioned.  I do plan to come back and give this place a couple more tries.", "author": "Steve J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "A very hidden spot in the relaxed sunset district.  I've been coming here for sandwiches for years now.  Popping the sandwiches in the mini oven gives it the perfect touch.  The atomic sub is a never-fail sandwich.  Every sandwich has a splash of their \"secret sauce\".  I've tried numerous times to see if he would divulge his secret to me, but it never works.  Its a really good spot to get a hassle free, delicious sandwich.  \n\n*nom nom*", "author": "Steve H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-21", "description": "BIG HUGE SANDWICHES FRESHLY MADE.\n\nThey're delicious and crammed with stuff. They totally do not skimp out on your sandwich fillings. The guy there takes his time to make a good sandwich and I've enjoyed each and every one!\n\nEDIT 02/23/08: Get pastrami with everything on it w/ avocado. OHBABY. Soooooo gooooood. I think this might just be as good.. or better.. than Roxie's! GAHH!", "author": "M J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "ahhh...Gene's Atomic Sub!!  Been having this for years!...always a treat!!  Just recently noticed though that they raised their prices...I'm pretty sure that they raised it gradually but i didn't notice until now cuz it is $8+ for a large!  Holy...!!!", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-21", "description": "Good sandwiches, but don't look at it when he makes your sandwich. Sometimes he doesnt put on gloves and his old yellow nails are in your sandwich, and if you ask him to put on gloves he'll give you attitude. haha what a fool this guy doesnt know how to do business. his stuff is good but hes just a ____ he'll never make it big like subcenter. I rather pay a dollar or two extra at subcenter at least i know its clean and rat poo isn't in that box that he digs the bread out of.. BTW the meat is not fresh like subcenter its all microwaved in front of your face. \nand he increased the price by 50 cents.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-11", "description": "This is one of my favorite sandwich places on the Western side of San Francisco. It is a unique sandwich with a flavor and texture that I find myself craving at least a couple of times a month.\n\nDon't let the humble surroundings fool you, these guys make a solid sandwich.\n\nI've updated this to 5 stars because it has stood the test of time!", "author": "Kent C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-16", "description": "Gene is hella cool unlike the bitchy women across the street at 7-11 who won't sell you a pack of cigs even with THREE student id's at colleges the first one being from 2001.  I aint no doogie howser *sigh*\n\nBut Gene is there with his famous atomic subs and cheap bacardi.  Although the liquor selection isn't that big, it's the closest hard stuff to Lucky's on Sloat and when you're looking to get fucked up on Skyy and you're too drunk to drive as it is... \n\nThank you Gene's Liquor for making living the barren wasteland of the outer sunset a little bit more bearable.  Bonus for the terrible band that practices upstairs.", "author": "dr S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-18", "description": "Pro:  Best tasting sandwiches I've come across to date (Sub Center, Quizno's, Subway, Roxy's - come try one of Gene's and go back and change up your recipe), owner, no his name is NOT Gene, is a great guy with the cutest kids!\n\nCon:  No Dutch Crunch!  =(\n\nI live half, yes half, a block away from Gene's, so I've had a few of his sandwiches.  First, Quizno's boast of their \"toasty\" sandwiches when Hamid (I think that's the owner's name...) probably schooled them on it.  Second, Hamid actually sold his secret sauce recipe to the Sub Center.  Do yourself a favor and get some Gene's.", "author": "Violet C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-18", "description": "I live right across the street from Gene's.  \n\nSome people my raise their nose at this sandwich destination (I mean we are in San Francisco with the foodie elite) But don't knock it till you try it sista.\n\nGene's puts up with my picky ass and my some what awkward sandwiches.  I'm one of those freaks who doesn't like condiments.  So hold the mayo and mustard pahlease.  And I'm not so much a fan of onions, pickles, or tomatoes, so none of those either.  But Gene's always manages to get my turkey, swiss, lettuce, jalapenos, and \"special sauce\" sandwich just right. \n\nIf you're in the neighborhood and find yourself craving a good toasted sub, stop into Gene's and you won't be dissappointed.  Don't hate.", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "I almost didn't review this place because I wanted to keep it a secret ALL TO MYSELF.  But I can't help sharing a favorite sandwich spot.  With that being said. . .\n\nHow I miss Hamik sandwiches!\n\nWe would usually go in at least once a week for these delectable lunch treats to fill us up after going too many hours without eating.  There was always plenty of meat to make the sandwich tasty and filling.  The secret is definitely in the sauce and the toaster.  Or is it in the fact that I would watch him make a fresh sandwich every single time?  Oh the toasted Hamik sandwich!  I long for its crunchiness.  (Just thinking about it makes my mouth water.)\n\nThe store itself always seemed a little on the disorganized side, but I didn't really mind.  It doesn't have a ton of stuff, but a little bit of everything - especially when I needed something little at the last minute, like an Arizona Iced Tea to go with my sandwich.\n\nDefinitely the best corner store for fresh sandwiches!", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "Get the ATOMIC SUB! Gene is a really nice guy and always makes the subs too.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-21", "description": "mmm mmm mmm. You'd better be hungry.These babys are stuffed to the max. I had the tuna with EVERYTHING (except very yellow mustard). EVERYTHING is lettuce,tomato,pickles,onion, jalapenos, avocado,cheese,mayo,secret sauce (a perfect vinaigrette )....all served on a toasted baguette. Very yum. I guess the only way to improve this luscious sub would be to use Acme bread. Be sure to have plenty of napkins on hand.", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-28", "description": "Been coming here for over 10 years!  my favorite sandwich in the city - Genes atomic sub!  Sooooo good.  Hamik is the man!  bout once a week I make sure to get my fix,  \n\nATOMIC SUB....Dont miss out", "author": "Kris O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-18", "description": "I live a block away and am always waiting for the L in front of here. After reading several yelp reviews and walking by this unassuming place for two weeks, I decided to try a sandwich for dinner because I was already starving and didn't want to cook dinner. \n\nI went with the vegetarian sandwich cause the guy behind the counter wanted me to order before I was really ready and it was the last thing I had read -- avocados, yum! But then he started making another guy's pastrami sandwich and I went \"damn I should have ordered that.\" I took my veggie sandwich home and ate it though --- and I loved it! The sauce with the ingredients and the toasted bread really hit the spot. I didn't even care that I didn't get the pastrami, but next time I'll get it just to see.\n\nAnd at $5.50, the sandwich was totally affordable!\n\nNow, if you want to shop any of the other things in there, expect to pay the premium for convenience. All the local liquor stores are like that though -- and they appear to have a fairly large selection of booze if that's your thing.", "author": "Katies F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "From the outside, Gene's is just your average neighborhood corner store.  It looks a little bit run down and not the cleanest liquor store I been too.  However, they have amazing sandwiches.  I usually get the hot pastrami sub for $5 or the $8 large one and split it between 2 people.  Its basically a toasted crusty french roll with the trimmings (mayo, mustard, lettuce, etc) piled with mounds of hot pastrami topped off with some Italian dressing. It beats any other $5 sub I ever had and I'm pretty sure most people will agree.", "author": "Dean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "YUM.  We'd been going there for the occasional sixer of beer, or for my babe to get smokes, for a good while, and yes, those are reasonably priced, especially for a convenience store.  But!\n\nThe sandwiches!  Oh yes, the toasty sandwiches.\nI think I started with turkey, some long ago day, but the Atomic wins!  Turkey, pastrami, and corned beef.  $8 for the large size, but totally worth it.  One half now, the other in a few hours.  Nom nom nom!  ;D\nPerfect for when you're too tired to make your own food, and too hungry to wait for delivery.  :P\n\nThey also have a good selection of wine, liquor, snacks, and a decent pantry section.", "author": "Ali W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-12", "description": "Tried the Atomic Sub yesterday.  It was solid, next time I'm trying the Pastrami.  For me this is still second to the Yellow Submarine on Irving St, which is still high praise, and if I lived out by here, I would hit this up all the time.  I used to hit this store up all the time back in the day for alcohol.  I had no idea they made delicious sandwiches!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "I found myself on one of those 3 am romps through the Sunset one night. I visited 7-11 for a pack of cigarettes? Who knows, maybe some Fritos. Anyways, being bored and waiting for the L to come, I peered into the closed liquor store, which I had never really noticed before. Then I saw a sign saying that they had the best sandwiches in the Sunset. Now that's a claim....\n\nA few weeks go by and I have yet to try one of these sandwiches. Then a good friend of mine brings it up, saying that whenever he's in the Sunset that's his go-to sandwich spot. So, I trek down there and order a regular turkey sub with everything on it. YUM-TASTIC! The sauce was so good I let it leak all over my shirt without a care in the world. I went back later that week to get a Large Turkey Sub, yum-dee-dee-dum. I'm interested in trying the veggie sub too. Perhaps I shall go there today!\n\nThe only reason this didn't get a 5 star was because the guy who makes the sandwich wasn't really that friendly-seeming. He kept on interrupting his sandwich making to help other customers even though I had been patiently waiting for a while. But hey, he has a business to run, so it's all good.", "author": "Emerald M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-06", "description": "I love gene's liquor for many reasons.\n\n1. The price is much cheaper than the owner's cousin's place on West Portal (sub. center).\n\n2. The quality of the food is matched to (sub center) without the intense crowd of people. Although he does get very busy too.\n\n3. Parking on taraval is much easier than West Portal.\n\n4. Friendly, always carry a conversation with the owner.\n\nAnyways, before I list over 20 things, I would just like to say try this place if you haven't. Don't judge a book by it's cover, because that's exactly what I did. On the exterior it looks like a bad shape liquor store, but what really counts is the food right? I usually call in by phone and by the time I reach the place it's already done.", "author": "Austin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-06", "description": "Out of reluctance, I agreed to have a sandwich from a liquor store. I never understood how this shop stayed in business with 7 Eleven right across the street. But now, I know......\n\nThe pastrami sandwich with the secret sauce is delicious. Anything hot out of the oven with melted cheese is gooood. Only thing I would whine about is that they should put more meat in it.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-24", "description": "I love the sandwiches here. What I like the most is the secret sauce on the sandwich. I've been getting sandwiches here for almost 8 years since I was a freshman in high school.\nSandwich: Awesome, especially if you add avocado. Kinda messy but worth it.\nPrice: Used to be $5, now $6 regular.\nService: About 5 mins. If you want to avoid lines don't get your sandwich from 3pm-4pm, teens will be taking up the line during those times. You can also call ahead & order. Pick up your sandwich in 10mins.\nDinning: No seats, take out.\n\nTry the sandwich at least once & let your taste buds tell you if you like it or not. =)", "author": "Marie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-21", "description": "I can never get sick of  Gene's sandwiches & their secret special sauce!! I've been having the same sandwich (pastrami sandwich) for about 4 years now and I'm still addicted. It's one of those hole in the wall places. You enter just expecting it's another liquor store, but can never leave without a smile on your face as you put your whole head in that paper bag with the smell of fresh pastrami dancing happily throughout your nostrils.\n \nI'd go here every Friday after school right before my dance class. I'd be too scared to eat it in front of everyone because they would want to \"get a   little bite\" of my sandwich..Little bite?? Really?? No one just nibs a LITTLE bite. Yes, its that good. My rule: No one can touch my sandwich, unless you're truly starving...maybe. \n\nMinus one star because sometimes they don't use gloves to make the sandwiches..then they touch money..?! That's a little iffy. The line can get really long once the nearby schools get out, but who can blame them..the perfectly toasted yet ooozy sandwiches here are amazing.", "author": "Alexa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-26", "description": "I work right across the street. This place is perfect for a sammy! Love the atomic with avocado. Cool people too. They know what I like. :)", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "Gene's sandwiches aren't as good as Sub Center's, but this place is a lot less stressful to be in and not to mention a lot cheaper.  And \"Gene\" is a pretty cool guy.  And you can get some booze while you're getting your sub!  \n\nWho could ask for more?", "author": "Keane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "I work right across the street. Love their sammys!  Really nice guys too. :)", "author": "Emily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-18", "description": "Being an old student from \"that\" high school not so far from this joint, Gene's was my regular sub place to go to. The school craved Gene's so I can only imagine how good it actually was as a freshman.\n\nHere I am, years later, an alumni, and I must say, Gene's hit the spot with the cheap yet filling toasted subs with the special sauce. Being a \"health freak\" I always went with turkey, but now, I am just cravin for some Pastrami since that's what everyone else seemed to get. Gene's had the right price with the right idea. The only thing I wish Gene's had was a variety of bread. I know, it ain't sub-quality bread if its not the bread that Gene's, but I like some variety, different strokes for different folks.\n\nAlso, I've seen the guy handling money and then fixing up the subs- not particularly healthy, but hey, I'm still alive since freshman year right? Thank god for Seniors in high school when you're a freshman... Theyre actually good for something.", "author": "Gabe R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-08", "description": "I like his sandwiches until one day, he started spiting in my sandwich. He was talking to himself and suddenly he said something and i saw a spit on my sandwich. he shouldn't be talking when he's making people's sandwich. that's the last time i ever bought from there again.\n\nHave you seen how his oven looks like? It's really dirty.", "author": "Robin T236532i9 W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-29", "description": "My friend lives a block away from this liquor store and one day he introduced me to Gene himself and his sandwiches. \n\nI never liked toasted sandwiches until I tried Gene's roast beef toasted with cheese and onions. He has all the veggies to add, but his italian dressing really makes it taste delicious. It's just a small corner store, but it is a really good quick toasty sandwich.", "author": "Heather T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "Love the sandwiches!  Hamik is a cool guy and usually has something really interesting to watch on the television (nevermind the language barrier).  Once in a great, great while he'll get in a fight with his wife, pound some vodka and hit up the Four Deuces (bar) just up the road- it's awesome!  He is a very cool character and worth chatting up.  \n\nAlso convenient about Gene's is the L-line stop- going to a Giants game?  Grab a few beers from Hamik and suck them down on the MUNI!  I may have strayed away from the task at hand- the sandwiches are delicious, Hamik has his own special sauce and it makes all the difference.  They were toasting sandwiches long before Quizno's and Subway.", "author": "Joel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "Gotta love a liquor store with hot sandwiches! And by hot sandwiches, I mean the best. The owner is a cool dude too. Aaaah, years of memories of waiting for the L Taraval right here :o)", "author": "Kelly s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-13", "description": "If you love the Sub Center in west portal you might as well come here too! Want a nicely toasted sub with a secret sauce? Come to Genes! Sandwich's here are just as good as the Sub Center and I think they're cheaper. I guess Sub Centers secret sauce is not so secret after all.\n\nI believe that the guy who works at Gene's used to work for Sub Center and just took his sauce with him. Don't know for sure but the sandwiches are pretty bomb. My favorites are the atomic sub or the hot pastrami. Classic subs you just can't go wrong with. PLUS you can wash it down with an ice cold YOOHOO! Not many places sell yoohoo's which is why Gene's is definitely the spot!", "author": "Kazuaki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "So an sandwich is just a sandwich--right?    No way.  This is the best tasting Sub in the city.  I get the veggie and it is spot on each time... and cheap.  \n\nThe usual d00ds who work the counter are grate guys, and they love what they do.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "wow. that was the best damn sandwich i have ever had from a liquor store. Plus the guy who owns it is super nice and awesome.", "author": "Vespa Fox C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "When my friend's took me here for the first time I thought, \"Thanks guys for taking me to the corner store for a sandwich.\"  But afterwards, I gave them a big thanks.  Good sandwich, the large is quite filling.  I got the gold standard of all sandwiches (in my opinion) turkey and swiss.  After sometime in the magic grilling oven and some secret sauce (a type of Italian dressing I think), a masterpiece is born.  Another plus, a large selection of chips, drinks, candy and other treats to choose from.  I also like that this place is kinda undercover, I mean if my boys didn't take me there, I probably would have never gone there, so thanks friends and thanks Gene for a bomb sandwich.", "author": "Shane Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-09", "description": "I love the sandwiches here and have been enjoying them for years. The sandwiches here are very similar to Submarine Center. It's also a hidden gem only a skip away from home. But recently, things have been getting a little skimp. They used to have a great meat to veggie ratio but now it's more of a salad sandwich. I'm going to take the drive and go to Sub Center from now on.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "I come here all the time for their sandwiches. The owner and employees are very nice. The outside of the store looks a bit shady, but the inside is anything but. They know a lot of their customers by name. Sometimes there is a short wait, because the cashier usually makes the sandwiches, but it's definitely worth the wait. The owner and employees are always courteous, so you can't help but like them.", "author": "Cal S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-30", "description": "This place is legit. Hamik is the man. He makes sandwiches with love and the others he are mentoring are getting there but will never reach his status. He is so awesome they should rename it Hamik's. Pastrami is the way to go. Prices are rising along with this recession. But come on now. Who can't help but love the bread, cheese, onion, tomato, meat, mayo, mustard, lettuce all toasted in less than 7 minutes. If you don't like something just ask.  I've been introduced to this place since 2004 and have been going on a monthly basis.\n\nAnd to add they sell IT'S ITS ICE CREAM. San Francisco's greatest invention ever. They sell chocolate, original, mint, and cappuccino I believe. A delicious mouth watering sandwich and an SF delicacy. Truly an experience. \n\nJust go on a weekend or during the day when the high schoolers are still inside and nowhere to be found because when they get out it's a rush for some Hamik's Sandwiches. At least when I was in high school, that was the place to go.", "author": "Philbert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "Pastrami Sandwich with Onions provolone cheese and special sauce, WOW! Every time it tastes better and better. Get a large one!! WOW! Best Sandwich i ever ate period.", "author": "Jake R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "This unassuming little liquor store puts together a pretty good sandwich.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "This place was my saving grace when I moved into the neighborhood!  One would think you can usually find a deli sando pretty much anywhere when you live in the city, but Parkside is a little limited.  The alternative is going to 7/11 - BLUGH!\n\nAnyway, Hamik is the man.  He is one of those guys where he acts all serious, grumpy, etc...but really is a funny dude.  I always ask to lightly toast my sando (they get pretty crispy otherwise) and after a while, he learns your preferences.  Hurry though......he about to raise his sando prices!!", "author": "Scott N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "Gene's offers a good liquor selection as well as a good sandwich.  Things to check out at Gene's: foreign news telecast and ancient beer props.  The trusty owner, Hamik, remembers what sandwich I get when I don't order by phone.  The sandwich sizes range from a 8 to 12 inches.  All sandwiches come on a hard roll with lettuce, onions, tomatoes, mustard and the always popular special sauce.  If you can't find parking at Sub Center or can't stand the line or the price, come to Gene's.\n\nRegular Atomic w/ chips and a soda - 8.75 no tax", "author": "Matt A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-21", "description": "Awesome toasted subs at a decent price.  Not overloaded with stuff.  Good ratio of bread, meat, veggies, and sauce.  One of the best basic sandwiches I've ever had.  Love it.\n\nThe owner might not be super talkative, but he's a nice dude.  Besides, I don't really care for small talk anyways.\n\nSadly the price has gone up since I first started coming here from $5 to $6 for a regular.", "author": "Derk C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-01", "description": "Amazing sandwiches and Hamik is great! I used to live a block away and frequent this spot but 3 years later Hamik still knows me by name!", "author": "Megan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-21", "description": "This is the only place i will ever get a sandwich at.. its close to my house and their sandwiches are really good! You get to put whatever you want on it.. oh what can be better than putting whatever you want on it! Its not too pricey either.. its really worth it! YUMMY! I wish they opened later.. =)", "author": "Heather C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-28", "description": "Really, good, GOOD, sandwiches.  I love how the bread gets toasted just enough for that satisfying crunch, and love/hate how the generous fillings get everywhere.  I admit I was a bit wary at first, since I didn't think a liquor store would have the best sort of freshly made food, but since it's right in front of where the L stops, I could always smell it!  It got to me.  And it's literally one block away from where I live.  Nice.", "author": "K P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-26", "description": "It's more than the secret sauce, people go here in respect to the owner that shows the utmost decorum towards everyone, for goodness sake he remembers what type of sandwich I want and I don't even go that often. Not to say he wouldn't beat your ass if you get out of line, but that's not the point. This is a well ran business; great sandwiches, service, and people.", "author": "Maurice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-24", "description": "Me gusta Genes.  My little sister told me about this place... all the kids are always going to genes for a sandwich after school.  Bomb ass sandwich.     Toasted.. and sauce, much like Sub Center, and a little closer to my house.  You would never know that this place has great sandwiches unless someone told you bc its a liquor store... but yeah, try it out, you wont be dissapointed!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "Its a lot like the submarine center but a little more mayo, a little less meat, and little more secret sauce aka Italian dressing. sometimes they burn the bread a bit, its funny, they never have with my subs, but everytime I bring my roomate there they burn his, cracks me up. I go here a lot and I will until I move outta the neighborhood", "author": "johnny s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "I used to always buy sandwichs from the Submarine Center on West Portal.  One day my friend introduced me to Gene's Deli, and I was hooked.  They taste just as good, if not better, as the Submarine Center.  Sandwiches are always hot, fresh, and made to order.  Hot pastrami with everything is my favorite.  They can get kinda messy when eating, so get some napkins.  Pricing is decent, $5 for a regular, and $6.50 for a large.  I remember the days when a regular was $4.50 and a large was $6.  But either way, the sandwiches are still worth it.  It's been years since I've gone back to the Submarine Center...  Gene's has better parking, better prices, and less wait time..", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-05", "description": "I always get the same sandwich wherever I go.  Toasted turkey with swiss, avocado, jalapenos, and the works.  Gene's makes a great sandwich, although I had to knock off a star due to the thick slab of mayo they slop on the bread.  Sometimes the line is long, but it's worth it.  One of the better sandwich places in the Sunset.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-24", "description": "I am on board with the Atomic Sub as well.  I agree with others that the similarities between the Sub Center at West Portal and Gene's is amazing.  If the stories are true about the relative connection, then it all makes sense.  Not the fastest sandwich but a real gem in the neighborhood.  Pick up the chips and a drink, which are a little cheaper than a typical deli but match up to small liquor store prices.", "author": "Glenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "If you're looking for a decent toasted sandwich for $5-8, Gene's is a spot worth checking out.  I usually have the hot pastrami with everything on it and it hits the spot every time.  It's a nice small spot to pick up sandwiches in the area.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-25", "description": "Best value for a big sandwich in SF. Try the pastrami with cheddar and everything on it. Gene's is the best! Definitly more bang for your buck than submarine center.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-13", "description": "I love coming here for sandwiches! not only is it one of the best places to grab a sandwich in the outer sunset, but it's affordable as well, meaning cheap! compared to other sandwich places.", "author": "Pudgy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-25", "description": "Pretty good selection of booze + super good subs = A fabulous place.  Also the guy there is super nice and it's got a cozy little feeling :)", "author": "Tara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-03", "description": "Best sandwiches in the sunset. The guy that makes them ( I forget his name - it's not Gene) is super nice and always remembers me and what I order even if it's been 6 months since Ive been in.", "author": "Risa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-13", "description": "Took several Yelp recommendations to step in here and get a sandwich. I happened to be at the post office down on Taraval so I walked over to get a pastrami sandwich. Literally just finished eating it, and I want another one it was quite tasty. Their \"secret sauce\" was good. you could almost skip mayo/mustard but I had all the fixings this first time.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "When I drove up I couldn't believe that this was the place that got all these great reviews. When I walked in and saw the sad little \"deli\" right next to the cash register I almost walked out. But I said to myself, \"No! Do not run away like a Frenchman!\" So I didn't. I, as you all suggested, ordered the Atomic Sub. A large one. I must say it was much better than I would have guessed. Pretty large, generous toppings, plenty of meat, nicely toasted. But nothing to make a special trip for. If I were on that corner at lunch time I would get another one but I will never make a special trip to go back there. It is an okay sandwich for a little bit too much money (a large Atomic costs $8.85). If you are on Taraval or in the vicinity I would highly recommend heading up to Guerra Meat Market and getting a much higher quality sandwich for less money. But I'm still glad I know about Gene's so thanks everybody!", "author": "Alan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-01", "description": "The sandwiches are pretty damn good. But the bitter, rude man that makes them takes away from the flavor. Overpriced.", "author": "Meg I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "I love Gene, he is the man. He has created a wonderful store for me to purchase beer and chips while my delicious sandwich is being made. I am a fan of the staff and the variety of odds and ends that the store carries. There have been multiple times that I have relied on Gene's for my beach picnic/roof top beers. Thank you Gene for your reliable prices and service.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-20", "description": "I love Genes. When I don't want the tasty Chinese food around the area, I get a tasty sandwich from Genes. I always get the veggie one because it's a veggie lover's dream. There's some other things to buy and he has a wide collection of beverages. One liter Coca Cola from Mexico and a large veggie sandwich makes me happier any day.", "author": "Myfood Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "I'll tell you this, I lived at 32 and Santiago for a year and I only dropped by this place for a sandwich when I was filling my moving truck up. That said, really overrated. The sandwiches are fairly large, I'll give you that, but not particularly good. Also, it's not fresh either, so it's nothing to rave out.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-23", "description": "This place makes Subcenter sandwiches and they sell liquor.  A one stop shop.  The owner has family ties with subcenter, so they are very similar.  I usually get a hot pastrami with provalone and jalepenos, water, a pack of reds, and a vega.  Hamik you get five stars.", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-15", "description": "I love this place! The sandwiches are really good! The owner is really nice, remembers his customers, and best of all is not cheap! The place is older, and the guys name isnt Gene, but its because the place has been in the neighborhood for sooo many years...I mean...cmon! But it is sanitary and he always wears gloves (in response to the review below). Basically...every sandwich Ive ever gotten there has been really good! But try it yourself...at least once.", "author": "Gayane B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-10", "description": "I used to come here all the time.  The subs are great, I usually get the turkey or pastrami, large.  However, minus 2 stars for Gene always forgetting to put the gloves on before he makes my sandwich.  One of my pet peeves is someone who handles money and then goes and makes your sandwich right afterwards.  Its just nasty and extremely unsanitary.", "author": "Bart W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-12", "description": "Yum Yum in my tum tum! I walked pass this place after getting my hair did across the street, and noticed the BEST SANDWICH IN TOWN sign outside. I walked in and said, \"Best sandwich in town huh?\" (not usually like me, but I was in the mood to say so), noticing the friendly looking man behind the counter. We chatted quit a bit, and he had told me his fave was the pastrami sandwich, and that was what I went for. I wish I was able to eat it hot, but I only had it warm about 30 minutes later. Sadly, I was only able to finish half since I was on the go as well. It was unfortunately because it was effin delicious! I don't know about being the best sandwich in town, but its up there with some of the best I'm sure. At this moment, I can truly say that I crave no other besides from this and a philly cheese steak (from god knows where). A pretty large delicious sandwich for $5.50 seems to be a better choice compared to my once-beloved Subway.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "Just had an atomic sub, best sandwich I could have asked for. Plus, since I'm not too fond of corned beef I asked for roast beef and he was more than happy substitute. I will definitely be coming back. Often.", "author": "Phaedren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-31", "description": "I've had the pastrami on multiple occasions, but for some strange reason, a new meat caught my fancy. The tuna salad on dutch crunch is officially the best sandwich I have ever eaten. Ive had almost all the sub center sandwiches, roxie sandwiches, guerro sandwiches, Luccas, Giardino Bros, and Ikes place sandwiches and this is by a narrow margin the best sandwich ive ever had. It might have just been the time of day, or my own level of hunger, but it is what it is. I admit Ikes Place is magical and classified as art in its own right, but if you're looking for a legit sandwich and not a Picasso then Genes is the place for you.", "author": "Jason A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "I love this place. Def go for the atomic sub with everything on it, and the best part, over toasted!", "author": "Kyle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "Hamik makes awesome toasty subs. He remembers how you like it if you're a regular. Do not push him though...I've seen him yell at customers for asking too many questions about the sandwiches. He gets a little frustrated from time to time. He's a neighborhood character. The rest of the shop is kinda sad and dingy and I hate to admit I usually go to 7-11 across the street for sodas and such.", "author": "L J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-17", "description": "honestly, hamik deserves the key to the sunset. or the city.\nif you are a picky sandwich person who can't handle mustard or crusts, just open your mind and let them make you one they way they do best.\nbecause it's the best.", "author": "Leo V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-10", "description": "So yeah he has tasty subs but their a total knock off from Sub's! Plus everything just sits out there it doesn't look that sanitary! I don't think he even uses gloves sometimes or washes his hands after he touches the money. YUCK. His store is pretty run down, but he's nice. Skip this place and go somewhere else like a 5 minute drive to subs its worth it!", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-31", "description": "hellz yea! this place gets five stars!! i always get the roast beef with everything on it! its the shieznizzal!!! i always used to pass by it but just never went in, but damn what they say is true! never judge a book by its cover.. hehe. yea... this place gets my vote anyday! its super delicious, and affordable too! mang, my mouth is watering just thinking about it! thats it, im going to the place right now to get me one! you should toO!!! hurry, before i get there first! hehe..", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "very good sandwich. I always get regular atomic with peppers. It takes a while, especially if you order at lunch or dinner time. The regular size is huge, and the large is enough for two meals. I think they put too much sauce in the sandwich though and the sauce is too thick for my taste. I prefer roxies sandwiches but come here most of the time because my brother is addicted to Gene's pastrami sandwich.", "author": "Ale x."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-04", "description": "Gene's is the shiz... haha warm toasted sandwiches made right in front of you. delicious, absolutely delicious, prices are pretty decent too. Lunch time it gets busy so call in!", "author": "Preston L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-25", "description": "genes is my favorite sandwich place. way better than subway and quiznos, etc... i usually order the atomic sub which i think is the best one. the man is very consistent with his sandwich making and always toasts the bread perfectly. lots of meat and tons of mayo, mustard. and the \"secret sauce\" is prolly italian dressing. pretty big sandwich also and the place is always busy with people ordering sandwiches. genes is known for the sandwiches now.", "author": "Cory Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-17", "description": "Best Sandwhiches in the city... and anywhere else for that matter.  Turkey and avacado is awesome.", "author": "Nicholas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "Don't have to go to Subs at West Portal anymore, I just go to Gene's to get my Turkey sandwich fix. YUMMY.", "author": "L B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-01", "description": "not really rating the store itself....only its sandwiches.\n\ni love genes sandwiches.  ive been going there for years and when i'm hungry and in the area and have 6 bucks on me, im always down to get genes.  ive tried only the turkey and the vegetarian and they were both hella good.  the sandwiches are big enough to get you satisfied, and they are cheap too!  (5.50 for a regular, 7.50 i think for a large)  the guy (his name is NOT gene btw) is cool.  they only have one type of bread unlike other delis but its all good because sometimes having too many choices is bad in my opinion.  and they toast their sandwiches too.  YUM!\n\noh and make sure to get there before 2pm or be prepared to wait in a line of high school students.", "author": "Shelly C."}
