{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "In need of a quick healthy fix? Well, Glaze Teriyaki always seems to be there for me when I'm in need. The place is always clean, tidy and you're greeted with a friendly smile. As far as fast casual concepts go, they were an early adopter and I love it. \n\nMy go to order is the combo #2 with salmon, brown rice and the carrot ginger dressing for the salad. It also comes with a side cucumber salad that's dressed in something heavenly. Also, I bet you didn't know that Glaze makes their teriyaki from scratch...that's why it's so damn delicious. \n\nCheck out either of their two locations because they are consistently delicious across the board. Oh, it also travels well if you're ordering through a delivery service.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "First time here and I ordered the salmon salad with sesame dressing and shishito peppers. I spent about $23 for 2 items.\n\nThe ingredients are really fresh and the portions are enough to fill you up. The sesame dressing is tasty and it goes very well with the salmon salad. Shishito peppers are okay, nothing extraordinary. \n\nI would probably come back here but it is pretty pricey for the value of the food. \n\nOverall, I liked the salmon salad a lot and probably thinking of trying a different type of meat next time!", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "I'm done with overpaying for cheap food.\n\nThis isn't a review based on the quality of the food. \n It is very healthy, and consistently delicious. \n\nThis one star review is for the cost of a lil' chicken, a heap of rice, some salad, and some teriyaki glaze.\n\nThe cost of one meal here, plus tip, to go is ~$15. \n\nAt the supermarket, \nI can buy a few pounds of chicken for $8,\na 5lb bag of rice for $3,\nand a box of salad for $4,\nThat's a total cost of $15.\n\nWith those ingredients, I can make 6 large, delicious chicken dinners.\nI will still have a lot of rice left, and a decent amount of salad as well. \nInitial total cost / meal: $2.66\nThat cost will decrease until you have to buy more rice, and salad.\n\nThe sauce is super easy too. \nIt's just. not. worth. it.", "author": "Jackson S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "Happy with the service, the food, and the ambiance. The restaurant was convenient, and looked good so we decided to give it a shot. For the price I was content, and would stop by again if I was walking down Chestnut St. This would probably be a great thing to get takeout, for home or the park. With all that being said, I don't think I would go out of my way to come back.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "This place seemed pretty solid to me for SF. Maybe I'm just used to expensive salad spots in FiDi (ahem, Mixt), so anything under $15 with meat seems alright.\n\nI tried out the combo with steak and teriyaki. I requested both medium rare-- the steak was definitely on the medium side of things (no pink anywhere) but still chewy and not overcooked. I would've preferred it to be strips instead of little bits and pieces, but whatever works for them. Not terribly strong beef flavor, but it's teriyaki, and their's was good. The salmon was decently flaky and moist too. 3.75/5.\n\nThe tofu and chicken combo I tried were a bit on the dry side. Verdict: stick with the salmon and beef! 3/5.\n\nThe salad leaves really stood out as being fresh (not wilted in the least), and that carrot ginger dressing felt pretty solid and gourmet.\n\nThe brown rice was again, cooked well and nutty (it's a trend with my last couple of eats). I've been eating a lotta rice lately....", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "tight space but so good! I spent about $35 for two meals, a coke and a beer. \n\nReally fast service even when it was busy and crowded.", "author": "Ellie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "I came here for a late lunch with my partner on a weekday. It was around 2:30pm and the place was packed with teeny boppers who I assume use this place as an after school hangout or a pit stop to grab food. Luckily we were able to snag a table though it was near the door and had to close the door after each person left (otherwise we would be overwhelmed by the cold air).\n\nWe were a little disappointed that their levelup payment scanner didn't work since we were each given $10 for our bday from the place via the app, but the cashier was very friendly and accommodating.\n\nI'm glutenfree and could not be happier they have a gf menu. I got the chicken bowl with the gf teriyaki sauce and it was really good. Even the simple mix salad, had a delicious lemon dressing which I loved!!\n\nThe place is a little expensive for me, but I really liked the food.", "author": "Gita r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Delicious, casual and healthy.\nAccepts CC and offers takeaway orders.\n\nI ordered a salmon bowl with no rice, extra salad and the lemon ginger salad dressing. The order total was around $15, but I think that's how much a meal will run you in the area. \n\nI devoured my bowl because it was so delicious! The grilled salmon was pretty large and smothered in a teriyaki glaze sauce. It can be overpowering but when eating with salad (or rice) the flavor is balanced out.  The salad dressing light and very tasty!\n\nI was able to eat the whole thing but if you aren't that hungry or if you order rice with salad or double rice, you may have leftovers.\n\nI did feel that the dish was a bit salty, though, because I started to food coma a bit after lunch. However, I was still able to get through the second half of my work day.", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "The silverware is not clean, the quality of food is like at an airport, not sfo! Salmon on white rice with some greens on the side that just came from a bag, and gross dressing. For $15 I expect much better.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "I used to pick up my lunch/dinners at Glaze in NYC, and was happy to find out they have locations in SF as well.\n\nI usually get the beef or chicken teriyaki for delivery on Caviar. I've never eaten at the restaurant, so I can't comment on that.\n\nHowever, for the price it's a decent meal. The quantity of beef is not huge but it's healthy, with brown rice and a salad. The sauce is sweet, and I'm not sure how sugary it is so it would be nice if we could customize the amount of sauce. With that said, I only order delivery when I'm having my dinner expensed for work.\n\nWith delivery costs, it can cost about $25 for one meal, which I think is way too steep for this.\n\nAll in all, their meals taste great and are healthy, but can be expensive if you have to order delivery.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Went here for about a year straight off and on for lunch and dinner bc they are so affordable and sooooooo savory! Great location on chestnut st and they have outdoor seating. They prepare everything fresh for you and they have great menu options. I normally get this chicken option with the rice and salad but they have fish options as well.", "author": "Angel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "I always like to come here when I want something g good and feeling and when I'm in hurry.", "author": "Nico R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Glaze is an aesthetically pleasing spot, but I have definitely had a better teriyaki bowl for a lot cheaper. It's a simplistic meal, but personally, it lacks the flavor that I would expect. I end up loading  sriracha onto the top. Still, a good quick lunch for every once in a while!", "author": "Sydney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "If you live in Marin and are leaving SF to head back over the bridge- you probably have a few thoughts of, \"I should grab some good yummy city food before I head home!\"\nWell if this is you, you should add Glaze Teriyaki on Chestnut to your list of places on auto dial/favorites. (Another spot for me is Tacos by Broadway tunnel on Polk)\nAnyways, you can call in you order of brown or white rice, teriyaki chicken breast or thigh or salmon and comes with a salad/ I always choose the sesame and you will have a satisfying savory meal once you ace the commute back over the bridge.  There are options to add extra protein or potstickers or shishito peppers. Their glaze is very sweet, I'd maybe ask for it on the side or \"light sauce.\" It tends to be a bit heavy sauced.\nThere's pick up parking spots and double parking on the corner where they are located. I only wish they could pop out and deliver to your car!\nGive it a try- I bet it'll be a family regular. Or order a bunch of bowls for friends coming over. So convenient, satisfying and fresh!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "This is a good spot for clean eating. The food is fresh, tasty, and healthy. The place is clean and the staff is friendly.", "author": "Sandy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "Attended this restaurant on a Thursday night around 6:45pm. We ordered food to eat in the restaurant. After 30 minutes of waiting and watching many orders completed that arrived after us I asked about our order. All that I was told was it was \"coming.\" I decided to ask for a refund and left after 45 minutes without my food. When i asked for a refund the cashier looked lost and didn't even apologize. I will not be returning.", "author": "Chelsea A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "Good teriyaki is always a treat and Glaze is pretty solid overall. Salmon teriyaki is amazing here, fresh and cooked perfectly. The chicken is alright too. I suggest the white rice and sesame dressing for your salad. \n\nService was insanely quick and efficient. \nOnly downside for me is that it's rather expensive for the portion. I never feel full from one order. Nonetheless, this is the go to spot in the area if you want teriyaki!\n\nFood: 4.5/5\nValue: 3.5/5\nService: 4/5\nOverall: 4.25/5", "author": "Brian G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-22", "description": "I like the concept of a simple meal, and I got the chicken over salad. I'd recommend the rice just to be a little more filling and also to absorb more of the sauce, but even with that theoretical change, I found my meal overall to be aggressively salty and a bit airplane-like. In my takeout box, the sauce was hastily dumped on top of the chicken immediately after charring.", "author": "Heidi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "LEGIT. The staff were so nice and fast, the food was dope, and I've literally found my new favorite joint in the Marina. I work at a bank nearby and Michael came in, he recommended this place so I decided to check it out. Definitely making this a once a weeker", "author": "Michael J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "We stumbled upon Glaze while shopping & enjoying an afternoon down Chestnut. \n\nI ordered the salmon, sesame sauce & brown rice. My boyfriend ordered the steak with brown rice & sesame sauce. Our order was out within 8 minutes. The food was great, had just enough sauce & also came with a side salad. \n\nI recommend this place for a meal under $15. My plate was $13 & the steak was $12. \n\nWorth a quick drop in for a light lunch or dinner.", "author": "Courtney L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Checked this place out for a Yelp event and what a delicious meal! One of the owners Jesse was super friendly, passionate, and full of awesome stories. My only critic about the interior is that the menu is too high and tucked away from the entry. \n\nI had the opportunity to sample quite a bit of the items on their menu and I'm happy to say that they were all very delicious! Teriyaki bowls can seem cheap and whatever at many restaurants but you can really tell that the ingredients here are fresh and sauces are tested to perfection. My favorite was their habanero sauce! If you like a little heat in your food definitely give it a try. The grilled shishito peppers were spectacular I can eat them every single day!  \n\nOverall this is a great place for a healthier grab n go meal that's still at an affordable price. However, because it's such a quick grab n go meal I find it hard for me to go out of my way and come back unless I'm already in the area. I'd love to revisit some day but the SF locations are both a bit out of the way for me. But if you work/live in the area make sure you stop by and give it a try!", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "We popped in here for a late afternoon lunch. I was in the mood for some chicken and rice and this place fit the bill. \n\nI had the chicken terreyaki with brown rice and salad. You order up front and take a seat. About 5 minutes after sitting down, our order arrived. My meal was as expected. Chicken was tender and the rice was rice. Overall, this no thrills establishment is a means to an end. Fill that belly up at a decent price! \n\nSidenote, I think my photo should be used for this restaurant's ad campaign. Seriously.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Came here yesterday w a friend. I got the chicken thigh and my friend got the tofu. The food was good and the portions were big. The workers were friendly and greeted us when we walked in. The only concerns I have is that the food is kind of pricy and the tables&chairs in the outside sitting area are hella rusty.", "author": "Isabella H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-20", "description": "The cashier and other workers had no personality. I told him it's our first time dining here and he didn't say anything. I asked what he recommended and response is that everything on the menu is good. Sure! Food was mediocre. It was pricey. I ordered the salmon salad and got 2 small pieces of salmon on a bed of spring mix for $13.50. My kids ordered chicken teriyaki with rice and spring mix salad, it didn't taste anything spectacular and it was $12.50 a plate. I was also charged $1.52 Employer Mandate, what the heck is that? I've never heard that before. $49.81 for three less than average meals??? Will never go back there for sure.", "author": "Maria W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "OBSESSED with glaze! Good thing I don't live super close or we'd go multiple times a week! I love the fresh ingredients and overall aesthetic of the inside. The bowls we ordered were a kids chicken breast and white rice bowl, a regular chicken breast and brown rice bowl with honey dressing, and a marinated tofu bowl with brown rice and carrot ginger dressing on the salad. I've still yet to try the sesame dressing of all of the times I've eaten at Glaze, but would definitely recommend the honey dressing. Glaze's portions are perfect and healthy, and everything tastes amazing!", "author": "Josie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "Don't eat here! Not sanitary food prep practices. Ate the salmon and got food poisoning. Sick in bed for days and had to get antibiotics", "author": "Julie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-10", "description": "Kind of disappointed with the food at Glaze on Chestnut. I have been to the one on Fillmore many times and figured this one would be just as good. They forgot part of my order and the soba noodle salad was really oily and not at all like the one I usually receive. I tried to call them to maybe figure something out but they didn't answer.", "author": "Simrat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Quick, healthy, & consistently delicious. It's open later than most other fast-casual restaurants on Chestnut. \nIt's a pretty simple ordering process: choose your meat (or veggies), rice, and salad dressing. I love the teriyaki chicken + brown rice combo.\nMy favorite go-to meal when I'm too lazy to make dinner!", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "What it is...\nIt's hot.\nIt's tasty.\nIt's fast.\n\nWhat it isn't...\nIt's not greasy.\nIt's not made up of mystery ingredients.\nIt's not fast food.\n\nI wanted something quick & easy, but different.  And not totally unhealthy.  Enter Glaze.\n\nHonestly, I love them for their gyoza alone.  In my case, they were pork, & they were fantastic.  Filling full of flavor & perfectly cooked.  The shell was thin, nicely crispy, & encased the pork without starching it out (that's the big problem I have w potstickers, & why I prefer gyoza over them).  Also, these were not over fried.  A straight up win.\n\nThe grilled salmon salad was fresh, w a generous amount of salmon, but wasn't particularly noteworthy.  The sesame dressing was the real star here.  I would order this again because it's healthy & filling, but the gyoza put this dish to shame.\n\nFriendly & pretty fast.  My order was ready in about 10 minutes, during prime dinner time.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-18", "description": "It delivers, but nothing exciting or fancy. My Teriyaki bowl definitely benefitted from some Sriracha (I hear you saying, what doesn't?). Good teriyaki sauce and filling portions. The tofu is grilled on the outside and soft on the inside. The shishito peppers were my favorite and had a nice kick. I wish there were reusable silverware, as even compostable silverware for eating-in feels wasteful. \n\nSpace is a little tight, so groups can be tough - even as a party of 3 we had to do some rearranging. But great people watching from the large open windows and corner location.\n\nAs an homage to All Star, they have donuts!", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "As a native Seattlite, where teriyaki joints are as ubiquitous as Starbucks, I am a HUGE fan of Glaze Teriyaki!  I was so happy to see some down home teriyaki in the bay area.  \n\nThe salmon/chicken combo with brown rice is my favorite.  It is moist and tasty and the teriyaki sauce has fantastic flavor.  \n\nLest we forget the amazing sides available here...among my favorites are shishito peppers, gyoza, and the chicken wings.  The peppers especially are to die for!  \n\nI also recently tried the Asian Box that opened down the street and was NOT impressed.  Glaze is locally owned and I see the owners in the store all the time.  I head to Glaze whenever I'm craving teriyaki and I'm never disappointed!", "author": "Darci F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "I love this place!! Is delicious and healthy and they cook at the moment and serve really fast.. small menu but lots of options. \nCome and try it!! 100% recomendable", "author": "Veroniko L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "What a lame place.  Avoid!  Here is why:\n\n- Quality of food is questionable.  The chicken is antibiotic fee and \"all natural\".  Antibiotics for growth promotion or any regular use (excepting sick animals) have been banned in CA anyhow since 2015.  And what does all natural mean?  They don't claim to be organic, cage free or any other specific metric. \n\n- The food is overpriced.  It comes out to about $15 for a scoop of brown rice (actual cost 50 cents) a scoop of mixed greens (bag available at Trader Joe's for $1.99) and a scoop of questionable chicken.  Teriyaki sauce btw is actually is just soy sauce and sugar or possibly corn syrup.    So they are actually selling about $2 of food for $15.  \n\n-  it's actually not that healthy.  The brown rice and chicken might possibly be, but the sugary teriyaki sauce ruins any potential to call this a healthy meal. \n\n-It takes waaay to long to scoop the three items described above onto a plate and add sauce.  About 20 minutes too long.  If you want to see he same dish made more efficiently, volunteer at a soup kitchen.\n\nIf you want a simple and plain meal of rice, chicken and some leafy greens, that is just fine, but you would be wise to look elsewhere.", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "I love the food at this little spot on Chestnut!\nBesides the perfect location, and the delicious food, the employees are very friendly and welcoming. The service is quick and the food is freshly made right in front of you while you wait.\nGood prices and healthy, light but filling food :)", "author": "Liza P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "People are really nice and kind, food is good. İ found my salmon little dry last time but in general its a good place to stop by and eat casually in chesnut.", "author": "Guler Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "I had been wanting to try this place for lunch after seeing so many of my friends check in on Yelp. \n\nThe menu looked great and I loved style they went with for the interior. It's no donut shop but I'll take it! \n\nOrdered chicken thighs, brown rice, salad and a glass of rosé. $24 later I was still a little hungry but loved all the dishes. The brown rice was cooked perfectly and I'm a fan of any chicken thigh that's cooked correctly. Overall the amount of food felt a little light for the price point. A side might be a good idea if you're extra hungry. \n\nThe dinning space was tight, even on a weekday at 2pm. Takeout could be a good idea next time. Chestnut street has every kind of food you can imagine so it's nice to see something a little on the original side.", "author": "Alison C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "This place has some great teriyaki boxes!\n\nI found this place while on assignment in the Marina. It's a great place to dine in or eat out. They serve a variety of teriyaki dishes but because I'm a white meat fan, I tend to favor chicken. \nThe teriyaki chicken I ordered came with a choice of brown or white rice and a side salad with sesame dressing. The chicken was cooked good, the teriyaki sauces was sweet and full of flavor. Both the the rice and the side salad where okay but the stand out was the sesame dressing. The box is definitely a filling lunch so I highly recommend it for anyone in the area.\nThe first time I ordered, I came to the restaurant and placed the order in person. The order, from start to finish, took about 30 mins. WAY TOO LONG! I've discovered that you can order ahead, and even pay, through Yelp! Please, do yourself a favor and order ahead if you are going to this location or at the very least come with some time. \n\nChicken Bowl with brown rice and a side salad ($12.50)\n\nPros: Good food, nice neighborhood area, online order\nCons: Wait time, small venue, limited drink selection", "author": "Miguel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Hit the spot!  Delicious and fresh teriyaki chicken with brown rice and a side salad. It was made fresh to order, came quickly and was a great atmosphere", "author": "Run.It.Off V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "Gluten Free menu, they have GF Teriyaki Sauce. Had the grilled chicken with brown rice, very good. Service was speedy and the food was very tasty. Arrived early for dinner on a Thursday night, easy to find a table. The way it works is you order, find a table and they bring you food to you when it is ready. Excellent, quick, and reasonable Chestnut Ave place.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Glaze! One of my favorite spots in the city!\n\nThis is one of those spots where you get upset when your eating partner orders the same thing as you.  I have my go to order (chicken thigh teriyaki, spicy sauce, brown rice) but everything I have tried has been excellent.  The gyoza dumplings are crispy on the outside with a really flavorful interior and the tangy dipping sauce is a perfect compliment. Even the salads stand out in an area with many options due to the hefty portions of protein served with the bright dressings like carrot-ginger and sesame.\n\nAny of these things for around $13 plus another $5 for dumplings (or chicken wings...OR Pork Ribs!) to share with a friend makes Glaze one of the best deals in the city and remains a regular in my restaurant rotation.\n\nIf that wasn't good enough, the staff is really friendly, attentive, and always responsive to my order requests. To-go orders are packed up well and always get back to the home or office hot and ready to eat. And best of all it is healthy and I always feel energized after eating Glaze which is why regulars like me keep coming back. Give Glaze a try, you will not be disappointed. \n\nGlaze! Glaze! Glaze!", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Service is efficient and employees are friendly. The food is good too! They have the yummiest rose lemonade and simple cucumber salad. I LOVE both the salmon and steak. I haven't ventured outside of either because I love them so much, but I'm sure the other options are great too. If you're looking for a quick and healthier lunch or dinner option this is your place!", "author": "Racquel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-23", "description": "14 min wait for a side dish. And the food tastes just fine. Way to go Glaze Teriyaki!", "author": "Zoe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-13", "description": "I wanted to like this place but for 13.50 for a chk and steak combo I was expecting a blow me away type lunch.   Basically just seasoned meat glossed with ok Teri sauce.  There was no seasoning segue from the meat to sauce.  It was just one note.  The Teri sauce is ok at best.  Hate to say it but Trader Joe Teri chicken is on the same level.  The greens with sesame dressing is nice, the place s hip, the people are nice but for price, gotta come more correct or add more value.   5 gyoza for $5 - a dollar per!   Was ok but was more like a fried won ton with pork filling.   Either up with more meat or lower the rate.  Spot is cool tho - right in the heart of Chestnut.", "author": "Isaac L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "After living in Seattle for college, I became a huge fan of teriyaki. If you're from Seattle, have ever lived in Seattle or visited even once before, you likely know what I'm talking about. When I was living in Pac Heights, I literally counted down the days until Glaze opened after seeing the signs go up. Ever since opening day, I've been a huge Glaze fan. After visiting so much it was almost getting weird, I finally asked about the background of the brand and was thrilled to hear that one of Glaze's founders (maybe both?) are from Seattle. Hearing this was so satisfying - almost as satisfying as their salmon teriyaki (personal fave). \n\nI moved away from Pac Heights and was devastated when I was out of their delivery zone. Somehow they must have known how terrible this was because they then opened up the Chestnut location and made my dreams come true. The food here is absolutely fantastic - I can't recommend it enough. The salmon is always fresh, the sauces are well balanced (not too salty, not too sweet) and everyone they hire couldn't be nicer, more helpful or patient (coming from someone who could stare all day at the menu and be so indecisive because everything is fantastic).", "author": "Rosie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "Great option for a healthy, quick bite. My go to is the double protein (pork loin, hanger steak, chicken thigh or breast) with no rice double salad and the teriyaki glaze on the side. Only gripe-- I've order the same thing my last three visits and I have been charged three different amounts. My educated guess is that the cashier is not quite sure what to charge or not for \"no rice, extra salad\".", "author": "Alex B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "Food was good, but pretty pricey. I ordered delivery with Eat24 (which took forever FYI, and was cold when I got it), and got 2 orders of the chicken wings, cucumbers and cold soba noodles. The chicken was awesome and had a great spicy sweet flavor. The cucumbers were a little disappointing - it's easy to sesame cucumbers and yet they were pretty bland regular cucumbers. Would order the wings again, but not through delivery.", "author": "kittCAT L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "This place is great!\nThe meat quality is superb!\nI got me the hangar steak teriyaki with honey lemon salad dressing on brown rice.\nBoyfriend got half/half hangar steak and chicken teriyaki with carrot ginger dressing salad on brown rice, as well.\nGreat customer service and reasonable price!\nDidn't try their wings, but quite extensive menu.\nOh, they have outdoor seating too!\nAtmosphere is somewhat hip and has cute décor.", "author": "Laramae E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "3.5 Stars.\n\nI was lured into Glaze Teriyaki because of their recent viral hashtags on Instagram.\n\nI guess because of the beautiful photos, I had developed pretty high expectations for the food, too. And Maybe it's because I'm Asian and love my teriyaki, but the beef teriyaki was just okay. Not very tender and really small portion of beef, about the size of my palm.\n\nAlso had the chicken wings- $5 for 5 wings- just okay. A bit tart but pretty nice and crispy.\n\nThe salad/brown rice made for a good combo. This is great for a casual lunch or dinner around the Marina!\n\nThere a few 2-person tables and a number of seating if you choose to eat inside!", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "I came here for a to-go order, and was not disappointed. Place is small, but clean, and with menus thankfully close to the register (because my eyesight is horrible.) Staff was patient as I figured out what I wanted.\n\nI ordered the salmon teriyaki with brown rice. It was very good, and also comes with a salad. I also chose the chicken teriyaki for a friend, and was asked if I wanted the breast or thigh (which was different to me.) I noticed more menu items, so next time I'm in the area I might try something different.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "We stayed in the neighborhood and stumbled upon this yummy little restaurant one night for dinner. The staff was super friendly and the food was delicious! I had the chicken teriyaki with honey lemon dressing. My Mom had the salmon and said it was fabulous. We'll definitely be back!", "author": "Rori B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "Felt disappointed by Yelp reviewers. The first time I saw a 4 star rating and it didn't deliver. The wings were over sauced. The sauce was way too salty and vinegary. The chicken teriyaki was just okay. The freshly grilled chicken was a good, but the sauce was too salty and very thick.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-07", "description": "Bad for vegetarians. \nPerfect for the food court in the Galleria Mall in Canton, Ohio. \nIt would be an oasis there, you would cry with gratitude if you stumbled upon it after some enforced incarceration in the food wasteland that is Ohio (or Maryland, or Idaho, or...) \nHere in San Francisco, you just go 'how, why?'\n\nThe \"Wok Vegetables\" is mostly carrots (see photo) in a watery, odd-tasting 'sauce'.\n\nBottled teriyaki from Safeway tastes better.\n\nMaybe the meat is 'glazed' with sauce, but the vegetables (aka 'carrots') are not. \nThey're just sitting in a watery soup that doesn't taste good. \n\nThe 'salad' was a handful from a bag of spring mix like you can get at Walmart. If only they'd grabbed a bottle of teriyaki sauce while they were at it.\n\nOrder at the counter from indifferent employees and be blasted with muzak. \n\nWhen a woman comes from behind the counter with a bottle of Lysol and starts spraying the tables around you, you know you're in a quality establishment.\n\nCarrots and Lysol.  Check please.\n\nRIP All-Star Donuts. \nI miss fresh doughnuts and Constant Comment tea at 3 am.\n\nIf the people of San Francisco are smart, Glaze will be gone soon.", "author": "Lame Lake Meese Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "The siracha on each outdoor table will catch your eye. Then you'll notice the array of succulents lining the inside. What should really excite you about this place is the simple and delicious menu choices. \n\nI ordered the chicken breast teriyaki combo with brown rice with the sesame dressing for the salad and a side of sautéed veggies. The sesame dressing had a nutty taste that left me wanting more. The sautéed veggies were sub par but the meal in itself was so satisfying! I will definitely be back to try the hangar steak and salmon teriyaki. This place is sure to be a Chestnut favorite as word catches on.", "author": "Cassandra L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "Had the veggie/tofu combo bowl. Good quality food. Could use more tofu instead of two small pieces (3 or 4 would suffice). Very little tofu compared to the meat dishes.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-20", "description": "Boring and soul-crushing as hell- if you want the most boring, bland meal ever, visit Glaze.  The only \"variety\" here is the service: sometimes pissy, other times friendly. Who wants plain over-cooked brown rice with dry meat drowned in sickeningly sweet sauce (what is supposed to be teriyaki) served in a flimsy soggy brown box. This is definitely not a great addition to the neighborhood in any way.  I guess some people feel that this is a \"healthy\" option but is it really good for you to eat something mind-numbingly mediocre and tasteless (without tons of sriracha added for \"flavor\")?", "author": "Kari L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "My favorite quick bite on Chestnut. The veggie plate, veggie gyoza, and tofu steak are great for vegetarians and the teriyaki-buffalo wings are delicious for all you wingatarians (people who eat chicken wings but are otherwise vegetarian). Solid value for the amount of food and for the laid back, fun ambiance that comes with it.", "author": "Shane E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "Staff is friendly and food LOOKS really good but it was way too sweet. When I think of teriyaki sauce I think savory with a hint of sweet. This tasted way too sugary. I got the chicken breast plate with regular teriyaki sauce. I had to add sriracha sauce just to balance out the sugary taste but I could still taste all the sugar under the super spicy sriracha. Not a good mix. This place appears to be healthy with good protein and salads but all the sugar reverses any healthiness it had. Very deceiving.", "author": "Cassandra C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "Ok concept, terrible food. I got a combo with salmon and chicken thigh and they were fishy, cold and overcooked.  The chicken thigh was just bits and pieces of dried up, leftover chewy meat.  I couldn't believe they dared charge $13.50 for this crap.  No love in the food.  Worse than food court food.", "author": "Apple M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "This is a great stop for a teriyaki rice bowl and it's in such a cute location. The staff was nice to let me substitute items to create the bowl I wanted. The salmon with brown rice is awesome!", "author": "Bethany T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "The food here is amazing. This review is meant for the chic at the counter who just openly ignored me when I asked three times if they were open. \n\nIt's 5 till 11:30 I walk in and ask if they're serving and she walks right past me ignores me two more times until I stand right in front of her. She proceeds to not look up and aggressively say we open at 11:30. \n\nHonestly the rudest server? (She just takes orders) I've ever encountered.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-14", "description": "Meh.  Been here twice now and Im not a fan.  The teriyaki sauce on the meat is so overly sweet and they slather everything in it.  Their sides are not the best.  For 5 dollars you get three tiny gyoza that have been fried to oblivion. We so got the cucumber salad which it supposed to be sliced nice and thin with seasoning and we literally got plain thick slices of cucumbers. And one piece was rotten :(", "author": "mackenzie e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "If anyone wants to save $5 download the Glaze Teriyaki Grill app using my code, and you'll get $5 to spend at Glaze Teriyaki Grill! Here's your special referral link: https://www.thelevelup.com/c/EM-BP3DKLRFT1\n\nIt's also they're rewards program, so when you use it when you visit, you get $10 after spending $100 which is about 10% their prices in rewards.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "This place is relatively new and the décor is awesome.  The open space and windows make it feel a lot bigger than it actually is.  Located in the Marina, it has no choice but to be modern and pricey.  The first thing that came to mind was \"a fancy Flame Broiler\".  Even the self-serve water cups are upscale...There are a good amount of items on the menu and they were trying to go for the healthy impression.  \n\nWe ordered the COMBO 1 (chicken breast/manger steak) ($12) and SALMON ($12), which came with your choice of brown rice and salad dressing.  Make sure to get it \"for here\" since they give you more sides.  \n\nThe plate had a good amount of sauce and you can get it spicy for a dollar more.  Every table has Sriracha sauce on it, so that works too. The meat was tender and salmon cooked well, given that it is fast-food.  \n\nThe cashier was very friendly and they definitely focus on customer service.  If you don't like something about your order, make sure to let them know and they will fix it without any questions.  \n\nOverall, \"a fancy Flame Broiler\" type of concept.  A bit pricey, but not surprising given the location.  Good customer service and the food comes out quick!", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-17", "description": "Oh how I wanted this to be good. The staff was so great but for $17 I was so sad with what I took home. Dry chicken, dry rice, and a tiny salad. Again the service was awesome, the food, well, left me sort of ticked I had spent almost $20 for a sad dinner.", "author": "Kelli S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Pleasantly surprised! We were hungry and wandering the area and decided to try it out. Balanced meal with rice, protein and salad (also got the side cucumber salad). Portion size was great. Healthy food and friendly staff.\n\nSad that the donut shop is no longer but Glaze Teriyaki is a winner.", "author": "Christine R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "Overall, pretty lackluster service and meal. The Teriyaki was pretty much standard fare. Nothing to write home about. Given the prices, I would have expected much more.", "author": "Henry B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "This is the 3rd Glaze location I have visited. My brother just moved around the corner, so this has become a pretty convenient place to stop by. Pretty much everything stands from my review of the Fillmore location regarding the quality of the food and the service.\n\n\"I grew up on Seattle-teriyaki, which is typically made with very poor quality/cheap ingredients.  Glaze has upped the standards, using quality meat, produce and housemade salad dressings.  They also offer more options than a standard Seattle teriyaki restaurant (3 dressings to choose from, various types of gyoza, etc.).  I always order the same thing. Chicken + Gyoza combo, so I really cannot go into depth on the menu. \n\nI've never been let down by Glaze, everything has tasted great, the chicken well cooked and juicy! The gyoza, crispy and delightful! The sauces are also quite a treat!  I rotate between the salad dressings.. they are all equally fantastic, though I do wish that they offered \"Seattle dressing,\" that sweet, delicious and mysterious dressing that you find at every teriyaki restaurant in Seattle. \"\n\nAlso, note that Domenic is still the man! Even if he has moved locations, his friendly demeanor is always appreciated. \n\nBiggest disappointment here is the beverage situation.  I wish the Chestnut location would take note from Fillmore and offer Manny's Ale and Jones Soda on tap.  Those two things alone make it worth the climb up to the Fillmore location. Also.. secret Seattle dressing! This should be an option, or perhaps a secret menu item for those who know... pleaaaase make this happen! \n\nAll in all, I will always support Glaze Teriyaki.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "This place is alright. Definitely only a 3/5. The teriyaki sauce is too sweet and too drenched within the protein (meat). I got the salmon plate and the salmon itself is only alright too. It's packaged nice(to go) in a decomposable container, but maybe that's why it was priced a little on the high side for a simple plate.", "author": "Anna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "Tried this place out finally, had the teriyaki chicken plate. Comes with rice and some leafy greens. For about $12 plus tax, you're looking at about $14 for a really simple meal. The food was fine, but didn't seem worth the price to me. I won't be coming back.", "author": "Al B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-22", "description": "Love this place as they have good gluten free teriyaki and I have never gotten sick here. Unfortunately I just don't think the price is with it. At the end of it all you are paying like $15-$18. Too much for rice and chicken.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "YAKI FTW\n\n-- Food is delicious and filling\n-- Ambiance is fun and vibrant\n-- Staff is nice and welcoming\n-- Playlist is lit and hopping\n\nIn the words of Jay Z, WHAT MORE CAN I SAY??", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Very flavorful, quick, price is on the reasonable side, no complaint! Would recommend their extra spicy teriyaki sauce for extra $1 if you like spicy food (it's actually not that spicy).", "author": "Siian X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Finally a healthy fast-casual dinning experience in the neighborhood.  I'm a huge fan of Glaze and the friendly staff. Glaze is my delicious and healthy go-to alternative to a burger or pizza. Try the steak/salmon combo.\n\nThanks!", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Glaze is the best teriyaki in SF. It's a great casual lunch or dinner place; the food, service, and music are all fantastic. My favorite is the sesame salad dressing and the salmon, but you really can't go wrong. Don't forget to have a pint of Manny's while you're at it.", "author": "Kael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "I go to glaze whenever I'm in the area. Delicious teriyaki offered on your choice of high quality salmon, chicken, or steak. They also have some of my favorite appetizers, such as the shishito peppers, gyoza, and wings. Friendly staff and a great selection of beer makes Glaze an ideal spot for lunch or dinner.", "author": "Zack F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-30", "description": "Use to be all star donut place: still have that donut sign\n\nI always wanted to try their food since it first open. Finally decided to tried it for linch during my lunch hours. I got the food to go instead. but of course you can dine in, either in door or outside\n\nIts one of those places where you order your food at the cashier and they will bring you your food out to you at the table based on the number that they provide you if you dine in.\n\nGot the combo 1 with your choice of 2 meats, white or brown rice, and some vegetable. The meat i got was hanger steak and chicken thigh or chicken breast. With tax included, its a little over $13. I would recommend you to get either the combo rather than the bowls with less portion of the meat cause when i got the combo 1, it can be more filling. I think its more expensive if you dont get the combo since its lesser meat. \nAnyways, the meal that i got was average. It did have some flavors to the meat. You get that carbs from the rice and it does absorb from the sauce of the meat since they place the meat over the rice.\nThey have Sriracha on each table and by the utensils area if you like to have that extra spicy flavor to your dish. I dont know why when i brought my food to my workplace, the meat was kinda warm quick since i thought they grill the meats over the grill. \nI will give it a second try for the next visit if theres any different in heatness of the meat if i dine in for the next visit \n\nIt wasnt too busy so i was lucky enough that i didnt have to wait long to get my food. Maybe less than 10 minutes", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "This place has such an amazing menu with excellent atmosphere and design. The employees are very friendly and really do this establishment well! A very nice experience, thank you Glaze!", "author": "Marc G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Great lunch spot. Good food (I went with the chicken breast), good portion sizes. I like that the bowl comes with a salad as well. Can't miss!", "author": "Mac C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "Simple and good. \n\n\nGlaze isn't kitschy or gimmicky. It's a straight forward proposition. Proton, rice, salad.  Food comes out quick and simple interior is pleasant.", "author": "Caleb H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Really can't complain about this place. I loved it. \nIn my diet I require a lot of protein so this place is perfect to get a lot of meat that tastes really really good. The rice is cooked perfectly and the greens taste amazing with the honey lemon dressing. I would probably eat here almost every day if I could. \n\nKinda like a Japanese/Korean Chipotle or In n out.\nSimple menu, just like in n out burger. A little pricey, but it's great food.\n\nTry the half chicken half steak if you can't decide which meat you want!", "author": "Jake C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "My family and I stopped by for a quick bite. I opted for the tofu which was surprisingly quite delicious. The brown rice was cooked perfectly. I tasted my sister's salmon and it was yummy as well. Overall, everyone was happy with their dishes and I think we ordered just about everything on the menu.", "author": "T. Renee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "I LOVE this spot.\n\nI always order the chicken thigh teriyaki with white rice and an extra side of potstickers. The potstickers are crispy and never greasy. This place also delivers! Glaze is a healthy option that is worth trying if you haven't already.", "author": "Rania T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "I ordered the Teriyaki plate with half white rice, half brown rice (Yes, you can do that if you can't decide between the two!!) and sesame dressing for my salad and doubled my hanger steak entree and got the crispy gyoza dumplings as well. \n\nEverything was absolutely delicious! I would recommend the sesame dressing for anyone trying this place for the first time. I would definitely come back here again.\n\nThey also were serving Dynamo Donuts which I thought was a nice gesture to the Donut spot that used to be in this same location for decades. \n\nTwo Random Notes: \n\n#1) Who else thinks that the wood panels on the wall are bleachers from an old gym?\n\n#2) As a fan of SF History and nostalgia I am glad they left the old sign Allstar donuts sign up outside of the building.", "author": "Thomas A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "I walked in for a take out around lunch time on a Saturday, they were busy but my order was ready very quickly. The food was good, but I am not sure about the value. The prices online are not updated, I think my hanger steak bowl was 13 dollars, then you add tax and tip and we are looking at 16 bucks for a small plate. For that price on a small spot like that I'd expect more food. But the food was good. I asked my teriyaki sauce on the side and I'm glad I did because I wanted to taste the meat. The meat was good, tender and nicely cooked, I ordered brown rice and for the tiny side of salad I got the honey lemon dressing which was delicious! Overall I enjoyed the food, but not the price. I don't mind paying for good food, but for a quick take out food, nothing fancy, it's literally steamed rice a tiny side of salad and some meat sprinkled on top. Tasty but not worth the price plus tax plus tip.", "author": "J. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "This review is only for the man who took our order at 5-7 pm on June 11th. He was the shiiiiiit, extremely nice and didn't blink once at our high confusion, keeping a smile on his face the whole time. I forgot to ask his name and I'm sorry for it bc he was so lit \nreally made our days", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Place looks amazing, quick service, meats, salads and dumplings were yummy. \n\nSadly the teriyaki wasn't that tasty! I got it spicy (extra $1 for spicy? Come on there's sriracha on the table...), but still very little teriyaki flavor despite a lot of sauce. \n\nI would actually return because the chicken thigh and steak was juicy and filling, and the salad was good (with sesame dressing). It was an awesome place for a relaxed brunch.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": "Did the portions get smaller? It's fast and the sauce is addictive, but I feel like it used to be better when it first opened. More like 2.5 stars than 3.", "author": "Arabella D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "Food is mediocre, and somehow they think it's ok to charge $1 for spicy teriyaki. It's the same sauce with peppers in. And there's free Sriracha on the table.", "author": "BigArm K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "All of Glaze's locations (from Fillmore St. to NYC) have tasty Seattle-style teriyaki that does the Emerald City proud, but the Marina location is special. On a nice San Francisco day, there's no better place to enjoy delicious teriyaki. And they've made their own spot without doing away with the All-Star Donuts charm. Also look for new Jones Soda Co. offerings to go with your meal.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Ordered the teriyaki steak w/brown rice. It came w/a small salad & sesame dressing. This was one of the better meals I have had this whole San Francisco trip! The meal was flavorful & healthy. The meat was tender w/just the right amount of sauce. Nice spot to have a nice meal.", "author": "Richard J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Love Glaze!  Walking on Chestnut looking to try someplace new and we stumbled upon Glaze Teriyaki Grill and thought we'd give it a whirl.  We ordered combo bowls that come with rice & a side salad and 2 proteins and some sides.  They were delicious.  The staff was very helpful, friendly and upbeat - they really elevated the entire experience.  The restaurant is clean, clean, clean!  Would go back without hesitation!", "author": "Donna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "I love teriyaki. Not going to wax poetic about my service or how eloquent the food was. Had the chicken bowl\nWith brown rice. Tasted great not too salty but rich teriyaki flavor.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-10", "description": "This place is alright. The food is pretty good, but there are a lot of things about this place that stop me from going back continually, even though they have pretty decent teriyaki. \n\nFor one, the staff ALWAYS seems to be unpleasant, unhappy, and rude. Secondly, there's a lot of BS charges, like charging you for extra sauce (which is really the point of teriyaki chicken). Has potential, but needs to step up its game overall.", "author": "Alexander J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "I was actually really impressed when I came to Glaze for a quick meal.  I ordered the salmon teriyaki, and loved it.  It is a healthy option and tastes delicious.  The only downside is that it is a bit expensive, but for quality food I'm willing to pay.  The space is a little small, so I would encourage getting it for pick up if its with more than 2 people.", "author": "Gina B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-31", "description": "When you're busy, writing reviews becomes challenging. But, I needed to share this experience because it always plays back in my mind. Unfortunately, my overall experience at this particular Glaze Teriyaki Grill location was not good. In early September 2015, I went here for lunch and purchased a teriyaki plate with chicken breast. Each plate comes with a complementary side of rice and salad. When my order was placed in my hands, I noticed the teriyaki bowl was barely warm before taking it back to work.\n\nWhile eating the salad portion of the teriyaki bowl, I noticed multiple pieces of straight dark brown / black hair sprinkled in the rice and teriyaki chicken. This isn't my hair texture. Immediately, I stopped eating and placed the lid back onto the bowl. I walked back to the restaurant and spoke with the cashier / manager about the situation. He apologized and offered to give me another bowl. I declined. Instead, I received a refund for my trouble. Hence, the one star rating for proper handling of the situation and restaurant decor.", "author": "Sarita S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-16", "description": "I really enjoy this place. Amazing food. But I went in last week at 11:30 when they opened. No one was at the front counter besides the cooks. I waited 10 minutes. Three people came in after me and waited as well. No one would speak to us regarding ordering food. After 15 minutes all 4 of us left without a single word from anyone. Pretty ridiculous no one would give us an explanation for why they would not take our order yet. I'm assuming the cashier was running late.", "author": "Dillon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Grand opening today! Tried their Spicy-Yaki-Chicken Wings (5pcs) and Charred Pork Rib (2pcs). Both flavorful and tasty. Will explore their other items soon!\nVisit #2: Funny, I ordered the same thing for dinner and was charged $2 less.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "09.23.15 etc.\n\nWhile my boyfriend was extremely disappointed that All Star Donuts closed to make way for Glaze, I could not be happier. Only because I rarely eat donuts. Blasphemous, I know.\n\nI'm into the combo plate 2 with the chicken thigh and pork gyoza, which also comes with your choice of white or brown rice and a side salad. A relatively inexpensive, filling, and quick meal. And that is saying a lot for the neighborhood.\n\nTotal damage: $12.78", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "Not a fan. I went to Glaze yesterday and was not very happy about my meal or service. First of all, the waitress was very rude and short with me. I also didn't realize we had to bus our own food, accidentally I gave my plate to the guy that worked there, and the same rude waitress laughed at me. Very embarrassing. The food was really not that great. I had the chicken breast teriyaki and it was pretty boring and had nothing very special about it. Disappointed and won't be coming here again.", "author": "Akili M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "I like this restaurant, but it's too expensive. $14 for a teriyaki bowl is just not worth it. I remember eating delicious teriyaki bowls in Seattle for $7, man do I wish food was reasonably priced in SF.", "author": "Scoot S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-29", "description": "Just ok. $13.50 for tofu, veggies, and rice. The veggies seemed like they came from a freezer bag, not fresh tasting. Tofu wasn't glazed, it was grilled and had charcoal bits on it, with the teriyaki sauce poured on top in the bowl. Three stars because it was healthy, but this should be cheaper for what it is imho.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "Amount of food is perfect. Nice two pieces of Salmon over rice. The wait is a headache half of people in front of you are stuck making up their mind-- typical Marina people. Make sure you ask for the sauce on the side.", "author": "Linda J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "Delicious!  Friendly and clean, also gluten free eating!!  Portions were generous and favors were amazing!! This is definitely a place to come place to go!!", "author": "Debbie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Love Glaze, both Fillmore and Marina.  The new Marina shop is cool, cool, cool in the old ice cream shoppe on the corner of Steiner and Chestnut.  Quick, healthy, efficient, delicious.  \nMariano, Frances, Lauren, Kyle....you're all great...and all of the fellas behind the line with Teriyaki smoke blowing up your sinuses all day and night!!  Mmmmmm, I wanna go now (sigh).  Late night menu, Glaze?  LOL", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "We were just passing by and decided to walk inside. It's a small place but extraordinary. The men that work there are super sweet and serve great food. I'm not from The City.. but from Southern California and hands down one of the best teriyaki places I have eaten. The chicken breast was cooked perfect along with the salmon. The steak was delicious and we couldn't be more satisfied. A great hidden gem.", "author": "Crystal E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Love this spot! So glad they opened a second location, as the Chestnut spot is closer to home than the Fillmore one which I also love. This place has such great ambiance. Food is always delicious and reasonably priced. Also has a great neighborhood feel to it. I normally like to get the chicken thigh with double salad. The wings and shishito peppers are also bomb.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "This is one of my new favorite spots. I'm not sure f the food is healthier but I at least feel healthier eating it. The combo 2 plate is a great idea and the ribs are fantastic. Relatively reasonable prices too. Staff is always nice and restaurant is always clean.", "author": "Matthew v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Glaze is the best yaki in the business. Great service and the salmon is just superb! Keep it up", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "GREAT food. I get the chicken breast with rice and the salad and it's always so amazing. 5 stars for great service and great food. I usually go every Friday on my way to work and I'm never disappointed. Seriously can't get enough!", "author": "Lisseth R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "This is my favorite place in the area to grab a quick, tasty and substantial meal!", "author": "Oliver M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "So pumped to have Glaze in the 'hood! I've rated the Fillmore location a 5 as well, but with the Chestnut location just about a 5 minute walk from my place, this is quickly becoming my quick lunch (also located close to the Marina Theater, so stop in before a weekend matinee) or take-out destination.\n\nService is fast and friendly, and the inside of the restaurant is super inviting, with succulent plants and simple decor.\n\nSalmon teriyaki combo + 4 piece gyoza = my happy place.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "Seriously Delicious Healthy Teriyaki.\n\nI love Glaze and am happy to see they opened a second location in SF. Fillmore or Chestnut, you now have two great options to cure your teriyaki craving. Casual, affordable, fresh, all natural, and organic.... Glaze may be your new favorite habit. \n\nLove the grilled teriyaki chicken bowls and fresh salads. Order online or call in for pickup if you are in a rush. Love you Glaze - you are DELISH!!", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "3.5 stars for me. At 18 bucks for steak bowl with extra protein this isn't very fast casual. I though blue barn was expensive but I guess everyone has push the envelope. The steak was cut really small which leaves me to think it is poor quality. I think If I come back I will try the chicken. I don't see this becoming one of my regular places though.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "I really want to find a place that reminds me of the teriyaki I had in Seattle. This isn't it, but the food isn't bad when you actually get it. Both times I have been they have forgotten part or all of my meal. They were quick to get something out for me once I asked, but it still takes a while to realize your food has gone missing.\n\nI think they need to rework their process to make sure orders don't fall through the cracks.", "author": "Cole G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "OVERPRICED Sorabowl or whatever tastes like basic food court teriyaki. Only reason for the extra star is the option side of shishito peppers.  Too bad that it was over seasoned with salt and deep fried in oil when they simply couldve grilled them.", "author": "Lady K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-02", "description": "It is too expensive for the price and they hide extra fees from the menu.  I addition to the 8.75% city sales tax, they have a separate 4% employer mandate tax to cover employee health benefits.  This is a hotly debated issue since some employers don't pass this extra fee on to the employees. Either way, they should follow the standard practice at most restaurants and increase the menu item prices rather than be sneaky about it to keep their margins higher.", "author": "Oscar S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Glaze serves very simple food and despite not being a huge fan of teriyaki, they do it particularly well for the most part.  Simple ingredients done right.  The beef is cooked perfectly and the salmon is also good.  My only complaint is the chicken when I got it was a bit dry but it's not a huge deal.  Service is absolutely wonderful and it really makes the meal that much more enjoyable.\n\nI'm still not a big fan of teriyaki, but if I am going to have it, I'd go here and get the beef.  IMO it's their best dish and if you're looking for a simple no frills meal done well, that's what you get.  We've started ordering this delivered at work now too so I'll definitely be eating Glaze in the future.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "I am usually very critical with my food. I know good food when I taste it. I had high expectations with all the reviews and especially when we walked up and overheard a family talking about how much they loved this place.\n\nLoved this place!!! It met all my expectations. The place itself has a nice feel to it. The food was very fresh. I got the teriyaki chicken- Chicken was cooked perfectly and favor was top notch! I got brown rice and salad with the ginger carrot dressing. Both were great!. Would defiantly come again!", "author": "Brynn J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-24", "description": "Opted for the Teriyaki Chicken Breast plate. Comes with salad, white or brown rice, and a normal size chicken breast. Overall, it was fine and hit the spot, but for the amount of food you get I feel like it is overpriced. Increase the portion sizes or lower the price and I'd give it a 4.\n\nThe actual interior is cramped and awkward. The table in the middle was not meant for human beings to sit at. I get it, the rent there is probably insane and San Francisco ain't cheap, but at least buy functional furniture!", "author": "Ricky S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Simple concept, with excellent food. I ordered the grilled hanger steak salad, and it was cooked to perfection. A big plus that I could make my teriyaki experience a healthy one by making it a salad bowl. And the sesame salad dressing is pretty good too.\n\nAwesome option for a quick, simple, healthy meal.", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "First time I ate at this location I ordered take out and it was within their 2 week opening. It was pretty awful- boring, over cooked salmon...dry and dull. Last week I decided to give Glaze another chance except in person- especially because everyone deserves a 3-4 week grace period upon opening! Plus, I love the location on Fillmore and Pine and couldn't believe they'd be that different.\n\nLow and behold it was delicious. I had the teriyaki salmon bowl with with brown rice and it was perfect. My friend had the chicken thighs and loved it. A great addition to the Marina hood!", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-07", "description": "Two of us ordered the chicken breast teriyaki plate and my other buddy ordered the pork. The plates come with a small salad and rice, smothered in teriyaki sauce. Consensus among our group was that the chicken and the pork were both overcooked and tasted dry (despite being covered in sauce). \n\nIt was over $12 for the chicken plate after tax, which is overpriced even for the Marina. You have to order at a register, fill/re-fill your own water cup, and bus your own table, so it's definitely a fast food type of place despite the cost.\n\nIf I'm craving teriyaki, I'll probably just go to the many other Japanese restaurants in the neighborhood that charge about the same but provide you much more service.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-24", "description": "Perhaps it's better in restaurant, but delivery items were sub-par. Chicken Teriyaki pretty dry, edamame tasted like the cardboard cup it came in, SoBe noodles have little flavor and Gyzos just average. Very disappointing.", "author": "Jaime J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Absolutely delicious! Very fresh and filling! Definitely hits the spot. Cool decor and an open kitchen. The menu is kinda confusing but it's essentially a teriyaki bowl place. Pick your rice, pick your protein, pick your salad dressing. They can be a bit heavy handed on the teriyaki sauce but the rest was perfect!", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Really healthy and great tasting teriyaki. Ive only ordered to go, and always have to order double meat to make it worthwhile. Not 5 stars because the bill is always higher than it should be for teriyaki, and they should really start mixing the spice when you order like spicy chicken teriyaki rather than just slathering it on top.  Quality is very high, and the cucumber salad is excellent.", "author": "Linn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "A delicious, filling and moderately priced lunch/dinner option in the Marina. For 11-12 bucks (if you don't opt for the absurd amount of meat in the double protein), you get a large amount of the main entree (we were pleasantly surprised by the portions of salmon our first time around), a complimentary large serving of brown or white rice and a smaller salad with your choice of dressing.\n\nThe menu isn't huge, you just get your teriyaki staples, but what more do you need? They give you the option to mix and match rice, your choice from a few dressings (I prefer the sesame) and you can split the entree between proteins for roughly the same price as any of them individually. The food comes out really quickly, and there is plenty of seating inside and out if you plan on sticking around (open air indoor benches on a Chestnut street corner are hard to beat). Everything is self serve (plates and water, utensils, etc) as well. \n\nGiven the more expensive options in the area, this is a solidly-portioned and tasty destination in the neighborhood.", "author": "Taylor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Small seating area but GREAT service & fun environment. The Honey-Lemon salad dressing is full of flavor. \"Everything Teriyaki\" was scrumptious!", "author": "So-Cal N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Top of the line teriyaki place, with each part of the meal being excellent. The salads are great, the rice is perfect (even the brown rice), and the meat entrees were quite tasty. The chicken, hanger steak and salmon were all worth getting, and our entire group had no complaints about anything served here!", "author": "John P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "Very inconsistent. I used to come regularly, but the quality has gone downhill. The beef is super overcooked and dry and chewy, the tofu if crazy salty and over-marinated and grilled till black and inedible.  I feel like if you sit in and eat, you also get more food. Several times I've done take-out and it's mostly lettuce and barely any rice.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "This place is amazing! If you're looking for a solid teriyaki bowl definitely come here and skip the sushi places in the area.  The service is quick and they cook the food right in front of you, you can even sit at the bar and watch them cook the food.\n\nI got the skirt steak bowl and would highly recommend it.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "Went here the other night and it was pretty good. I ordered the teriyaki chicken, and while I wasn't too excited about their teriyaki sauce, everyone else I came with loved it.  Decent pricing and decent serving size (won't completely stuff you but that could be a good thing). Would most likely go back!", "author": "Yarah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "Staff is not really nice.  Aloof, arrogant.  Food is pretty good.  Filling.  Felt a little sad when I left however. Not a fun experience.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-22", "description": "It's not Seattle style teriyaki...nothing inherently wrong with it, and if you didn't grow up eating teriyaki in the northwest/aren't expecting an exact replica, you'll probably like this place.  Part of the disappointment was probably my fault...ordered chicken breast & brown rice when thigh & white would have been more authentic.  The food is surely cleaner and healthier than the real thing...same with the atmosphere (never been to a real teriyaki joint with reclaimed wood and succulents) but, I'm left missing the \"fried rice\" with frozen peas + carrots, the sautéed cabbage and charred greasy meat covered in thick sticky t. Sauce...", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "I've chosen salmon, white rice and sesame dressing for the salad: it was an excellent combination! Great food great price!", "author": "Julio P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "I love this place!! Steak and salmon and combo is the way to go. Dont forget the ginger dressing. Boom!! PS - brack the loyalty card", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Glaze is a great place to grab a quick meal in the Marina. It's very quick to go in a pick up something to go. I would say it kind of has a similar vibe to Chipotle, except a bit more original and cozy. The chicken is high quality. I wouldn't say it's a large meal but because of the rice it's pretty filling. The pot sticker type things (not sure what they are actually called) are very tasty! Not the cheapest place considering the portion size, but overall pretty good!", "author": "George S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "Disorganized, irresponsible, shady staff. Came in with two of my friends. One ordered the exact same meal as I did, but the staff only cooked one. They served people that ordered after me. They overlooked my order because they got confused when there were two identical orders. When I followed up, they looked into my order, and they had the nerve to tell me that the reason was that it takes a long time to cook tofu! What an outrage!", "author": "Rachelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Love this Japanese teriyaki grill on Chestnut!\n\nBooomb!! Casual spot with good music to hang with friends for a bit in the Marina. We needed a spot like this.\n\nFirst time I went was last week before heading to the movies with a few friends and I've already been back twice!\n\nThe decor and vibe - perfectly executed\n\nThe food - super clean with fresh ingredients! Everything I've tried on the menu has been a winner.  \n\nThe Hanger steak is a must! I don't know what they put in that Japanese marinated sauce but it's f****ng BOSS. Perfect amount of sweet and spicy. I usually get the pork gyoza, hanger steak w/ a side of the shishito peppers and a Jamaican ginger beer.\n\nHaven't tried donuts but will try them next time.", "author": "Bridgett M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-03", "description": "Manager forced us to all sit one side of the island because \"that's what the owners want\" and the food runners need room.... You'll realize how dumb this is once you're in there. Don't go with a big group because of this \"rule.\" Overpriced and food isn't great either. Wouldn't recommend it.", "author": "Brent P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "I LOVE GLAZE! Amazingly tasty food, and healthy! One of those things that tastes like you should feel guilty after eating, but realize there's no reason to :) I recommend the chicken breast, the spicy teriyaki (although beware, it's spicy!) and the sesame dressing. yum yum yum! The gyoza is really awesome too.", "author": "Clay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-24", "description": "I stopped in for the first time today and ordered the chicken breast with brown rice.  When I got the plate, the chicken was lukewarm, so I asked the line cook (I was sitting at the bar and not near the counter where I placed my order) if it could be warmed up.  After trying to explain this a few times, he picked up the plate, threw it in the bin and ordered me a new dish.  This isn't what I wanted to happen.  If I had known that they would throw out a perfectly good plate of food I would have eaten it anyway, no big deal.  Ultimately, the chicken was good enough, nothing special, but that interaction really put me off.  I told the counter clerk about it and she was nice about it, but said \"yeah, well, that's what we'd have to do - we can't really take the dish apart and reheat it.\"  Just kind of weird.", "author": "Peggy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-22", "description": "The food is pretty good, fairly small portions for the price. However, service matters. The guy working the iPad was super rude and when we asked for a \"side\" it really ruined his day. I guess he had to press all new buttons, tough work I'm sure.", "author": "Marisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "Great chicken teriyaki and lemon zest dressing on the salad. Friendly service. Very casual. An easy lunch stop.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "Stopped in here and grabbed 2 protein bowl, $13/meal. Nice, quick service. Got steak and salmon. Salad on the side with the ginger dressing is great tasting. Brown rice was little undercooked and had no flavor. Salmon is bluhhh and the steak was pretty good in the teriyaki sauce, but needed some kick! The music they jam to while were eating was so awesome. Overall yummy healthy fresh meal, but spice it up a little more!", "author": "Chase S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Upscale version of Chipotle for Asian food. We were looking for a casual quick place to eat with our 1 year old daughter, and this fit the bill. Fast, friendly staff, nice glass of wine, and healthy quick food. They have high chairs too, which made it very easy for us to enjoy our dinner.", "author": "Jeri D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "Sad to lose the donut place but the teriyaki from Glaze will console me.  The food is always fresh, always delicious and quick!  Also although they don't have delivery service through the restaurant, you can use grubhub or another app to have fresh and tasty Glaze delivered to your door in the dead of night without ever having to put on your coat.  Oh and their Soba Noodle Salad is amazing.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Really good, quick, convenient. I would like to know if you can get the teriyaki sauce on the side since it was a little sweet but I didn't ask.", "author": "Therese M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Service was very strong; food is very good. Food also was made quickly. They use meat without antibiotics. Like this place a lot", "author": "H B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-27", "description": "This place is no different than any Japanese run  place, except the food's not as good and it takes a lot longer to get it. My boneless pork loin was very dry and chewy.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "$10 will get you far here with delicious flavors and big portions. Get the carrot-ginger sauce for your salad! Everyone working here is super chill and nice.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "This is a new spot that just opened up at the old donut location on Chestnut. Their Hanger Steak plate is by far my favorite. It is a little small on the inside so seating is not always available but still a great option for dinner.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "As much as I miss all-star donuts, Glaze is a welcome addition to the chestnut street /marina area.  Working in the hood and always wanting something new to eat, even though there's a ton of food places already, this place is a great option, quick, straight forward meal.  Chicken, Steak, Pork all tasted great, yes, i've been to the place a few times since it opened last week.  I have never been to the other location on Fillmore, but if it's anything like what they did to this place, then kudos. It is definitely going to be a mainstay on my places to grub while at work.  Nice subtle touch on offering donuts to honor the previous tenants as well.", "author": "Fernando C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Quick, fast, delicious, and has a friendly staff. I walked past this place and it looked good and sounded good. The food was delicious. The sesame dressing for the salad was amazing.  I can't wait to go back and try their spicy teriyaki sauce!", "author": "Emily O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "Really liked this place. The food was delicious and it came quickly. Nice environment, clean and friendly, good atmosphere.", "author": "Tommy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "So happy to see the second Glaze open. Love the food, awesome portion sizes and love the sides. Chicken, salmon and tofu are the top favorites in our household.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "I could not love this place more!! I got half salmon and half steak and was so impressed with the quality and freshness of the food. This is really not your average teriyaki place--the sauces are freshly made daily and you can get brown rice and mixed greens so you can feel virtuous!", "author": "Venice Fan 1."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Glaze is one of my favorite spots in the city and I easily go here once or twice a week.  It's fresh, healthy, prepared right in front of you, and delicious.  They also have punch cards so every ninth visit is free.  I personally recommend the chicken thigh or hanger steak, sesame dressing for the salad, and the pork gyoza.  I would generally not recommend the chicken breast or the pork, but hoping at some point they can maybe figure these options out.", "author": "Matt O."}
