{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "Tough course overall, fairway are hilly and expect to see different pace of greens throughout~ Staffs are laid back and super casual. A great course for practicing shots and bring friends", "author": "Sittidej S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-24", "description": "Came to this course as a visitor from out of town. Seemed to be reasonably priced and not far from where I was staying. That was the only positive. \n\nPeople who work there have a horrible attitude. Don't bother if you appreciate fairways and actual tee boxes. I played the day of the club tournament and not only was my round interrupted but the course was maintained horribly.\n\nAlthough its cheap, save your money and take it elsewhere. This place is a dump, the people have a weird vibe as one other poster mentioned and overall was an unpleasant experience. \n\nIf you are looking to play golf your most likely looking to play in a peaceful area with nice scenery not some half ass course neighboring the projects. I guess I was lucky there was no gun shots!\n\nI ended up walking out on the 5th hole.\n\nSave your money and time.", "author": "Abe P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "Bashing through the rough, \non a mud-dy, sul-len day...\nO'er the fields we go,\nCrying all the way! \n\nOkay, it wasn't THAT bad, but I was told I was not allowed to demonstrate any drama on the course, so it's comin' out here! This course plays like the \"Western--the Good, the Bad and The Ugly\". It is a strange juxtaposition of epic with horrendous.\n\nThe Good. It's cheap. C'mon--green fees of $25 for 9 holes ($28 for another go-around for a total of 18 butt-spankin' holes), even less with a resident card/senior discount?!! The guests who come here are more laid back and not persnickety about course rules--Phhfftsheah! The course manager, Brandon, is cool--he told us as we walked off to \"do our part and water the trees frequently!\" \n\nThe bar is REALLY cool with inexpensive drinks. The manager has allocated resources to maintaining the highest priority areas of the course--greens, parts of fairways you are supposed to reach with each stroke (think green islands) and Tee Offs.\n\nThe Bad. The course is really is a booger at places! The fairways are narrow and break steeply so that your ball will roll to one side. The rough is ball ingesting and nigh impossible to search through. There are parts that are muddy that will soil your buggy, shoes, and club (and pants if you send a shot into the rough). The Tee-offs are inconsistently marked and sometimes located in counter-intuitive places. We tee'd off one hole, walked 20 yards and discovered the real tee off for it... Weird.\n\nThe Ugly. The aeration holes and patching mesh on the green kicks and skews the putt like a pinball machine flapper. The brown patches of fairway (which I visited often in my noobness) are brutal because there is.no.green.grass for your next shot. My kind uncle kept reminding me I could move the ball in a one foot radius 'for improvement'... Let's review my options: how about that glob of mud, or sundried weed, maybe that rock perch...? And, just when you thought you made it home on the 9th, the green there is a wicked ski-slope--positioned strategically as entertainment for those who have gone before to heckle you as the ball is putted haplessly from one end of the green to the other.\n\nAll said, it is a low-key place for me to bash the ball around without too much recourse :) For that, I am a fan--4 stars!", "author": "Lu-Shien T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-25", "description": "It's a decent course. Grass is in fair condition. Daisies come every now and then.\n\nUnfortunately, they overcharged me and refused to pay me back the remainder. Didn't even offer me anything to compensate. Oh well...", "author": "Michael L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-12", "description": "Super arrogant staff on Sunday morning. Ended up in lincoln  golf views are great sevice is definitely better than Glen. Take your customers for granted and reap what you sow. BTW spent $300 bucks in Lincoln they dont shy away from business. So the owner has knee jerk reaction and pings me a few days after the incident. And just as predicted no follow ups. I responded to his request then crickets.. typical. I would not play on this course until they get their act together. Tom thats a damn shame.", "author": "Jorydude R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "This course is in a very bad neighborhood, is hard to find and is in extremely poor condition, and the atmosphere in and around the \"clubhouse\" is very strange. Add some ridiculous rules such as anybody who goes on the course whether they are playing golf or not must pay the green fee AND rent clubs if he/she doesn't have them. What? I'd recommend staying away from this place.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "This is such a fantastic course. If you shoot below 90 for 18 holes, it's a great challenge. It takes many rounds to learn the bounces on some of the approach shots (especially on  #1, 7, 8, & 9). \n\nThe staff is great--very fun people. The Killer B's (Brad, Brian, and Brandon) totally rock and pour awesome drinks!  They keep the clubhouse fun and lively.\n\nThe one drawback is the owner, Tom. Whenever he's on the premises, everyone is on edge--not just the staff, but also, the regulars, like myself. And, even if he's not actually there, they are constantly worried about what he might think over things that are really nothing at most all golf courses I've gone to. I really wish Tom would just put some faith in his hardworking staff and let them just do their jobs.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "Do. Not. Play. Golf. Here.\n\nThe entire course should be considered ground under repair. Hop on Caltrain and play literally any other course in the bay area. It's not worth playing for any price", "author": "Pat J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "Surprised they advertised that it is the best 9 hole in SF. I'm guessing they are the only one in SF?\n\nCourse is terribly taken care of. Pretty much no fairways. The bunkers have no sand in them, it's pretty much hard mud. The sand is blown onto the path (high winds). Greens have holes everywhere. \n\nGuy are the front was pretty nippy when we got in. I paid only for 29 bucks a head and he wanted to charge me 30. It's not a big deal but when I told him I gave my credit card on their website so want to double check, he gave me lip about 1 dollar. \n\nIn the middle of us playing, the maintenance guy turns on the water. I'm not sure what they were thinking. \n\nCourse is pretty challenging because of the hill and the conditions just makes it much harder. It's not that much cheaper than other places, especially if they have a real 18 hole. But if I want to punish myself and test my patience, I might come back.", "author": "Edward K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-19", "description": "Lee Trevino once called this the best 9-hole test in golf.  \n\nMy son and friend wanted to play here.  I told him I'd played here once but the kids from the projects on the other side of the chain link fence heckled us the whole time and someone had had a fire on the 8th/17th green.\n\nSo I don't think he was expecting much when we got there.  You literally have to drive through the projects to get there.  There was a couch in the middle of the road that we had to avoid!\n\nThe pub is still there but I don't think it is as good as the one that used to be there.\n\nIf you fancy yourself a true golfer who isnt phased by small undulating greens and the lack of country club amenities, then check it out!\n\nNot for the faint of heart!", "author": "Erik H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "First time to play here... really challenging course specially for novice golfers.  Perfect place to practice for accuracy.   Lost some balls but found other lost balls, and eventually ended up with more balls in my bag :-)   \n\nFriendly and great staff.  Thank you Scott for sharing some good golf stories.  This is now one of my favorite places to play.  We will definitely play here again... soon!", "author": "Raul R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "I just played it once but I tend on doing so many times . It's a challenge, hilly , sided sloped fairways a real treat for someone like me who is used to playing gg park or the Fleming 9 at Harding . \nWell worth the visit. \nAnd the greens are multitiered in many places. Fantastic. A great course to test my putting skills.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Played this course a few times over the past three years and it's condition has improved each time. The greens are great. The tee boxes and fairways are below average. The course plays well in the spring and winter after the rain has given the grass a chance to grow, other times it can be dry and dusty. \n\nFun course, plays fast, staff is friendly...makes a good course to squeeze in a quick 9. If you expect a country club experience you'll be disappointed. If you take it for what it is you'll appreciate it.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "Challenging golf course that is in fairly decent condition. There are 9 holes that double as 18 based on different starting positions. Friendly staff and reasonable rates. \nFYI, you dont need to cruise through the projects if you drive on Persia/mansell.", "author": "Bjj P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "I'd like to leave 2.5 stars, but since that's not an option, I'm going with 3. \n\nThe bad: \n1.) Terribly maintained course. As some reviews say, the fairway is literally dirt until you are 150 yards to the green. Guess the CA drought is taking its toll. \n2.) Neighborhood feels a little unsafe. \n3.) Ran out of carts when I played. \n4.) Not really an 18 hole course. 9 hole course with two different tees at each box. \n5.) No ladies tee\n\nThe good: \n1.) Very, very affordable. $25pp\n2.) Challenging, but not ridiculous. Only one lost ball for me! (And several found ones in the bushes...)\n3.) Nice views of the bay at a few holes. \n4.) Grass isn't so bad if you are good and able to hit right onto the nearby fairways on the first shots. \n5.) Cute cat on the course :)\n\nNote: I am by no means not an expert player, just play recreationally for fun.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Visited this golf course a few weeks ago and had a great time! From the quaint little caddy shack like clubhouse to the AWESOME pub. We had never been there before and from the time we walked through the door Lisa, who was working that day, made us feel like regulars! She was so helpful and funny and accommodating! She made the day great. The course looked great and it was a great walk(and workout) we are used to the flat land out in Brentwood. Can't wait to go back and visit again and to hang out with Lisa in the clubhouse, she was the best!! Please go visit Gleneagles Golf Course, you will love the experience! :-)\nCindy B", "author": "Cindy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-07", "description": "I went back in August just to say that I've played this course. The photos are far from helpful.\n\n-Staff is friendly and courteous (saved themselves from 1 of 5)\n-The course is 9 holes with different tee boxes so that they can say it's an 18-hole. So you play the loop twice.\n-Half the course is dirt and wood. I'm not overestimating that amount. The drought has completely destroyed this course.\n-Constant Police sirens alarming throughout the background. Keep in mind you're in one of the worst parts of San Francisco and it may be unsafe to even drive here. Definitely do not take the bus here (I am a S.F. native).", "author": "Dylan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Course is in pretty shoddy condition (thanks drought!), but everyone is super nice.  It's actually a pretty challenging course (even harder when your ball constantly rolls off the fairways of dirt).  Full disclosure: I'm terrible at golf, but this course seems like a great place to learn due to the somewhat relaxed nature and feel of the course.  There's a footgolf [soccer golf] course setup as well, so it's definitely on the more casual end of courses.\n\nGood:\n1) Friendly!\n2) Casual\n3) Cool bay views\n4)  Challenging\n5)  Solid club house\n\nBad\n1) Poor condition", "author": "Chris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-13", "description": "Rough course, no true fairways, greens are like 6 years old and look really bad in some spots. It's a tough course to begin with and the condition makes it harder. The guy in the pro shop/bar was nice and really took the time to explain the course to me. I'll be back for sure when I want a challenge. This is definitely a goat track course.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Bad stuff out of the way first. Not in the best area by any stretch of the imagination  (but, you'll be fine as long as you keep your head about you). Not the best kept - but completely understood given limited budget.\n\nGood stuff. This place will kick your ass, grind you down, make you cry, quit golf, then come back for more. It's insanely difficult, creatively laid out, windy at times, hilly all the time, and absolutely packed with character. The greens are in excellent shape, the bar is brilliant, you feel like you're getting a little slice of SF history every time you go, and the price is more than affordable (about $20 for 9/$35 for 18). Bartender Brad is my boy.\n\nIf you're looking for a real challenge, don't mind posting a high score, alright with playing golf in the middle of the projects, want some good whisky, get here ASAP.", "author": "Eddie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "HARD.  \n\nGreens are in great shape.  The parts of the course where your ball is supposed to go is in good shape.  \n\nEverything else is tight lies, rough, or raspberry bushes.  In other words, you need to aim, and you need to hit it where you aim.  \n\nI love it.  Very laid back.  Inexpensive.  Can find as many balls as I lose.  It makes me a better player.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "I love Gleneagles because it's so unique.  The staff is friendly and honest.  I told him that it's my first time there and he explained to me that it's a difficult course, the fairways are beaten up, but the greens are nice.  I then proceeded to play one of the most challenges courses of golf I have ever played...and enjoyed every minute of it!  It's reasonably price (~$20 for 9-holes on a weekend).  I know that it's not your typical country-club course that's well-kept, but I believe that's what makes this course so fun to play on.\n\nBe prepared to have a ton of fun (and some frustrating moments) at Gleneagles.  The experience is definitely worth the amount I paid.  I will definitely be back to improve my score!", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "This review could be summarized in 2 words: I WISH\n\n- I WISH it was half-decently maintained:\nThey totally gave up on several components of this course. It's like they had to pick who to push off the tower. \n\n- I WISH Fairways have not been abandoned. They \"kind of\" take care of the Fairway areas you are suppose to land the ball (220 yards out for Par 4 and 5.) You are on dirt if you are short.\n\n- I WISH Greens weren't a lottery in term of conditions. It truly depends on the day and weather condition, but if there is something they work on, they are the greens.\n\n- I WISH they had money to re-vamp it.\n\n- I WISH didn't look like a dump with corroded trash bins overflowing with bottles and junk on the course.\n\nIf these wishes were to become reality I would be truly happy to be playing here, I still go, and it says it all. \n\nEvery time I go I feel like an inside hope to see it improved...hope is still there but course has not improved yet.   \n\nThis course has so much freaking potential, it's super challenging, it's scenic (forget the project and look at the Bay on hole #3), people (staff and patrons) are cool and friendly.\n\nKeeping my finger crossed for a brighter future.", "author": "Riccardo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "Want a beautifully manicured fairway? Rough that looks like the fairway? Go play somewhere they make you tuck your shirt in...\n\nProjects scare you? I hear the 'burbs have nice big open courses where you will never see a homeless person or a pothole. Of course you would have to go live in the burbs then... It's just people, people, living their lives as best they can.\n\nTree branches too much for you? See above...  Up in Sacramento they have courses where the trees look like toothpicks... branches won't bother you there and if you can't drive straight you can still play.\n\nCourse too challenging? Try mini golf, I hear the putting is top notch.\n\nCats bother you, off in the distance? It's not like they steal the balls. And they keep the rat population from the 'scary projects' down.\n\nGreens too fast for you? I hear foam practice balls roll slower...  Maybe that would help.\n\nTee boxes not pretty enough? What? your game is based on how pretty the tee boxes are? Really?\n\nWondering where the green in the pictures went when you go play in August? Can I just say Xeriscaping? Play in the spring if you need green. Or bring spray paint. I hear they use spray on green on the courses down in Santa Barbara during dry years...\n\nIs the \"hard dirt on the fairways\" hurting your clubs? Try not hitting the dirt. Hit the ball instead, makes an amazing difference in the life of your irons, and in your handicap...\n\nMore expensive than (fill in anywhere other than San Francisco and Manhattan)? Well that may be because you aren't in Kansas anymore, Toto.\n\nNot scenic enough for you? Yosemite has a lovely course that has views. You are in the heart of a big city after all...\n\nOh my. No water fountains? No ball washers? Not enough yardage markers? Please, they have all those amenities at Harding and The Olympic. For a price, and on a limited availability. And tuck in yer shirt while you are at it...\n\nIf you miss the entrance slow down, you're driving too damn fast.\n\nLosing your balls among the clover flowers? Sounds as if you need bigger balls. Drop a new ball and play. Don't slow up the course. Those nice guys behind you saying \"No problem, take your time\" are thinking \"put a nickel in it, you ass\". Let them play thru if you want to do an Easter egg hunt for lost balls.\n\nCart paths too rough for you? Pull or carry your bag like everyone else, save the cart fees and get some exercise you lazy sap.\n\nIf the course was maintained impeccably the fees would be absurd, instead of the complaints.\n\nWhingers need not apply and no fornicating cats allowed.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "This golf course is not the spawn of Satan, it is Satan.\n\nA nine hole course with 18 separate set of tees to make an otherwise blissful morning round of golf into pure He**.\n\n1st hole. Locals tell me, aim left and your ball *should* end up on the right hand side of the fairway.\n\nReally? Aim towards the woods?\n\nSo I did. A perfect drive with just a hint of a fade landing just off the fringe. Then my ball decides to slowly roll from the left hand side of the fairway and bounce it's way to the right resting under a log.\n\nI cursed. Yes I frickin' did.\n\nBogey*. And fortunate at that.\n\nThis is the hardest 18 holes of golf I have ever encountered in the most beautiful city this side of Paris.\n\nI would say leave the driver in the bag, but in reality it's going to be long day no matter what.\n\n* To make this story more dramatic, my \"Bogey\" was actually a \"Double\"/", "author": "V B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-03", "description": "Why is this place so cheap? Because you need the extra money to finance your balls. \n\nBring extra balls, and perhaps paint those balls bright pink! A few of our best drives, right down the middle and a decent amount of distance, resulted in lost balls, either because they blended in with the white flowers or got lost in the thick grass. There are all sorts of hidden ditches, dirt piles, and holes right in the middle of the fairways for balls to hide. The fairways aren't mowed down low enough (maybe because it's been too wet, but it was definitely dry today - no mud at all), and on some holes, all rough right beyond the tee box (yeah, I had some bad shots, admittedly).The fairways definitely needs to be kept up better, because hitting a decent drive but losing the ball in plain sight is way too frustrating. \n\nAlso, it was really strange that we were required to wear real golf shoes for the sake of the course's condition, when it was pretty bad before we got there, from no fault of some shoes. However, the greens were in pretty good condition, and the people working here were really nice, so I've got to give some credit for that. \n\nThe comments from other Yelpers about the ghetto aspect to this place is really undeserved and disheartening. It's not dangerous or ugly there (well, the sign needs some work...http://tinyurl.com/4ya6vhd), and the comments about only a fence separating the course from the projects makes the residents of the neighborhood sound like zoo animals, not people. Fences typically delineate property lines, and I've seen plenty of them at golf courses, so I wouldn't be concerned.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-14", "description": "This course is very poorly maintained. The tee boxes and fairways were terrible. Sometimes, I had difficulty finding the correct tees. I read online that it was a hidden gem, but it's far from it. It looked nothing like the photos I saw online. Maybe that's what ruined it for me.\n\nThe only positive is that I liked the green on the last hole. It was very challenging.", "author": "Jang K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "I go way back with Gleneagles, back to the days of Eric DeLambert running the course, refusing to put in yardage markers, and insulting my game ( darn truthteller), and back to the days of Billy Smith pouring the most liberal drinks in town! I still remember those single malts after being tortured by the course.\n\nBut, if you are a real golfer, true to the traditions of the game, this is the place to play when in SF. It is a harsh test I warn you, never mind that its only nine holes with two tee boxes, it is a great and humbling experience.\n\nA lot of folks claim to remember Trevino's visit, and I can recall nursing a Glenfiddich and seeing Herman Mitchell walking up from the parking lot with Lee not far behind. He shot a 73 that day and praised the course to the skies. I wasnt there for the next days 76 but sure wish I had been!\n\nI live in Stockton now, a legitimate 7 handicap, retired and recovering from quadruple bypass surgery, but I intend to play the course again Cardiologist be damned!", "author": "Rick D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-17", "description": "Where to begin? Yikes.\n\nMy friend and I were seeking a cheaper and closer golf course in the City after having moved from Portland, and this wasn't what we thought. Yes, I realize SF is a lot more expensive than anything in Oregon, but I didn't imagine this.\n\nI'll start with the positives, however. The greens are actually in good condition and the views from the golf course aren't bad either.\n\nBut the yelp course pictures here are nothing like the course itself. Where are the green fairways? There was nothing to differentiate from fairway to rough. The tee boxes were bumpy. I imagine it is possible to have green grass growing since right next door was a playground area with actual grass.\n\nI was basically hitting off solid dirt in the \"fairway,\" which damaged my clubs a bit. With the wind blowing, the dirt just flies right back into your face.\n\nI assume it's a local hangout, you definitely have to have played here a bunch of times to know how to play the course. Unfortunately, I don't think I'll ever get to as my first time was my last time playing here. It's a shame, too, since coming from Portland, there are a lot of affordable nice courses. And in SF, it's a challenge to find it and I had high hopes about Gleneagles.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-20", "description": "The course gets 1 star, the nice staff makes it 2.\n\nLets start with the course. Although they claim 18 holes, its only 9 with different tee box locations. As others have mentioned, the fairways don't really exist. Its mostly dirt, weeds, rocks, some various lengths of grass, and cats... seriously... cats everywhere. Usually most courses have problems with geese, but Gleneagles has a stray cat problem. \n\nThis course is definitely challenging, but not in a good way. It's challenging because its in such terrible condition. I'd rather spend my money elsewhere. \n\nThe extra star goes to the staff. The barkeep/starter was really nice when I got there. He asked me if this was my first time there (which it was) and he walked outside with me and gave me a few pointers on the course layout and some tips. \n\nI'm making an effort to experience every course in SF, but I think one time at Gleneagles is enough for me. I probably won't be headed back.", "author": "Angelo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-15", "description": "Hello fellow golfers and Yelpers,\n\nThis place is something else, let me tell you! I say that in neither a positive or negative  manner! Playing this course for the first time was definitely a challenge. Luckily we had a member of our threesome who was experienced at this course and was able to give us pointers as we went along. This will be a course that you either like or hate in my opinion. I welcomed the challenging course and did notice that it was not the best kept or well maintained as other course that I have played. The ninth hole was the most challenging to me (hint, stay along on the right side). We were able to get a great deal and overall, I did enjoy it. Playing nine holes ended up feeling like we played 18! \n\nI think it would take me a couple more times playing this course to really begin to  understand nuances of the course layout, it is very tricky and at the same time very scenic. Just so that you are aware, the course generally slopes towards the Cow Palace. Keep that in mind for shot placement, it is a son of gun when the ball begins to roll and roll and roll.\n\nThe staff was great and accommodating, thanks Lisa! I would definitely come to play it again and look forward to it!\n\nSee you at the first tee,", "author": "Happy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-14", "description": "Save your money and go to Flemings for a nice 9-holer.\n\nIt'd be a misnomer to call them fairways, since what's left of the grass had turned brown in most places. There are a few green patches here and there but don't count on your balls landing on one. The greens are not too bad though, especially #9 since they just redid it last time I played there.\n\nNot the most scenic course.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Last Sunday after 8am church with the missus, I pulled into Gleneagles' half-full parking lot expecting a quiet golf outing. I proceeded to walk into the pro shop, which to my delight wasn't a pro shop at all, but rather a fully stocked bar. I uttered maybe two words before I was asked \"fernet or jaeger?\" and a fernet shot was thrust into my hand. \n\nI need to start golf rounds like this more often.\n\nThe 9-hole course is very difficult and they play \"preferred lie,\" meaning you're allowed to move your ball within a club-length on any shot because of the course's difficulty. The course may be challenging, but it's great fun and the people make it even better. Several members asked me to join their threesome which was great fun. The bartender / course attendant Lisa was awesome as well.\n\nThe golf was great (esp for $22.50), but it was the fun, friendly culture that will bring me back to Gleneagles many times more.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "The folks at Gleneagles have done a great job getting the course back into good shape. \n\nIf you haven't played it recently, you should check it out. \n\nIf you have never played it, be ready for a tough test of golf. You need to play it at least a couple of times before you can expect to post a decent score.\n\nThe greens are in great shape and they are very fun to putt. The fairways have rebounded nicely from last summers drought. Kudos to the staff on a great job!!", "author": "Mike W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-21", "description": "If Pebble Beach is 5 stars and a Goat ranch is 0 stars, Gleneagles is a solid 1 star. This is a good place for a beginner or kids to go check out and hack up as it can only improve the condition of the course. \n\nThe Good:\n- The greens are rolled and well cut. (1 star)\n- There is ample beer in the bar.\n- Nice layout for 9 holes. \n\nThe Bad:\n- There is no such thing as fairway, it looks like animals have been grazing on this property.\n- The tee boxes are horrific, so bring 5 inch tees. \n- There is one person who is the starter, bartender, marshall, and cashier.\n- No Food. \n- I couldn't find a single water fountain on the course. \n- The cart paths are dirt and unpaved.\n- There are no ball washers on the holes.\n- There are no yardages on the sprinkler heads.\n- Expensive at $19 for 9 holes, there are much better deals on GolfNow\n- The signs on the holes are falling down.\n- If you miss the entrance to this place you drive right into the projects. \n\n\nUseful Hint:\nEverything breaks toward the projects (or water tower) so pay attention to where that is when you get there.", "author": "Wayne I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-17", "description": "Wowzers!  I absolutely hated the surrounding area of this golf course!  I played this course with a SFPD buddy of mine and it got a little interesting.  As we were finishing up the fourth hole, there was gunfire in the projects that are on the opposite side of the cyclone fence.  My friend called in that shots were fired -- it was quite startling.\n\nThis little 9-hole course is actually a solid layout.  It is above-average to difficult and has one super long 600-yard dogleg left par 5.  You can play the course twice using separate tee boxes for a full 18 holes.  Very similar to Gilroy Golf Course.  The rates are dirt cheap, and the course is pretty hilly and narrow.  I'm not a fan of the grass there.  It is really, really thick and coarse -- and a bit overgrown.  Almost like crabgrass.  \n\nUnfortunately, this course is in what is by far the worst ghetto in San Francisco.  It could use a touch better TLC from the gardeners.  But if it were anywhere else, it would get 3 or more stars.", "author": "Joel V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-10", "description": "Get out the watering can. Unfortunately this course has suffered badly from the California drought and is dying of thirst.  The course is not looking so good and I find it quite an embarrassment that it calls itself Gleneagles.", "author": "Ross C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Let's be honest: this place is never in very good shape. However, it's definitely a fun course to play. I have come back here over and over again with the boys & enjoy myself, and get a great workout. And there's nothing wrong with their watering hole. An incredible selection!  If you're happy to play a course where you're never going to be in a rush and there will never be anybody bothering you,  knowing the condition will be mediocre at best, this is it. Nothing pompous, just an honest golf course.\n\nOh yeah, it is always fun to play next to some pretty dilapidated housing project!", "author": "Alberto A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "Terrific and challenging 9-hole track. Great test for good golfers.", "author": "Dangerous J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "I'm not a golf elitist nor care if bins of beer cans are full (and I'm not exactly helping) but I am addicted to the game! So gleneagles is perfect for me and is slowly becoming my regular course. Terribly difficult course so I actually really like the second 9 because I get a crack at redemption.\n\nTHE STAFF deserve 10 stars. Warm, friendly, and proud of their establishment. They are low key and easy going but also havehigh expectations for fast play and respecting the culture at GE!!  Much respect!", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "This is a great test of golf, you have to think.. and hit good shots and be able to read the greens.. it's that simple. To those whining about the tee boxes/fairways.. go play somewhere else, this is not the course for you. The Glen has character, and is a tough course, and it's not for everyone which is fine by me. I think this place has some of the best greens around, if you can figure out these greens you will be back!", "author": "doug c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-05", "description": "Amazing layout and scenery, but terribly maintained. $20 greens fee adequately represents the quality you can expect.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "Love this place.  Tough, gritty little track.  Fairways are beat up, you're surrounded by the projects, and all day you're putting on a marble staircase.  You can get your ass kicked in more ways than one.  For those who complain about the conditions, I say adjust your expectations.  You don't go to Burger King expecting Gary Danko.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-13", "description": "Jeezus..... First of all, this place is in the projects so that says a lot. The fairways are beat to hell, the greens are horrible, friggin' tree branches are everywhere and worst part is that the drainage system is non-existent. This course just soaks up the water and you loose balls when you're hitting into the fairway. I've never experienced worse conditions ever in the city, even LP is absolutely more playable than this sh!t-hole. The last hole (9) is the only one playable because it's the only one you can see, and you think, \"hey, this isn't too bad.\" But once you start playing, good luck. The staff is cool as hell, they let leave the 5th hole to take a dump in the clubhouse and the marshall said, \"feel free to go back where ever you left off at.\" LOL So since they were really cool I gave them two instead of one star.", "author": "C L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "Three stars is just about right for this place. \n\nCons- Fairways and tee-boxes are some of the worst I have ever seen. \n\nPros-Greens are very good. Surrounding park is quite peaceful, and there are some nice views.  Clubhouse is nice and the green fees are cheap", "author": "Theodore N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-02", "description": "I know they just re-worked the greens, but man, the upkeep here is WEAK! super weedy, hardly any of the roughs are recently taken care of, the fairways were dryer than hell and the tea boxes were hard to spot bc they were so blended in with the un-manicured course. Sand traps had more weeds and tree debris than sand.\nFriendly service, decent bathrooms and fun topography gets this place a 2 star instead of 1. \nCould have given it a 4 star if it were better maintained.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "This is a tough course. That's about all I can say. The greens are fast, not like the typical SF public courses, which will take a minute to get used to. The projects line holes 4-6, which puts my mind at ease that I do not have to worry about shanking a ball into a picture window that lines the courses in the east bay. This course has the best weather in the city on a regular basis, another plus. It can get exhausting with the length and elevation. If you want to feel the frustration the pros do during a US Open, play here. This will tear up your handicap, get there in a hurry! The beer or drink at the end of the round  makes the day.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "What is Glen Eagles?  If you can answer that question perhaps you can explain the meaning of life to me.  Glen Eagles is the perfect example of the absurdity of our existence here in San Francisco.\n\nThe course layout, location and design is absolutely fabulous!  However,  The management and maintenance of this civic jewel is so atrocious that it can only be rivaled by that of Lincoln Park, or the Soviet Union circa 1974.  The greens are in good shape, but the fairways are nothing but dirt and weeds.  The management states they are trying to create a Bandon Dunes feel to the course.  My friends and  I refer to the course as Abandoned Dunes.\n\nThe bar is absolutely top notch.  It has an old school vibe that can't be found anywhere else in the City.  Glen and Brad are perhaps the nicest bartenders in the City.  If you call up to the clubhouse at the fifth hole they'll bring you a drink!  If you have a problem with either one of them, you must be a real jerk.\n\nI give this course five stars.  Why, you might ask?  It is the perfect metaphor for the existentialist hell that is my life.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-27", "description": "Arguably the worst golf course I've been on.  When we got there, we noticed there were no cars.  Score!  Then we were informed that the greens were being resodded and that there would be temporary greens (basically carved into the fairway just before the actual greens).\n\nStupid of us to try it.  $20.50 for the horrible conditions.  Sure, we're partly to blame for trying it out when the GC wasn't in its best state ... but seriously, there was no point in putting b/c the \"temporary greens\" were pretty jacked up.\n\nOther not-so-good notables:\n- Still charged us the full amount for green fees.  Seriously, I wonder if this would have even been worth it if they had said we could walk on for free.  We didn't even finish the 9 holes ... we left after 5.\n- The fairway on Hole 3 or 4 is literally a dirt path.  \n- Twice I hit shots perfectly down the middle of the fairway ... only to lose my ball b/c it got lost among the white flowers/overgrown crabgrass (on the fairway!)/soggy mud.\n- The projects are literally right next to the GC.  I don't really have an issue so much but the barbed wire separating the two really did not add to a pleasant experience.\n\nSeriously, was this at one time considered a great public course?  Hard to believe.  And sad.", "author": "F. P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-30", "description": "Currently this course has trashy greens.\n\nIts a great course for beginners because it is usually empty so you can take all the time you need.  \n\nBe careful because some of the holes are right next to the SunnyDale projects. Only a fence separates you. \n\nIt was a pretty fun time golfing GlenEagles.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "This is the best golfing experience that any of our group can remember. Tom & his group have done an outstanfing job. Lisa always makes our day the very best. The service level is unparalleled @ any other course that we have ever visited.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-29", "description": "The squeaky voiced girl was trying to be nice but she was too drunk to make any sense. I think her name was Leslie. We paid the 18 hole fee but quit after 9. The only grass we found was on the greens and my hubby found a 1/4 of a joint in the filthy golf cart. There are no fairways @ Gleneagles!! Dirt and weeds is what you'll hit from. Both bags fell off the golf cart when we hit the hidden moguls on the cart path.\n(CARTPATHS??)\n\nIt appears who ever is running the place is getting ready to shut it down for good. In the meantime like the other poster said \n\n \"AVOID.\"", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-01", "description": "If the Greens were taken care of, this might be a 4...\n\nBut they were DEPLORABLE. Don't know if it was a fungus, or simply failure to water them. \n\nUnlike others, I like the local feel and I felt like the fairways played nicely. Wind was howling through the Cypress trees and it felt like golf in San Francisco. Yes, I heard gunfire too in the distance...but I wasn't too nervous.\n\nThe owners need to address this pronto! A SF experience is going to be ruined forever if they don't wake up.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-29", "description": "Boy... this is a tough choice between 1 or 2 stars.  Since my round didn't involve gunshots, I'll give it a 2.  \n\nI finally decided to take the dive and check out the illustrious Gleaeagles Golf course.  I felt like I was driving to an abandoned military installation... but once i parked and looked out onto the hill, it made more sense.\n\nThe clubhouse is all that has been said before... a dank and dusty bar.  I made the mistake of going into the bar expecting to pay for a tee time and be shown to the 1st tee.  After looking around dumbfounded by the missing pay counter, I heard another golfer walk up to a small cove in the side of the building and get started.  I walked into the cove, paid and was told \"play one ball and absolutely no practice allowed\".  I also noticed signs that told you where to practice swing, etc.\n\nThe course is a track of long narrow tree-lined holes with raised greens.  Accuracy off the tee is a must and the trees are always there to knock down your shots.  Yardage markers were not easy to find on most holes.  Great place to practice those long irons, punch and flop shots.  The greens are fast and some have invisible breaks.  On most holes I reached the green ok, but putting killed me.  \n\nAt the end of my round, I really wanted to stay and get loaded on cheap beer... but it was only 11am.\n\nThe fairways and greens deserve 3 stars, but -1 for the neighborhood & bad quirks.", "author": "Brad K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-28", "description": "This is a pretty difficult course considering it's only 9 holes and in the absolute worst neighborhood in the City.  I swear every single hole is a tree-lined monstrosity, with extremely narrow fairways.  To boot, the greens are super slick and you've got to be very accurate, less you end up playing military putting (left, right, left, right).\n\nIt's a good golf workout, if you will.  It's what we golfers like: challenge, well laid out, and able to get some food & beer afterwards.  Oh, and cheap.", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-03", "description": "This is an excellent 9 hole course to practice on.  The levels range from moderate to difficult.  It was helpful that the Green Keeper mentioned the balls tend to roll towards the bay, and the greens are fast.  All true things.\n\nAlso bring EXTRA BALLS.  There are patches of tall grass/weeds in and along side of the fairways.  \n\nThis is the kind of course, where you can practice your driver, woods and irons.  You can actually play 18 holes by circling twice.  \n\n9 holes is $17\n18 holes is $25", "author": "HY L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-09", "description": "My buddies and I have been playing golf at Gleneagles golf course for over ten years.  It is a public 9 hole course that is, frankly, downright hard.  We had boasted about the course to the non-initiated many times and a few weeks ago took one of our buddies who had never played there, expecting he would be impressed.\n\nSURPRISE: the course was absolutely a hole; tees with two foot high weeds growing on them, fairways with huge brown spots.  Unbelievably bad; surprisingly, the greens were in great shape, which made no sense given the extreme state of disrepair on the rest of the course.\n\nI will miss it, but until I hear that they have done something to assuage the deterioration, I will not go back there, it was so painful", "author": "Tim H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-07", "description": "Good golf course, but sometimes not taken care of properly. It is difficult and its a good place to run up the  score. There was a time where there was affordable twelve and eighteen year old scotch in the club house, but alas no more. \nThe good part is that it is not often crowded and it is challenging. I would play here more frequently if I had the game and they had the scotch.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-31", "description": "I just got an email from GE to write up a review. They mention that \"\"\"A look at the recent reviews on YELP! show that some golfers are still loyal to over watered golf courses and cannot contend with tight lies or firm and fast conditioning. \"\"\"\"\nNow that may be true about the greens, which are fantastic and have held up nicely in their first year.  But it seems as if most of the negative comments here are just about upkeep. Which I whole heartily second. This place would be a true gem if the fairways, tee boxes  and bunkers were at least decent. You can really be penalized here for a good shot. It's pretty brutal. That being said, I give this place 3 stars for the price, the greens, the very nice staff and the history. I actually really enjoy playing here. You can walk on and get off in about 90 minutes. It is a great place and I would say a must play for all SF and surrounding area golfers. If they would just smooth out the fairways, get some real tee boxes [ and signs for that matter ] and fix the bunkers it would be a 5 star.", "author": "garth s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-29", "description": "CLASSIC is the word to describe Gleneagles.  No better word.\n\nThe pro shop doubles as a bar.  Yes, you essentially pay your green fees to the bartender, so why not have an Irish coffee while you're at it.\n\nThe course is extreme.  You have to have the right attitude about your golf there.  It's really about survival, as opposed to making a good score.  The course is sort of tricked up with some extreme slopes on the greens, and depending on how the greens-keeper's meds were going that week, there can be some truly evil hole locations which make for 4 putting.\n\nRumor has it that a famous PGA player once stormed off this course saying it was set up unfairly.  Duh.\n\nLocal tip (this is serious).  Everything breaks toward the Cow Palace.  And, don't bet against the locals.\n\nIt's a hard place to find, if you don't know where you're going.  It's hard to find even when you do know where you're going.  Love Gleneagles.\n\nPost Script:  My favored Gleneagles wingman (glenfecals is his name for it) reminds me to tell you to look into the mayo-slathered ham and american cheese wonder-bread scoobie snack before you make \"the turn.\"  [The turn to play the same god-forsaken 9 holes again (albeit from a second set of tees).]", "author": "Brad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "Golf. Just pure, test-your-skills golf. The super-low green fees go to beautiful greens and newly seeded tee boxes. No drinking fountains or cart girls, thank you.A no-nonsense bar with great prices and straight-forward (no bs) bartenders.\nNo whining!", "author": "Chris E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "Gleneagles is a very very tough course. I love it for a few reasons. Everytime I go here its always empty. No waiting at holes or people waiting for you. its tucked away in a mountain, and also its cheap. I will tell you though, its very easy to lose balls here. every hole is unique. theres 2 par 3's, 1 par 5, and the rest par 4's. i highly recommend anybody to play this course who thinks there descent at golf and come get ruined out here. for those who love to have a few drinks after playing golf with quite a few drinks already, like me, they have a good priced bar at the clubhouse . . .", "author": "Colin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-13", "description": "Money back please!! I've played on many courses from muni to country clubs nationwide. I have to say that this course is by far one of the worst courses I've played on. \nI arrived at 7am to walk on and had to wait for the proshop to open. \nThe fairways (if you can call it that) had weeds growing on it. \ngreens were rolling a 7 if that! they were lengths of a normal courses 2nd cut of a green (no exaggeration) \nI think the course definitely has potential to be really nice. If maintained by the course and players.The up keep on this place is disgusting. \n$38 bucks for a non resident is a great price with cart. But not worth it for this course. I've played extremely nicer munis for that price. \nyou get what you pay for", "author": "Steve K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-24", "description": "Wow, are those pictures a huge lie.\nThey practically put sticks in the ground and call this a course. There is not tee box, its just dirt.\n\n1 star for brand new greens.", "author": "henry c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-24", "description": "I didn't actually get around to playing golf.  After driving through the neighborhood to get here I was thoroughly shocked by the ghetto.  I read a few yelp reviews from the car to make sure I wasn't overreacting, and I left.  Not worth it for a cheap round of golf.  Maybe next time I'll have more courage to stop and play because some of the pictures make it seem like the course is nicely maintained.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "Any golfer that does not enjoy a game here is not a golfer and should have their clubs taken away. Absolutely terrific. Ambience, character, classic. \n\nAlso, anyone thinking of joining a private club should be required to play here for 10 years so they can truly gain an understanding of what golf is all about.", "author": "M D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-31", "description": "The Greens are great!  The people who work there are great!  Unfortunately, that's all I can say.  I've been playing at Gleneagles for about 20 years.  It's always been a little rough around the edges.  That's been part of the charm.  But now it's everything from the tee boxes (mostly dirt) to the fairways and don't even get me started on the bunkers...", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "It's a good golf course that is reasonable priced - under $30 during the weekdays and $31 during weekends, for 18 holes.\n\nThe holes themselves are varied - two long par 5s and a handful of par 3s.  There are slopes, ridges and a lot of trees to keep things interesting.  The greens are kept-well and the fairways are mostly clean.\n\nOnly downsides:\n- there are nine holes, that they double up to make 18 with two distinct tee boxes.  It works, but definitely ask about it if its your first time.\n- that said, this isn't a course for beginners at all - there's no shorter tees for women or higher handicaps.\n- place is a lot faster on the weekends, especially when you come around for your back nine to the same hole others are starting on their first.", "author": "Don B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-28", "description": "DO NOT PLAY HERE. I was unfortunate to pay to play 9 holes here. The greens are lost and gone. \n\nVery very sad to see what I used to consider a true gem of a course to be completely lost and unplayable.\n\nAll the greens are basically gone. (little to no grass left).\n\nI hope there are some plans to fix this place.", "author": "Darren E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-26", "description": "Inexpensive golf in the city, almost never a wait, and playing with the old timers who love to take my money. It is classic, I hope the kids in the ajacent apartment building are lighting off fire works and those are not gunshots. I wish they would dump a little more money into to try to keep it in better condition, the layout is great, very challegeing, never a flat lie.  It is one of the best places to introduce a person to the game, there is no pretense when playing Gleneagles, you play for the joy of the game! \nOh and cheap drinks at the bar.", "author": "michael h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "Gleneagles is a great value at ~$20 for 9 holes. This is the only place in the city where you can show up without a tee time and play a 4 hour round.\n\nThey have made a considerable effort to get the course in challenging condition with the installation of new greens in the last year. The people here are amazing and I've always played with true lovers of the game here.", "author": "Theodore C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-29", "description": "This is a golf course that presents the most difficult of challenges as well as the most impressive of dynamics with a great clubhouse and bar, great management, great conditions and the coolest regulars.\n\nI recommend it highly to beginners(NO SLOW PLAY ALLOWED) and scratch golfers alike.\n\nI would also like to add that IZZY Taguchi, the GM, is one of the best and he intends to bring us the best golf experience in San Francisco.", "author": "sadao n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-01", "description": "Gleneagles gets a four!  Why, you ask?  Well, Drew S. would tell you that it is because I give everything a 4.  He might be right...\n\nHowever, there is more to the story.  Gleneagles is just funky--mostly good funky too.  I dare say I have never played a course quite like Gleneagles.  As others have noted, the bar doubles as the clubhouse.  I have no problem with this.  It is between 15-18 dollars for 9 holes.  Again, no problem with this.  \n\nThe funkiness continues with the incredibly strange and challenging layout of the course--on several occassions I nailed a drive down the middle of the fairway, only to see my ball land and roll helplessly into the rough, scores of yards from where it landed.  \nThe course is not perfectly kept--by a longshot.  But it isn't too shabby either, being what it is.  And yes the projects are there, but what can you do?  It's the City.  \nHit this place up for a unique round of golf anytime.  I was there this morning and there was no wait.  Sure...maybe the first 3 holes were played in a fog so thick I couldn't see my ball once it traveled 20 yards away...but that's part of the funky goodness of this place.  \nI will be back for sure--hopefully often.\n\nUPDATE---UPDATE\nNow having played Gleneagles many a time, I have to change my review.  While I still appreciate that quirkiness of this course, and while I still love that it is a challenging layout and all that, I have to knock the place one star.  Cause it just isn't a fair course.  It isn't that it is hard and that I am a bad golfer--mean, both of those things are true.  It is just that the course is just poorly kept up enough, and just a bit of enough of a mess that it seems to triple the difficulty of the place to a point where I'm not even sure it is fun at times.  So call me a pussy, go for it.  I just can't give Gleneagles 4 stars.  I REALLY want to, but I can't.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-10", "description": "Overall, the course was in good condition, but many of the greens were brown and missing grass. Although it is a 9-hole, it was challenging even compared to high end 18-holes. Rates are reasonable.\n\nThe reason I gave this course one star:\n\nNot being locals or regulars of this course (not even from the bay area), my friend and I contended with hostile regulars and poor customer service at the makeshift pro-shop. We were harassed by locals for not driving our cart on the cart-path. Although we immediately obliged, other locals yelled at us from nearby holes even AFTER we stuck to the path! It's almost as if they all colluded. Then, the pro-shop attendant yelled at us, called us yahoos (I couldn't believe that any employee who is paid by my fees would call a customer this) for the same thing, and even accused us of disrespecting the game! All of the courses I have ever played allowed carts on the fairway. We committed this small mistake and fury fell upon on us from every which way! \n\nI have been playing nearly 15 years, I play every week, and my handicap is 7... I would say that I have nothing but respect for the game. \n\nThis is based on the experience of two \"yahoo\" visitors from out of town. I hope your experience is better if you decide to play this course.", "author": "Anthony F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "Today was my first experience at Gleneagles.  Sure you have to drive through the low income housing area, but I experienced no problems there during the day.  We were playing golf and the tenants there were doing their own thing.  The course has been redesigned on some holes and new greens on others.  I am a beginning golfer so I found the course to be challenging to say the least.  What I liked the most about the course were the trees.  Quite beautiful.  What I liked least about the course were the out of bounds (where I hit my balls most of the time).  I had to hit out of tall grass, wood chip piles, trees, etc...  The fairways were ok but I wasn't expecting this course to be immaculate.  The sand traps were packed so I found it easier to hit out of them than other courses.  As for the greens, I found them to be slower than what I play on at Mariner's in Foster City.  Finally, I would also like to comment that I play 18 holes.  It is basically the same holes on the back 9 but just different starting points.  Oh yea, sometimes it was difficult to find out where we were suppose to tee off because they are not really clearly marked.\n\nOverall I had a great time and would come back again in a heartbeat.  This course is about 10 minutes away from my office.", "author": "Brent T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-14", "description": "Bring your \"A\" game if you intend on playing this course. I actually lost a lot of golf balls in the trees when I played a recent round there.\n\nThis course is a challenge for a high handicapper like myself. Reading the greens is a challenge. Keeping your tee shots on the fairway pays off handsomely here as going into the rough will cost you serious strokes to your score.\n\nBring extra golf balls, because if you have a high trajectory like I do they tend to get caught up in the trees. It is a well maintained course and tee times are readily available. I don't think it's the best place for the beginner rather come back after you've mastered or at least have the ability to do some good course management.", "author": "Mario O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "Try to drive in/out from the 280 side.  Coming in from 101 will make you lock the car doors and hunker down in your seat in an attempt to avoid random gunfire.  All this for a round of golf....\n\nSo, why 4 stars?  This is a really neat little course.  I'm puzzled by the comments as to how difficult the course is.  There are definitely a lot of sloping fairways, but if you use your head and always aim your tee shot for the high side, you will end up in good shape.  I think the other problem is that there is only one set of tees for the Front/Back 9.  There is no \"white\" or Men's forward tee.  Those not used to playing \"blue\" tees or from the tips will definitely struggle out here.  \n\nOne neat thing is the similarity/difference to the Golden Gate Park course.  There, the bartender is the course manager.  At Gleneagles, the course manager is the bartender.  VERY important difference for those of us who enjoy a drink or two and chatting about golf.\n\nDid I mention the insanely cheap rates?", "author": "Robert M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-07", "description": "15 years ago.....in a galaxy far, far away....pull up to Gleneagles in the hooptie, where it was locals only,  spank a few greenies, knock a couple down in the bar, hit the nine again..repeat...\nHere are the Directions to the course for you Yelpers, since Geneva Towers are no longer, I can't give you a landmark...you're like....Geneva \"chika what\"?\nOff of Bayshore Blvd, turn onto SUNNYDALE AVE, roll downs windows, crank up your stereo, with bluetooth in ear...Have a nice ROUND!;)", "author": "Kool K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "I discovered this place ten years ago and have played it every Thursday\nrain or shine for the last six years.\nThey have nine brand new greens which have matured nicely and roll as true as the best in San Francisco. It is a tough course that is why all the low handicappers play there. The pace of play is fast, no reservations during the week just walk on. The bar is great and I have sunk more pints\nthan putts.\nWhat more can I say", "author": "Louis D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-16", "description": "Great tough course in a pretty tough area, but it's easier to find now that the sign has returned!\nOld school bar & attitude...No driving range and usually no waiting around. You need a positive can-do mind-frame to survive here since it's a very tricky course. Plenty of chances to use all your clubs and interesting shots from either set of tees.\nMy advice, just bring extra golf balls and keep things moving along, people who play here like it that way, so please don't spoil a good thing.  The course can either be in great shape or dusty and windy...but just take it as you find it since it's a real bargain. \nHope you enjoy the experience..", "author": "Rory F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-23", "description": "Not four stars for the condition of the course; four stars for the experience of completely unstuffy golf.  I would not recommend approaching this course through the middle of the Sunnydale projects---this way, trouble lies----rather, come at the course from the other side, up on the hill through John McClaren Park--that would be a lot safer.  \n\nBuy a pre-made, plastic wrapped sandwich at the bar ($3.50), add a soda ($1.50), pay lunch time greens fees ($15 a piece if you're walking---and you should walk) and enjoy the randomness of it all.\n\nThe first hole has a ridiculously well defended green that punishes any approach shot that is even a little off.  The second slopes off to the right (so does the first, actually).  The third gives you a great roll if you can keep it in the fairway, but the backside of the green is treacherously contoured; the fourth is straightforward.\n\nHey, this is golf at its most elemental in the Bay Area.  Play this course and think to yourself not that you are playing on a poorly kept, severely sloped course but rather, you now know the challenge of playing a true links course.\n\nGotta love it.", "author": "Roger W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-28", "description": "Excellent course. A Fleming Design from what I hear.\n\nWith the exception of a 600 yard monster it is not particularly long, and thus scoring potentials all over, IF you can hit narrow, tree guarded fairways and elevated greens from side-hill lies. It does play up hill and into the wind.\n\nFairways are in \"good\" shape, greens are fast and hard with severe breaks and a few double tiers. Never furry. \n\nThis is as true and challenging of a \"shabby\" course as I have ever played. Bring your accurate set of clubs.", "author": "RealGdog G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "$20.50 for a fairly challenging round of 9 hole golf. The pace is good. The greens are sometimes sanded.", "author": "Saquib P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "I've been playing Gleneagles for a number of years and have seen it go through a number of reincarnations wondering when they were going to get it right. It's always had the pedigree i.e. great layout, a challenge, use every club etc., but for the past few years it lacked what it was once well known for...killer greens, the likes of which golfers travel distances to play on. Well, Allelujah! They're back! Fast, undulating (without being tricked up) and consistent...and I'm delighted.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "*******Gleneagles=Man Course\n\nFirst things first, 9 holes took almost 3 hours.  A ridiculously hard course this one is.  Lots of rough patches, downhill slopes, quick and bumpy greens.  \n\nSecond of all, this place is in the ghetto.  Golf and ghetto are usually two things I do not equate.  On the fourth hole, you get a nice view of the housing projects.  I think the project folk, where also having a minibike race the entire duration of our round.  \n\nSo back to the course.  The course itself wasn't in particular good or bad shape.  I liked the fact that there was no pretentiousness while playing.  The clubhouse was super old school, with the only exception of a hd tv, this place was out of the 50's.  The course was also fairly priced and there wasn't a whole of waiting.  \n\nThis course a lot of \"mansize holes\".  A few of them were over 500 yards and one was over 600 yards.  This was a great place to try out a fairway driver/hybrid club.  \n\nAll in all, this course was very challenging for a beginner and veteran alike.", "author": "patrick o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "The Toughest 9 in the World\n\nI am a hacker and a half and shoot 50-55 for 9, yeah thats right and I feel good about it because sometimes ill shoot 60+ here\nWhenever I think I'm hittin en good i come here for a little humbling. I shot a 45 a couple of year ago and still talk about it\n\npeople bitch about the condition, the projects, the slope, but what they really mean is \"THAT COURSE SCARES THE SHIT OUT OF ME\"\n\nthe condition is like any links style course, the greens are almost always in good shape, $15/$18 for nine, hardly ever a wait, yeah sometime the Dboys in da PJs are loud but they wont bother you.\n\nI bring all out of town golfers here and they love it (or hate it...but not really). \nA SF MUST DO if you golf\n\nJust hit it straight and long, place your approach shots right and dont three putt and you'll do just fine and remember EVERYTHING rolls toward the Cow Palace", "author": "Scotty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "Glen eagles is my favorite golf course, yeah you can love the Presidio or Olympic club but do they have the charm?  Do they have character? Do they have Brad behind the bar? Do you even know the bartenders name and does he want to know yours?   These are things that make Glen Eagles the best course on the peninsula.\n\nYes it is not in the best condition, the tee boxes aren't great and the sand in the traps is comparable to playing off concrete eighty percent of the time but you got to love the place.  The narrow fairways lined with beautiful trees and the view of the bay, the vibe on this course of the normal person.  None of the old \"I belong to Harding Park, so respect me young man\", kind of crap that's not what I am here for.  Great holes with tough fairways to hit and even tougher greens and pin positions; this is the course where you can learn to play golf.  With the Green's just having been refurbished they are back in the condition when this club earned it name.  Lightning fast, breaks you just didn't or couldn't see and some good old laughs from your friends when you miss a three foot putt for double bogey.  It is a nine hole course with two sets of tee boxes to make it eighteen, but hey you can't have everything.  It is also a tough course to walk vey hilly and undulating, which is great because every shot will be above or below your feet (Just Kidding, makes it hard as Kevlar)\nMost of the reviews I have read always mention the projects next door so I feel like I have to also, and have to say in the 5 years of playing at this course have never had any problems at all not even a whiff of trouble.  We do our thing and they do theirs easy as that.\n\nThe 19th hole is a place of wonder where the bartender (Brad or Lisa are my favs), knows your name and what you drink, who you like to play with and how fast you play everything to give you a good round.   The drink prices are cheap and they always have a good heavy pour.  They just put in a flat screen so you can watch the game and check the scores while you buy booze at the turn.  When the T.V is off they play Jazz, you could just stop for a drink here and not play the place is that cool.  I always imagine it as the bar the Chevy Chase and Rodney Dangerfield would hang out in if Caddyshack had a bar scene with just the two of them.\n\nI know quite a few people who have lived in the neighborhood their entire lives and have never even heard of Glen Eagles so to say Hidden Gem of San Francisco could be an understatement.  I highly recommend you play this course, you will shoot a hundred and ten on you first round but you will have a good laugh and if you get paired with me I might even tell you the secret of the course, but i won't buy you a beer well maybe!!!!", "author": "Nik C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-06", "description": "GlenEagles is a good course to play if you've only got a few hours to spare and you don't have a teetime nor do you want to trek too far outside of SF to get your golf on.  That said, the conditions are definitely lacking.  The rough is just someone's backyard turf, the fairway isn't particularly well kept, and the greens, though undulating, are bumpy and slow.  The course will definitely test you though - the holes aren't too long, but the layout is challenging and the fairways are narrow-ish.  All in all not a terrible 9-hole experience, but nothing to relish.", "author": "Susheel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-23", "description": "Threadbare course with a lot of \"bald\" spots.  Don't let the picture of the 9th/18th on the Yelp page fool you; it does *not* look like that.  If you like to play off dirt a lot (even when you're in the fairway, or around the green), then this is the course for you.  As a bonus, greens are  . . . . bad. \n\nWorse yet, the last time I played there, around the fourth hole green near the Section 8 housing, we heard a number of what sounded like gun shots off the east part of the third hole fairway, followed five minutes later with a gang of kids running across the course and right through our group. They ducked through a hole in the fence, and disappeared into the housing, while a few minutes later about a dozen cops with guns drawn (yes, *guns drawn*) ran after them, also running right through our group.  Bizarre and obviously unsettling.   Really.  Not kidding.  No Joke.\n\nCheap course, sure, and I've tried it several times, but apparently you may take your life in your hands to play golf on a very worn and poorly maintained track.  I'm a \"local\" with a resident card, but I'm not interested in playing there again.", "author": "FSK F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-14", "description": "2009 - Gleneagles is in its best shape in more than a decade!!! \nMy previous rants about fairway conditions and garbage seemed to have been heard. The fairways still have a few marginal areas but the garbage is mostly gone and increased police patrols seems to have quited down the ghetto a tad.\n\nJohn Fleming would be proud. \n\nI think the course superintendent knows the President's Cup is coming to SF in OCT 2009. \n\nFairway distance markers are still sparse, with usually the lone center fairway \"sprinkler cover marker\" present, if you can locate it. Red (100yds) and white (150yds) posts on the center/edge of the fairways would seem to be an easy fix. \n\nIf its not a drought year and the course conditions continue to be this good until the President's Cup, only golfers who want to a real challenge at a reasonable price (now $17 for 9 on a weekday) will miss out if they don't make it here by this fall.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-04", "description": "Sherman, set the wayback machine for 1951.\n\n--The sound of metal spikes on concrete.\n--The old gas carts that choke you to death.\n--The preoccupation with single malts and cigars.\n--And the unkempt pro shop dog that eats gopher guts on any given fairway.\n\nWhat a great place to drink and drive!", "author": "Steven M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-09", "description": "This is more of a fun challenge...and NINE holes...I'm in...yippeee.\nJust wish I had a more powerful hit for the range. I don't like the idea of being by Brookdale and there isn't even a BROOK, as far as I can tell.\n\nGleneagles Golf Course (9 hole) is located in McLaren Park at 2100 Sunnydale Avenue, between Brookdale and Persia Street in San Francisco (415-587-2425). This challenging par 36 course designed by John Fleming and opened in 1962 is 3,195 yards long and is a hidden jewel with beautiful vistas located in the far southern part of the City. This nine hole course can be played as 18 holes from different tee and pin locations that challenges even the most astute golfer. The course is moderate to heavily forested and located on rolling and sometimes steep hills. Tee time reservations can be made by calling the golf shop.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-12", "description": "This is the worst golf course I have ever been to.  The course conditions look nothing like the photos.  The fairways are not well maintained and are barely covered with grass.  their website says that the course was rated one of the top 20 9 hole courses in the US in 2010.  If so, then the course has gone way downhill since then.  I will never go there again.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-16", "description": "Played here a few years ago and came back recently.  I didn't realize how bad shape the course is.  I guess the first time I came I was just beginning so I didn't know any better.  This is an extremely difficult course and just not fun to play.  The greens are crummy and the fairways aren't in any better shape.  The fog was starting to roll through just after I teed off and the wind was kicking like crazy.  I played two holes and decided to call it quits.  Do yourself a favor, play a course like poplar creek 15 minutes south and enjoy playing golf rather than just being frustrated at this god forsaken course.  The staff was always pretty dumbfounded and just plain depressing, its like stepping in the twilight zone.  One last note.............. If it is in the ghetto then you can be sure that this course represents the section 8 neighborhood around it!!!!!!!!!!!!!!!!!!!", "author": "Pedro N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "To be enjoyed by a golf purist would be one way to describe the venue: old school, authentic club house, raw, pure and challenging golf. For no extra charge, a group of golf junkies one should expect to find at a place like this. Mess up, and they will let you know.\nIf you are into golf, this is the place. If you'd rather sip a mai tai under an umbrella, then head west my friend.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "Gleneagles is a beautiful, extremely reasonably priced course. And it is challenging and frustrating beyond belief. Last time I played here 2 weeks ago, my foursome unanimously decided to walk off after the 5th hole(it's right at the parking lot). We were all getting our asses handed to us by this place. Luckily we had brought beers along to make it a little less painful.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-23", "description": "Very difficult indeed. Has the feel of a \"real\" golf course for 25% (?) of the price. Yeah, some things aren't as groomed as they should be, but if you're looking for a genuine challenge, Gleneagles will provide one. No pretensions, just golf. Windy, foggy, rolling, tilted curse-inducing golf.\n\nThe projects, which are nearby, really don't factor in to your golf game. I personally wouldn't worry about their proximity.", "author": "anon m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-05", "description": "This is a 9 hole golf course that you can go around twice and make into a full 18. It's actually a decent course despite having to drive through the Sunnydale projects to get there. I think it's because of the sketchy location that it so easy to play. I've never had to wait. The course literally borders the projects and I've heard that some people have been jacked while playing. So break yo self fool and play some MUTHAFUCKIN' GIZNOLF! Don't play here if you don't have street cred.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-04", "description": "Well rating this course was somewhat difficult for me.  I always enjoy myself and have never had a bad time here so I feel a 4 star review is in order but I just can't rate this place 4 stars.  The reason being it is just not up to par as far as the grounds are concerned.  I really like the play and layout.  It is very challenging and fun to play.  The cons would be the rough along the fairways is not kept at all really and the tee boxes are most certainly in need of restoration.  This is not to say I won't be back.  I really do enjoy playing here and will keep Gleneagles on by places to play list.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-04", "description": "my experience at Gleneagles Golf Course-  \n\nthis was my first time to go....i looked at the pix on the website...they looked pretty good....\nwe drive up , and the first thing i see before we pull up to the pro shop ; an abandoned couch with some homeless dude sleeping on it....\nahhhhhhh.....how relaxing!\n\nwe go into the proshop, which is actually not a proshop at all...its an old gross bar.....and the best thing? you pay to play your game at the bar...haha....wierd\nthe guy was totally rude, acted like he was going to give me a patted down search coz he was so obnoxious about the rules....\nanyhow, we get out to play golf....the fairways looked good, but the surroundings were nothing but unmanecured shrubs.....the cartpath is also a dirt road , instead of a paved cement.....\n\nthe Tee markers were painted pieces of wood, the dirt fillers were in old gatorade plastic bottles, and there were no yardage posts out on the fiarways....\n\nalso, by hole number 5, the fairway is parallel to the projects of san francisco....there were little kids yelling at us, trying to sell the golfers clubs for 10 dollars while we were trying to make our shots....God love em, but not while i am playing golf.....\n\nthe only reason this place gets one star, the fairways were good, and the greens were pretty fast....\nother than that, the experience doesnt even deserve a star\n\nall in all, i was very anxious to leave and go play a better golf course....\n\nthis place is a total dump......and i am not exagerating......\n\nthere are much better courses in SF for the same price, so please, go try those....", "author": "Sonic B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-31", "description": "The guy says that we can't play the course because we don't have golf shoes. He says that ever since that tiger attacked that guy at the zoo, the city has become really strict on safety and they don't want anyone getting injured on the course. I thought we were on Candid Camera. I don't even golf that much but I've been on golf courses better than this one and never have I been turned away for lack of golf shoes. What a joke.", "author": "Pizz D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-03", "description": "If the greens would not have been so good, I would give this place a one or two star. First, i think we came at a bad day because the guy in the proshop/bar was in a very bad mood and very unfriendly. Secondly, you lose so many golf balls, it doesnt matter if you hit a good shot or a bad one, chances are high that you wont find your ball again. On the plus side, the greenfees are reasonably priced and yess the course (in the forest) has a lot of character and I really think the greens are amazing.", "author": "Remo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "It's impossible to beat this place for the price and ease of just walking on without a tee time.  And when you factor in the hills, wind, bumpy greens, and generally shoddy maintenance, it's really hard to score well here.  The sunnydale projects add to the allure.  Great place to play.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-02", "description": "Everybody knows about San Francisco's Harding Park Golf Course, but SF's hidden jewel is Gleneagles.  18 holes, $31.  No water hazard, but plenty of bunkers to keep you busy.  Don't mind the projects you'll have to go through to get there, it's not that dangerous.  Sure, on the way home I saw a girl gang fight and the police came, but that just adds to the character of the golf course.  If I had known about Gleneagles during summer I would have stopped by on the way home for a quick 9 holes ($16).", "author": "Tinou B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-11", "description": "This place is tha bomb!  Seriously!  Great deal!  14$ for 9 holes with a resident card...well the back 9 is a change in tee box but you can't beat the deal!  There are 2-3 holes that are 450+ yards, so you get to use your driver a ton.  Not bad for less than a price of Executive Course.  I have never been there and had to wait long...9 holes done in less than 2 hours and I have never made a tee time.  The only downside to the place is that you are at risk for getting mugged.  Notice how I still give it 5 stars though.  It kinda adds excitement to the game of golf!  It has all the components I look for:  cheap, challenging, quick and exciting.", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "Up in town last week and the place is looking better than ever. Greens amazing, the new first hole just stunning. I didn't think I would like the NEW first but it is actually much better. You have more fairway to hit and still have a shot at the green from all parts of the fairway, unlike the old first green. Get out here before some magazine writes an article on how great it is and it will be packed.", "author": "Jack M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-31", "description": "Overall: One of the most casual, laid back, but still challenging courses I've played.  A good value and a challenging course. \nPros:\n- always can get a tee time, even on the nicest day of the year I only waited 30 minutes with a threesome\n- good price\n- difficult layout, usually nine hole courses are terrible boring 350 yard par fours with no challenge, Gleneagles has a large variety of holes - changing elevations, difficult approach shots and guarded greens (not too many bunkers though)\n- close to the city\nCons: \n- sometimes too casual, limited amenities\n- not that well kept (changes day to day)\n\nIf I'm looking for a quick nine, or playing with someone who's not that serious about golfing this is my first choice - much better than Lincoln Park or Sharp Park.  If I'm looking for a nicer round though, you still can't beat Harding.", "author": "Fred J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-10", "description": "Gleneagles is a challenging golf course.   The greens are in good shape and extremely undulating.  You never have a flat lie in the fairway and the grass is thin at best.  Don't expect any good lies :).  Tee boxes - a bit rough and not very flat.  This is a great course to hone your skills.  Handicaps from this course travel well.   Finally, slow play is not looked kindly upon.\n\nThe bar is great - reasonable prices, old school feel, good selection (especially beer and scotches), no foofy drinks, nice tv (not HD), and friendly bartenders.  A classic 19th hole.\n\nTom S. said it best, this is not country club golf.  There's no bag drop, no pro shop (other then the spruced up closet with shirts, hats, windshirts, etc...), and yes it is right next to the projects.  It's a tough course with reasonable prices, no tee times (except weekends), a cool bar, and unique local charm.  You will either play there once and never go back.  Or, you will play there every chance you get.", "author": "Mason K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-30", "description": "This course used to be feared by many. We used to have a couple of groups teeing up here every Friday morning. There's no such thing as risk reward here its all about how much risk you wanna take on any given hole. The first hole is a good example. After you tee ball settles into a sidehill/uphill lie, your brain just cant comprehend the fact that you need to hit it into the hill next to the green and let it trickle down for the ball to stay on.\n\nI have not played here in the last few years. i stayed away coz I dont need anymore reminder that my game is not good enough for this course. However, on the 28th of April a cool breezy day in SF. I braved the course and told my self. \"Your good enough, your smart enough and gosh darn it you can take this course\"  So off i went to get abused by this course and pay $16 bucks for it. \n\nI was surprised to see the fairways somewhat decent shape, its has grass at least. The greens are looks like it was playable and able to hold approach shots. So off i went on my 9 hole adventure. The course is every bit as difficult with the awkward lies. I was looking forward to the legendary fast greens but it was not there anymore. It was slow and bumpy. \n\nOverall, I played pretty decent got my birdie and pared the monster par 5. Everything else is a blur. I went home a little disappointed that the once mighty Gleneagles once feared by many is now just another 9 hole track.", "author": "luis c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "My favorite golf course in the city. Amazing new bent grass greens have replaced the old ones, where balls could do u-turns. You can always get on, call ahead in case there is a tournament. The staff is awesome. Especially that new bartender Lisa!! The people are laid back and fun. I know word is going to get about this place, and I will have to share the course with more people, but that's ok, you guys will be fun to play with too. Oh and they even have compressed air!!!", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "No frills course that is challenging and for the beginning, you run the gamut of clubs here (vs. GG Park which is all irons).  I have no business reviewing golf courses, but like the vibe, the bar and the numerous cups lined up against the back wall for Liar's Dice.  For a southsider (Noe), this is a hop, skip and a jump away.  Plus you can stop by Joe's Cable Car Burger joint.", "author": "Nate C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-01", "description": "great new greens, cost is very reasonable, demanding golf course", "author": "Tomas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "Update from a Gleneagles regular in case anyone decides to take j.d.j.'s - 1/18/11 review seriously. The new greens are getting better everyday as they continue to mature. It's only been 3 1/2 months since they were put in. Due to recent heavy rains, the fairways have been too wet to mow. Better long grass for a week or two than mower tracks in the fairways. Note to j.d.j. - they're called bunkers and the object of the game is to avoid them. As a resident of the adjacent Crocker Amazon district, I'm also tired of dilettantes coming to our part of the city and complaining about the projects, the surrounding neighborhood, or the condition of McLaren Park. How else to explain j.d.j.'s reference to pitbulls on the course (in 20 years I've never seen one) or his rehashing of a completely fabricated story about police chasing a man with a gun across the golf course? The trashy \"parking lot\" he referred to is actually the bus turnaround area that lies outside the golf property. As for \"many other courses in the area that are in better condition, and dont cost as much to play\", how about naming a few? I can't think of any that satisfy both conditions. I don't care if someone doesn't like Gleneagles - it's not for everybody and that's OK. However, misstatements and outright fabrications like those contained in j.d.j.'s review ultimately reflect more on the individual than on the course.", "author": "Cee J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "Prepare to be humbled. By the selection of Single Malts, that is. Play here whenever you need to be brought back to reality after tearing up other courses.", "author": "DENNIS C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-01", "description": "Spent a lot of time walking on that hillside. Spent a lot of time in that clubhouse. Like so many other San Francisco institutions, once  the torch is passed it's never the same. Thanks for the memories...", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-25", "description": "Coolest Golf experience in quite a while.  The bartender started the day.  We grabbed a couple of dos equis.    I hit a perfect drive down the middle, a wicked 8 iron to the middle of the green.  Some maniacal greenskeeper put the pin tucked way up on top above a 3 foot slope.  Can you say 4 putt?  Nice Double bogie after two great shots.  Welcome to GlenEagles.  Its a very tough track and the putts are deceptively difficult.   The 600 yard par 5 is an amazing touch right after the hole the abuts the Sunnydale Housing project.   I played very well and managed to shoot a 50.   If you loved the movie Barfly, and happen to play a bit of golf, I recommend combining the experiences and bring a small brown paper bag and play.", "author": "chris o."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "This is a crappy little course tucked in Bernal Heights. The layout is very tough given conditions but the greens were recently re-done so are now \"normal\" compared to real golf courses. Everyone is raving how great they are but truthfully they are just decent. They are bent grass so play it before the Poa Annua takes over. Don't expect much course wise - it is occasionally penal and unfair, some stupid sloping leaves even good shots to chance and besides the greens the course is a total dump. Sand filled Gatorade bottles for tee markers. Rough and fairway is indistinguishable from one another. The staff is very very nice, and the price is very very good. Probably not a great idea to walk alone near sunset as the area is economically disadvantaged. For the price, a great place to get in a quick round just to tune up your swing, but don't take the course too seriously.The problem here for the owners is strictly economic in terms of return on investment. I'd still like to see them try and at least do some low to zero cost improvements, like mow the course at different heights in rough / fairway and install some cheap tee markers, and clean up or remove the old signage, etc. Maybe they don't because stuff gets stolen. This course has a loyal following for good reason - it is inexpensive and close to city residents, and definitely has it's own charm. But to be honest and not blindly buy-in to the whole mystique, it is a below average track.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-12", "description": "Played here May 9, 2009 for the first time in 12-15 years. Wow has this place changed!! Obviously joking, nothing has changed much here since maybe the 80's.  Although the greens seemed slower than I remember. Faced with howlin' wind, uneven lies,  slow greens, & pretty brutal 18 hole walk (where all the uphill holes are also into the prevailing wind) the course kicked my ass. But I also had 3 anchor steams & a shot of bourbon (for like $16, a bonus) to take the sting out. The only down side was no food. No burgers, no dogs, no sandwiches, nothing but chips and peanuts. Not a bonus. On the upside they were cutting down a bunch of big eucalyptus trees in the middle of the course, and it looks like they are maintaining the course better than all other SF muni's not named harding park. Best bar/startershack west of the Mississippi! Give it try for $19.50 for 9 holes on the weekend, everyone should try it at least once every dozen years.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-09", "description": "I'm not giving this golf course five stars because of it's superintendent... it's a muni course... a muni course in a city that doesn't allow most fertilizers. This is a five star course because it is all about roots golf. No frills, no bag drop, no yardage books (and yes, not a lot of yardage markers)... This is best stated as a golfers golf course. It challenges you off the tee, makes you think hard about your next shot, has some epic golf holes, some greens that are totally trecherous and is perfect to walk (not ride, never). Also, the rumors are true... it's in the hoods hood, it's totally the \"gauntlet\" to get there (Sunnydale Projects are incredible from an anthropoloigical perspective) and I actually think about what color shirt I wear when I play (there was a shooting when I played last time that made me think twice about a red polo)... but at the end of the day you do not find a place that is a more pure muni golf course. The greens roll true, the company is generally solid and you can jump out on the course, play 18, grab a couple post round beers and go home for about $40... Just don't go if you're playing golf for the social aspect... you'll hate it here.", "author": "Matt L."}
