{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Want a quick slice of pizza that's fresh and has only the toppings you want? Go here! \n\nI stop here for a quick bite or lunch time because it's hidden away so not busy at all during lunch time. \n\nEveryone working here is very friendly too !!", "author": "Muhammad U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Okay, so update: After the failed delivery order 2 years ago, Goat Hill was dead to me--but then one of my friends told me that her boyfriend was completely obsessed with it, so I decided to give it another try. I'm very easily persuaded, I know. \n\nThis time, I actually walked over to the shop to place and pick up my order for a fresh slice. You can add up to 3 toppings to your slice, which isn't bad. It was a pretty big slice too so I felt like my $5-something was worth it. I think the wait was somewhere between 5-10 min. The pizza came out piping hot and the crust was baked to perfection. Oh, it was GOOOOD. \n\nAll in all, GH did pretty well this time. I'm only giving them 4 stars for now because I haven't quite forgiven them for the delivery fiasco of 2016. My heart just can't heal that fast. And I'm definitely NEVER ORDERING DELIVERY AGAIN. Maybe with a few more successful visits I'll learn to trust again--but until then, you're a 4/5.", "author": "Rie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "I've  done eating pizza in a lot of cities but this goat hill Pizza this is the best pizza I've ever had my life and I mean that from the bottom my heart I am a huge fan I will take the hour drive to go get me a pie all the way from Newark Next time I go back and get the T-shirt and a hat I hope they have it", "author": "Jro B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-10", "description": "When the pizza was delivered all the toppings had come off on one corner and it was dripping. The ranch was also missing. After five minutes of being on hold I was told they'll send another pizza but it will be another 45 minutes. This is horrible service. I ordered the pizza early because my 3 and 6 year needed dinner. That plan failed. \n\nimage1.jpeg\nimage2.jpeg\n\n\nSent from my iPhone", "author": "Sweta P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "I've ordered pizza from here multiple occasions, and I always get the cheese with green olives, fresh tomatoes, and red onions, and it is the perfect combination. They usually serve this with feta cheese, but I like it better with mozzarella. I've ordered this same pizza like 3 or 4 times and every time it's been perfectly soft and cheesy, ample seasoning so it's not your usual bland, and a crispy crust (crusty crust?). Also tastes amazing the next morning. Cold pizza fans out there this one's for y'all.", "author": "Farrah N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-25", "description": "Porky pie-- really appreciated the strong use of garlic on the pizza, but could have used a bit more bacon! A bit more sauce to make the pie moister would have been helpful. It was a bit dry. 3/5.\n\nChicken florentine-- this one was more moist than porky pie. I wish the mushrooms had been chopped a bit less finely, but there was a good amount of spinach everywhere. 3/5.\n\nThe crust is thick and chewy. Not burnt on the bottom!\n\nUnfortunately the chicken wing skin was severely burnt, but the meat itself was still moist. Not too much flavor to these though. 2/5.\n\nA 2.5/5 for me.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-19", "description": "I have been meaning to trip this place and luckily I walked by this place by accident. It looked like garage and I'm sure it was. Even though I already ate, I had to grab a slice. I got the slice of the day which was chicken, mushrooms and green onions. \n\nFor a slice it took about 5 minutes to get and I have to say. It didn't blow me out of the water. I love the sour dough crust but it didn't really do it for me here. I love cheeseboard's sourdough bread but this place it was very too crunchy. After I picked up my slice, the pizza cracked in half and it was a big mess. The reason why the pizza's shouldn't be super crunchy is to prevent issues like this. It should be a bit soft so you can fold it and eat it. I literally had to eat this with a fork and the toppings was not the best. The chicken was bland af, mushrooms was okay but the red sauce tasted like it sat in the sun for days. It just wasn't the best. The crust itself was good but just a little bit too crunchy. I probably won't be trying this place again. If you want good sourdough crust, head over to the cheese board in Berkeley.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "I've ordered from Goat Hill a couple of times and each time had it delivered to the office.  One of my employees really likes their pies, so we've ordered from here when we're working late in the office.  The name is catchy and original and I enjoy their sourdough crust.  \n\nMy faves are the Special Combination and Meat Lover's, since the more meat the better.  Their crust is on the thin side, but the sourdough gives is a nice crunch.  They are a bit pricey considering their pies aren't as large as some of their competitors.  \n\nDelivery has always been on-time and the pies are nice and hot when they arrive.", "author": "Lon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "slices quality - 2 star - really tastes just like reheated cheese slices with toppings thrown on top (hence the \"extra crispy crust that cracks\" that are mentioned in other reviews)\n\nservice - zero stars if possible - every time that I've walked up there have been at least 30 minute delays in addition to the normal waiting time needed to reheat their premade cheese slices.  Biggest problem is that staff will tell you to come back in 30 minutes just to make an order only to tell you another 20 minutes when you do come back.  Typically, the response is unapologetic too. \"things happen man.\"", "author": "Michael N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-12", "description": "Ordered for delivery a pepperoni pizza, garlic bread and gluten free pizza with no tomatoes because of food intolerance.\n\nWhen I opened the box, the gluten free pizza had tomatoes all over and the crust is very rubber like.\n\nThe pepperoni pizza was okay but won't order again.", "author": "Elena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "My favorite sourdough crust in San Francisco!  I always get delivery to my work and have never had an issue.  (though Sunday delivery can be a bit of a wait)  Always hot and fresh.  I just like their pizza pie's!\nThanks Goat Hill, you rock!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "Ordered a slice of Hawaiin which is Canadian bacon and pineapple. They gave me a slice with pineapple and bacon, then told me, \"the bacon was from Canada so its cool\". It wasn't, it actually kinda sucked. Plenty of other pizza places in town I recommend any but this one.", "author": "AJ J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I LOVE their Greek salad. My office always orders here when we have staff meetings. Thought I'd try it for myself yesterday. It's definitely in a sketch area (unofficial homeless encampment nearby) and this location is ONLY pickup/order/takeout. No dining area for this location. The guys were friendly, a little jumpy, but showed great customer service. Greek salad (LARGE portion) is $10. To add chicken, add $2. The chicken was dark meat. Probably won't ever add chicken again lol the slice of pizza was $4 or $5. Salad lasted me a long time! They provide a lot of dressing as well so my slice of pizza got to take a little bath ;) would do unspeakable things for tat salad. You can ORDER ONLINE. Slices come with 3 toppings of your choice and are MADE FRESH.", "author": "Tilly D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-22", "description": "Do yourself a favor and go somewhere else. I'm the Head Coach of a baseball team and I entrusted Goat Hill Pizza to provide 4 XL pizzas to my Little League team's end-of-season party. This was like a $150 order for which I prepaid a 20% tip! They failed to deliver the pizzas on-time and when I called they lied to me telling me the pizzas were on their way (which they were not)! 30 minutes after the pizzas were due to be delivered, they finally admitted that they messed up and were just starting to make the pizzas now. By the time they would have arrived they would have been an hour late! Too late for hungry youngsters. Due to this experience I will be telling everyone who will listen, to BOYCOTT every Goat Hill Pizza around. Good job GHP, now a team of young boys know to never eat Goat Hill Pizza. I trusted you, you let us down.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Wouldst thou like the taste of cruster?\nA pretty cheese?\nWouldst thou like to live nomliciously?\n\nI cannot write my spinach...\nI will guide thy chicken...\n\nSame hood delivered 30 mins flat.\nBring floss or don't smile after eating.\nUr possessed by Black Phillip Hill Pizza.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-24", "description": "Work Lunch that was delivered. Tried the pizza with pepperoni with sausage, spinach mushroom and the tomato with feta. All were a little boring and the meat one was the only one to stand out with flavor.  \n\nWish the crust gave more flavor...", "author": "Mei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Simply love this place. Try their Porky pizza. \n\nIt's sourdough crust pizza!! Can't go wrong.", "author": "Steffan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "I usually order pizza from this location however, in many fail attempts, they told me that they dont deliver to my location because the drivers choose not to. it is great pizza but the inconsistency that they have for the drivers to CHOOSE to deliver towards a specific location is ridiculous . I got tossed around the SOMA location and west portal location over the phone many times and they tell me they do not deliver. which restating above, we have ordered many times. I'm flabbergasted about how a business is run, you don't choose your clients, they choose you and when failed to even give proper information or appease, just makes me a bit sad.", "author": "Ray L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "I ordered pizza from here to be delivered to the office for a couple events, and they were great! We ordered a mix of the famous vegetarian (can't remember the name), meats variety and the pineapple ham. The office peeps loved it all, and both times I ordered from here, the pizza boxes were clean gone of all pizza. \n\nEspecially for large parties, ask them to double slice the pizza so that the slices come in thinner slivers, which makes it easier for everyone to taste a little of each type of pizza without getting overly full (maybe more so for the girls, the guys probably doubled up on the slivers anyway ha!). \n\nTheir salad orders are good, healthy sizes that can easily feed everyone - very fresh and yummy too. \n\nDelivery was prompt and the pizzas were nice and hot. I would definitely order from them again for the office and for myself!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "We live just 3 blocks from them so it has been our go to pizza place for several months. We would order online then walk up and pick up our pizza. The first few times it was okay but over time the quality of the pizza decreased. Tonight was the last time we will order pizza from them because it was actually not edible. Save your money, keep yourself from being aggravated and spend your money somewhere else.", "author": "Travis A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "Great pizza to feed a large crowd. I can't say much about dining in, because I've only ordered take-out. The gentleman that I always order from (forgot his name) is very accommodating and delivery is always on time. Note: you may not want to order delivery from this location during a Giant's game. Traffic can cause delays.\n\nI love their sourdough crust and fresh toppings. The Hilda's favorite is always a crowd pleaser. It's a little too greasy in my opinion, but hey it's pizza. The salad bowl with chicken is another crowd pleaser for those who don't want pizza.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Ok, you can not eat here, unless you plan on sitting on a really disgusting city curb.. This is a takeout or have it delivered place.  It is super busy at lunch, but they keep cranking out the pies, in a timely manner.  It is fresh and hot, even if you get the single slices.....They make these things to order, I have no idea how they do it, but it is good.  My suggestion is to call ahead, it will make your life so much easier", "author": "Paul G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "Ordered pizza over the phone and 30 minutes later got a call saying I was outside of the delivery area. I had given not just my address over the phone, but my cross streets as well, to double check. I live in the Castro, so neighbors, don't order from here.", "author": "Lia E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Love this neighborhood pizza place. I'm a member so I get a free PIE on my birthday!! Love em love em love em", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "name is GOAT for a reason. the pizza is hella good. like HELLA good.... and on top of that the workers are hella friendly lol the girl at the register was tight. she ran to open to the door for us. 100 stars if i could. a gem", "author": "Alexandria Marie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Best delivery pizza around! We order goat hill pizza close to once a week and it's the best. Super fast delivery for the most part. Rarely do we really wait the 45-1hr timeline they sometimes quote. \nI love the pepperoni and also recommend spinach and sausage combo. Also the VERY best ranch I've ever had! Yum!!!!", "author": "Michaela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "Goat Hill Pizza was our choice on one work afternoon when most of us were too busy to think about going out to eat for lunch. Nothing like a little pizza to distract you from the fact you are probably working through lunch. \n\nEveryone got to choose what they wanted from the menu who didn't want pizzas, they offer a variety of salads and hot sandwiches as well. We ordered a couple pizzas and threw it all on the company card. \n\nWithin an hour during the busy lunch rush, we got our food and enjoyed our little bit of break with PIZZA!", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "This is not a review for their pizza as I was fortunate enough to actually get any. This is a review for their ability to process a phone order which is a big fat zero stars. I called at 11 sharp when they opened to get pizzas for a meeting that started at noon. My office is a 5 minute walk so I'm thinking this is going to be easy.... WRONG. I show up at 11:45 as agreed upon and the only thing for me to pick up was a blank stare from the lady working the phone as they hadn't made anything I called for. My meeting was pushed late as I was running around Safeway getting cold pre-made sandwiches. Never again!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "I walk up and down 4th street almost every day and I can't even begin to count the amount of times I have had to talk myself out of walking down that shady alley under the freeway to get a delicious slice of Goat Hill Pizza. \n\nOpen until 10pm every night, Goat Hill is one of the only pizza places I know that lets you customize a single slice with any toppings you want. And they have quite a comprehensive list of toppings including feta/ricotta/goat cheese and all types of meats.\n\nAdd on to that the absolutely tasty crust that they have which crunches oh so perfectly and you have yourself a winner. This is by far the best low budget pizza I have ever had. \n\nThey also have free delivery! \n\nOverall I have ordered from Goat Hill many times in the past and I will certainly be ordering from them many times in the future. For cheap, quick and tasty slices on the go, this is \"as good as it gets.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Nice quality sourdough crust.  Tried something new that was delicious - Prochouto, pineapple, and jalapeño on a tomato base.  Excellent!", "author": "Gary K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "I absolutely love Goat Hill Pizza. You're going to think I'm crazy but it's probably one of the best SF pizza's around and I'd argue even beyond the bay. It won't come up on any top lists from Eater or food blogs but I highly, HIGHLY recommend. Get it!", "author": "Diego A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Pizza is bomb! Sourdough crust is fantastic! Slices are cooked to order so you wait a few minutes. Portions are big like Costco sized slices. You won't regret eating here!", "author": "Will S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Crunchy, crispy sourdough crust? Hell yes. \n\nAs a child, I loved Round Table Pizza's thin crust. I hate doughy crust or even just regular crust, which means i never eat the crust on my pizza. But I will eat the crust off a slice from Goat Hill. I also hate it when your crust isn't firm enough and you get a droopy slice or the tip of the pizza breaks off because the dough isn't cooked enough. This is almost never the case with Goat Hill (except when they get busy =/ ) Another thing that's great about Goat Hill is that they make their slices on the spot, so you get a FRESH slice every time.\n\nI typically order the Meat Lover's and it's perfect for those who, well, love meat. It's topped with sausage, pepperoni and salami. You can also create your own slice, but you're maxed out at 3 toppings. You can add chopped garlic for free in addition to the 3 toppings you pick. \n\nIt typically takes 10-15 minutes for your slices to be ready. I usually order 2 and never end up waiting too long.\n\nGoat Hill is probably my favorite pizza place in SF and I highly recommend it!", "author": "Doris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Another day, another place to eat for lunch after work. I  stumbled upon this place a week ago. During the time I thought I was going to try it out but didn't and just kept moving. Today.. I was like I'm craving this place.. Weird because how can you crave something you never had. Lol.\n\nI ordered just a slice of pizza with sausage and bacon. Very delicious and the crust was good. I feel like if the crust of the pizza isn't good, the pizza itself isn't. && For some odd reason I thought it would be an okay pizza spot, but this place was exceptional. I would come back every now and then to get a slice.", "author": "Daryl M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-13", "description": "Terrible customer service and distinctly mediocre pizza, one of the toppings was missing and the base was overcooked.\n\nI ordered a delivery pizza this evening via phone and after placing the order realized the price was totally out of alignment with the website. I called back right away and was informed that the website is out of date. I let them know I was really not ok with that- and they advised me that they would modify the price to the price on the website. The pizza arrived and the price had been reduced by $0.50, not the $4 I was expecting. I spoke to the team again, and they let me know there is nothing they could do, except that I could attempt to email the manager later.\n\nI am unbelievably unimpressed on multiple fronts. The fact that this restaurant can't update the website with correct prices is totally unbelievable, the fact that a manager is needed to modify a charge and one is not on site at all times surely makes running a business somewhat impossible. The incorrect prices are at best false advertising, telling the customer you will modify the price and then doing so by an inaccurate and derisory amount is even worse.\n\nOverpriced, overrated, poorly run, sadly not a good experience... I was given the manager's email to email, perhaps that will garner something... not holding my breath", "author": "Anne Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "These guys' pizzas are amazing. The bread makes a huge difference. Pretty pricey though. \n\nI recommend the pepperoni, jalapeño & red onion. Don't forget the ranch.", "author": "Nasser M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "Good pizza, shady service. Twice now we have ordered a pizza and paid full price, but we're given a size smaller than ordered.  First time a few weeks ago we ordered a medium and we're given a small, and last night we ordered an extra large but were given a large. We did pick up last night so we were able to call them out on it, and made them give us two slices to go to make up for their \"mistake\" which felt a lot more like a plot to save money. I will be bringing my measuring tape into the pick up window for every future purchase from them, I'm not ok with being purposefully ripped off.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "Yesterday I ordered the same \"slice and salad\" special I always order. I was shocked - the pizza barely had toppings and I'm sure the cheese evaporated - for lack of other explanation. I've loved this place for many, many months but a couple more of these and I'll seriously need to question my choices. I understand that they are looking for help, but really - some toppings would be appreciated. I never took past photos, but should have in retrospect. The difference is amazing. C'mon Goat Hill, I can't bring co-workers here on my recommendation and have them end up with this - with Escape from New York and SOMA pizza also a block away, let's keep each other happy !  And an e-mail for contact would be great - calling this in on land line isn't my style - but neither is Yelping a thumbs down in public.", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "Sourdough crust? Awesome!\n\nThis is the one of the best delivery options in the SOMA for pizza. Anybody can buy fresh ingredients but having a good sauce and great crust is a little harder to find. Not only is this a great crust but it's Goat Hill's own sourdough crust.\n\nExcellant. \n\nThere is a 97.8% chance I'll order delivery again. Don't forget to tip your driver well.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "I used to really look forward to getting pizza delivered from here.  I've probably had Goat Hill 10+ times in the 2 years I've lived in the city and unfortunately I think it's getting worse.  The quality is still decent, but not the great quality you might expect for the money, keeping in mind their XL is like a medium or large at other places.   Meat lovers, special combo and hilda's favorite are the ones I like best.  I won't be rushing to order again anytime soon though, especially since last night I placed an order for delivery and they said \"see you soon\"  but it took over an hour and a half and they didn't really offer an apology or anything when I called to check on where it was.  Also a few of the slices were a bit burnt.  Makes me wonder if they forgot about my order and then tried to cook it really fast to make up for lost time.", "author": "george c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-19", "description": "Apparently we are unable to order from Goathill anymore? We always call one, and they transfer us to the other. We live in Mission/Noe Valley area, apparently in the middle of both of them. \n\nToday when we tried to call and order, both of the SF locations said that we were out of their region, when we have ordered from them over 50 times... it's our favorite pizza, just sad we won't be able to enjoy it anymore.", "author": "Nika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "Good neighborhood pizza joint that's been in the same spot in Potrero Hill for decades. Good, unpretentious American pizza that does not claim to be in the style of Naples, Chicago, NYC or whathaveyou. Was there last week and it was as good as the first time I went there almost 40 years ago.  They also have other Italian stuff.", "author": "Lawrence S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-20", "description": "Quality: 3 Stars\nI was honestly expecting more. Good ingredients but average Pizza.\n\nService: 2 Stars\nOrdering was easy and staff was polite. Pizza did arrive in 1hr as promised, however it was COLD upon delivery.\n\nValue: 1 Star\nTotal came out to almost $40 for a 16\" Pizza and 12 Wings. Worst part is product was average and Cold.", "author": "Eforio S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "goat cheese, pesto, tomato.  BAMB.\n\nyou keep doin' your thang, goat hill pizza, and i'll never abandon you.", "author": "Daniella S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-08", "description": "Messed up my order. I ordered a slice of chicken pesto . They Gave me potato and garlic instead...", "author": "Simon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "I've always liked Goat Hill in Potrero for good pizza (hard to find in SF) and a homey atmosphere.\n\nI just tried the outpost on Stillman in SOMA for lunch. Zero atmosphere (which is kind of awesome), friendly service, and a great Italian Sandwich. Why didn't I ever try their sandwiches before? It is like pizza hidden in a delicious sourdough roll that walks the line between soft, chewy, and cripsy all at once.\n\nI'll be back.", "author": "Mason C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "First time at this place i was not impressed since I didn't get to try the pizza i waited for about 10mins and nobody was there to take my order", "author": "Armando G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-17", "description": "Just got my pizza delivered. Huge plus that it came in 30 minutes. Also helps that I live one block from the place. \n\nCons: I order the Porky Pie and added tomatoes. For having a name with Pork in it, I would expect a good amount of pork on it. There was maybe a handful of bacon sprinkled on one or two slices, while most slices were bare.  Also, I asked for Parmesan cheese and red pepper from the delivery guy, he said he didn't bring any. Who doesn't being that on a delivery? Thank god my roommate had his imitation parm... Which I usually don't touch. \n\nTaste: okay. It was edible but after one slice, I was pretty over it. There was no balance of flavor. Just tasted salty. \n\nI would only order from this place again if all other pizza places were closed and not delivering for some reason but even then, I'd just order Thai instead.", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-23", "description": "We all love the pizza - so no issues there.\n$370 order for our non-profit is a big deal - we don't get to do that a lot.\n$16.00 tip (paid in advance) was for an expectation of an on time delivery. We splurged this time as we often go to Costco for cost effective (and good) pizza.\nOrdered online at the crack of dawn for the 12:15p delivery time - at 12:25, I had to call.\nPizza arrived at @ 12:35p... people didn't actually start eating until 12:40p\nAn apology is nice - but a proactive call to let 45 hungry people know they'd be late would have been better.\nAlso, the card loyalty plan has been discontinued. We'd been saving up our cards only to find out they would no longer be honored - most places honor the old system until the last card is handed in. There's a new program, but I don't think we'll be ordering again.", "author": "C S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "I want to try it again but I got a couple of slices to go and it took like 15 minutes. There was a nice guy that offered me water but the lady that took my order was a little rough when I asked when it would be ready, even though I gave like a $2 tip on 2 takeout slices. What bothered me the most was the flies swarming around the inside window seats.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "I love Goat Hill Pizza. Of the pizza places I've tried in the city, this has to be my favorite. \nI feel like the sourdough crust and fresh, quality ingredients combine into the perfect sublimation of what san francisco pizza should be. \nMy only complaint I have is that the fellow working behind the counter (seems like every time I go there) is kind of rude and impatient with the people I bring who actually have to look at the menu.", "author": "Jonny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Went to a HackerX hiring event at Hipmunk in Soma near ATT Park. They had cheese, pepperoni, and vegan pizza from Goat Hill. I had cheese and because it had no toppings, I cannot judge, but it was good and worth eating.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "Pizzas were good and delivered warm, but were really expensive for their size/toppings. Gets a pass for being in SF where your alternatives for delivery are severely limited and everything is expensive.", "author": "Omar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-22", "description": "I've been working in an office building behind the Yerba Buena Center for 3.5 years now and only TODAY I discovered that Goat Hill Pizza has a store down here in SoMa.  WTF..?!?   Why didn't I know about this?  I drive down that street to get to work countless times and it all looks like warehouse space or apartments -- I had no idea.  The only place I was aware of was Escape From NY on Harrison & 3rd and they can make a decent slice, but they are SO inconsistent with the quality.\n\nGoat Hill has always had a great reputation in Potrero Hill so I went in today to this SoMa location sitting on a street under the I-80 to get a slice and noticed that this tiny location doesn't just have pizza (like Escape From NY) but actually has pasta, which I couldn't pass up, especially ravioli -- but, then, knowing how ravioli can get easily screwed up, I lowered my expectations.\n\nDidn't have to -- this is some really good ravioli!   I think mine was filled with meat & spinach -- it was perfectly 'al dente' which is a major criteria for me for rating pasta and had a wonderful flavor -- and the marinara?  Excellent!   Then there was the garlic bread.  Garlic bread.  Garlic bread is garlic bread, right?  Of course, no, most of us know it's not -- and this ain't no lame garlic bread.  Large piece, hot, crunchy, just the right amount of butter & garlic -- and one other ingredient I can't quite place that gives it an extra great taste.\n\nSo, next time -- pizza slices.  My coworker went there (he's the one that ran into it by mistake) and loved his slices, so I know I have something to look forward to.  I'm just very very sad that I only found out about this today.  All those years of great meals I could have had.\n\nAll I'll say to Goat Hill Pizza -- great job, folks, but maybe it's time to do a refresher on your advertising for offices/businesses around you so they know what they've been missing.", "author": "Merrick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Surprised to see this place rated below 4 stars. Prices are reasonable, pizza is outstanding and the 10+ times (I have a problem) I've ordered delivery they arrived quickly and without issue.", "author": "Dylan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "A great tasting pizza, made fresh & delivered for free & it was still piping hot!\n\nI wasn't in love with the sourdough base but it was unique & the toppings were tasty. Delivery took approx 45 mins on a friday night.", "author": "Nicole E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "Good pizza locally owned but a little patience is needed if you ordering to have it delivered. There are more economical choices available near by.", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "I grab pizza from here all the time.  The Potrero store as well. Today I called in to order two large pizzas for take out.  The guy on the phone was just something special. I felt like I was talking to a wall. When I asked I want to place in order he asked if I have an account with them!  An account? I'm ordering a fucking pizza... Not cashing a check.  Anyways I show up to pick up the pizza and the guy at the register was worse than the guy on the phone.  Some kid rocking a fro that lacked basic communication skills. When he brought me my pizza and soda I asked for crushed pepper since the bin for the crush pepper next to the register was empty.  The guy comes with a handful of pepper and throws it in the bin. How do these people survive in the real world?", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "good pizza! we ordered delivery yesterday and our custom half n half pizza (hawaiian and hilda's fave with chicken) came within 30 minutes! excellent service. we also got a dozen buffalo wings which were delicious as well. will be ordering again!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "My coworker swears by this place.\n\nIt is an excellent pizza place, to be sure. It gets extra points for being so close to work. What I loved about this pizza was that it's on sourdough. I personally love sourdough, but I do know a fair amount of people who think that sourdough is too strong. Goat Hill Pizza manages to make a pizza that has the sourdough complimentary, allowing it to work harmoniously with your precious pizza ingredients.\n\nThis location is a down the Stillman alley. It'll look like you're in the wrong place, but you can order from the window and your pizza will be done in about 5-10 minutes depending on your toppings. I went with sun dried tomatoes and mushrooms on one. I realized I didn't know how big the pizza was, so I decided to order a second with spinach and chicken. I think the chicken took a little longer, so there's a heads up for you.\n\nWe took the pizza up to the roof at work and it was super tasty! The toppings were on-par, and yes, they do have goat cheese if you request it. If you don't like sourdough, or you're a slow eater, you may want to steer clear of the crust. I've noticed that this crust gets tougher and tougher the longer you let it sit, so definitely try to eat it quickly or eat it first...or don't eat it at all if you don't like sourdough. Personally, I loved the crust. That was straight up sourdough goodness! I will definitely go back for lunch.", "author": "Robbin A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-03", "description": "I was torn on writing this review, but I ultimately felt like the company should know what its employees are doing.  \n\nI have been a long time loyal customer that dines in and orders take out.  A few days ago there was a rather rude message written on the paper bag my salad and plates were delivered in.  It read, \"GET YOUR OWN SODA!\".  I assume this was written because I had ordered a six pack of coke.  Not only was I offended, but I was disappointed in the fact that my favorite pizza restaurant's employees could be so disrespectful to a customer.  I suggest you remove the six-pack of soda option from your menu if you do not want customers to order it.  \n\nI'm off to find a pizza restaurant with great customer service.", "author": "Raquel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-11", "description": "Convenient walk up window in an alley in SOMA.\n\nI've been trying to stay away from pizza, but the office was going to the ballpark for the afternoon and I figured pizza was better than hot dogs or overpriced stadium food. I'm sure there was logic in there somewhere. \n\nWe found the walk up window and ordered our slices. All slices/ pizzas are made to order and take about 5 minutes each depending on how busy it is. I got goat cheese/ artichoke and mushroom pepper. They were amazing! I'll probably update when we try their delivery to our office.", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-17", "description": "I love a good sourdough crust pizza and this was NOT a good sourdough crust pizza.\n\nThe crust was very lackluster and the fact that it was done in less than ten minutes made me think that the crust is pre-cooked. \n\nThe sauce was bland and desperately needed garlic or something. And the non-existent barely cooked cheese made me sad...\n\nLittle Caesars  and Dominos tastes better.  Not even a joke.\n\nI will not be returning.", "author": "Loryn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Free birthday pizza of any choice delivered! So awesome! Delivery is not quick but SO worth the wait. Best pizza in SF!!", "author": "Laura P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-19", "description": "I came here for a slice the other night \nNot bad \nI took a bite too quickly and my mouth is still murdered - totally not their fault though \nGreat sourdough crust - the highlight of the slice. I would imagine ordering a whole pie would be much better", "author": "Sam A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-19", "description": "DO NOT GO HERE. AVOID AT ALL COSTS. If I could give it zero stars I would. The pizza is overpriced, mediocre at best, and the service is ridiculous. I made a delivery order for a pie, and requested that there be no olives. A rather simple request, one would think. I even confirmed THREE TIMES that there would be no olives on the pizza. Let's just say I was less than pleased to have the pizza arrive at my apartment after an hour of waiting with a MASSIVE COLLECTION OF OLIVES ALL OVER the pizza. Ridiculous and it ruined my week. Get your pizza anywhere else!!!!", "author": "Aryeh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Delicious pie served by the kindest people in the beautiful Potrero Hill neighborhood. Extra bonus to eating here, the establishment offers gluten free dough for those who don't wish to consume wheat. Meaning? My friend and I can stuff ourselves silly, she won't get ill, and we get our pizza fix!", "author": "Frank L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-18", "description": "I decided to try this place out. I ordered for delivery at 12:55 after the rush hour. Got my order at 2:10 and I only live 5 min away from this location. Pizza arrived cold as well as the cheese/garlic bread. I had to reheat the pizza and bread in my oven. Taste was ok, I did like the crust. For $32 including tip, I honestly was better off going to the crappy pizza place around the block from me. I won't be ordering from this place again.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-27", "description": "A week of gallivanting up and down the coast wears a kid down. So, on any given Sunday, the boy and his best gal hunkered down for a Storage Wars marathon and decided on delivery to the Dubs hotel.\n\nGoat Hill was putting out sourdough crust pies on the nearby, and the reviews seemed favorable. Terror struck! Wasn't this the same pizza place that delivered three 'zas seemingly vertically last year? Cheese, toppings and sauce sludged to one side, leaving half sloppy jalopy, half naked as a newborn.\n\nShake ya head, son. It's 2012 - give 'em another chance.\n\nAnd this time, our $27 (TWENTY SEVEN FRIGGIN DOLLARS) large Hawaiian arrived well-topped with ham and pineapple, but abysmally embedded with handfuls of \"fresh herbs\" (read: dried oregano). Unavoidably blanketing every bite, all I tasted was wood and hippies. Can we talk about how it's $27 (after $3.50 delivery fee, tax and tip)? No thanks, Goat Hill.\n\nTwo shots, two failures, two stars.", "author": "Damien S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "Ordered online. Chicken on the pizza was morbidly old (post mortem and post boiling). They tried to go gangster by burying it in in the concrete mixture of cheese, the bloody chicken fought back. The best part of the pizza, unfortunately, was the box. At $20 for a 10\", I expected something recent. You experiment to ferment the chicken, my dear friend, has gone down in flames( I guess one could say that it worked out ferfect).", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "One of the best pizzas I've had in the bay. I am in love with the sourdough crust. I've tried Hilda's Favorite, Hawaiian, and Porky Pie. Hilda's Favorite is by far my favorite! Pesto on a pizza with the sourdough crust taste so good together and makes me very happy to eat their combo. A must try.", "author": "Lara R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-14", "description": "After the big storm of 12/11/2014, our company regrouped in our little office in San Francisco. Most of us had worked from home the day before as \"Stomaggedon\" rolled through the Bay Area. By the time lunch came, we really didn't want to venture too far. We decided to call for take-out pizza and finally decided on Goat Hill. \n\nWe ordered the Hilda, their combination, and a Hawaiian with jalepenos. While the pizza itself was simple, I found their ingredients quite fresh. You could taste the ham in the Hawaiian and the fresh veggies in the combination pizza. Their sauce is quite good too, not too much, but enough to hold everything together. I'd have to say the Hilda was the star out of the three we tried. The goat cheese and fresh tomatoes was complimenting and quite tasty. My only gripe is the hard crust. I've never been a fan of tough crust pizza, and this one seems like another one that I would just throw away. Goathill is quite good and I would definitely try it again in a later date.", "author": "William H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "I've always liked Goat Hill, I haven't had in a while since I moved out of Potrero Hill neighborhood, but I plan to order for dilevery tonight, I've been craving Ravioli and Meat balls which they make so good . If you like Italian food, (I'm Italian) so I really like this place, it's affordable for me and I love Italian food, be expecting a order tonight, been a while. But 5 stars, highly recommend Goat Hill.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-26", "description": "Requested delivery at 8:45, because I'd be arriving at 8:25. They arrived at 8:15, before I got home, then decided to hassle my building's staff. The staff here are good people, and they don't deserve that kind of poor treatment. Disgraceful.\n\nThe food itself is fine, but I've had just as good with less expense.\n\nBottom line: Will not order again.", "author": "Darryl B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-26", "description": "This location deserves 5 stars for the food, but this review is for the service. \n\nI've been a loyal customer of this location for close to two years now. Every Saturday we have a ritual of a horror movie and a Goat Hill pizza. Lately, it's been harder to get my order in -- this location closes at 10, but they start ignoring their phones at 9:40. Tonight, they did not answer so I tried to place an order in person (I live a block away) at 9:43 and was told that they were no longer taking orders.\n\nGreat pizza, lazy service. Too bad.", "author": "Miche C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "Always good for take out.  The special combo has more toppings than we normally like, but for some reason the combo hits the spot.\n\nThe pizza crust tastes great.  The Monday all you can eat is a great way to taste the different pizzas, but I don't think you can eat enough to make it worth it. \n\nI only wish they could deliver it faster.", "author": "Jon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-28", "description": "Meh. $3.81 for the slice I got (Today's choice of Linguisa, Black Olives, and Green Onions) wasn't really worth it. I could see how another flavor might have tipped the scales in a different direction, though. Slice was fairly small, and lacked extreme flavor that a \"flavor of the day\" pizza should have. \n\nI'd try a full pizza of another flavor here just because the prices are decent. Maybe I'd give another slice a chance?  Not really impressed with the food, but the employees were nice, so that added the 3rd star to my review.", "author": "D W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "Good crust but terrible sauce and cheese. If your from the east coast this pizza is crap!", "author": "TJ U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "I always order pizza from here to be delivered to my work place. Staff is always nice over the phone and in person.  I've never had a bad pizza from here. \n\nI have to say that today's superstar is Jacob! THANK YOU SO MUCH!!!!\n\nWhenever my work place has staff parties, they always order like 20 boxes of pizzas from here!", "author": "? ?."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "All time great.\n\nThere is this G.O.A.T. http://www.examiner.com/article/taschen-markets-new-edition-of-its-landmark-goat-book-tribute-to-muhammad-ali\n\nAnd then there is this from Goat: Excellent and massive sandwich with homemade pizza sauce, grilled chicken, assorted veggies, tomatoes and Daiya vegan cheese on a roll.\n\nOriginally a vegetarian that was kindly updated with multiple requests (chicken, cheese substitute). Space might be a tiny takeout window but service is anything but small.\n\nCan't imagine any of Ali's events costing just $9. In a fight between the two Goat Hill delivers a knockout.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "SF's finest now by the ballpark.  Potrero Hill's classic sourdough crust pizza, a San Francisco original.\nA great place to hit on your way to AT&T.  Get your slice, keep walking and get your drink on.  This is a take-out/delivery only spot so don't expect to sit down.\nBe a pro, order and go.", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-08", "description": "I just ordered two slices from the highest man I've seen in San Francisco. That's an accomplishment. He was in the back playing guitar tabs, I had to shout to get him at the counter.  \n  \nSlice of the day was pepperoni pineapple jalepeno. It was clearly just a slice of already made pepperoni that had the other toppings added later, so they were all falling off. \n\nStill, it was tasty. You couldn't really tell that the bread was sourdough. Cheese was the perfect amount of stringy though. \n  \nDecent food, almost on point prices, and it's basically down an alley, so this was probably a one time thing.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Love this place. Always so nice about delivery even though I'm a little far. Great customer service and delicious pizza. I love the sourdough crust, especially with their ranch dressing, and that they have goat cheese as a topping. A little pricey but yum!", "author": "Penny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Love love love the sourdough crust. Great crispy texture on the bottom and a nice toothsome feel as you bite. Standard variety of toppings with the sausage as a favorite. They also off a gluten free crust the my wife said was quite good.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "I love this convenient and nearby pizza place.  Tasty pizzas for a reasonable price.  Personally I like their all meat and their Goat Hill Special.  \n\nThe food's reasonably priced and sized as well.  $30 got an extra large pizza that served about 4 or 5 of us fairly well.  I'll definitely be coming back here.", "author": "Keith C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-06", "description": "Having walked many times by the alley where Goat Head resides on my jaunts for lunch, I finally decided to try the hole in the wall pizza place.\n\nThere's enough room for around 6 adults to stand comfortably. But if you're coming here, it's for take out, so that shouldn't be an issue.\n\nThe cashier had dirty blond hair, and a trimmed beard. His attitude was pleasant, and he was patient with the people ahead in line. So props to them for handling customers.\n\nThe soup of the day + slice of pizza combo seems to be the best deal. It's cheap, and it's ready to eat within 5 minutes.\n\nOrdering a full pie seems to take quite a bit longer. I ordered the Greek 10\", and had around a 10-15 minute wait. This might turn some off.\n\nThe flavor was decent. The slices weren't anything to compare with what NY or Chicago do, but for SF it's definitely a nice treat. The crust is a little bit too hard for my liking (I'm usually one of the few in my group that eats the crust), and I wound up leaving it alone after a few bites. The toppings were fresh and complimented each other well; so that makes up for any crust hardness.\n\nOverall, not bad. I won't be coming here once a week, but maybe a few times a month is good. If they can work on their crust and include a little bit more sauce, it'd be a lot better.", "author": "Amal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Great pizza, consistently awesome, delivery is a little slow. Get the Supreme pizza and you won't be let down. Ingrediants are top notch.", "author": "Kyle F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-24", "description": "Blah all the way around. Just not good pizza / crust / flavor. They are on door dash though so that's a plus.", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-01", "description": "The pizza was good, but I think I was just expecting something a little different. When I hear \"sourdough crust\" I think of a nice big fluffy thick crust pizza, but that really wasn't the case :( The slices are also very small for a six slice $15 pizza, which made me wonder how insane people thought I was while nomming on my small in South Park. The mozzarella was top notch though. I'd go back to try the garlic cream sauce in the future. \n\nI also sort of wish it was in a different location in SoMa. I know a LOT of SF is a bit  sketch, but I once had an...altercation near that overpass near Bryant and 4th so I could feel a lot better about traveling that way. Granted it was 3 years ago before there was hundreds of tech companies nearby, so at least, for once, gentrification puts my mind at ease. For once.", "author": "Raven P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "Sourdough pizza. Sourdough pizza that doesn't taste greasy and plastic-y. Sourdough pizza delivered for free with an online ordering system AND a punch card for frequent diners. It doesn't get much better than that. \n\nDelicious.", "author": "Kimberly A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-14", "description": "The people who answer the phone for delivery need Customer Service 101 or need to read Phone Etiquette for Dummies. I'm a regular customer and repeatedly am talked at by snatches who take my order and my cash money!\n\nIt'd be almost okay if I was always happy with the food that came to my door. But more times than not, the pizza is over-cooked, has too-little cheese, lop-sided, or they forgot to include salad dressing for my salad, forks, or packets of parmesan. How can you forget the parmesan!?\n\nThis past Sunday I specifically requested the parmesan packets but was responded to by an annoyed voice that retorted, \"we include all the delivery items.\" And SHO 'NUFF, they forgot the parmesan.#$%^&*\n\nOn the other hand, the woman who delivers is always kind.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-19", "description": "Ordered pizza for delivery on their website. After 1.5 hour still no pizzas, the said 10 minutes, after 20 more minutes still no pizza, the said 5 more minutes, after 20 minutes again still no pizzas.  What the fuck!!! .  If you can not provide dependable service, why offer.  It's very disappointing , I will not order from this place again!", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-08", "description": "I wish I could put NO stars for thee WORST customer service I've ever had in San Francisco. We've happily ordered from Goat Hill for the past year and are up to our 12th pie so next one is free! Right? Wrong! After waiting 45 minutes for our order, they call us back and say sorry we don't deliver to your neighborhood anymore. Are you kidding me!? I work at 4th & Brannan and can get there in 10 minutes from our house, so it can't be travel time. So now it's 8.30 and we have no dinner for movie night, which should be here by now. I'm astounded at the lack of service. I would've accepted \"FYI for the future we won't be delivering to you but we will this one last time.\" So be forewarned, get your pizza elsewhere!\n\nUPDATE****\nOn top of everything else - they charged me for my order and have not refunded us yet!? RIDICULOUS!!!", "author": "Gwen V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "Adam the cashier was impatient, awkward and made me wand to choose elsewhere for the $10 I spent on two slices. I did appreciate that he verified my toppings after ordered. It is tasty pizza and connects me with my New York roots.", "author": "Michael U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Pizza toppings are a constant battle in my house. My husband is basic, meat, sauce, and cheese. Unless we're in New York or Chicago, I unabashedly admit, we'll eat frozen pizza and be just as satisfied. \n\nAnd then we tried their Hilda's Favorite and decided it's become our go-to delivery pie. I'm not a vegetarian but the combination of goat cheese, pesto, and tomato paste on sour dough rocked my world. The pizza also comes with tomatoes but I honestly don't think freshly sliced tomatoes on top of a pizza does anything for the pizza or the tomato. Replace them with sun-dried tomatoes and now you're talking!", "author": "Kerensa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-19", "description": "I've heard a joke about how pizza is like sex. Even bad pizza/sex is still good. Honestly, I have never met a pizza I hated. \n\nWith that being said, I am horrible at judging the distinct difference from what is great pizza to what's just okay. However, one thing stood out about Goathill Pizza and it's the crust. \n\nI will take a quote from Barney Stinson from HIMYM, \"B-man don't do thick crust, What up!\" \n\nI really don't like thick crust, I like myself some thin crust. It's because I am not much of a bread fan, so the less the better. I know that seems sacrilegious, but I grew up on rice dammit! Goathill provided a nice take on a sourdough thin crust. I really like the flavor of the bread and the crunch it added to the pizza. I actually enjoyed the crust and the flavor/texture it provided. \n\nI had their special that day and it came with red onions, pepperoni and feta cheese. It was a good flavor combo however the sauce didn't really stand out to me. I ended up enjoying the bread more than the toppings. I wish the sauce had more of a kick or stood out a little more. That would have made it more orgasmic rather than an ongoing enjoyment with no amazing burst at the end. Every girl should know what I mean. While the bread was awesome, the sauce needed to hit the \"spot\" and it failed to do so. \n\nOverall, good prices, okay service and toppings, but great bread. \n\nAlso, special thanks to my dear friend Barf Nuggets for the treating me out to lunch!", "author": "Elsvette B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-29", "description": "I had the opportunity to try Goat Hill Pizza when it was catered for a private event I recently attended. I tried the chicken florentine, with grilled chicken, mushrooms, and spinach. I didn't realize it was actually a sourdough crust, until I was reading up on the pizza place post-event. That pretty much explained the tough texture of the pizza crust and the reason I felt like I was chewing and chewing much more than with an average slice of pizza.\n\nThe bottom line: Just okay. Despite having a sourdough (which I typically love) crust, it was too tough for a slice of pizza. I can't say I'd order from them in the future given the variety of exceptional pizza joints that are available in San Francisco.", "author": "Mansi A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-30", "description": "I ordered for delivery and service on the phone was really nice and efficent. \n\nBut the food....(shakes my head). Big disappointment....\n\nOne of thee worst spaghetti I've ever had. It was dry. The noodles were bland. There were barely any meat sauce. I had the lunch special with a cup of minestrone or something. When I opened the lid, it looked like a cup of oil. Ugh, I immediately closed it and threw it away.\n\nMy boss had the lasagna and it was on of thee flattest lasagna I have ever seen and it was drenched in grease. \n\nThe only decent part of this meal was the side salad my boss had.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Pretty solid pizza. The pepperoni was delicious and the cheese to sauce ratio was perfect. LOVE the sourdough crispy crust. Will have again!", "author": "Maddie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "This pizza is very delicious. I would definitely  come back here when I come back to San Fran. If you want a sit down restaurant you want to check what location you go to in San Fran. The sourdough crust is SO good! The last piece was fought over!!! If you love pizza, a good experience, nice people, and some fun, this is definitely the the place you should have your meal!!!!!!!!!", "author": "pat h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-12", "description": "This review comes after a number of years of ordering pizza for delivery from here as well as several other places. I'll be honest it's not the best pizza I've ever had but it's still pretty darn good. After having tried delivery from many other places Goat Hill by far has been the most consistent and best tasting. One thing I LOVE is they make their Ranch dressing. It's probably just from the dry packet but it tastes so much better than the bottled stuff. I know, this has nothing to do with the pizza but if you like Ranch and like to dip your crust in Ranch this is the joint. \n\nI've tried several other places but I keep coming back here. The pizza is always good, toppings are solid and their salad bowl is actually a behemoth salad that my wife loves so it's good for the both of us.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Best gluten free pizza in town! It's delicious! They are very generous with pizza toppings. Crust is perfect; not too crunchy and hard or soft and doughy. I wish the chicken wings were not breaded...", "author": "W S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "The pizza was good, not great, just good. I would say the best part was the crust. I ordered a small pizza, said 6 slices. I expected more. It was the size of a microwave pizza. I would get it again if I had the extra money. But for nearly $15 for a SMALL cheese and pepperoni, it's not likely. \n\nOverall, if you have the extra cash to get this pizza, get it. It was tasty.", "author": "Liz F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Fabulous pizza, I havent had pizza this good anywhere on the west coast! Reminds me of my favorite east coast pizza but better :-)", "author": "Randi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-12", "description": "It's decent delivery pizza.\n\nIngredients are fairly fresh but nothing special. The cheese is consistently good. The crust is sometimes good, sometimes just there. I've had some five star pizzas from Goat Hill, and I have had some greasy piles of crap in a cardboard box from Goat Hill. I'm not enough of a fan of the latter to continue ordering it.\n\nTwo and a half stars, rounded up to three because they have a Goat in their name.", "author": "TJ P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-25", "description": "Convenient location below my office. I love the sourdough crust and the service is great! The only reason I can't give it 5 stars is because I have to ask them to purposely undercook my pizza or the crust is burnt.", "author": "Bradley V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-31", "description": "The toppings were generous, with half again as much meat as most places put on a meat pizza - that was appreciated, definitely worth consideration for a hungry man.\n\nHowever, I had trouble getting past the leathery crust. It tasted like there was too much yeast in the mix, or it hadn't been allowed to rise fully. The result was a chewy, leathery, heavy bread under the body of the pizza, even if the outer crust was a bit crisp.\n\nThe cheese was pretty average, and just a bit hard even while the pizza was warm - I don't know what that indicates, but combined with the leathery crust, it made for a pretty dull experience. It didn't give off much of an aroma, and chewing was a chore. Pizza shouldn't make one's jaw tired.\n\nThe garlic cheese bread was nice. A lot of places give you something that seems like it's just pizza dough cut a little differently. This was an authentic, well-made cheesey garlic bread.\n\nThey also deliver IBC Root Beer at a reasonable price. That's a great change from the usual soda + bottled water choices.\n\nDelivery time was as estimated, to the minute.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "We moved here from Boston in March and have ordered a lot of take out pizzas since then and have not liked any of them until we tried Goat Hill Pizza.  It is very good!  The  sour dough crust is excellent, the sauce is tasty, they put plenty of toppings on the pizza and it arrived before they said it would and was still hot.  What more could you ask for?  We will be ordering from them again soon.", "author": "Ruth G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-02", "description": "Busy season means long hours in office and working during lunch...almost every day. I know that some people leave for lunch, but I would just rather get my work done and be able to not have to work during my weekends. The company had ordered quite a few pizzas for all of us and I got to try a couple of slices. \n\nThey have a sour dough crust which is a nice contrast to the normal crust on a pizza, but it's so uneven. Some slices have so much crust that it's almost more than the non pizza part. It's just way too tough of a crust and I'm not too big of a fan. \n\nI will admit that our company likes to help out local companies and it was great to see that we got pizza from a local chain.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "Each pizza was generously topped with great amounts of ingredients and that alone was enough to win me over. Moreover, the ingredients were fresh and the pizzas were very hot when they were delivered.\n\nI don't think you can go wrong with any combination, but the Californian and Chicken Florentine really stood out to me among many other pizzas.\n\nHowever I'm not sure if I'm comfortable paying more than $20 for a large pizza, but I think that the prices were acceptable considering that we're in Downtown SF. \n\nWe also got some salads and they were not bad. I chowed down on the kidney and garbanzo beans and if you love pepperoncini, the salads contain CRAZY amounts of them.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "I have always been a BIG fan of Goat Hill Pizza simply because their product and pizza are amazing!  Their delicious sourdough crust, fresh toppings and best of all, the goat cheese, make this pizza hard to beat.  \n\nI work as a nurse at San Francisco General Hospital in the ED and have devoured more of these pizzas than I'd like to admit .  On July 6, 2013, I was part of the staff working in the ED as we received almost 60 injured passengers from the horrible plane crash at SFO.  Unexpectedly, we received close to 20 pizzas from Goat Hill Pizza.  Nobody had ordered the pizza...Goat Hill Pizza donated this food to feed all of us, the disaster workers busily taking care of the injured.  \n\nWe were all so touched and grateful by this kind gesture from our community restaurant!  I would give them 10 stars if I could!  Any restaurant that has such a great tasting product AND is consciences and thoughtful enough to think of their community in a time of need is tops in my book!!\n\nThat day, you fed all of us (RN's, MD's, surgeons, techs, paramedics, police, sheriff, radiology, volunteers, pharmacists, housekeeping, etc.) at a time when we were too busy to even think of food but desperately needed the fuel to keep going.  For this, I will be forever grateful!!  Thank you Goat Hill Pizza!!", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-23", "description": "Goat Hill's signature sourdough crust didn't really wow me, as it was hard to taste the sourdough over all the toppings on the pizza. I did notice that it was a bit more chewy than pizza crusts at other places I've been to. My company usually orders pizza from here for events, and I've been pretty satisfied. The pizza's are pretty generous with toppings, but definitely one of the more greasy pizzas (there are pools of oil, but you can easy drain that off by lifting the slice and/or taking one of the 500 napkins they give you in the bag). I would recommend North Beach Pizza instead, but if you're around the area, it's definitely worth the stop.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "This review is for Goat Hill's take out orders.  I am usually the person that orders for my co-worker when we have pizza day at work.  I either order on-line or by calling in our orders.  \n\nWe LOVE Goat Hill Pizzas!  We order a least 8-9 different types of pizza and each time we order, the pizzas are delivered piping hot and on time (got to have pizzas on time because I have to feed 35 hungry attorneys and they can get really mean when lunch is late! Ha!).  If you don't fancy what they have on their menu, you can make up whatever combination you want on your pizza... not a problem, they aim to please.\n\n\nEnjoy!", "author": "Miriam O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-28", "description": "I have had a lot of good Goat Hill pizzas and I'll give them a few more tries, but the last couple pizzas it seems the grease has increased.   Also the chicken tasted a little freezer burned or old.  It's possible that we order from a few different locations, but quality between stores needs to be consistent.   \n\nGoat Hill Pizza, please address the excessive grease on the pizzas!", "author": "B R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "Goat Hill pizza boasts a sour dough pizza crust and it is different.  We had pizza brought in for an office lunch today and instead of the usual, we were suprised with goat hill.  It was my first time trying it and the sour dough crust does take a while to get used to - it was nice and thin, and sort of crispy but the edges were too crusty so I didn't have a problem throwing them out.  We got a red onion and roasted garlic pizza, a vegetarian pizza, cheese pizza, and pepperoni.  Unfortunately the team did not order enough so some people had to wait for the 2nd/re-order.  I th", "author": "Bebe W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Maybe this place is a hit or miss, but I thought the Porky Pig was UNREAL. Bacon, red onion, + loads of roasted creamy garlicky goodness. First time trying sourdough crust and thought it tasted pretty great. Biggest plus? Only ~10 min wait for a piping hot, fresh pizza!", "author": "Will Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "Good pizza with crisp sourdough crust. Crusty people working there as well: a couple of decent guys, the rest seem pretty well fed up with people.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-06", "description": "I'm from the East Coast so my pizza expectations are kinda high. \nThis pizza is mediocre at best. Too expensive for what you get.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-29", "description": "I been working in the city for 5months always looking for a new place to eat at, usually when I want pizza ill go to escape from New York, wish I would've kept going there. This pizza taste like it was frozen n they just warmed it up, reminds me of elementary school lunches. Will never come here again, rather starve.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "Not bad, not bad at all!\n\nI'm the kind of person who would be more than happy with Costco pizza (I don't know why you're judging me, they're pizza is really good) so let's just say my pizza standards aren't exactly connoisseur-level. That said, Goat Hill was pretty good but not mind-blowing. As my friend said, it's \"a dressed up version of Pizza Hut or Roundtable.\" And for the SF price -about 10 slices for $30 after tip! - I'm not sure I want to be paying that much for fancy Rountable.\n\nI did like the signature sourdough crust. That was something I was looking forward to and I think it did give the pizza an \"edge\" over RT or PH (I love abbrvs). The ingredients were noticeably fresh, also a plus. \n\nOther than that, their website was a little confusing but when I called the order in, their customer service was excellent. I'd go in to try a slice but I wouldn't order another $30 pie.", "author": "liz c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "This review is for their GLUTEN-FREE delivery pizza.  \nI was home alone the other day, and remembered reading that Mariposa Baking Co.'s bread and pizza crusts were being served at some restaurants in the bay area.  Goat Hill is one such place, and the one closest to me.  I ordered my pizza, it arrived in a reasonable amount of time, it was relatively hot (I like my pizza so hot it scorches your mouth) and was SUPER TASTY.  \nCheck out the pics on my blog, you won't be disappointed.\nwww.gonegluten-free.com", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "I've been a Goat Hill Pizza patron for quite some time now.  Probably a good 15 years or so.  Of course you can't beat the dining experience of sitting at a table like their original location, but if you want a slice pizza for lunch, then this isn't a bad option. Its better than any other pizza slice joint in the neighborhood. The Hawaiian pizza slice is my goto slice with loads of ham and pineapples.  I also go with the Porky Pie or the Meat Lovers on occasions as well.", "author": "Milton W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "I ordered 3 pizzas for a party and am now a huge fan. Great pizzas with generous toppings. Hilda's favorite with goat cheese and pesto was amazing. My friends and I devoured that pie in minutes. Also recommended is the special combination...meats, veggies, everything but the kitchen sink. Sourdough crust...great SF take on NYC pizza.\n\nWill definitely order from  here again.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "-1 star since the online ordering system was down and felt a bit clunky.\n\nDelivery/service:\nWe ordered pizza for 20 people for a picnic. We ordered roughly 90 minutes in advance and specified a time when we wanted it delivered. The pizza arrived within 30 seconds of the expected time and was steaming hot, so delivery and service was really top-notch.\n\nThe taste:\nThe pizzas themselves were really tasty. Slightly thicker than normal thin-crust pizza, which was perfect for a picnic. Really crispy crust which we all liked, and the perfect amount of toppings. \n\nGarlic:\nIf you don't like garlic you may want to choose a pizza without garlic or ask for less since the toppings that included garlic had quite a lot of chopped garlic on top. I loved it though, but may be something to consider.", "author": "Leo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "I just got the hottest delivery pizza I ever had.\nIt was delivered well under the 45 mins. quoted, it had a ton of toppings, the crust is nice and crisp and the sauce great.\nOn top of that it was delivered by a nice guy and the sodas were cold.\nWhen you consider that no goats are harmed in the preparation of the pizza it's a 5 star winner.", "author": "Richard L. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "Great pizza and free delivery!  They emailed me a coupon for a free any size any toppings pizza for my birthday. I just had to give a tip to the driver. They were fast and the pizza is outstanding. They use sourdough crust. They may cost more than Pizza Hut well worth it.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-19", "description": "I will start out by saying this is the weirdest pizza spot location ever, delivery and take out only.  I was walking down 4th one day toward market, and noticed the sign, i was damn hungry and pizza sounded good.  My cousin and I went over to the spot ordered a large pizza to go.  At this particular time it seemed like the best pizza ever, took about 15mins to make. But I have ordered this pizza when at work several times and didn't seem to hit that same spot, the dough is good.  I think maybe it doesn't do so well on delivery maybe?  Take out is better?  It has since been surpassed by Escape From New York pizza, but its not terrible.", "author": "Tim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-12", "description": "Ohh my goodness. We had our office order pizza from here and i remember thinking i must know where this pizza is from its soo GOOD! You have to understand.. i'm crazy for pizza. I LOVE pizza. And I can be selective about my pizza. A good pizza makes my world go 'round. I took my husband to this place on a seperate day because he is like me when it comes to our love for pizza. We usually go out for the deep dish style pizzas but I really wanted him to try this place. He equally loved it and was surprised how good it is. Damn.. now im craving some Goat Hill...", "author": "Rehana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-23", "description": "Order the meatballs. Don't miss Monday Night Family Night!", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-02", "description": "This is probably the most addicting pizza I've ever had.  It's probably cause of the sourdough crust which is so damn good.  I get a slice of plain cheese every time and it more than delivers.  \n\nCosts $2.50 and takes 3 minutes - a perfect lunch in SoMa.", "author": "Mack D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-29", "description": "Decent tasting pizza though there is much better in the city, price is like other places in the city.\n\nThe problem is that I went to their walk up counter for some slices. Everyone else was getting theirs so I asked what was up, he said it would be just a moment. Several minutes later they hand me my box and I walk out and look inside. Looked like it got about 30 seconds of oven time, crunchy mushrooms, etc. It was barely even warming up the box. \nIf they had told me they'd messed up I would have been annoyed but not angry. I would have told my co-worker to go on without me (he was needing to get lunch quick), etc. Instead they made us both wait much longer and tried to pass off crap for their mistake.\nSeriously, you think I wouldn't notice crunchy vegetables and cold pizza?\n\nReally not happy, will not be going back anytime soon, pizza quality isn't good enough to bother after this.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "After a long day of condo cleaning we needed some pizza to bring us back to life. We ordered Goat Hill (my first time) and the pizza was good. Nice crust, not too thick or too thin, fresh toppings, nice sauce, right amount of cheese. Certainly not the best pizza ever (Little Star has my heart), but delivery was quick, ordering was easy and when the pizza arrived they provided a bag with napkins, paper plates and a frequent user card- with the first stamp towards a free pizza- A really nice touch. Thanks Goat Hill", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "I find that getting good Pizza in San Francisco can be somewhat of a challenge. But my problem is I am always comparing it to NYC pizza. But that is comparing Apples to  baseball bats. In reviewing pizza in San Francisco its only fair comparison is other pizza in San Francisco. And when you do this Goat Hill comes out on top.    . They do great with regular plain pizzas and also have a great menu of specialty pizzas. You can get slices or a whole pie. The Crust, the sauce the toppings are all top notch.  While you will overpay, because every pizza in San Francisco costs 15 dollars more than it should, this is your best pizza option in the city.", "author": "douglas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "Cash or credit is all good..hidden on the alley. Will definitely come back for more", "author": "Nacho G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-02", "description": "I'm a huge fan of their pizza. The rest is mediocre. \n\nWe ordered a pizza and a salad. The pizza was cooked perfectly. No one else does a crust like that , that I'm aware of, in the city. Delivery was prompt and it tasted great. The salad, however, was a big disappointment. First, the menu says the salads are with mixed greens. The entire salad was iceberg lettuce. That's just crunchy water! So when I opened up the bag and saw it, I was disappointed. They should change their menu to reflect what they actually serve.\n\nSo I give it three stars--the pizza is worth it, but misleading your customers is not cool. If you were out of mixed greens, then you should say so.", "author": "Alyssa T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-30", "description": "So rude, Called to order a pizza , half through my order the person taking my order could not hear me because of noise on his side and he simply hung up the phone .  He could not have been bothered.  Went to Patxi's and it was awesome.  Five star rating .  \nFor managers I called on Saturday night June 30th at 8:00 PM .  It was a male and he was so rude.  You should rethink his role .", "author": "Joe D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-15", "description": "Horrible pizza.  Last two years the quality has gone downhill.  Crust is still great but everything else is terrible.  Do not waste your time and money.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "Good, solid focaccia pizza.\n\nThis is just a pick-up and delivery location.  Both are good.  Pick up service is really easy and they make the pizza pretty quickly.  Delivery is good too; quick, courteous, and the quality of the food is good as always.  I've only had their specialty pizzas, and they are good go-to menu items.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-12", "description": "Their online delivery system has a lot of kinks to be resolved.", "author": "Captain J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-02", "description": "There's actually a Goat Hill near my place in Potrero.  For some reason I thought it was a stand alone mom and pop - but I guess not.  There's at least 4 in the city.  No worries...they were there for me when I woke up @ 10:30am  this past Sunday.  I give them props since it seemed like after 12 calls to different pizza spots...even their sister location near my house - no one wanted to assist with my eating disorder.  \n\n36 minutes and 14 seconds later...the doorbell rang.  HAIL YEAH!  We went with the house specialty combo pizza.  I was pretty impressed...only thing though is, since it was so wet and dreary outside - the crust lost its fresh out the oven kick.  Though a bit disappointing, the pizza held us over til I got outta bed again at 9pm.  With no more Pizza left...I settled for vienna sausage and some rice I cooked for the dog.  Rice helps her stomach settle...well, was supposed to anyway - today my stomach had seniority over hers.\n\nTold you I had a disorder...I eat food meant for my dog.  I guess need help from time to time eh?", "author": "Derik P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "Oh, the pizza God's have answered our quest for a good pizza in SOMA!  We ordered a large Specialty which is loaded with wonderful toppings.  The crust is delicious, chewy & crusty.  This spot is only for take-out & delivery.  Definitely is our go-to pizza place now!", "author": "Donna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "Am from Chicago and am extremely picky when it comes to pizza.  Ordered spinach and mushroom and the pizza arrived within 45minutes.  It was outstanding.  I questioned the sourdough crust at first, but it was both crisp and chewey and had added depth to the overall taste.  Toppings were fresh and plentiful.\n\nI will be ordering from here again and reco it.", "author": "Hana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-22", "description": "After lots of praise, I went off an ordered online a $30 pizza. I was all very excited to be able to pick the topings with limited hassle, and payment was smooth, up to the point where after payment, a message indicated the pizza to be picked up at the Stillman location: I live 5 blocks away from the Potrero restaurant. Driving to Stillman St was not really part of my plans for the evening. It might have been indicated before, but obviously the message didn't stick if that is the case.\n\nThe pizza had better be real good. It was not. Not that it was bad or anything, it just didn't live to the hype, and was just OK. For the price and the hassle, not really the experience I was looking for. I'll stay clear from this place now...", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-25", "description": "These guys rock!!!! Ordered for my office party pizza was on time and cooked perfectly, the salad and Blue cheese was great as well.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-16", "description": "Starving my @$$ off on a Friday nite...Ordered a medium mushroom and cheese pizza from Goat Hill for delivery @ 8:45pm, doorbell rings @ 9:15pm, scarfed down my first slice by 9:20pm.  Can't complain about that, my friends...\n\nAs for the pizza, not bad, crust was thick and chewy (I would have preferred thin), but toppings and sauce were on point, only weird thing was all of the slices were covered in black specks?", "author": "Burrito M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-24", "description": "Strictly take-out. Or delivery. \n\nCraving a little pizza in our hood, G. and I took a little walk-see over there to eat dinner last night. Stillman is not an active street, should have known better! Passed right by the damn place.\n\nFortunately, we were able to make a back door order and carry it back home with us within 25 minutes.\nWe had Hilda's Favorite. Pesto, goat cheese, fresh tomatoes. Delicious, yet I did feel the need to dress it up with crushed red peppers and garlic powder. \n\nWill we order again? Uhhhhhh...Delivery charge is an extra $3, and the pizza was $24 itself...Is it really a nearly $30 pizza? No.", "author": "Carnley P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-02", "description": "We haved loved GH, but the delivery pizza has recently been sub par. Please fix this Goat Hill because we think you are usually amazing!", "author": "joshua p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "Order 2 large pizzas with different halves. The guy took my order on one take, delivered on time ( I placed order hours in advance) !! They might be my new pizza spot!", "author": "Y-vee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "Loved the Hilda's favorite pizza.  Really good! Excellent service as well.", "author": "Uma M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-28", "description": "Definitely not the best pizza in SF, by a long stretch.  However, my tastes run toward Neapolitan and this is just \"plain, ol' American\" pizza.  If I get a craving for such, it's not a terrible place to go.  It's not that cheap, though, for mediocre pizza.", "author": "B. Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-03", "description": "Ordered the Mediterranean. High expectations but honestly I was disappointed. Basically received a generic tasting, run of the mill, cheesy, soggy pie. The type that can be found in most run of the mill pizza places. That's ok but not when they're more expensive than those places. What should be expected is unique original flavor from the dough and sauce however the primary taste came from the baked red onions and bland mozzarella. I expect that from Pizza Hut except Goat Hill is 3 x more expensive. Very disappointed!", "author": "Ron P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-14", "description": "we ordered online 5 pizzas and a tray of salad and it was delivered on time. the Portuguese (linguica black olives and green onions) pizza is the bomb in my opinion. \n\nthe only thing bad i can say about our order was that there was a fly in the salad (live). screw the salad tho...hahaha", "author": "Craig I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "Sporting events at home require beer (root or regular), hot wings, and pizza. Goat Hill is usually our household pizza parlor of choice for these events. They have a unique sourdough crust that goes great with the watery ranch sauce they provide. I also love their hot wings. They're not deep fried, but drenched in sauce and tender. The pizza is a little expensive (usually costs us around $30), but it completes a night of football or hockey.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "The four stars are all for the good pizza! The only downside is that does not customer seating (or standing room) but I happily eat Hilda's favorite whenever I get a chance.", "author": "Kristina H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-30", "description": "I originally called Goat Hill Pizza on Potrero Hill, and was given a different number to call (a new delivery location south of Market). I called that number and ordered my Pizza, for delivery to Bernal Heights. The next day I noticed I had been charged an outrageous $4.50(!) for the delivery service. No employee at either location explained this NEW FEE or procedure. Besides that, I was disappointed in the quality of the Pizza, the crust was too thick & doughy & the cheese was weird... I want my delivery charge refunded, so I can go to Arinell's Pizza for a great slice of Pizza!", "author": "Chris Ellen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "Went here for the first time during their all you can eat pizza night. The pizza was delicious. They had about 20 different types in circulation. Had about 10 slices and then I was done. Had chocolate beer here too. Definately going back for more.", "author": "Reo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "Pleasantly surprised.  I had never heard of this place but work decided to have a pizza party and the pizza was from here.  The meat lover's and combo ones were very good.  Did not skimp on the toppings, very fresh tasting.  The crust is nice too.  I would definitely order from here again.", "author": "La C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "Fantastic!   Just ordered a XL for the crew here at work.\nPizza is delicious, as expected and hot!\n\nThis location appears not to be a sit down restaurant.  Back door on Stillman is a perfect take-out location for SOMA.  \n\nmmmmmmmm :)\nRob Jaron", "author": "Robert J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-29", "description": "Good value for your money, the wings are delish! Had them for the first time today, delivery was prompt and the prices were fair. Overall a decent pizza.", "author": "Rose A."}
