{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "No horsing around when it comes to quantity and quality of food at a low price for being located in Nob Hill. This restaurant has been here for decades. This is not for high maintenance diner. This place is for the real San Francisco Chinese dining experience. The King Pao Chicken has roasted peanuts .That's why they are Golden.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Updated review after 3 years and maintaining my 5-star rating.  Golden Horse is probably my favorite hole-in-the-wall restaurant for no-frills, affordable, and quality Cantonese Chinese food.  I used to come here quite a bit with my grandparents since they live so close, both for banquet-style dinners and occasional family-style lunches.  The restaurant has been around for like 30-40 years, and not much has changed it seems.  There is a new Kettlebell Gym that opened up next door, and a Trader's Joe across the street.\n\nI came here with grandma, her caretaker, my uncle, and my wife and sister for lunch.  We ordered some of our usual favorites and they were all cooked and flavored perfectly.  No MSG since none of us got thirsty after the meal either.  Lunch including tax and tip was $80 with plenty of leftovers!\n\nPeking Ribs - They are really good with sweet and sour pork here, and the Peking Ribs are pretty solid.\n\nTofu and Fish Filet - When he was alive, it was the favorite of grandpa.  The tofu was cut a bit thicker than I remember and the fish having a bit more breading, but overall the flavors were still there.\n\nVeggies - Spinach with preserved eggs and egg whites is a classic, but I like the simple sautéed pea sprouts with garlic.\n\nPoached Chicken - Grandma's favorite, and you can get the version that's juicier with that ginger-scallion soy.\n\nBeef Brisket - I only had a few pieces but they were tender and juicy.\n\nSeafood Fried Rice - This version had a nice, light gravy to keep everything moist.  Nice texture contrast with the shrimp and squid.\n\nNote if you are in a hurry, you can also just order a rice plate at the front - Panda Express Style.  If you are looking for a big dinner with lots of people, they can crank out a multi-course banquet too.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Good food but terrible and awful service. The woman is expecting that we give further tip. Tips should be complimentary and not mandatory. Even if it's a mandatory tip, I still wouldn't give since service is terrible and no friendliness at all. Very disappointing.", "author": "Creighton J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-24", "description": "Been going here every week for the last two years, mainly because my grandma likes it.\n\nThe service is awful; almost never get attention from the waiters or waitresses.  Even when the restaurant is empty (it usually is), we usually go get our own tea because nobody ever comes by.  We usually can see workers or staff in uniform seated on the rear tables playing on their phones as we wait for the check or for tea.\n\nRecently, the owner (or rather, most frequent staff member), Nancy, erupted in a screaming match with our family when we refused to eat or pay for the string beans (they were beyond tough).  A bit disheartening to absorb that; no customer, right or wrong, deserves that treatment, let alone regulars.\n\nUsually the food is okay...not anything spectacular.  That's the main reason I'm not giving a one-star.  Despite being constant patrons, we're not coming here again.  Not worth the trouble and poor customer service.", "author": "Matthew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Finding good Chinese food in San Francisco can be easy. I mean c'mon now. The problem I find is usually consistency. For example, my all time favorite is sweet & sour pork, but many times the sauce, or the fatty content, or the quantity is completely different than the previous time. I still have my favorite places and Golden Horse is not in my Top 3, but what they lack in fine dining & ambiance they certainly make up with consistency.\n\nLocated in Nob Hill on the borderline of the good neighborhood and the hoodlum it can be overlooked, but if in the area and jonesing for Chinese... look no further! Golden Horse does have a goofy name, but I assure you no horse is used in any dish that I'm aware of, it's simply one of those Chinese astrology good luck type of names.\n\nI have several favorite dishes here, including my sweet & sour (tho I have genetics for gout so no longer), Peking spare ribs, chicken & snowpeas, just to name a few. They also have really good lunch specials straight from the hot table... & cheap too! Yet, it's also a true restaurant where at night time tables open up and that's when I usually order my special occasion crispy duck w/ chips! Really delicious and one of the best bargains in the city! Soups offered with all entrees. Hot tea with a wink. \n\nLastly, if your expectations aren't sky-high then give Golden Horse a try. Tasty \"Cantonese style\" Chinese food at affordable prices. Add friendly service & consistency! This was my go-to restaurant when I lived up the road & I'll recommend this spot to anyone in the hood.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-24", "description": "Like others have said, the service here is extremely slow, but the waiter I had last visit was better than most here. The food is inconsistent, and it depends on what you get. Last visit, I got roast pork appetizer, very fatty. I also got combo fried rice, which first came with lettuce cooked in! Disgusting. Sent it back. They replaced in with fried rice that had little tiny, uncleaned salad shrimp in it. The rest of the meat was cut into pieces so small, what little of it there was couldn't be tasted! The owners of this restaurant have made a fortune, considering its location, and the fact that it is always full when I go there. Like a number of privately owned restaurants in the city, they are only concerned with profit, and not giving customers quality food at a fair price.", "author": "Ebony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-12", "description": "Good Food Reasonable Prices\n\nOur go-to Chinese restaurant had recently closed.  We got so tired of trying to find a place that we liked that we had given up.  It had been a long time.  Precious had recently gone on record as having a hankerin' for some good Chinese food.  While we were walking to Trader Joe's one evening, we decided to go into this place.\n\nIt's a small Chinese restaurant.  There are hundreds of them in the area, and this one isn't much different. I was surprised at how friendly the people were.  Precious likes to cook, and she frequently talks up people about food preparation and recipes down to what type of oil and spices are used.  The server was flashed a smile and eagerly participated in the conversation.\n\nWhen the food came it was good.  Precious go steamed clams and some steamed vegetables.  Both were good.  I got the chicken with cashew nuts as I always do.  It was good.  The only problem is that the cashew nuts weren't roasted.  They were just thrown on top as an afterthought, but it was good.  We didn't eat it all and brought the rest back home.\n\nAll in all, we'll be going back to this place the next time we get that hankerin'", "author": "Dave M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "The lady working has no service attitude. Worst service she performs.  Sorry to say good food with terrible service.", "author": "Sailesh M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "I had to write a review. There was no other place to really eat. The price should of told me to not go in but I did. So it's like $6.00 for a 2 item combo. One of my items (pork) was cold! Whatever I kept eating but when I saw the cockroach crawling down the wall,  I pushed my plate away and said GROSS!! #HOWBOUTDAT", "author": "Emiliano R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Great service, great food. What more could you ask for? Very inexpensive for Nob Hill. My family has been going here for decades. The west lake beef soup was delicious! So were the honey walnut prawns. Check this place out!", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-11", "description": "Horrible horrible service!! I should have read reviews first and even after seeing their score on the window I should not have walked in. Lady there demands \"more tip\". I felt threaten as she would not let us leave without leaving more tip. She was not even the one who served or help our table. After seeing reviews and pictures of cockroaches I feel disgusted. I threw my leftovers away.", "author": "Ashleyann D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "FABULOUS food at a great price! I'd come back to San Francisco for THIS PLACE!!! Pleasant people too!!!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "This is one of my go to Chinese spots when I'm looking for good food and a great value.  The portions are huge fir what they charge.  This us one of the best hole in the wall Chinese spots in SF.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Great neighborhood restaurant. I went for lunch on Saturday. They were busy, but service was very fast and food came in a flash. I had veggie Chow Fun and I can honestly say it was the best I have every had. Vegetables were very fresh. Serving was huge.  Five stars for the price, quality of food and good service.", "author": "Molly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Total hole in the wall but the food was yummy and came out super quick. Delicious Singapore noodles and good beef with ginger and scallions. The wonton soup broth was just okay but the wontons in the soup were great. Very affordable too.", "author": "Patricia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-15", "description": "Mom wanted a Chinese soup based meal and we lucked out finding a parking space only a block away.  The place had numerous large tables filled with Chinese families celebrating the lunar new year.  I think the banquets must be a good value.\n\nMom ordered the shrimp dumplings in soup. It was a large order and the dumplings were filled with shrimp and looked lovely.  Mom said the taste was not very good.\n\nI had the beef stew wonton soup.  Again, a generous serving that wasn't great.  The wonton were small and flavorless. Not sure what the filling was--usually a diced mix of shrimp, pork, mushrooms and vegetables.  The filling seemed mealy--like imitation meat without flavor.  The beef stew was ok--Chinese five spice meat with fat and tendon.\n\nNot sure if we ordered the wrong things or we are pickier than their customers.  \n\nThe place was full and does a steady take-out business so obviously they have satisfied customers.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "Ordered spicy salt baked cod, and what I got was no spice fried fish - something lost in translation. Egg foo young was too oily - would have been nice to let the oil drip off before serving.  The tea was the best part. Can't mess up tea.", "author": "blaine s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-24", "description": "I don't normally write reviews, but in this case, I felt that I had to. My mom and I had been loyal customers of Golden Horse for a long time. The food was decent and at a good price. But the food has been going downhill while the price continues to climb. We come here because it is close to home and there are no other Chinese restaurants around this area. Recently, my family and I were served beans that were so old that we could NOT eat them. I showed the server, Nancy the plate of uneaten beans at the end of the meal and simply asked for a discount due to the  inedible beans (and because we had eaten the shrimp from the dish). She said NO because we should have told her about this at the beginning of the meal. I tried to reason with her, but her voice escalated to the point where I just wanted to leave. One should never question a loyal customer and especially one who never complains! Whoever coined the phrase, \"The customer is always right\" would get a lashing here. You would slink away with your tail tucked between your legs after meeting the fury of Nancy. Another thing that I think is super rude is that Nancy impatiently hovers over you while you count out your money after a meal, but doesn't give you the time of day and hardly ever comes by to check on you any time during the meal. Don't come here if you want good service, you will be sorely disappointed. On another note, we had encountered cockroaches crawling up walls (on 3 separate occasions), so don't lean against the wall nor place anything that visitors can hitch a ride home with you!", "author": "annie w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-26", "description": "Wandered in during Santa Con and it did the trick. Had lots of options on the menu and the serve time is relatively fast if you flag someone down. They're not super proactive about giving menus nor taking your order. \n\nPortions are fair and prices are super cheap. Didn't feel like there was much MSG as we were still able to continue our run to the bars after.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-27", "description": "I kind of want to give these guys a two after dinner here, but if they don't revoke your canto card as they apparently did mine, it could very well be a four. Judging from all the Cantonese families I saw around, one or two of which were celebrating a NY dinner, and all the chatter from customers and staff alike, the spot should be legit, so I'm giving them a 3. However, be warned, as I ordered some snow pea shoots (dau miu/dou miao) with garlic, and they served us a  mound full of somewhat sickly-looking veggies, with patches of yellowing. No restaurant should serve their customers vegetables like this, grr. I suspect they may have advised others to not buy their expiring pea shoots, as we didn't see anyone else with it, even though the waitress said they were good today. :P\n\nThe pork and taro clay pot was interesting but not what I expected. It uses fatty cuts of belly, like in mei cai kou rou / mui choy kau yuk, but layered with taro, all on some lettuce in the clay pot. Not bad, but I was hoping the taro would be nice large chunks, not something that was closer to mashed potatoes when you dug into it. Definitely a heavy fatty dish; probably wouldn't get it again.\n\nThe pork and snow cabbage soup was a pleasant surprise. The toppings were nice (pork, seaweed, cabbage, and a surprising amount of bean sprouts), and the soup not starched up the wazoo like Americanized Asian soups are. Although instead of starch to thicken it, it had a ton of rice noodles underneath the toppings. Wish it had a bit less noodles and more broth; we had tons of noodles left, which also soaked up quite a bit of soup. An order of that could easily fill someone up and then some.", "author": "Linus W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "This is the most underrated Chinese restaurant in all of SF!!!! Super good prices and very very nice taste and quality....really surprised. Wish I knew about this years ago...I'll be coming here all the time now! My new go to :)", "author": "Eric C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-01", "description": "My mom likes to take the family here.  This was our second trip here,  ironically we came here for Chinese new year before and not American new year like this time,\n\nThe place is clean and well lit but it is cramped and my chair was so wobbly as it was old.  A heavy person probably would have broken it.\n\nMy mother pre-ordered a stuffed sticky rice chicken which was not as good as I've tasted elsewhere.  The rest of the meal was fine.  Chow fun with black bean, westlake beef soup, tomato beef cried chow mein, green beans, and pork ribs.\n\nAt the end they gave us a tapioca pudding soup to clean our palate.  I always prefer the tapioca over the red bean.\n\nThe prices here are great.  We fed a group of 10 for less than $100.  Parking can be tough, but if closed you can park at the Trader Joe's across the street.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "3.5 STARS\n\nJust had an early Father's Day dinner here yesterday night. We got one of their set menus. I believe it was $168 for all dishes below.\n\nBbq combo platter - Good variety. It had duck, ribs, bbq pork and my favorite, jellyfish! \n\nShredded abalone and chicken soup - In need of a little more flavor. The soup had a nice consistency, but I needed to add some salt and lots or white pepper since it was a little bland.\n\nHoney glazed walnut prawns - Prawns were perfectly cooked! A little crispy with a nice blend of creaminess from the mayo and a hint of sweetness from the honey.\n\nBeef steak and scallops in honey black pepper - Beef and scallops were nicely stir fried. Peas still retained a nice crunch.\n\nSquabs meat stir fried with vegetables - A little gamey but I loved the vegetables! Especially the celery! \n\nGolden fried crispy chicken (whole) - This dish can be on the drier side in general. I ate a piece of dark meat which retained it's juiciness, but the white meat looked a little dry. My little cousins loved the chips!\n\nGinger scallion lobster and crab - The set menu we got said Lobsters in supreme sauce. Knowing my parents and how they prefer crab over lobster, they probably swapped out one of the lobsters for crab and asked to make it with ginger and scallions. This is one of my favorite dishes! We got a whole lobster and a whole crab. Sooo good! \n\nBraised sea cucumber with black mushroom - I don't like sea cucumber but I love lettuce and mushrooms! I kept picking at this dish after I was full!\n\nSteamed live whole fish - Another one of my favorite dishes! I love fish when it's steamed with soy sauce, ginger, etc. It's normally so moist! But this one was a little overcooked so it was a little disappointing. Plus the fish was on the smaller side. At least it came at the end when I was pretty much full.\n\nBraised yee foo noodle - I didn't really eat this dish so I can't comment on it. One of my cousins took the sauce from our fish dish and mixed it with the noodles. Said it was delicious that way!\n\nRed bean dessert - I didn't have this either since I'm not a huge fan of these soupy Chinese desserts. Everyone who ate it like it.\n\nService was nice and friendly for a Chinese restaurant. We were brought waters, napkins, etc when asked and they would come around and fill waters. Hence the rounding up to 4 stars!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-14", "description": "This place is a joke. The only thing I can say they have going for them is that it's consistently decent Chinese food at a good price. Their sesame chicken used to be fantastic. But now it's filled with pieces that are very tough and end up being discarded. I politely asked them last time if they could give me a fresh batch because the chicken has been \"very tough and not very tender.\" The fellow behind the counter was very accommodating as far as his demeanor and response, but I still received \"tough\" pieces of chicken. I did not realize this until I brought it home as it was a to go order, so I didn't have an opportunity to send it back.\n\nI recently called for a to go order at 8:49PM. The woman on the phone said \"We're closed.\" I said, \"I thought you closed at nine.\" She said, \"Our last call is ten minutes before closing.\" I said, it's 8:49. May I please place an order?\" She said \"Sorry.\"\n\nThe only reason I go here is because of the aforementioned decent pricing and that it's close to home. But these are the laziest Chinese restaurant employees I've seen in my life. So I'm caught between going here or to a Chinese restaurant where the service is more efficient and the food costs a couple more dollars per dish. I'm afraid it might be time to move on. Golden Horse, you were good for a while, but now you've lost the quality you once possessed. Maybe I'll return when things improve.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "The great horse restaurant is wonderful. As a potsticker snob I found the dough of the potstickers to be a little thick but the filling was great very well seasoned. The black beans chicken was delicious. The chicken was so tender in the sauce just had a hint of heat. The beef skillet was on point and sizzling as it arrived to the table. Hot and sour soup is exactly what you want on a typical SF day! Although I live in Phoenix the golden horse will definitely be a stop for me every time I'm in town.", "author": "Akemi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-07", "description": "This my neighborhood Chinese restaurant.  I live exactly 1 block west.  \n\nI have eaten here for years...up to exactly 1 year ago.  I tried it again.                                       .                                                                                                        \n\nThe restaurant was empty at 6:17pm.  I ordered my usual items.  \nA small bowl of clear stock.  The usual sprinkling of green onion was missing.  The stock was lukewarm and smelled of pig's trotters and tasted strongly of MSG.                                                                                   .                                                                                                     I worked in many good Chinese restaurants.  The lukewarm  broth's lack of garnish and taste, was the lazy young cook.  \nHe put in frozen pork bones and too much MSG in the stock pot.  He didn't reboil the broth.  This can sicken you...or worse.  \n\nEvery Chinese restaurant uses MSG in the stock.  Why else is a bowl of MSG near the stock pot?                                                              .                                                                                                         The appetizer dish was salt and pepper chicken wings.  No color from being cooked in cooling oil.  Most bones were reddish and the meat rubbery.  \n\nThe garnish was burnt granulated re-hydrated garlic and mushy green onion...no hot green pepper.                                                       .                                                                                                     The last dish was beef with broccoli.  The sauce was watery with undissolved starch/soy sauce globules stuck to the otherwise OK boiled broccoli.  \nThe beef was barely cooked and cold.                                                               .                                                                                                      Everything came at once.  The total kitchen staff alternated hanging out in the dining room 1 table away from me.  Lookouts for the owner, no doubt.  \n\nMy waitresses, who remembered me, never asked how my meal was.  The only other waitstaff was the bored waiter that brought my food.                                                          .                                                                                                        I know why I didn't eat here for a year.  I hoped that the experience would've gotten better after 1 year.  It got worse.  \n\n.", "author": "Li, F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Across from TJ so I can get the shopping in after dinner!  Best HK style noodles in town!", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "Do not come to this restaurant I caught the waitress hiding behind the wall eating part of our food then she gave us the food I told her she ate some she said the cook said she can have some so I just left", "author": "Victor W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "never order from here on sunday ! the tomatoe beef chow mein the meat was old had a rancid taste to it !  we order food from here every week mostly on Thursday . I see they just use the meat even though it is old . golden horse never use old meat again or the health dept will find out and you will be shut down !", "author": "Nellie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "The restaurant is not hygiene. When I poured the hot tea into my tea cup, a cockroaches came out from it. I let the waiter guy know about it, he only took it and replace it, without say anything. Don't eat there if you concerned about hygiene. The food taste is so so, nothing special.", "author": "Jayden H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-05", "description": "This place has... How shall I call it? FLEXIBLE pricing; Constantly changing. In fact, I think they just charge whatever the hell they feel like charging at the moment when you order. I was at Trader Joe's (across the street), and decided to pop in for some quick take out on my way home. I checked them out on Google first: Their price for a shrimp fried rice on this menu was $5.25 (http://places.singleplatform.com/golden-horse-restaurant/menu?ref=google. Also: http://sanfrancisco.menupages.com/restaurants/golden-horse/menu). OK, $5.25 is REALLY affordable. I wouldn't be surprised if it were more than that. So I went in, and had a look at their printed take-out menu. The price of a shrimp fried rice  on THIS menu was $7.25. I ordered it, still. Of course, when it came out, they charged me $8.50. So, right off the bat, there's a problem here. I was most certainly overcharged, and while $3 isn't going to break the bank, it's the PRINCIPLE here that matters; the outright dishonesty, and attempt to deceive. Beyond this, what I ultimately received, while certainly EDIBLE, was probably only worth about $5.25 in the end. It was nothing special at all: Bland, uninteresting... So, my advice to you all is \"Don't waste your time\". They need to figure out what the hell they're doing there. And they're probably taking you for a fool anyway. Screw them. There's a million other Chinese restaurants in this town. No sense in wasting your energy (and money) here.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "This place is the best Chinese food I've been able to find which is not exactly an easy task in San Francisco for some reason. The best thing about it is the portion size which will surprise you at first. The second best thing is the  prices which are great on your wallet. The food is served hot and fresh. It fills you up. THEY DO NOT DELIVER OR TAKE ONLINE ORDERS! I made this mistake and went in to pick it up to find out what was going on and they explicitly told me this, so don't be fooled by online scams.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-21", "description": "I and a friend went to this place on a whim. I was a little concerned over the \"Health Dpt.\" ratings that were posted online that were extremely low. But I decided to go there anyway. The server was more concerned in playing on his \"device\" then giving decent service. I had to get up out of my chair to get some Chinese hot sauce and also some soy sauce. He then went back to his \"texting\" and it was impossible to get his attention again. My friend and I ordered two lunch combos. Mine was cold and my buddy's was so so. Upon eating my meal, I spotted a tiny insect running across my table. It was a baby cockroach. That pretty much finished my meal. The server sat there while others cleared tables, and another server came over and offered to box up our food and get our bill, all while our server was pre-occupied with his mobile device. I also mentioned/showed to the lady whom finished up our situation the smashed insect, and she apologized. I suggested that she bring this to the attention of her management, of which she reluctantly agreed.  It's bad enough to received bad service and mediocre food, but to have insect infestation is deplorable. I won't be going back there again anytime soon.", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-01", "description": "I've been to this restaurant several times and have found the food surprisingly good and the prices reasonable.  I get the typical stuff like combo fried rice, house special chow mein and ordinary chicken, beef and seafood entrees (a la carte). Portions are large.  The kitchen staff is very efficient -- you get you food quickly and the wait staff are also efficient.\n\nThe place is very spartan and the store front is in need of a long overdue facelift as well.  \n\n\nOh, the boss-man should install a second phone line for the credit card machine so that the staff can take orders over the single line telephone.  Cheap owner(s)!  And this single phone line could pose a security risk for credit and debit card users at this restaurant.  I figure someone could hack the card reader through this single line. \n\nA decent place to get a decent meal for a reasonable price in a very gentrified Snob Hill!", "author": "Peace L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-09", "description": "Luckily the smelly octopus was refundable. .I put a star to award them.. hey, chef,  u don't need to come out and give me that look if u did well with your dish...u smell before u put on my table please", "author": "Francisco H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Golden Horse is our go to place for Chinese food in San Francisco. I especially love the Kung Pam Chicken. My husband also likes the Mongolian Beef. Egg rolls fresh and delicious.", "author": "Jonelle S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-10", "description": "For over a decade this resturant use to be my family's favorite to go chinese restaurant. Not only because it's hella close to where we live, but the food was good and the price is unbeatable. \n\nNOW.... They changed owners... It has gone down hill =/ We don't even THINK about coming here anymore. Maybe for to-go when we're in a hurry or someone's sick. But whenever we did come here to eat, it is a let down =/ The food just isn't the same. I miss the old Golden Horse... the place use to be PACKED all the time, now it's barely half full inside =[", "author": "Ruhjeenuh Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "This is a solid Chinese restaurant that's very welcome in the Nob HIll neighborhood.  Pretty decent prices for Nob Hill / SF. Most dishes were less then $10, and the vegetable dishes were only $7. Only downside is that they don't have rock cod. Even though it's on the menu, apparently people don't order it enough, so they stopped serving it. The rest of the fish on the menu (flounder and catfish) are pretty weak. \n\nTip: The soup of the day / house soup is on the house too if you ask for it. \n\nThey also opened a branch down in Cupertino in the Vallco Mall that took the place of Dynasty Restaurant. They may carry a larger variety of dishes in that location.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "Too bland for me! The Combination Seafood with Tofu in Clay Pot had so much tofu and tasted like nothing. The Chicken Chow Fun was also bland and very very oily. The only thing that was good was the Schezuan prawns, but they would have been better battered!", "author": "Jane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "I had the Mongolian beef and it was GREAT!!    And it was very wallet-friendly.   It's a pretty casual place where you go up to the counter to pay at the end.   Great for low-key informal quick delicious Chinese food.", "author": "Nathan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-15", "description": "18 years going here and the service has fallen. Had a reservation for 10. Came early. They still gave away the table.\n\nFood: decent. Peking duck is not bad. Walnut shrimp is good. Soups are tasty. Steamed fish is tasty. Lobster tastes great because it's cooked with ginger and other yummy Chinese flavors you can only get in a Chinese restaurant. \nService: lacking. They definitely just want you to eat and leave. Some restaurants I understand but this is a restaurant that has banquet-style menus so attentive service is very necessary. \nCleanliness: don't come here if you want to eat at a fancy Chinese restaurant. Some glasses and diningware may be a little dirty so just ask for a replacement!\n\nOverall just don't expect too much. Not a place to impress others.", "author": "Stacy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-21", "description": "The Fantastic-4 used to dine here numerous times before and after shopping at Cala Foods, which is located right across the street. To us, the service is great and family-friendly, but the food can be unpredictable.\n\nEarlier today, I took my daughter with me grocery shopping at the adventurous Cala Foods. Before our shopping, the restaurant was crowded on Sunday midday. I wanted to eat there, but she wanted the food to take home so she can watch the 49ers' game and the conclusion of NASCAR. (Yes and just like me, she loves watching sports on a Sunday.)\n\nWe placed our order, go shopping and come back. One of my daughter's favorites is the Salt & Pepper wings. And one of my favorites is the Vegetarian Fried Rice. Both totaled to $10.50. \n\nWe get eight spicily seasoned fried wings. In the past, we enjoyed the wings from here. But unfortunately the wings from today were a bit dried and had an unusual aftertaste. I was never a big fan of Cala food's meats and I hope the restaurant didn't pick the wrong batch.\n\nOur fried rice had rice (of course), chopped broccoli, water chestnuts, peas, baby-corn and eggs (eggs can be optional). At least, this rice dish we can enjoy and we chose a winner with this dish. \n\nDespite the mediocre meal and being close to our crib, my daughter and I will be eating here again. Unfortunately, we came on an off day!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-12", "description": "This place needs some KPOP or JPOP in the background. Just sayin'\n\nI ordered the beef short-rib with black pepper sauce lunch special.\n\nThe dish came with plenty of short-ribs, sliced green peppers and sliced white onions (makes me more kissable haha).\n\nMy only complaint is that the dish arrived with a whole lotta oil nestled on the bottom of the serving dish.  It was also fairly salty. \n\nOther than that, the ribs were beefy and flavorful.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "I had a last minute business meeting to plan for and these guys were able to accommodate me for a to-go order for 15 people. Amazing food and great service! Very fresh, not greasy and no MSG! Definitely recommended!", "author": "Emily H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-05", "description": "Dirty! \nBad service! \nSmoke filled restaurant! \nFood isn't so great w the exceptions of the potstickers!\nM soo confused about people who gave it 5 stars! Really?", "author": "Anudari K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "This is NOT American Chinese Food.  So if you are looking for Panda Express or the type of place that you can get chicken chow mein or sweet sour chicken, you will not be happy.  This place is for the authentic chinese taste for those that immigrated to SF many years ago, or really know family style cooking, Chinese American style....\n\n1.  Ambiance - What can I say, this is a small place and drafty as well.  The decor is decidely inexpensive and well, the best chinese places have the worst restrooms, so this place is pretty darn good as far as chinese food goes, which means the restrooms are........\n\n2.  Banquet Size tables - They have three of the large size tables that can seat 8-10 easily. Big Lazy Susan for moving the food around, this makes for a perfect family get together.\n\n3.  The food - Here we go.  This is a chinese restaurant which means that you will find the service to be sub par according to western taste and perhaps abrupt.\n\na.  Fixed Menu - They have three fixed menu for 27.00, 36.00 or 57.00  Each of these has soup and then a variety of meat and seafood.  We had a table of 8 and I ordered the 57.00 menu.  It came with soup of the day, which is the best always.  Steamed Flounder, clams with black bean sauce, crispy chicken, crab with ginger / garlic, bok choy and mushroom, Peking Spare ribs.  As mentioned, the soup is the type that I have a hard time to find outside the SF Community and had to learn to make at home.  Double goiled, fish maw and crab. It is awesome.\n\nb.  Plus - I always order one or two add on to the fixed menu and have tried many, such as:\n\nc.  Beef Chow Fun (Dry) - I always order this for the kids and here it is as good as it gets. The noodles are the right consistency and firmness. The beef if extremely tasty and tender as it melts in your mouth.\n\nd.  Chicken with green onion and ginger - This is my favorite besides the salt baked chicken.  It is a simple dish, which brings out all the best flavors of the chicken and the chef's skill. This is essentially a boiled white chicken, whole or half and cut into bite size pieces that have all the bones in it.  Here it is great.\n\ne.  Steamed black Bass - I always love steamed fish and if the restaurant has a fresh water tank for the fish, I order it.  This time, they had bass and it was very nice. The mixture of steaming it with green onion, cilantro and then the soy sauce and oil is just right. Easy to remove the bone and to chow down on the tasty morsels!\n\n4.  Go back factor - This is my go to place when in town to see friends and family.\n\n5.  If you are from Hong Kong or southeast asia, you may find this place a bit under performing.  If you are a descendant from the Chinese immigration 100-150 years ago, you will know what it means to have this type of food at this restaurant.  Not the typical Panda not the typical fancy asian place, just right for those born in or near Chinatown!!!\n\nGK says, check it out.", "author": "Greg K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-22", "description": "The seafood and tofu soup tasted like dishwater.  (Not to mention they gave us the WRONG soup in the first place.)\n\nThe sichuan sizzling plate beef was really tough.\n\nThe seafood combo dish with veggies was by far the best choice.  \n\nOh by the way, they love celery.  It's in every dish, and in abundance.\n\nBottom line - if I can cook better than they do (and I'm really not much of a chef), then they shouldn't be in the restaurant business.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-04", "description": "Haven't been there for quite a few years.  Looks like it has new owners.\nFood was only ok.  Use to be my favorite place to go!!  Food was ALL very bland.\nToo bad.  Service was pretty poor.  WE were the only one in the restaurant and\nwe had to chase them down to get anything.  Sad.  It use to be pretty good!", "author": "Sandra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "Corking fee of $4 only and variety of seafood options - I had a great pre-new years eve dinner - standard Chinese fare but extremely flavorful", "author": "Rupa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "Tired of the run around. The food isn't good, but it's a decent local spot. Half the time you try to order a basic Wanton Soup, but mysteriously get up-charged on their combo soup which combines ROTTEN meat + veggies. Seriously, it smells foul. Who eats this?\n\nAvoid at all costs. It'll go out of business soon enough. Regular wanton soup without rotten extras is edible when drunk.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Local fav. \n\nIf you are looking for a good cheap hole in the wall restaurant this is it. \n\nThey serve large portions. I order the hot and sour soup every time, they put virtually everything in it. \n\nDon't go and expect anything fancy. Go when you want to pig out on a lot of good Chinese food and take home leftovers at a great price.\n\nService has always been great for me. Never disappointed.\n\nOne of my go-to restaurants.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "They have tomato beef with curry chow mein - super yummy. The combination is one I grew up with and I can't seem to find it down in Southern California :(", "author": "K L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "Just dine in. Very satisfied with the food and service. I ordered the dry fried ribs, chow fun crispy noodles with beef. It was fresh and very, very delicious! Better than most Chinese restaurants I had in SF. They also have great delivery service which begins at 5pm till closing. I once had them delivered to my hotel room when I first discovered the business. I am glad I did that or else I wouldn't have found great Chinese food. I recommend this place to everyone. It won't let ya down.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-05", "description": "Been here twice, there's no such thing as customer service at this place, the food is ok for the price tho. But after someone found a whole ROACH in their food, there is NO WAY I'll ever go back !!! YUK !!!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-04", "description": "It's strange that no one wrote anything on Yelp about the decor.  It was the first thing I saw.  There is DUST on everything.  Look closely,  The walls are dusty, the ceiling fans are full of dust and the walls are BLACK!  THey're suppose to be white.  It made me nervous to eat here.  I was wondering about the hygiene of the place and why the wait staff sat down to chit chat way too often and didn't clean.\n\nWe ordered their seafood soup, almond chicken, and veggies.  The food was definitely bland and not the best but not bad either.  At least the condiments on their table was not full of dust.  Their chairs are also worn out as well. You are definitely not coming for the decor and this is definitely one of the dirtiest restaurants I have been.  I would not go back even if I were in the area.", "author": "Eating And Living Well U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "One of the few places I can get general tso's (yes, I'm a midwesterner, get over it) that isn't soggy or doused in sauce. I enjoyed everything we ordered, and they were super fast.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-15", "description": "My first experience at Golden Horse was for Chinese New Year's Eve (Perhaps Daniel C. was at the neighboring table?) and our biggest challenge is finding a restaurant that can accommodate our large family.\n\nLuckily, they have one very large table near the front and my mom was sure to reserve this just for us!  Unfortunately, it was not ready when we arrived as the previous party was still eating and there were lots of people waiting to be seated.\n\nWe ordered a bunch of stuff...\n\n* Jellyfish and Cold Meats Platter - Beautifully laid out, surprisingly.  I say that because with it being so busy, you'd think it would have come out a bit sloppier.  Jellyfish was good, standard for Chinese restaurants.\n\n* Shark's Fin & Shredded Chicken Soup ($24) - The waitress was messy when she served up this dish. My brothers were offended that most of the soup hit the table.  (It wasn't that much, but she definitely wasn't careful.)\n\n* Squab in Lettuce Cups - A generous amount.  This dish at our restaurants barely has enough for our party of 11, and there were leftovers this time!\n\n* Honey Glazed Walnut Prawns with Mayonnaise Sauce ($9) - One of my favorite dishes and I ate this all up!  Yum!\n\n* Seafood in Mixed Vegetables -  A standard display of calamari, veggies, and a glossy finish.\n\n* Crispy Chicken - I ate the shrimp chips but skipped the chicken.  We had leftovers of this dish to bring home.  Obviously not a favorite for us.\n\n* Steamed Fresh Crab with Garlic Sauce - We're usually a family of crab eaters, but this time it was left untouched.  Once the heads were gone, we had a few crab pickers.  \n\n* Chicken with Salted Fish Fried Rice ($6.25) - I'm not a big fan of fried rice, but my family likes the salted fish variety.  We also had steamed rice, so it wasn't as popular as it could have been if the steam one never showed up.\n\n* Deep Fried Stuffed Bean Curd ($6.75) - Another favorite of mine, especially when it's sauced up.  Good with white rice.\n\n* Steamed Fish - It was on the smaller side of life, which barely fed our family.\n\n* Pork Ribs - I usually skip this, especially the wet ones.  There's usually too much other stuff I'd rather get my fingers on.  \n\n* Long Life Noodles - A big surprise for all of us.  Usually bland and something that you order just because, it was surprisingly good.  Everyone was eating this up and no leftovers here!\n\n* Dessert was red bean soup.  Again, not a favorite of mine and always gets skipped.\n\nOverall, we had a lot of food and a few boxes of leftovers.  Prices were decent and service was just alright.  My family seems to be somewhat pleased with this place because they've been going there a lot in the past few months, so it works.  \n\nI did take photos of some of the dishes before my family members got their chopsticks into it!  Some of the dishes may have been doubled to accommodate our hearty eaters.\n\nUpdate! 05/4/08 - Went back for dinner last night and tried a few other dishes.\n\n* Soup with egg, corn, calamari?, and some other stuff -  Pretty good, I don't know exactly what kind of soup it was, but you can check the pictures to see for yourself.\n\n* Peking Duck - Fatty chunks of duck meat.  They still use the big buns with the red stamp on it!\n\n* Steamed Chicken with Ginger & Scallion Sauce (Half $7.50) - It tastes so good with the sauce!  Ask for extra sauce so you can slather your chicken with it!\n\n* Deep fried fish with snap peas - The fish was a bit dry, it needed some dipping sauce to give it a kick.  \n\n* Dessert was different this time - a coconut based hot sweet soup that was yummy and had us asking for more!  Definitely better than that red bean crap!", "author": "Teri C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-08", "description": "This will probably be my go-to for Chinese take-out.  It's fast, reasonably priced, and pretty good.  We walked in on a Sunday night around 8pm and ordered three dishes.  We were walking back home with our food in less than 10 minutes.\nThe food like I said is pretty good, nothing memorable, but it does the job when it comes to Chinese take-out:\nBeef chow fun: This was good and the portions are very generous.\nSweet and sour chicken: The sweet and sour is a little overpowering and I wasn't a huge fan of the soggy pineapples.  \nPrawns with candied walnuts: Very heavy on the mayo.  And they don't give you all that much.  This is the one dish I would not order again.\nThese three dishes plus a large order of rice came out to $25.  Not bad.  It fed two of us for dinner and there were enough leftovers for my lunch the next day.", "author": "Gloria N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Had the food delivered last night.  \nI ordered  \"Braised Tofu with Chinese Mushrooms.\"\nI was pleased with the flavor, quality and the portion size.\nAfter two previous attempts at hot and spicy entrees and being so, so disappointed with a quick dip of a mild chili in the sauce when I had requested medium hot.\nI'd recommend them to friends for traditional take out.", "author": "Corinne d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-29", "description": "This review is only based on their TAKE-OUT.\nI have never set foot in this place.  I've only walked by it.  My co-worker orders take-out from them.\n\nPortions = big.\n\nNoodles = delicious, savory, etc.... A bit on the greasy side.\n\nWor wonton soup = bargain. Tons of wontons, pork, shrimp, chicken, veggies, and soup.   Total bang for the bucks.\n\nService = I have no idea about.\n\nPrices = reasonable.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Ordered Beef Chow Fun again. Approx $8 and very quick for pick up, less than 15 mins. Everything about it was great except it was just a tad bit bland and could have used more soy sauce/salt during the cooking process. Otherwise, I would definitely come back for this. See picture for beef chow fun take-out goodness!", "author": "Curieux V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "We came to eat here in the afternoon. It was busy with people who stood in line for the takeout food order. We decided to eat in. The food was good and very affordable. The combo plate was worth the $10.98 + tax. I would come here again.", "author": "B C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-01", "description": "Try the wonton soup! The wontons in said soup are fried and then boiled, making the soup rather hearty. Other favorite dishes include chicken with salt fish fried rice and noodles with lobster.\n\nMy stepdad is Cantonese-American, he was born and raised in Chinatown, and the Golden Horse is his go-to Chinese restaurant, so that has to count for something.", "author": "Dante and Alleliah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "Looking for good Chinese food in Nob Hill ? Or in San Francisco outside of Chinatown ? Well..try this place. Ive been eating here for well over a decade be it dine in, take out or delivery..they know who I am for one thing which is pretty cool. They have a great menu with all kinds of choices. There hasnt ever been a meal I didnt like and have tried a few different things that arent very common such as spicy chow mein or tomato beef chow mein..well they were not common at the time..\nPortions are great. I love their Pot Stickers, Wor Won Ton Soup and Kung Pao Chicken. Their service is on par with a lot of other Chinese restaurants (they take your order, give you water and say *thank you* ) Prices are good. \nHighly recommended !", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "This is the only Chinese restaurant would make how I want the dishes to be made.  \n\nI frequently asked for no salt or little salt on my soups, they prepared those from scratch instead of giving me what they have prepared ahead for the day.  \n\nWhen I requested different varieties on certain dishes, they did exactly what/how I wanted those to be done.  The lady always told me \"We will make anything you ask for\".  I am impressed, indeed. \n\nI ordered the \"old town steam eggs\" every time I visited.", "author": "Veronica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "I came across this place by accident when my grandmother had an appointment at St. Francis Hospital.  I was hungry and stopped by this place to pick some food.  I ordered a chicken fried rice and I was blown away buy the taste.  It was great!  Parking can be a challenge in the area but I go there to pick up an order for lunch.  The price is reasonable and the amount they give you is very generous.  The staff is very nice and they get the orders to you quickly.  \n\nThere is a long line for their lunch special.  Three quick items that is less than $7 is a deal.  I recommend anyone who enjoys authentic Chinese food to stop by.  Once you become friends with the owners, they hook you up too.  They changed out their take out containers after many customers complained of leaks.  At least they listen to the free advice from their customers.  \n\nTry this place out.  You won't be disappointed.", "author": "Wayne W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-13", "description": "It boggles my mind how anybody could possibly give this place more than 2 stars.  But, when it comes to food, most of the population is easy to please (which I suppose has some relationship to the obesity statistics).   If your palate doesn't discriminate, it doesn't matter where you eat, and they are all 4 or 5 star restaurants.   So, if you rated this place more than 2 stars, you don't need restaurant reviews, because everything is wonderful, and I hope you don't write any more of them for the sake of those of us that do need restaurant reviews.\n\nNow that I've vented, the food at this locale is greasy and crudely prepared with little flavor.   Generally, the cleanliness was mediocre (which is more than I'll say for the food).  However, in my case, the menu itself was terribly dirty and gross.   The food is cheap, but crappy enough not to be worth the low price. This place is really a last resort.   With Trader Joe's across the street, you'd be better off picking up something there.", "author": "Richard F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "My mom like to eat near her home so we regularly come to Golden Horse. We are always able to find a table here and food is prepared pretty fast.  Portions are good when ordering A la cart. Rice plates have more rice than entree. Food is ok and you will walk away full. Service is ok.", "author": "Craig T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "Szechuan Chicken Chow Mein good cheap eats )", "author": "paul m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-12", "description": "If you are looking for a themed Chinese restaurant with sub-par food this is your place.\nThis place is not good at all so, look for another place in my opinion. \nThe staff is not very friendly, and have little patience when you are trying to decide from such a large menu. \nThe food looks to be standard fare, but the taste is bland, and nothing even close to what Chinese food should taste like. \nLemon chicken was soggy, and the lemon sauce was wattered down. The War Won Ton soup had frozen dumplings, and a full piece Bok Choy thrown into the soup.\n\nThe place is usually empty which isn't a good sign...right. \nTo use a card you have to spend over $15 so, be prepared. \nThere are better places in the TL or take the 38 to JapanTown.", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-29", "description": "A Cantonese friend brought me here, and I agree with him when he says the egg foo young is one of the best.\n\nThey have some sea clam with jalapeno vinegar sauce which is also quite good.\n\nOne pretty big drawback is the state of the lavatory.  I'm not sure I came out cleaner than I went in.  Hope the cooks get to wash up somewhere else!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "How could you not like this place?\n\nThe perfect corner chinese restaurant for your takeout.  I'm sure they have fancy pants places all up in Chinatown, but the staff is nice, it's uberly cheap, and overall.. damn tasty!\n\n- Beef Chow Fun w/ Black Bean Sauce: Perfection.  Definitely amazing and tasty.\n- Chicken Fried Rice: It's hearty, tasty, and yummy.\n- Crispy Fried Chicken: Something about it.  I don't know.  It's just good.\n- Honey Glazed Walnut Prawns: Yum! They do this well and they do this right.\n\nYes this place isn't fancy and its not ideal romance.  But it's good food that hits the soul.  A great take out place, but just a great place to get yummy food.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-21", "description": "I'm very saddened that I must write this review.  I have been here a few times in the past and generally have been satisfied.  However, after today, I'm never going back.  I ordered a Wor Won Ton Soup to-go and got about 1/2 way through it before I saw it.  I big cockroach in the soup.  Obviously, I didn't finish and my appetite was gone.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Very cheap with huge portion sizes. We got the scallops and veggies and they were not particularly exciting, but it was exactly what I felt like, a giant healthy meal. Definitely will return.", "author": "Fionski M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "Man....................the Mongolian beef noodles dish is to die for.  I think it is great because I can honestly say that I have never had a dish like this before.  It is spicy, beef is tender, noodles are cooked perfectly.  If they added some vegetables to this dish, I would actually have this dish at least once a week.  \n\nI ordered food to be delivered and it came quick.  I ordered:\n\nWor Won ton...........my god this order was huge.  They should call this the kitchen sink won ton.  It's a humongous order.  Shrimp, chicken, squid, pork, and I know there are 3 other items that I forgot to list.\n\nHoney walnut shrimp...........it's good.  Had better\n\nsweet and sour pork spare ribs.........Very good\n\nThe show stopper............has to be the Mongolian beef noodles.  This dish actually helped this restaurant moved from a 3 star to a 4 star.\n\nThe reviews here about the service being bad.........  It's probably true.  I received my orders wihtout any plastic utensils or napkins.  The lady who took my order wasn't too personable.  I would definitely come here for dinner one night.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "I've been eating at this restaurant for as long as I remember, so about 23 years give or take. Still the best go to restaurant for Chinese food. Great great great! place for family dinners. Every chance me and family get we come here for dinner. We usually roll in large groups, so we get seated in the large tables behind the wall which I find very special to sit in because it feels like you have your own dining room. \nThe servers are amazing. The restaurant is family owned, it's usually the same servers and their always cheerful and energetic which really helps bring me into a great mood on gloomy days.\nThe food is awesome! I tried about everything on the menu and this is what I recommend. \nAppetizers:\nHoney-walnut shrimp (best in the city)\nPot-stickers\nFried Oysters\n\nEntrees:\nMongolian Beef\nSichuan Eggplant\nCrispy Pork with sweet and sour sauce\nSeafood over rice\n\nGreat prices and really worth going there for lunch for a quick bite, dinner by yourself or in large groups, and delivery if your just feeling lazy at home. Btw delivery is awesome. The wait time is usually very fast, food is still hot when it gets to my house", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-07", "description": "I am boggled by the fact that some people leave this place 4 or 5-star reviews... never mind that this place has even managed to accumulate 3-and-a-half stars on yelp.  How does this even happen?\n\nMisled by reviews, I urged my boyfriend to dine here with me one evening when we were hungry and in the mood for some favorite dishes.  To be specific, I mostly wanted to come here for the honey walnut glazed prawns since a few people reviewed that they did this \"right.\"  Incorrect. This is not that good. The prawns were dry, the walnuts were charred, and well... I dunno what to say. It's just not \"right.\" So I'm not sure where people get that idea.\n\nWe also ordered hot and sour soup. Why did no one comment before how HORRIBLE this was? This is even more baffling than the 4 and 5-star reviews. It is incredibly insulting that they would even dare to serve such a poor, amateur attempt of hot and sour soup in exchange for money.  The soup tasted absolutely nothing like traditional hot and sour soup.  There is no flavor... unless you count the taste of weak, extremely watered down vinegar (you can hardly even taste the vinegar, and that's just sad), and I didn't detect any pepper in our bowl, much less the taste of any spices.  The soup did have the typical ingredients that make up hot and sour soup, such as egg and tofu, but there were MYSTERY PIECES of meat that were also included.  (Really?!?!)  I think I got some bits of sweetened pork (lit looked oddly red and looked like it was meant for another dish), bits of beef, and shrimp that had an off taste.  The soup, overall, was too light in color in comparison to traditional hot and sour soup - a light, clear pink/red as opposed to a dark, opaque brown.  The broth was also too thin. In order to salvage this soup and make it more palatable, I added soy sauce to mine, and I advised my boyfriend to do the same. He agreed the soy sauce improved it greatly.  If you, for some reason, end up in a situation where you are at this restaurant for reasons beyond your control and you have to stomach this hot and sour soup, you should add soy sauce to yours, too.\n\nMoving along. We were craving a favorite dish, Peking pork spare ribs, so we got that, too.  Another dish gone wrong.  Doesn't have the typical bright red color, doesn't taste the same at ALL. If anything, it reminded me of orange chicken.  Needless to say, Peking pork spare ribs should not be reminiscent of orange chicken.  I don't know what to tell you.\n\nThe service was quick, however... a bit *too* quick. We were seated immediately upon walking in, and 3 minutes later, we got our soup.  A couple minutes after that, the prawns.  The ribs weren't too long, either.  I half-suspected they had these dishes pre-made and heated in a buffet-style table in the back, ready to serve as people order.  You know, on second thought, that wouldn't be too big of an assumption - it explains why things don't really taste the way they should... probably because they pre-make tons of things with similar ingredients and try to pass them all off as different dishes that were made to order.  I suppose this quickness is a plus if you're in a hurry and want something cheap, but don't expect things to taste good.\n\nI often assert that if you don't do it right or well, then don't put it on the fvcking menu - you'll just look like a fool, advertising that you can make such-and-such, then handing guests a pile of crap and expecting them to think it'll pass their expectations (if any).  Then you just end up disappointing people such as myself - the poor, innocent individuals of the world who just want to have a good meal.  That's all. \n\nWhat is the world coming to? In a world filled with many dining options, you people choose to go here? Why?  Cheap Chinese food that is also good DOES exist.  Unfortunately, this isn't one of them.", "author": "Ida T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-26", "description": "So I've definitely tasted much better Chinese food, especially in San Francisco.  It scares me that this place can be so very slow, as if it were a warning to not eat here.  Also, I had a shrimp dumpling soup here and it tasted like the shrimp in the dumplings were bad.  The only reason that I give this place two stars instead of just one is because this place is a favorite of my grandmother and all the staff here go out of their way to make sure that she's comfortable whenever she comes here.", "author": "Christine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-27", "description": "My family and I are super lazy and we hate cooking. We rather go out and eat instead of sweating in the kitchen. Instead of going to our usual Koi Palace for dinner, we came here for our Christmas dinner instead. After hearing good things about this place from my sis and my future brother in law, I knew it wouldn't be bad at all since he is a picky eater. \n\nThis place is usually packed but when we went, there was just four big tables that were reserved and some tables filled. Lots of people were calling in for pick up so they were actually pretty busy. Place isn't the cleanest but it works for me. The dirtier the place is, the better and more homey the food is.\n\nWe ordered:\nHoney Walnut Shrimp: Good but not the greatest. The shrimp was plump and fried to goodness but had a little too much mayo then I had liked and the walnut looks kinda old.. Didn't have the usual shine..\nSquab: MmMmMMmm juicy, meaty, yummy!!! \nPan Fried Flounder: MUST ORDER. Fried to perfection. MUS MUST HAVE. The crispiness and the freshness of the fish just went perfectly together\nMongolian Beef Noodles: So good.. My numba 2 fav. The noodles had a bit of curry taste/smell to it but it was just so yummy I had two bowls of it!\nCrispy Fried Chicken: Meat was not dry and the skin was super crispy.\nBeef Steak and Scallop in honey sauce: A little too much pepper and not enough beef. I think there was like 6 pieces? Where's the meat?!?!?!!\n\nService was OK considering they were getting busier. I would come again but make sure you make reservations cuz they get packed!!", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-06", "description": "We had been planning to try Red Jade but then learned it does not deliver to the tendernob. We'd been meaning to try Golden Horse since it's so conveniently across from Cala, but then we learned it delivers! We got ahold of a menu from menuist.com. The delivery was prompt, but the food was only ok. We had:\n\ncrispy chicken - This half chicken was well-fried, but only on the outside, which lead to a high fried surface to meat ratio for the wing, but not for, say, the breast meat. So while the meat was cooked well, it was pretty bland if there wasn't much fried area. We were unsure if this was available just as wings, which would probably be a better option.\n\nstring beans with xo sauce - The xo sauce was a bit overly seafoody to me, and there wasn't much flavor otherwise. The string beans were nice and fresh, though. My dining partner found this dish spicy although I didn't.\n\nmu shu pork - Pretty good, wish a good sauce, but not the most difficult dish, it seems. There was a little piece of gristle in the pork but overall the quality was fine.\n\nmongolian beef chow mein - I agree that the beef here was actually pretty good, and the texture was nice - it wasn't overly cooked and dried out. I wasn't as crazy about the flavor, as I think something licorice-y dominated a bit. The noodles were a little tough, too.\n\nOverall I wouldn't be in a rush to try it again, but I wouldn't rule it out either. I'd like to try the flounder.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "I really don't know what's not to love about Golden Horse. Generous portions, helpful staff, the friendliest delivery man I have ever met, and solid food! Glad to have this place as my go-to Chinese restaurant.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-28", "description": "Golden Horse!\n\nMe love you long time!\n\nThere was this one week at work, where my co-workers and I ordered food to be delivered from GH, three times within the span of five days. That's a lot.\n\nWe all love tasty and cheap Chinese food, and GH is our go-to place.\n\nI've tried the beef with oyster sauce, their won ton soup, the seafood soup (comes with the wide rice noodles), and sauteed eggplant with pork. All are delicious.\n\nThe last dish I tried was the Rock Cod with Broccoli.  One healthful dish, but still curbed my hunger.\n\nMr. Wu is our delivery man and he is ALWAYS so nice.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-22", "description": "Straight up disgusting. \n\nAfter having not eaten anything all day, I was super excited for some Chinese food. I ordered some sezchuan chicken and some veggie eggrolls(my boyfriend got the sezchuan veggies and tofu) to go. I went home, set myself up at the table, mouth watering, opened my to go order and what did I see? Some lumpy, slimy, grey pile of garbage. So unappetizing. Not only did it look disgusting, but it tasted disgusting as well!  Surprise, surprise, right? The knobby slime covered pieces of chicken were pretty much impossible to get down. As for the eggrolls- just boring cabbage filled crap.\n\nMy order was bad enough, but then I looked over at my boyfriends order...it got worse. The wet, soggy tofu was just slopped on top of some Chinese broccoli without having been cooked at all. \n\nthere we sat with two piles of revolting \"food\" that cost us over 20 bucks. We were beyond disappointed! Especially since we could have crossed the street to Thai Thai noodle and actually ordered edible food.", "author": "cait b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "Owned by a family friend so we're here quite often. This may come off as a bit biased but there is legit great food here! All the new people we've brought here ends up calling it a favorite. Yes, it's greasy. Duh, it's Chinese food! Most of the dishes, for the most part, are pretty good. Notable favorites of mine:\n\n- SALT AND PEPPERED CRAB (This is allergy risk level delicious. [Fuck you, eczema!!!])\n- Clams with peppers and black bean sauce.\n- Frog legs with bitter melon (may have to be special ordered, not sure.) (P.S. don't judge)\n- Honey walnut prawns \n- All of their \"fancy\" soups. \n\nParking is a pain because it's freaking Nob Hill after-all. I will park 10 blocks away if I have to, just as long as I get my salt and pepper crab fixins'!", "author": "Jen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-10", "description": "I went with my friend today during lunch and was immediately disappointed. We basically sat ourselves because they ignored us, had no customer service at all. AND TO MAKE THINGS WORST THERE WAS A COCKROACH IN OUR TABLE!!! NEVER WILL I GO BACK. I still feel sick to my stomach.", "author": "Paola C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "My family has been going to this place for more than 10 years for great value on Chinese food, we have all our celebrations, parties, and get together's here, and the food is great. \n\nWe always get the squab, salt and pepper spareribs, garlic crab, ginger flounder, crispy chicken, lobster, HK style pan fried noodles, honey walnut prawns, and duck with the siopao. \n\nTHE BEST dessert here is a FILIPINO one, they serve CHINESE/Mandarin/Cantonese ginataaan, its sooo good, the coconut milk and the tapioca in there is so warm and delicious. The parking might suck, but its definitely worth every cent, effort, and time to eat here over the typical Panda Express or something lol.", "author": "Alaric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-21", "description": "It gets the job done - convinient, filling, big portions, good selection of food and reasonably priced. \n\nBUT the food is not totally authentic and on the greasy and MSG-ey side. That said, most Chinese restaurants are like that in the US. The lady was nice that she let me use my credit card when I didn't have cash and my order was under their credit card threshold. But she placed the wrong order...\n\nIf you just want a quick fix of Chinese tak-out, Golden Horse is your neighborhood goto. If you want nicer Chinese food, you'll have to drop some more dinero and trek down the hill to goto R&G in FiDi.", "author": "Melody L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-22", "description": "Got hot and sour soup to go. Not a fan. One, there were chunks of different kinds of meat in it. Like they accidently spilled a piece of beef, and then some shrimp, and then some chicken. Hot and sour is supposed to be vegetarian. What the heck. \nSecond, it was so damn hot and no sour, it was not good (this was before I found the droppings of random meat). Gross. Won't be back", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "I came here yesterday with a coworker around 7:30pm and we were seated right away. We ordered the honey walnut prawns and the beef steak and scallops in a black pepper sauce, w/ a pot of white rice. Everything came out fast and the food was good quality considering the extremely reasonable price! If I lived in Nob Hill I'd be regular.", "author": "Briana W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "The food is good and and cheap . \nDelivery takes about an hour so plan accordingly !!!", "author": "Ko O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-05", "description": "food is ok, but service is horrible! the waitresses are very impatient and speak poor English, I don't know if they are naturally loud, but it seems like they are practically yelling at you.\nAlso tried ordering over the phone, it was a nightmare!", "author": "Coco L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-29", "description": "Clean Greasy spoon !\nAuthentic Chinese food. Fresh and one of the better ones in the area.  \nDon't expect great service for the price you can't beat it.\n\nThe table is not sticky  so that would give it a half star.\nWe go once a week.", "author": "Alison W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "I have had takeout from Golden Horse quite a few times and it has always been very satisfying and it's decently priced. That's always good, right?!\n\nIt's 5 blocks from my apartment and there are probably other 4 Chinese restaurants in between just walking walking down one street. When I moved to the neighborhood I tried some other Chinese place and ordered my favorite dish (Honey Walnut Prawns) and was really disappointed. After checking Yelp for some recommendations for good Chinese in the area I ended up heading to Golden Horse. Scoooore!\n\nThe honey walnut prawns are great and they aren't skimpy with the walnuts. The chow mein is tasty and the vegetables are fresh. I tried the lemon chicken last night and was very pleased. I'm definitely getting that again! I also ordered the cashew chicken and actually wasn't impressed with that. If you are a hard core fan of cashew chicken I would pass on it here. But so far, everything else I have tried has been great. The portions are great too! I ALWAYS have enough left over for another meal or two. \n\nI always walk there and pick my food up opposed to dining there or having it delivered so I can't tell you anything about that. But the people that work there are always nice to me when I pick up my food.\n\nIf you're new to the area and checking Yelp for good Chinese food like I was a few months ago, give Golden Horse a try! Pretty tasty stuff and your debit card won't shed tears when you swipe it!", "author": "Liz M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-04", "description": "The place is mediocre Chinese food that is doable if you're hungry, the best deal are the lobsters and crabs really cheap compared to other places.", "author": "N A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "My favorite place in SF for dinner.  Everything I order is fresh, and portions are large!", "author": "Wally W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Good food, excellent service, casual atmosphere.  Only complaint-had to order rice separately to go with my egg fu young.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "Ordered to-go from Golden Horse yesterday and it was a very very good experience! Because we consulted Yelp we ordered the sauteed flounder, crispy fried chicken and Chinese broccoli. I love it!! Didn't even need to see a menu and I think we hit the jackpot - perfect combination!! Between two of us we finished the founder and Chinese broccoli and I'm planning on finishing up that fried chicken for lunch tomorrow. I love that although we ordered it to-go it arrived at our door steaming hot and super delicious. I can't even imagine how great it must be at the restaurant!! I think this is my favorite Chinese delivery place in the city. If you are looking for dinner for 2 people trust in this Yelp given combination and I promise you will not go wrong. With the San Francisco weather being what it is I'm thinking that Golden Horse will see a lot more delivery business from me!\n\nps. microwaved the chicken the next day and it did not do well... lesson learned: finish it the day of.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-08", "description": "What we ordered was tasteless. Fatty gamey peking duck! our food cost over $75 and we had to toss most all of it! One entire Peking duck that was all fat and undercooked skin. My first and last time ordering delivery from them! Uck! bad duck! lol!", "author": "Kirk M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "I've worked within walking distance of Golden Horse for over 10 years.  There are a lot of choices to grab a bite for lunch, including Cala Foods Market.  But in a pinch, I find myself ordering lunch from Golden Horse.  \n\nTheir service is quick, fairly friendly, but no warm fuzzies until they warm up to you.   The kitchen is great.  You can order things off the menu (chicken chow fun with broccoli instead of beef chow fun).  Don't get the egg rolls ... don't ever get egg rolls in a Chinese restaurant.  Their portions are HUGE.  You can tell the food from the order out counter is freshly made.  \n\nSure, the food is a little greasy, but it's cheap and this place is packed for lunch on weekdays.  There's even a whole lot of Chinese people eating there, a definite good sign.  I wouldn't drive across town to eat here, but if in the neighborhood, for sure.   \n\nLastly, they have the multi-course banquet meals and the big trays of chow mein / fried rice that you can order.  It's in Chinese, you just gotta ask them.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "Friendly family owned restaurant.  Food is very good.  Service is friendly.  Place is always busy when we go, no matter what day of the week it is, so the food is fresh.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-15", "description": "I really like this place!!  The servings are generous and it is really quite tasty.  \n\nHowever...I ordered take out the other day and it seemed to take a pretty extraordinary long time to come out of the kitchen.  I ordered chow mein and eggplant w/minced pork.  It was piping hot!!!!  Maybe too hot??  I got home (about a block away), dished up my food, and when I lifted the plastic container the eggplant was in to put it away, it was ALL OVER my counter.  The eggplant had melted through the container.  Messy, indeed, but could have been dangerous too!", "author": "S. Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-19", "description": "Typical Chinese food. I can't taste the authencity and it doesn't WOW me. Definitely had better.", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-31", "description": "First off, they were very nice so service was good.  Secondly, i doubt i'd go back.   i've tried many Chinese restaurants in SF since moving here 15 years ago.  Over-all they are all quite bland.   So i frequent Thai places instead, most of which are much better, better taste.  It's a shame that after 15 years none of the Chinese places in the bay area are as good as the one i used to frequent in Milwaukee.", "author": "Mike F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-02", "description": "This is actually a decent restarurant and it is inexpensive as well.  I often go there for a quick lunch.  It's often frequented at lunch time by Chinese contrators/carpenters.  I especially enjoy the Lobster Lo-mein which is very tasty.  But most everything there is decent.  Not super delicious, but decent and consistent.\n\nSo I recommend for a quick cheap lunch.", "author": "Raul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "This place has a huge and diverse menu. I've only ordered beef dishes, and the appetizer sampler, but thoroughly enjoyed them all. Their beef is the best I've ever had at a Chinese restaurant, and their portions are large. \n\nI don't think I would sit down to eat here, but their takeout is quick and moderately priced. \n\nThey're only open till 9 and have a $15 delivery minimum.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-01", "description": "Ordered Beef soup, prawn lo mein, and shrimp fried rice.  The beef texture was too chewy and greasy. The shrimp lo mein noodles tasted homemade but were a little bit too tough -it's not  tender melt in your mouth delicious, you have to work in order to get it down. The shrimp in the fried rice was under cooked.", "author": "Elby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "Great take out place!  Chinese food in San Francisco...?  Perfect!  Great \"traditional\" American Chinese dishes, plus more traditional Chinese food as well.  It can be a long wait on the weekends it looks like, but just grab it to go, and chow down!  Bottom line...safe food, great prices!", "author": "Claire G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-22", "description": "Your average Chinese joint, not too greasy and decent food.  This place is clean with quick service.  Would be a good place for groups to go, and I give it 3 stars because the portions are big.", "author": "Keri K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "Except for Dim Sum, I have gotten away from Chinese food in recent years. There can be alot of funny business with the ingredients and one never knows what one is eating, plus the MSG issue.  I was on my way to Trader Joes and starving at lunch and just went into Golden Horse to eat. WOW WHAT LUCK!  All of the other patrons were Chinese. Families, businessmen, and those little old ladies who are in the know about where to eat. The wait staff mostly speak Chinese and the place is just as authentic as you might hope. Beautiful food. I like the set menu at 9.95 with fried shrimp,beef,brocoli, shrimp fried rice and won ton soup. They have a small buffet and do a brisk business with employees from ST Francsis hospital. I looked at the fish tanks which had clean water an healthy looking fish. I would like to go back with a group so I could try more dishes. This is a great Nob Hill find.", "author": "David I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-02", "description": "We came here for a Chinese New Year lunch with my in-law's extended family.  This place has been here forever, and I don't here for dinner because of the difficulty in finding parking.  Four large round tables were reserved on the right side of the restaurant.  On the other side of the restaurant, there is seating for smaller parties, and a steam table, with trays filled with food for take out.   In the back, there are tanks for live crab, lobster, black bass and rock cod.\n\nHere's what was ordered (at least from what I remembered):\n-Seafood soup with calamari and minced scallops:  Very good soup.  Not salty, and the calamari and scallops weren't over cooked.\n\n-minced squab with Chinese sausage (lap cheung), and mushrooms, with lettuce cups:  Also very tasty.  Lettuce was fresh and didn't from being washed.\n\n-Walnut Prawns:  I agree with earlier reviewers that the prawns were very plump, and deveined, but a little to mayonnaise-y for my taste.\n\n-Steamed Chicken with Ginger, Scallion, and garlic sauce:  Chicken was done well.  Some people like their steamed a little bit on the red side, but I liked it as it was.  Chicken was warm and very moist.  The sauce was in a separate dish, and was a nice accompaniment to the chicken. If not done right, this sauce can be too salty, but this one was done right.  We did request more sauce.\n\n-stir-fried broccoli with calamari, scallops, and mushrooms:  Fresh broccoli, and again, the seafood were perfectly cooked, and did not have a chewy consistency (like eating an eraser).\n \n-Roast Peking Duck with steamed buns:  Nice crispy skin, and very moist meat.  The duck was cut right before it was served.\n\n-Fried whole flounder:  I personally like my fish steamed, but this place did a good job of frying this flounder.  Fish had a hot oil, soy, ginger, and scallion sauce poured on top of it.  Bony fish, but the meat of the fish was very moist, not dried from being overly fried.\n\n-Mandarin Pork chops:  All pieces were cut about the right size so one didn't have to tear apart larger pieces.  The pork chops had a nice crispy crust on the outside, and were moist on the inside.  This is best eaten when this dish is still hot.\n\n-Coconut soup with tapioca:  Usually by now, everyone is too full to have this.  Not for Sugah Daddy.  A nice, warm, but not overly sweet ending to this lunch.\n\nEach course came out really quick, but not to the point of being served one on top of the other.  Servers were also very prompt in clearing out the empty courses to prepare for the arrival of the next course.\n\nThe décor of this place is not much to look at.  I would have docked a star for the decor, but I'm going to ignore it.  The preparation for each course was good.  Also, very reasonably priced for a banquet meal.\n\nMy tummy was happy, and I took a nap for a few hours afterwards.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "My favorite cross-dresser in the world, Miss Joyce, celebrated her 60th birthday at Golden Horse this past sunday. I was, AGAIN, the token straight man in a fabulous sea of middle-aged queens. Here is a quick summary of dinner conversation: sex, interior design, shlong, Whitney Houston, manscaping, the stock market, mangina, showtunes, figure skating, yada yada yada... So, as you can imagine, it was pretty much like dinner with your local pastor and grandparents.\n\nIt was a BLAST. The banquet style dinner was one of the better cantonese chinese meals I've had in the city. Without going into detail, it was (snapping fingers) MANTASTIC. 4 stars.", "author": "John T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-19", "description": "Consumer sales specialists have spent many thousands of hours, and many millions of dollars, studying the psychological effects of smell on the American consumer.  Bottom line: the right combination of smells can actually increase a store's sales.  Look it up.\n\nThat being said, if you run a restaurant, you need to be careful about what kind of smells you employ in your sales tactics.  For example, just for example, if your restaurant smells great from the outside, and then all the food sucks, your customers are going to walk away quite disappointed.  Like they've been misled.  They will wander in off the street, following their noses like some kind of cartoon dog (Coooooooooooookie Criiiiiiiisssspppp!), then order some delicious looking food, sit down, and find out IT HAS ALL BEEN ONE BIG LIE, YOU SCAMMING SONNAMABITCH!  The food, they will find, is rubbery and tasteless.  The noodles are limp and ineffective, like Bob Dole's wang.  The BBQ pork is only slightly more chewy than the rubber newspaper dog toy sold at PetsMart.\n\nAnd then, the customer will walk away, shaking his or her head, disappointed and deflated, like a scorned 17-year-old boy on prom night.\n\nI loved you, you bitch!", "author": "Ben P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "I've always liked this place - one of the waitresses used to work at U-Lee, the famous potstickers-the-size-of-your-fist place on Hyde, back in the early '90s. Anyone remember it? When I first used to go to U-Lee she was hugely pregnant. Recently I was in the Golden Horse and asked about her family. She told me her kid just graduated from UC Davis. Yes, I felt this old.\n\nAnyway, their snapper with black bean sauce is one of my favorite dishes. Whenever I order anything else I'm usually pretty happy. A totally reliable Chinese restaurant where you can get a square meal for cheap.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-06", "description": "REDISCOVERY! \nGolden Horse has been around the neighborhood a long time +20 years but my visit there last night was positive from several aspects.\nFirst, get over the tough parking in the area and if all fails you can always risk the underground parking at Cala's across the street.\n\nOk - Aspect #1 - clean upgraded look, apparently, new owners since 2 yrs have completely remodeled the dining room.  I mean raising the ceiling height and adding crown molding - that is unheard of detailing from a chinese restaurant.  Although the room is not that expansive, you don't feel 'crowded'.  This will give you a clue into Aspect #3.\n\nAspect #2 - Excellent menu selections from typical to the more exotic jellyfish, quail.  However, go to the inside back cover of the menu and choose from 4 preset family dinners ranging from $25.80 - $56.80 and you can't make a mistake here...the portions are not so puny that you have to request double portions.  We attended after a memorial and had two tables and our table had 5 adults and one teenager and we still boxed up 3 takeaways with leftovers.  See below for the family menu we selected.\n\nAspect #3 - One would think and assume that at $32.80 for 6 perfectly cooked and seasoned dishes ($5.47 per dish), it would be portioned for a party of 3 but as I stated in #2, they do not do that.  Plus, my comment about their detailing of the dining room extends to their detailing of the way the food is actually presented on each dish.  I would be easier to tip the wok of perfectly cooked vegetables onto a plate and ring the bell to serve, but they actually took the time to arrange the greens in a circular pattern and the seafood (prawns, squid & mushrooms) add to the overall color of the dish.  Each dish showed the same level of detailing which only adds to an overall positive experience - Bravo!\n\n$32.80 gives you \nSliced pork, salted egg w/ mustard green soup - Very tasty and not too salty.\n\nSpicy salt baked spareribs - similar to salt pepper pork chops, again not over seasoned.\n\nDouble seafood with tender greens = very good presentation\n\nBeef stew and tofu in a clay pot = very yummy and temperature hot\n\nPan fried flounder = crispy and golden, no hint of oil that has 10,000 hours of work.\n\nChinese broccoli (guy lon) with oyster sauce = tender and deep green\n\nI wasn't disappointed that a light dessert did not come with this dinner.\n\nService was excellent and friendly.  \n\nCheck Golden Horse out especially if you haven't been there in the past two years.", "author": "Randall F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-30", "description": "Golden Horse is the workhorse of my favorite Chinese restaurants- reliable, economical, and conveniently located in my hood and across from Cala.  I'm half Chinese from a Chinese restaurant-owning family so my tastes are Americanized (and then some) but I still know the good stuff when I see it.  \n\nHalf the time what I order isn't on the menu, but like most Chinese places, they're great about making whatever dish you want.  GH has great scallops.  Very fresh and high quality.  Their beef, while still quintessentially Chinese restaurant-esuqe, is less fatty and gristly than most other places.  I love their shrimp dishes.  Their kung-pao shrimp is so tasty that despite its not being nearly spicy enough, and its having peanuts and bell peppers which I don't like, I order it again and again.  I love their bbq pork won ton soup, especially when I'm not feeling so hot.\n\nThe only thing I've really disliked there was their sesame chicken.  I know I should know better and I always cringe when ordering it anywhere, but I LOVE the syrupy fried chicken dish.  That is, I love it when it's actually fried chicken and not disgusting fried bits of God-knows-what as it is at Golden Horse.  I have a theory that Chinese places use dishes like sesame chicken as both a litmus test to weed out the idiots who should be eating at Panda Express and as a way to make money deep frying whatever scraps are kicking 'round the kitchen and serving it to said idiots.  Thankfully, I enjoyed dozens of other dishes before ordering the sesame chicken, so I recognized it for the aberration it was.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "Highly recommend the wonton soup and pork spring rolls. This place is clean and fast, and you get tea upon sitting :)", "author": "Eugenia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-22", "description": "This place makes me all warm and fuzzy.\n\nEven though it has a banquet room, what this place is best at can only be described as Cantonese comfort food.  Its the place you go to in the middle of the week or Sunday night when you don't want to cook, want something not to complex & fancy, but made with care & heart.  Things they do well;\n\n-Great mustard green & salty egg soup;\n- Good roast duck;\n- Good sweet & sour pork (I sh$# you not);\n- Good hot & spicy deep friend tofu;\n- Good chicken & corn egg soup;\n- Good spinach & garlic sauce (not that brown spicy stuff, it's just lots of chopped garlic) \n\nGo here on a cold night when you have a cold, order one of their soups, it will clear out your system.\n\nDon't walk in there seeking high end Chinese banquet food, or somekind of wacky fusion thing to appeal to a broader more financially endowed audience.  It's just classic everyday Cantonese food done very very well.", "author": "M.S. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "Definitely one of the busiest restaurants during Christmas and New Years. Came here with my family and saw this huge line just waiting to be sat. Servers told me 30mins to an hour but they were able to turn tables very quickly and seat me and my family of 8. They were definitely rushing everything but was able to get our food out even with the busy rush. We had the family set course on the back on the menu. Everything on it was good. My favorite had to be the honey walnut shrimp. Best honey walnut shrimp I had in the whole city.", "author": "Ace W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-03", "description": "They give you tons of  food but none of it tasted all that great. Not horrific, just kind of boring. So boring in fact that I cannot remember what I ordered.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-23", "description": "Finally, my first review on yelp.  Been reading reviews for a year now, and I figure I'll give back to the community that has taught me so much about the city I now live in.  \n\nGolden Horse is reasonably priced.  I believe around $6-$8 for typical fried rice and noodle plates, more for seafood entrees, but it doesn't go above $13 or so unless it's got the expensive stuff in it.  Usually the neighborhood is terrible for parking (Nob Hill), but park in the Cala across the street, and sneak out so they don't know you're not a paying customer.  I doubt they'll care much since since they're getting demolished soon to make way for a Whole Foods with luxury condos above.  \n\nThe food is solid.  Try the rock cod clay pot and won ton soup.  I forget what it's called but it's not the typical won ton soup.  Peep the menu and you'll see what I mean.  It's deep fried won tons in the soup so it creates a soggy soupy delictable mix.\n\n\nI feel pretty proud of my first review.\n\n\nPeep the method, check it correct it...", "author": "Law C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-29", "description": "Pretty basic chinese food, not the best not the worst.  The portions are huge which is nice.", "author": "Morgan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-16", "description": "This place is OK. The prices are right and the food seems authentic, and menu varying, but the options aren't all consolidated, and some of the food I've had has been a little too offbeat for my tastes, which says a lot for someone who has eaten sheep's knuckles and mapani worms. Order at your own risk. Their family meal deals are superb and this place came at the high recommendation of a Chinese man in the know...", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-25", "description": "Called in an order \"To Go\" this afternoon.\n\nAfter giving my order, I asked how much that would cost.  The woman's reply was (and I quote) , \"I don't know yet, we're busy.  You come in and pick it up.\"  Then, before I could respond, or ask if she wanted my name for the order, I was hung up on without another word.\n\nClearly this place has so much business that they don't need mine, and will not be receiving it.", "author": "Jessie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-07", "description": "I came here on Chinese New Years eve, which was a mistake because the restaurant was PACKED. First of all, the restaurant was pretty small to begin with, and add about 50 people and you have yourself a madhouse. \n\nTo address a couple of things mentioned by the previous reviews. The place is not clean....at all. The table tops were greasy. The plates still had food stain on them. The tea cups felt oily too.\n\nThe service was horrible even by chinese restaurant standards. I understand it was Chinese new years, but even after the crowds cleared out, we didn't get our check for 15 minutes after telling them TWICE that we wanted to pay.\n\nThe food wasn't that great. Most of their recommended dishes are fried and did not taste very fresh.\n\nThe only redeeming point is the price. An entree was about 7 dollars, which is pretty cheap.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-23", "description": "UPDATE:\n\nThe health inspector has rated this place a 63.  NOT GOOD.  Im so sad to think ive been enjoying cockroches, all the time thinking they were potstickers :(\n\nI hate to do it, but I gotta take away three of the four stars! I mean if youre gonna serve food people..... com'on!!!!! \n\n\nIt only took me 3 short years to discover this restaurant, and a friend had to tell me about it (I know, I'm slow).  \n\nThe food consistently is what you would expect from a high end Chinese restaurant.  The veggie fried rice is delicious and not overly saturated with grease and full of enough green things to keep \"the girl\" (my girlfriend) happy.  The Mongolian beef has just the right level of heat, and I cant get enough of their pork pot-stickers.  You wont be disappointed with anything on the menu.\n\nThe dining room is comfortable, and if you have the right seat you can watch the crabs and lobsters peer through their aquarium wondering why that man over there is eating their friend. :D\n\nThe price is perfect and the family that run the restaurant is always very happy to see you.  A great middle of the week stop.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "The ladies that work here can take awhile to warm up to you but once they know you, they are very sweet.  I stop by here twice a week for \"to-go\".\n\nPretty authentic Chinese food like the dishes you find in Chinatown.  I love their salt & pepper fried fish and boneless steam chicken w/ ham, mushroom & Chinese greens.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "For once, I came here for lunch rather than dinner and loved the change.  I ordered the House Special which was very unique but a combination of all my favorite foods.  Chow fun AND chow mein noodles (perfect because I couldn't decide what kind to order) chicken, pork, and shrimp/calamari (wow, the variety!!), baby corn (loved it since..well, since I was a baby!!), mushrooms (#1 favorite food), bamboo shoots and carrots!  Come on, that's like the world's best combination.  The portion was massive for only $6 smthg AND came with soup!!  It was a refreshing tofu, dropped egg, and mushrooms (!!) soup that was delicious all on its own.  The fortune cookie was on the stale side, but I'm not complaining since I was so full!! Thumbs up for my favorite Chinese restaurant!", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "Didn't realize so many others viewed Golden Horse so highly. It's good to know I'm not the only one who enjoys the decently priced, incredibly tasty food they offer.\n\nThis is one the spots my friends and I usually gather at on Wednesday nights when we dine out, and it's by far the one we've been to most often. The Cantonese style dishes they offer are made well, and some dishes stand out more than others -- my friends in particular like the BBQ spareribs and the dao mew (snow pea leaves with garlic). Their soup warms me up on cold nights.\n\nThe staff is actually quite friendly and knows us by now, and they usually usher us to one of the big tables in the back area. Considering we're usually kind of loud (and probably obnoxious, haha) they're pretty patient with us. Always a plus.\n\nNot much to say about the decor; Golden Horse looks like every other mid-scale Chinese restaurant I've been to in San Francisco, and it's smaller than some. Ultimately though it's never really affected my judgment of the place. After all, there's that old saying about books and covers and blah, blah, blah... you know the rest.\n\nIf you're in the area and looking for some scrumptious Chinese food -- in San Francisco, how can you NOT find any? -- then Golden Horse is worth checking out.", "author": "Will C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-17", "description": "If you're looking for a quick chinese fix this is your place.  the staff is friendly and nice and its a good spot to hit when you're near the hospital or near the bars.  golden horse does chinese food right and thats coming from a chinese kid who loves chinese food!\n\nthe price is right and the food is just right on the money when it comes to variety and taste... grab a cold beer with the order to make it a complete meal...", "author": "Harry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-24", "description": "Yo man, whenever I see people of the ethnicity eating in that restaurant, I presume it's authentic, and this place is loaded with Chinese peeps.  Recently renovated, great food and wow dinner for 3 tonight for $22.00.  \nMy forturne: Do not avoid what you know to be right...\nin bed?", "author": "Moi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-16", "description": "SALT AND PEPPER CHICKEN WINGS!!MUST HAVE!!\n\nSo far, I've only been here twice, both times at lunch for the rice plates.\n \n-The eggplant rice plate was delicious. \n-Kungpoa chicken was not as good(spicy) as I have imagined it to be. \n-Mongolian beef was generic (nothing more than beef with hoisin sauce). \n-The Singaporean curry rice noodle was alright..I wouldn't want to try it again since I've eaten tastier elsewhere. \n-Beef fried rice: Ok (not the best).\n\nOne thing I love about the place is the old-fasioned teacups and plates. \nService: Not the best, but acceptable.\n\n* Their health review score was an 83! How?, I do not know. The place seemed pretty clean to me.( At least the dining area)", "author": "Edward C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "Everyone had their favorite Chinese restaurant in their hood....right?  Well  you can't beat Golden Horse if you live in the area..  The owners are really nice and the owner normally delivers our food when we order deliver!   Try the live Dungeness crab which is normally priced at $14.95, it is really awesome.  \nSure they may not bring the check right away as I read in some of the other reviews, but remember this ain't fine dining.  Just flag them down and ask for the darn check.\nIf you live in the Nob Hill area this place is a must for those lazy nights!", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "The food is great. Service was good. We were there CNY and it was quite busy but they were very nice and efficient. The price was excellent. Place was simple but clean. A little noisy and parking a little difficult. Right in front of Trader Joe's.", "author": "E B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-16", "description": "So my bro calls me at around 11:30 asking me what time i take lunch. I told him I pretty much can go at any time and why the hell would he care? He lives in Sacramento so I knew he wasn't calling for lunch.  But he WAS!  What a wonderful surprise. He was just stopping by into the city to have lunch to satisfy his craving for San Francisco Chinese food so he chose this place since it was really close to my work.\n\nI was a little hesitant to go to this restaurant because I am so used to eating at Bamboo Restaurant on Pine and California.  But upon tasting the food - Bamboo has got nothing on this place (I may just have to edit my review on Bamboo).  It may not be as nice inside as Bamboo (Golden Horse reminds me more of a shower room than a restuarant) but the food was pretty damn good.  Everything was tasty and nothing was doused with too much soy sauce or salt.  The hot and spicy spare ribs is a must try.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-02", "description": "This place serves slightly above-average Chinese food at really low prices, but the restaurant is kind of dingy and dirty. The bathrooms are also really gross, which, unfortunately, is typical of most Chinese restaurants in the city.\n\nI am not a fan out eating Chinese food out simply because it always tastes too greasy or salty to me, but my very authentically Chinese parents and grandparents enjoyed our meal here, so the food must be pretty good. If you're in the neighborhood and craving cheap Chinese, Golden Horse is not a bad choice, but it is not worth it to go out of the way to eat here.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "Had my BDAY Banquet here and loved it! We had a 10 course meal for $118 - they had a great special @ this time. There were 10 of us gals, so if there were 1 or 2 more gals, it would have been enough. The round could fit about 11 ppl. \n\nLots of seafood and some of my fav's. They even served duck in bun, seafood soup, pork ribs, crab, and a number of other items (totaling 11 items). The owners are really nice and accommodating.\n\nMy aunt recommended this place because she is sensitive to MSG, and they do not use that here. It's a small restaurant but cute. Hard to find parking, but worth it.", "author": "M M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-08", "description": "This place has been here for years, we used to come all the time for large family dinners. Some of their best dishes were fried calamari and black bean crab. The crab was the best I have ever had, tasty and hot. I'm guessing the cooks have changed so the food may not be as good as it was. The dining area is real dated, nice but it has seen better days. Good luck on finding a parking space within two blocks, cuz St. Francis is right down the block and Cala across the street, so spaces are premium around there. This is a hole-in-the wall place, with about a 50 person capacity.  Cleanliness is questionable.", "author": "Larry G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-21", "description": "This place is right down the street from my apartment and I see asians in the restaurant often, so I thought it might be worth a try.  I was mistaken.  The food here is no good.  Its like they have a set of premade ingredients and then they mix them up with a different base to make all their dished.  I ordered 3 dishes, and they all basically came out with the same ingredients.  One of the dishes was hot and sour soup and another was shanghai noodles.  It's pretty questionable if your using the same ingredients for these two dishes, since they're quite different.  Unsurprisingly, I haven't been back.", "author": "Elsa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "This place is in my neighborhood. It's so cheap, and has the best sweet & sour pork in town. I don't eat sweet & sour pork very often but have a craving for it once in a very while. Don't get it from the lunch counter but order it from the kitchen. You need to eat it in the restaurant also otherwise it's no good. It's unhealthy but so yummy!! Closest thing you could get of \"Subuta\" of Japanese influenced Chinese dish in Japan.", "author": "Wakaknee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "Love this place -- it's not your overly seasoned/super greasy Chinese takeout from the corner.\n\nIt's only a few blocks away from home and I come here whenever I have a hankering for Chinese food.  Good Cantonese-style food at great prices.  I love their crispy fried chicken, sauteed flounder, and their chow meins (not sure which ones I've had but I remember enjoying them all).", "author": "Guava C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "I know there must be at least 1,000 Chinese restaurants in the City, but my buddy lives near by Hyde so we came here. And so far, it's my favorite of the few that I have been to. \n\nThe service was fast and friendly (the knew my friend Mark rather well, brought him his \"regular\" with out even needing to ask him). The food was delicious.  While not that close to my house, I could see myself coming back here for sure if I'm in the area.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-19", "description": "We are Dragon Well devotees, but sadly they don't deliver, so we've been on a quest for a good Chinese delivery spot in the area. I had high hopes for this place after reading the reviews.  (To be fair, I'm still not entirely convinced that my call to Golden Horse wasn't hijacked by someone pawning off left-overs from St. Francis hospital. And there was a dog barking in the background while the woman took my order. Really?!)  \n\nThe wonton soup was completely inedible. The broth tasted like dirty dishwater, the wontons were gross, it was just bad, bad, bad. Then there was some scallop mystery meat thing drenched in pepper, but unfortunately not enough pepper to mask the awful taste of the \"beef.\" The moo shu pork was tasteless (which at that point, was an improvement over the first two). The only thing that was okay - not great, not really good, but a solid okay - was the shrimp in lobster sauce.  It pushed them up to 1.5 stars overall, but I couldn't bring myself to give them 2. \n\nStill scratching my head at why people like this place so much but not inclined to give it another go. The quest continues...", "author": "Maggie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-18", "description": "BBQ Pork Won Ton Soup is the best. Spent months looking for won ton soup that reminded me of what I used to get in NYC. Turns out it doesn't really exist in San Fran but this place comes the closest. Remainder of menu is hit or miss but overall is great for takeout.  Another hidden gem is the fresh shrimp won ton soup, the broth is excellent but be aware it is very simple.... Broth and wontons only.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "I LOVED the roast duck soup.  Excellent price, amazing portion, meat falling off the bones, no complaints here. Was happy to step out of the way of crack heads asking me for a lite as they extend their pipe in my direction to grab a bite here. ;)", "author": "Zanna o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "Had the Kong Pao chicken the other day with pork fried rice. Have to say it was pretty darn good. I'd recommend this place.", "author": "Paul F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "Golden Horse..I've been coming here since I was I think 10 years old and i'm 21 turning 22 now and I still come here for Chinese New Years and for my Grandma's birthday! The food has always been good just like I remembered when I was a child! I love the buns with the peking duck, the crab the fried fish and especially the soup! =) I never get tired of coming here! It gets really really crowded on the weekend..so if you have a big group make sure to make reservations!", "author": "Heather C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-03", "description": "Pretty darn tasty, this place is.  They do a great job of not trying to be too fancy, and just serve up some good, not-too-greasy chinese food that makes you fell like home.  Even for a good ol' honky like myself.  And I know it might be a little racist to say it, but I feel greatly encouraged to try a new Chinese place and the only white people in the place are myself and the person I'm with.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-02", "description": "Mongolian Beef lunch is good. Very D-E-L-I-C-I-O-U-S. The price is cheap around $5. Soup is included. Yummy.", "author": "mc a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-22", "description": "Really delicious and creative Chinese food - I was not in the mood for lomain, fried rice, or any of the usuals, but this restaurant has \"clay pots\" that come sizzling to your table, all kinds of wontons, and a ton of other choices.  I had dumplings, an egg roll and FANTASTIC beef satay with vermicelli.  I will definitely be back here again after drinking in North Beach ;)", "author": "Laura W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-10", "description": "Decent cheap chinese food, not great, not bad. I got Won Ton soup, and was slightly disappointed, the broth seemed to be a little watered down. I also got he szechuan chicken, which could have been spicier, but threw a little chili sauce on and it was fine.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-10", "description": "So they have made some changes and their Health Score is now up to 83!\nI have never been disappointed by their food or service so Golden Horse is back on my list of places I know aren't exactly the cleanest but I am willing to take my chances. \nIt doesn't hurt that they are half a block from my door and I loooove Cantonese food.", "author": "JA C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "i've been coming to this spot for years with my family. and i must say it has always been consistently awesome. the waitstaff  recognize us as regulars and are always friendly and quick! and you know the food is good when the place is full of chinese people chowing down. not to mention the prices are super cheap!", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "All the food is superb. I love their BBQ Pork Won Ton Soup, Pot Stickers and Egg Rolls. No skimping on the food. The BBQ Pork Won Ton Soup has about 20 pieces of BBQ Pork in it!", "author": "Walter W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "This place is soooo good.  The service is pretty ok, but they try their best.  The reason I gave 4 out of 5 stars is because one time, I saw the waitress drop the fortune cookies on the floor and picked it back up to put it into the same can and served it to customers.  I never eat the fortune cookies there, but they have great lunch specials, and they are very nice to all customers.  The food is great.  $5 for a 2-item lunch.  So much cheaper than Panda Express if u were to get chinese food from there. :)", "author": "Amy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-26", "description": "This restaurant just reopened after a month of renovations.  The new place is cleaner and better decorated.  Not exactly a gourmet restaurant but a good, authentic place.  You can also order dishes that aren't on the menu (like mustard greens).  I especially enjoy their lychee fried fish and their shrimp egg foo yung.", "author": "Mahogany G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "Good price. Consistent delivery of food. Consistent taste over a broad range of menu items. Eat there frequently when feeling in the mood for chinese food. Many employees at the hospital nearby order take out and carryout and seem to like the food and service.", "author": "Patrick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "Whenever I see a Chinese food place packed with locals, I know its good.  The food here is great, and the portions! Geez! They must think people have stomachs the size of Buddha's!  The service, though not necessarily warm, was brisk and efficient.  The restaurant was the biggest drawback: it was very very dirty and unwelcoming.  Overall, I give it props because the tasty dishes and price point were just what I needed!", "author": "Tova S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-05", "description": "My family no longer like to order to go from here.  It doesn't taste as good as it use to be.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "I eat here so often they know what to bring to my table before I even order.  Because of that I can only say they have excellent service.  But I have been going here sometimes weekly for over 5 years.  Is it the best Chinese Food in SF?  I honestly have no idea.  But they are very pleasant and inexpensively priced.  I would recommend this restaurant to anyone.  You can't beat the price of their lunch buffet.", "author": "Tommy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "This place is great...casual and friendly and the food was great!  We enjoyed sauteed shrimp with mixed vegitables and cashew nuts, chicken chow mein, and hot and sour soup.  Everything was tastey and not loaded with salt or overly sauced.  The portions were great and we ate a huge meal and had leftovers for under 30 bucks!  This place is great choice for chinese!", "author": "Sweet C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "I mentioned in the post about Hyde Out that I went there and it was most awesomeness when it comes to Chinese food...and I'm saying it again.  The BF and I went there on a whim after having a drink at Hyde Out.  Our waitress was the only downpoint of the whole experience.  She seemed angry that she was even serving people, exasperated, and just generally annoyed unless she was talking to one of her co-workers.  Whatever, my man and I just laughed about it.  We ordered the Dinner special (the first one) with the two person minimum and that 2 person minimum is a stretch.  The both of us could barely get through half of the chicken chow mien, fried spare ribs, general's chicken, tofu soup and egg rolls.  We had enough to take home and eat for nights.  And our bill? With tip it was around about $30 +/-.  And we spoke with a super sweet man while he boxed up our meal...this place has been around for 15 years.  Yum Yum in your Tum Tum with Bucks left in your wallet (sorry...I know, I know)!", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-28", "description": "this is right around the corner from my apt so it is perfect for those nights i don't want to cook. pretty clean and super fast service. food is not amazing but they've been pretty consistent and they have a pretty good selection of comfort-food type items on the menu (i.e. fried fish with creamed corn and chicken and salted fish fried rice).", "author": "Rowena M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "I tend to go for more spicey asian food but this place was good. It is Cantonese and Mandarin. I went to lunch and had the salt and pepper chicken wings for an appetizer-delicious. I had #188 Shredded chicken fried yee foo noodle. It was a huge plate but a little bland nothing a little soy sauce didn't improve and in fact delicious enough to eat the huge plate. There were a few weird mushrooms on it which I gave to my friend. He said they were bland. My friend had #21 rice plate with sliced cod with greens on rice. He said it was delicious and they give a huge plate with a lot of rice. They also gave us some seaweed shrimp soup with tofu-or at least I saw those things in it. There were a lot of asian people eating here which is usually a good sign. I also was expecting it to be a dive but it is actually a nice place. They also have a express line where  you can pick out food and take out or eat there. I would go back again!", "author": "Jack B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-03", "description": "I've not eat in before.  Bought take out a few times and didn't really like it.  Their food don't taste as original Chinese restaurant.  Plus food portion for a box of take out is not even full in a box.  You can get better salt and pepper ribs at another place, but not here.  I suggest walking down a few more blocks to Chinatown to get much delicious food.", "author": "YELP U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "Been coming here since I've been born.  It's got decent Chinese food that always hits the spot.  Not the most refined food that you've eaten, but it does the simple stuff well: noodles, rice, etc.", "author": "Ian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-29", "description": "This is my 'standby' for anytime am hungry and don't want to deal with crowds or noise, but also I avoid going there at dinner rush or on holidays.  The food is good, portions are big enough for USA appetites, and prices are great.  The service is sometimes sloppy (as noted by others, especially with soup) but normally fast and easy.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-01", "description": "yum! and they deliver too! My husband and I had to have their food at least once a month. You actually feel good after eating their food, not like other greasy Chinese restaurant. One of the best Chinese restaurant in SF.!", "author": "alice k."}
