{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "I usually get the bun (vermicelli bowls) here, and #40 offers a choice of beef, chicken & pork w/two cha gio (fried imperial rolls). \n\nThe meat comes out freshly grilled, and the rolls are fried to order. Perfect with the cool veggies, pickles, and the ample amount of noodles.\n\nBig hefty bowl of dipping sauce as well.\n\nSmall space, but plenty of seating, especially if you don't mind sharing a table.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Hate to do this. Your closed and you're supposed to be open right now. Three of us are outside but your doors are chained.\n\nFail.", "author": "Offset M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-20", "description": "Super lovely and friendly people, but not my favorite noodle place in Chinatown. Their flavors for pho are just a tiny bit off.\n\nA bit extra unlucky as I found a cockroach crawling around the chopstick container. The owners were very apologetic and good about it - but tipped this to two stars for me.", "author": "Jimmy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Chinatown has three Golden restaurants all within a five-minute walking distance from each other. I mean there is the Golden Flower Vietnamese Restaurant, Golden King Vietnamese Restaurant and the Golden Star Vietnamese Restaurant all close to each other. By sheer chance I happened to try Golden Flower Vietnamese Restaurant first from the lot. It is located on Grant and Jackson so right in the middle of the tourist circuit. At the peak lunch hour on a Saturday it was about 40% full. Like other Vietnamese restaurants it has a trillion variations of Pho, bun and rice plates. I decided to get the Five spice chicken ($8.75) to-go.\n\nAfter ordering I waited for about 10 minutes at one of the open tables and then was off with my order. While paying I was surprised that I could pay by card which is very out of charter in Chinatown. I got a small size container with the Five spice chicken that was almost hidden under the serving of rice and two smaller containers with dipping sauce. The chicken and rice were both pretty good while the dipping sauce was terrific. Overall this was pretty good.\n\nAfter the good experience I came back to try the Five spice chicken noodle soup ($10.75) which is noodle soup plus the five-spice chicken. This time I found the noodles to be a little clumped together but they managed to open up when dipped in the broth. Overall not bad. During my third visit I decided to get the Chicken with lemongrass ($10.25) from the Dinner Special section of the menu. This time it was a disaster a small serving of rock hard pieces of chicken with over steamed rice.\n\nPrice wise it was pretty cheap and in-line with what you would pay at other Golden restaurants in Chinatown. My take is that they have the batch produced items like Pho and five spice chicken locked down but what needs to be cooked to order the kitchen surely falters. Considering the overall package of quality, price, service I feel that this is a 3.5-star type of place so I'm rounding that up to 4.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-14", "description": "Shot into here recently to try some pho since it's been relatively cold recently (I know not for our East Coasters). \n\nOrdered my combo pho and while it was good , there wasn't anything that stood out about it either.\n\nSince so many pho spots taste similar there are without a doubt some that are way better and some that are way worse. For those in the \"middle\" of the pack  often times the thing that differentiates them is the service you get.\n\nAt this place the service felt very indifferent the afternoon I popped in. At many pho places even the busy ones with one savvy waitress/waiter they'll ask you what you want to drink. At this venue not a peep nor a follow up of how things were going. \n\nMaybe chalk it up to a bad/busy day?  \n\nThe world needs a SF Bay Area Pho Rankings...so I'm here to provide my humble list/rankings.\n\nRanking explained:  #1 (listed at the top)  is my favorite/ #?  (listed at the bottom) is my least favorite. Check out my latest reviews for my latest up to date Rankings. \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. If you're curious, I have rankings for Boba, Bakeries and Ramen , Chicken and Waffles as well (random right?)  Follow my profile to see my most recent reviews.  I hope I can be helpful since so many Yelpers have helped me discover new places. \nRod's Pho Rankings for SF Bay Area:\n1 Ly's Vietnamese Cuisine\n2 Turtle Tower\n3 Rang Dong Restaurant\n4 Golden Star Vietnamese Restaurant\n5 Pho Huynh Hiep 2 - Kevin's Noodle House\n6 R&D Café\n7 Mai's Kitchen\n8 Noodles Pho Me\n9 Chopsticks Pho & Grill\n10 Rice and Spoon Vietnamese Cuisine\n11 Pho Tan Hoa\n12 Pho VN Vietnamese Restaruant\n13 Pho 2000\n14 Pho Vi Hoa\n15 Bistro Viet House\n16 Golden Flower\n17 Pho Ty II\n18 Pho Pasteur\n19    My Canh\n20 Kim Huong\n21 Pho 99", "author": "Rod M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-01", "description": "Decent Vietnamese food in the SF Chinatown area.\n\nPho is served in three different bowl sizes. The broth is very clean and there is a good amount of protein and noodles served. If you are looking for a rich hearty broth to go with your noodles, Golden Flower is not the restaurant to come here for. \n\nRestaurant is maintained properly, the tables and floor are clean here. The ladies who run the place are absolutely very friendly too.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "The first time I came here was because they were serving #1 (beef combo pho) on MealPal... I keep coming back because this place is soooooo good. It's a block away from Golden Star, which my friend had taken me to before and all my coworkers seem to love, but Golden Flower is 200x better. I come during lunch time and there are generally seats open. Once you order, your food is there within 5 minutes. I generally never drink the broth anywhere when I eat noodle soup, but I swallow the whole thing when I come to Golden Flower. The piping warm broth is so satisfying on a cold winter day and it's not overly salty like other places.\n\nTheir noodle bowls come in small, medium, or large and served at different price points. Even the small is plenty of food but I generally go for the medium.\n\nThe restaurant is run by a couple of Asian ladies that speak English, Cantonese and Vietnamese. They are all super nice and attentive without overbearing. \n\nThey also have banh xeo!!! \n\nThe best part - they take credit card (but it's $10 and up)", "author": "Judy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Great warm homie feel. One of the few delicious pho restaurants in the chinatown area. Owners are really nice and welcoming. Usually packed on prime lunch and dinner hours. I love their imperial rolls! Not much places make it like them! Also, their pho broth is on the clearer side and really tasty. Order anything here and you are set! Enjoy", "author": "Peter R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-08", "description": "After countless visit, this place is starting to let me down. Ordered a bun bo hue and they used different noodles (should be thicker) and they really skimp on the meat. The soup was still very good but other components lacked\n\nThe pros to this place is it takes credit cards and usually no wait compared to another vietnamese restaurant", "author": "Henry T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-10", "description": "Be wary if you are doing online orders - the prices on postmates / ubereats are supremely low on paper. \n\nOnce you check-out the amount will sky rocket; typical bait and switch.\n\nFood is whatever to me - if the food was actually priced what they are shown online, then you get what you pay for. \n\nI would just stay away from doing delivery orders from here... you'll thank me later.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "I had the vermicelli noodles with bbq pork and it was decent. It came with plenty of noodles and the bbq pork was cooked pretty well but it lacked anything really special about the dish. It was more of a standard faire kind of restaurant.\n\nThey did give plenty of fish sauce which was nice but that was a little plain as well. There veggies were mostly limited to just the salad and bean sprouts, it would have been a bit nicer if they had more fresh herbs.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "I don't know why they became greedy now. One large bowl of beef noodles $10 \"inside got 2 slice of beef and 2 meat balls, 1 slice of beef tender. Some noodle\" that it. For $11 \n\nNOT WORTH", "author": "Jackson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "My go to spot when I have to travel to work around Chinatown area. I love the BBQ pork pho to go along with a soy milk. Pro-quick service, friendly owner who remembers me even after 6 months of not coming by, delicious food. I love that they fill the pho broth halfway in the to go container as once I add the noodles, the volume is perfect. Cons-I have dined in once and the trays that they hold their chop sticks and soup spoons look really dirty.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "Pho was good. However, it could have been better. \n\nOrdered the Xe Lua pho. Pho came in around 10 minutes. \n\nThe pho.... \n- Noodles were good a decent amount. \n- Meats were a generous amount but was mostly fat. The brisket was the most delicious part out of the entire pho. \n- Broth? If I had to choose, I'd choose Golden King over Golden Flower. Golden King's broth just feels more genuine. \n- You had the option to choose S/M/L or XL in some cases. Which gives me more choice. \n\nThe service... \n- Pretty fast and descent. \n- Accepts credit cards! Nice! But only Visa and Master. If you have Discover or Amex, They will reject it. \n\nOverall, Not bad. But could be better.", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Golden Flower - not to be mistaken for golden star down the street.  I always order the vegetarian spring rolls here!  It's an amazing deal - you get 4 huge rolls (well, 2 cut in half) with peanut sauce for $7.50!  It really doesn't get much better than that.  And these are quality rolls, not like the ones you'd get wrapped in syran at Trader Joes.\n\nAll my coworkers love getting the pho here and claim that the broth is better than the neighboring competitors.  They're super generous with the portions, and you will NEVER leave hungry!  Other popular dishes include the 5 spice chicken and vermicelli bowl.\n\nComplimentary tea for the table (leave the pot open when it's empty and they'll refill it for you), decent service (for Chinatown), and plenty of seating.  You can order takeout if you want, but be prepared to wait a bit.  The takeout pho will definitely require a massive soup bowl, so be prepared if you're taking this back to the office.\n\nThey prefer if you don't use a card for charges under $10, but if you have nothing else they'll do it for you.  There is a bit of a lunchtime rush but they typically always have seats available.  This is definitely a spot worth coming to if you're in the mood for good Vietnamese food!", "author": "Kenna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "One day, I came down with a cold and sore throat and decided to nurse it with some pho. Or maybe I decided to use the cold as an excuse to get some pho. Either way, I came into the store at night and it was a quiet weekday evening with few customers inside. I was promptly seated and perused the menu, even though I came in determined to get some variation of the beef pho. However, I let my eyes wander and thought wouldn't it be nice to have some pho ga (chicken noodle soup) for a change? I gave in to my curiosity since I haven't had chicken pho in such a long time. \n\nMy pho came out within five minutes of my ordering it. I proceeded to savor the broth and then unceremoniously poured all my veggies into the pho. The pho ga (chicken noodle soup) was very delicious, and flavorful compared to other places. The broth was very clear, and there is a beautiful golden glow glistening as you can see in the picture below. I finished the soup and the noodles and left the meal fully satiated. Now, I'm not saying that I was cured by some chicken pho, but during the meal, I certainly felt a lot better. For ten dollars, this was deeply satisfying and left me feeling very full, which was a good thing since I had to brave the winds as I left the store. I'll remember to come back for the pho ga the next time I have a cold.", "author": "Nelson X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "Poor customer service, we are the entire meal before water was offered to us. What kind of restaurant will watch you eat before offering basic water. The old lady moved so slow, and the daughter was just chatting it up with friend. The food tasted marginal at best. Absolute lack of professionalism. I WILL NOT BE BACK.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "Stopped by for lunch, not a bad place.  We ordered the spring rolls for our appetizer, parents got the pho, the bro got the papaya salad, and I got the rice platter with grilled pork.  The spring rolls came out medium hot, rice platter was delicious, the meat had flavor to it.  Service was quick.", "author": "Phuong O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "We were tired of Chinese food so we found this pearl right on one of the side streets of China town. Pho was absolutely delicious and fresh. I had the veggie crispy fried noodles. Loved it. Add a side of freshly squeezed lime aid and hot tea. Just what we needed after a long day in China town!! Great service, happy people. We'll be back.", "author": "Crowlynn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "I came here about 3 months ago for a reunion lunch with my former co-workers and it's my go to Vietnamese restaurant now!\n\nI have been taking my friends here and they  really like it too! Their imperial rolls are my favorite! My go to dish is #40 Bun Cha Gio, Heo (Flame Broiled Pork) it's my favorite!! It comes with imperial rolls! I usually eat the whole bowl because it's so delicious!\n\nMy friends have ordered their Pho and rice plates and they like their meals, too.\n\nThe lighting in the restaurant is kinda dim so I can't take pictures of my favorite dish :-(", "author": "Allie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Pretty amazing spot for mid day quick lunch pho fix. Prices are amazing, service is quick, and they take credit card (this is a rarity in Chinatown!). \n\nThe tables and chairs are a bit sticky but eh. They're moving patrons in and out so fast that I understand it's not going to be sparkling clean.", "author": "Ming Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "I have been several Vietnamese Restaurants in the past but in the years that I have lived in San Francisco.... This was my very 1st time ever that I ate lunch at the Golden Flower Vietnamese Restaurant... Which was in the San Francisco Chinatown area and I have past by this Vietnamese Restaurant so many times and never thought that... \n\nI would have lunch at the Golden Flower Vietnamese Restaurant until today I had decided that I wanted to come here and just have some lunch at this Golden Flower Vietnamese Restaurant on my day off from work!!! \n\nWhen I got inside in the beginning and as I greeted by the friendly hostess who took me to my table it wasn't that crowded yet and what I ordered for myself was a Shrimp & Pork Fried Rice!!! Overall after finishing it all in which I was really hungry!!! I have to say that the Shrimp & Pork Fried Rice that I ate for my very 1st for lunch tasted really good!!!\n\nI definitely would wanna go back to the Golden Flower Vietnamese Restaurant at another time and try something different!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Was recommended to me on my trip to San Fran and I wasn't disappointed.  I had the spring rolls and the rare beef pho and they were delicious.  The place is as you expect, its tight with no frills but it didn't matter.  Service was good, great on a cold and rainy San Francisco day!", "author": "Carla F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-07", "description": "Pho in Chinatown, because why not?  It hit the spot on a rainy day, but it's really not something to make a special trip out of your way for.  There are much better options in Little Saigon, but it was still decent.\n\nExtra Large Pho: The most noticeable aspect were the HUGE meatballs.  I suspect most places halve or quarter their meatballs, but it was the whole thing here.  Like 3-4 bites per meatball.  I skipped the tendon and tripe (since I'm not into the slimy/chewy texture) but enjoyed all the other meats.  Overall, the meat portion seemed a tad smaller than other \"Extra Large\" bowls around town.  The noodles were al dente and just the right portion for me.  They put in tons of broth compared to the noodles, which is exactly how I like it.  The broth itself was ok, but I've definitely had better elsewhere (e.g. Bodega Bistro, Pho 2000).", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Pros: good food\nThey take credit card\nOwner is very nice\n\nCons: gotta walk up Chinatown (not really a con if you need exercise)\n\nI do prefer their lunch plates over the pho here but they're both good.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-06", "description": "I'm used to not getting great service at Vietnamese restaurants, but it was extraordinarily bad here. To top that, it was the blandest pho I've had in my life. The prices were cheap: $7.95 for a small, but it was huge. They give you plenty of meat, but the broth had absolutely no flavor. The hoisin sauce is thinned out, and no matter how much I doused in my pho, it didn't help. There are so many better places in town.", "author": "Ha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Quality of the pho (broth and amount of contents) has slipped just a bit on my last two visits, since Golden Flower was apparently discovered by a source that now sends a lot of non-Asian diners. \n\nIt's still very, very good but no longer destination pho. Which is actually quite liberating because if you have another favorite pho place, now you don't have to make a special trip to Chinatown.", "author": "Otis M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-25", "description": "I had the Lemongrass Chicken, but it consisted of only onion slices and chicken, and without any lemongrass flavor that I could detect.\n\nSo, while it was decent, it didn't seem to live up to its name.\n\nService was attentive and the prices are $1-2 lower than all the others nearby,", "author": "Some Bozo .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "This hole in the wall restaurant is not only an excellent Vietnamese noodle joint, but also makes for your money's worth. It is a must visit if you're a fan of a delicious bowl of piping hot Pho noodle soup cooked without the dreaded MSG. The food is reasonably priced and the cheapest bowl of Pho goes for about $7 dollars. Moreover, the portions are generous (the large bowl is twice my face) and the quality justifies the price. Other highlights on the menu include a fragrant flame broiled lemongrass beef, crisped deep fried golden imperial rolls and perfectly flavored shrimp sticks that only creates an umami experience. Their cooking never fails to hit the spot, no wonder this place is attracts so many people. Also, the restaurant features a huge variety of vegetarian meals as well as popular Chinese dishes- it's like a one stop shop for all! \n\nThe longstanding popularity (15 years) of this place is partly thanks to its location: one that is easy to stumble upon in the heart of San Francisco aka Chinatown. It's blue themed décor and stand out signage catches ones eye in the fortune cookie stricken part of the city. The restaurant is a great option for a quick solo lunch or communal blow-out with the mates (longest table fits 12 people). It's a great place to go when you're hungry as the dishes come out at the speed of light. Furthermore, the service is faultless. The staff is extremely attentive, meanwhile, the owner of this place is extremely friendly which makes the environment feel more homely and further enhances the dining experience. She will remember you and will remember any of your special requests, even if you've only visited once. Let me tell you, Golden Flower is the REAL DEAL.", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "The ladies here are super nice. Food was great! Prices are super reasonable for a good quantity. We also had sweet and sour chicken which was yummy. Pho was awesome . We had a good time. The restaurant is nice and seems private. I left full and happy. Thank You", "author": "Sean V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "There's a few pho places around the area but I have been going to this one a lot more since it is a bit of a walk. The distance help, if you ate a big bowl of pho and need to stay awake in the office...\n\n+Quick service\n+Quick staff\n+Quick food turnover\n\nCan be a bit of a wait during rush hour but if I'm not in a hurry I will definitely wait.", "author": "Sam Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "I really loved this restaurant! My favorite Vietnamese dish is catfish in a claypot and they prepared it very well. It was truly delicious. We are visiting from South Texas and Minnesota and found this place to be cozy and special. The owner was exceptionally friendly and made us feel like close friends. Hopefully we will try it again...GREAT!! Miguel/Gator", "author": "Miguel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Best pho I've had in the city! We stopped by around 1 PM and it was empty, we sat down anyway and ordered. By the time our food came out, the place was packed! I had pho tai nam and my wife had seafood pho. We also got eggrolls and Vietnamese iced coffee & milk. Delicious all around, and the staff was professional and very nice. Stop by this place if you're in the area, you won't regret it!", "author": "Will T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "I ended up at this restaurant after not being served at another pho place around the corner. I was single and was sat down and served right away. There was only a couple there with a child. \n\nI ordered a simple pho and it arrived quickly, was good and I was happy to leave a very good tip.\n\nThe decor was a little dated, the young waitress was paying more attention to her phone, but that was fine, there was nobody else there. Otherwise a nice warm pho on a cool night did the trick.", "author": "Ben N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Amazing food awesome service ,  small cosy place . The best Vietnamese food I have tried.", "author": "Samira D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "I came here because they take credit card (vs golden star which is cash only). I got the rare beef pho. The small size is still big and has plenty of noodles and beef. The broth is nothing special. It was quick and warm lunch. It was total of $8.45 which is a good price.", "author": "Christie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-29", "description": "The place has sort of a family-run restaurant feel to it. It's small, but service was fast. I ordered the rare beef pho (small size), which was ~$7.75. There was surprisingly a lot of noodle and meat, a pleasant surprise really. The broth however was a bit flat and isn't as rich. It was still tasty though, after adding some sauces.", "author": "Adrian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "The pho here is good and the rare beef dish is one of my favorites but what makes this place better than most is the service and the cleanliness.  Prices are reasonable and the value is there.  My neighborhood pho joint for sure.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "Had the worst dining experience from Golden Flower. I came in with my friend around noon time. I ordered a small bowl of pho and on my fourth bite, I noticed a FLY inside. I told the worker about it and she wasn't apologetic and had a very unprofessional attitude towards the problem. Clearly the problem was in the kitchen but she tried to deny it and make up some bullshit to cover the restaurant flaws. After the confrontation, my friend who was still in the middle of eating, another worker just went up to our table and puts the check on it when we didn't even request to check out. At this point, we were fed up with the unprofessional service so we paid and left. NOT COMING HERE EVER AGAIN.", "author": "Rose T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Golden Flower is my favorite Vietnamese restaurant in the neighborhood, and for a while I was eating there at least once a week for lunch. It's also my go-to spot for a quick and easy dinner close to home. The space itself isn't anything special; in fact, when it's super busy it feels really cramped and it's hard to navigate past tables. But the woman who runs the restaurant is an absolute doll and the food is consistently delicious. \n\nMy favorite dishes are the shrimp and pork roll (their peanut sauce is addicting), the imperial rolls (crispy and full of flavor), the rare steak beef pho (their broth heals all ailments), and the five spice chicken rice plate with an egg (hearty portion and chicken is perfectly cooked). Really you can't go wrong with anything you order from there. The small pho is the perfect size; any larger and you'd have to roll me out of there. The pho comes with a large plate of add-ins, like thai basil, jalapeno and lime. \n\nFinal notes: Service is a bit lacking (the servers are not the friendliest), but food is delivered quickly and efficiently. Do yourself a favor and don't use their restroom. If you love noodles, this place will quickly become one of your favorite spots.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "It seemed like locals go there often. It was very busy when we visited. The chicken/mushroom/rice plate I had was great.", "author": "Michal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Came here with Nate and Chad and had the phone love phone eat phone whenever I can best phone I have had ever maybe next time I will come back here and eat more phone", "author": "Heywood J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Stopped in here on vacation on a whim and so glad I did!!!  Rare steak pho was delicious and small portion goes a LONG way. Very friendly staff and fast service.  I will definitely put this on my go to list!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "An average Viet eatery (doesn't necessarily mean bad) with many of the same menu items you can find elsewhere. The fact that they open later than many places - and in Chinatown at that - gave them a better than average grade.\n\nTheir Bun Bo Hue is how I like it - oily and full of flavors - I would return just for it. The Imperial Rolls is good as well but that's because I like fried rolls with rice paper instead of egg wrappers used for egg rolls and wonton. Friends liked their pho but I thought it was just like anywhere else. The Bun Thit Nuong is good, not outstanding.\n\nThe place feels like a noodle house, more than a restaurant so it's very casual. Tables are for two or four with a large central group table if needed. The restroom is passed the cash register and down one level of narrow stairs.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Loved this place.  Great pho, and could definitely tell we were in the right place in China Town because we were only customers that spoke English.  Staff was attentive, spoke English, and delivered tasty food quickly.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-11", "description": "A group of us were nearby around Union Square and decided to walked into Chinatown for dinner on Wednesday, October 7th around 8:45pm. We were a group of 4 and easily grabbed a table.\n\nPho: beef noodle soup ($6.70 small, $7.30 medium, $7.85 large)\n1. Xe lua (extra large): special combo with rare slices of steak, well-done brisket, flank, tendon, tripe & beef balls\n10. Tai chin: rare steak with brisket\n\n23. Cha gio: egg rolls ($6.40)\n48. Com ga ngu vi huong & cha gio: five spice chicken with imperial rolls ($8.95)\n\nI got the #1. I'm not sure if I got to pick the size since it says extra large by the description, but it looked the same size as the #10 we got which was a large. The #1 had good variety of meats and toppings. And a lot of soup! I love drinking the soup, so this was perfect for me. We all shared the imperial rolls. A good portion as I think we got 6 of them. And they gave us rice paper to make rolls as well.\n\nNice option for pho in Chinatown. I work in downtown, so it's nice to know Golden Flower is close by.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-09", "description": "First time trying this place and had thier #1 pho and #91 Bun bo hue. \n\nI'm a visitor to the city and saw the high ratings and good reviews here, so I made it a point to get some real good Viet food before I fly home.\n\nWas sorely disappointed.\n\nI'm Vietnamese and grew up eating Viet food. I can say without a doubt that this is not the place to experience good Vietnamese food in San Francisco. \n\nGood:\n- Service was quick and efficient\n- Portions are large for the prices\n\nBad:\n- THE PHO BROTH IS LOADED WITH MSG. The type where you're extremely thirsty after your meal and have a dry mouth. I ate here about 3 hours ago and still feel this way. \n\n- Bun Bo Hue lacked a lot of flavour - basically bland water soup with no spiciness. Doesn't have all the meats that usually comes with this type of soup noodle. And to top that all off, they used the WRONG noodles (vermicelli noodles) instead of the thick round noodles normally in this! Couldn't finish it.\n\n-They water down their Hoisin sauce condiment!! It was absolutely disgusting to know they fool around with the sauce to save on cost. It made dipping my meats difficult and so I had to resort to POURING the sauce from the dipping plate onto my meat.", "author": "Ethan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "So we were staying at the Hilton right around the corner. I placed an order to go for Tai Pho, and was pleasantly surprised about the quality and quantity of what was included with each order. The reason for the 4 star rating was about the price versus the soup ordered. When I looked online and it was listed at one price and when I went to pick up was given a differant total.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "I love this place (probably too much). I come in and they don't even ask me for my order any more, they just say \"the usual?\" Its great. The people who work here are so kind and clearly work very hard. The #5 is what I normally get. The broth is delicious and I always ask for 5 limes (I'm weird) and they never question me. :)", "author": "Kelli N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "Pretty decent vietnamese restaurant in Chinatown. I enjoyed my pho although it wasn't amazing. The beef tartare was delicious. They even have banh xeo! I like the variety especially since not every place serves every vietnamese dish like banh xeo. The price is pretty decent too.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "We loved the Imperial Roll and the Ginger Chicken a lot. Dipping sauce very nice too. The \nLemongrass Chicken is a hot dish for you fire breathers, but needs more  lemongrass and fewer onions. Waitstaff speaks both Chinese and English fluently, and are both polite and kind. Prices good. Good portion size too.", "author": "Susan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-14", "description": "This place started my pho career. I use to come here so often but I haven't had the chance to until I came here for lunch today with a couple of friends who worked nearby.\n\nAt 12pm on a weekday, the place is pretty much packed. People who worked near by were coming in and out so there was no wait in line.\n\nI like how they offer \"only tendons\" with pho on their menu. Honestly, tendons are my favorite part of the pho and other restaurants don't have this option on their menu unless you request it. We know the food is fresh since our food came out about 15 mins after we ordered. At other pho places, they come within 5 mins when all they had to do is dump noodles and other goodies in a bowl with broth.\n\nI ordered a small for $6.70 which is enough for me for lunch during work hours since I wouldn't want to go back to work all bloated. However, my friends(guys) who ordered a large size says it wasn't enough for them. Each size up is less than a dollar more so don't be afraid to order a bigger size if you are really hungry.The soup was a little watered down I had to add extra herbs to create extra flavor for my liking. For the rest of the day, I had to drink a lot of water to quench my thirst which is probably from the extra MSG in their broth. Although it's not the best broth I had, the rice noodles were good. It was soft and smooth.\n\nThe service is pretty quick. They seat you immediately and take your order within minutes. All the workers were pacing back and forth.\n\nOverall, I would come back to grab a quick sit-down meal. This is a place for casualty, cheap food, and quick service.", "author": "Allie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Such great service here. Really friendly family who took care of us on a Sunday. Delicious pho, goi cun, spring rolls. And a lovely 3 bean drink the kids loved.", "author": "Anne F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "It was early in the evening on Jackson Street, in San Francisco's Chinatown, when I took the photograph which accompanies this review. Chinatown is a wonderful place, full of hustle, bustle and more intrigue than a John le Carré spy novel.\n\nYou can get whatever you want in Chinatown, so be careful about what you want.\n\nFortunately, all Vesta and I wanted was to find what we heard was the best Vietnamese restaurant this side of Saigon. We know it's Ho Chi Minh City now, but the guy we met at one of the Camera stores on the Wharf, who told us, was getting up there in his years and apparently he hadn't heard about the name change, though they did it an awful long time ago.\n\nAnyway, he told us about this Vietnamese Restaurant on Jackson Street in Chinatown, that was so very good and the way he described it, we just had to go. Unfortunately, he didn't know the name of it, but he said we'd be able to find it.\n\nAfter we found a parking spot and fed the meter, I took a photograph, then we started looking. And the guy was right, it took us about thirty seconds to find it. Actually, if you look at the far right side of my photograph, you can see the Golden Flower's blue sign.\n\nAt first we weren't gonna go in, because we were supposed to meet friends at Eat At Joe's back at the Wharf later for dinner. We just went looking for the restaurant cuz it was in Chinatown and we wanted to go there anyway and cuz it was like a challenge to see if we could find it.\n\nBut we did find it and we were there and maybe I was a tiny bit hungry, so we went in and had pho, a beefy noodle pho, which wasn't all that expensive and very, very tasty. And maybe even more than we should've eaten, considering our dinner plans.\n\nIt was a nice dining experience. The pho was delightful and we'll be back when we can don't have dinner plans for later and we can eat more and more and more.", "author": "Ken D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-23", "description": "It was so hard to flag down someone down.  I had to keep flagging them down because I drank so much water.  The food was fresh and I ordered what I wanted.  Even though i didn't speak Chinese it was helpful to look at pictures to order.", "author": "Jenifer H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "Ordered to-go lemon grass shrimp and was expecting some combination of main, vegetables,  and starch. Instead, what I received was just a mix of shrimp with onions and rice( more rice than shrimp of course)... for $10.50. Oh and one ghost shrimp( just the tail and no prawn). Never again.", "author": "Masya A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "A place that I frequent - one of the better pho restaurants in the Nob Hill/Chinatown area. Prices are very reasonable at $~8-9 for a large bowl of pho. The broth is very top notch also - my typical go to is #1 since it comprises the most meats.\n\nThe imperial rolls here are also absolutely delicious with the duck sauce. View my pictures to see!", "author": "Albert K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "Dropped in on a Monday afternoon and ordered a small bowl of Pho along with a Viet iced coffee. \nOverall, the noodles wasn't bad but the iced coffee was overfilled with ice.\n\nWhen it came to the billing, I realized they had charged me for a medium Pho instead of a small. When I brought it up to the waitress, she simply responded that \"the prices have gone up\". Hmm, then how come the menu still stated with the old prices? A bit sketchy, eh? Maybe it would be a good idea to update your menu or at least inform your customers in advance if prices increased to prevent any misunderstandings.", "author": "Minnie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "This is my favorite Vietnamese restaurant in Chinatown. I've been coming here for a long time with my family. \n\nI always get the Goi Cuong (spring rolls), and the Bun Tom Thit Nuong (grilled pork vermicelli bowl with grilled shrimp). It's my favorite. And the Com Thit Nuong (grilled pork over rice).\n\nThe restaurant is kind of cramped. It's always busy during the lunch hour. The restroom is down a steep stairway and it's kind of dirty. \nIt reminds me of a dungeon. But this Is San Francisco, most of the restaurants in Chinatown are old. \n\nThe service is good. They are pretty fast. The food is very good. It keeps me coming back for more.", "author": "Edie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Party of 7. We went peak time during lunch around noon. We were seated immediately. Very nice and friendly service. Good took a while to arrive but it was completely worth the wait because it came hot and sizzling. Me being a recent vegetarian came here specially for their vegetable noodle soup and it was everything I had imagined it to be. Def going to come back soon! \nVegetable noodle soup (veggie pho) small $7 !!!!", "author": "Arshi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "I'm a regular here. Cheap, delicious pho. Need I say more? \n\n I even take friends from out of town. They all love it. I will say the chicken is better than the seafood.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Best vegetarian pho in SF! Super friendly staff, quick service. Always our go to spot!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Long overdue review! I used to work in the City and found this to be my favorite Pho restaurant.  I came here often, and they always remembered my order! I've moved jobs now for almost 5 years and every time I'm in the City, I come my pho fix here, AND they still remember my order! Great food for the awesome price!!", "author": "Ranjini D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-03", "description": "I've read about the Golden Flower in a blog and they recommended the Pho, which is a noodle soup and the Vietnamese traditional dish. \nI've never tried that dish before, but I ordered a large Xe Lua, that is noodle soup with slices of steak, and I didn't know it was so large! If you're not really hungry, ask the small one!\nThe taste is very different from any other thing I've ever ate. Actually, I didn't like it very much, maybe because it's too different for me.\nI didn't like the ambience of the restaurant either. The tables are like those folding metal tables, neither very comfortable nor pretty.  \nThe prices are cheap, though. You can have a small noodle soup and a soda for less than 10 dollars, including tip.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "Recommend by the locals for Pho. Very flavorful broth and meat. Fixins were just what I like. Very friendly staff.", "author": "Bob A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-13", "description": "Terrible Pho. It's basically MSG + Water. So bland and tasteless. 2 stars is given for the pork chops, which is average and edible", "author": "Lân V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "Delicious food that smells great, tastes great, and looks amazing. I had the bun and the beef was well cooked. Their sauce for their salad roll is next to none. People with a Peanut allergy beware!", "author": "Winston L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "My favorite go to pho spot in Chinatown! I always get the usual number 1 large. The workers here are super friendly and welcoming. It is usually busy here during the weekends in the afternoon but they still have good service! Only thing is that their hoisin sauce is a little watered down, not thick.. I don't really use it though because their broth for pho is pretty flavorful!", "author": "Linore R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Best Pho in town!  Generous portions and delicious.  Super nice owner will take care of you.  I go to this place whenever I get a cold or want warm chicken pho.  Medium size is a solid meal for one.  I have only been here for takeout.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "We are from out of state and was craving some good Pho. This little place was excellent. Two of us shared the large brisket Pho and our other party chose the beef chow Mein and chicken fried rice. It came out to $10 a person. The brisket was sliced thin and tender with fresh water, noodles, sprouts, fresh jalapeños and lime. Pour soy sauce, sweet brown sauce and hot sauce. Very rich and addicting. We will be coming back!", "author": "Rochelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Excellent food! My sister and Aunt are locals and this is their favorite Vietnamese place. It is somewhere I will make sure to stop at each visit because it is just that good!\n\nI had #100 on the menu (prawn with bamboo shoots) with rice and it was great. My sister got a soup #98? (Sweet and sour soup) and that was really good too.", "author": "Bonnie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "My elderly grandma wanted to take a couple more minutes to decide what to get and the waiter got angry that she was taking too long. Terrible service and would not recommend anyone to come.", "author": "Bobo H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Have to drop by for quick launch it busy today took about 5 to 10 minutes for table  if you wanna come out to downtown don't bother traffic terrible have a nice day take care", "author": "Miko A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "My favorite restaurant to go to when I had my layovers in San Francisco when working with the airlines. One of my copilots took me there a few years ago and I go back there every chance I get. The owners are great people and the service is excellent. \n\nTony\nCastle Rock, CO", "author": "Tony A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "I came here to get my pho fix!  \n\nF o o d\n\nI ordered their rare steak slices, beef balls with vermicelli thin rice noodles and it was delicious!  Add Sriracha hot sauce and the pho bowl is bomb!  I couldn't ask for a more convenient place in Chinatown to fulfill my Pho craving!  \n\nhttp://www.yelp.com/biz_photos/golden-flower-vietnamese-restaurant-san-francisco?select=gz0IDGDgYm0_fpH8dgFvdg#gz0IDGDgYm0_fpH8dgFvdg\n\nTheir rice plate with a sunny side egg on top and five spice chicken on the side is good.  The five spice chicken lacked more spices to enhance the flavor of it and a crispier texture, but it was still tender and yum!\n\nhttp://www.yelp.com/biz_photos/golden-flower-vietnamese-restaurant-san-francisco?select=gz0IDGDgYm0_fpH8dgFvdg#t7n3yuneWFjNysZlJzBc2g\n\nTheir imperial rolls were pretty good!  It stands out in a way that it was the first time I had grounded taro with the mixture of pork in the imperial rolls!\n\nhttp://www.yelp.com/biz_photos/golden-flower-vietnamese-restaurant-san-francisco?select=gz0IDGDgYm0_fpH8dgFvdg#RxkN8bxJ4gWOT7B-Z3KLnw\n\nThey offer a variety of stuff that you may want with your noodle soup or rice plate!  You can customize what you want and don't want upon ordering!\n\nS e r v i c e \n\nThe servers were attentive.  When we asked for more lemon wedges or basil, they got it for us quickly.\n\nL a y o u t \n\nThis restaurant is small compared to other pho places I have been to, which makes it a cozier place to be in!\n\nF i n a l  S a y\n\nI got my pho craving fulfilled!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Vegetarian Pho with Vegetarian broth! That, among other things, is why I love this place. Outside of that, the staff is friendly and the atmosphere is pleasant.\n\nIf you're looking for a quick, affordable, place for authentic food then this is your spot.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "Well just like the Koreans taking over Japantown, the Vietnamese are taking over Chinatown, just more slowly. \n\nThis is the third Pho (pronounced Fa-uh) restaurant I have eaten at in Chinatown, and funny, they are all named Golden something. (That would be \"Kim\" something in Vietnamese)\nAnd it is the 113th or 114th Pho Noodles restaurant I have eaten in and reviewed! (I lose count, there are so many!) Call me a Pho King Noodle expert! (\"Low Fan\", or \"outsider\" version though!)\n\nThis one benefits from being on the now busy lower Jackson street corridor in Chinatown. It's busy because Obama once ducked into the Great Eastern for Chinese food, and this has seemed to create a tourist frenzy that has spilled over to nearby establishments, even if they are Vietnamese. The fat tourists don't have to walk up the hills to Grant or Stockton on the verge of a heart attack to get here. And it is closer to FiDi.\n\nIt is narrow and long, with 3 rows of tables, quatres on the sides, community or quatres in the middle. The cashier counter is in the rear. \n\nI ordered Pho Tai Bo Vien, which is rare beef slices (Tai) with beef balls (Bo Vien). No, they weren't balls from cattle, they are little meatballs you can buy at any Ranch 99 market, and popular in Pho. \n\nThe broth was pretty clear, a good sign that flavor was cooked in, not added artificially. Still, i like a little more hint of anise in my broth, and this had a little more sour taste than many. It came out quickly and the condiments were fresh. The noodles were al dente, which was different, because many places over cook them and they become mushy and milky. \n\nThe owner is from Central Vietnam. She lived in Pleiku, Da Nang, Hue, and Nha Trang. Central Vietnam, or the Highlands region, is mountainous, cooler, and the food is spicier. Hue is the ancient capital near the old DMZ. Da Nang is popular with honeymooners due to cooler and pretty scenery. Pleiku was a US Air Base during the Vietnam war. Nha Trang (actually not quite central, more north part of South) is now a top tourist destination with a beautiful beach and a recent world beauty pageant held there. \n\nThe signature noodle dish from Central is Bun Bo Hue, a hearty stew like, spicy noodle soup with just about everything thrown in. Since the owner is from Central, I would suggest trying the Bun Bo Hue if you like that dish.   \n\nThe fact that this and the other Viet places in Chinatown are all called Golden something gives a hint that, although from Vietnam, these people may be part of the large Chinese diaspora that resided in Vietnam. Most Vietnamese Vietnamese places are named after a city (like those mentioned above, or Saigon, Vung Tau, My Tho and many others) or after an important year in history, like Pho 54 (1954, the year a young general named Ho Chi Minh defeated the French at Dien Bien Phu), or after the Vietnamese family, like Vien Huong, Huynh Hiep, and many others. (This would be like Tony Roma's, etc.) \n\nThe Vietnamese restaurants with names like Golden something in English, or Kim something something in Vietnamese (Pho Kim Long), are often Chinese-Vietnamese. They could be diaspora for generations, so it often doesn't show up in the food, and especially to the American or non-Vietnamese. But sometimes it does.\n\nBut perhaps they are called Golden something for the American tourists to remember, and for good luck. Most tourists from the midwest not exposed to Vietnamese food will still come into a restaurant like this looking for Chow Mien and fried rice. At least they can get egg rolls. (Cha Gio, pronounced Cha Yaw) and spring rolls (Goi Cuon, pronounced Goy Koon). \n\nVietnamese, like Chinese, is a Tonal language, so getting the pronunciation is only half the battle. The tone of each word is critical to the meaning. Their are 6 ways to say \"Ba\" in Vietnamese, and depending on the tone, it means 6 different things.  \n\nAlthough big brother to the north (China) has meddled with Vietnam through the ages, the Chinese in Vietnam were discriminated against as a minority, not unlike the other minorities in the region, like the Hmong, Mien, and others. In Saigon (Now Ho Chi Minh City), there was a specific large ghetto in the city called Cho Lon (still there) that is the Chinese district.", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Hands down best pho in the area! The food is amazing and the owner is the sweetest lady who remembers every regular. Been going here for over a year and still best in my opinion! Love the family feel!", "author": "Dave E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "This place is a sweet little restaurant with really nice workers. I got the vermicelli with grilled beef and egg rolls and it was a huge portion, since it was only one size. I managed to eat most of it and it was pretty delicious! The meat was very juicy and fresh, but the eggrolls were just mediocre in my opinion. Regardless it was still delicious!\n\nMy other family members got pho and the large size is humongous so I'd recommend sticking with the small size unless you're really hungry ;) \n\nAnyway, workers were nice, food was good, the only downside is that it's a little tightly packed inside, but definitely worth visiting and trying if you're craving Vietnamese food!", "author": "Vi D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-16", "description": "Last Friday night, my party of five (plus our service dog) came in because the wonderful Z&Y Restaurant was filled. We were visiting from out of town with friends from SoCal after a long days walk and sightseeing.  I didnt want to pre-judge this hole-in-the-wall (from past experience these could be quite good). Despite cramped quarters, a good amount of people indicated possible good food. \n  However, bad things happened from the outset. As we got seated, the young waitress/hostess spoke in vietnamese to (I assume) the owner and then said our dog was not allowed in. I responded that he is a service dog as his vest indicated. She wanted to see his certification. I responded there is no such thing and by law she cannot ask me for that. She and the \"owner\" went back and forth in vietnamese. The \"owner\" appeared upset and walked away to the kitchen.\n   Next, the bathroom and pathway to it was dirty, untidy, and in worrisome condition.\n   Finally, it is important to note that our two kids dont eat like adults. So, we ordered 3 large Phô soups to share amongst us. The older lady (owner?) came and said that for 3 orders she wasnt willing to seat 5 ppl at a large table esp. becuz she was expecting possibly a party of 8 at some point. We shared that she could seat us at a table that seats 5 ppl. She didn't want to. I said we are paying customers that had hungry kids. She said she was sorry but she didn't want to serve us. I repeated that she could seat us at an appropriate table. Confused (or perturbed) she walked away saying she had to figure something out.\n   My family and friends shared that they were uncomfortable there and were afraid what the restaurant would do to the food if we stayed. So, we left. Some people around us spoke to each other that it appeared that the real problem seemed to be that the restaurant didn't want a service animal in there restaurant. I wondered the same. \n   We will not be returning. I hope any person that supports service animals will not support this horrible place.", "author": "Alex N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-08", "description": "Came here on New Years Day because every other Chinese restaurant in Chinatown was packed.\n\nPrice: CHEAP, like DAMNNNN cheap.\n\nFood: Ok, this is the bad part, everything was very \"meh\" and trust me, I was hungry. I ordered their \"extra large\" number 1. The only thing I noticed was big was the bowl, the contents looked the same as my friend's mediums and smalls.\n\nWould not return.\nAlso, if you're eating Pho in Chinatown, you're doing something wrong.", "author": "Da X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "A little diamond in the ruff. We came to explore china town and started craving pho and asked a store owner of any places she recommended and she told us about the Golden Flower. \nYummyyyyy! Best Thai tea I've had in a good while! The pho was great as well. I suggest to go hungry so you could finish the bowl. \nNext time we come to China town we'll come back:)", "author": "Stacy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "I first discovered this place completely by accident, and am sure glad that I did. I was making my way back towards downtown through the Chinatown streets and caught a whiff of something magnificent, and as soon as I did; my autopilot took over and led me directly to the front doors of this establishment. I didn't bother to read the menu posted outside, I just took a look inside and saw a packed dining area and knew that was a sign that the food here was gonna be delicious(always go where lines are longest). I went inside and was instantly greeted with open arms and was told to have a seat anywhere I pleased(this was funny because there was only one table open). I didn't bother looking at the menu, I told the waitress to just bring me an order of spring rolls with peanut sauce and a medium combination Pho With Rice noodles; the same thing I order at every Vietnamese restaurant. \n  The food arrived at my table within 5 minutes of ordering and as soon as the plate hit the table, I went to work. I started with the spring rolls (soup was still too hot to eat) with peanut sauce, and man oh man were they good. They came four to an order and were stuffed full of noodles, veggies, and shrimp, and were rolled perfectly tight (I wonder what else they can roll up like a boss ;). I destroyed the spring rolls within minutes and quickly moved on to the Pho. The soup was still hot as S***, but I didn't care; I was there to grub. I'm glad I waited to eat this last, by the time I practically submerged my face into this bowl; the noodles softened up and the beef had cooked itself to medium rare, just the way I like it. The bowl was a good size for the price, and was filled with all kinds of seafood and beef; accompanied by a delicious broth and generous amount of noodles. \n  I will definitely be back here soon, I could F***  up the whole pot of this Pho, yum.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "I've realized that Yelp is not so reliable for certain types of eateries, so the 3.5 star rating for Golden Flower was reassuring. Chinatown restaurants need not be clean, just cheap and good-tasting. Which Golden Flower is: I decided to branch out from pho and get the #36 cold rice noodles with shrimp and pork. One of my friends and I also split an order of imperial rolls. They tasted freshly fried and very crunchy, thus yummy, though I couldn't quite distinguish what the fillings were. The noodles come with a sweet/sour/spicy sauce, same as the dipping sauce for the rolls, but I also added a bit of soy sauce for saltiness. One can easily get a satiating meal here for less than $10, so Golden Flower is a win in my book.", "author": "Amy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "This is a decent place to get pho. My friends and I came on a Saturday and it was packed. We got a table in the very back near the entrance to the kitchen.\n\nI got the #1 because it was the biggest and the cheapest. I came out pretty fast. It was a decent tasting bowl of pho. No pizazz or anything. The soup did taste a bit different though. Was it a bit sour before I added anything in there?\n\nYou can reference my picture.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "I ordered a small Pho Tai here and it was hard not to like it. The prices are very reasonable as well - I paid $6 for it. Quick service as well, I was I and our in less than 30 minutes.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "Decent pho. Excellent prices. Comes out fast. Takes credit card!\n\nPretty clean, I don't get the impulse to clean all my utensils beforehand like I do at other places, so that's a good sign.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "I love this place! I finally tried it after passing by it countless times. It has a clean appearance outside that is very inviting, and they're accommodating inside as well. \n\nI ordered pork imperial rolls - five stars, so good. I also got a small bowl of pho with rare beef, also up to expectations. \n\nThis was worth every dollar and I wish I'd tried this place earlier! I'll be back.", "author": "Denise R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "So we went somewhere else first and didn't seem like we were ever going to get service and the prices were sky high so we left there and found the Golden Flower.  \n\nIt is small inside but big on service and food.  We all got something different (check pics) and now it's one of our favorites.\n\nI had the seafood chow mein with rice noodles, 3 others had different soups and one had beef and pork fried rice.  I tried everyone's food and I liked everything.  I'm not an expert on Vietnamese food but I do know what I like.  I like spicy and good/spicy is was.\n\nThe service was friendly and fast and talk about good.  I need to learn some Vietnamese and fast so I can know what I'm ordering.  I do know it was good and everyone was more than satisfied.\n\nAnd talk about affordable.  This place is a diamond in the rough.", "author": "MyShawn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Wow, we found this hidden place as we looked around the corner when we were touring china town. This place probably has some of the best pho I've tasted in the bay area!! I was really pleasantly surprised.\n\nThe soup wasn't too salty and I appreciated that the noodles were not too soggy- it was perfect! I'll be going back for more!", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Excellent ---authentic greasy and delicious. I had the lemongrass chicken. It came spices like I asked. Also the tea was yummy! Thank you!", "author": "Barbara P. W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-28", "description": "Somehow the bill came up to $27 for a medium steak pho and shrimp on a stick. Couldn't read the bill so paid it and left a tip. Not sure if I'll be going again. The medium pho is $7.30 and shrimp on a stick is $8.95. $11 in tax is a bit interesting.", "author": "Dagan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "I just love being in a china town! This is a great place also for vegeterians. I had a soup - btw if you say you want a small one it is still huge! It just have the right atmosphere. Its crowded though so you might have a trouble to find a space. The food was average but good. Deff coming back.", "author": "Veronika J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "I'm a vegan and it's very hard to find delicious Veggy pho broth anywhere. I will say, that Golden Flowers broth tops the cake! Such an AMAZING Veggy pho! Must have if you enjoy vegetarian/vegan food!", "author": "Cara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "Meh. I think this place was a little too overhyped for me. I got the pho combo with beef, steak, brisket, tendon, & tripe. The beef seemed a little too overcooked for me. The noodles were hard. And they only put one peice of tendon in there. \n\nThe broth was good though & I like how this pho place stayed open later than the other ones in Chinatown.", "author": "Alysha K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-07", "description": "Everything is just Golden in the world of Vietnamese restaurants in San Francisco. Golden Star. Golden King. Golden Era. Golden Buddha. I'm just waiting for Golden Girls, and in would walk the Vietnamese version of Rose Nylund telling stories about St. Olaf in the far north of the Mekong Delta. But for now, Jamie W. and I settled for Golden Flower, and \"settled\" is the right word since the pho was just not up to snuff...fo' sho. We came here just because down the block, Hunan Homes was packed with tourists off a bus on that particular Sunday evening. Alas, Golden Flower was comparatively with the veteran waitress leaning contently against the counter. \n\nOf course, I went for the signature pho, the extra-large $5.15 bowl of Xe Lua, which was a combination of rare slices of steak, well-done brisket, flank, tendon, and the proverbial beef balls (see photo). With all that going for it, I was expecting more, but the broth was watery and the noodles somewhat limp. Jamie had relatively better luck with the $5.25 Ga Cari Rice Plate, which featured stir-fried chicken mixed with carrots, onions, and bell peppers in a hot curry sauce (see photo). But again, it was a pretty standard dish, suitable for the quick fix we needed at the time. Honestly, the memory of Golden Flower is fading just as I'm writing this review, and with so many Golden choices around, you'll hardly suffer for missing this particular bloom. \n\nFOOD - 3 stars...passable pho, just barely worth a pass\nAMBIANCE - 2.5 stars...the standard Chinatown gig \nSERVICE - 2.5 stars...served us, left us \nTOTAL - 3 stars...Golden but not golden...know what I mean?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Golden Flower, you aren't as good as you were a couple of years ago, but you're still quite delicious. I mean, a bowl of bun bo hue for under $10, stuffed full of noodles, hot peppers, bean sprouts, pork blood, pork knuckles, and random beef slices. Soooo good. Dirt cheap, divey, and cramped. Just my kind of place. The food comes out super quickly and is seasoned well without any salt lick, and they've got all the classic Viet drinks, including my fav - the three color. They also have the salt plum water and red bean drink. Waits aren't extensive because it's an Asian get-it-and-go place, so don't ever worry about that. A great place to eat overall.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Bang for your buck. Pho is always a cheap option, and this place really maximizes your dollar. I got the extra large veggie pho with beef broth, and I must say, it's pretty flippin good. I came with a party of 9, and they seated us all comfortably. The only issue that is bringing this review down by 1 star is the service. Jesus Christ. The service here genuinely makes me cringe. They got our order right, but without a joke, we asked for water 4 or 5 times. Finally, my brother got up AND GOT THE WATER HIMSELF. That really showed how bad the service was, but the lack of service is made up with the flavor of the food. Quality is a little lacking, but you get what you pay for. I still believe that the best Pho in SF is \"Lovin Hut\" in the Westfield mall, but this place isn't bad either. I'm from LA (where everyone is a health freak) and so this felt a little unhealthy to me. It felt very sodium and MSG filled and was clearly not made with bone marrow, but I think that's what added to the strong, distinct, good flavor of the broth here. So I would give this place a try if you're in the area.", "author": "Eli K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Golden Flower has the best vegetarian pho I've had in the city! The staff is always super friendly and the pho never disappoints", "author": "Shelby G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "This is my new go to spot for pho. Perfect for cold or rainy days. a Lifesaver for days when I'm struggling at work through a hangover. \nI've had better pho, but i have not found a better pho spot near here. I moved back to the area about a year ago and i really struggled to find a good pho place. \nIt's a pretty small place, and they can get pretty busy at lunch. Sometimes when I go by my self they've asked me to share a table with someone, and I totally don't mind it. This place is worth it. \nI pretty much always get Pho with rare beef, usually a medium. The price is good, and I always leave satisfied. \nThe staff are always very nice. They have cute decorations all over... It makes me look forward to the cooler days ahead.", "author": "Lacy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "This is a great place for a fast lunch. The service is fast, and the pho tastes pretty good. I would come here again for lunch. I wouldn't come here with a huge group such as more than 5 people during crowded times.", "author": "Hina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "The Pho was pretty good , kinda hard to mess that up . If you like fried tofu you absolutely have to tell them to make it like the #70 lemongrass chicken , but with tofu . It is unfrickinbelievable ! My wife and I are always on the search for the perfect tofu,  this place did it !", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "I miss you! Spent a weekend in SF and this was literally the greatest thing we had. Prices are great, people are wonderful and I can't wait to go back. \nThe sweetest owner, made sure we were taken care of.", "author": "Erol G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "This is a great place for lunch, my wife and I ate for 20 bucks and the was great! I suggest you stop by if you like Vietnamese food! I order the Chowmein and it was reasonable for the price.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-17", "description": "Very rude staff. No wonder the restaurant was almost empty while their neighbor a few doors down had a line of at least 20 people waiting. The food was ok, but nothing special and the attitude of the wait staff ruined the meal.", "author": "Michele D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Came here yesterday with my cousin after visiting my grandma in the hospital. Super spontaneous, my cousin had to get back to work and we needed a quick bite for lunch. This place was pretty packed, when we walked in, luckily we got a table.\n\nTo be honest, I haven't been into Chinatown for years. I practically grew up in Chinatown, but I hate looking for parking and feeling crowded, so I rarely eat in Chinatown anymore. Especially with my line of job.\n\nAnyways, the first time I ate at this restaurant was with my mom. I also ate here a lot while I was in high school. Coming back to this restaurant brings back so much childhood memories.\n\nI always order the #1. I use to be able to eat the extra large, I know now; however, I can't finish it. I was super shocked they allowed me to order #1 in small, that's pretty awesome. The soup was just as good as I remembered it. The noodles were good the meat was good, I just wished I remembered to order the rare steak on the side.\n\nThe decore looks the same to me, the restroom is still downstairs and not updated but, I expect it from Chinatown. I forget how much of these old places in Chinatown bring so much history.", "author": "Susan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-05", "description": "I was about to head to San Sun nearby with my parents but decided to try Golden Flower instead. \nI don't know whether or not they were just having a bad day but the pho was beyond terrible. I have eaten a number of bowls of pho and can say that the pho here was terrible. We all ordered the #1, classic beef pho with everything in it. The broth tasted like tap water, the noodles were incredibly thick, the pieces of beef were small and pathetic looking, and the hoisin sauce was watered down to a sloppy mess. \nThe pho gets a 1 star but their service gets my pity +1 star. \nDefinitely will stick with the other pho places around here. Don't agree with the reviews.", "author": "Gina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "I love pho. You should be aware I eat it about twice a week. Sometimes even more. Last week, I went here two nights in a row (getting different things of course) and then I just went last night. To be honest, I am a little embarrassed because one of the waitresses asked me if I came in earlier in the past week since she recognizes my face. I just played it off cool and neither said yes or no but she probably knows. I am going to have to start bringing more friends here so I don't seem like a total loser.\n\nLet me start by saying that I have tried the top three things everyone likes at a vietnamese restaurant. \n\nPho: Yes, its legit. Pretty damn good. Go with the medium size pho, it will fill you up like no other. You have to be pretty hungry to finish a large. BEWARE\n\nBun Bo Hue: BIM BO HIPPPPP. I love this stuff. Its this spicy broth with pork blood and rice noodles. If pho was the sweet girl next door, Bun Bo Hue would be the cool, hipster chick that lives across the street. You get it once in a while to get that extra flavor and kick. I prefer to get this noodle soup with the PHO noodles and not rice noodles because this noodle soup is suppose to have a lot of flavor but I think rick noodles don't soak up the flavor as well as the pho noodles; up to you. \n\nVermicelli: If you really feel like a skinny gal tonight, order this. Its basically a bed of lettuce coupled with mints and sprouts with a bundle of dry vermicelli blanketed with sweet, fish Vietnamese sauce. You can order it with spring rolls on top or bbq or shrimp....(list goes on and on...) I must say, you have to ask for another thing of sauce, its simply not enough or else your noodles will be too dry. This is basically a light noodle salad( but it will fill up)!", "author": "Eileen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "The best pho in SF. Love the people work there, sweet, friendly and happy. Feels like home.", "author": "Lily N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-30", "description": "\"people on yelp love us\".. Sorry I can not say the same ..\n\nThe pho broth had a sour taste.. Lemon in the broth? It was not a hearty satisfying broth that I am accustomed to.  The brisket seemed really dry.. and that's usually my favorite meat. The noodles must have been cooked and put aside because once I received my pho, All the noodles were breaking apart, and some stayed clumped together.\n\nThe service was good, water was refilled without asking. The food came out fast.  Unfortunately, I can not say I will be back here again.", "author": "Sharon N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "I love this place! Good is great and service is good! I have become a frequent there now. Love the Pho and Bu Hue Spicy Soup", "author": "Mana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "My bf and I are definite fans of Golden Flower Vietnamese Restaurant!  We came here for my *birthday* lunch yesterday - he had the grilled chicken over rice vermicelli (loved the flavoring of the chicken), and I had the chicken pho sprinkled with fresh bean sprouts and basil (loved the rice vinegar-y soup base, comfort food, very comforting).  \n\nWe will definitely be back as we slurped our meals quickly, the service was nice & friendly, and the price was right!  \n\nOur two entrees+tax+tip = $17", "author": "Maile N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "My boyfriend and I have made this our local spot. Quick service, good pho, quiet vibe. I've never gotten take out from here but eating there's always been consistently good!", "author": "Charlotte H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-18", "description": "Solid and cheap Vietnam kitchen. Big ass Pho for only 7 bucks! Big but not really intense of flavor. Worth the price but that's it.", "author": "Richy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "The bean sprouts were dead. Not so pretty. The pho was pretty bland too. :( they gave us a dirty cup and we asked for a new one. We asked for new bean sprouts too but they said all were the same. We saw another table have better bean sprouts. They did offer to cook our bean sprouts but how would that work when it's already dead? Usually I would come and it would be great but this time around it was disappointing and the staff seemed to have changed again..", "author": "Person W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "Me and the boyfriend always order the #1 and the rare beef salad.\n\nThe #1 pho is extra large. Typical pho, nothing extraordinarily (rating 2/5). \n\nTheir rare beef salad is pretty good. Only tried the one at this place and the one on Ocean (the one on Ocean wasn't that great). rating 5/5. This time they forgot to give me bean sprouts... I was too hungry to notice..\n\nI barely come to Chinatown and when I do, I always stop by for the rare beef salad and avocado shake at Sweet Heart.", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "Best Pho in SF, hands down.\n\nTheir broth and ingredients are top-notch, and you can taste it!  You can go somewhere else and pay $9 for sub-par broth, skimpy ingredients, and feel gipped -OR- you can come here, get food made with love and tradition, pay ~$6, and feel amazing.\n\nI always order when it's been a long day, and I need some PHO-nicillin.  Thanks!", "author": "John P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-14", "description": "I'm not sure if the owners are really Vietnamese...Not that it takes a Vietnamese person to cook good pho. But fact of the matter is, the Pho here lacks a bit of soul. The broth is not full and or robust like any broth should be.\n\nWith all that said, the pho comes out quick. You get your food and you are sent on your way.\n\nPrices seem good for a downtown location.\n\nSomeone at another table ordered a chicken dish of some sort and that looked tasty.\n\nIt's not a horrible place, it's not a great place..Just ho-hum at it's best.", "author": "Vince N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-02", "description": "Made the mistake of coming here for a couple of sandwiches. So I was walking back to my car and felt like grabbing a sandwich. The place I got them before were closed, so this looked like an option, especially at $3.75 each.\n\nSo I went in and got a sandwich, and was greeted in a rude manor. They told me I needed to wait 15 minutes for a sandwich? What the hell, so I decided to go to my car and put stuff away before it gets wet from the rain. They wanted my money first because they doubted anyone would wait that long especially in Chinatown, but I was stupid enough to. \n\nSo I paid and came back in 15 minutes. The sandwiches were in the bag and they were so small that it looked like one, so after feeling the bag I realized there were two. \n\nWhen I had the time to eat, I found sandwiches bad with thin baguettes. I ordered a chicken and found half way though, they used dark meats. I realized this after biting into what I thought was a bone, later to realize it was a leg joint.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Pho Ga - 5/5\nCombination vegetarian riceb- 3.5/5\nWill eat here again - 5/5 definitely.\n\nloved this place, really nice and homely place, the green tea served with the lunch was amazing and the best I have ever had", "author": "Rachit A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-29", "description": "Stopped by this week and ordered two items:\n\nNoodle Soup #16 (Hu Tieu Thap Cam) or the seafood rice noodle soup:\n\nI did not enjoy this bowl of eats. \nFirst, the soup was very very salty. \nIt didn't taste home-made at all.\nThe rice noodles clumped together in this starchy-mass of clumpiness. \n\nThe bowl had 4 shrimps, 6 small calamari pieces, 3 fish balls, and 1 piece of imitation-crab meat (yes.....I counted).\n\nOn the other hand, I ordered a round of fried Imperial rolls:\nThese rolls were enjoyable.\nThey had moist ground pork inside.\n\nMaybe an off-day for them?\nIt was quite busy when I ate there.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-29", "description": "I had a simple rare steak pho (Tai).... and my steak was hard and tough to chew on... gross...\n\nI was starting my hangover, so the soup was AMAZING to me at that point.\n\nI'm only giving them an extra star because they were 10 minutes from closing, yet they still sat us and took great care of us.  Kudos to them for that.", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-27", "description": "While earning $20.00 per day to serve as a juror, my wife can do much better than spending her small earning and buy instant ramen noodles. We all know that.\n\nI also love my new work-vehicle with all the necessary accessories that Law enforcement agencies use and drive. In my case and other than my job, I also drive the car to look for my wife in Chinatown and took her to a Vietnamese Restaurant for a deserving dinner.  \n\nI had the Lemongrass Chicken over Rice (#49). For $6.95, I get chicken pieces grilled with Vietnamese spices, egg roll, rice and vegetables. I've also added a side of shredded Pork for an additional $1.50. The poultry piece was spiced well and tender, but the eggroll tasted awkard with a weird taste. I couldn't think what the taste was like, but it wasn't too pleasing. \n\nWife took a $7.95 bowl of Grilled Pork with Cold Vermicelli Noodles, Egg Roll, Bean Spruts and vegetables (#40). I don't know the name of the bowl, but I think many of you know which popular bowl dish I'm talking about. According to her, the meat was a bit too burnt and dry. And the bean sprouts didn't look too fresh either. With many good produce markets in Chinatown, we wondered what was the reason of poor quality foods served here. \n\nI shoud've took her elsewhere but here. Or, I should've let her buy instant Ramen Noodles. \n\nBut she is not a criminal and she deserves much better food. \n\nMy decision in coming here; \"MY BAD!\"", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Tiny cute place. We really loved it! We waited longer than we would've liked since we were super hungry, but that's okay, it was busy/packed because it was Xmas ;P \nWe were served hot sugarless tea - my husband said it was flavorless but I loved it. We got vegetarian spring rolls with peanut sauce and vegetarian pho - both were fresh and yummy, and the soup was HUGE. We really only needed 1 appetizer and 1 soup for both of us to share, and like I said - we were hungry!\nVery refreshing, healthy and tasty!", "author": "Maya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-07", "description": "Not bad. \n\nWe went here mostly because my mom really wanted soup (it was a chilly day.) We all ended up sharing a large pho and some spring rolls, mostly because I wasn't really hungry (after gorging myself with dim sum.)\n\nI really didn't eat much of the pho, but what I had wasn't bad at all. Nice, beefy, and flavorful. Had a lot of nice pieces of beef. The bowl was HUGE, and for $7-something, it was a great deal. The spring rolls were a nice snack/appetizer. It was definitely homemade and tasty.\n\nOverall, for the amount of food you get and the cheap prices, it's not a bad place to get your pho/Vietnamese food fix.", "author": "Katherine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "BIG JUICY BALLS.\n\nBeef balls that is, if you order the #6 pho bowl. They were very generous with their pho toppings. Most joints will give you pathetic beef ball halves but Golden Flower puts six WHOLE MONSTROUS balls in their beef pho. Soup is very savory. The only thing that beats a hot meal on a cold day is pho noodle soup from Golden Flower.\n\nGolden Flower is the real deal. It's been here for at least 20 years. Over the past decades, I've gradually seen more Vietnamese restaurants sprouting but place holds the crown to best Vietnamese restaurant not only in the Chinatown neighborhood, but in SF.   \n\nVery cheap indeed -- our bill tallied around $20 for three people. Left with our wallet barely lighter much our bellies much fuller. YAY!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Every time I come to SF I will make a mandatory stop here (and sometimes even twice). Best spring rolls, egg rolls, Pho and especially Stir Fry I have ever had.", "author": "Jonah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "My go-to for pho in my neighborhood. Cheap, filling, and excellent flavor to the broth. Portions are large, even if you order the small size. Service is very fast and everyone is so friendly here, which is the main reason I keep returning. The restaurant is small and gets very crowded at lunch time, so try to arrive early if you have a big group. I haven't ordered anything except pho and spring rolls here (I'm in a rut!), but the rice and noodle dishes look delicious too.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-28", "description": "This is my first time back here since they have changed owners\n\nI used to come here when I was in middle school, the previous owner was really nice and very warming....but this review isn't about that\n\nThe new store...its a lil weird to me, they have all these decorations and stuff to make it look...more viet? iono...its not homey....catered to tourist i suppose\n\nI ordered a Pho with the beef balls and steak....the service was nice but my taste in pho..yea...the broth was good, but the meat...was bland...like it was....water and meat..and the noodle....was alright, a little softer than i would like....\n\ni would only come back...if all the phos place in Chinatown was closed and im craving pho (which was what happen anyways =P)", "author": "Laurie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "We stumbled across this restaurant during a weekend getaway.  It's a hole in a wall with everyday average Vietnamese fare.  Their tofu spring rolls were OK but their seafood pho was pretty good.  They do have a large number of vegetarian choices listed, but the item I picked, which was tofu with basil fell flat.  It was not very flavorful and the fried tofu did not tasted fresh.  I think they need to work on putting more love into their foods and cook with more enthusiasm - then I will come back for more!", "author": "Susie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "Like a lot of authentic Asian places, you have to really understand that if their wait staff doesn't speak English well, you need to lower your expectations of service like in most English speaking restaurants. They are attentive but not invasive.\n\nThe food is awesome and exploring the menu is half the fun. Of course they have Pho, but the rest of the menu is really a treat. The spring rolls were crisp and freshly made.", "author": "John L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-30", "description": "This place is so low key and from the outside it looks boring.\n\nWell, it is boring, that is to say the decor.\n\nFood quality is up there though.\n\nI was craving something different, and my friend recommended the #36.\nThis is a plate of BBQ'd beef and shrimps, with shredded carrots, basil, fresh bean sprouts over a bed of thin rice noodles. The beef tasted freshly grilled and shrimps tasted freshly grilled too. A solid meal.\n\nIf you don't eat peanuts, be sure to tell them 'No Peanuts'. $7.25 is a fair price for good quality.\n\nThe Cafe Sua Da was very good too.\n\nIn about 10 minutes, we had our food and my food looked deelish. As it was really deelish, I will be coming back again. I would recommend this place as A-Ok for food quality. But read on...\n\nDecor: homey, low rent and the heater was off ! Brrrr...everyone was wearing their jackets; but the food is good.\n \nCustomer service: first rate and personable.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "This is a great casual ( read sweatpants and t-shirt) pho place. As vegetarians we tried a couple of other pho places with veggie options but once we found this we stopped looking. Flavorful veggie broth and I like that they always confirm that we want veggie broth as opposed to the beef. And once we  come here a couple times they remembered what we got! Left off one star cause parking is impossible ... Don't even... And it's a little dingy but we're regulars!", "author": "Nikhil A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-26", "description": "Stopped by this relatively spacious place (for chinatown) for some pho and bun bo hue. The pho was pretty good and lived up to any other pho I've had. \n\nHowever, the Bun bo hue was odd, and seemed to be in pho broth or something, and not the standard type I've been used to, and was merely \"A-OK\" in yelp terminology.", "author": "Oliver Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-27", "description": "I'm not sure how this restaurant has received 5 stars. The summer salad roll was okay. I went with the rare beef pho. Broth wasn't there. Noodles had no flavor. No thank you.", "author": "Mayra M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-08", "description": "Been here 2x.  The owner, Kim, is a sweetheart.  She even gave me tea while I wait for my take-out dinner.  I ordered Bo Tai Chanh (raw beef salad) each time.  It was good, but the quality isnt consistent.  \n\nI also ordered their fried noodles with seafood.  Kim recommended it highly.  I went home, and was disgusted.  I am not a picky eater.  I love a good bowl of bun bo hue any day.  But that pan fried noodle, recommended by the owner was just inedible.\n\nSorry Kim, I dont think I will be coming back.", "author": "Joyce P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "This place hits home because my best friend and I had our weekly Sunday brunch here after graduating high school and before departing our separate ways to college. Nice hot bowl of pho + deep talks about life = awesome :D \n\nI'm not Vietnamese so I can't comment on whether or not the soup and preparation of the beef and noodles are legit. But I hear (and believe) it is. My first few visits here, I always got a #9 small (with well done flank?) because I'm not a huge fan of tripe or the uncooked beef slices. After awhile, I began to try their rice dishes which are really delicious! The boneless lemongrass chicken rice plate is served with sour & spicy fish sauce which I like to pour all over the chicken AND rice. Although the chicken was sometimes hard/difficult to chew, I still come back and order it again. \n\nTry to avoid rush hour (lunch time around 12-1pm) because during these times, I felt a little rushed to finish what I was eating quickly and leave for new customers to be seated. The owner (the woman behind the counter?) is really sweet, and I can tell she does her best to cater to tourists and new customers by introducing and explaining dishes. I'm a regular here so I don't get that special treatment. \n\nCompared to other pho places in SF (on Irving and down the alley to Golden King?), I think you get a lot more noodles here.", "author": "Winnie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "The spring rolls are a MUST - very fresh and delicious. This is my favorite place to get pho in the city.", "author": "Becca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-20", "description": "Wow. Portions are really large. Family run Vietnamese which is charming. Vietnamese coffee is nice and refreshing on a hot day. The place is full of Vietnamese and westerners. A good sign IMO. Not as authentic as a dirty local restaurant in Hanoi but that's being picky. We left satisfied.", "author": "Will S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "It's yum yum!! Love the flavorful food!! Service is great!! It's so close to my work!!", "author": "Ericka C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-04", "description": "When I think of Chinatown, four things come to mind: dim sum, Little Paris Vietnamese sandwiches, Chinese food, and smelly fish markets. When it comes to food, you and I probably wouldn't think of anything else to eat besides Chinese food in Chinatown, right? Ah, but you see, that is where I am wrong.\n \nThis little gem has a lot to offer to me, to you, and anyone else that doesn't want to eat Chinese food in Chinatown. I was with a friend and I really wanted some noodles, particularly cold vermicelli noodles with meat, chopped up veggies, and the infamous sweet and tangy sauce poured all over it. I remembered looking up on Yelp for a place to eat in Chinatown and I bookmarked this place to give it a try. It was kind of difficult to find this restaurant among a midst of hundreds of restaurants clumped together on busy Chinatown streets, but I couldn't have been happier when I recognized the bright blue banner that read \"Golden Flower Vietnamese Restaurant\".\n\nI ordered what I was craving which was the vermicelli noodles with beef and imperial rolls, while my friend ordered the #1 large bowl of pho. His usual, as always. As we waited for our food to come out, I was fixated on the number of people that came in and out of the restaurant. This place was poppin'. I could tell this place was a popular joint because as one table cleared out, another group quickly came in to fill up the table. It was rather impressive. Before we know it, our food arrived on our table; it didn't take more than ten minutes for the food to come out.\n\nNeedless to say, the food was spot on and delicious. Golden Flower gets a golden star in my book. Or well, yelp account. Heh.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "A pretty small place with pretty good food! \nGo and try their curry! It came out fast, fresh and fills you up for a very low price. What else can you wish?!", "author": "Daniel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Really yummy food and service was very kind and attentive. The spring rolls were delish!!!", "author": "Sheelah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "Just had the Bun with grilled pork and imperial rolls.  Very fresh and good quality.  Rolls not as good as Tu Lan, but pork had less fat and grease, plus the ambiance and neighborhood make up for a lot that Tu Lan is lacking.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "Really good Pho. Came across this place while exploring Chinatown. The portions are really good for the price and the food is really good. The beef broth they put in their Pho is some of the best I've ever tasted. I would recommend if you are near this place and are craving something warm on a cold Bay night, go to the Golden Flower.", "author": "Russ K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Found this place by accident, really tasty pho, and practically empty. Surprising, since there were lines out the door for other places just around corners. \n\nOwner was very nice, they were very attentive and helpful. I'd recommend this place to a friend.", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "This is a small family run Vietnamese restaurant on a side street in Friscos china town\nThe food tasted very fresh and was cooked to order I had the ginger chicken it was great and very resonalbly priced", "author": "David W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-18", "description": "DON'T LAUGH I USE A FORK, CHOPSTICKS, AND SOUP SPOON!\n(3.5 Stars)\n\nI don't smell like armpit! That's one thing you have to judge about a Pho places, ventilation. And this palce you will definately not see alot of \"FiDi business people\" as the other Pho restaurants in Chinatown. \n\n- Food, good/decent\n- Prices, affordable\n- Service, good/quick \n- Ambiance, small but cleaner then many vietnamese restaurants\n\nWe found a new Pho spot in Chinatown with decent prices. Our typical place which is down the block from here decided to hike their pho prices by 40%, therefore it was time for us to find a new spot. Thanks Yelp! Decided to come here after reading reviews and \"asian\" people givign it petty decent ratings. But of course, I've had better pho and I've had much worst; however this is not just okay this is on the pretty good side of the border.\n\nHEFFER-STYLE STATUS\nmy friends at work and i decided to get some Pho for lunch. Since they don't have yelp accounts...\n\nMike M. \"(Pho Tai) it's cheaper! this is pretty good but I like Golden Star better. next time I come here, i'm getting BUN BO HUE. Good job Jane in finding this place.\"\n\nSheryl C. \"(Pho Ga) it's cheaper here! i stil like Golden Star's broth better but overall this place is good... BECAUSE I LIKE THIS shredded CHICKEN =)\"\n\nPHO GA (small $5.75) - It's first instinct to judge a pho place by their simple dishes first before considering to be experimental. I sipped the broth - yummy. Noticed in their broth they added cabbage! The chicken was real chicken because you know some places you just don't know if it's chicken or some other kind of animal; just saying! And the noodles were yummy, not too mooshy and not undercooked. Overall, it was pretty good pho for $5.75 in chinatown. \n\nWill I be back? Yes we will!\n\nUntil the next review....", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "This place is probably the best quality pho in the city.  And reasonably priced too.  Highly recommend.", "author": "Maria R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "They added a hand written sign on the door that they are now serving Bun Bo Hue...that sign has since changed to a real printed sign.  \n\nThey were packed when we got there with the door open - it's a warm night so the opened door definitely help.  Luckily, we got the table next to the door.  The lady was in such a rush to take our order, she walked away before  was done.\n\nWhat we had:\n\nRare beef salad - slices of thinly sliced beef with a lot of onion, basil and peanuts served with a bowl of fish sauce.  Generous portion and very good.\n\nBun bo hue - I asked for extra spicy and it was barely spicy.  They also don't serve it with the right condiments like banana flower.  I asked for extra spice on the side a few times with no luck.  Out of frustration, I walked up to the counter and asked if they have some kind of chili oil or anything that can help spice up my soup noodle.  Five minute after, a half bowl of chili oil was brought to our table.  Dumping the entire content finally got the soup noodle looking like it should.  It comes with slices of pork loaf, couple pieces of pork feet, a piece of pork blood and slices of beef shank.\n\ngrilled chicken and imperial rolls bun - instead of the rice noodle, it was served with the bigger round noodle.  \n\niced coffee on ice - strong and tasty.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "A coworker brought me here for lunch and the food was delicious. i had the pork imperial rolls and rice and it was super good.\n\nShe ordered the beef stew and it was super crazy big and delicious as well.\n\n+ extra imperial rolls order\n\ntotal bill 18\n\nwill come again and would recommend!", "author": "Fran M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Best vietnamese sandwich ever! I got the BBQ pork viet sandwich and it was BOMB AF. I love how the bread is super crunchy and the meat is roasted to PERFECTION (not too burnt or overcooked as some places make it). Theres also alot of carrots that make it extra yummy and some jalepenos to make it just spicy enough but not too spicy. The portion was also pretty good and filled me up :)\n\nHowever, wait is 15-20 min for a sandwich because they make it fresh! I think its totally worth it though because of how delicious it is.\n\nAlso, the owner was super nice. Even though I came in during a lunch rush she was really attentive even though my friend and I were only ordering take out and made sure our takeout was to par before we left. She also told me to call in next time I want a sandwich to avoid waiting.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Delicious!! Been here all weekend and this was definitely the best meal I've had in all of San Francisco. The owner is a very sweet lady and makes sure you are happy.", "author": "Adriana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "I really love this place for their Bon Bo Hue! From all of the Bon Bo Hues I have tasted nothing comes close to this one!\n\nIn addition, the staff are super nice and friendly! And that is really rare in San Francisco's Chinatown. This place fast, affordable and they give you a good portion of food as well.", "author": "Yummy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Pho on a budget.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-19", "description": "This place is inexpensive.\n\nWe walked out paying 20 bucks for 2 small bowls of pho and 4 spring rolls.  Not bad, right?\n\nAs far as the taste goes, I think it's average, not great but not bad.", "author": "Oriana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Had the pho chin.  Amazingly, astoundingly cheap prices, good broth, and an abundance of steak.  The large is so large why settle for a small? I need to go back for the bun bo hue! Gets pretty busy at lunch, so expect to wait a bit and get friendly with your fellow guests.", "author": "Cody P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-14", "description": "Reminds me of good old times with mom when she use to take me to chinatown. BUT the food isn't all the great, average pho. Staff was attentive though.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-15", "description": "If I were to write this review 10 years ago, I would be giving this place 0 stars (is that possible?). The last time I was here, meaning that one time over 10 years ago, I had such a horrible experience that I swear I would never come back.\n\nI don't quite remember exactly what it was, but I was there with my family for dinner. They did something rude to our table, my parents complained about it and ended up getting yelled at by the staff. I have never been to a restaurant where we get yelled at for something rude they did. It was unbelievable.\n\nHowever, time passed and my friends invited me to have lunch. She chose this place because she loves the raw beef there. I thought it was time to try this place again and see if there were improvements. It was really packed there, given that it was lunch time. They were lacking the speed of service. I asked for a glass of ice water and I didn't get it until it was asked for the second time.\n\nThey accidentally spilled something on my place mat and took the liberty to switch out for a new one for me. Over all, I guess the service is better, maybe it was run by new owners and staff?\n\nFood wise, it was okay, not the best. I've had better soup base.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-24", "description": "Decent Vietnamese food. The spring rolls are huge, but filled with mostly noodles to bulk up their size. Very plain so lots of sauce is needed.\n\nThe rice place was decent. My pork chop was well seasoned. The addition of the egg on top is good, but next time I'll tell them over easy. I didn't specify and it was sunny side up and very raw tasting.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-21", "description": "Somehow I convinced my mom that Pho and Vietnamese was the same as Chinese food.  See, I had to try the Pho in SF and we were in Chinatown, so when in Rome.  My entourage doesn't really get the whole Phobsession, but luckily I could persuade them to eat here instead of the neighboring Chinese joint.  I ordered a small bowl with the beef on the side.  My mom and sis got beef and chicken dishes.  The Pho was pretty tasty.  All the ingredients were fresh tasting and the broth was just right.  The small was more than enough for me.  They gave ample amount of meat as well as all the trimmings.  My sis really liked her chicken curry dish and my mom mentioned she had had better beef and broccoli. \n\nThe service was really friendly.  Our waitress checked on us a lot and also chatted with us.  She overheard our conversation and decided to join in.  Super friendly.\n\nIt was reported back to me that the bathrooms here are super scary.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "One of our favourite Vietnamese restaurants to go for a bowl of phò. Huge bowls,  nicely seasoned and not to salty. Friendly staff.", "author": "Karlijn V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-11", "description": "Although, I can always have Vietnamese food at homes at times, when my friends want to get Vietnamese then I order shrimp spring rolls my all time favorite. I'm very simple, but some places have very disgusting tasty shrimp. This place at least it taste semi-fresh. \n\nService is great!!! (:  I would come back here again if I was in the neighborhood and craving spring rolls.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Traditional Vietnamese, very friendly staff. I had a bowl of Pho with 4 or 5 different meats and the grilled beef appetizer with fish sauce. Both were delicious. The pre meal bean sprouts with sweet/spicy sauce was refreshing. My wife had the ginger chicken and rice noodles. Needless to say, there was nothing left on the plates.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "This is the original spot that first introduced me to my love affair with Vietnamese food. I usually ordered the rare beef with beef balls. the bowls were small but enough for me at the time. It was also cheap at $5. I also lived eating their seafood noodle soup. The noodles were always perfectly cooked, clear clean flavorful broth, with fresh ingredients. it's great to know you can find good eats in Chinatown and not compromise quality in ingredients. the beef carpaccio was also delicious. park in the garages to avoid hassle!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-21", "description": "This has been my first place to ever have pho and has been my go to spot for good pho in Chinatown and it has gone downhill these past couple of years.\n Last time I came here, there was was a roach in my pho; broth was watered down and bland. I told the waiter and the lady in the front apologized and got me a new one right away.  It was nice of her to do so but by that time I had already lost my appetite.", "author": "J. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-29", "description": "Was on the search for the best pho in the bay area... Good pho here.. In second place for pho.\nBy the way my number one choice is.... Pho 2000 awsome pho", "author": "Lana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "I should've come here hungry. The pho is yummy, and I think I could've gone without adding the siracha, but that's an automatic for me now. Yes it was worth the trek from Fisherman's Wharf to here.", "author": "Ami K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-07", "description": "Not too impressed by my beef dish here: It tasted like oil and had the texture of rubber.  I'm understating it too; this was the worst thing I've probably ever eaten in a restaurant.\n\nThe pork dish that my friend had was quite good.  But that beef scared me away forever.", "author": "D B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "This joint is one of the few places that I frequent when going to lunch in Chinatown.  The dishes I order most often are #1, big beef pho, or #40 the vermicelli noodles with grilled pork and egg rolls, but always followed by iced Vietnamese Coffee. \n\nGranted, this is not THE best place for pho, but it works for me when I am in the mood for some pho during lunchtime in the FiDi on a weekday.  Considering the quality of food, and the portion I get for the price I pay, I do not have much to complain about. \n\nHowever, I will say that the place can get extremely packed during the 12-2pm bracket given the small space of the restaurant. Ventilation may not be optimal when the place is packed and every single person orders hot steamy pho, causing a rise to indoor temperature.  \n\nDo not take things personal when the waitstaff decides to stick (2) parties of one at the same table.  This is standard procedure for them (as with many other noodle joints) especially when seating is of the essence.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-14", "description": "I keep coming back and keep loving the food here.  Yesterday was grilled pork, 2 cha gio and served with rice.  Not a thing wrong with it.  The pork was deliciously seasoned.  Contrary to the experience of other diners/reviewers, this was lean and not at all fatty.  \n\nI need to try the pho one of these days.  Golden Flower is my go-to vietnamese spot for lunch.  If only they made vietnamese sandwiches, this place would be perfect!", "author": "Donna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "This is the best pho place in the neighborhood! They serve authentic Vietnamese food and the service is amazing. They never fail to serve a perfect meal!", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "I have been at this Vietnamese restaurant a total of two times. I always order numero 1 since I love pho. I am not 100% satisfied with the service but its fine as long as the foods good.  \n\n***FRIENDSNOTE*** \nThey complain that I sit there for a hour to eat one bowl. THE FOODS GOOD, BUT NOT THAT GOOD FOR ME TO  BREATHE IT IN.", "author": "Cleo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "It was my first time there and didn't know how the food was.  So to play it safe, I ordered the special Pho (#2).  Coworkers ordered some rice dish and noodle dish. \n\nMine was pretty good, but I wished they gave more veggies. As for my coworkers, they said their dish were good too and they wanted to come back. I will come back for the Bun Bo Hue.\n\nThe price of my large bowl of pho was $7.55.  Service was not bad. The ceiling was kind of low, so it felt a bit cramped. All in all, the atmosphere was pretty welcoming.", "author": "Troy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-04", "description": "OVERALL:3.6   FOOD:4   SERVICE:3.5   AMBIANCE:3   VALUE:4\nEnglish is optional, low-quality, and sometimes non-existent, but the food makes everything better!  Generous portions, fresh ingredients, quality meats, HOT!, fragrant flavors, customizable!\n\nLoved the 5-Spice Chicken Pho (added bok-choy & broccoli for $1):\nLight, ungreasy broth+al dente noodles+juicy roast chicken thigh.\n\nPretty extensive menu includes tons of non-pho options that I'll be back to try!", "author": "Amy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "my favorite Vietnamese restaurant in ct. There are a lot of restaurants in Chinatown. They also have a lot of Vietnamese restaurants but I find that Golden Flower is most authentic. Whenever I'm in the area and I'm not getting dim sum, its Golden Flower! I tried a lot of dishes here and they have never failed me. Cold days i prefer Pho Tai (steak flanks) and when its hot, I usually get their Bun dishes, Usually the one with imperial rolls and Thit Nuong (i think it's pork?) and Viet Coffee :) yumm", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "Service was good, but the food not so.  I ordered chicken pho and found a huge gnat it with wings, antennas and everythjng.  The pho itself was ok. Kinda looked watered down. The bowls were big, but didn't have enough noodles or meat. The chicken itself was real tough as if it's been sitting out. My fiancé ordered bbq chicken rice plate & he mentioned that it was sour and not good.  He barely ate 4 bites and couldn't eat anymore.  My daughter had spring rolls which were ok. Don't think I'm coming back here again.", "author": "dina d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-14", "description": "Awful. For a vegetarian especially. I am sure what I ordered-- veggie curry-- was not actually veg. I wanted to walk out when I saw the disgusting bathroom in the basement but I wanted to \"be nice\" so I tried. I was super hungry but ate 3 bites of my food (which was not what I ordered. Not anything that resembles any curry I've ever seen and it had tofu and the menu item did not and I specified no tofu! ) but sometimes restaurants where the staff don't speak English think they are doing me a favor giving me free tofu I didn't order. So I picked out a piece of broccoli and tried wiping the gooey brown sauce off on the rice. Oh god. Just don't. Don't do it.", "author": "Dawn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "This is a very inexpensive place. They have the pictures of the food so that you don't have to think about what you want. It's right in the middle of Chinatown you have to really look for it because there are a ton of competitors and you might miss it. The imperial roll is just ok.", "author": "Jorge P. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "This place was so good. The beef noodle soup was the best. We ordered the fried rolls, one beef noodle soup, one beef pho and some chow mein. Everything was very good...probably the best noodle soup I've had in the city. \n\nI think the beef noodle soup is much much tastier than the Pho.\n\nAnd it's cheap and fast. Love it!", "author": "Zarpana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "Tendon. Tripe. Brisket. It's not a menu option but they do me right by it every time I ask. Huge portions. Better than any pho I've had in Little Saigon in Westminster - yea, that's what I said!\n\nLemon beef carpaccio. Awwwwsome.\n\nGod I love this place. It's worth every congested honk across the city.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-04", "description": "Imperial rolls and large #5 (beef pho).  The pho is going to come out VERY hot.  The Imperial rolls will give you something to eat while the pho cools down.  Can't go wrong at this place.\n\n**Lost my Duke status to some jerk named Will.  Pretty sure that guy is using fake check in's.", "author": "Travis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "Quick lunch, massive portions, Beef Pho & Vietnamese springs rolls all for $12...you can't go wrong.", "author": "Gar Wing L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-18", "description": "GPS-ed my way here after a night out with some friends. I got the smaller pho combo with steak, brisket, tendon and tripe. The portion was pretty good, but my two male friends who (of course) ordered the large noticed that there wasn't too much additional food in their bowls. As another reviewer mentioned on here, a large pho means ridiculously large bowls but not larger portions.\n\nI liked the pho but I wasn't blown away. The meat was just all right, not too flavorful. The steak and tripe were kind of tough. The broth was well-seasoned and didn't taste like there was a lot of MSG (I couldn't tell if they used real beef stock or not). I was really impressed by the noodles - I'm so tired of mushy or grainy noodles, and thankfully these were bouncy/elastic. \n\nThe restaurant is small but has lots of tables and seats. Relatively clean (for Chinatown) and food came quickly. Oh, and it's really cheap! Huge plus. Will probably come again since it's so close to where my friends live.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "Found this place on a whim.  My friend and I were trying to get into The Great Eastern dim sum down the street, but the front desk guy was dicking us around so we left frustrated.  We had both spotted the pho place on our way into Chinatown so we both agreed let's get some freaking food into us.  This was especially perfect for Sunday afternoon hangover relief.\n\nI hung my head into my #7 large (rare beef and meatball) and dug in.  I always try the broth first to see if I need to add anything and was impressed.  No need to add anything.  But of course I'm in San Francisco Chinatown, so what should I expect?  The best meaty broth I've ever had, and I love me some pho.\n\nThe place became crowded and a bit loud after we got into this tiny space, but we didn't mind.  We had meaty soup in front of us.\n\nGreat find!", "author": "Meg B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-28", "description": "We went here for lunch today and ordered two large chicken noodle soups. However, while eating my husband noticed insect/fly inside the soup, so we let our server know. And this is what we got back - a wide wide smile from her! Forget about saying sorry, there's not even an expression of sorry on her face, infact she was giggling with her colleague on the billing counter! \nWe asked her to take off both the soups from the bill, and they agreed only after we told them a few times. \nHygiene is the most important thing when you go out to eat, everything else is secondary! ZERO STARS Golden Flower!", "author": "Parminder Nayyar C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-25", "description": "Coworkers and I hit up this spot when we're craving for some pho.  \n\nI usually order the rare steak and meatballs pho. (6 for Small, 7ish for Large)  The rare steak does come out still rare when served, which is always a good sign.  The meatballs is decent, but nothing to rave about.  The broth is pretty good.  Not too salty.  \n\nSprings rolls (6ish) are pretty good, peanut sauce is above average.  \n\nImperial rolls (6ish) are pretty fried...not sure when the last time they changed their oils.  They do serve their rolls with a side of noodles that you can eat it with, but wish they would give you more than one lettuce leaf so you can wrap it.  \n\nYou can get out of this joint (as most pho joints) for under $10.  Which is winning for SF.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-15", "description": "Good spot to duck into in the midst of all the hustle and bustle of Chinatown, especially in the evening after the new year parade. Got seats quick, got an order taken quick, got the food pretty quick, and got the check quick. \n\nWell, I got seafood soup. Wish I hadn't. The broth and noodles were really good, warm soup hit the spot since I was freezing, which almost makes me want to give them more stars. But, honestly, the seafood was gross, I've had better. Also, didn't like the fact that I was given a big bowl when I requested a small. Many others looked satisfied with their food though...my experience was meh.", "author": "Lily K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "Food = good. Decent portions (we had leftovers). Good flavors.  I tried their lemon grass chicken over vermicelli...yum.  My sister had their beef pho...yummy broth, a lot clearer than I'm used to, but good.   (Nothing happened to us, but we witnessed an unhappy client, with her soup...fly in it.  *shrugs*)  \n\nDecor = simple with bright fluorescents.  Nothing fancy but a decent quick lunch/dinner place.  \n\nPrices = cheap, under $10/pp (or under $7 if you know where to look.)\n\nParking = I have no idea.  We walked here after work in FiDi.  So yeah...g'luck.\n\nOh they lose a star, because they started mopping (with bleach) while there were still diners (being us) trying to eat their meals!!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-26", "description": "My husband and I had upset stomach and run to the bathroom several times after visiting this dirty restaurant. I dunno where to complain about their food safety and bad service.", "author": "Julie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-04", "description": "Golden Flowerr babyy!!! Theres a lot of vietnamese restaurants around my area, since living in the TL...and also being from a family from vietnam...I SERIOUSLYY would only head over to chinatown to get some PHO from this place, because its just seriously BOMB/DELICIOUS!!! MUST TRY!! I always get the #1 with EXTRA onions...and ladies/gentlemen, they sure remember me...haha! Also with the sweet welcome from the Owner, sigh always brighten up your dayy...\n\nI recommend their imperial rolls as well...delicious...", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-26", "description": "I appreciate \"real\" pho, but I don't crave it, ever.  \n\nNothing amazing, but nothing bad.  Just your standard pho shop with msg stock on the salty side.  The flavor is OK, but noticeably lacking; it's made up for by being salty.  It's run by Chinese people, so you should know what to expect.  If you're seeking some legit pho, hit up San Jose or La Petite Camille here in Millbrae.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "We ate here last week and it was awesome. You have to dig deep into Chinatown to get here and it's worth it. I got #36 (can't remember the name) but it was basically a huge bowl of awesome noodles and healthy stuff topped with shrimp and pork. My word - so good. Definitely give this place a try!", "author": "Evie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "Wonderful!! The plates were large enough to share, but too delicious and I didn't want to share! They had a large enough vegetarian menu with wonderful options. I wish we lived closer!", "author": "Stacy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "First time in china town! And this place was amazing- we had pho  that's soooo good. I believe the owner was serving us whom was super friendly and just gave us a homie / cozy feeling!!! Best pho ever!", "author": "Veronica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "food: Bo Tai Chanh Lemon Rare Beef!!! its oddly in the salad section of the menu. if you can stomach the idea of eating slices of raw beef, this is the dish to go for. it comes in slices topped with cilantro, peanuts, and some nuoc mam sauce. the meat is tender to the bite. it has a sweet and a hint of sourness to the crunch and the aromatics of the herbs used. not many places have this and if they do they cant replicate this simple dish. ***5/5\n\nservice: it can get crowded, but the place is so small enough that its easy to get somebodys attention. ***4/5\n\nambiance: not exactly the best. but the food makes up for it. ***3/5\n\nprice: the cost for the dish have gone up over the years, but still worth it. i used to live in sf but moved to seattle and i will try my best to come here just to eat this dish. ***4/5", "author": "Andy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "Very modest but INCREDIBLE vietnamese food made traditionally by an immigrant couple with nothing but  great inherited home made recipes.  Every plate we ordered was amazingly full of flavor... Thank you.", "author": "Roberto S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-09", "description": "PHO IS YUMMY.. babe got the small pho which seem like a LARGE SIZE. The broth is so full of flavor, the noodles are nicely cooked. Meat is not overcooked or undercooked. \n\nComplimentary tea.. \n\nEggrolls are the BOMB\n\n--- If your ever in chinatown - dont eat anywhere else.. we tried 2 places before we found this spot and its cheap!\n\nDid I mention they won best of the bay and TIM LINCECUM wrote an article about this place? \n\nDefinetly gotta go back here next time we hit up Chinatown", "author": "Cheryllyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-25", "description": "One of the most authentic, most down-home, and most perfect Viet restaurants I've ever been to, anywhere. The pho is of course a leading attraction but my favorite is easily the clay-pot catfish. The prices are very cheap, too, and their variety and quality can't be beat. It can get very crowded at lunch, so try to come later or earlier to beat the crowd. I've also always been very impressed with how fresh everything they use in their cooking appears to be, and how tasty, which I suppose goes to prove that con gà tt mã v lông, rng en v thuc, ru nng v men.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-02", "description": "I don't understand why so many tourists as well as San Francisco locals like to come to this restaurant. There are so many other Pho restaurants in the city...and just around the block even. The noodles have a bad aftertaste that makes you consider how long it's been out. The meats that are put into the noodles also have that \"stale\" aftertaste. Last but not least, the broth is terrible. I always consider the broth to be the one ingredient that puts the entire bowl together, but the broth here is sour. Basically, after taking your first bite, you wonder how long the entire dish have been pre-prepared for its customers.\n\nOther than the pho quality, the service was good. The waiters/waitresses are really friendly and the atmosphere of the restaurant is nice too.", "author": "Carrie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-10", "description": "Came here for lunch the five spice chicken was delicious it was meaty and wasnt too dry and it still retains all the flavor. Haven't tried their noodle soup but majority of the people ordering were noodle soup or either a rice plate. Not bad even though there's other vietnamese restaurants around the area too", "author": "Linh D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-05", "description": "Very disappointed! If you look for a good Vietnamese restaurant, don't go to this one! I don't know why they have those number of customers, I have been to many Vietnamese restaurant in the SF, this is the one I really want to give this negative feedback here, because they don't listen to the customer's order patiently, I called them to order a spicy beef pho, the person picked up the phone did not let me finish my talking then ended my call, then when I walked to pick up my order, they said non of them placed my order, and asked me to wait 10 mins to Wait, they were too busy to say anything, even I asked them make sure they were making the noodle for me, I asked\" r you making it for me?then the boss? Or just a cashier said very inpatient\"I don't make it for you, the people inside the kitchen make for u, just wait! \" she is rude!!!!! It was my lunch hour, I have no other choice then I waited at the end.  and their food is just so so, the noodle is just ok, and the soup is so so, and the meats is just too small, thin, and Smash, and cost $9.50. Without any meat I regular have, this is very suck. Won't go there anymore, and not recommend for you first come to SF, go other place!", "author": "Ciel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-15", "description": "I had a vegetarian plate that consistef of sauteed vegetables in curry sauce, fried rice and some tea. The curry sauce was excellent and I normally don't like it. I would come again. This was my first time here. Oh and the bathroom was very clean.", "author": "Victor J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "So far so good... A little duct tape on the menu didn't detour us from eating in this little gem of a place. The staff were so friendly. Filled with big, warm smiles and a \"sit anywhere you'd like!\" We ordered the Vegetarian Pho. It came with an abundance of vegetables (bok choy, broccoli, mushrooms and thinly sliced carrots) and of course the topping items. The basil, sprouts, jalapeño peppers and lime were perfectly fresh.\nThis clean, aromatic dish left was exactly what we were looking for. Truly satisfying! The best part... Two of us ate for $13.60! with tea!\n A new favorite place is beeing added to the list!", "author": "Miss M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "The food is just decent, but I go back over and over because of the friendly ladies who work here.  It's a good spot if you want to eat lunch out but need to be quick about it.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "Damn good Pho. \nSimple, tasty and cheap!!! Portions are big, the small is perfect for me and the spring rolls are yummy too.\n\nThe service was great and quick, too. And friendly!!!! Plus 1 star.\n\nI'll be back. and back. and back again.", "author": "Francesca F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-08", "description": "Lettuce in pho is deeply disturbing to me. While nothing else was particularly wrong about my bowl of pho ga, it was tough to get over the lettuce. My dining partner was mistakenly given a bowl of seafood pho and we had to haggle with the server before we could get what he actually ordered - pho with brisket. \r\n\r\nThe cha gio here is great - and it is with these wonderful imperial rolls that I really could have used the lettuce, rather than in my soup!\r\n\r\nIf you're planning to go \"golden\" in Chinatown make it Golden Star, not Golden Flower.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "Their foods are really Delicious. I fall in love hue spicy beef noodle, it's maybe one of the best in SF. Located in Chinatown and next to 2 awesome Chinese restaurant, Golden flower Vietnamese restaurant is not a wrong decision for people who love Vietnamese food", "author": "Dranai N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "golden flower makes pretty damn good pho. Good cuts of meat, tasty broth and my friend's banh mi was enormous. Now i need to check out Golden Star to compare the two.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-18", "description": "vietnamese joint in sf chinatown...chinese owned of course....compact and seatings close....wondering about the hype...enter to find out...from order a disappointing start.....tossing of sprouts, leaves, jalepenos 'n' limes....definitely worst looking plate of vegetable ever seen....black and spotted....\"diseased\" lookin'.....another tossing of oversized large (roughly $six) pho order....standard tastes of broth, bit darker in color than norm...decent tasting.....but, clumps of cold pre-boiled noodles tossed in broth...another minus to this patron....sloppy presentation thought....imperial rolls small and okay tasting....but, one lettuce leaf?@#!#?@!??....disappointing, but filling meal....\n\nspicy beef noodle soup seems to be the new favorite here...and, would recommend spicy beef noodle soup over the standard pho....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-14", "description": "This is my new favorite Vietnamese place in the city.  The prices are very fair and the food is very good.... the most amazing thing was that the service was pretty good... for China Town it was VERY good!  \n\nI had the grilled pork with rice and imperial rolls.  I loved the whole dish!  The only thing I would avoid here is the tea... It was a bit strong... almost as if it was fresh from another table... with more hot water added.", "author": "John F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "The secret to good pho is good broth.\nIt's really the heart of finding good pho in this town. And these guys definitely hit the nail on the head. The broth is rich, hot, filled with character. Some places in town serve watered-down nonsense. Others don't come hot enough. Golden Flower definitely sets a new standard in my pho quest.\nIf you've been looking for a steaming bowl of noodles to accompany you on those cold and rainy afternoons, Golden Flower is a hot pick.", "author": "Rhys A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-11", "description": "Golden Flower was probably one of the first Vietnamese restaurants I ever went to back in high school.  I found in again when I started working downtown and would venture through Chinatown during my lunch breaks.  I found myself here last night for dinner.\n\nI usually stick with the pho, and this time I went for #1, the \"special combo with rare slices of steak, well-done brisket, flank, tendon, and tripe\".  It's considered the X-Large bowl at $5.50 and there are beef balls in this order too.  My friend had the #3, which according to the menu, was the Large size and it costs the same.  The only difference was that he didn't have beef balls in his.  I don't usually go for the X-Large, usually content with the Regular size more often than not.  I was starving last night and it was damn cold.  Well, it looked like a large too me and I wasn't particularly full when I left.  I guess when the price doesn't reflect an X-Large, then you shouldn't really expect one then, huh?  \n\nOverall, it was pho as you would expect it.  Nothing spectacular about it or bad either.  They seem a bit cheap on the beansprouts though, and I would have preferred more.  And you have to ask for extra napkins at this Vietnamese restaurant because they only put one out for you.  (And if you like to add that hot sauce in there, you're going to be needing more with a runny nose like me!)\n\nSidenote: The restroom is hidden away in the back and down the stairs.  Cash only!", "author": "Teri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "Decent food at a reasonable price.\n\nEaten multiple times and the service is usually good, actually improved from when I first came here.  The food is not outstanding but for the price it is a good option for some Vietnamese in the Chinatown area.  The #1 is the house special pho and probably the best value.  Never had a bad meal here.", "author": "Jay A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "Had the #48. It was a chicken leg and imperial roll rice plate. Around $7.50 and came with enough food to fill me up after a day of walking. I was pretty exhausted after walking from 20th and Folsom and up to Chinatown, but this plate was just the perfect meal. The chicken was juicy and flavorful, yet the dish was light enough that I was able to continue walking without having to waddle. \n\nI'm not sure I'll ever return here as a destination, but if I'm in the area and craving Vietnamese I'll likely stop by.", "author": "Curtis B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-16", "description": "My waitress reminded me of the prostitute in Full Metal Jacket, 40+ years later and all. Me love you OLD time.\n\nNow for the review. Against my better judgement, I opted to have Vietnamese in Chinatown. It was a mistake. Had the pho tai. The noodles were lumpy and it was an effort to pull them apart. The broth wasn't hot and rather bland.  Stingy beef portions and no jalapeños? Really? Two Vietnamese girls who sat across from me felt the same way.  Awful.", "author": "John T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-09", "description": "I  desperately want to find a perfect Pho in SF.  I could find an OK pho in SF but not a great one.  I can make better Pho at home but I don't have 6 hours to cook beef bone (oxtail etc) and spices (Cloves Saigon cinnamon, star anise, cloves, and cardamom seeds).    \n\nPho at Golden Flower is an OK.  Their broth is tasty but aroma of star anise is too strong for my taste.   For the toppings, the rare stakes were not bad quality meat but were sliced too thick.   The brisket was tender and testy but had yellow fat (which I do not like) on the side.  The meat balls were smaller size (I like that) and well flavored but had chunks of tripe/tendon in it (I prefer smooth kind).\n\nOverall they are a tie with Pho Tan Hoa", "author": "Chie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-18", "description": "I Liked this place, didn't want to review it cause didn't want to share this place to anyone, haha\n\nHave to admit the food is not the most delicious kind of food.., the service is not the nicest, but they are very attentive and the food arrived real fast. They taste like regular pho...and I love pho, and here, the food is fresh and they serve quick!, and it's not pricy at all....\nI  think, this is not a place where you would drive all the way to eat, but if you happened to live near by or that you have/ need to have a regular visit to chinatown, this is definitely the place to have a quick lunch.", "author": "Kristin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-12", "description": "I was expecting this place to be really good because of the Yelp reviews and it's placed right in Chinatown!  But I was a bit disappointed.  I got the vermicelli with shrimp and grilled pork.  The sauce wasn't anything special.  The bowl could've used more mints.  The noodles were bigger than usual.  The shrimps had no flavor.  Overall, it just didn't taste fresh.\n\nThe food was alright though.  It just wasn't spectacular.  However, I will still eat there if I'm in the area.  Pretty cheap and there's a wide selection.  The staff is nice and I like the hot tea!", "author": "D N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-17", "description": "This place is phenomenal. I don't know why there are negative reviews! I'm korean and I've had a loooot of pho before and I've even travelled to Vietnam and had authentic pho there. This place's pho is BURSTING with flavor and is so filling! Even the smaller bowl. The pice point is perfect-suuuuper affordable. The Vietnamese coffee is also fresh and obviously just as delicious.", "author": "Sejin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-01", "description": "This place is okay nothing special about this place. First walking in there a heater next to the door. Really! What the point of putting the heater near the door? I guess the owner don't care about customer's safety. The lighting was crappy at best. Decided to get the Pho and the imperial roll. The sauce that come with the roll doesn't fresh look like it was from a previous customer. The taste of the roll was not fresh, it taste like it was heavy. The Pho was OK, the noodle come out in a big lump and it took five min in order to break the lump up. The person who took our order, I think he mixed our order up Overall:\n it was filling for the price.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-20", "description": "This WAS my favorite place to get pho for a long ass time(10+ years, i think). I didnt even mind coming all the way to chinatown for it. I remember taking the bus with my mom in middle school just to eat pho. I believe I had my first bowl of pho here. I would always compare other pho places to this one. \nBUT WHAT HAPPENED!?!? WHAT HAPPENED TO YOUR FLAVORFUL BROTH? WHY DID YOUR PORTIONS SHRINK? WHAT DID THOSE NEW OWNERS DO TO YOU? \n\nNow I have no reason to come to this area. :'(", "author": "Stacy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "Nothing's better than a hot bowl of VEGETABLE pho. Haha..Ok I know most of you are probably rolling your eyes. But if you are trying to have a light healthy lunch then order it this way:\n\nSmall/Med Veggie Pho : with regular tofu (not fried); and substitute the broth they use for the beef broth. It is absolutely my favorite! I normally don't like to eat a heavy lunch so this is a perfect lunch time meal!\n\nNow for all you meat lovers: My husband is the same way he laughs at me every time I request for all veggie. He'll have his usually pho with EVERYTHING oh and yes LARGE please. I swear he could live off this stuff and he says Golden Flower does it the best. The broth is so flavorful and always piping hot!\n\nTry it for yourself.....soooo good and soooo cheap lunch for the two of us $13 (thats with tip included!)", "author": "Michelle Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "Fav place to eat pho in San Francisco. \nThe apsmosphere is great, although I wouldn't recommend you sitting right next to the door or at least close the door, because the wind just hits you right in the face. Food's good, never had any problems with it. The Broth was heaven :3\nMy only complain is the place is kinda small fits only about 40ish people.\nAnd the restroom is placed in an awkward place. Seems like someone would kidnap you. But it's like that in most restaurant in Chinatown.\nI always eat with my friends here after volunteer for the street fairs in Chinatown. They give you discounts too.", "author": "Lilian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "Best Pho in SF that we have found so far.\n\nWe like our soup with not much MSG and a good clean taste.  Not sweet.  Not salty. This is the place to go.  I know all the talk about the other Golden place, but I just don't like the MSG there.\n\nGood chicken pho.  Good beef pho and great imperial rolls.  Nice tidy little place that's always packed at lunch time. \n\nWatch your step when you go to the underground bathroom.  One mis-step and you can kiss your as... good bye.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "This is my number one Pho restaurant when I come to China town.  I use to come here every Saturday for lunch before Chinese school and during my lunch break when I use to work at the Embarcadero center.  \n\nPHO & the FRIED EGGROLLS  is what keeps me coming back here.  The soup base is rich and tasty,. not watered down like most places.   Pricing is CHEAP CHEAP CHEAP and they get packed during peak hours (i.e LUNCH esp).  The traffic in the restaurant moves fast though.  I suggest arriving at 11:30 am so you can beat the crowd.\n\nI see Pho Restaurants as a Vietnamese fast food joint,..   People order, eat and leave.\n\nUtensils are kind of icky,. so make sure you wipe em down with napkins and hot teaaa!", "author": "Chanel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "There are many pho places in Chinatown, but none are as up to par as Golden Flower. I used to eat here many times, with friends and my girlfriend. In fact, it was this very restaurant that I took my girlfriend out on our first date! (I will bear no shame in this fact, as there's a funny story behind this..)\n\nTheir portions are generous and just right for a ravenous beast like me. There are multiple choices of meat, and each are cooked just right. The noodles are real pho noodles not some chow mein looking noodles at other Vietnamese restaurant in Chinatown. The staff is also very nice and tend to your every needs.\n\nThe most attractive thing about this place other than the food, would be the price. While other Vietnamese noodle shops around the area charge you close to $9 - $10, this place keeps your wallet happy by keeping it close to $7 - $8. Don't think because it's so cheap, that the quality goes down with it, it's not true! \n\nI loved coming to this place for pho and it ranks #2 on my top Vietnamese noodle shops in the city (the other being in Tenderloin). I would definitely return more often if my girlfriend had not offered me free pho at her place.. Haha. (Funny story behind this..)", "author": "Jacky P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-23", "description": "An average Pho place.  We usually get those shrimp+pork rolls, which tasted good, my friend goes with beef soup and I get BBQ chicken, but for a change experimented #43 (golden flower special seafood noodle).  Instead of seafood I requested them to add chicken and the veggies showed in the display pic.  It comes with crispy noodle and I should warn people who prefer to stay away from fried noodle, please stay way AWAY from their crispy noodle lol.  Also they have noodle section with chow fun entry, but they dont serve chow fun anymore.. The good part is that the portion of the food is pretty much decent for the price they offer.", "author": "Hema K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-08", "description": "This place gets really busy during around lunch time during the work week, so be prepared to wait some time or share tables. Everything arrives quickly and fresh from the kitchen, so even if you waited a good 5-7 minutes before you sit down, you'll definitely make it back to work in a timely fashion. \n\nI had a bad experience only once while dining here and it was a gross hair in my grilled five-spice chicken vermicelli noodle bowl (bun). However, they quickly took it away and replaced it with a new bowl. I admit, I was still grossed out. I go back to this place, though, because it's really cheap and you definitely leave satisfied. I don't order the five-spice chicken vermicelli noodle bowl though.", "author": "NickJess S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-26", "description": "Another \"Golden\" named Vietnamese restaurant in Chinatown I had lunch at. I still had my everything Pho. It was pretty solid. One thing I want to suggest is to have a bit better lighting. It's a bit dim. When it comes to pho, for some reasons I like to have it in bright light.\n\nOne thing I found about takeout and eat in at the 3 places is that the food tends to be more for takeout. But the experience to have it in a giant ceramic bowl with that scented steam broth going through the nose instead of the plastic tall container is simply unbeatable.\n\nI always love to have the pho at the restaurant but get the coffee in a to-go cup because there's no way you can wait for the coffee to drip completely and also drink until the ice is gone within 45 minutes. So it's best to take the coffee with you, to extend the consumption of some very strong chicory coffee.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "Best egg-cream soda in San Francisco! (#5 on the drink menu, misspelled Youk) You just have to put up with the owner yelling at you \"That drink is for pregnant ladies, ha ha ha! Makes skin very smooth!\" Whatever. I know an egg-cream when I see one and it makes me nostalgic for the Catskills. Shut up and let me enjoy.", "author": "Mulberry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-31", "description": "Initially I didn't want to come all the way to Chinatown just for pho, but the look in my brother's eyes when he said \"I'LL PAY FOR PARKING.\" sparked a curiosity that I just couldn't resist. Golden Flower is the bomb.com for pho in the city. I've passed by this place a thousand times and for some reason never thought of going in. From the outside (well, and inside) it looks like just any other hole in the wall restaurant in Chinatown. But what a diamond in the rough this place is. There is a reason why this place is always packed with people, the food is good. I LOVE the broth. It may be a tad salty for some people, but my Chinese taste buds were dancing with joy with the first spoonful. Not to mention, the prices are cheaps! Definitely a refreshing sight when most prices at other pho places have been going up. \n\nI think I just found my favorite pho spot in the city! Oh hay nao!", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-20", "description": "I've been to the other \"Golden\"s in Chinatown and this is the best one. The food is the best, portions generous and the service is fast and not creepy (we walked into Golden Star and had 4 Vietnamese women stare at us while we ate our food. I guess they were eager to clear the plates?)\n\nI've had the pho, imperial rolls, the Vietnamese rice wraps and a couple other noodle dishes. Oh, and Thai iced tea! All were quite yummy! Prices are pretty good too, I think a small pho (which is what I get) is $5.75 and a big one is a little over $6. I get the small one only because I love drinking ALL the broth! Thai Iced teas are $2.50? They go so well with the pho because I always end up adding a littttle too much sriracha.\n\nAnyways, service is fast too, you walk in and sit wherever you want, and somebody brings you hot tea. Pho always comes out quick cuz it doesn't need much cooking. Credit cards are accepted, which is AWESOME. And lastly, the owner lady at the counter is lovely.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "A Vietnamese Restaurant actually owned by Vietnamese people?  That's a rarity in Nor Cal (excluding San Jose).  \n\nAs I come from the Land of Westminster, I know my Vietnamese food and is a bit picky.  \n\nBut the pho here is good and passable, makes for a cheap and filling lunch!  It could use a bit more meat in the pho though.  My friend's Pork noodle bowl also looked good and he liked it as well.  \n\nThe food is 3.5 stars but I'll bump it up to 4 just because of the authenticity (I mean they have Bun Bo Hue, which is hard to find even at these so call \"Vietnamese\" restaurants)", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-23", "description": "I have been to this place dozens of times.  It's my favorite Pho in the neighborhood.  The broth is nicely beefy and well spiced and seasoned.  \n\nThe other Vietnamese dishes are solid.  But it's the Pho that stands out for me.  Although, I do have a soft spot in my heart for Imperial Roll Bun.  Hard to go wrong with hot tasty fried bits on top of cold noodles and crunchy veggies, with a deep salty sweet fish sauce.  \n\nNow that I don't work in the neighborhood, I miss this place terribly.  \n\nN.B. To prevent the rare sliced beef from overcooking, ask for it on the side.  Also save room for dessert, because the Golden Gate Bakery is just around the corner.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-10", "description": "Good ol' Ben Franklin once said (I am paraphrasing here); \"the only things certain in life are death and taxes.\"\n\nBut I think they should revise that saying; \"the only things certain in life are death, taxes and that the first item listed at any Vietnamese restaurant menu will be a XL bowl of beef pho.\" \n\nWhen you say the #1 at any pho restaurant they know exactly what you mean. It is something that is understood by all.\n\nThis is pretty true at all pho restaurants. There is nothing wrong with going to this classic dish (or maybe I should say bowl). No one faults you for picking a classic. It is comfort food through and through. But I am not here to comment on the pho or the spring rolls served at this restaurant.\n\nFor lunch I decided to forgo getting the #1 and instead settled on their Rare Beef Salad (the #30). And to my pleasant surprise this was absolutely delicious. They served thinly sliced pieces of beef dressed in lemon juice (with a side of fish sauce), fresh greens, and a heaping pile of roasted peanuts. It reminded me of a carpaccio dish, but a lot cheaper ($7) and without the snobbery. \n\nMy only knock on this dish is that it is kind of small. I am use to eating things from an XL bowl, so getting just a small plate full of food didn't seem to do it for me. \n\nIs the #30 my new #1?!  It just might be. \n\nDespite the high praise for the #30, this place still only gets 3 stars from me. If it looks like a pho restaurant, smells like a pho restaurant, and has sticky tables like a pho restaurant, it is still just your typical pho restaurant.", "author": "Allan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "Golden F., you're a star...four stars to be exact.\n\nDuring the nonstop, when-am-i-going-see-the sun again rainy wintery week, my tummy craved their imperial rolls over noodles and my mom craved their five spice chicken.\n\nSo during one of the stormiest nights, I ventured here for my folks and placed our order. The kind patroness bestowed a steamin' cup of tea while I patiently waited and dried out.  15 minutes later, our food was bagged and ready to go.  3 meals for about $20...still reasonable.\n\n15 minutes later at home, we tucked in; the imperial rolls over noodles and veggies were crispy and hit the spot, my dad inhaled his beef pho and my mom's eyes popped at seeing her beloved five spice chicken all dressed up just for her.  It was one of the quietest meals we had; we were too busy eating.\n\nGFVR, thanks for being a stellar and great cheap eats for us.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-13", "description": "There's nothing special about this Vietnamese restaurant. It's the regular hot bowl of Pho noodles kind-of-joint. The service is similar to any other Viet restaurant; they take order, present food and let you be. Some people like it, some don't.\n\nThe thing that bothers me is the kind of atmosphere and comfort while you are there. More than often, lunch time at this place can get pretty crowded. Who am i kidding?! The location in Chinatown offers tight walking space with elbow-to-elbow dining. Maybe it's just me, but we always get seated on the left side of the restaurant. \n\nIf you have a cold, don't come here! The place is only so big and once the door opens, you will know when it opens! Overall, food not bad. Just expect it to be small and crowded.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-10", "description": "Decent, not great.   Another words, it's good enough to satisfy my craving.  I'd rather eat McDonald's than have bad pho.    They do use a bit too much MSG but so do most Pho places.   Still haven't found a great Pho place in SF that compares to garden grove/Bolsa California.", "author": "Loc V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "Me and my best friends favorite gathering place. The food is good, the staff is excellent. We went there so much that the staff doesn't even need to take our orders, they just bring our order straight to us! They remember that I love to drink ice water so they bring that right away. If you are someone looking for a cheap and fulfilling vietnamese meal, this is definitely the place! Don't forget to try their thai ice tea! Theee Best!", "author": "Linda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "How happy was I to pick up a weekend gig in Chinatown? HEAVEN! With so much Asian food to choose from, I still gravitated towards Vietnamese...and mainly towards all things Pho. Kudos to ANY Vietnamese spot that'll let me pay for my bowl of heaven with cards. I just don't carry that much cash on me on a day-to-day...and those Pho cravings (although frequent) can come outta nowhere! I quickly became a frequent customer here for their location, for their credit-friendly option, and of course, for their food! Their broth could use a little more time with preparation (boiling bone marrow), but still well-flavored. I'm not too impressed with their imperial rolls, but I still consume every bite. Prices are reasonable, as with most Vietnamese restaurants. Overall, I am always satisfied with my meal.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-27", "description": "I used to like coming here, but my last experience has changed my mind. My bf and I ordered pho and hot and sour soup. My order of hot and sour soup came out with a long black hair in it. I immediately informed my waitress and she took it away. Due to my time constraints, I decided to change my order and get egg rolls instead. After we scarfed down the egg rolls, we realized that there was another hair on the bottom of the plate. I informed my waitress again and she didn't charge me for the egg rolls, but I will not be coming back! 2 hairs in 1 meal, not a way to do business especially in a city filled with great Vietnamese restaurants.", "author": "Naomi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-03", "description": "Any real fan of good tasting Vietnamese food will know that this place is not very authentic in taste at all! I ordered the seafood rice noodle soup and got what tasted like a pho beef noodle broth with some lettuce leafs floating around in it. Highly disappointed!", "author": "Nick D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "This was my go-to Pho place in Chinatown. Cheap, quick, tasty, and perfect for the cold and foggy SF day.", "author": "Ruth H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-28", "description": "Now that the Saigon restaurant is sadly out of business, I HAD to find a place to get my fix of grilled pork & imperial rolls over vermicelli.  Luckily, I didn't have to search high and low, but simply hiked a up the hill (Jackson) and found Golden Flower.\n\nIt is usually buzzing with activity during the lunch hour, but I've never had a problem getting a seat. \n\nThe pork is tender and tasty, and their imperial rolls while not as massive as Saigon's used to be, are right on!  I leave there plenty satisfied and have brought a couple friends here too, and they were happy campers too.  Mission accomplished!", "author": "Evelyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-22", "description": "Good food. If you're craving Vietnamese in CT, this is the place to go. Small little place, good food, that's all you need anyways.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "One of my favorite Vietnamese places to eat, especially when you find yourself stuck in Chinatown. Love their Pho and Vermicelli dishes. \n\nI'm not into their rice dishes since I'd rather have the Vermicelli instead. But not much difference in rice or noodle dishes. Very good grilled meats and their imperial rolls are great. \n\nLove the Iced Vietnamese coffee here. Made fresh and always have it ready for me to-go. Enjoy!", "author": "Nana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "Golden Flower - I love you for things other than your pho. Your pho is only mediocre and I do not ever eat my beloved pho there with Golden Star down the block. But that does not mean there is not good food to be had. I do enjoy your grilled pork and vermicelli dishes. When I am not in the mood for pho, you are my go to. Bun Thit Nuong Cha Goi is my go to there and that is why I give you 4 stars. Fresh veggies, and standard noodles, but great meat (though sometimes a little fatty) and good rolls (though not much differentiation there in regards to others in the area. \nI also like your service. Your old owner would always greet me with a warm smile, but alas she is back in Vietnam. Still, I like the feelign I get when I eat there, like its just another home.", "author": "Eddie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-03", "description": "Gotta try the rare beef, appetizer. It's kinda like Carpaccio but Vietnamese style. Rare beef topped with peanuts, cilantro, green onion, white onion and lemon juice. It comes with the fish sauce on the side. I rarely see this on the menu at the other pho restaurants. The sweetness of the beef and onion go so well together. \n\nA large pho here = large bowl not the portion of food. But... I'm a girl, so I think the small is just right for me. Overall, I think the appetizers here are awesome!", "author": "Christina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "Excellent food friendly service no ambiance. But I was was there for the food.  Menu was large. I believe the chef and workers were Chinese.", "author": "shelley s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-04", "description": "A favorite of my co-workers for good (great!) lunch pho. Also the spring rolls are phenom. Quick, easy, delicious and won't murder your available balance.", "author": "Helen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "Imperial rolls were the best I've ever had. Chewy and not greasy. The rare steak pho was also really good. \n\nan extra star for being the ONLY really tasty restaurant I've found in chinatown (i live nearby). ok, I also like LaLola. BUT, is there ANY good chinese food in chinatown?", "author": "Claire b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "Super fast, super fun, and super yum! There is nothing better than some amazing Pho to end a cold day in the city.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-10", "description": "The pho is only okay, not that great. The noodles are always kinda hard like it's undercooked or something.\nBut the rice plates are good. I like their chicken with egg plate.\nI use to go here all the time with my dad when I was a little kid.\nWhen I got to high school I started going to Golden King which is way better. This place has less choices than Golden King.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-27", "description": "The stories are true and there's no other cliche of a tale to share other than... \"I walked into this hole on the wall place and found the best food ever.\"\n\nAs my future wife and I were walking around on Chinatown's biggest day - Chinese New Year Parade, we found this place. All the other hotspots that were rated highly on yelp were closed for lunch and preparing for dinner, but not this place. \n\nI had a vermicelli dish with beef and imperial rolls. It was fantastic! Its a small business - much like the rest of the neighborhood. Service was quick. You also know the place is authentic, not only for it's neighborhood but the fact that some of the staff do not speak english.\n\nGet off this website right now and head over there with a friend. This food must be shared!", "author": "Noe F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-30", "description": "I decided to try this place out because of the high ratings on Yelp, because Yelpers generally don't steer me in the wrong direction.\n\nI shared the Imperial rolls with my BF, pretty good, but not fantastic.  He had the rare beef pho and I was looking so forward to it from all the glowing reviews; however, I was disappointed.  I expected it to be a mind-blowing, flavor party on my tongue, but alas... nothing.  No depth of flavor, no party on my tongue and the meat was kind of weird.  I totally wussed out and got a basic chicken with broccoli, so I am not judging my stars on my dish because it was my fault for being boring, but this dish was not good either.  The sauce had very little flavor and the chicken was tender, but had a lot of chewy parts, which left me not wanting to finish it. \n\nMaybe I will try it again.  I will say the service was pretty fast and it was definitely one of the cheaper meals I have had in the city.  Maybe it was just an off night?", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "I just got away from the warm and humid weather in Vietnam, a week before. Then found myself here for a hot bowl of pho on a chilly day in the city. I did come here to satisfy my pho bo vien (pho with beef balls/meatballs) since I didn't come across it on my trip. I must say that the pho in SF and Hanoi (Pho 10) are almost identical. Taste wise they are the same. The only difference is the portion and price. But I doubt you'll find be able to find a bowl of pho in SF for $1.75USD lol.", "author": "Jen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "i finally stopped in for the bun bo hue. a really unassuming pho place with construction blocking the front and obscuring it more--but the large red lettering by the front door touting bun bo hue caught my eye.\n\nit's pretty tasty, not the best by any means (where's the lemongrass?? cmon people, bun bo hue should be a punch in the stomach of flavor flavor and more flavor!!) but it's passable. the real winner is that it's a huge portion at only $7.75. i'll be back, may try the pho ($6.55) if i get bored of the bun.", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "Four stars because I absolutely loved the rare beef Pho I got here, but until I've had built more of a foundation for comparison, I don't feel right about giving the fifth star yet. (I am not a Pho snob.)\n\nRestaurant was small and clean, with a mom & pop feel. Price was very reasonable, and portions were generous. All ingredients (lime, basil leaves, sprouts, noodles, cilantro, and rare beef) were very fresh and crisp, and served in perfect proportions, contrary to what I've received in other soup containers where they really skimp on the good stuff.", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-25", "description": "I have a crazy Chinese coworker who makes me walk from Beale and Market to Telegraph Hill, up the Filbert Steps to Coit Tower, and then down to this place.\n\nIf the chicken noodle dish wasn't so good, I'd have killed him by now.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-05", "description": "This will be for sure my go to place for Pho in the city from now on!  Well if I am around Chinatown that is.  First the flavors - so good.  Fresh ingredients and the chicken pho that I had was delish!!  \n\nHad the egg rolls which were great as well - not too greasy and very well made veggie imperial rolls for sure! When I went it was a late lunch so it was nice and quiet and of course the service was quick and very friendly.  I will for sure be back to this place not only for all of these things I just mentioned but also because it was the cheapest meal I have had in months!!  Very reasonable indeed!  Check this place out for sure if you have the opportunity to venture into Chinatown and have the hankering for some yummy Pho!", "author": "Heidi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-20", "description": "Overall: B\nWhat's not to like about this place? Yummy and cheap. Nuff said\n\nFood: B\nTasty and filling. Actually, belt busting filling. If you're getting the pho skip the appetizers. Unfortunately, no alcohol. \n\nValue: A\nHuge portions with cheap prices.\n\nService: B\nWe ordered 2 bowls of  pho and it came out in about 5 minutes. \n\n\nDecor: C\nBare bones simple.", "author": "Roger H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "Extremely affordable, great pho restaurant. Friendly staff and good friend. Conveniently located near the Financial District, Chinatown and North Beach.", "author": "Julie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "I'd give them 5 stars if the meat wasn't tough or chewy. I am not sure how bun bo hue is SUPPOSED to taste like but I was craving for this dish for days and when I came here to eat it, it satisfied every single one of my taste buds. (Even my lips) It was spicy.. more spicy than I thought but it was gooooooood. I LOVED the broth but couldn't drink most of it since it would take up space in my stomach. I had to save the room for the noodles. Something about the soup and the noodles that were my favorite part of the whole dish. Okay, I lied, I love the veggies more but thats because I love my veggies. YOU MUST TRY THIS PLACE!!!. Photo posted. My bestie had the pho dac biet and she had her pho craving satisfied too :D", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "Everything was very good, including the service and attentiveness of the waitstaff.  I had the Stir-fried beef on one visit.  It was that good, I had to return the following day and had the Sizzling chicken with vegetables.  I found that the one thing that was most awesome were sauteed chicken rolls wrapped in rice paper, probably one of the most popular items on the menu.  The menu has not changed over the past few years but what can I say?  The food is very inexpensive, a small \"hole-in-the-wall\" establishment in Chinatown, but if your looking for a 5-Star dining experience with exceptional service, hostess, a reservation, linen tablecloths/napkins, this is most definitely not the place for you...", "author": "Isaac G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "Fresh rolls, ok. Spicy pork with lemongrass, delicious but not spicy enough.", "author": "Johann R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "My family and I wandered into the restaurant, cold and hungry. The chicken noodle soup that I ordered was delicious. The soup was hot and savory. My sister got some seafood soup with egg noodles, and my dad got some noodles with beef soup. Surprisingly, unlike other Vietnamese Pho restaurants that I had went to, all the soups had their own distinct, tasty flavor. They had good sized portions, and the food came out in no less than ten minutes. The restaurant size was small, but cozy.\nThe only thing that downgrades this review to four stars, is it's lack of hygiene. To go to the bathroom, I found that I had to go down some steep stairs into a basement, which smelled pretty nasty. It was wet and slippery down there, but fortunately, the bathroom wasn't too dirty.", "author": "Breanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "So far, in my hunt for the best bowl of Pho in SF, this place is my favorite. It's authentic, the broth is done right with balance and warmth, the ingredients are fresh, they give you LIMES instead of lemon (yuck) and they'll even bring you a beautifully full ramekin of freshly chopped cilantro if you ask nicely. The service is incredibly friendly, prompt, and wonderful and as an extra tip: get the pork and shrimp rolls with peanut sauce. The PERFECT starter to accompany this amazing Pho.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Holy Pho, Batman! This place is great.  Ran into it by accident and it was amazing. Great prices, service, and amazing food.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-10", "description": "This place is a hit or miss. A friend and I came here earlier today and both ordered the #1.  The waiter decides to ask us what size do we want, we're thinking in our heads, \"Do you not know your own menu...? #1 is an extra-large.\" Apparently, he doesn't know that. When we got our food, I noticed the broth was nasty. No flavor at all, probably Loi's is even better.  While paying, the bill was 14.40 and we dropped $16 on it. When the lady gave us back our change, we only got .60 back. Where did that dollar go?? I mean, we dropped $16 for a reason, an extra $1.60 for tip. But don't try to play us and \"assume\" we paid $15. Probably next time when I come back, since I have a coupon, they'll give me better customer service.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "This place is right in the heart of Chinatown, where all the Asian cuisine you can pick with all your fingers are there awaiting and I must admit, a warm bowl of pho is tempting as any on a chilly San Francisco evening. Then why the one star less? One less shining star makes all the difference between a tasty bowl of pho and a delicious bowl of pho.. I had my very first bowl of pho here when I was a child and the first owner was an amazingly genuinely kind and welcoming woman who must've boiled her water with love and secrets. I'm a fan of this place, but since my last bowl of pho, maybe more in memory but I love pho nonetheless.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "Found this place as my friend and I were looking for some lunch in Chinatown on the weekend. Seemed pretty decent from the outside and the menu looked good. We both ordered the combination pho, but asked for it without tripe and tendon. Only $5.75 for a small, and it was pretty filling. Tasty pho! Service was pretty quick too! Wish they served cilantro with the bean sprouts though!", "author": "Katrina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-28", "description": "Ordered the pho with beef flank and brisket. The noodles were just ok. Broth was good. Flank was dry. Brisket was tasty. \n\nAlso, had the spring rolls with shrimp and pork. These were dry, too. Not good.", "author": "Linda Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "I loved -- nay, lurved -- this place. I can only really compare it to Golden Star in terms of pho restaurants in the Chinatown area, but it fared really well in comparison. The food itself wasn't necessarily better, since both pho's were excellent, but we did have some additional spring rolls (#25) here which were perfect (they're hard to screw up, I guess)... and the sizes of pho #5 and pho #6 were ideal (they have some \"extra large\" and \"large\" options that I would steer clear from unless, of course, you're really into leftovers, which is a perfectly honorable desire too). \n\nMost importantly, however, the venue and the service were both significantly more inviting, which made all the difference. The decor is colorful and vibrant here, and the atmosphere was generally a lot more pleasant and warm so, compared to the curtness of the servers, the bareness of the locale, the plastic tables, and the fluorescent lighting of Golden Star, this was most definitely an upgrade... As were the servers, actually, which -- contrary to what many other reviewers experienced -- were polite, down-to-earth, and even, at times, genuinely kind. \n\nThough I'm sure there is equally good (or better) pho out there, perhaps even in the vicinity, I had such an overall fulfilling experience here that it's certainly my new favorite and I plan on going back again and again to rejoice in their pho-ness.", "author": "G. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-16", "description": "MMMM one of my favorite places for some nice pippin' hot bowls of PHO! \n\nLooks can be deceiving when walking in china town and you look down Jackson and see this blue overhang covered in graffiti and all you can read is PHO. But dont judge a book by it's cover my friends. \n\nI can never finish a \"small\" sized bowl.. but I always have left overs! I always get the very basic #5 - your typical beef pho. I like to mix it up once and a while with the curry or beef balls but usually I just go for the plain. What I love most is for $5.85 I can get a huge \"small\" bowl of delicious-ness, complimentary tea ... as much as I want, and for $2 more I can get imperial rolls. Definite good deal for a girl on a budget! \n\nThe bathroom is an adventure in itself- you have to walk downstairs and pass by the old vietnamese ladies cooking, then theres a small area next to the bathroom with a table and a ton of boxes. I always see these men playing cards and like to think they're part of some mafia buisness...\n\nBACK to the Pho.. delicious! And the service is always nice, and fast! Some places in san jose make me feel inferior because I'm this silly south american  girl coming into their restaurant and takes forever to get my food...not here!\n\nCheck this place out. Fo realz.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-20", "description": "People in Nor Cal don't know crap about Pho. The broth has horrible and the noodle was not cooked properly. The only plus is you get a lot of food. Service was good maybe because i was the only one there during 11 am. Just like you go to So Cal for great Mexican food, you go to Orange County for the best Pho.", "author": "Paul N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "Although I began my pho adventures with Golden Star/King a long time ago, now I like Golden Flower more. I think the prices between the two restaurants are similar, but Golden Flower is a bit cheaper. I also think Golden Flower has more authentic flavor than G.Star. but G.Flower is considerably smaller than G.Star, so if you have a big group, G.Flower is probably not your place to go for pho. \n\nI would definitely come back!", "author": "Sam W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-27", "description": "Horrible services and they charge a lot for the amount of food you receive.  Me and my mum decided to just order #1 and just share the order between two of us because we weren't really hungry.  Right after we said we will share, the waitress told me in Mandarin \"oh, you can't sit at this 4 people table, because you only ordered 1 item for both of you.\"  Wow, you are putting a price take on us by how much we order and does each table has it's own value depends on how much you willing to pay?  We felt really unwelcome and discriminated.   And If It is one of the rules at your restaurant, why you talked to me in Mandarin???????  We were very disgusted by that Short Hair and Mid-Aged Waitress.", "author": "Jade P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-10", "description": "Every time I take a class near this place, I always have to come here for lunch. This is my favorite pho place in the city. The broth is just so amazing. When I eat pho, I usually have to douse my soup with Sriracha and hoisin sauce, but here, I actually like to savor the taste of the broth. I don't know what they do differently from other pho places, but it's what makes me come here all the time. \n\nOther delicious things here are the imperial rolls. Mmm. And the fresh lemonade.", "author": "Paweena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "I came to this place 3 years ago ... and it was the first time ever that I remember trying pho for the first time! I always remember this place fulled with non vietnamese people, filled with decorations, super small and compacted. But extremely c", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-11", "description": "If you are in the Entertainment Book honor the damn coupon.\nDo not come back and say \"management changed\"\n\nMarcus Angry!", "author": "Marcus R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-21", "description": "Good food but poor service. I walked in and they ask me to sit any table and ask me what Im having before handing me a menu! So I ask for one and a woman finally came and slam it on the table. We had a party of 4 so our food took 20 min to come but the order was all mixed up. My friend ask to eggs and didn't get one. I ask for no onions but it was all over my soup???", "author": "Yvonnr L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-27", "description": "Having read the other reviews, I was pretty stoked about coming here...too bad I left with feelings of dread, anticipating intestinal disturbance in a few hours. Maybe I would feel differently if I hadn't asked the ill fated question, \"do you have a restroom here?\"  I asked against my better judgment, hoping the cramped quarters somehow concealed a clean, usable bathroom. When I walked through the kitchen, down the narrow staircase to find the bathroom, my nightmare took root. The bathroom would make a gas station look like the Four Seasons. Luckily I touched no surfaces. When the food came, I was pleasantly surprised-- it looked good, but after having seen the kitchen I was only willing to eat the BBQ beef in my bowl of bun. Beef was tasty but I couldn't get the condition of the bathroom and kitchen out of my head. I won't be going back.", "author": "Rosanne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "This hole-in-the-wall Vietnamese place lacks ambiance, but turns out some great pho. They have several different varieties; I tried the rare beef version which was really good. The broth was full of flavor and the accompaniments of bean sprouts, lime and jalapeno help enhance the already good flavor. \n\nThe treat for me was the Vietnamese coffee which is served at the table in the traditional drip filter. It packed a good punch and kept me going all night!\n\nIt's VERY inexpensive too. Two of us had full dinners and drinks all for $16.", "author": "Lee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-01", "description": "I'll reserve the last star for after I check it out a few more times.  This was another hole in the wall that my boss pointed me to - and he knows his financial district restaurants.  He says it is the best of the \"golden\" Vietnamese restaurants, and though I haven't been to any of the others yet, this one was good.  Very crowded and people sit together at long tables.  I got a spicy squid dish which was good, and I think next time I will try the vegetarian \"bun,\" which is like a salad with noodles mixed up with whatever meat (or non-meat) you order.  Maybe like Vietnamese bi bim bap?\n\nupdate 8/3/07:  tried curried squid (good!) and vegetarian hot and sour soup (really big bowl, enough for 2 people, good, and very different than chinese hot and sour - reminds me of the way jigae is served in Korea).  also had veggie spring rolls (ehh, okay, too big to get in your mouth).  Still have to withhold 5th star - service is spotty.  I understand that this isn't Farallon, but I just about had to tackle somebody to get my check.  there was a line out the door, and you would think that they would want to open up our table, but they seemed too preoccupied to get us on our merry way.  for those that are time sensitive at lunch, i recommend getting there as early as possible, otherwise it is swamped.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-04", "description": "Service: 3.5/5\nFood: 4/5\nWait: 3/5\nPrice: $\nPresentation of food: 4/5\nPresentation of restaurant: 3/5\nOverall: 4/5\n\nTHEIR IMPERIAL ROLLS ARE PRETTY CRACKINNN (:", "author": "Eva H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-27", "description": "Phoget about Golden Star (they changed management couple months ago); Golden Flower is the place to go. It's a cozy, hole-in-the-wall joint with a steady flowing lunch crowd.\n\nThe food here is one of the better Vietnamese places in the city.  Less than $5 for a small bowl of pho; the broth is perfect.  Less than $6 for imperial rolls on a bed of vermicelli noodles, carrots, and bean sprouts.", "author": "I Love Beef C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "I remember coming home after my first pho here and calling up my best friend to say that I have found the one.  This is the one.  The slippery and chewy bites of vermicelli noodles, the salty and flavorful broth, the perfect proportion of meat to noodles ratio, this place is pho sho' the best pho I've ever had.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "I came here with my cousin when I went to get my haircut. The place is small and the portions are big. Service is nice, and keep in mind that it would be best to grab one of the big tables instead of the single 2 seat tables. Your not going to have a lot of room to eat on those small tables.\n\nCousin had pho with rare beef or something\nI had the grilled pork with rice\nand we split a order of imperial rolls\n\nwe shouldnt have ordered the rolls, cause we were way too full when we finished everything. Another place to get a bang for your buck.", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "My co-worker wasn't kidding when she said it's better to go after 1.30p to beat the lunch rush.  \n\nChancing it, we arrived just after 1p and all the tables were occupied...,the staff squeezed our party of 5 around a table where 2 were chowing down.  Our hungry tummies were grateful.\n\nI really enjoyed the food and service.  The noodles were loose (not clumpy) + cut bit-size...spared me awkwardness in front of the director.  \n\nThis place is worth the wait.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-16", "description": "Worst place ever. Horrible service never coming back again. To the short haired lady wearing pink floral shirt today you are the rudest waitress i ever met. Telling us to move when we are in the middle of eating...hell no gtfo can't we eat in peace just cause theres a bigger party coming in doesn't mean you shove us to the corner. And i wasnt even done looking at the menu so why would you take my menu without asking. We didnt do anything and you dont even give us the stuff for the pho wtf...", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "Delicious Vietnamese comfort food.  Try the tofu with lemongrass.  Have the kitchen add broccoli for a fulfilling and healthy meal!", "author": "Veena D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "My sister and I went here while in Chinatown. Pho was great on a chilly day. We had pho dac biet and pho tai. Both were yummy! The broth was great all on its own, combined with additional seasonings and it was over the moon excellent. And the owner and staff were soooo nice. The oolong tea was also a great beverage that complimented our pho. Soooo glad. And happy to know you can get good pho in Chinatown!", "author": "My T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-05", "description": "The service was dismal during our visit. Dropping off everyone else's orders at our table except for ours, taking down the order wrong, even though it's been repeated 2-3 times, unusually slow service for simple dishes, giving me the wrong entree due to taking down the wrong order, making me wait for the right order and then charging me for the wrong entree that's more expensive than the right order, and forgetting our request for water, even though we asked twice.\n\nThe food was tasty. But then it gave me what felt like dysentery. I'm still willing to give this place another shot. I'm such a masochist.", "author": "Trixie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-19", "description": "Pho taste like mom's home cooking!", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "Yum! Golden Flower and Golden King are both reliable. Golden Flower's pho broth is a bit more oniony (rather than Golden King's, which tends to be on the saltier side). But, G-Flower is always busy with loyal clientele, service is friendly, and takeout orders are fast. A very safe choice.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-02", "description": "Two empty tables and wouldn't serve me because I was by myself. I do not condone poor customer service so I will not return to this restaurant.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "Let me just say that the pho here is really good.  I alternate between the chicken pho and the beef pho quite often.  It's yummy yummy in my tummy.\n\nI went here for lunch today, and am kicking myself for not just sticking with the damn pho.  I thought I'd try something new.  \n\nI ordered their version of \"shrimp chow fun\" (that's basically shrimp with fat rice noodles, for the 2 people out there who don't know).\n\nWhat I got were pho noodles (which are skinny) on a plate with some funky chow-fun-esque sauce and vegetables.  The veggies were good, but the noodles were gross and now I feel kinda sick. \n\nI will totally go back to them for their pho (quite possibly later this week), but will  never order something other than pho from them again.", "author": "Karen F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-15", "description": "The pho here use to be really good- in fact, this was one of my favorite places of all time when I was a teenager, but things are different now. i'm sure it has something to do with me experiencing more of what other pho places taste like but I wasnt really impressed when i came here for lunch this afternoon. \n\nI ordered a #1 with beef on the side- the bowl was massive and came with a lot of noodles, although the noodles could have been a tad bit softer. The beef on the side was decent, but the pieces were sliced way too thick. The broth was alright, they kind of overdid it on the ingredients- from my opinion at least.\n\nI use to go out of my way to come here, but after my experience today, I'll have second thoughts.", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "Whenever I'm back in SF from college, this is the first place I go to for satisfying my pho cravings.\n\nThere has never been a place I've been to that's served pho that stimulates my taste buds like this restaurant. (Maybe it's MSG? Nonetheless, still amazing) I've never tried their other dishes, unfortunately, because I just want my pho fix! I always get the pho in the red broth or Number 1, both very tastey and savory soups, you'll want to drink all the broth. Sometimes the meat can be on the fatty side. Service is uber expedient, they know how to bust out the soups; you won't be waiting half an hour for your meal or the check. The bathrooms are a bit worn, but they're better than public restrooms. GREAT prices, you can't beat it!", "author": "Selina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "You may be asking yourself, is this place pho real? The answer is yes....stop in around noon on a weekday and you'll be greeted with a packed dining room. The community table option means you won't have to wait more than 15 minutes, even at peak lunch hour. There's nothing cozy about this place, except for the feeling a big bowl of pho leaves you with. The chicken pho comes with a rich and satisfying broth, the accompanying limes, mint, and jalapeños are always super fresh, and the chicken meat is surprisingly tender and completely skin- and cartilage-free. The vegetable pho is slightly lacking in flavor, but makes up for it with loads of fresh vegetables. The imperial rolls are so-so. The waiters are brisk, but pleasant enough. At $7.50 for a teeming bowl of hearty pho, this place can't be beat. They also offer generously portioned pho take-out. I also find it convenient that you can walk in at the odd hours of 10am or 3:45pm, for example, and order take out or eat in.", "author": "Emma R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-13", "description": "Let me provide context here:  every city that I go to, I look for Vietnamese food.  Whether it be San Francisco, Miami, New York or Sydney; I love the stuff.  I have beef broth in my veins.\n\nIn SF alone, I've braved the holes on Clement St., the delicacies on Irving St., downtown, Saigon City in San Mateo.  You name it, I've tried it.\n\nFor the record, this place has the BEST PHO I've had.  \n\nWhat makes a good pho you ask?  Two very simple things:\n\n1.  The flavor of the soup stock.\n\nIf the soup stock is not BEEF based, walk away my friend (have you ever had pho where the stock is chicken based?  Those places should be ashamed of themselves).\n\nIf the soup stock is not at least slight murky, leave immediately.  This is one of the few places that I will actually drink the stock until my bowl is empty.\n\n2.  The heat of the soup stock.\n\nWhen you order pho with rare slices of beef, you should be able to submerge the slices for one minute and have them cook in the stock.\n\nThe service is that of an Asian restaurant.  You will get your food when you do and you will like it.\n\nThe other food beside the pho?  How the hell would I know?  Just get the pho, smart ass.\n\nWeekdays for lunch gets very crowded.  Expect to wait if you show up after 12 noon.  I've never had any issues waiting during dinner time or on weekends.", "author": "Deron D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-01", "description": "Great place to grab some classic pho' noodle soup. Not to far away from the Financial District.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-22", "description": "Obey the heed of no one who suggests Golden Star, aka Thumb Soup (you figure it out). Golden Flower is a pho (that's pronounced fuuuuuuh, with a bit of a tonal upturn at the end) delight. I'd format my Vietnamese, but this isn't MySpace.\n\nCharming staff, and you can go to the Matsu temple in the alley across the street while you wait. \n\nIf you don't know who Matsu is, don't worry; she knows you. Wear a life preserver. \n\nAnybody who goes to Golden Star is just kidding themselves.", "author": "Sean K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-27", "description": "I use to love this place when I was a kid, but this place has really gone down in the dumps recently.  The last time I came here, I remember their beef tasting really weird...almost old.  It did not taste fresh atttt all.  Their soup wasn't as rich tasting as I remembered.  \n\nI'm sad to say that I no longer visit this establishment.  I'd rather go to golden star.", "author": "LiveToEat F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "Used to come here alot when my wife worked in the area.  Afterwork, I'd pick her up and we'd come here for a quick dinner.  Portions are good, prices are good, food is good.  Fast Service.  It'd usually be dead right at 5pm but that's actually good cause no waiting.  \n\nNothing to complain about.  We'd be in and out quickly and would have plenty to time to relax once we get home...", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-19", "description": "A few nights ago, my husband and I were heading home, cranky, tired and hungry.  In an attempt to save money and eat at home more, we were driving home through Chinatown when \"Golden Flower Pho!\" popped into both our heads.  It was 9:10pm and we didn't know if they closed at 9:30pm so we drove quickly and found rockstar parking half a block down the street.  There were still customers inside but when we got to the door, the sign read \"9:00am - 9:00pm\".  We stepped in anyway and the proprieter lady waved us to a table (YAY!)  We'd been here once before and eaten something other than the pho so this time we went straight for the pho:  #7: rare steak and beef balls LARGE for me and Pho Ga - chicken pho for him, also LARGE.\n\nTea was served immediately and about 5 minutes later, 2 giant, steaming, bowls of pho were placed in front of us.  \n\nI don't know how they do it, the beef pho had abotu 6 good-looking pieces of steak, pink in the middle and lots of large beef balls.  The soup was so comforting and really hit the spot.  Of course, I topped it with beansprouts, lemon and peppers and sprinked the Siracha over the soup.\n\nI hate it when meat has dangly bits of fat and tendons and other oddities on it but the meat in both our bowls was nice and clean.  There was a generous amount of shredded chicken in the Pho Ga and some lettuce which would have been really good if there wasn't some brown bits on the edge - we picked that out.\n\nSoon the restaurant started to clear out, the proprieter making conversation with the last trickle of customers.  As they cleaned up, we hurried to finish our piping hot soup - but she called out to us to take our time and even topped up our water glasses (all past closing time!!)\n\nI love this place for having delicious, comforting broth: slightly sweet and really tasty and for being near to home.  I also like that they keep it relatively clean (sweeping the floor and wiping the chili bottles at the end of the day) and there is obviously lots of heart put into the restaurant.\n\nI would come here 3 times a week - if I got home in time. :)  at a previous visit, my husband got the 5 spice chicken which came with a bowl of soup noodles.  The bbq chicken was served on the side and was a fine piece of thigh meat: a never ending supply of relatively lean and clean chicken served on a lettuce leaf.  I got the bbq beef and imperial roll rice noodle which was perfect for a warm afternoon.  very refreshing!  aaah, this place is so good.  and cheap too.  $6.55 or $7.55 for large pho I think -", "author": "Mel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "Best Pho place on my street (... possibly the only). Perfect for that rainy-day-don't-want-to-go-too-far-but-still-want-warm-soup kind of mood. They've got some interesting drinks (well, if you haven't grown up in a Chinese household) -- I'd recommend trying the lychee drink", "author": "Adam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "Mmm yum! Rare beef pho & imperial role! Only turn off, feathers underneath my chair...why are there pigeon feathers inside?", "author": "Sarah Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "Somewhat dirty, but the food is solid.  We keep coming back when we're in the Chinatown area. \n\nI've had the nem nuong rolls (the do-it-yourself ones), banh hoi, and pho so far. \n\nYum.", "author": "Dorothy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "Don't go here.\n\nIt's my secret place to eat delicious Pho and Bun.\n\nBut if you do go, tip. They're a nice family.", "author": "Eric .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-06", "description": "Went to golden flower for lunch because new saigon was closed.  Why is this place always closed =(\n\nOrdered Chicken noodle soup from golden flower. The chicken was dry and flavorless. It was also chewy.  Worst chicken noddle soup I have ever had.  The soup was just brown and salty.", "author": "Ames K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "This place is awesome! Cheap, good, Pho. \nThe staff is really nice and the food comes out fast. It's that perfect combo of dirty and clean. Clean pho just doesn't taste right and dirty pho is gross. \nThis place gets it right.", "author": "Murat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "Imperial rolls are ehhh.. okay.\n\nThe LARGE Tai was a bit difficult to finish, because it was HUGE! The noodles were very delicious at first (chewy even), but not after they sat in the boiling water for too long. Yes, today's soup was definitely hot enough to cook my steak on the side. Vegetables still at high quality.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-11", "description": "I have yet to find some better pho than what my friends Vietmanese mother makes, but this has to be a very close to it.  I am going to have to make this a regular stop now when I come back to SF.  \n\nI had the pho and the imperial rolls.  The imperial rolls were good, but nothing compared to how good the pho actually was!  Who cares about how the place looks, its all about the food here, and they do a great job with it.\n\nI was the only non-asian in the restaurant, but everyone was very helpful and very nice there.", "author": "Scott J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-22", "description": "Golden Flower offers Quality Pho At Late Hours (QPALH). And any restaurant that scores high on the QPALH scale gets an automatic 5 stars.\n\nI'm also giving 5 stars here because the good folks at Golden Flower know that if you're a Vietnamese restaurant, by gawd, get your pho right. And they do. I had the reliable #1 and it was huge. The price tag of $5.50 made me feel like a bandit. My wife had a simpler version of tripe with beef balls. And it was arranged more elegantly than any other bowl of pho we have ever seen. And, lemme tell ya, we've SEEN pho.\n\nAnd, in the tradition of all great Vietnamese restaurants--these guys take cash only.", "author": "Pete L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-04", "description": "MMMMMM ... #40. \n\nGrilled chicken thinly sliced ( like I like it) , noodles, fish sauce, imperial rolls.   \n\nMMMM... #40.", "author": "Swiyyah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "if you're craving a bowl of pho and you work in or around the financial district, golden flower is the place to go. i always order the combo pho (#1 on the menu) and find that their broth is more flavorful and robust than the other 3-4 joints that i've tried in the area. more importantly, i'm not left with that parched, emessgeeingly gacky aftertaste. one minor gripe - they are skimpy with the jalapenos...2-3 slices; they do give you more when asked, but it's such an annoyance. hey, i'm the guy who always asks for more jalapenos, recognize!\n\ni've also had the bun bo hue, which is very hearty but not in a barnyard kinda way.\n\nwith the exception of one young lad, the staff is borderline curt, but efficient. the dining room is kept pretty clean and seemingly hygenic.", "author": "Rob D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-04", "description": "I used to come to this place all the time when i was a kid! prolly like 10-15 years ago.. and the other day i decided to eat here with my mom instead of Golden Star a block away.. (she pissed off one of the workers there so i'm afraid to show up there with her again.. haha) \n\nwe waited over 25 minutes!! for VIETNAMESE FOOD!! which takes like what.. 10 minutes?!?! Come on.. all the other tables (who came in after us) got their food already.  I complained to the worker and then they finally brought it out.. they were saying how it takes a while to make it.. but my mom got the #1.. which is pho.. how does that take 25 minutes?! She could have just apologized and not make up some BS lie..", "author": "JUDY L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "Probably favorite place for a \"#1\". Soup is good, noodles are chewy, and good portion of beef. Friendly, quick service.", "author": "Eddy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-16", "description": "A very cheap and good Vietnamese restaurant. I took number 40 with chicken and the dish was good and generous.\n\nThe place is not fancy but who care? We were sited directly and just waited 10 minutes for our plates.", "author": "Cedric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-02", "description": "A step below nearby Golden Star, but still very good.  I got a vermicelli bowl with pork and shrimp and loved it, minus the basil that was in there I didn't care for, but luckily, they put it all in a clump for you to mix so I was able to avoid most of it.  Their fish sauce was nice; not too fishy.  Never brought me water like I asked, but didn't mind too much since the food was good.  Spent $8 total.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-14", "description": "Excellent pho, also recommend the #39 vermicelli with chicken.  Sometimes a restaurant really couldn't make any improvements without becoming more expensive, and I think this place falls into that category.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-15", "description": "gross...\nshould've known when we entered and there were no other customers.\nwe did get there at around 10am.  a young waitress with an accent greeted and seated us.  she said they'd just opened.\nok.  i have never been to a vietnamese restaurant with disgusting food.  so we stayed.  ordered vermicelli with grilled chicken and imperial rolls.\nit was really salty and gross.  the bean sprouts were old and the dish contained a lot of cheap, shredded lettuce.  The chicken was pre grilled.  Um....they microwaved the meat and dumped it onto the bowls of noodles.  At least if they were going to microwave the meat, actually heat it up.  The meat was still cold.  The waitress ignored us and never refilled the teapot.  We couldn't even get her to come with the bill and the restaurant is tiny.  There was a middle-aged gentleman who worked there.  He seemed friendly and got us our bill.", "author": "Candy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "I love this place. Wholesome real authentic food, attentive staff and great service, reasonably priced. Handsdown the best hot and sour soup I have ever had. If you are in the area and feel a cold coming on, their hot and sour soup is a must. When they bring it to you, you might not think it is hot and sour soup because it has a clear broth, unlike most others, but it is in fact hot and sour soup.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-10", "description": "Whenever I think of my happy spot it takes me back to the Golder Flower, wiping my nose---runny from the spicy steam of a perfect bowl of pho---on the sleeve of my sweatshirt, wondering if a person could survive so much happiness.", "author": "C.S. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-29", "description": "I liked this place.  It was cheap, open late, right in the heart of Chinatown.  The Pho Tai (rare beef) broth was really, very tasty.  But sadly, the meat was not the best ever.  Kind of fatty and tough.  It wouldn't matter so much if I was hard core like Richard K and ate the tripe and tendon pho.  But I'm not there yet, so it's important that my beef slices are good quality, since that's the main attraction.  But on a more positive note, I think Richard was really happy with his Pho-for-the-Brave, and the spring rolls were delicious and very fresh.  Much bigger than the average spring roll, too.  Love that.  \r\n\r\nBTW, it's pronounced FUH.", "author": "Kerrinski S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-02", "description": "***Edited 3/4/2008***\nWaaaaahhh. Ok. I am taking off a few stars. What happened top their pho??? It has no flavor!  What the buck, do? (Vietslang accent)\n\nStill good for bun, but the pho was so yucky last time! :o(\n_____________________________________________\n\nListen To This Vietnamese Map Dit Girl: It's Good\nOh thank you Golden Flower for being a beacon of fresh Vietnamese food in sauce- and old grease and fortune cookie-laden Chinatown! Golden Flower passes the test with flying colors for basic, tasty, cheap and fresh Vietnamese standards. Just look at all the straight black hair around you- my criteria for trying a new Asian place: lots of straight black hair inside. If I keep going here for lunch my dit is really going to be map. (Map Dit= Fat Butt in Vietnamese).", "author": "Jackie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-03", "description": "This popular restaurant is nearly always busy,Fresh food, fast service, cheerful atmosphere, open late, great prices", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Best 5 spice chicken with pho in the city.  I love this place, and the owners are very nice.  I eat here any time that I am near Chinatown, and often make special trips down there just to get my pho fix.", "author": "W B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Big bowl of pho. $7. Friendly service.", "author": "Yelpy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-03", "description": "I don't know what they put into their pho, but the soup is extremely tasty!  This is the place I go whenever I need a soup therapy!\nWink~ wink~ Alas de America, you know what I'm talking about!", "author": "N. C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-07", "description": "I hardly ever give five stars, but this is the best pho place in my book. My friends and I always go here whenever we're near Chinatown. We always order pho and we always come back for more. The soup is reallly goood. No doubt about that. The pho is just so good and the aroma is so enticing. The service is great here, nokidding. Everything in here is just super delicious. Even though, the management changes every few months, the food is good and the service is still the best ever, it really doesn't matter! The prices are actually very cheap and service is very quick! One time they forgot a meal in my friend's bowl, and they went back inside to get it and give it to us, which really\nsurprised us. GREAT SERVICE.\n\nNOTE: came here recently and found hair in the pho.\n06242008: They raised the prices and changed some of the recipes and guesswhat?! New management, yet again.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-10", "description": "I go here all the time and never order anything other than Beef Pho and Spring rolls. Why not switch it up you ask? Because, in my opinion, this place has the tastiest Pho I've ever put into my mouth. I may be a little white girl but I've had alot of Pho. Trust me.. try the Pho.. you'll never eat anything else there again either.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-20", "description": "Golden Flower is my backup viet joint for when I don't feel like waiting for Golden Star.  The pho is good enough to hit the spot and there's usually no wait.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-30", "description": "In, out, warm, satisfying, cheap, full. Exactly what I needed in a hot bowl of rare beef pho on a rainy afternoon.  Broth was slightly oversweet, but no complaints, got exactly what I came/paid for.", "author": "Talia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-12", "description": "I'm not holding back. I *heart* you Golden Flower Vietnamese Restaurant. I *heart* your pho, especially the #8 and #10 which are flank steak with all of the noodles in their fresh, handmade goodness. I *heart* being allowed to choose how much basil and jalapeno that goes into your huge brothy bowl of savoriness. I *heart* you, I *heart* you!", "author": "Jim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-21", "description": "Pho review:\n\nI went here with a group of 4 and we all ordered pho, and split an order of egg rolls, or more accurately cha gio.  The cha gio came out after the pho, which wasn't really cool because cha gio is an appetizer, and it ended up being the last thing we ate, cause who wants to eat cold-ass cha gio while you are pounding piping hot pho broth?\n\nHowever, the egg rolls were tasty, fried well, and served with some rice vermicelli, crushed peanuts, and lettuce, which was nice to look at, but lacking since there wasn't enough of the extras to actually wrap each egg roll.\n\nWe all ordered small bowls of pho, and I noticed later that everyone else in the restaurant over the age of 8, ordered large bowls.  Maybe it was the lack of space in the small bowls, but I found my pho visually lacking something.  They did forget to put green onions in my broth, and what I had in front of me looked like a glorified bowl of instant pho that I make at home.  And glorified is actually being kind...it was a dead-ringer for packaged noodles with meat.\n\nBut to my surprise, the pho was actually pretty good.  The broth was aromatic and tasted like good pho broth should.  The noodles were cooked right and not too soft.\n\nHowever, when we get to the meat, my last problem I had with my pho appears, and that was that the rare steak slices were sliced too thick yet still somehow overcooked.  That's actually pretty hard to do.\n\nIf i lived in the neighborhood, I'd give it a few more chances, but I'd be surprised if the problems I experienced here were an anomaly.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-06", "description": "This place is insanely cheap. The noodles are good. I order the small #3 every time. If I'm feeling really fancy, I'll order the spring rolls too. The food is good, not the best but fast, cheap and good. The downers are that they don't give you any water when you sit down. Also,  i cant help but feel like I'm being watched by an evil eye scolding and saying \"eat faster\" or \"white people make such a mess\"\n\nSide note... There is the crazy old lady who collects cans in the area and stops at the window and glares at. She freaked my out the first time i caught her glance at the peopel inside. But now, I like to call her \"grandma\"", "author": "Dustin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "I stumbled upon this place last week while working up an appetite taking photos in chinatown.  It was a cold overcast day and I wanted something warm and comforting and this place delivered the most giant bowl of really yummy pho.  Great service, cozy atmosphere and great food that's inexpensive.  I've been back since and plan to go back regularly cuz its close to my hood and the food is great.", "author": "Beth A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-18", "description": "Came back here this evening after not having come for a long time. This place was my first exposure to Vietnamese pho. Seems like the people running this place are now different. The noodle soup was good, but I have to give a lower star rating because one lady in particular was so unfriendly.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-27", "description": "Yummy yummy in my belly. Right now I am so full of clean, delicious, beef pho broth, noodles, and imperial rolls that my fingers are swaggering with delight as I write. Great place for quick great soul warming food.\nAnd happy, friendly service..... This is the kind of place that if you leave your hat there and come back 2 weeks later the owner will remember you and give your hat back, even if you didn't remember you left it there and thought you left it in a cab at 3am on your way home from a big night out (true story).", "author": "MissSkip Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "I love their fish ball soup. Cheap, hot, filling.\nI steer clear of the chicken dishes, not their specialty.", "author": "Katie h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-27", "description": "This is old school Pho is huge bowls. I like how they bring the chicken and pork separate from the noodle soup. It allows the flavors from the grill on the meat to get into the soup. One day I may try a noodle dish, but Pho is one of the best comfort foods in winter. It will have to wait until spring. Another case of needing half stars. I'd like to give this place a 4.5.", "author": "Gary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "Been here a few times and have yet to have anything bad about it.  Good food, cheap, maybe not a flavor packed as it could be but did I mention it was cheap as well.\n\nThe only thing that keeps it from getting five is the shrimp on sugar cane, which is not bad but could have been larger and not quite as greasy.\n\nThe rice plates are good but stick to the pho for the best experience.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-15", "description": "Vibrant atmosphere\nHigh-traffic lunch-hour rush(es)\nCrispy, flavoured rolls", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-23", "description": "Had a some Pho here and it was good! It was $5.75 for the small bowl of steak Pho. It was enough for dinner, and I was hungry, I will go back for a cheap, warm, and tasty dinner.", "author": "Spoke K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "This place saved us from walking around Chinatown trying to figure out where to eat and ducking the aggressive hawkers trying to get you into their chinese restaurant. It was a good choice. The pho with chicken was amazing. The broth was perfect, not greasy at all. My wife had the spring rolls and really enjoyed them. The price was reasonable and the service was very good. Of course, hot tea comes with every meal. Overall a great find.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "Went to Chinatown in search of good pho, and Golden Flower delivered. I ordered their \"everything\" pho: beef balls, tendon, tripe, brisket, the works. The broth was a little sweeter than I'm used to, but not too salty (pretty good overall). All the meats were cooked through to softness; I've had some places serve me chewy tendon which is a real turnoff. Fortunately not a problem here! Pretty decent lunch, came to around $9 for lunch after tip and taxes.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "MMMMM so good! The Pho and sweet and sour chicken are the best items on the menu! It's a small place but it's worth going into.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "I think i have eaten the most authentic vietnamese here, haven't been to the far east naturally. I really miss this place, for a picky eater like me, it is hard to forget the taste of food in this place.  sesame chicken was my favorite. with black and white sesame seeds and as Smokey aroma. Getting hungry thinking about it.", "author": "Sophie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "I'm addicted to this place. This week I came here 3 times, and before that I usually make my rounds here twice a week. I have to warn you though, this isn't a pretty place. It's pretty grungy looking and it's def no place to bring someone on a first date. That said, it has really great pho!!! I thought I had found good pho places in the past, but I sometimes dream of coming here just because of the delicious broth. \"#4, large please!\"", "author": "Simon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-02", "description": "i have to give golden flower five stars because i had my first taste of vietnamese food EVER there, almost 5 years ago.  see, i'd moved here from michigan, and though i was a big pig even then, i had never tasted vietnamese food.  not much of that cuisine in mid-michigan.  and i was freakin' excited to taste some unfamiliar cuisine.  so, while on a jaunt to chinatown, i dropped in at golden flower and have been hooked ever since.  on pho, that is.\n\ni have visited golden flower many times since, and, now being well-versed in the pho and bun that san francisco has to offer (going to school in the tenderloin, i eat a lot of pho and bun), i can safely say that they make a very fine bowl of pho there indeed.  i particularly enjoy the rare beef and tendon pho, and i always find the broth to be especially flavorful at golden flower.\n\nyou get plenty of bang for your buck at golden flower - under $5 for a big fat bowl of pho that you probably won't be able to finish.  meaning, a fair quantity of noodles left in the bowl after you've sucked down all that tasty broth.  mmm, tasty broth.\n\ni've also greatly enjoyed their fresh spring rolls, as well as their delicious lemon grass shrimp.  i have noticed that their imperial rolls look a bit overcooked.  but i go there for their pho.  and it is some damn fine pho...", "author": "genevieve g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-23", "description": "The pho is AWFUL here.... don't get it. Save yourself. Gross. I guess if you were to come here, get the bun bo hue. I came here with a friend I haven't seen in a while, and it ruined our entire reunion vibe. Our outing was sadly cut short due to this. It is very empty on weekday nights after work.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "Typical Vietnamese restaurant - I liked the vegetarian imperial / spring rolls with cold rice noodles. The vegetables were fresh and crisp, portion size was big. Staff was friendly, service was quick. A great spot for a simple yet delicious lunch under $8.", "author": "Shweta V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-13", "description": "The pho was their specialty, not so much the other warm food.  The cold noodles without soup, with grilled meat and vegetables were good.  \n\nThis place used to have the best pho I'd ever had in my life.  Then the old man got more elderly, and sick, and eventually he and his wife sold it to her cousin.  I recognized the cousin from when I went into Mayflower on Ocean once where there was pho advertised with the American diner food; it was barely pho.  (The cousin's sister now runs Mayflower.)\n\nHow can they be from the same general family?  It seems like she should have been able to learn from him.  Her pho improved from Mayflower, but the restaurant sank.  The business really dropped and then picked up some and maybe dropped.  If I'd never had old man pho, then it would be acceptable, but once you have the best you can't go back.  Still we went back sometimes.\n\nThen...\n\nThe last time we were there the food tasted like mothballs.  Why they are in a restaurant, I don' t know.  The person I was with didn't it notice as much until we asked for a container for the leftovers.  It reeked of mothballs.  \n\nThe worse thing that used to happen was that they forgot the meatballs several times when I got take out.  And there was the mass beef recall a while ago that the pho places couldn't participate in because their raw meat was all served.  But we never got sick there.\n\nWe are so incredibly sad that we'll probably never get that kind of pho again.  It probably died with the old man, if that's what happened.  It's almost hopeless to try.  We've given up expecting to find great pho again, just hoping to find something passable.\n\nAt one point, the old man's son ran Evergreen on Harrison.  I'd like to see what it's like if it's still there, although it's more of fusion of Vietnamese and Thai.  But even on the days the old man wasn't there the pho wasn't  as good, so it might never be the same.\n\nGranted this place has scary looking prep areas and and scary looking bathroom, but it was okay when the food was still great.  \n\nCash only.", "author": "e g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-23", "description": "Stick to the straight Vietnamese specialties, and it's good.  (Skip what sounds like a standard rice plate from a Chinese restaurant.  It's the Vietnamese standards that shine.)", "author": "Laurel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-24", "description": "I'm not sure how many times this place has changed hands\nCan't really judge the service, since all you ever really need them is to take down your order and give you the check, which they seem quite attentive \nDepending on what you order, the wait time obviously varies. \nPho comes super fast and rice plates take a while.\nI usually come here for the rice plates, which is approx. $7-$8.  The portions are HUGE, and unlike other places, you don't get complimentary soup, but who cares? \nThe imperial rolls are definitely a hit spot, and the pho soup is definitely better than a lot of other places.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "Pho-tastic! I've eaten here 3 nights in a row. Its a great place to call up and grab dinner on your way home from the office. The rice plates are kind of a dissapointment in terms of size, but the Pho is the bees knees. The imperial rolls are tasty but i much prefer the chicken summer roll with peanut sauce. Yum-o. There is a rumbly in my tumbly just thinking about it.", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-05", "description": "I love this place. Whenever I go to Chinatown by myself, it's the only place I ever go to for lunch or dinner. You walk in and it doesn't seem roomy at all but it's not so bad. The lighting isn't the best during the day time but we all know how San Francisco skies can be. I have a pho addiction, and unafraid to admit it. This place always satisfied me. I also started the proposal for my current company and project there, a very small and brief meeting and announcement, with a few folks. I personally just go for the dac biet bowl and the small bowls down the front page. But every now and then I go for the egg rolls and shrimp on a stick and what not. Overall a great place, but not a place where you take a date... believe me, I tried. Hahaha.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-12", "description": "Casual and inexpensive Vietnamese restaurant in the Chinatown area with great-tasting, fresh food, and a lot of vegetarian options (about 15-20 items on their menu are vegetarian).  This place is worth the 8 block walk from my office, and I usually go here for lunch when it's not too busy at work.", "author": "Dinesh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-19", "description": "Their pork chop rice is really good here! It is a lot for about $5. Also their chicken is really good also, I love the spices, or may be it is just msg?", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-30", "description": "I have to add Golden Flower to the top 3 Vietnamese establishments I've visited. Its right up there with Vietnam, and Little Vietnam Cafe. Started out with the Imperial Rolls, crunchy and good. Had the #34 which was great: Two different kinds of pork (shredded noodle style and bbq), bean sprouts, carrots, mint, and noodles. Dump some of the sweet and sour sauce on top and you are good to go. Washed it all down with a sugary lemonade. Also took a sip of the Salty Lemonade, but a sip was enough...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-12", "description": "Pho was cheap and pretty delicious, but service is rude. The waitress seated us at a table with a stranger, then pointedly hinted that we should pay and leave as it was getting crowded. I'd say the food isn't good enough to tempt me back here.", "author": "Angela X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-23", "description": "My favorite pho in the city -- not a lot of msg, great broth, extremely tasty imperial rolls.  I always get the larger bowl (which is too large, but the small is just a tad too small).", "author": "Mitzi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "i'm so full... i've got a giant bowl of pho noodles expanding in my stomach... \n\nso generally, most times i go to a new vietnamese restaurant, i'll order the #1. which, more often than not, means i just ordered the extra large pho with everything. the extra large bowl of noodles and broth i got today was more filling than usual. but it was quite tasty. the noodles were a good consistency - not too mushy or soft. the broth was good, but i'm not sure how i feel about it yet. it tasted a little different than at other pho places i've eaten at... the imperial rolls were great. \n\nbest thing about it is i spent less than 10 bucks for a lot of good food and some serious food coma...", "author": "Steven L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "The Pho is super-savory. Chewy Noodles, hot and pungent broth and the hugest portion of meat that you could ask for along with it. I order the #21 more often than not, though their vermicelli bowls are totally out of control as well, as is basically every dish I've tried. This place is just your typical Chinatown pot-o-gold. Pretty dirty, small, poorly lit, kinda abrupt staff, and some of the best flippin soup you can get your sweaty little hands on in San Francisco. Seriously, eat here.", "author": "Eryn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "This place has great veggie friendly and healthy pho.  Since San Francisco is usually freezing, I often crave something warm yet filling - and this place has it!  The place is casual and really cheap so it is a great place to grab a quick weekday dinner.  It looks like a pretty standard Asian restaurant inside - not too decorated - but it is clean and simple which is nice to see. \n\nI've actually only tried their pho but you can request a vegetarian version which actually has vegetarian broth, and tons of vegetables and tofu. I requested some basil leaves on the side and they were very accommodating and brought out some right away.  To really enjoy the large soup bowl make sure you use all the fix-ins, especially the Sriracha hot sauce and the brown sauce (just a little though). \n\nDefinitely recommend this place if you want some simple, yet delicious food.  I guarantee you will start craving it!", "author": "Sheena G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "This is my all time favorite Vietnamese Pho and catfish clay pot place.  The owner is from somewhere near Central Vietnam so the Pho broth is very similar to how my mom makes it (I'm from Hue), perfect to my taste!  As for the fish clay pot, it's cooked perfectly to our taste (99% of the time).  I say 99% because one time they either forgot to put suger or just didn't put enough and it was so salty, only ONE time.  This is why I gave them a 4 star (I would give 4 1/2 if I could) instead of 5.  Have to rate honestly.  Can't give perfect score if the restaurant makes mistakes, right?  Anyway, my husband and I have been back to this place many, many times.  We even bring friends and family members everytime they come to visit us and they all enjoyed the food there.  If you order the clay pot, just make sure to tell them to cook it extra long so that the sauce is caramalized...yum...yum.  The hot and sour shrimp or fish soup compliments the clay pot very well.....I highly recommend these dishes.  The service is excellent everytime we come here.", "author": "Sue N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-24", "description": "Yummy yummy pho. Been here twice so far and both times, Golden Flower has been able to satisfy my pho craving.  Roommate and I both got large orders of pho (way too much food... I'm going to stick to the small size in the future) and split a plate of the fried springrolls and total came out to about $17 after tax. Not too bad for all the food.", "author": "Christy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-30", "description": "best pho broth in town.\nbest imperial rolls with bbq pork on bun in town.\n\ni mean, seriously, the only reason why you'd go anywhere else for vietnamese cuisine staples is because it's easier to find parking.\n\nBTW, if you want water, you gotta ask for it.", "author": "dj z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-06", "description": "5 stars for bomb ass 5 spice chicken!!!!!!!!!!!! and the pho is pretty good too! Man I have been going to chinatown for about 17 years now and have never eaten here til a few days ago! I LOVE this place! New favorite Pho joint! Better than Daly City places to me. =)", "author": "David Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "I've been going to this chinatown gem for 15 years when I found it by happenstance on a cross-country trip with my best friend from childhood. Let's just say if you love soup, hot soup, and BIG bowls of soup, this is the place in SF. I learned to eat their Hiu tu tom cua (spelling? - seafood fish ball soup) by watching the native Vietnamese folks in the restaurant. Spoon in one hand, chopsticks in the other. Don't forget to mix in the fresh basil and careful on the fresh jalipeno! If you're in the neighborhood and want a hearty lunch on a cold SF day, definitely drop in. This is one hole-in-the-wall worth visiting!", "author": "Edward W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-03", "description": "This place is passable, but not very good.  The safest thing to get are the dry noodle plates with meat or egg rolls (bun), which aren't too bad.  The pho is pretty gross, and the other entrees can be pretty sketchy.", "author": "Jon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "My favorite Vietnamese! Wish they had the sandwiches, but they have just about everything else. Yummm", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-15", "description": "Golden Flower is not about ambiance or service - just the food.  It's a great hole-in-the-wall restuarant for authentic, fresh, Vietnamese food... lots of veggie varieties.  They get quite the lunch crowd, so go before noon or after 1:30 to get seated quickly.", "author": "seema s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-06", "description": "This place is good for the Vietnamese purist who likes their pho with tripe and other stuff not found on Americanized menus.  They have a long list of dishes which are basically variations on the same things with different choices of meat.  I like the fish ball pho.  You can also get some cool drinks here, like lemonade which has a lot of sugar in it.  I saw someone drinking a milk soda which looked good.", "author": "apple r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-14", "description": "I never thought I'd say this about pho, but they gave me too much.  Broth, that is... slightly bland, \"brown\"-flavored broth with a sad clump of noodles lurking at the bottom, with a few equally sad beef balls floating forlornly.  I only went here because New Saigon was closed, I swear to Gawd.", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "Cheap.\n\nClean.\n\nGood Service/ Polite/ Quick\nI might be biased because I've become a regular take-out customer there now so they know me and ask how I've been\n\nI find myself dialing that saved number \"mmm chicken\" every two weeks for their Five Spice Chicken. It's delish\n\nOh and their pho ain't bad either", "author": "Lorrie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-14", "description": "Worse bowl of Pho I have ever tasted. The broth is very tasteless and the noodle is the worse I have seen. Needless to say, I won't be coming back.", "author": "Henry N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-29", "description": "I would have to say this is one of the better Vietnamese restaurants in Chinatown.  Their bun bo hue is not bad but the fresh pork spring roll and imperial roll is pretty good.  The manager/cashier tends to yell at the workers though.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-25", "description": "Hey now, that's good pho! A very savory broth and decent ingredients at a nice price. Feels less cafeteria-like inside than other spots in the hood, reminds me of some mom and pop shops I used to frequent back home.  I also like the fact that the iced coffee isn't jacked up to $2.50 a cup yet. A solid lunch option.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "Worth the work lunchtime journey to Chinatown for pho!  This is the real stuff and great value too.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "One of the best pho's around. I've only had the rare beef pho - it's so good and satisfying I've never had to try anything else. A bowl of pho will set you back $5 - a pretty cheap lunch or diner. The imperial rolls are also very good crunchy, fresh and full of flavor. One of the best Vietnamese places I've been to so far...", "author": "Russ C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-02", "description": "I give it 3 stars - food is good and consistent. bowls of pho are served steaming hot and always plenty - i usually have a hard time finishing. come here often with coworkers and usually find myself seated next to a stranger, but that's okay, we are all united by the pho.", "author": "laura f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-13", "description": "this pho place used to be good. now it's gone down the drain. the soup base is not as good as it used to be and you get less noodles.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-27", "description": "The pho wasn't bad, but I've had better. The meatballs tasted a little undercooked. And I only got one piece of tendon in mine.. I also ordered egg rolls, which were yummy (: BUT, they didn't even notice that they forgot my sauce, haha. The service was great, they were really friendly. It was kinda sorta awkward because the whole time we were eating, they sat there and stared at me and my family the whole time. It wasn't bad, but I don't think I'll be going there again.", "author": "Kaylyna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "The food is pretty good. Lunch can be a little crowded. It's pretty cheap. The service can be a little flaky, but as long as the food is good, right? I got the spring rolls. The sauce for the spring rolls was yummy!", "author": "Pika C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-26", "description": "If you don't compare this place to the other vietnamese restaurant, then I would say the food is good.  For experience vietnamese food eater, I think there is better choices out there.  The pho broth is not flavorful enough and noodles aren't \"silky\" soft.  Portions aren't huge like it should be for a #1 extra large combination beef pho.  Service was also a liitle bit on the down side cuz they brought out the noodles before the bean sprout and I gotta ask them two times.  By the time the bean sprout comes, my soup wasn't hot enough to really soften them.", "author": "Heidi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-14", "description": "I was introduced to this place by the ex-cultural attaché of French embassy in SF, who lived long time in Vietnam. I like food there very much. Great for lunch and fast dinner.", "author": "Vera S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-28", "description": "Best Pho in Chinatown (but haven't tried Golden Star, so this opinion may change), and also very good Bun (noodles) -- get the bun cha yau (noodles with fried spring rolls; yum!). Inexpensive, with decent service; not overly friendly, just businesslike, as with most places in Chinatown.", "author": "Bruce C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-23", "description": "The Pho here is pretty tasty and good.  It's cash only but they accommodate for big groups fairly well.", "author": "Buddy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-24", "description": "i've been here since i was three years old and i still come here whenever i get the chance to. i'm pretty upset that they changed owners to their cousin because the placej ust doesnt feel the same anymore. it looks different compared to hwo they use to look and their cousin is a mean ass bitch! shes pretty fucked up to her workers from what iv'e seen from all the yelling and hand motions. \n\nbesides that, i've loved this place for a long time. the old man and his wife that use to work there was so damn nice and always said hi to me. i know for sure he remembered me because he use to have a place on irving st. too but that didnt last long. this will always be one of my favorite restaurants hands down despite the owner change.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-15", "description": "my friend and i ordered two #1s. \nsince it was a large bowl, we expected it to have more ingredients. \nsadly, this was not the case. \n\nwe got something like two beef balls, *thinly* cut beef tripe, super well-done streak that was supposed to be rare in the first place, and basically little other scraps of various parts of cow. Not as much beef as i would have liked, and TOO MUCH NOODLE. come on man. It's called BEEF NOODLE. where's the beef? we're in a recession and all but still. we're talking Chinatown, where the place is cheap, and apparently so are the ingredients. \n\nok service. nothing special.", "author": "john d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-11", "description": "Fairly decent lunch pho place. I had the usual pho with beef. Broth was decent, no comparison to Pho Tau Bay or Pho Kim Long in San Jose. I didn't find the complex depth of flavors I found in the San Jose pho noodle houses. Service was fast, I will definitely be returning here until I find better pho in the city.", "author": "Joon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-04", "description": "Yes I miss Golden Flower... I used to live in North Beach, every weekend I would go there for lunch. I know the owner, he used to have another restaurant in North Bay I . I love the \"cat fish\" really the best! and the beef noodle is good also... I moved away and don't go there much anymore, really miss it. I would highly recommend the cat fish... and of course the ice coffee.... so good. The food always makes me smile. The place is not high end, it's really just  the \"family and friends\" place for a good meal.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-15", "description": "This morning I had the craving for something barbecued.  It was 11 a.m. and I was already hungry for lunch so my friend Diane and I left the office before noon and we walked to Chinatown.  We stepped inside to the modest, but very busy dining room of Golden Flower.  I scanned their menu and found what I thought might my satisfy my craving- # 51, Flame Broiled Pork Chops over rice (I also asked for a fried egg).  Not bad-not bad at all!  Actually, I thought it was terrific!  Their menu is extensive and shows the promise of a long and happy lunch relationship.  One other thing- this place is really inexpensive.", "author": "Denny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-22", "description": "Wonderful Pho. Well worth the trip. Also, delicious spring rolls, fine beef salad, great chicken pho.", "author": "Graham M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-06", "description": "Excellent Pho with very flavourful broth. Not too fancy. Very busy at lunch.", "author": "Jim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "you know you're heart/physically sick to heart when you don't have much energy to write or the energy to get up and pee this morning.\n\n***\n\n4.5\n\nextremely cheap & tasty. very homey.\n\never thought of having pho for breakfast? and don't you ferget to order cha gio.  $5 each way = me happy.\n\nservice = 5stars as well\n\ni don't got the energy to write much, but i have to say, i'll definitely come back.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-19", "description": "Damn PHO! I walked in here looking for a Vietnamese sandwich. You see it's one of my culinary obsessions. This city is so wonderful in that sense that you can go on the hunt for a: burrito, dim sum, Vietnamese sandwich and  other ethnic fast foods and practically never run out of places to go. I think Pho is up there too. There are probably hundreds of places to go to for Pho in this city. So seeing that they didn't sandwiches I walked out but before I could leave the door I saw somebody eating some Pho. I said \"damn pho!\" that pho looks good! So I sat down and decided to have a bowl. I did like that you can get a small size and a big size. Having gotten stoned the night before and having gorged myself on everything in my fridge, I decided that the smaller bowl would be best. I have had quite a few pho's in my time, and I have to say that this was some of the best broth I have had. Fantastico! So good. The ambiance is...well...its...Chinatown; what do you expect?! But that's not why you should come here. The pho was great and I would go just for that. I can only assume the other stuff on the menu is good to. Stay tuned...I will be back here.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-12", "description": "definitely nothing special.  i hadn't heard about it before but they had a bunch of reviews taped on their front window, so i thought it'd be decent.  not really.  i ordered my usual of vermicelli with imperial rolls.  only half the bowl had noodles, which i guess is OK portion-wise for me, but it's much less than most other places offer.  there are at least a couple other better places in the area for the same menu.", "author": "spiff e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-18", "description": "This place rocks! clean, cheap, and great food. I like #40, broiled beef over noodles with imperial rolls.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "Clean, economical and wowza - food is terrific.  Soups are delicious. This place looks like a dive from the outside - but it's squeaky clean and delish on the inside. Prices were wonderful.  Service was super fast.", "author": "kiyo r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-14", "description": "awww i like this lil spot. the service is so friendly, and they speak pretty good english. i ordered a large pho no meat (weird, i know) and i got this huuuuuge bowl full of noodles. i was a lil hesitant because there wasn't a ton of color to the broth, but the flavor was still pretty good, the noodles could've been a lil more.....rubber-band-like? softer, chewier? lol but all in all i liked this place, very home-y feeling.", "author": "Kimberly P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-30", "description": "i came here a few times with my girls to eat. i came here for lunch/dinner. this place is kinna small, but it has the warm coozy feeling when you're inside eating, feels like home. i gotta admit their pho is pretty good! parking anywhere in ctown is a pain in the ass unless you're lucky, but you still gotta pay for meter. lol", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-16", "description": "the soup base is good. maybe because its overloaded with msg. hmm! well fyi its pretty good but there cleanliness is a downfall. i found gnats in my soup or veg a couple of times. my uncle does plumbing work in the kitchen and he said its infested with RATS yes i said it infested with RATS.", "author": "Tasha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-09", "description": "my favorite pho restaurant in all San Francisco!", "author": "Valentina V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-20", "description": "pretty damn good pho. i had veggies and tofu with beef broth. the best tasting soup i've had in a long time. Service was poor but it was good enough. the deep fried rolls were good too.", "author": "rukshan b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-25", "description": "Very randomly, j and I were wandering around chinatown on a sunday. The place we wanted to eat wasn't serving what we wanted right then, so we just walked into this place. I saw the article on the front saying how pho is their best thing here, and I almost got pho... but I'm just sooo not a soup person at all. J does like it sometimes, but he still didn't get pho. He got a seafood combo that comes with rice noodles. His looked pretty good... sauce over the noodles, and a medium sized meal. He said it seemed like there was a lot of junk seafood like imitation crab in there. But it was ok. I had lemongrass pork and I substituted rice noodles for the rice (even though the waiter was SHOCKED and couldn't believe, for some reason, that I wanted this... is it really so weird??). I had almost gotten something with shredded pork, but he told me it was pork skin, rightly assuming I didn't want that. So that was nice of the waiter. My food was SMALL. A tiny bit of meal only taking half of the tiny plate. The other half was the noodles. The noodles were good. The pork was ok. Besides the reccomending that I don't want shredded pork, our service was pretty rude. Not overtly, but just an air of rudeness. Exasperated when we took too long to order. Ignoring us the whole meal. Talking loudly to each other when we wanted our check, instead of coming to bring it to us. Stuff like that. So, not too friendly, just ok food, small portions were all minuses... plusses were that we were seated right away (plenty of empty tables) and the number one plus was the PRICE. It was so cheap - $16 for two people. So, you get what you pay for. We were both very hungry after, so we went home and made cookies. PS cash only", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-14", "description": "I love the service here. The waitress was friendly, well-mannered, and always had on a smile. The pho, which is the only thing I ever ordered there, was plentiful and had lots of the meat and stuff. The place is kind of small, but has that nice atmosphere. The restaurant is very clean. Overall, I like this place and I'd go again.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-26", "description": "This restaurant offers large portions of good food for a great price.  It's the type of Chinatown restaurant with the cheesy glass tabletops and paper placemats.  But, it offers large bowls of pho for $6.   The selection is ok, but they have a great broth.  It's not too heavy, but it's still super flavorful.  Their rice platters are pretty generous as well.  You'll be seated by a gesture from a the formidable looking woman in the back of the room and you'll most likely get your food within 10 minutes.  Not bad at all.", "author": "Raz R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "I like this place -- food is authentic Chinese/Vietnamese and they get a very high 96 score from the SF dept of health -- not easy to do -- http://dph-extranet2.sfdph.org:7777/pls/eeop_htmldb/f?p=132:2:3500150978975688::NO::P2_LOCATIONID:35221", "author": "M B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "My regular spot for some great Vietnamese food. Great pho, and good rice dishes too. Recommend the Imperial Rolls, Pho & 5 Spice Chicken. In addition to great food, the owner is a sweet heart and everyone is welcoming.", "author": "Minh T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-18", "description": "service and food is just ok.  nothing special", "author": "L C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "The place was a hole in the wall but the food was very good. I ate here with my gf and a few friend. Sa*** and Jo** took me here, we ate sweet and sour soup and the catfish hot plate, I am not vietnamese, but if you are then you know those food called  in Vietnamese. Anyways, I like everything about the food, but I hate looking for parking. Service was good also.", "author": "Jimy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-29", "description": "One of my favorite restaurants. Love the fact that they accept credit card in Chinatown. The Pho is very good there. Service is kinda ok. They kinda ignored us a bit, but when they served us they were nice and not giving attitude. I would recommend this restaurant if you are in Chinatown looking for pho", "author": "Jon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-29", "description": "if you've ever wondered if pho could kick ass, this is where it does.  i had the pho with tendon, tripe and raw beef (i was feeling adventurous) and it was damn good.  the imperial rolls with the peanut sauce were awesome too.  if you're poor but want a lot of food this is the place.  you won't get a lot of ambiance here but they do have some cool instruments on the walls.  we asked the guy there about one of the violin-like instruments and he wasn't ashamed to admit that he knew absolutely nothing about it.  at least he was honest. i don't like bullshiters.", "author": "Richard K."}
