{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Little family-run place with good Vietnamese and Cantonese comfort dishes. Nice discovery! \n\nWe really enjoyed the congee here. The rice sheet roll with shrimp was super fresh. We also ordered the Vietnamese crepe. So crispy!", "author": "Cielo L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-06", "description": "Going to keep this simple if you don't want to read the whole thing: don't eat here if you want authentic Vietnamese food. This is basically a wannabe Vietnamese joint run by Chinese people.\n\nAt lunchtime hours (from 1-2PM), there were more employees than there were customers, since more people ordered take-out than dining in. Those customers are smart to do that because it was not a place to have a conversation while hearing all the yelling back and forth in Cantonese in the kitchen. \n\nWe ordered a Bun Bo Hue (spicy beef vermicelli) and a Bun Rieu (crab paste and tomato vermicelli). It is a CONVENTIONAL CIRCUMSTANCE that every bowl of VIETNAMESE vermicelli comes with a COMPLIMENTARY side of basil and mint leaves and beansprouts, but apparently we had to pay an extra $1.50 for CHOPPED CABBAGE. Yes, that's right. CHOPPED CABBAGE. Very typical of a Chinese business to charge you just to breathe air in their facility. Screw cultural norms, right? If you're serving Vietnamese food, do it right! Anyways, the Bun Bo Hue was flavorless and needed an extra five helpings of salt to make it actually taste like food, the noodles were hard, rubbery, and undercooked as if they just threw it into the soup and served it without a second thought, and the Bun Rieu tasted as salty as ocean water itself. The tomatoes helped a lot. \n\nWhat a disgrace. Don't even get me started on the service...but since I'm at it, why not? Can they at least wash their hands after they pick their nose in front of their customers AND before they serve us food? That man deliberately dug his thumb with a lingering BOOGER ON IT into the lettuce! DISGUSTING! Anyways, at least we had iced water for each of us. The next table over had one cup of iced water for a family of four to share. LOL What a joke! \n\nIf it weren't for the ten-grain gelatinous dumplings (the only thing on the menu that's actually edible and guess what, is actually Chinese food!), I wouldn't come here again. One disappointment after another. They're not gonna last long.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "I dunno. This was a dud. It happens. \n\nThe soup was gross - it didn't taste right. It tasted...rotten so I threw it out. \n\nThe raw meat did not smell fresh so I didn't eat it.\n\nThe lemongrass beef was also not good. Trashed it.\n\nThe rolls were just ok. \n\nPoint of this review - this cooks in restaurant have had to have eaten good Vietnamese food. Why did they drop the ball here?\n\nWhyyyy?!?!\n\nThere are too many delicious alternatives to spend your hard earned dough here. Go there. Not here. \n\nI paid a lot of money to throw food away like some kind of aristocrat. \n\nNot my idea of a good time.", "author": "Jennifer C P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "Sándwiches are good but the rest of the food is barely average. It's not clean and waitresses are not helpfull at all. Won't be back for sure !", "author": "Celine D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-01", "description": "The sister and I were in the area and were looking for something to eat nearby and just walked in because we saw pictures of soup and it was cold outside.\n\nHOUSE SPECIAL BEEF NOODLE SOUP- rare beef, beef tripe, tendon, and beef ball\nThe broth was on the bland side and the noodles didn't take on the broth flavor. The meat was chewy and didn't taste very fresh. Overall, I didn't like this bowl of soup very much.\n\nCRAB PASTE & TOMATO RICE NOODLE SOUP\nThe broth was savory and light, but other than that I didn't find anything amazing about this bowl of soup. I was expecting sweet crab flavors, but I didn't get that. I did get nice acidic flavors from the tomatoes. Overall, not amazing, but something to just fill up the stomach momentarily.\n\nI'm sure I won't be coming back.", "author": "Anh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "-I called to order takeout-2 noodle soups. When I cam to pickup my orders, I was greeted by the owner, who then went to find it. He announced out that my total came down to, \"$22.79.\" I was ready to sign the receipt when I noticed that the total was actually \"45.58.\" I found it strange that what he said was different from what was on paper. It turns out that he charged an additional $22.79 as tips. Thankfully, he was able to void the transaction and later charged me $22.79.   \n\nI know people make mistakes, but I've been a regular customer here since 2016. Just make sure to check your receipt and that you aren't wrongfully charged.", "author": "Erica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Combo laksa. Salt and pepper fried chicken wings. There you go. Perfect meal. I ordered the regular size bowl of laksa and could only finish half the wings and half the bowl... That means I'll get another meal out of it", "author": "Hsuanwei F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Came by on a Tuesday morning for breakfast. This was my third try trying to grab jook at this spot! My own fault bc I clearly didn't remember they're closed on Thursday's, and stopped by on Thursday's the two times before. Welp, third times the charm! \n\nHave y'all heard of Hing Lung? The infamous jook/porridge spot, once residing in Chinatown? They've been closed for a handful of years now, and I'd been MAJORLY missing that jook and Chinese donut in my life. BUT, a few months back I'd passed by Green Bamboo and read a sign that Hing Lung is back, baby! And once again making their jook and Chinese donuts, now at Green Bamboo! \n\nWell when I finally came by this third time, it turns out Hing Lung has reopened their own spot in San Bruno, but an insider told me that one of their jook chefs stayed around :) \n\nLonggg story short, got myself the fish porridge and 'cow tongue' donut. THE BEST. Finally got that thick porridge with the savory sweet donut I'd been missing all these years again! \n\nThe waitress was nice enough, and explained everything on the menu was available at 10am (not always the case at most places). Mama didn't want the jook so much so she opted for the spicy crab noodle stir fry, which honestly wasn't the best. The noodles in the picture looked a bit thicker than the vermicelli version that came out. And the crab wasn't really as tasty as it could've been either. \n\nWell, I personally came for the jook and I got the jook. So the 4 stars go to the jook!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "Nice little local place to eat.  The food was decent and presentable.  A very family orientated restaurant as there were a few tables with children. \nI think the little old man who served us is the boss, as he was attentive and knew his food.  The wallls are filled with food photos and I have to say, the menu can be overwhelming with 6 pages to choose from.  Overall, a decent place to eat if you crave for Vietnamese food.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "Amazing prices. Standard Chinese food. I think I ordered the wrong thing. The wonton soup was ok. Nothing stood out. The bbq pork in the banhmi was tasty but there wasn't much too it.", "author": "Arnold W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Came to share a lunch with mom. We ordered a bowl of beef congee with some non-negotiable fried donut (youtiao) and a fried tofu bahn mi to split.\n\nThe donut was brought out first. It was made very nicely - fried evenly and not too oily. The donut itself was crisp on the outside and fluffy on the inside. The \"seam\" was also still integral. Almost immediately after came the congee which is a huge bowl! Definitely meant to split between at least 2. The congee is also the thick and creamy version - yum! I love this version cause it shows just how long it's been simmering for. The beef was tender and for a person who is not a huge fan of ginger, the slivers actually provided a nice elevated flavor and wasn't too overpowering.\n\nOf course I ate it with endless pieces of youtiao coated in its creamy goodness! Overall, a very hearty meal and perfect for the chilly San Francisco day. Warms your whole body right up.\n\nAs for the bahn mi, their baguette is excellent! It crackles like a symphony when squeezed, but still provides a soft, heavenly interior that not only soaks in that vietnamese mayonaise, but also contains your choice of protein with pickled carrots and radish, jalepenos, and cilantro. We ordered the tofu with pate (#5) but it accidentally came without pate (because a second menu showed #5 as tofu OR pate - oops). Nonetheless, it was still delicious.\n\nMeal came out to $19 after tips. Worth it!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-08", "description": "They do not provide pho even tho it's on the menu. This is rip off pho. No sauces. No jalapeños. No lime. No basil. In you like pho you should avoid this place", "author": "Bebe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-17", "description": "Not gonna lie... their porridge and Chinese donuts are pretty damn good.  That's why they still get the 3 stars from me...\n\nEven after I was the first customer to walk in and they weren't exactly open yet.  As I asked her if they we ready to serve some porridge, she dropped a spoon on the floor that she freshly mopped with a dirty mop of course, and nonchalantly picked it right back up and put it along w the rest of the spoons.  With me just standing right there... straight up... no fks given.  \n\nI'm in Asia almost half the year and it's 1000x worse, and that's why I still give them 3 stars... Their porridge is solid along w the Chinese donuts.  Sorry guys... couldn't get myself to pull the trigger on the two stars.", "author": "Colin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "The owner of this restaurant is an asshole!! If I can give pieces of crap as rating, that's what he deserves. I don't know why he participates in the senior Champss program when he hates seniors so much. He lied and said my mom's card didn't have any money in it when it does. I had proof via email. But it's the asshole's attitude that's the worse. He screamed at my 88 year old mom and her caretaker when they were trying to ask why he wouldn't let them eat. My mom walked 5 blocks to go to this asshole's restaurant. \n\nDon't go here!! Don't give this asshole's any of your hard earned money!!! This restaurant should go out of business.", "author": "Esther K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-24", "description": "When the wife had a strange hankering for \"cow tongue\" pastry last week, a quick Yelp check brought us to this unassuming, no frills hole-in-the-wall. Nope, bizarre food had not gone into her head!  Plain and simple, it is only a nickname for a Chinese donut ($2 each), elliptical in shape and looked like a cow's tongue. It had no association to a real life cow's tongue! Not too many places carry them, which are well loved by those in the know. Most Chinese love them eaten on their own or as an accompaniment with congee or jook. The donut in Bamboo was perfectly fried to a golden brown with minimal grease and slightly sweetened. The crust was crispy with the inside soft and fluffy. (4/5)\n\nBamboo features an extensive jook menu ranging from the familiar chicken or beef to the more intimidating pork blood and pork offals. Jook is their forte and we opted for the Sliced Fish Jook ($7.95) where the fish was a flounder, a mild flavored, lean white fish. The jook had a thick creamy consistency that went well with the donut. By force of habit, I added a few drops of soy (it actually didn't need it!) and a light sprinkling of white pepper to enhance its savoriness. (4/5)\n\nBamboo is both a Chinese and Vietnamese café. A bowl of hot and comforting Wonton Noodle Soup ($7.95) was hard to beat on any blustery day. A huge bowl was dropped off with 6 plump wontons, each almost the size of a golf ball. The broth though should have been hotter. I personally would prefer slippery bite-sized pieces of wonton that can slide down the hatch with less chewing!  That's just me! The wontons were stuffed with shrimps and marinated in sesame oil. The broth wasn't as authentic as I couldn't detect any dried tilefish or shrimp shells flavors. Nonetheless, it was still tasty and a well deserved 3/5.\n\nWe thought we should have at least one Vietnamese dish. Stir Fried Clear Noodle with Crab Meat ($12.95) was recommended to me although later, I had a strong suspicion that it might be more Thai like a chan pad poo using woonsen noodles (fun see or glass noodles). It didn't matter whether it was Thai or Viet but it just failed to push the right buttons. It lacked wok hay (boo!) and the sweet white crabmeat shriveled to dark brown that didn't taste like anything. The other ingredients like bean sprouts, carrots, green and yellow onions were equally ineffective. (2/5)\n\nBamboo was definitely a dive but that didn't bother me. The interior was a little tacky and gaudy with colored pics of every entrée plastered all over the wall. That's the way it is in a lot of divey Chinese places. Why then 2 stars? To be blunt, the management's honesty was suspect. We didn't order much, the food was inexpensive and I was able to keep a mental tally on how much we spent, which was exactly $32.95 before tax. The check was scribbled illegibly in Chinese with a total of $44.27 presumably after tax and circled! Am I to believe that taxes on a $33 tab came up to a whooping $11 (tops maybe less than $4!)? Long story short, they have inadvertently added another entrée to my check, which we never ordered and admitted to making an \"honest\" mistake! I don't read Chinese and would have been an easy target for their dishonesty had I not been more alert! All I can say is \"Beware\"! I wasn't too pissed at that time and still dropped off $5 as a tip. I got really upset after making a long trek back to my car! It was the kiss of death for Bamboo after realizing I was almost ripped off like that. 2 stars, 2 visits! Wouldn't be caught dead in there again!", "author": "Geoff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Definitely a great place for porridge, in fact, one of the best places for porridge and their matching fried donuts......\n\nIt's a relatively small seating area, so there is a sign up list.....\n\nWe ordered porridge with seafood, porridge with liver, fried donuts wrapped in rice noodles, rice noodles with bbq pork, and the sweet fried donut.....\n\nThe reason why it is so special is the Chef is from a closed restaurant on Broadway that was popular for their porridge and fried donuts......\n\nWorth the trip for porridge....", "author": "Leslie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "Came with my mom. We shared jook, fried donut, and beef tripe noodle soup. It was decent, but maybe lacking something. Service is good. I had the lemonade and was a bit mifffed about their version of lemonade. It wasn't typical American lemonade..more like lemon water..no idea.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "Ordered take out. Imperial rolls were disgusting. Tasted like the meat inside was gamey. The chicken in the chicken and rice dish was NOT chicken. I actually could not identify what type of meat it was sadly. I actually only took one bite of the whole meal, which was a bite of the roll. Immediately spit it out. I will never ever waste my money here. I'm sorry but fresh goes a long way and being able to identify the meat is necessary.", "author": "Tanya K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-17", "description": "Do not come here. The owner had a bad attitude. Food was not fresh. I saw them using microwave and still the food wasn't even hot. Wtf.....Go anywhere but here.", "author": "Sunny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Out for a late dinner with my mom had a craving for porridge, my sister recommended Green Bamboo.  I know parking could be a challenge on Noriega St, but given the time of day, we had no problem getting a space in front.\n\nA sign at the entrance in Chinese states that their porridge chef was from the former Hing Lung Restaurant on Broadway in SF's Chinatown. Hing Lung was known for its porridges. \n\nThe brightly lit restaurant and tables for four on the left and large round tables on right.  Pictures of the menu items are posted on the walls of the restaurant.\n\nPorridge with pork liver - my mom was a frequent customer at Hing Lung.  This porridge met her standards and she ate the whole thing.\nCurry chicken rice noodles in soup - my sister enjoyed it but she said it was on the spicy side.\nFive spice chicken over garlic noodles - good amount of chicken on top of the noodles. Chicken was flavorful and moist and noodles were not overwhelming with garlic.\n\nA good choice for porridge and other Chinese cuisine on Noriega.", "author": "Al L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-15", "description": "The most horrible Asian food. It is not even fusion. Order Laksa n it is tomato soup with some oil in it...yikes.", "author": "Al L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "Let's have a round of applause for green bamboo. They served me the worst \"pho\" I've ever had in my life. Not only was there not vermicelli, the noodles were flat rice noodles. The broth was bland and there was barely any toppings. One of the downsides of the Bay Area is that it's hard to find authentic Vietnamese restaurants. They're usually owned by Chinese people. Avoid at all costs if you're looking for authentic pho. I hope the Chinese food is better...", "author": "Virginia Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "If I could give this dump 0 stars, I would. \nThis older man (age 65 years old and up) that worked there made my Iced Red Bean drink and it was made with EXPIRED MILK. What....the....faq.\n\nSan Francisco Department of Public Health should do an inspection of this place again. Using expired food products is a huge safety hazard and could kill people.\n\nI definitely recommend everyone to AVOID THIS PLACE at all cost, if you value your life!", "author": "Sugar C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Stopped by here for lunch with friend since she's recommended. \n\nOrdered the Crab Stir Fry rice noodle, assorted congee, wrapped donut, the fried donut pastry and some noodle soup. Overall, everything was good but the noodle soup tasted super bland so maybe a different chef? The rest was super flavorful and definitely tasty. \n\nWill most likely come back for the pastry and the other items we tried, service was not bad since it wasn't super busy. The food came out pretty quick, a very small mom and pops shop sorta deal.", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-09", "description": "Came here on a Sunday afternoon when most restaurant on Noriega were still closed. I had the spicy beef and pork Rice noodle soup (Bun Bo Hue), and was disappointed.\n\nThe noodles were a little undercooked, while the soup was unimpressive. I can only taste the chili oil, but not much other taste in the soup itself. For Vietnamese noodles, the broth is the essence of the dish, and I was expecting to different flavors in it. I understand that this is a spicy noodle soup but the chili oil should not be so overpowering and mask everything. \n\nThere was one piece of pig's blood, beef, pork and fishcake in the noodle soup. I like the pork belly, it was tender, and everything else is pretty average.\n\nI will probably try another pho place in the future, and if I do come back, I will try something other than Bun Bo Hue.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "I used to love eating pho at this place. I haven't been here for a long time and their substance has changed badly. The noodles are very soft, it feels like the noodles are left overnight. It doesn't have that texture where you can slurp it. Their food has lost the way it used to be. Also be careful of what kind of noodles you want. If you want specific ones, make sure to tell them.", "author": "Dominique C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "So today we ended trying this place due to the fact that I had a restaurant.com coupon which gave me $10 off.  We walked in and we asked if we could use the restaurant.com and the person that served us which seemed to be the owner said yes.\n\nWe went ahead and got the curry chicken soup, the clear noodles and the onion pancake.  The pancake seemed under cooked and it lacked substance, the curry soup was good but nothing to brag about, the clear noodles was the only thing that was really good out of what we had.\n\nWould I come back?  Mmmmm only if I had another $10 coupon from restaurant.com, or if I was desperate for some pho on a cold night which I didn't try.\nOn the flip side the soups are pretty affordable, the curry I got ended up being under 8 bucks, quite a bargain right?", "author": "Josh Giosue D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "Was hungry and decided to order delivery for dinner on Saturday, September 5th a little after 9pm. We used Eat24. There was a $5 delivery charge and a $0.10 SF bag fee.\n\n10. Vietnamese carpaccio: raw beef salad ($12.95)\n13. Combination beef noodle soup: well-done beef, rare beef and beef ball ($7.95)\n19. Crab paste and tomato rice noodle soup: contains pork and pork blood pudding ($7.95)\n59. Garlic noodle with house special chicken ($8.95)\n\nThe Carpaccio had decent flavor, but it looked like they used the raw beef for their pho to make this. The beef was a little too thick. I got the Bun rieu which was missing pork blood. The soup could have been more flavorful and I wish they gave us shrimp paste. The Garlic noodles needed soy sauce as it needed more seasoning, but there was a lot of garlic flavor. The roommate had the Pho and he said it was bland.\n\nA very mediocre meal. I'd look elsewhere to satisfy your Vietnamese food cravings.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-30", "description": "I really like their food, but try not to order it online because 8 out of 10 times they don't get the order for some reason.", "author": "Claire W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "One of my favorite restaurants in the Bay Area. Service is wonderful and it makes me feel like I am in Hong Kong. The menu consists of Chinese and Vietnamese food. \n\nCame here for breakfast and ordered many plates of ox-tongue pastries, chinese fried doughnut, porridge, and other food. \n\nCant believe they sell fresh ox tongue pastries and chinese fried doughnut. Get them right after they come out because they go out fast! Have never tried such fresh fried chinese doughnuts. \n\nPorridges are delicious. It has this smooth, thick texture to it which goes really well with different ingredients. We ordered pork liver and the combination and it was terrific! \n\nVietnamese sandwhich for $4 was worth it. Tastes like actual vietnamese sandwhich because some stores gives you American ham instead of the Vietnamese ham.\n\nReally recommend you guys to try it out! Great service, great food, happy customer.\n\n*Tip: Fresh hot soy milk is best with ox-tongue pastry. Dipped or separate.", "author": "Kia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "Tried the bun bo hue here twice and the vermicelli here once. Both were pretty meh. BBH was not really flavorful. \n\nThe chinese donut here was really good and I've still yet to try the porridge.", "author": "Courtney Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "Was not impressed by the food at all, but the fish porridge was a 5. A bit expensive for jook but worth it. It's on the thick side do you can dilute with a little hot water. I went back and bought it 4 times in 2 weeks for someone in the hospital. Tried both kinds of fried dough and threw out both times. First time tasted stale and too oily. Second time, same. The fish was so tender and sweet but don't know what kind it is. May try the pork with pay don next time.", "author": "jane f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Porridge and Chinese donuts are prime and the newest item Laksa Vermicelli is rich and hardy. Absolutely amazing place you have to try if you are in the area.", "author": "Brendan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "1st time trying this place. Ordered the \"Saigon seafood chow fun\" and it came with literally one piece of shrimp. Wow. $10 for 80% noodle, one piece of shrimp and fish balls. Never again.", "author": "U L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "We had a great meal here!  My wife and I were just walking around the area and decided to give it a shot.  The people were very friendly even before my wife started speaking Cantonese with them.  Everything we got was very fresh and flavorful, and it was a good bargain.\n\nWe'll look forward to going again.", "author": "tom b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-26", "description": "The bun bo hue is spicy as heck! I almost couldn't eat it because it gave me instant heartburn!!! Despite that, it was actually pretty tasty. I just wish they gave me more pork blood. I got like, 2 measly cubes TAI SAO!? give me more!!! \n\nVegetarian banh xeo is sort of weird. It's just packed full of lettuce, broccoli and bean sprouts. It was sort of hard to eat because everything just kept falling apart. I would pass on this and definitely wouldn't order it again. We only got it because 2 people in our party were veggie.\n\nBo tai canh (raw beef salad, or number 10 on their menu) was actually pretty fresh. It definitely needed to be sliced a bit thinner. They gave us lime which I did not like. Lemon is better on bo tai canh, come on now! I am not a noob!\n\nService was a bit off but he's an old guy so we let it slide.... Probably wouldn't have been worth all the food we ordered if we didn't have a groupon.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-21", "description": "Ordered take out. Was very disappointed. Ordered family some soup and all i got is 2 sices of meat. also i didnt get any garnishes with the 3  soups i received.  Mann dissapointed", "author": "B A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Polite people, clean, fast and fresh food, good iced coffee and tea was refreshing!\n\nI really like the spring rolls and curry!", "author": "Krys M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Great food and the people working there are all very friendly. The size of the menu is really amazing. I have tried about a couple dozen things off the menu so far and have not been disappointed.", "author": "Alexi V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "If you want authenticity this is not the restaurant for you. If you want a decent meal and you're not picky, then you'll probably be satisfied after coming to this restaurant. \n\nI ordered the bun bo hue earlier today (my first time here) and I requested it with no spicy because everyone has different levels of spicy and I like adjusting my own. The woman, who was also the chef, told me that it's not good if it's not spicy so I just ordered it with a little spicy. It came out not looking like bun bo hue usually does. \n\nFirst of all, there was no beef or pigs blood in it. Second, the red, spicy looking stuff that's supposed to be cooked into the broth was a clump of chili and lemon grass on the side of the bowl. Third, I tried some of the broth where the clump wasn't and it was straight up pho soup. I kid you not. I could tell by the spices that are only in pho soup. I grew up eating this stuff so I know the difference. \n\nOverall it wasn't bad tasting. It wasn't bland or flavorless. But I was disappointed because it is definitely NOT bun bo hue. This happens a lot of times when Chinese people who grew up in Vietnam open a Vietnamese restaurant. They may understand Vietnamese but probably grew up in very Chinese enclaves in Vietnam. Vietnamese people also have Chinese food sometimes at their restaurants but no one usually orders it because locals know what the speciality is. I should have guessed by the overwhelming pictures of their menu items on the wall and the lack of Vietnamese-ness in a restaurant that serves some Vietnamese food. At certain *really yummy* restaurants, the food speaks for itself. Locals speak for it too.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "The Vietnamese sandwiches are the best deal in town. $5.50 each with tax. 1/4 lbs of meat on a 10 inch baguette. Get #8 with the spicy pork. Really, get 2 because you'll want 1 for later and they keep pretty well.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Delicious! I've come here two times so far in the past month and am very pleased with this place. The first time we came we ordered the #6 Szechuan Chicken, #19 Crab Paste & Tomato Rice Noodle Soup, #603 Chicken Curry with French Bread, the #404  Three Color Rice Plate, and #89 Three Color Drink. Our server was very quiet and shy, but he was nice. I would really recommend the Szechuan Chicken! It has a good flavor and it comes out nice and hot. There is so much more on the menu we have yet to try. We want to come and try the Vietnamese sandwiches next time too!\n\nThe second time around, we came at a very busy time but luckily, there was still one table left for us to sit at. We had another pleasant experience of good service and great food. We ordered the #308 Rice Noodle Roll, #13 Combination Beef Noodle Soup, #18 Spicy Beef and Pork Rice Noodle Soup (Bun Bo Hue), and the #47 Beef Stew Rice Plate. The soup for the noodle soups were both cooked to perfection. The Beef Stew sauce was also flavorful and the beef was braised to a good chewy texture.  The Rice Noodle Roll was my absolute favorite of today's meal because it was not only unique but also masterfully made, and of course, tasty. \n\nWe forgot to try the Vietnamese sandwiches again so we are definitely coming back soon!", "author": "Regina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-28", "description": "I live right next door. I really want to like this place. Sadly, I  wouldn't feed this food to my dog. I got three things, i threw every item away after taking one bite/sip. This place is really bad.", "author": "dylan n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-05", "description": "I wanted to try this place because a few of my friends recommended it to me.\n\nI ordered the combination beef noodle soup and my friend ordered the garlic noodles with the five spice chicken.\n\nNoodle soup -- The soup itself was pretty good. This place also uses the thicker noodles, like Quan Ngon, which is located lower down on Noriega. They definitely skimped on the amount of meat they gave me, and the quality of the meat definitely did not make up for the lack in quantity. \n\nGarlic noodles -- The noodles were super bland! On top of that, we could barely taste the garlic at all! My friend didn't complain about the chicken, so I guess it was okay.\n\nWe barely even finished half of our food. I will not be coming back here again. :(", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-01", "description": "Came in on a cold day wanting to try this place instead of just going to the same places all the time. The place was fairly empty, only one other table when we sat down and another 3 tables when we were done.\n\nThey got our orders very quickly, too quickly. The tea was hotter than the soup, the soup wasn't even hot enough to cook the onions. And as the other people were saying the amount of meat that each bowl has is very small. They are charging around $9 a bowl and still maybe an ounce total.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "This is my second visit here.  The last time I was here, I ordered the Banh xeo, and 5 spice chicken noodle soup.  It was okay, not the best I have ever had.  Today, I tried their grilled pork sandwich with paté.  I did not taste any paté.  The pork in the sandwich, was also- just okay.  i also Iordered the Banh cuon, and sautéed chicken with lemongrass.  Both were mediocre.", "author": "Robin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-09", "description": "The noodle soups are okay and the pork spring rolls are meh. Nothing terrible stood out, but I wouldn't necessarily say it was good. The Banh Mis are decent though - those are probably the only things I would get again here.", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-18", "description": "Terrible Service & Food.\n\nI had to ask for hot water. Waitress gave me hot tea instead. Order R3 rice plate which consisted Grilled Pork and fried Imperial Roll. Grilled Pork was like warm not fresh and the Imperial Roll was oiled soaked-indicating cook was using dirty oil. \n Owner Cashier tried to cheat me $ 1 in change.\n\n\nLeft no tip ... NEVER coming back.", "author": "Food Sage W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-06", "description": "I ordered the curry chicken pho and it and was decent. It had the spicy sign next to it on the menu but it wasn't spicy at all. My friend ordered pho and asked for the thin small noodles (she wanted vermicelli) but all the noodles came out the same. They were the kind of thick flat noodle, but it was still good. Unfortunately I found a hair in my food... But the people I came with say they come here all the time and it has never happened to them. Decent food, dunno if I'd come back though lol", "author": "Cassie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "This place has got IT. Im not sure what IT is - but this place is cool. The food will not bolster your foody cred but it will not leave you hungry either. This is the kind of spot that makes me really happy to live in this neighborhood.", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "This is by far my favorite pho place. I get the vegetarian bowl and shrimp spring rolls. I come by a minimum of once a week. I'm not sure what it is but the broth tastes a million times better than Kevin's. \n\nAs for service come on guys it's a small Vietnamese restaurant with a slight language barrier not a five star and honestly these are my favorite places. They have wi fi, hard working and the food is fantastic in my opinion. I get in and out within 45 min so I am never waiting too long for my food. And what is nice is he remembered me after my first couple visits and memorized my order! I appreciate his effort to know his customers faces. \n\nI believe they started closing on Thursdays. But besides that they are open until 10 which is perfect for me. I highly recommend trying this place. And definitely try the vegetarian pho! You will not be disappointed whatsoever!", "author": "Erica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-19", "description": "Mediocre at best\nQuality low\nPortion ok\nService bad.. No water after gone for example", "author": "David H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-05", "description": "This is a small, casual restaurant serving Vietnamese food. The vegetable spring rolls are crisp & tasty, but that was the only positive thing. Even though I ordered a spicy Vietnamese dish, it wasn't. My friends also complained about the blandness of their meals.", "author": "Barbara H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-29", "description": "I would not go out of my way to come here. The pho just lacked taste from what I can remember. Sad to give this place a lower rating but I cannot honestly give it a higher rating due to the quality of the food. Service was decent, no rude people here.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Definitely a sweet spot to stop for lunch. Having passed by this place enough times I had to finally actually STOP and go inside. I was craving something with savory spices and I knew that this place served curry so the decision to come here was a NO BRAINER!!! Parking was a breeze because I found a parking spot right in front of the restaurant. I walked in and noticed that there were only 2 other people inside. Once I walked in I found a table and took my seat. The first thing I noticed was all the pictures on the walls of the menu items. That is ALWAYS helpful when confused about what the expected based on the listing in the menu. But, I already knew I wanted CURRY so I was able to order quickly. I also had to get a Thai Tea...I LOVE ME SOME THAI TEA!!!! As i waited for about  5 to 8 minutes for my food to be prepared I watched the latest episode of \"Who Wants to Be a Millionaire\". I haven't seen that  show in so long. When my food finally came it was delicious. The curry smelled food and tasted MARVELOUS. The french bread was also a nice touch this meal, dipping it in the sauce. The meal was a success and just as advertised. Just another sunset treat that packs a heavy PUNCH! Come check..check..check it out!!!!", "author": "Robert F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "This restaurent had a good food, but they took time so long to cook the food. I was waiting for almost  2 hrs. Service was so bad. Food is good but I will not go back to this restaurent for sure - -\"", "author": "Tharnupetch L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-15", "description": "Just going to say, this place is dec at best. I was a big fan until I got a little cultured and stepped outside the bounds of this little hole in the wall. \n\nI've had most of the soups on the menu, plus a couple other items (pork bahn mi, curried chicken with rice), and each of them serves a purpose for what I'm looking for at the time, but not really anything to write home about. The wait staff does not listen to my request for thin noodles which is very annoying. I always ask for thin glass noodles and have only been served them maybe one time out of the over 10 times I have eaten at GB. \n\nOrdered to-go last weekend and was very disappointed with my 5 spice chicken pho. The meat was questionable (brown/grayish and soggy), the noodles were (shockingly) not what I ordered, the broth seemed to be watered-down, heck, even the napkins were from McDonald's (??), not that it really matters, but a little odd. \n\nOn the other hand, dining in can be O.K.: their bahn mi is standard and therefore good in my book (it's bahn mi, can you get it wrong?), their veggies are fresh, the wait staff is pretty friendly, and they have a TV. I say venture elsewhere unless GB is super  convenient.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-28", "description": "Ehh the bun Bo hue soup is so good but today's experience killed it. I came here with my bf and the only tables they had was a large table for five or the awkward table in front for two. He decides to seat us at the awkward table and another guy who was eating by himself at the larger table. We decided to wait til another table was finished. \n\nI ordered my usual large bun Bo hue and my bowl had barely any meat. I'm aware that they usually don't give much meat per serving but this time there was only one cube of porks blood, two slices of cha lua, and two slices of beef. My bf ordered the bun rieu and found hair in it. It was difficult to flag down the older man working and when I called for him, he would ignore me on purpose. I knew he heard me cause our table was right next to the register. The other server had no emotions as well but I think he is new. Left feeling annoyed and won't be back.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "Came to Green Bamboo on a sunday evening with a friend after we finished our time at Home next door. We were starving and tired after doing our work, and she chose this place to eat at. \n\nAmbiance/ Appearance:\nI gotta say, normally, I would not choose to go into a restaurant like this. The restaurant is kind of like a hole-in-the-wall and either a hit or miss. It was kind of quiet and we were one of the only groups there. There are a lot of pictures on the wall of the menu, which is always good in my book. The restaurant did not seem particularly clean, but that's okay..\n\nService:\nThe service is great good. The man taking our order was nice. \n\nTaste: \nI ordered the garlic noodles with chicken, my friend ordered some sort of fried rice, and we shared a plate of salt and pepper chicken wings. The wings were really good; they were nice and crispy, and had a good taste to it. The garlic noodles were not what I was expecting. By that I mean, usually the garlic noodles I have had are a yellow color, but this was a brown color probably because of added soy sauce and other condiments. The chicken was good, but the dish together had some disconnect, like it just didn't seem to go together for some reason. My friend's fried rice was okay, nothing special.\n\nOverall the food was okay, nothing out of the ordinary. It was a try once kind of restaurant to me. Not too bad though if you are craving some Vietnamese-Asian food.", "author": "Vivian Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "Stopped in on a chilly morning for some soup. \n\nIt was simply, yet flavorful. VERY skimpy on the meat though. It had two small pieces of pork and that was it. We were a little disappointed in that. But thankfully it tasted good so we didn't mind too much paying for it. \n\nSmall, family run type of place, very informal.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-03", "description": "I would honestly give this place zero stars if I could. My friends and I seriously used to come here around twice a week but not so much recently. We ordered two bowls of noodle soup and a rice plate. There was a group that came after us but realized they were friends of that old man Scrooge that owns the place so our food took forever to come out. My soup didn't have a key ingredient whereas my friends soup (which was the same by the way) had it. I asked for it and Scrooge says it's in there just look for it. He even came out to inspect my bowl to see if it was there (It was not). At the end I asked him where it was and he tells me that it was in there. A word of advise, if a customer asks you for an ingredient that wasn't in the meal, just bring it. There's no point in losing business over a quarters worth of ingredients and I will he lost ours. I hate to write bad reviews but I LITERALLY am never coming here ever again. The food wasn't great but this review is mainly based on the service.", "author": "HENRY M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "The first thing you will notice if you go to Green Bamboo is the friendly and fast service. Someone came to our table within minutes with a pot of tea and to see what we wanted. We ordered the banh mi sandwiches which were really good and at a good price! I definitely recommend this restaurant.", "author": "Brendon P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-12", "description": "Back in San Francisco and I was craving some Five Spice Chicken from PPQ on Irving.  But my sister said she's found a new restaurant that not only serves up Five Spice Chicken, but garlic noodles with it!  I'm sold!\n\nHeading to Noriega Street, we walk into an almost empty restaurant on a weekday evening.  Our party of four takes up a round table and we immediately can't help but notice the cold breeze coming in from above the door.  We asked the waitress if she can close it and it makes a huge difference!\n\nA quick look at the menu, and we have three orders of #59. Garlic Noodles with Five Spice Chicken ($7.75).  It's a generous order and I ask for a take out box right away.  There's no way I'm going to finish an order for dinner!  The garlic noodles were good, but I've had better.  And the five spice chicken was only average though.\n\nWe also ordered #41. Grilled Pork and Rice Plate with Imperial Rolls ($7.50).  My mom thought she was ordering a pork chop, so she was surprised with the pork pieces present instead.  We It came with two imperial rolls in that order.  But what we all loved was the pickled cabbage that accompanied this dish.  We had to ask for extra of it.\n\nOverall, Green Bamboo was an okay experience.  It didn't live up to its hype for the garlic noodles or five spice chicken.  Oh well.", "author": "Teri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "Lots of options and pictures on walls to appeal to you.  you can probably just point to the pictures to order.\n\ngot bun rieu (tomato crab noodle soup).  it was very tasty with chunks of tomatoes, crab meatballs, and 2 cubes of pig blood.  not all vietnamese restaurant serve this soup because of a unique taste/smell, but it was yummy.\n\npeople at my table also got pho and garlic noodles, which seem quite good.\nwanted to try the banh mi, but didnt want to risk it since my favorite is this one in the TL.  maybe next time...\n\nservice was very chill and slow, probably because there were no one else in the restaurant but us.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Only two workers ... The boss and the wife, I guess.... Takes them some time to get food out to you but the tofu roll and beef bowl soup will fill your tummy up quick ...", "author": "Willie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-25", "description": "Did not even get a chance to order.  Waited about 30 min then asked if we could order and the guy waiter walked right passed us, so we waited another couple of minutes and then we walked out. Well the place looked good, lots of pictures of their food on the wall.  I guess I will not know if the food is good .", "author": "Mary B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "I actually thought this place was pretty good in spite of the low ratings. Been here a few times. I usually order the beef stew pho and fresh spring rolls which is what I usually order at Vietnamese restaurants. The portions are ample. It's a typical low key mom n pop which is where you usually find the best food. Will be back to try out some of the dishes in the pics hung up on the wall. They all look really appetizing.", "author": "p f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-16", "description": "Service: It's decent, nothing special. I had tea with the tea pot. My friend ordered a three color ice did not come with a straw. \n\nFood: The aforementioned three color ice literally came with a block of ice that was 1/3 of the cup which was just an unbreakable chunk.\n\nOrdered the large most basic beef pho. Did not have tendons (not that I mind cuz I don't like them)  Portions were skewed. Large bowl was all noodles with 1 beef ball and 4 slices of meat at best. Doesn't really justify the price.\n\nPrice: Similar to most pho resturants. About 8 bucks for a Large.\n\nTL:DR: don't expect much. Poor meat portions.", "author": "Lilian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Decided to try a new Vietnamese spot in sf with my gf! Their bun Bo hue is spicy just the way I like it ! ( new spot to grab BBH ) , sorry \" yummy yummy \" . Also try the number #308 appetizer & #93 grass jelly coconut drink !", "author": "Amai M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-13", "description": "This place is not worth to try. service is bad, food is the worst.\nI order the 5 spicy chicken noodle but the chicken tasteless.\nMy son had the sandwich. There is a little meat inside. My son said this is the smallest vietnamese sandwich he ever had.\nMy wife order a beef stew pho. The beef was bad and we told the guy. He didn't say anything but just walked away. What kind of customer service was this? We end up paid the whole thing. But will not come back again.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Best Vietnamese place we have found. Half the price of some, great food.", "author": "Chip G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "We ordered five types of food and each one of them was delicious! I recommend lemongrass chicken over rice (great mix of spices), house chicken as a side and sweet potato cake. This home-style Vietnamese has welcoming and quiet atmosphere.", "author": "K K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-09", "description": "We needed to stop at a place to use the restroom and to get a bite to eat...so my oldest son and I stepped inside.\n\nWe order the fresh lemonade and Thai ice tea.  The tea was good and refreshing.  \n\nFor the main course we ordered Garlic noodle with five spice chicken....smells yummy.  The bad news, chicken was a bit dry, but nicely flavor.  The noodles were more like chow mein with garlic...I really with it was more garlicky.\n\nHome style pork belly & preserved veggies with rice...the pork and veggies was like comfort food that I grew up with...the sauce was light and not salty at all, that goodness, since it tends to be salty.    \n\nThere is only one bathroom.  The room  has only a toilet.  Its really roomy and well lit.  When I was there, there was no seat covers, but overall, it was pretty clean.  Note the sink is NOT in the bathroom...its just outside...that took me by surprise, but its actually a good idea.  This way people can just wash their hands without tying up the bathroom.\n\nService was good, they kept the water glass filled, but I had to go up to ask for the bill and a take out box.\n\nTotal price for 2 drinks and 2 dishes....$25.00", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-19", "description": "This is Local Vietnamese Cuisine Restaurant on Noriega Street. No wait. And it seems to do a lot of TOGO orders.\n\nOur dine-in order consisted of the following:\n\n10. Viet Carppaccio (Raw Beef Salad) - Bo Tai Chanh $9.95 (2.5 of 5). We were really excited about this dish, but we were disappointed. The beef was not thinly sliced and the slices were very frozen. Well, at least, I knew it came straight from the fridge. And the fish sauce was separated from the meat. I would have preferred the fish sauce and lemon juice to be already prepared on the slices of beef.  I would skip this dish next time.\n\n19. Crab Paste & Tomato Rice Noodle Soup Large - Bun Rieu $8.50 (3 of 5). Comforting noodle soup consisting of fried tofu, crab meat balls, pork blood pudding, and rice noodle in a tomato soup base. It was a great size and good hot noodle soup for a cold day.  \n\n308. Rice Noodle Roll $7.75 - Banh Cuon (3 of 5). This was 4 rice rolls wrapped with ground pork; onion & black fungus paired with Viet pork roll slices. It comes with fish sauce for heavy dipping. We lucked out. They had to make a fresh batch of rice roll, so we got to eat it fresh made. Yummy! We rarely see this item on a menu and it was good to get it freshly made. I hope next time we go, it is fresh made again. That would be outstanding...\n\nLocal Vietnamese Cuisine Restaurant is very family-ish and homely. Most dishes look and taste home-made so it doesn't have the sophistication of high class restaurants. This is great for a casual, don't want to cook at home dinner place.", "author": "Janice T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "Great place for lunch and dinner. Items are reasonably priced and they have a wide range of variety for Vietnamese cuisine. From noodle soup to rice plates to a la carte.\n\nThe spicy beef noodle soup (bun bo hue) was good. Spicy enough for that kick you want. I've also had the grilled pork and imperial rolls vermicelli and it was delicious as well.\n\nLooking forward to trying that curry chicken. Their pictures inside the restaurant all looks very tasty. Check it out!", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "A large variety of great meals, like the beef rice plates and teriyaki chicken. The vermicelli's are delicious.The owner is very nice, superb customer service.", "author": "Murat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Chicken curry rice was on point!", "author": "Travis F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-21", "description": "Bad service (old guy) didn't take the order right..\nOrdered a beef pho... The house pho and didn't want the tendon or beef ball so he charged me a rare and well done beef add tripe..\nHe charged me $3.50 for the tripe!! That's more than the house pho!! \nWhat the pho!!!!!!! \nHe forgot my imperial rolls after repeating it back to me!!! \nWhat the pho!!!! \nNot coming back here again!!!", "author": "Lor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "I went to Fujiyama Japanese restaurant on Noreiga street and happy to find out the lady chef from Hing Lung is now working next door at this Green Bamboo restaurant, she is famous for making all types of Porridge, (kidney, liver, minced beef...) Youtiao(Chinese fried dough) is also well known to the Chinese people in San Francisco. She will definitely add business to this restaurant.", "author": "Jack W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-01", "description": "Really,really oily bun bo hue. (See picture). I dipped my spoon in  and was immediately turned off. I know to expect some, but there was almost a whole layer coating the top of the bowl when it was served. :-( It also needed a hint more of lemongrass taste. My search for a decent place for bbh in SF continues...", "author": "Neeners H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "A good place for a quick lunch bite. I noticed there quite a few high schools students there. I got today's Friday special \"Chicken noodle soup\" for $5.95.\nIt was ok and of course not as good as some other pho places. The menu on the wall had many pictures making it easy for you to choose to order. The other orders at my table were #19 Crab Paste & Tomato Rice Noodle Soup and #308 Rice Noodle Roll with ground pork & black fungus. The crab noodle was good and the rice noodle roll was the best. Thin soft and chewy. Will come back to try the Vietnamese sandwiches next time.\nI also noticed that they have coupons on restaurant.com", "author": "Viv T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "This is my spot.  My family friend's restaurant run by a awesome couple.  \nIt's a small  spot but just the way I like it.  Every time I come in, I feel like I'm at home.\nLooking at all those pictures of the different plates, dishes,  noodles always gets me hungry and wanting to try more even after I'm done.  \nThey have a huge variety for their Vietnamese cuisine as well as many other dishes including Pad Thai I believe.  They also have Vietnamese sandwiches that I still have yet to try.  \n\nMy go to every time I swing by is the chicken curry fried rice.  That's my dish.\nI'd always have to squirt a lot of the sriracha sauce on there like as if I'm detailing chocolate on a dessert, and I'm ready to indulge.  All I need at hand is a cup of iced water, and I'm good.\n\nConvenient that across the street, is a donut shop too called Twisted, and I was lucky to try some while at the restaurant since they had some.", "author": "Raymond C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Busy night at GreenBamboo. Crab fried rice tastes good and my wife has Bun Bo Hue which she said it's tasty too. The health sign posted on the wall with 96 points. Great for food establishments!  Congrats!", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "Best vietnamese sandwiches i've had so far. And yes, i've had little saigon.\n\nSoftest rice rolls i've tried, even compared to many san jose spots.\n\nCrepes are flat out amazing. Whatever they're doing, they got something going on.", "author": "Warren G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-20", "description": "The first time I came out to Green Bamboo, I didn't think they were all that bad.  Granted, I only ordered a Pho Ga with Rare Flank Steak, but it was decent enough.  Aside from the boatload of cilantro in my bowl (yes, I forgot AGAIN), I thought the broth was tasty and light.  Sadly, I've tried a couple of their other dishes since then, and I'm starting to think their pho may be the only thing worth getting.  Since their menu offered a few dishes I wanted to try, I ended up coming back a couple of times to try two of them out - the Five Spice Chicken and Garllic Noodles plate and the Pork Belly and Preserved Vegetable rice plate.  Too bad neither were very inspiring.\n\nWhile I really like the garlic noodles over at Perilla, I was hoping Green Bamboo could offer something comparable since parking here is so much more convenient.  Just looking at the noodles though, I already knew it was off.  While it tasted like garlic, the dish was more like chow mein - the noodles were dark (tossed with soy sauce it seems), included chunks of sliced red onions, and was not buttery at all.  As for the chicken, I liked the flavor and it was cooked fine, but they just didn't include much of it with the noodles.\n\nAs for the Pork Belly and Preserved Vegetable dish, I didn't expect it to be as good as the one my friend's aunt makes, but I thought it would be better than what I had.  For me, the thing I didn't like the most was the blend of spices they used.  I can't name the specific one that didn't agree with my taste buds, but it was potent enough where I couldn't taste anything else.  And even though they only gave three or four pieces of meat, it wasn't a problem.  It's not all that healthy anyways, but the belly had a weird texture to it as well.\n\nHad I written and posted this review after my first trip, I would have given them a three for their pho.  But with the other two in mind, (two and one respectively), I have to knock it down a level.  I might be okay with coming back for their pho, but I probably wouldn't go for anything else.  After all, parking around Perilla or on Irving isn't THAT bad...", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-15", "description": "So on a sunday this was the only restaurant open on Noriega. The place itself is very small and congested. The common restroom is just okay. The wash basin is outside. I got the chicken sandwich for less than $5. It was below average. The chicken tasted old and yucky so I removed the chicken patty and fed it to my dog. The rest was just the bun and some veggie. It shouldn't cost more than $3.50. The serving girl was nice and gave me bowl of water for the dog. I was sitting outside since my dog was with me. My family ate inside and some liked and some did not. Price is reasonable. Try it once if you haven't.", "author": "Manoj N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "We love this place, great food and prices. Just a tad chilly in here but it's all good", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "After a day of hiking in the redwoods, we came back to the city in search of some grub. Initially we wanted to check out 2 other restaurants but parking was a witch so we decided to try this out as suggested by the bf. None of us have been here before and we were a bit wary of the 3 stars given but I'm happy we got to try this place out.\n\nCame in on a saturday night and shared the space with a few other guests. I ordered the pho ga (chicken noodle soup), bf ordered the house special beef pho, and our friend got the crab fried rice. All were super yummy but a downside was the lack of crab in the fried rice albeit tasty. The pho ga was exactly what my body needed after hiking in the cold and the BFs broth had a nice beefy taste. \n\nHalfway through our meal, we were the only guests there which was nice but as we left, more people arrived. I kind of like that it's not epically busy but I understand business is also wanted. \n\nAll together was about $28 (not including tip) for three dishes which isn't too bad in my opinion. I did crave a coconut while there..... I wonder...\n\nA +/- would be free wifi (+) but not knowing the password(-). I probably should've asked but  I thought there would've been a sign at least. Maybe next time\n\nOverall a 3.5", "author": "Clarizeyale R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-06", "description": "I give three stars only because I did not see anything above three stars on the menu.\n\nThose items were done perfectly well. But they were still three-star items. So... no more, no less. Three shall be the number of the counting, and the number of the counting shall be three.\n\nNo problems of any kind. Just nothing too exciting in terms of the food. It's not like I got thrown off a bridge for not\nknowing the capital of Syria.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "I live about a block away from this place and haven't tried it until recently. I was somewhat skeptical since I remember seeing it on Yelp with not too high reviews. I took a walk with my roommate to a local coffee shop and on the way back we passed this place. \n\nAll of a sudden I was really craving a banh mi and decided to try this place. \nI walk in and this place is TINY but surprisingly, VERY clean and tidy. The menus are nice and clean and not sticky unlike most small asian places. There are plenty of pictures along the walls and in the menu to help you decide what you want.\nI decided to get the grilled pork banh mi and shrimp spring rolls. The service was prompt and the hostess was very attentive. The banh mi was absolutely delicious! The flavor was just soo good and the pickled radish and carrots were sooo good and went well with all the flavors. The bread was just the right amount of soft and crunchy. The spring rolls were mediocre but I only ordered that because I was craving some.\n\nAlso, I've been to Irving Cafe, which is down the street and supposedly has some of the best banh mi's in San Francisco. While I love those sandwiches, this place can definitely compete with it.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "This place should get more attention. It's truly a diamond in the rough. This is by far my favorite place to get banh xeo. It's extra crispy and jam-packed unlike other places where it's soggy with a couple pieces of shrimp and pork. I tried their pho as well as other dishes and it's all quite tasty. I also like how it's a mom-and-pop kind of place.", "author": "Elli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "They now have free wifi for customers!   Fast and reliable.\n\nVery open to customizing menu items.  My wife is gluten-free and we never have trouble here.\n\nVegetarian options that I like:\n\n* Crispy rice cakes with veggies (awesome)\n\n* Veggie soup with mung bean noodles\n\n* Tofu mushroom bamboo with clear noodles (I ask them to add broccoli)", "author": "George K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-30", "description": "Food here is mediocre. Pho definitely wasn't the best, and the bun bo hue here isn't good either. Their sandwiches are okay, but nothing to really be excited about. Bottom line is that if you're looking for pho or bun bo hue, go somewhere else because this place isn't worth it for those dishes.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-19", "description": "I ordered the 'garlic' noodle with house special chicken. However, i didn't taste any garlic if any sort. It was more rubbery but there was some unknowns in my dish. I think it was some shell of a sort? but yeah. It didn't taste as good. Also, the porportion of chicken to noodles was poor. I got a lot noodles but 5 small pieces of chicken.", "author": "Bernice L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Just ordered to-go earlier today and the man on the phone was very friendly. \n\nI ordered the rice noodle roll which was very delicious and flavorful! Plus a great sized portion. \n\nAlso ordered the curry chicken with french bread with extra bread:) good as well! Came with potatoes and onions too and chicken was moist. \n\nMy whole order came to about $18-$19 something and the food was ready in about 15 min. I would def order these again and can't wait to try the dine in experience:)", "author": "C W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "I wasn't wowed by this place, but the vietnamese sandwiches, though no Saigon Sandwich, were pretty good. The bread is nicely toasted without being cut-your-mouth toasty. I also tried the five spice chicken garlic noodles per other people's recommendations and thought they were only OK. They seemed to lack enough of the sweet garlicky taste to qualify them as decent garlic noodles. Also the noodles were a little too soft for my liking. But I'd definitely go back for the vietnamese sandwich!", "author": "Alice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "I have been here a few times.. but this review is on behalf of my family.. who. loves. this. place. so. much. \n\nIt is Chinese-Vietnamese food. Chinese people cooking Vietnamese food but keep in mind a lot of Chinese people are actually from Vietnam. So it's not fraud or anything.. if that's what you're thinking.\n\nPho is good but I wouldn't go here for pho.. if  you want pho go to Kevin's Noodle House a few blocks down (Irving) or PPQ (across the street from Kevin's also on Irving)\n\nI always get the five spice chicken rice plate or dry vermicelli noodle bowl. Very flavorfull and cooked well. The imperial rolls are nothing special but not bad. \n\nMy dad orders the fried noodles every time. And the noodles are a flat rice noodle but not as thick as a normal chow-fun at Chinese restaurants.  I really like that too. But beware, as like all other Asian cuisines, they are very greasy/oily! \n\nHope you have a great time! Service is very quick.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-04", "description": "walked in and no one acknowledged us. we sat down and had to get the waiters attention to bring us the menu. ordered our waters but never came until way after were half way done w. our food. I ordered the bun rieu, i was actually afraid to order that because not many places know how to make it. but i was really craving it, i should have trusted my instinct and no order it. the broth was very bland, and light. bun rieu is supposed to be reddish orange and full of crabby flavor. i had to add fish sauce and hot sauce myself in order for it to be edible. don't think ill be back", "author": "Siling C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "My husband came here with friends and loved it.  So he brought me here tonight. The waiter is really friendly and cool, which made us feel homey. Ordered the Tofu rolls, a soup noodle, and the fried vermicelli.  We really enjoyed all of them and finished them all! There are so many more dishes we want to come back and try... and we will!  Oh almost forget to mention the red bed drinks with coconut milk... now my favorite... wish I have a separate dessert stomach for the homemade black sesame paste ... so order to go!!!", "author": "Chung T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "This place has its perks. Definitely I liked the place. My mom and I decided to try this place because we knew the owner. I was sad my pho took longer than my mother's so I was waiting for a while. The lemon grass beef over rice was really yummy as well.\n\nI thought the food here was good. We were a bit annoyed because the waitress was pretty slow and was overwhelmed really easily. She had to do things one at a time. We waited 10 minutes for her to grab our check.\n\n3.5 stars but i'll round up. food is good. parking was easy. central location (19th and noriega). i love the menu variety, not JUST pho for once. There's curry and stir-fried vegetables! how rare. \n\nservice, decor, atmosphere okay to bland.", "author": "Josie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "OMG OMG!  I think I found one of the BEST Banh Mi's in SF!  You know you love a place when you have mad cravings for it.  :) \n\nI ordered the Roasted Pork Banh Mi and it was absolutely delicious!!  All their sandwiches come with pate and that's how I take all my Banh mi's now!  They have the BEST pickled carrots and I love how it brings out the flavors of the entire sandwich. You must try this place to see for yourself!!  \n\nGarlic noodles - mind blown!!", "author": "Alice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-01", "description": "Decent Vietnamese food. The Thai place across the street was closed so on a whim I tried it. \n\nThe only thing that was good was the shrimp pho. \n\nI was disappointed when I tilted the bottle of Sriacha (rooster sauce), and it was runny. It also didn't look like rooster sauce so I deduced they put something generic in the bottle or used a filler and not the real deal. Big no no in my book of Asian cuisine dining.", "author": "D M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-14", "description": "they have brightened up the decor and changed the menu to include more options. i had the pho tai with ho fun (flat noodles) for lunch. good broth. lots of noodles. super hot soup. \nit's too early to call it a winner, but I kind of miss the previous restaurant in this spot, bun bo hue.\nJYW says it's worth a second try to taste some other dishes.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-08", "description": "My parents are always on a Vietnamese food kick and wanted to try this restaurant out since it's so close to home.  My dad always gets beef pho and my mom got the spicy pho, me, I got the lemon grass beef over rice.  Service and food were both OK.  Other Yelpers complained about the staff but with the language barrier you gotta cut these guys some slack.  They spoke Mandarin, so it made ordering for my parents super easy.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-12", "description": "Though the restaurant has been a standout Vietnamese restaurant in a neighborhood typically characterized by its Cantonese fare, on my most recent two visits the service had become non-existent.  \nOne really shouldn't have to wait upwards of 15 minutes to have an order taken.  On my most recent visit, after the 5 minute mark and without having been served even a glass of water/tea, I simply left - the older (elderly?) cashier/waitperson could seemingly not have cared less.  Unfortunate, as the food is otherwise respectable.", "author": "Craig G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "we are big fans of this place! always consistent, the service is fast. sometimes the pork chops are too fatty or the meat is tough, but overall its pretty solid. try the lemongrass tofu or the goi.", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Amazing food, amazing service! I feel like I'm part of the family and that Psy really appreciates his customers service. I have been going for over 1 year and have never encountered any problem or slip up whatsoever.", "author": "Lionel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-31", "description": "Not-so-great Pho at this place. The broth tasted like chlorine and the noodles were made from the cheap egg material. The beef in my soup was sub-par being tough and too salty. I normally like a lot of salt, but even this was too much.\n\nAll in all, this place didn't make me happy. I came here to try a new spot since my favorite spot, Tay Gaing, is not open for lunch on Wed/Thur.", "author": "Joey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Good shrimp spring rolls and vermicelli bowl. Open late and good service. Deserves better reviews!", "author": "Ellen R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-06", "description": "Got a bowl of pho in the middle of  a Friday afternoon. The broth and meats were decent, but the noodles were not standard and not as good as the typical rice noodles but more like a chow mein noodle   -- I'm not sure what they were. \n\nMy vegetarian buddy had some sort of vegetable curry, which she said was fine.     \n\nMoral of the story is that it's safe to eat here, but you shouldn't go out of you way to do so.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "Disclaimer:  if you couldn't tell, I'm not Vietnamese.  Also never eaten in Vietnam or had home-cooked Vietnamese.\n\nI like this place.  I have never had a bad meal and quite a few good ones.  I typically get a Bun, cold noodle style, but have had many other items off the menu.  Have also ordered sandwiches to go on the weekend.  Sandwiches are pricier than other Vietnamese sandwich options but the quality of the bread and ingredients is reflected by the price.  I appreciate that everything always seems fresh and good to high quality.  My wife always has pho and always enjoys.", "author": "JC H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "The stand out dish is the garlic noodles with five spice chicken.  I like to see the tiny chunks and taste of garlic. Great chowmein type noodles. From what I read from the previous review about this dish not having butter, well at least it's more natural without butter! Skip the shrimp vermicelli because it was just too bland. I should have stuck with the five spice chicken because of the good flavor. This would be my 3rd visit to this restaurant and every time I have ordered the garlic noodles with five spice chicken. :-) Yum Eat it there tastes much better than take out.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "This has become our neighborhood go-to. I almost always get the bun bo hue (but with the pho tai meat, not the SURPRISE ORGANS cornucopia that normally comes with the bun bo hue) and they are happy to accommodate (unlike PPQ, where they literally did not understand why I wanted what I wanted and then were very unwilling to comply). Also good are the five spice chicken bahn mi and five spice chicken with garlic noodles. Can you tell I like their five spice chicken?", "author": "Jenny J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-31", "description": "Great little spot that has a decent variety of food. My husband and I had shrimp pho and the veggie roll. The pho had all the essentials, but the noodle was thicker than the standard vermicelli. The texture that it left behind was not the best, especially if you don't like gooey noodles- again if you're near and this is the only option, then it's worth the try, the place was busy enough with locals, just not the best for the texture.", "author": "Carolina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "I go to this place almost TOO often.  The veggie pan fried crepe is delicious, and the vegetable PHO is awesome.  Definitely my hangover, comfort food.  The people who run it are always friendly, and you can't beat how close it is to my place :) \nNo 5 stars because the vietnamese sandwich was just alright.  But everything else is fantastic!", "author": "Amanda E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-19", "description": "Still on the hunt for a good garlic noodle place around home when I serendipitously walked by Green Bamboo earlier this week. A friend and I both ordered a different garlic noodle so we could try what Green Bamboo had to offer. The portions were very good for what we paid for but unfortunately that was the only real positive about our dinner.\n\nThe noodles were probably overcooked, definitely not al dente. It had very poor consistency. You could see the garlic on dish but the flavor was not cooked into the food. The biggest turn-off was the amount of oil the noodles were sitting in. I was really hoping this restaurant would be my go to place for garlic noodles but alas.", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-20", "description": "Service was good. They have a huge selection of items, but the food is only ok.\n\nTheir papaya salad was pretty good.\n\nThe vermcelli with shrimp wasn't bad, but they gave me only 3 pieces of shrimp.\n\nThe fried egg rolls were ok.\n\nThe pho seemed ok enough....\n\nJust ok, but not horrible.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-17", "description": "Ordered the #23, 5 spice chicken with soup noodles. I knew I was in trouble when I took my first bite of the chicken and it was tough. My guess is that the chicken had been marinating way too long, maybe a week? I then spent the whole afternoon with a numb tongue and pounding headache from the MGG poisoning I got. OMG! I will avoid this place in the future at all cost.", "author": "K M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-26", "description": "A couple of friends and I came here because we heard that the 'Bun Bo Hue' (spicy beef noodle soup) was off the Hizzo.\n\nI gotta say, this is a pretty poor excuse for a Vietnamese restaurant.  The Bun Bo hieu was all wrong.  The noodle consistency was a bad chewy and the soup was lacking in flavor and drowned in spicy oil.  We also had the chicken wings and they were decently flavored but super oily.\n\nNot trying to be a hater here, but if you like this place then ignorance is bliss.  I sincerely mean that in a good way.  Outside of the OC and San Jose, it's rare to get good Vietnamese food that has the home-cooked love.\n\nI'd have to say pass on this one.  Which is too bad, cuz i love the ladies that work here.  Super nice, they remind me of my aunts.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "Solid food at decent prices. I ordered the garlic noodles with five spice chicken. The garlic noodles were very good and the portion was large and in charge. The chicken was a good complement to the noodles. We also ordered some rolls to start the meal and they were excellent. \n\nThey refilled our water twice during the meal, and there was plenty of free street parking on this Monday night. And if you crave dessert afterwards, there's plenty to choose from whether it be at Green Bamboo or around the area.\n\nMy tummy gives Green Bamboo...4 Stars!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Pricier than the hole in the wall Vietnamese joints I love but since I live around the corner I've been coming here all the time for to-go orders. Food is pretty good and the portions are good too. They also have an expansive menu of some of my favorite Viet dishes that you might not find elsewhere", "author": "Kim H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-04", "description": "It's a  Tuesday  evening and we're starving.  Didnt want to cook, so decided to try Green Bamboo for take out.  Well, it's definitely one and done.  First off she forgot my garlic noodle, strike one.  The crab fried rice was nowhere as good as Cha Baa.  The imperial was actually decent.  The braised catfish was way too salty, the chicken in coconut milk was too eatery, and the five spice chicken lacking flavor.  Really tried to like the place, but no go.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-27", "description": "Ordered a house special pho and it was so cold. I mean it wasn't even warm, but cold. Other reviews were right, there were barely any meat. Worst of all, they are charging $10 for cold pho. I think a $1 Shin Ramen from the Korean supermarket taste better.I prob won't go back, even if they have a 50% sale.", "author": "Steve C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "The food is really good better than other Vietnamese restaurants in the neighborhood.  It's an underrated spot in sunset.", "author": "Rose C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "It's alright. Even though I'm Asian but when you tell me it's pho I'm kind of expecting the Vietnamese noodle variety. Not the Chinese wide clear noodle. If that was the case, you should really name it soup noodle. I think that will clear up most of the confusion.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-17", "description": "I came here only to get out of the rain, and pho sounded pretty good. One, don't go to a chinese place for pho, though they claim they are a vietnamese restaurant, I have my suspicions, especially when i did not recognize anything they were saying, and my Vietnamese is not THAT bad. Their pho was bland. The broth was like chicken broth from a can, heated and served. Their noodles were soft and a little mushy. I ended up eating just the meat. I bet their other dishes are delicious, but their pho was meh, I've experienced better. \nService was just decent. They seated me, gave me an order, took my menu, gave me hot tea and soup, and left me alone. Just how a pho place should be.", "author": "lynn b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-03", "description": "Can you believe it???  I was here...eating when the Giants were playing Game 5 of the World Series.\n\nSo what do I usually do when I go to a \"new\" vietnamese joint??  Order their Bun Bo Hue of course!  Give it a try....usually for me, it speaks volumes how this dish is cooked....good broth usually means good pho broth =)\n\nSadly, it was mediocre\n\nBroth just wasn't spicy enough for this type of food.  It needs to be spicy...red soupy soup.  Lots of pig liver, pig's feet, soft pork meat, etc.\nNow I'm not saying it's bad here...it's decent...but these are the criteria I look for when i have some Bun Bo Hue =(\n\nMy friend ordered their Bun Rieu...and wow...they gave a side dish of shrimp paste....score!!!  Too bad, the broth wasn't that great as well....even after adding the whole dish of shrimp paste...the broth just wasnt...yummy enough.\n\nAside from the food, the chef is definitely a Giants' fan...he keeps running out when one of us clap or say ooooooooooooooooooooo.  =)\n\nGo Giants!!!", "author": "Dave L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "Was walking around randomly and decided to try this place with my roommates. \n\nThis place is small right off 19th and Noriega, but it is BOMB. Great Vietnamese food and closest thing to Cambodian food around Sunset district. They have pictures of the foods advertised on the walls, so you get a good understanding on what its curry, papaya salad, etc looks like. \n\nWe ordered and we waited a little while for our foods but I didn't mind. It was about 15-20 minutes. After me and my roommates got our food, we devoured it. The soup there is different. I was going for a pho type thing, but the noodle soup I ordered was amazing, regardless. \n\nThe only thing I have to say about this is that the waiter literally forgot our waters until the end of our meals -__- . 4 stars!", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-12", "description": "I have passed by Green Bamboo many times, but never considered going there until today.\n\nI like the little decorations in there and it's a very small place. Very homey and cozy, but might feel crowded if it got really busy. We went during some very slow hours, and just sat down on an open table. The table felt was sticky for some reason. It felt grimy, and I just avoided touching the table at all cost. \n\nFood-wise, this place is okay. Nothing special. The thing about their pho is that they give you other options on what type of noodle you want. The bad thing is that the noodles are all stuck together in clumps and it's very hard to eat. I was debating if I should have asked for scissors to divide the noodles.... The beef was tough, and not too great. The soup was nothing special...I've had better. On the other hand, their Grilled Pork Vermicelli was pretty good. \n\nI might go here if I had a sudden craving for the Grilled Pork Vermicelli and didn't want to go too far ... otherwise, there are other places to go to.", "author": "Bianca W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-07", "description": "The food was ok.  Too much msg .  I was so thirsty after eating the food.  The noodle soups did not have enough meat, tendon or tripe.  The soup noodle with fish in it did not have any flavor.  The rice rolls were just ok too.   I was hoping that the food was better.", "author": "J W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-20", "description": "We were attracted to the big grand opening sign (which has been there for months)! I guess this is another one of those mom and pop pho places cause there was only one waitress. She was really attentive and nice, so she gets an A+ for customer service. \n\nWhen it comes to the food, however, I was disappointed. My cousin liked her bun rieu (it was decent to me). Her hubby liked the garlic noodles with chicken (this was good, but probably had tons of butter in it). I really didn't like my pho because they serve it northern style with thick, flat noodles. The only other place where I've had it this way is at Turtle Tower. I AM NOT A FAN. It's not their fault, but a warning on the menu would have been nice. (Did I miss their caveat somewhere, Yelpers?) Really, I'd rather make the drive to Irving for a better bowl of pho.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-19", "description": "We went here because it was convenient and it was new.  There was a huge banner stating \"Grand Opening\" so we thought what the hell...let's go.  \n\nCute decor in a very simple way.  Very nice server.  \n\nFood could have been better.  While we were sitting there with menus in front of us, I quickly looked this place up on Yelp.  My fellow Yelpers weren't liking their pho too much and most people seemed to enjoy the garlic noodles.  Ok so there you go...I'm going to have me some garlic noodles.\n\nOrdered the 5 spice chicken with garlic noodles and the pork chop with garlic noodles.  Both were ok but heavy on the salt.  The garlic noodles were really garlicky (Just realize you will reek of garlic for awhile...I know I did...).  The 5 spice chicken was ok.  I think if they cooked the chicken  just a wee bit longer it would have made my meal more memorable.  The skin was too soggy for my taste.  The pork chop was also just ok.  It was heavily marinated and hence again really salty.  \n\nDowned 2 glasses of ice water and 2 pots of tea....so you can only imagine when I say salty - I mean the food was salty.\n\nWould I return? Hmmm...good question...I doubt it...", "author": "Cris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "I love eating at Green Bamboo because they have a large selection of Vietnamese dishes. I love eating their BBH on a cold SF day. And on a hot day , I prefer eating their curry chicken rice plate or pork belly rice plate. Service is great, my mom and I both enjoy eating here so much that we eventually build friendship with the owners here. Very friendly family and they make some awesome dishes ! They definitely deserve a 5 ! yay!", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-06", "description": "Hmm, food was different but good.\nservice was marginally less than ok, but not offensive. \n\nOrdered pho, but took note of their diverse menu; clay pots fried chicken and curries to name a few.\n\nPho broth was not the typical pho flavor, but enjoyable. It was saltier and more beef flavor. Meat was super tender.biggest surprise was the noodles: i've never seen pho with flat white noodles as the default. But again, still good.\n\nI'd come here again, but would probably want to try out different places first.", "author": "Trish G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-17", "description": "I'd say it's pretty hard to make Vietnamese food taste bad, but this place achieved the near-impossible.\n\nBroth was very bland. I had to ask 3 times for bean sprouts/basil/lime that all other restaurants bring out with your soup. Isn't that a standard? It wasn't even crowded. It was our group of 4 and another table of 3.\n\nMy friend who doesn't eat red meat, ordered a shrimp bún dish. They brought out bún with meat and he returned it. They ended up taking out the meat and throwing the shrimp on top because he was still finding pieces of beef in his dish while eating it.\n\nI nearly forgot to mention that they had run out of a certain type of noodle. If 80-90% of your menu requires noodles, you would think of having a ready supply at all times. Considering it was only 5pm or so, there's no excuse to have run out of noodles.\n\nBad food. Bad service. Bad management. Why would you even bother?", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "Great BBQ pork sandwiches!  I usually just call my order in and pick up, takes about 10 minutes (you should give them 15 minutes).  Douse your sandwich in siracha, and voila--enjoy.", "author": "Linda W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-06", "description": "After waiting half an hour of constantly being ignored by the waiters walking by me, they finally took my order. I was like invisible to them and i feel very irritated by the way they treat their customers.", "author": "Elvin Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-04", "description": "I wanted to try out Lanna Thai, but didn't realize they're closed from 3-5pm. It was 3:30pm so I figured I'd give Green Bamboo a try - it has a huge Grand Opening sign and I figured pho is usually a safe bet. \n\nThe restaurant is small, but cute and clean. The pho was terrible. It was honestly the worst pho I've ever had. The noodles didn't taste like they were cooked all the way through, the meat was tough and the broth was uninteresting and salty. I also ordered a Thai iced tea. Also worst Thai iced tea I've ever had in my life. I didn't think it was possible to make bad Thai iced tea, but they managed. It didn't taste much like Thai tea even though it was orange colored, instead it tasted like straight up high fructose corn syrup - probably an overdose of the mocha mix used to make it. It was so bad I only had 2 mouthfuls, got a headache and left the rest. I can't believe I paid for this meal.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "The only thing I like about this restaurant would be the bun bo hue and their dessert drinks. They give out a big glass of thai ice tea and it's perfect/ well balanced sweetness.The pho is average because the broth lacks a little bit of taste but they have really good garlic noodles. I'm very picky when I'm eating pho so the best soup noodle would be the bun bo hue. Place is owned by Chinese/Vietnamese people, the cooks used to be OG elders who cook home style but chefs have changed over the past year. I only recommend to come eating here if you're hungover from last night. =)  ENJOY", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "Checked out their Bun Bo Hue. Pretty good almost as good as my moms. Ordered pho to go for my boyfriend and the broth was flavorful. Except they use flat rice noodles that you would eat with pho ga at turtle tower. Will definitely return and order pho with thin rice noodles. So glad I found a spot that's closer to home since the spot on balboa doesn't deliver anymore.", "author": "Connie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-03", "description": "I wouldn't come back again...at least not for PHO.\n\nIt took about 20 minutes for my pho to come out with a family of 4. There was only one other family of 4 dining. I just ordered pho with rare beef and beefballs. The soup was salty yet lacking any meaty flavor; it tasted like chicken bullion cubes were tossed into water. The positive was that the rare beef was pretty tender and thicker than other restaurants.\n\nI think their rice plates are much more appetizing but when it comes to pho which is what I tend to rate Vietnamese restaurants on, this was a huge disappointment. :\\", "author": "Stacy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-19", "description": "I think this place is owned by the same Vietnamese place as the 19th and Taraval location. That being said, it is no PPQ. It's an average place with average food.\n\nI had the five spice chicken noodle soup and the five spice chicken was tasty though I have had better. The noodles in the soup aren't pho noodles, but are flat noodles. They're still tasty but it's a little disappointing. My mom had the shanghai noodles and they were average. It was a little bland and needed some sort of spice. \n\nThis place is alright, and the prices are decent (~$7-8/person). It's kind of a \"whatever\" place... not really a \"LET'S GO THERE BECAUSE IT'S SO AWESOME\" place.", "author": "Christina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "Finally! They got it DOWN!\n\nAfter my many adventures here as you can see from my 1 review and 2 updates. \nThe service yesterday MATCHED the delicious food they have! \nMaybe my reviews got through! \n\nI'm looking forward to coming back!", "author": "Tip S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "I highly recommend this place. They have a lot of food variety & all of them are pretty cheap. I got shrimp curry and it was on point ! definitely coming back next time to try their pho and other dish.  Only reason why I gave this place 4 stars is because their service is not that great. The waiter left when were not even done ordering.. Pretty rude but other than that, I think it's worth it.", "author": "Mary U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-01", "description": "I dont want to be too harsh, im not going to say too much. I just didnt like how the pho had no taste really. it was the first time i didnt finish a bowl of pho. im sorry. i really wished they would be good, i really wished they would. i was looking for a new local joint to be my new fave place. this wasnt it. \nbut the interior looks nice! very clean!", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "This restaurant just had it's \"grand opening\" a few months ago, but it really is just replacing the Vietnamese restaurant that was there before.  The menu looks like it's still the same (with the exception of slightly higher prices)and the food tastes the same as well.  That's a good thing because it's a pretty good restaurant.  I went back for the first time last night since it reopened.  I had originally wanted to try it on Monday, but it was packed and I didn't want to wait, so I ate a block away at Wonton House.\n\nI ordered #18 Bun Bo Hue(the Spicy Beef and Pork Noodle Soup) and my friend ordered the Lemongrass Chicken Over RIce.  We also got an order of the Chicken Cabbage Salad.  For drinks, I got a Red Bean Ice and he got a Mung Bean Ice.\n\nFirst off, the portions are huge!  The chicken cabbage salad was like a mountain of cabbage and chicken.  My friend commented that he thought there was too much fish sauce, but I like it that way, so it wasn't an issue for me.  The Bun Bo Hue (which is what the restaurant used to be named) was gigantic as well and chocked full of pork and  beef slices, tendons, and pig blood.  It's my first time getting that dish, so I can't really compare it to any other restaurants, but I thought it was decent.  The broth wasn't very spicy, and the chili oil seem to collect in certain areas of the soup, but I think I prefer the flavor of pho broth over it.  The meat and noodles, however, were quite yummy.\n\nI especially liked the red bean w/ coconut milk drink and I tried a sip of my friend's mung bean w/ coconut milk and it was equally delicious.  It is sweet, refreshing, and really coconut-ty.  Between the drink, the salad, and the noodle soup, I was stuffed and couldn't even finish my food.  That takes quite a lot of work because I can usually finish my portion, so that tells you how large our portions were.  My friend said that his lemongrass chicken was very good, but couldn't finish it either.  He ended up taking home what looked like half his plate.\n\nThe other thing that they have is set dinners.  The prices for these are really cheap, so you can bring a group of friends and eat at bargain prices.", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-04", "description": "I don't know if it's \"A-OK\" but just... okay. \n\nI swear that Grand Opening sign has been there forever, and even if it's just replacing the other Vietnamese place that was in its exact spot, it REALLY feels like the other place, down from the layout of the place to the menu. Then again, it could just be all in my mind.\n\nI always get the vermicelli here because that's been my go-to dish since giving up beef and making it a rare occurrence. It's pretty good. You get a large amount for the price that you pay. But then again, quantity can never beat quality.\n\nThe service could be a little bit better but personally, I've never had a problem with them. The place is on the small side, but it's never been incredibly busy, except for this one time last Sunday when I was about to go with a couple of friends, but decided not to because of the crowd.\n\nSo, if you're in the neighborhood, in the mood for Vietnamese, and don't feel like walking five blocks to Irving, this place isn't that bad. It's not great, either. Personally, if I'm craving Vietnamese, I'll go to Irving. If I'm on Noriega and crave noodles, I'll go to Lanna Thai. But if they're closed, and I don't feel like a burger, I'll go to Green Bamboo.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "The food here is really good, not exceptional but above average. The staff are nice and attentive. The mood is casual and decorative. Perfect for a quick bite.", "author": "Rudy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "pretty good..decent... it was a-ok as the 3 star yelp mark says so. \n\ni came expecting fantastic, maybe because of the automatic door and the continuous embroidered  umbrellas hanging over us. i can tell you i;ve had much better \n\ni took my mom out to this place. three colored drinks..good as usual! can't go wrong with grass jelly and red bean and ice. i got the five spiced chicken with garlic noodles. the chicken had a lot of fatty pieces which seemed like they gave us the bad pieces. the short ribs on sizzling platter that we got also had a lot of fatty pieces. wheres' the good meat, bros? even though it was flavorful, i feel that the quality should be a little better. garlic noodles..ehh..had much better noodles at craw station and the one on taraval and 19th.. \n\ni'll still give it to them that the food was sorta good. but as long as theyre giving out meat with so much fat, can't be having that.. thanks green bambooboo.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-17", "description": "This place is nearby the Bashful Bull Burger joint and I must say for Pho, this place is pricey compared to a few blocks away (Irving Street), cuz its $2-3 cheaper! It was like a ghost town when I walked in for lunch and it stayed that way while I ate. One or two locals came in, ordered and buzzed out which left me all alone. \n\nFood: Soup is bland. It almost tasted like a beef broth straight out of a can.. Fried Chicken..not bad but still bland. Need some pepper, garlic and lemon zest in it or something! \n\nService: 2 stars. Quick and to the point. I like that.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-24", "description": "The garlic chicken is delicious. I would highly recommend the spring rolls too.\n\nService isn't too swell. The place was dead and I think the waitress came over twice the entire afternoon/evening More like a mom and pop joint so everyone there is likely family. I'm sure that some family/friends came in while we were there too, since the waitress and cooks started to socialize with them. \n\nIt's fairly priced.", "author": "Pamela R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "I really like the variety and the quality of the food here.  The garlic noodles and the five spice chicken are delicious.  This is our go to place for Vietnamese take out.  However, please take note.  When ordering take out...be prepared to YELL.  There are 2 people there that answer the phone who very well should not.  They can barely speak English, and they always interject every aspect of your order with a HUH?!?  I can't stand it anymore and even had to have my husband go in and give them an ear full about customer service.  As my friend Anjelah Johnson would say,\"RUDE!\"  If you can look past that, the food is totally worth it ;-p", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-02", "description": "good & abundant food. cheap prices. These reviewers are obviously not Vietnamese.  C'mon you jackasses, it's an acquire taste.", "author": "David T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-21", "description": "I like their \"five color rice\" combination plate. Not all Vietnamese restaurants have that dish, and I enjoy it whenever I can get it.  The meats tend to be slightly overcooked, but overall not bad.  \n\nI have also tried lamb curry, which I found had a bit thicker broth and spicier too. I prefer it that way!\n\nCold spring rolls with pork are god too.  There are a lot of places that fill the rolls with rice noodles, but here the filings are mostly vegetables and the meat of your choice.\n\nSure, it's not the best place in town, but it is a decent and convenient neighborhood restaurant (although I still miss Casa Aguilar that used to be there).", "author": "To K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-05", "description": "Came here today, because Kevin's Noodle House was closed on Irving. Worst food I ever had, I got #13, combination beef. When I saw the pho, I was thinking, what the heck is this? Literally only ate couple bites n then gave it to my mom for her to finish. My dad knew the owner and they chatted for about 10 minutes after eating for 20 minutes. He can already tell by the look on my face that I hate this place. Worst $35 I've ever spent on. Kevin's Noodle House, anyone? Better than this place for sure.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "very big portions! vermicelli is legit. I wanna try the spicy soup they have there. the accept credit cards over $5.00 which is uncommon for asian places. but thats goood", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-06", "description": "came here on afternoon for lunch with my homie big boy amo.\n\n- parking was an ease.\n- seating was quick and waitress was nice.\n- homie got the bun bo hue\n- i got the #16? cooked and raw beef.\n- food came pretty quick, my bowl of pho was bland.\n- soup was not tasty, really plain and not much flavor.\n- slices of beef was ok ... not the cuts i like like other places offer.\n- spring rolls were decent. 6 pieces for damn $5.95 for that?\n- bun bo hue seemed really oily and greasy.\n- i wish the food tasted better.... i liked the ownership before this more.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "Average food.  The service was ok.  What can you expect from Chinese and Vietnamese restaurants in the city?  The food is average.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "what a great restaurant!\n\ncannot timagine why anyone would give it less than 5 stars..home cooking, perfect", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "Really nice lunch spot! Cheap and tastes really fresh. Nice ladies who work here. Try the cold vermicelli noodles. I got the pork with imperial rolls. Huge and tasty!", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-06", "description": "BEWARE MUST READ!!!   Omg!! I would have to stay that in my whole life........I would have to say this place had the worst Vietnamese food ever. We are a family of 6 and after spending a day at Pier 39 we wanted some hot soup.  PHO !!  It just sounded so nice.   We yelped some Vietnamese restaurants and this place had a 3.5 star rating. So we got into the restaurant and we ordered Pho and other Vietnamese food.  Unfortunately It was the worst Vietnamese food ever.   Don't ever go here for Pho or any other Vietnamese food.  Unfortunately i have to tell everyone that It was the worst.  We ordered it and tasted awful and they still wanted us to pay.  The pork chops were fatty and the chicken didn't even look like chicken.  It may have been a rat or mice.   I ordered the beef stew with bread and it was the most disgusting thing ever. We immediately told our server the quality of food and taste was terrible and the chef came out to our table yelling at us. I couldn't believe it.  The meal and the experience was awful.     For your health and your pocket book I wouldn't ever step foot in this place.   I'm not quite sure how long they've been in business or if it's under new management but the people who gave  this place good ratings.  You're either their family and friends giving them good ratings but I'm  being totally honest !!! We left and came to San Mateo to eat at cheesecake factory.  We just needed some assurance of quality of food and service.  Sorry about the negative review green bamboo but it really was terrible.  I hope you guys can find a real chef soon otherwise I'm not sure how long you're gonna stay in business.", "author": "John S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-09", "description": "This restaurant comes close to substituting the two other Vietnamese pho joints on Irving, but not quite on par. They have very similar dishes like the standard noodle soups, vermicelli, and rice plates. So far I've tried the butter fried chicken (personally I like the addition of the buttery flavor but I think it needs some extra kick to it like some sort of spices. A bit bland), five spice chicken with vermicelli (I prefer the five spice chicken on Irving, still good nonetheless), and spicy beef noodle soup (this was pretty good, the soup tastes different in a good way from the other local Vietnamese joints). I wouldn't mind coming back to try the other dishes though.", "author": "Shongi H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-04", "description": "I don't know why the price listed is \"$$$\", this place is pretty cheap!  This place looks like the last Bun Bo Hue place that they took over, just a different name.  But I think the bbh tastes a lot better than last time and they give a lot of stuff.  Get their coconut drink, it's fresh and great for a warm day.", "author": "Phuong H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "I know that this restaurant is replacing the one that was there previously, but from what I've heard things are pretty much the same (menu-wise). Every time I've gone in there its dead quiet, unless you get the occasional pick up or to-go orders I see. I've had pho a few other places in the city, but I genuinely do like the food here. I don't think that 6 dollars for a HUGE bowl of pho is unreasonable. In fact when it comes, I questioned if they accidentally ordered the large instead. I couldn't even fathom that. And I always have leftover (which I usually eat later the same day as the noodles start to break apart after a while.) I tried their spring rolls, and I found it to be tasty and refreshing. I loved the peanut sauce it came with. And yes, I will agree that the staff doesn't pay much attention... but I have two things that I live by when it comes to service. 1. Don't hover. I don't like the staff coming around every 5-10 minutes to check in. Just let me eat.) 2. Make sure my water is refilled. I hate having to ask for water, and I really really hate having to ask for a refill. By default, I ask for water at the beginning of my meal considering some restaurants won't give you water unless you ask. Regardless, the well done beef and raw beef pho is great. And I love that it isn't so incredibly salty (a good indicator of MSG). With all the accompaniments, I usually leave always satisfied. I will say that the little bamboo waterfall constantly going makes me have to pee all the time since its so quiet in there. But its walking distance, so thats a plus.", "author": "Jacklyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "I like and go here for bun bo hue. Just the right amount of spiciness and kick on those cold nights, hits the spot each time. Traditionally served with adds ons such as pork cake, tendons, and pork blood. Let them know if you want to opt out of anything, they will adjust the add ons.", "author": "Peachie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "There is a young lady who works here, she provides excellent and timely service and is very friendly. I went here with a couple of friends shortly after moving to the area. We were very satisfied with our food and the portion size. I got the curry tofu, it was spicy and delicious. I've ordered food to go since then and was not as pleased with it, but that could've been a fluke. All around, I would recommend this place for a reasonably priced restaurant.", "author": "L M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-21", "description": "I just picked up a to go order of pho tai (rare beef noodle soup)  ... the service was super fast.  A tiny bit pricier than some other places I've been too.  My only real complaint is that they don't give you any basil or cilantro with your soup, which was kind of disappointing.. I love the basil leaves in the soup.  I will definitely give it another try though as they just opened days ago.", "author": "Lili L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "I've only had takeout, so far, but the dishes I've had have been fantastic. Obviously a very talented chef is behind this restaurant. Complex  but delicate flavors and like the best of home cooking. Try the Clay Pot Coco Chicken - comfort food, yum..", "author": "Doug S."}
