{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Great neighborhood spot for a great price with easy parking. Portions are huge and their 3 items for $22.95 including soup and pudding can't be beat.  We ordered 2 dishes and had enough leftovers for the next evening.  If you are a student at USF, this place is a great bargain.\n\nThis is a family restaurant and you will find Chinese families here most nights.  I prefer their Beef Chow fun, braised string beans with pork and their claypot dishes with eggplant!", "author": "Erik H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "Horrible, horrible, service and sketchy tasting food.\n\nHere's the thing we ordered a clay pot beef chow fun and some squab. Basically a small bird.\n\nWe all got sick after eating here.\n\nThe squad was burnt and dry and had no flavor the beef chow fun was super oily The Clay Pot was burnt.\n\nWe even got my drink order wrong I ordered a coconut milkshake and they gave me a banana one and told me I ordered wrong and wouldn't fix it.\n\nYou have to get your own tea water and napkins and utensils, so the waitress only takes your order and brings you food and expects a big tip afterwards which is ridiculous.\n\nNever coming back here again.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-18", "description": "My family doesn't like going out on Father's Day, so we typically celebrate beforehand. Last Tuesday, June 12th, decided to grab Chinese food for dinner with my parents and the roommate. The roomie and I arrived first around 5pm and grabbed a table for four. It wasn't too hard as they had just opened and we were the first customers here.\n\nChef's Special: choice of 3 items ($22.99)\n*Chicken w/Ginger & Onion: half (+$1)\n*Beef w/Black Pepper Sauce\n*Salt & Pepper Pork Chop\n\nThey have a special where you can choose three dishes from a list for $23. Some have one or two dollar supplements, but it's it's a pretty good deal. I couldn't find most of the dishes listed above on their regular menu, but the chicken dish was $9. And looking through their menu, most things were $9+, so at $8 a dish, it isn't too bad. My favorite prep of chicken is the poached one with ginger and scallion sauce, so this was similar. Though a little dryer and needed more seasoning. The salt and pepper pork was good. But who doesn't like fried meat?! The beef was fine. Your typical black pepper stir fry with meat and some veggies. Also, I believe this menu (or maybe just dinner in general) comes with unlimited rice, so that's a perk if you are a big rice eater.\n\n*Pan Fried Pot Sticker ($5.85)\n*Bacon & Sausage w/Spareribs & Rice in Clay Pot ($6.75)\n*Pea Sprout w/Garlic Sauce ($11.95)\n*Heineken ($3.50) x3\n\nThe meal started with a complimentary soup. Very tasty and savory as I believe it was chock full of msg. (I have no issues with msg. In fact, I grew up eating it, so I don't mind it in my food at all.) My parents wanted to come here for the clay pot rice, so we got the one with pai gwut and lap cheong. I'm not a huge rice person, but I do adore a good clay pot rice. I like it when all the yummy meat juices incorporate themselves into the rice. I need a veggie with every meal and pea sprouts are one of my favorite greens. Cooked nicely with some subtle garlic flavor. The pot stickers were horrible. I'd say stay away from them at all costs. They were mushy and flavorless. Plus they didn't even give us a dipping sauce, so we had to mix our own. If you like chinese desserts, they give you a complimentary tapioca dessert.\n\nGood spot for clay pot rice. Definitely pass on the pot stickers, but everything else was A-OK.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "I have been to several Clay Pot Rice restaurants in the City Of San Francisco!!! And this was our 1st time ever that we ate some Clay Pot Rice for dinner with my family!!! Which was on a very cold Monday of February 27, 2018!!! \n\nI have never thought about going out to dinner at the Green Island Restaurant with the family!!! In the beginning we thought about going to the one at The Claypot House but ended up not going there is because we had a family friend that had told us... Go and try the Golden Island Restaurant of Geary St!!! \n\nAnd so we gave it a try just to go eat dinner at this Golden Island Restaurant just for the Clay Pot Rice!!! Which was not that bad at all and what I really like the most out of the 5 orders of Clay Pot Rice that we ordered would be the Beef & Egg wRice in Clay Pot!!! \n\nNow that we finally ate here at this Green Island Restaurant... All I can say is that this is a really good place just to have yourself some Clay Pot Rice on a day that you feel really hungry and have the cravings the Clay Pot Rice!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "There are just too many other good choices around to eat at a place that is below mediocre on a good day.  Very friendly staff and service, but the food was rather tasteless, noodles overcooked, greens limp, the pot stickers were decent though!", "author": "Kathryn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "This place is amazing! It has affordable prices, great food, and is amazing for sharing with friends. I pass by with friends anytime I'm in the neighborhood and the owners has recognized us and been super accommodating.\n\nThere is a special kinda that's three plates for $22 that are basically shareable and you get rice on the side. I highly recommend this place if you want a quick, cheap and amazing places to eat out with a group.", "author": "J G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Decent Chinese food that I remember from\nChildhood. Usual place for takeout and they are quite fast and efficient about it.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "I really wanna like this place. Good prices, solid options, but the last few times I came the food has been incredibly salty, my order has been messed up twice, and service has been pretty awful. Oh yea, and prices have steadily increased. With all the options in the area, go elsewhere.", "author": "Sammy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-04", "description": "The ambiance of this place is really nice, a homey Chinese restaurant. It's very Canto in style. They have a bunch of pho and Vietnamese options, which struck me as very interesting. \n\n- Shrimp wonton soup: I wasn't a big fan of the wontons themselves, but the broth was delicious, light, and gingery. It was perfection. \n- free range chicken porridge: this was such a big, generous bowl. The taste was really light, homey and really comforting (probably a great hangover cure)\n- bittermelon with pork ribs: I'm not a fan of bittermelon, but the way this was cooked didn't make the melon too bitter! The main problem was that there was hardly any meat on the ribs, and everything was drenched in black bean sauce\n- chicken and mushroom in claypot: I liked this quite a bit. It was heavy on the sauce, but the chicken was really tender, but maybe ate like, half a shiitake mushroom. They stuffed that pot with fried tofu (which I'm a fan of, it was delicious), but definitely seemed like a filler to avoid giving you more of the chicken and possibly mushrooms. \n\nStaff is efficient and friendly. Everything was really inexpensive as well, which is a big plus.", "author": "Ke C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Came here for a fast & yummy dinner & I was not disappointed  my family & I had soup, pot stickers, seafood fried rice & 2 clay pots of veggies with meat & seafood. We were all happy with the food & fast service. The place is simple, not fancy, but that doesn't matter because the price for all of our food was very reasonable", "author": "Ivette E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "I'm so glad I found this place!! They have really great clay pot dishes. Very crispy on the edges :D I tried the ground pork and salted fish rice clay pot. The fish was a bit too salty, but the ground pork and rice were good.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "A very decent Chinese restaurant / Canton style cafe in outer Richmond!\n\n* * * EXPERIENCE * * *\n- Very packed during dinner time.\n- Lots of options on menu. As far as I experienced they are okay with substitutions of ingredients most of the time.\n- Friendly and attentive staff.\n\n* * * FOOD * * *\nBean Curd Beef Brisket Stew Pot 枝竹牛腩煲: A-\nThis is one of my favorite dishes in general. I tried it for 2-3 times at this place, their brisket had always been very tender, which means they did spend quite a lot of time slow-cooking it. And they actually put a lot of beef brisket in the pot - high CP value! Bean curd was good too. But it's the sauce that really stood out - it completely absorbed the tasty meat sauce from beef brisket. **Note: make sure you ask for a bowl of rice too!\n\nOther dishes like stir fry veggies had also been of consistent quality. Recommend this place if you want to try some legit Canton style food!", "author": "Simon C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "I ordered ginger chicken , it tasted as little detergent on the chicken ! I won't come again anymore ! The service also bad there !", "author": "Bing L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "This is one of my favorite Chinese restaurant in town. The food is fresh at very affordable price. This restaurant is clean compared with other Chinese restaurant in SF. Customer service is great!   Regarding the bad reviews from two people only, I still like this restaurant. Go and find out yourself why I like it.", "author": "Mila N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I have been coming to this restaurant for years and I have never been disappointed. The dishes they serve are consistent in flavor no matter which day of the week unlike other restaurants. The servers are always polite and helpful. If you are looking for a new favorite place to add to your list, this will be the one.", "author": "Gail K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "We ordered 3 hot pots of rice, 2 spareribs with chicken & 1 Chinese sausages & preserved meat pot ahead of time to avoid waiting, plus ordered steam  Catfish with special sauce, tomatoes with beef chow mein, the hot pot rice was good & everything was great. I'm highly recommend.", "author": "Elson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "The new favorite go-to spot in San Francisco for some good cheap Chinese food. The prices are very reasonable and I've never had to wait for a seat although they are usually busy. \n\nThe food comes out very quickly no matter how busy they are. If you're not sure on what to order, the waitress was very nice and recommended us a dish. That dish turned out to be our favorite!  \n\nI've been here about 4 times so far since moving back to the city and each time we try to order something different. Trying over 20 different dishes, I can say that all of them were delicious and I would order them all again. My favorite is the cod/tofu clay pot. Another one of my favorites is their string bean dish. If you want a soup, my go to is their Westlake beef soup, but you can't go wrong with any of them.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Green island is the best pricepoint to quality food ive had in san francisco. The 3 for $23 deal is incredible, with a good selection, and the quantity is massive. The employees are great and it feels like a family restaurant. I love you mamasan", "author": "Sam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "The steamed veggies were old and dry and the sweet and sour pork was glazed and bright but not flavorful. It can get pretty noisy inside, but less crowded and busy after 7:30pm.", "author": "Shannon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "A friend told me this place is known for rice clay pots.  I've been here many years ago for Vietnamese food.  I must admit their rice clay pots are very tasty. They offer it in 2 different sizes and the wait is at least 20 minutes.  I would have given them 5 stars if the rice is consistently crispy. Been here a few times and the rice has only been crispy a couple of times.  I don't mind waiting longer if the result is crispier, slightly burnt rice!", "author": "Kim T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "This place was delicious and the service was prompt!  Would definitely recommend.  Lots of choices from salt and pepper crabs to curries to various clay pots.  The chicken wings were so good!  Will go back with friends again.", "author": "Pauline W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "Was going to give this 3* but they demanded to take the leftover rice back rather than let me take it with my other leftover food. I've never seen that happen before and have to ask why. Looks like they are REUSING the RICE. I'm not upset that can't take the rice. I'm horrified that they reuse it. Tip to anyone that eat here, stay away from rice dishes.", "author": "C Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-09", "description": "This used to be my fam go-to spot for Chinese and Vietnamese food. We've been coming here for over a decade and even ordered for catering for my sons 1st birthday. However, a couple months ago, my mom, son and I came here and our entree came with a cockroach roaming around. Since we were long time customers, we told the owner discreetly and she made us a new one. Minutes later, we found another cockroach under my sons high chair. By then, my mom had enough. She was so disgusted and angry, she was ready to leave. She told the owner again and the owner did nothing but apologize, but her apology was not even genuine. Owner gave us our check for the cost of full amount and continued on to act as if nothing happened. \nI was at first hesitant to write this review but after realizing their sh*tty service, I don't really regret it. After all, we've been their regular customers for over a decade but they had always treated us like complete strangers. Talk about bad customer service!", "author": "Joyce C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "Relatively acceptable home-cooked like Cantonese dishes.  You get what you pay for.  Tried their fried squabs, greasy, oversalted, average quality birds - dark meat not too livery tasting!", "author": "John L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-13", "description": "As much as I enjoy exploring (and eating) all that SF's restaurant scene has to offer, few things are quite as satisfying as discovering a Chinese restaurant that's both delicious and cheap.  Sure, I love me a good burrata and a plate of bone marrow, but feeding a table of four for less than $40 in the City?  That's just as big of a win!\n\nIn areas like the Richmond and Sunset though, the challenge is finding the champs amongst the chu-...non-champs.  Spots like Oriental Seafood, House of Pancakes, Dumpling Kitchen, and China First (before they recently raised their prices) have long been my personal favorites, but we decided to check out Green Island on the recommendation of a friend.  Can't say no to trying a potential addition to the rotation, especially when they offer three dishes for $20.99 (prices below are the listed individual prices).\n\n-- SALT & PEPPER ROCK COD...$7.50\n(http://www.yelp.com/biz_photos/green-island-restaurant-san-francisco#jWoLhRR7NdxplzZX9dSqrg)\nThe batter was nice and crunchy, but the rest of the dish fell short.  Although the fish was cooked okay, there could have been more salt and/or pepper since the dish as a whole was rather bland.\n\n-- CHICKEN WITH SALTED FISH AND TOFU CLAY POT...$7.50\n(http://www.yelp.com/biz_photos/green-island-restaurant-san-francisco#ohF9-QoaPbaR2ByZps4qIg)\nDecent, but not the best I've had.  The tofu was was soft and silky and I thought the portion was solid for the money.  However, I would have loved more of the salted fish since the flavors could have packed more of a punch.\n\n-- CHICKEN WITH GINGER AND GREEN ONION...$7.50 (half)\n(http://www.yelp.com/biz_photos/green-island-restaurant-san-francisco#ZfrcjeKqdKPy8XliS5KKIA)\nA pretty classic dish that was spot on. The chicken wasn't super meaty, but it was really tender with a natural sweetness.  There was a good amount of ginger and green onions that made the dish pretty tasty as well.\n\n-- CHINESE BROCCOLI & BEEF...$7.50\n(http://www.yelp.com/biz_photos/green-island-restaurant-san-francisco#XLi8KIm33uhj2uc96-YYbQ)\nIt's pretty comparable to other Chinese restaurants in the Sunset/Richmond, but the taste was a-okay.  At the same time though, some of the beef was a little tough and a few of the pieces of broccoli were awkwardly cut (just thick stalks).\n\nAlthough I wasn't particularly overwhelmed with what we had, I will say Green Island's menu still manages to set them apart from other Chinese restaurants in the area.  Offering a slate of both Chinese and Vietnamese dishes, they certainly offer a bit more to choose from, though I can't say just how good any of it is.\n\nIn any case, I'd come back, but I wouldn't make a point of it.  Green Island seems to be a decent option if you happen to be in the area, but despite my curiosity about their Vietnamese dishes, I'll stick to my regular rotation of cheap Chinese eats.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "The kids insisted on getting Burger King so we very reluctantly parked. Fortunately we spotted this sign next block and it saved our day! Since the kids already had their junk food and soda, we just ordered the lunch special, 3 dishes with rice, for $22. We ordered Beef with Tender Greens, Chicken with Black Bean Sauce, and Mapo Tofu. \n\nWe were first surprised by the large portion for the dishes, and then by the good taste! That the kids started eating says a lot! The beef and tofu dishes are both pretty good, not too salty. The complimentary soup and hot tea was nice. Consider that we spent almost as much at the fast food restaurant for some deep fried, ketchup flavored stuff, this place is such a bargain. Will definitely come again next time we go to the Golden Gate Park.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "A while back I came here with my auntie on our auntie and nice day out. She wanted to try because one of her client told her to come here at the food was good and the price was alright. So we came we got that right away the staff was very nice and friendly they took her order the food was really good and surprisingly really cheap he can get dinner for two people for under $15 and still be full I would definitely come back and try other stuff on their menu.", "author": "Michele T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Some of the best hot and sour soup I've had in the city. This place is great for big groups as well", "author": "mackenzie e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "Almost don't want to share this restaurant review, because I wouldn't want this place to get too packed once other people find out what a good deal it is. $22.99 for three dishes, including a huge pot of rice, house soup, and oranges to finish! The three dishes you can choose from include a variety of clay pots, vegetables, meats, and rock cod/other seafood. All the dishes were very generously portioned, and the meal could easily feed three. Very efficient service also made it great for an everyday family dinner spot.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "The food was yummy! Perfect for family dinners. Some dishes were a little salty but overall the food scores a 4/5! But...my cousin did find a piece of plastic from packaging in her soup :/\n\nCustomer service wise...I think the waitress was in a rush to go home. Since we had a family of 11, we had quite a few dishes we wanted so we wrote down all the numbers. She came to check on us and said I don't know what those numbers are. We were trying to do her a favor so she didn't have to stand and wait for us to decide but she didn't like that. She told us that what you're doing is pointless because I have to go back and find out what you want :/. Not okay. Score 3/5", "author": "Nancy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "I am a family cat, and being in a large family, I often find myself helping to choose restaurants that are good for large groups, and won't break the bank. This is where I can happily say that Green Island comes into the picture ^ ^\n\nGreen island is one of my all time favorite chinese restaurants, and for good reason! \n\nEvery dish I have ever had from here was always super flavorful and super fresh. Many chinese places go cheap and use a lot of salt to flavor their dishes, but I can taste actual natural flavor when I choose dishes from here. I especially love their sweet and sour fish! \n\nService here is also what always brings me back. The servers and workers here are always very upbeat and polite. Always prompt and making sure everything is ok. I love going to places where the workers genuinely care about their customers. \n\nEvery dinner always ends with some sweet orange slices, which is a wonderful way to finish the meal. \n\nHighly recommend checking this place out! Family favorite for many years ^ ^\n\n*Chirp!*", "author": "Jei C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "This place has cheap and decent Chinese food. I come with my mom sometimes before we do our grocery shopping. We're in and out within 45 minutes. It does get a little busy during lunch time because they have a lot of regulars who seem to come in between work. But it's still not too bad. There's never really more than a 5-10 minute wait if there is any. \n\nThere's an assortment of noodles, fried rice, and porridge here. I mean, you really can't go wrong. They also have some lunch specials which has an entree over rice. \n\nAlso, they give you soup, complimentary to your meal during lunch time. \n\nIn and out quick, cheap prices, clean, and good.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "What a wonderful gem in the city! This is my second time to this place, and both times did not disappoint. Their main specialty is claypots, specifically the kind where rice is scooped into a hot pot, and while you're enjoying the deliciousness of your chosen toppings, the rice cooks to a crispy ending treat.\n\nThis time, my bf & I ordered a tofu & fish claypot (w/o the rice), and a chinese bacon & sausage rice claypot. As an appetizer & drink, we also ordered fried tofu & hot milk tea. All were deliciously savory (except my drink of course), and I'm currently super food coma-ed. \n\nAs a plus, this is a family owned business. While eating, you can see the love between two women and a few kids running around, some trying to help. I'm still unsure of how everyone is related, but it definitely is nice to see, because I've had to live this life, and I know how hard it can be to run a family business.\n\nComing here, you will not be served in a fancy way, but if you want a homey place to eat, come here! It's pretty rare to find a restaurant that serves this type of food. I will definitely be coming back!", "author": "Linda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "I have been to this restaurant several times now and I have yet to be disappointed. I originally came here for the Chinese sausage fried rice which is excellent. Then I decided to explore other options on the menu. \nBitter melon with beef \nFive spice chicken \nPork porridge with preserved egg \nGreens with bacon and sausage \nSalt and pepper chicken \nPea sprouts with garlic \nChicken won ton soup \nChicken with ginger and green onion \nAll are tasty options ! \n\nAnd the ladies who work here are really nice!", "author": "William Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "Worst most racist restaurant I've ever been to. In a very diverse community this restaurant has many cultures trying to consume the food however I was discriminated against I assume due to my nationality. They made me get up from a table I that was completely empty & wanted me to wait to be seated. Horrible experience", "author": "Leslie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "The husband and I took some visitors from out of town here last night. They had requested \"Gringo style Chinese food that's not too spicy.\"  The husband and I was confused as to what this meant.  In any case, we came to Green Island because we thought their menu selection would accommodate the various tastes of our group. \n\nWhat we ordered: Salt & Pepper Cod, Eggplant with Tofu Claypot, Scallop Fried Rice, Sauteed Beef, along with a few beers.  The food was more than enough for the 4 of us. Everything tasted fresh, and did not leave us feeling sleepy or gross from MSG. If we were in the area, we would definitely come back.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "3.5 stars\nmom wanted to come check it out cuz auntie recently ate here w/ her friend & told her about it...clay pot rice, decent food, & \"good deal\" is key to them, lol... so, we came for a quick bite last nite after running errands & b4 rushing back to fam, who we got togo for...\n\nTHE FEEL | i think it was a pho place when i came decades ago (which they still serve)...still kinda the same vibe now...cheap chinese resto...green awning, specials on the walls & under the glass table tops... i spotted a water pitcher w/ mason jars when walking in...that's diff for this type of resto...tryna be modern...ok, i could respect that... mom also later pointed out the racks of wine bottles around...\n\nTHE VIBE CONTINUES & THE FOOD | typical chinese resto w/ extensive 8pg plastic-sleeved picture book, i mean menu...good & bad...good w/ lots of choices, sumthin' for every1...but bad cuz u dunno where to begin/look...know what i mean?!...well, im kinda used to this extreme opposite frm modern dining concepts...but still get overwhelmed...\n\non the cover page, u'll find \"$21.99 Choice of 3\"...seems like a special deal, but it's only $7.50 ea anywaz...& most other menu items are cheap...(oh, did i mention this is a cheap chinese resto? haha)...\n\nthe owner & waitress are hella serious about getting their menu back! (not cuz they had hella customers they needed it for)...kept tryna take it when i told them multiple times im gonna order more/togo later...\n\nsee my pix of:\n- Comped House Soup (broth w/ veggies & pork bone)\n- Salted Fish w/ Ground Pork w/ Rice in Clay Pot #110 ($8.25 large or $6.25 sm)...nice big piece of saltiness, mmm...some ppl called this pork style \"hash\", but it's more like a meatloaf to me...i alwaz likey cuz it reminds me of home cooking growing up...not a lot of restos have this & i usually order it when ic it... \n- Combo Tofu Clay Pot ($7.50 or 1 of 3 from $21.99 deal)...w/ chix, calamari & shrimps...\n\nToGo:\n- S&P Wings (10pcs! $7.50 or 1 of 3 from $21.99 deal)...seemed like a hot item since ppl on yelp posted pix & i saw every table ordering it...\n- Bacon & Sausage w/ Sparerib & Rice in Clay Pot #117 ($7.95 large or $5.95 sm)\n\nu also get a Comp Dessert Soup...green bean, yest... other notes: 1) too bad they use \"yellow-feathered\" lean chix for their non-fried whole chix dishes...i was gonna order Chix w/ Ginger & Onion togo, but me no likey cuz im used to reg chix... 2) they have a lot of iced drinks, which i didnt try... 3) no AMEX...\n\noverall, i agree, decent chinese food at reasonable prices...(im sure we're gonna do 1 of our future big fam dins here)... jus wish mom wasn't in her usual scarf mode...i don't feel at peace when im rushed, esp thru meals, which are important to this foodie!...", "author": "Nettie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Heard their clay rice pots were pretty good...and I was not disappointed. We got the Chinese sausage and chicken rice pot which had a pretty good amount of meat to go with the rice. The pot has definitely seen better days, but it still did its job cooking the food. It also had just the right amount of crispy rice on the bottom - not burnt either, its my favorite part! \n\nWe also ordered their 3 entree with rice and soup for $20.99...it's a pretty good deal. The portions were about average, but had good flavor. It also wasn't too oily either. Definitely an option for a lazy, I don't want to cook dinner, night..", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-01", "description": "Cantonese home cooking prepared just like grandma. Portions are adequate and the price is reasonable.  The 3 dishes for 21.99 does it! As mentioned in other reviews, get the ground pork and saltfish rice clay pot. It is a gift from my childhood! \n\nThe one minus was the fresh rock cod that we brought in for them to prepare was overcooked. They poured thin soy sauce over it which made the dish quite salty. This won't prevent us from coming again. We think it's a solid place for country cooking here in San Francisco. It won't knock your socks off but it is satisfying. We were there 4 times in August.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Must have are the salty fish pan fried, salt and pepper chicken wings, clay pot, and the A choy Malay style!!!", "author": "TERESA L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-23", "description": "We stopped by Green Island Dec 22 for lunch.  Been coming to this restaurant for many years. It appears that it has now hit the wall.  Very popular place due to reasonable prices and portion size. My issues - I had to make a quick stop in the mens room to be greeted by your friendly cockroach.. when you see one you know his family is also residing therein.  Our order included the chives dumplings.. the centers were ice cold.. like they just came from the freezer and were not pan fried long enough.  My pho broth had negative  seven -7 flavor.. I couldn't eat it.. tasted like noodles were thrown in hot water and served. Zero chicken flavor. The house chow mein saved the meal, it was tasty with many ingredients. My daughter ordered a coconut smoothie which came with dry coconut powder on the top..??  mango flavored more than coconut.. Ordered a lemonade for my son and was brought an iced tea.  When the lemonade returned it appeared just made with slices of lemon in water and a spoon to stir the undissolved sugar.  Overall Green Island starting to look long in the tooth.. needs some upgrades and better work out of the kitchen. .Giving it a star for the reasonable pricing, one star for old times .. wont be back .. too many better options.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-24", "description": "I had come here before to dine in and had a pretty good experience.  This time I needed to get some take-out to bring to Mama's house.  Ordered a chicken won ton, beef chow funa nd the house special chow mein.  The house special chow mein was supposed to have a little of everything - seafood, chicken, beef, etc.\n\nHere's the problems: no chicken meat in the chicken won ton.  Maybe it was chicken broth won ton?  Or they got my order wrong?\n\nNot much of anything in the house special chow mein.  Counted no chicken, 3 pieces of seafood, no beef, no veggies, lots of noodles.\n\nI was very disappointed.  With so many other Chinese restaurant options in the area, I won't be back for take-out.  I think when you order specific dishes (like chicken, seafood, etc) its better, but for the won ton, chow mein and chow fun they sucked.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "3 stars for decent food, not great, but not bad. Minus one star for bringing me the wrong dish. Plus one star for large portions. Did what it was supposed to do.", "author": "Jordan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-20", "description": "Absolute garbage, like the tip I left them.\n\nDon't understand how food could take so long to make which usually is a breeze at other places.\n\nFood was OKAY, I would say Mediocre... 2 stars I suppose. Service sucks, felt sorry for the other people who were waiting as well.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "Very fresh Cantonese & Taishan food!  A great variety of dishes and the chefs can customize your order (ie. One of our party of 20 does not eat garlic or onions, sad to say but the few dishes she special ordered still turned out well).  We ordered a lot of different items. I recommend the any of the noodle dishes, whether in a soup or chow mein. The sautéed pea shoots, oxtail in clay pot, fillet of fish with baby bok choy, salt $ pepper chicken wings, salted fish & chicken fried rice, clams with black bean sauce are all good. There are innovative specials posted on the walls you should check out. They even have free range chicken. The prices are quite reasonable. The service is friendly. It's good to keep track of what you order because you might need to remind the servers about what is still missing from the order. But it's not a huge deal for them to quickly make what they need to, especially for a large group. And yes, they are good for groups and families. Conducive to sharing food. Be a little patient and you will enjoy the meal. We will be sure to try more dishes next time.", "author": "Lucy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Came in on a Friday during lent which mean NO RED MEAT. Girlfriend just came outta her first Pilates class, arms weak and feelin like noodles, so naturally we sprung for Chinese food. \n\nTook advantage of the 3 item combo special - $21.99 and even a free soup that had meat in it!\n\nGot the tofu and chicken clay pot: chicken was tender and fresh. This dish far exceeded my expectations. Made me proud to be an inhabitant of Green Island. \n\nRock cod + bitter melon. Melon was fresh and the fish was perfectly cooked. Soft and saucy and a lil crispy! Perfect with the tofu to neutralize some of the bitterness. \n\nLastly, we got mustard greens in garlic sauce. Greens and garlic were surprisingly fresh! This meal was already a great value but would've had an even greater bang for our buck if we had ordered a red meat dish!\n\nWe paid $1 extra for the brown rice option. It was great that they offered this, most Chinese places don't even bother!\n\nTo top it off, they brought out a red bean dessert at the end of the meal. Not sure if that was always included or if it's cuz my girlfriend talked to them in Cantonese. Either way, this is our new go to place for Chinese comfort food. Portions are huge and prices can't be beat!!!", "author": "Aaron O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-29", "description": "The food is good, but next time hope you guys remember to put chopsticks or forks in the bag so we don't have to staring the food for 20 mins", "author": "Lidan X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "Can't give half stars -- but 3.5 STARS.\n\nIf you want CHEAP and GOOD chinese food, work this place into your dinner rotation. They have this great deal where you get to choose 3 dishes from a HUGE selection for $20.99!\nI'll reiterate it again, it's decent food, the portions are great, and the price is reasonable, but DO NOT expect great service. As others have mentioned, service is spotty, there are maybe 2-3 waitresses that work the entire room. \n\nSome of the items from the 3 for $20.99 deal we've tried:\n- Spinach with garlic: Tasty, however it left a oily slick feeling in our mouths afterwards. (I've noticed this with sauteed spinach in general from all chinese restaurants)\n- Half Chicken with Ginger & Green Onion: Really good. Tasty.\n- Beef with Pepper Sauce: Really tender pieces of beef. \n\nChef Specials:\n- Claypot with Cod Fish Fillet and Braised Tofu ($7.50): SOO GOOD!! Generous fish fillets that were not overcooked! The gravy was addictive on rice! and who doesn't love braised tofu?\n\nHonorable Mentions:\n$1.00 Lemon Ice Tea = HELL YES\nThey also served house soup and ended with watermelon for dessert.", "author": "Jenna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "I love this place it's close to my house. The people are really nice and the food comes out quick and hot. I try to stop by once a week", "author": "Travis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "My mom loves this place and since it's around the corner we always end up here for dinner when she is too lazy to cook. The food is great, but somehow they always end up getting one of our dishes wrong, but it's okay, most of the dishes are pretty good. Ordered 6 dishes and the Mongolian beef was switched to some fried fish. We ended up trying something new and it was pretty good! So it all worked out for the best. The portion size is really good and 3 dishes for $20.99 is a great deal, comes with soup, rice, and red bean soup.", "author": "Maybo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "First timer and I can honestly say that this place is truly delicious authentic Chinese food. Some place tend to over salt the dishes,  not here. Keep up the good work. I will come back for the delicious seafood chow mein and toffu hot pot. Great deal 3 plates for $23.00!!! You have to try it.", "author": "JANETTE G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-08", "description": "This used to be my favorite spot... Untill I noticed they overcharged me on my credit card. After tipping in cash they decided to write in their own tip on my receipt after I signed it.... Dishonesty gets 0 stars no matter how cheap their food is. \nSo watch your credit card statement after eating at this place.", "author": "Jaseon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Found a place i can take my family to for great rice in clay pot. The one my parents took my sisters and i  when we were young has shut down and havent found a worthy replacement until i tried here.", "author": "Calvin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "I was only introduced to this restaurant less than 4 weeks ago and already I've been back three more times and expected to return next week! \n\nI grew up living the epitome of a Chinese life for a first generation American. Born and raised in San Francisco by Chinese immigrants who raised us in Chinatown eating nothing but rice at each meal. My parents pinched their pennies often and so developed my taste for cheap food. \n\nI stopped craving Chinese food a long time ago and haven't even touched rice regularly, but coming to Green Island has revived my love for Chinese food. I first came here with my boyfriend's family because his dad is a regular and it did not disappoint! They have a dinner deal for 3 dishes for $19.99. At first, I compared it to other restaurants with similar deals, like D&A and god forbid I ever eat there again. Happily to my dismay, it was nothing close to D&A. We ordered the yellow chicken, clams, pepper steak beef, greens, and one more dish I can't remember. All dishes were very flavorful without being too powerful or salty. Though the dishes were slightly smaller than what I was expecting, still a great bang for your buck! \n\nMost yelpers have complained about the service and though I won't disagree about the slow service (they forgot one of our dishes the first time and took almost 40 minutes), the owner was apologetic and offered us a discount. She was incredibly friendly and attentive despite the restaurant being packed with another large family taking up three family tables. In my opinion, you can't really knock a place for their poor service if their food is solid. \n\nOn the other times I've come here for lunch, my boyfriend and I ordered the chicken and mushroom claypot ($6.95) and the tomato beef crispy noodles ($6.95). Both were delicious and delicious a heaping portion of noodles to protein ratio. My most recent visit was yesterday and we tried the House Special Clay Pot ($7.50 and larger than your average clay pot) and the Black Bean Rock Cod Chow Ho Fun ($7.50). The ho fun was absolutely delicious! The rock cod was probably coated with corn starch to make it more tender. The sauce was perfect! The house special clay pot includes 4 types of meat (chinese sausage, a dried fatty cut of meat, spare ribs and chicken). \n\nI'll definitely be back, as if there was any doubt from my review?", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-07", "description": "Green island is my new go to Chinese restaurant in the area. \n\nThe menu is super cheap...3 dishes for $20?  Plus soup and dessert!  The dishes aren't skimpy...3 dishes were enough to feed 4 of us hungry gals...\n\nMy faves?  The clay pots...I normally stick with the salty fish chicken eggplant one...or sometimes I'll switch out the eggplant for tofu...wifey likes the salt and pepper spareribs...the food is seasoned well and appears to be quite fresh.  I never order pot stickers at a restaurant but my sister had an odd craving for some...so what the heck...gave it a whirl.  The pot stickers were actually quite tasty...huge and perfect for dipping into some soy sauce and vinegar.  \n\nMy mom loves to order the clay pot with rice and salted fish with pork...or the one with spareribs and black bean sauce.  \n\nThe service is a little slow...but everyone that works there is super nice and friendly.  I believe they also have a vietnamese menu in case you were bummed out that the old pho place has been replaced here.  oh, and try also have a tv!  If you request to change the channel, they have no problem doing so.  \n\nCheap, tasty, Chinese food...$20?  Shoot...why not!!!", "author": "Jen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Home style Chinese cooking. There was some good specials on fish and even had warm soy milk. The 3 for $21.99 menu had a great selection from rock cod to salt pepper chicken or pork chops and Mongolian beef. Comes with rice and soup and oranges at the end. Food came out fast and was hot.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "My new place to go. I've been here before but forgot how good it was for the price! Had a seafood wonton fun soup. They have one of the better tasting wontons to go wit their soup.\n\nOh they serve you soup and dessert along with you meal!", "author": "Stanley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "Came here for lunch with family members, parking across the street at the meters was surprisingly easy on a Saturday at noon.\n\nThe first impression was decent, it's cleaner then your average Chinese restaurant in the city, the steaming hot huge bowl of pho at many tables also looked appetizing on a windy day. Service was friendly and accommodating.\n\nWe ordered 3 dishes from the 3 for $22 list, a few other dishes, clay pot rice as well as jook with fish fillet and  traditional pho. In general most of the food was pretty good except for a few misses. \n\nLiked:\nthe jook was hot and very tasty; plenty of fresh pieces of fish in generous portion of jook\nthe pho was huge with all kinds of meat and a lot of chewy rice noodles, more then enough for 8 of us to share\nclay pot rice with chicken and Chinese sausages, another good one. some of us enjoyed the crusty rice at the bottom\nSteamed chicken with ginger sauce, pretty good\n\nOK dishes :\n\nBeef with Chinese broccoli, tender beef with fresh vege, a bit too salty otherwise good\npea green, some tough stems mixed in.\nSalt and pepper prawns, good flavor but a bit over cooked\n\nBad:\n\nThe eggplant with chicken and salty fish clay pot came piping hot but soaked in a disgusting amount of grease, I can't even bring myself to try it, not good!\n\nPrice was very reasonable, for so much food it was less then $10 pp. We might come back for the jook and pho but definitely stay away from the eggplant.", "author": "Julie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "Food was great mango and watermelon juice were YUMMY I highly recommend. The parking is terrible so the earlier you go the better. Servers were nice minimal English but that's okay.", "author": "Libby D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "We had a family dinner at this place and took up half of the restaurant. The Chinese food was good, and from what I've heard, prices are cheap. We had plenty of food to eat. We had a variety of dishes: \n\n1) Combination meat and seafood appetizer \n2) Clams - Good sauce\n3) Quail - Didn't eat, but it's rare to see quail on a menu. \n4) Shark fin soup - This actually had chunks of shark fin!\n5) Peking duck - I just ate the steamed bun since I don't eat meat. From what I was told, the duck was mostly bones.\n6) Baby scallops with broccoli \n7) Walnut prawns - Good walnuts. Too much batter for the prawns. \n8) Steamed fish - Small fish, but it was cooked well. \n\nThe red bean dessert was good, but not your typical dessert. The liquid was really thin, so it was more of a hot drink than a dessert. At least it wasn't sweet! \n\nThis place has a lot of locals eating here. I saw quite a few tables ordering a claypot and green leafy veggies. \n\nParking can be challenging.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-04", "description": "Maybe it's my fault for coming here with my dad and wanting Pho at a Chinese restaurant....\nThey had commercials and ads all over the Chinese Restaurant and newspaper and that's why I wanted to come here.  \nI'm not into eating side dishes with rice so I ordered pho instead.  My dad also ordered pho but with a side of five-spiced chicken.  This place use to be a pho restaurant so I thought maybe the cook stayed and learning to cook chinese food.  Little did I know that their pho sucked! Broth was bland, rare slices of meat was nasty, noodles were over cooked and kept breaking every time i wanna take a bite.  Sriracha and hoisin sauce didn't do the trick...bummer.\n\nThe one star is for the tasty five-spiced chicken with its crispy skin and fish sauce for dipping.  Other than that, food is no bueno.", "author": "Irene L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-03", "description": "Asked for ice water and was giving a jelly jar with tap water - no ice. Stay away from the salt and peppered squid or calamari, it is horribly way too salty, coming from someone who likes bold taste, it is a red warning. The beef chow fun is not bad tho, but tasteless beef. Unreasonable price for the horrible salted and peppered squid.", "author": "Max L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-27", "description": "This place is awesome!! \n\nOpened 10am to 10 pm, the decor is nice and clean, the staff is nice and the service is pretty good.\n\nMy biggest pet peeve is cleanliness, and this place is very clean. The food is delicious, generously portioned with unbeatable prices!\n\n I had the clay pot tofu with fish and the fish was flavorful and tofu was very soft. Order the soup with crab of some sort which was also good. The onion soy sauce chicken and spinach with egg was also very well seasoned.  All The food came out piping hot.\n\nI would come here for dinner any day, over the other overly priced places in sf or San Mateo. \n\nWill return!!  Very satisfied ! :)", "author": "Steph Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "Their jook cured me of my gastroenteritis. Also, their dou miao was, on this particular night, the shade of green that inspires indulgent love.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Yummy! I came here with my grandparents when they visited. They've apparently been here a few times in the past when they've visited other family in the city--I'd never been here before but they told me it was good. And it was! The meal was started off with a house soup (wintermelon, oily but good) and ended  with DELICIOUS red bean soup.\n\nWe had the 3-dish-for-(about, I forget)20$ deal with shrimp&egg (SO SO SO SO GOOD), chicken and string beans (my favorite probably), and a chicken/seafood (which came with no seafood) clay pot. We also had a crispy fried noodle dish (always yum!) and a sweet pork chop dish (I liked it, but they thought it was a little too sweet).\n\nBasically, I'd say you can't go wrong with anything here. Tasted pretty authentic, was decently priced, and was overall yummy. I'd come here again!\n\nThe place was pretty dead at 7 on a friday night, but half an hour into the meal (fast service too!) the place was jam packed.", "author": "Katie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-11", "description": "I am glad that I found this little gem. I can't believe that this place is so close to my work and I am just now experiencing it!!! I saw pictures online from other yelpers and based on what I saw, I decided to order the Yang Chow F/R and the deep fried garlic chicken. The F/R was pretty tasting, but what has me coming back is the deep fried chicken with garlic. \n\nOMG! This is like crack chicken, it's that good! Crispy chicken drenched in a garlic scallion sauce, what more can you ask for? It's an explosion of flavors in your mouth! As good as the F/R was I recommend having this chicken with regular steamed rice. The chicken is a bit on the salty side so the steamed rice paired perfectly!\n\nI had their combination chow mein yesterday... the noodles were al dente, which is always a plus in my books! But and it's a BIG but, the noodles lacked depth. Something was missing from it, I just can't put my finger on it. Regardless, I will be back to this place for thier crispy chicken!", "author": "J T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-15", "description": "I was hoping this place was going to be decent but there were silly mistakes done by the workers that influence my review.\n\n1. they accidentally confused the sugar and salt containers and served my family the saltiest mango drinks and I got the saltiest Hong Kong milk tea ever (think milk tea powder mixed with salt water).\n2. my table had to ask a few times to finally get 3 cups of water\n3. they served us a clay pot dish that still had uncooked rice\n\nI'm sure the restaurant workers meant well but it was these simple mistakes that really put a damper on my experience at this restaurant. The food was fine but nothing honorable to mention. The dishes are pretty cheap and they come in moderate servings.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-21", "description": "My husband and I came around 2:30 on a Saturday after a couples massage in the Richmond. He wanted seafood and I wanted vegetables, so after yelping indecisively for about 10 minutes, we decided to do it the old fashioned way and go by foot.  We saw a cool French Vietnamese place on Geary and parked only to find it was closed, so lo and behold, a block later, there was Green Island. Menu looked OK, so hubby says, yelp it.\n\nTip: if you search for restaurants \"nearby\" and the one you're standing in front of doesn't come up two pages down, walk on, my friend. Walk on. Three and a half stars is enough to keep me away usually, but we were HUNGRY and I saw an elite rate it 4 stars with repeat check-ins. We went for it, and my trust has been bruised for life.  Mmmkay so here we go:\n\nSERVICE: Walked in. After standing about desperately trying to make eye contact with somebody for about a minute or so, a customer finally told us we could just sit down.  Suddenly waitress appears and points to either side of the restaurant: \"Here or here,\" she says.  Uh, ok, we went for \"here.\"\n\n~~flashback~~ *in the car*\n\nHusband:   You want asian and I really want fish, but with asian, they usually fry it, and I don't want it fried, I want it fresh.\nMe: Well, just ask them ahead of time if they fry it and if they do, tell them you want it fresh.\nHusband: OK, yeah, I guess.\n~~~~~\n\nTake one:\nHusband: I'm interested in this fish here, is it breaded and fried or is it fresh?\nWaitress: *turning around suddenly, turning back, giving the *wait* finger and walking off*\nMe: Uh...wait, what just happened?  Is she- did she just walk off?  Do you want to just leave?\nHusband: Just wait.\n\nShe walks back to the kitchen, comes back out, picks up somebody else's dish and delivers it to their table and NEVER RETURNS.\n\nNew, English-Speaking Waitress arrives: Take two:\n\nHusband: I'm interested in this fish here, is it breaded and fried or is it fresh?\nWaitress 2: Not fried, light dusting, just dusted, and then stir fried.\nHusband: Oh, ok, that sounds good.  I'll have the salt and pepper cod then.\n\nWhen the food arrives, ten and a half crispy-crunchy deep-fried fish nuggets in their glorious nakidity appear on a bald white plate with jalapeno pepper-slice hair and spring onion freckles and NOTHING ELSE.\n\n- We are never asked how the food is.\n- No water delivered.\n- Appetizer takes an inordinately long time to appear.\n\nENVIRONMENT: \nDecor: Circa 1974 pseudo-wood paneling.  Some things you'll find on the wall:  Bed Bath and Beyond style paintings of dandelions and peonies, eight-foot-long painting of ancient Chinese guys doing ancient Chinese work, various red and gold Chinese knick-knacks, and for the holidays a cute plastic evergreen wreath with a bell and some ornaments.  If you're lucky enough to head towards the bathroom, you'll see a painting of some flowers on the wall itself that looks like it belongs in a daycare with another painting kitty-corner to that of a skateboarder silhouette grabbing his board and jumping nowhere in particular (????).  \nMusic: Top-40 radio.  Heard some Lourde, Miley Cyrus, and New Direction.  \nCleanliness: On my jolly way to the bathroom, I got a gander at the kitchen.  There were at LEAST five overflowing tubs of dirty dishes sitting on the FLOOR.  This might explain the food poisoning case mentioned earlier.  Happily this happened after I ate, although ignorance would have been bliss in this case.\n\nFOOD:\nShrimp Summer Rolls: So tasty!  The thai basil inside really popped, and the sauce was delish!  Husband quote: \"I could just drink this stuff!  It's amazing!\"\n\nSalt and Pepper Cod:  See previous entry about service.  Fried, soggy, absolutely no salt or pepper anywhere at all.  Supposedly \"spicy,\" but just totally bland.  There were only 10.5 little pieces of breaded fish, and my husband mostly ate off of my dish, and didn't even finish his.  We always eat or box everything, and when asked, box was flatly refused.\n\nChicken and vegetables: (Not on the menu)  I asked Waitress #2 if there was something with a lot of vegetables and either tofu or chicken.  She said yes, with tofu.  I asked if the tofu was fried.  She said yes, so I said chicken, afraid of what I knew was coming.  Yes indeed: the gristly, stringy, tendon-laced not-sure-what-part-of-the-chicken-this came-from chicken of lower quality asian restaurants.  The \"vegetables\" were broccoli and bok choy.  The sauce was actually quite tasty and savory, and on the salty side, in a good way.  I ate the vegetables and left the meat for my husband who was desperate after the fish fiasco.  No rice came with the meal, but the portion was four times the size of my husband's.\n\nI am writing this extensive review only because I felt like the prior conversation lacked honesty and vital details that I really would have liked to know before entry.  If you're desperately hungry and not picky about cleanliness, try something other than the salt and pepper cod.", "author": "Elaine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "I love their pea sprout and deep fried chicken wings which I must order every time. The wings are always crispy outside and juicy inside. Their yellow skink chicken is good too. Their food are in the mild side which I prefer. Since it is a family business the service is a little slow but the food is well worth the money. And it's an honest restaurant and food is fresh and most affordable in town. I love to go their once in a while.", "author": "Darren Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-27", "description": "Don't order the egg rolls, they taste like it came from a frozen packet, and fried them again.., horrible!", "author": "Yodit M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Green Island restaurant is probably the best \"go to\" Chinese restaurant in the Richmond district.  Solid Jook, chow mein, chow fun, clay pot, and get this.............Vietnamese.  \n\nI usually don't like it when restaurants have more than 2 different types of ethnic foods.  If you are going to do Chinese........do Chinese.  If Vietnamese...............do Vietnamese.  They actually pulled it off here.  The only other restaurant that can actually pull this off is Darren's cafe in fisherman's wharf.\n\nThis is a type of restaurant where it is very consistent.  It's between a hole in a wall place, to a nicer type restaurant like hong kong lounge.  The price is very reasonable.  The only downfall would be it's service.   Service can be very slow and some of their employees definitely need to be in the back of the house versus in the front of the house.  If service was better, this could be a solid 5 star \"go to\" restaurant.\n\nWhat to get here?\n\nBeef Chow fun\nAny of their rice noodle dishes (singapore style, 3 deluxe style,etc)\nVegetables and chicken chow mein\nbitter melon with chicken black bean sauce(not for the faint of heart if you never had bitter melon.  This dish is an acquired taste.)\nPork spare rib, chinese sausage, preserved duck clay pot ( this is better than Thaisan cafe on Clement)", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "This is not gourmet food, nor is this a classy, swanky joint. I didn't go to the bathroom, but I imagine they would not be particularly impressive, and the tea was lukewarm. \n\nHowever, one does not come to the Green Island restaurant in order to show off a new dress, high heels, and cuff links. One comes because the food is hot, relatively tasty, and quite cheap. \n\nMy  favorite dish was the hot pot with cod and mushrooms. It was a little gloopy, but the flavor was good. \n\nTons of families chowing down---seems like a popular local joint, and I enjoyed it even though I'm not a popular local.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-20", "description": "excellent value. I enjoy the garlic eggplant rice plate with sweet and tender pork for $5.70. furthermore, they have THE BEST hot and sour soup in all the land and very good quality tea.\n\ngood flavor, wonderful textures, friendly service.", "author": "Libra J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-08", "description": "My new fave restaurant in the Richmond.  They have reasonable prices and good variety.  Note: this isn't the place to have high expectations on service or ambiance.  They offer both Chinese & Vietnamese, and the pho was surprisingly decent.  \n\nMy go to dishes are rice clay pots chinese sausage & chicken (damn good), and it isn't listed on the menu but the tomato beef curry fried noodle.  Everything I've had here has exceeded my expectations - bitter melon with fish, salted fish w/ tofu & chicken clay pot, hot ginger chicken, and the dessert offered, and warm red bean soup is pretty delicious too.  There's so much more to try, I'm particularly looking forward to ordering the bitter melon & sparerib chow fun next.  \n\nThis place is sooo good I went twice last week.  BAM!\n\np.s. Check out jason g.'s  review, spot on.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "The review from Elaine V cracked me up. If you don't have realistic expectations or know your Chinese food, perhaps head somewhere else. My Dad and I love this place. Not the best, but when you're too lazy to cook yourself, come here and be satisfied.", "author": "M-E C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Greatest place ever for chicken wings period. Add it to some curry or saucy dish snd you'll  be in heaven.", "author": "Leonard E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-24", "description": "Is chinese food, dont expect much\nusually order the rice plate with cod and green pepper over black bean sauce or the cod with golden chive over rice\noverall ok food\ncheap prices. the amount of rice they give you for plate is sometimes over kill. i usually kill it though\ntheir fish porridge is pretty damn good though\nusually gives comp soup, which isnt much. little bits of meat on the bone and some veggies\nuse to come here alot\nowner is really nice\nnot pushy at all with the check, which i like", "author": "Andi I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-30", "description": "How does this place have 4 stars??  I've seen a couple of reviews rave about the clay pots, so I tried one.  YUCK! The pork was 90% fat...am I supposed to eat that?? Really?? The Lap Chong was tasty, but the whole clay pot was just so oily from all the fat that I could barely stomach it.  I felt like I was going to have a heart attack right there.  \n\nMy friends Chow Mein was pretty good, so I added a star for that.  \n\nService was terrible.  The restaurant was empty except for one round table.  I had to walk up to the register (where the waitress was drinking her smoothie that she made) to ask for anything, but she had no trouble asking the Chinese family if they needed anything several times.  Rude.", "author": "Jessyca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "Reasonable prices, great selection and the hot & sour soup is DELISH! My only complaint about this place was that they forgot about my spring rolls, they didn't arrive until about 45 minutes after my soup. By then I was pretty much full. Also, the service staff was slow to bring us our check, take our payment etc. The huge portions make up for the mediocre customer service though. It doesn't hurt that it's only a couple of blocks away from my workplace.", "author": "Alex U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Great $21.99 3 item menu! Soup & white rice is included. I always add $1 for brown rice. Always accommodates my food allergies.", "author": "Lou F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "I was unhappy to find that the New Hoa Ky restaurant that used to be in this space was replaced by a Chinese restaurant, but since we went through the pain of looking for parking we decided to give it a try.\n\nThe menu is pretty extensive and actually has a mix of Vietnamese and Chinese food.  The cook is obviously different (my beloved beef stew is no longer as good), so we tried the Chinese dishes.\n\nThe lady who takes orders is very helpful in explaining the dishes (special sausage hot pot vs. sausage hot pot, etc. etc.)  The portions are huge and the prices are between $5 and $8.  \n\nWe had the cod and tofu hot pot, the sausage and rice hot pot (chinese sausage, bacon, pork, veggies, crusty rice at the bottom), and the salted fish and chicken fried rice (tasty, not swimming in oil).  All tasted good,I'd order them again.  This all cost about $21 (inc T&T).\n\nSo 4 stars.  This is a no-pretenses, well priced restaurant with good food and quick polite service.", "author": "Mia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-09", "description": "It must have been fate that I ended up eating here. If you've read some of my other reviews, you'd know that I am not a fan of Chinese food and only go if we're eating with my inlaws. But after driving around for 30 minutes trying to find parking in the Richmond, my husband notices the \"Grand Opening\" sign for this place and there was a parking spot right across the street. So I quickly yelp to get an idea of what kind of food is served and when I tell my husband that it's rice in clay pot, it was like fate telling us we had to try this place (my husband loves rice in clay pot). \n\nOf course we order the rice in clay pots. I got the sausage & spareribs with rice in clay pot (#113) and my husband got the salted chicken with rice in clay pot (#108). I think the best thing about the meal was that it was only $5-6 for a clay pot rice. My mother in law makes this dish for dinner and her's is waaaaaaay better. There was no flavor or anything to the dish. Like my husband repeatedly said, it was very one dimensional. The soy sauce that they give you to pour over your rice was meh. Basically watered down soy sauce so I used the soy sauce and hot sauce on the table to give the rice a kick and some actual flavor. \n\nOh, almost forgot the other best part. They gave us a slice of watermelon each for \"dessert\". Made me happy because I had been craving watermelon all day. \n\nService was ok. They took our orders right away, but we sat around and waited for our check for the longest time. Had they been busy, I would have understood, but seeing as there was no one else there but 2 other tables, I think they should have noticed us trying to get our bill for about 10 minutes. Maybe the meal was just a fluke since they're in their grand opening phase so maaaaaaybe I'll give them another chance if I start to hear better things about them.", "author": "Lang T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-05", "description": "Not bad at all! Easy to find parking, and I don't have to go to the Chinatown one. This place definitely hit the spot with their frog leg rice clay pot! I haven't tried too many things here, but the chefs know what they are doing with those yummy authentic rice clay pots! They also have this HUGE bowl of pho for around 8 bucks, not bad at all! If you are in the area and want to try something new, give green island a shot!", "author": "Sappho C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-25", "description": "I can't believe the good reviews this restaurant has gotten.  I went a couple of times with friends, not my choice of restaurant but the service IS horrible.  When we asked for anything, we were mostly ignored.  Water please, but no water after 15 minutes.  Fork please, we ran out.  Really, out of forks?  The air quality in there is horrible if you go during Monday - Friday lunch hour.  It is not only extremely hot, sometimes they have the kitchen fumes coming into the sitting area...you can literally see the smoke.  Chinese food is okay, eatable but I would not get their Vietnamese food...that is horrible.", "author": "Kris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "I was in SF for a concert with my friend and stayed over night. We went here for breakfast the next morning because I was craving congee. I ordered the persevere egg and pork congee and it was DE-LI-CIOUS! The portion was HUGE and for only $5.00 too (if I remember correctly)! \n\nThey also served this super good complimentary tea and I just can't get over how good it smells. Although I didn't get to try other things on the menu, I had a good first impression.", "author": "Holly Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "Asked for rock cod pan fried noodles got  bitter melon  pan fried noodles...told them rod cod and pointed at the menu..got rod cod with bitter melon...pointed to the menu again...got rod cod over burnt pan fried noodles...no apologies at all took ages to get ice water and tea refill!!! The plate were too salty and the staff was not friendly....they don't even smile...", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Every now and then I have lunch here. You cannot beat their lunch specials. For $5.50 I had chicken and green beans over brown rice. I was surprised at how large the plate was, more like a small platter. It was tasty and quite a deal. The cashier/server was also very polite and friendly. Love this place.", "author": "ibby m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-22", "description": "Good..  but not unusual...   Decor is acceptable for the neighborhood ( kinda as if the Millbrae that went bad if your a native) ;   Food is good..  worth the price points.. esp if your getting an oil change at the dealer across the street.    Service is prompt and may go back for our next trip to Toyota.   There are some more extreme dishes but we stuck to the honkie tonk items like Sweet/Sour Pork.. better then some; and Beef Mongolian ..  very tender and flavorful.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "Green Island replaced a Vietnamese restaurant and is now a Chinese restaurant with a few Pho dishes on its menu. I actually planned on eating at that Vietnamese restaurant and realized it changed ownership after parking, but decided to try it out anyway.\n\nWe were greeted and seated right away (probably because there were no other customers). We quickly decided on Chinese dishes over Vietnamese ones when we realized that the owners are Chinese. After placing our order, the waitress came out with two Honey Lemon drinks on the house. This drink was only okay, but offering it for free is a good way to get some customers to return. \n\nWe chose three items as part of the 3 items for $20.99 Chef's Special. The portions were huge and food was filled to the brim of the plates. We looked at each other and knew there was enough food for dinner, breakfast AND lunch for the next day, LOL. Our first dish was Pork Ribs w/String Beans, which I must say was really good. The taste was a bit on the salty side, but it balanced well with rice. The second dish we ordered was Curry Beef Stew, which had a little too much of the bell peppers (my least favorite vegetable) but tons of tendons (which I absolutely love). It was delicious! Unlike most Chinese restaurants, you can actually taste the curry. The last dish we tried was Tomato Beef. It was good, tasted like the norm with chunky pieces of tomatoes. \n\nI thought everyone was very friendly and provided decent service. They made an error on our bill but apologized immediately when we pointed it out. \n\nThis restaurant was a nice surprise and I don't mind it replacing the Vietnamese restaurant. Their dishes are very similar to the nearby D and A Cafe's, but they offer a larger variety and I feel the food tastes better as well. I'll definitely return! I even brought a to-go menu back for my parents since they only live a few blocks away.", "author": "Kygia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "I've eatten here many times and the food is always goos and consistent.  They offer a great deal where you can choose three items for around $20. You can't beat good food for a great price. I would recommend their sauteed rock cod w yellow chives.", "author": "Serene W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "My coworker was raving about their chicken wings since she is a wing FANATIC!  She came once with some friends then took me there on our lunch hour.  I have to say that what we ordered, the bitter melon dish, and the complimentary soup reminded me of some home cooking but the wings were a disappointment to me.  Don't tell her that!  My dad and brother both make amazing fried chicken so unless it's smothered in some sauce or have some kind of special seasoning in the batter, I'm not impressed.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "Good tasty food for the value. Hard to park. Service is ok... Good neighborhood restaurant. Not the cleanest-beater than typical though. Worth coming back to.", "author": "Jana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "Fantastic fresh juices; delicious clay pots; and you shouldn't miss the fried chicken. The service is excellent.", "author": "sabrina r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "I was up in the City visiting my parents and we saw a sign that said Grand Opening and decided to try out the place. We had Beef Chow Fun, Shrimp Wonton and their house special Chow Mein. The food was very tasty and fresh. Beef Chow Fun for only $5.25 and the plate was huge and absolutely delicious. Definitely coming back and tryout their Chef Special where you get 3 dishes for $20.99.", "author": "Forrest L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "One of the best values and Chinese food quality I have had to date!! Amazing - thank you! Long way from home, but worth the trip.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-21", "description": "I really like this place, but it's safe to say that I will never eat here ever again. A couple days ago I ordered their beef and broccoli, my favorite from them, and notice the sauce on the beef was chunky, like it had been left out for a minute. I didn't mind it at first, which was my biggest mistake. I ate at the restaurant around 2pm and around 6pm, my stomach started hurting a bunch. Then around 9pm, I started to realize I had food poisoning from the food I had ate earlier. Hopefully someone from Green Island reads this and tells the kitchen to examine the food more before giving it to someone. I really want to come back, but it won't be anytime soon.", "author": "Derald A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "When I lived in Hong Kong my two favorite dishes were tomato egg with beef and white fish with sweet corn sauce.  Thanks Green Island for having a tasty version of both, and being so friendly for a silly gwai mui like me.  And also, thanks for the Horlicks and Iced Milk Tea, YUM!", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "the chef here pretty much  has it down , not too salty and has the right touch....\n\nthe laap may claypot is excellent\n\nchow mai fun is good\nveggies pea sprouts  in supreme broth is good\nbraised tofu is good\nbeef tongue is good\nrock cod in black bean sauce was good\n\nthey have a special chinese menu for more homestyle\n\nthe person that takes the orders was very helpful as she told us what what was on the chinese menu.\n\nthey loose a star cuz the servers need help though, kinda clueless actually pretty  clueless\n\nother than that i will definetely be back.", "author": "DOM d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "takes forever for the food but it is cheap and decent chinese food with good portions. forget about service like any other chinese joint. i go there because i get more bang for my buck and i leave full. if you want your item a certain way tell them before because once it's out it's out, no redo's buddy. family styles the best way to go.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "Their 3 entree special for $20.99 can't be beat. Tasty and generous portions. \n\nTheir food is definitely not something anyone should be consuming regularly, as some of their dishes are pretty greasy. But its very convenient.", "author": "E. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-21", "description": "Good place to go if you want cheap Chinese food. We ordered a clay pot, beef chow fun, bitter melon with beef and a lamb stew. The chow fun was very good and so was the clay pot with chicken and mushrooms. Service is pretty slow but we just went up to the counter and asked for the check and take out box for leftovers. The only frustrating thing was that 2 dishes came out early and then there was a long wait for the other dishes. Noticed that lots of construction workers come in for lunch.", "author": "K. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "Another restaurant that has 200+ items on their menu. Best thing we had were the fried chicken wings. Not too oily & seasoned perfectly. Clay pot rice was also really flavorful. Ordered both Vietnamese & Chinese noodle soups. Broth was not hot enough but decent flavor.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "Exceeded expectations! Very good. Large portions so I suggest sharing but very reasonably priced.", "author": "Ali C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "Though I've been a Yelp member for quite some time, this will by my first posting (I usually read, not write).\n\nThis place opened last year and I've been there 5 times.  The service is great and very friendly.  My favorite thing on the menu is their clay pot.  I thought it would take long to make, but the claypots came out to our table quickly.\n\nWith my family there, we always have \"family style\" dinners after a long day in the city.  The food is tasty and my family likes their drinks (i.e. Mango shake and Milk Tea).  \n\nWe always look forward to going here when we're in the City.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-16", "description": "Asked two ice water for the kids .she never bring to us , until I ask the 2nd time . And we are the only customer inside at that time . She was coughing on the clean plates and chopsticks while she was set up other tables .finally our foods are here and she ask me if we order this dish. Man , she was the one who took our orders.", "author": "Jimmy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-15", "description": "Chicken wasn't great, liked the hk coffee tea though...", "author": "Y S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "Food was excellent! We ordered stir fry clams with black bean sauce, kung pao chicken, and string beans. I asked them to cook it without MSG (which they did) to avoid that nasty after taste. Their dishes tasted homemade and were not oily at all. I'm quite picky and healthy conscious when it comes to eating out at Chinese restaurants, they have to be authentic and contains no MSG. So if you are a semi health nut like me, I think you should give it a try and ignore the negative comments. You can't please everyone, can you?", "author": "Wine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "great chinese food - highly recommend the clay pot &  rice in clay pot. \nbest deal is chef special choice of 3 items $20.99 - great for dinner of 3 or more people", "author": "amy l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-14", "description": "This place has changed hands in the last year or so, and definitely gone down hill.  It used to be a pretty good Pho place, but now it's chinese/vietnamese, doing neither very well.  I had the lamb and bean curd sticks over rice, which consisted mainly of sawn up lamb vertebrae in a brown sauce, very little actual meat, and not very tasty.  I'd gone with 4 other coworkers for lunch, and no one was very happy with their meal, even with the lowered expectations that go along with menu items below $8.00.  We won't be back.", "author": "paul h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "This place is a Chinese/Vietnamese restaurant. Saw grand opening while I was around in Richmond so decided to give this place a try. Chinese food was pretty good because they had a variety of Chinese food choices. Their clay pot rice with salty fish was great! I didn't like salty fishes before but I think I'm starting to like it now. I haven't gotten a chance to try their Vietnamese stuff but I'm going to be back to try their Vietnamese noodle soup soon.", "author": "Jamson W."}
