{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Great spot and extremely reasonably priced with wonderful staff/owners.\n\nHighly recommend for eating there or for some good takeout in the inner sunset. The dinner combos and the udon soups are all really delicious.", "author": "Ian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "I've been eating here for years and have yet to be dissatisfied. \n\nJust had lunch here and got to tofu and veggies sauté and it was fantastic.  Very affordable and made with love.", "author": "Jourdain D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "I come back for the no-frills bibimbap in a stone bowl. It's always solid. Every time. \n\nGreat portion size for the price. Attentive service. Tucked away on Irving if you want a quiet meal, yet close enough to bars if you want a drink after.\n\nBottom line: 10/10 returned frequently", "author": "Emmeline A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "While I know this is not the most authentic or traditional Korean restaurant in town-there is something I have always liked about Hahn's. It's a quaint little place with good service and good food. Sandwiches are good and jalapeno poppers are great", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-29", "description": "Used to go here long time ago. Stop by recently for the beef ribs and stuff mushrooms.. mushrooms was great..love it.. but the beef rib was too tender. Meat just fell off the bone. Not much of chewing required.  Looks like they boiled the ribs first than light grill.", "author": "dave w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Nice staff, great location walking distance from UCSF.\nClean and tasteful atmosphere. Delicious yummy food", "author": "Tara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Such great food for the price!! Ordered the sizzling bi him bop, veggie potstickers (homemade) and tofu and veggies sautéed. To start the rice\nTea was a lovely refresher and the root beer was simple and old school(from bottle). I've been coming here since I was a child and they've always been consistently good.", "author": "Captain Muffin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "The first time babe brought me here.. hands down! This place is bomb! \nI always order the lunch/dinner special with your choice of meat. I love pork and their BBQ pork is amazing. I like how it also comes with tempura, pot stickers, amd salad for only  $10. \nI've been going here for a year and I've finally tried their ribs. Even better. \nTheir customer service is great at both locations in Polk and sunset. Food is always served right away as well. \nWill always come back here for more", "author": "Michelle O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "I don't understand why this place only has 3.5 stars. This is legit one of my favorite places in sf. I love the mushroom tempura. It's not super oily like others. And the mushrooms are cooked, but not soggy. That a difficult feat. Also, the dipping sauce is amazinggggggg! It's like the perfect balance of sweet and salty and it's also really light. I would buy a bottle of this for home if they sold it. It's really perfect for all dumplings and dippable foods.\n\nTheir lunch specials are also really worth it. Potstickers are yummy and tempura crisp. Chicken teriyaki has a lovely sauce. \n\nCustomer service is always top notch. The lady who works here is super attentive and great with substitutions!", "author": "Mallory L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Great barbecue flavor and great prices. Their staff is friendly and this place makes a lovely spicy sauce for their BBQ. Their space is relaxing and clean.", "author": "Tracey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Best bibimbop in sf. Best kimchi. Never dissatisfied. The owner is so nice. Her name is Ohio. We have been going there for ten years", "author": "Ron H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "Good food.\nCozy.\nBBbomp, shrimp yummy\nChicken and shrimp  kabob. Lovely\nTofu soup. Lovely", "author": "Mary N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "We tried this out on a whim, given the recent number of stellar reviews. We decided to order takeout, and it was ready within 15 minutes. Awesome! \nIt definitely delivered, with copious amounts of beef on the plates that were easily enough for 2+ meals. The fresh/veggie ingredients on the bowls were great too!", "author": "Nadia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Hahn's Hibachi is more than deserving of 5 stars. I'd give it 6 if I could. A restaurant like this embodies the Inner Sunset's spirit: welcoming, comforting, satisfying. Since my group of friends in The Bay Area consists of almost 100% men, it's always fun to come and get the Meat Mountain to split between four of us. Their ribs are SO. So. so. delicious. \n\nHighly recommend. Don't change, Hahn's!\n\nKatie", "author": "Katie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "Everyone knows Hann's Hibachi is not super traditional or authentic, but it is delicious. The grilled meats are super tender. I have also tried their hot stone bibimbap, the bowl comes out super hot ensuring some yummy crispy rice.", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "I love the small quaint atmosphere, quick and friendly service and delicious affordable food. My girlfriend and I both love it here.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Love this place! It is one of my favorite places to eat in SF! Been coming for over 10 years and it is consistently great and affordable. Get the beef and veggie stir fry, and the dressing for the salad is so good! Same owner all the years I've been coming and she knows me by my special order, even if just phoned in.", "author": "Phillip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Injustice Injustice and Injustice! 3.5 Stars? You got to be kidding me.\nThe Best Korean BBQ in SF! Bar none! Period! nuff said!\nMy regular order: Super Size Spicy BBQ Chicken with Kimchi only.\nI've been to fancy Korean Restaurant but none can compare to Hanh's quality chicken which is big pieces of chicken meat yet skinless and boneless.", "author": "Ryu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Ordered the lunch combo platter with BBQ chicken and deep fried stuffed mushrooms for appetizers. The mushrooms are basically tempura which is really delicious. I substituted my shrimp tempura with veggie tempura. I haven't been to a place that has messed up veggie tempura so far, and this place holds true to that statement. It had a good variety of veggies (I'm really picky when it comes to veggies but I was surprised that I liked all of it). Next, the potstickers were full of a flavorful filling and lightly fried for an all around great crunch. The salty had a tasty and light miso dressing that I much prefer over vinaigrette or cream dressings. Lastly, the rice and BBQ chicken were sweet and tangy, just the way I like it. Overall, I thought the meal was really solid and would definitely return for lunch since the prices were very reasonable for all the things that you got.", "author": "Edmund L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "I had a great time eating and interacting with the nice Korean lady who own the place. I missed the hours for having their combo deal, but I got the spicy chicken dish, and it came with great salad and sticky rice, and of course delicious chicken!\n\nI'll definitely go back to try the combo with shrimps and beef! Highly recommend to tryout this authentic and cozy restaurant!", "author": "Nir B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Hahn's Hibachi is a great place.  A friend called in on behalf of his wife to confirm the non-use of MSG, and she loved eating here.\n\nThe quality is good and pricing is nice, especially if you do the under $10 specials, which seems to be the best way to go.  \n\nThe big specials (i.e. Meat Mountain\", \"Double Rib\" etc.)are higher priced and portions are big, but in one breath not that much bigger considering the price tag, but also a lot bigger for one average sized person to indulge in eating without taking leftovers.\n\nIt's not your traditional Korean BBQ per se, but is really good and better service than most Korean restaurants with the \"ajumma\" lack of customer service.  Here at Hahn's it's friendly and service with a smile! \n\nThe salad dressing is great tasting as an FYI.  The sauces they use aren't overly sweet nor salty and almost are a gravy like Asian glaze that's not too thick nor watery either, so blends in perfectly with the rice.\n\nI'm from SF originally and went to Hahn's (other location) in the 80's-90's, and it's the type of place I have nostalgia for and when I visit SF it's a great destination point to eat at.  I always qualify a good restaurant with the rhetorical question... \"If I were ever to move out of the city it's located in, and were ever to return to that city, would I make a special trip and point to return to visit that restaurant?\" - - the answer here is obviously \"YES\" - - it has unique flavor and a good dining experience that is unique, not easily replicated in So Cal or even within SF n' The Bay.\n\nI forgot how good it was and is... in one of those \"you don't realize what you had, 'til it's gone\" type of deals... so coming back and revisiting the culinary delights, I'm upgrading my previous review rating here too.\n\nParking can be challenging on Irving, but the adjacent streets, if you're willing to walk a few blocks can be easy if you have good SF street smarts n' parking karma.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Yes! Yes! Yes!  I get so excited when I'm visiting SF because that means I get to have Bibimbop.  What is Bibimbop you ask?  Look at the photo I posted.   It's the best thing here but everything is good but that is the dish you need to order.  I always get a meat mountain too.  The service is great and the prices are good.  A local favorite.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "OMG I have ate at least 10 times here. The food is great and prices are reasonable. The lunch and dinner  specials are fantastic and the shrimp is the best", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "The bibimbap here is my favorite Korean dish! Even on a hot summer day, I still manage to order the chicken bibimbap in a hot clay pot. I love that the restaurant adds plenty of vegetables, and the rice is cooked to crispy perfection in the pot. Add some of the extra red sauce, and a dash of kimchi, and you've got yourself a delicious bowl of bibimbap. On cold winter days, I order a hot tofu soup because it's healthy and keeps me warm. Also, prices are very reasonable and the lady who takes orders is courteous and I always feel welcomed. This place is certainly a hidden gem!", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "I really like the spicy pork here. The owner is always quite friendly and kind. Great neighborhood spot!", "author": "Urban C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "Poor service. This lady working during the lunch hr today was sure rude. I guess that nice fat tip I left last week wasn't enough?! Anyway no greeting, no offer of tea or water, and then she sticks the bill at me the second as I finished off my last bite. (She definitely had me \"profiled\" and on her on radar for some reason.) Fine, then you gets no tip and zero future business from me and anyone who drops by!", "author": "JR K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Delicious! This place has excellent lunch specials. Wonderful and fast service. My whole family loved it, including a picky eater.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Best Kimchi I've ever had! I spoke with the owners and they make homemade kimchi for the restaurant! Great service, nice small restaurant, great bi bim bop!", "author": "Sam U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Writing this review because I'm outraged that Hahn's only has 3.5 stars! I LOVE this place. Inexpensive, delicious Korean food and incredible customer service -- what more could you ask for? My boyfriend and I used to eat here at least once a week when he lived in the Sunset, and we've paid extortionate delivery fees through various start-ups to have it at our new place. \n\nAll of the combos are great, I especially love their spicy pork, and also whole-heartedly recommend their Sizzling Bibimbap with a side of kimchi! $3.50 for an Anchor Steam, Sierra Nevada, or Sapporo and the entrees won't run you more than $11-12 at the most. \n\nIt's a few blocks up from busy 9th Ave, so there is usually seating available unlike many other restaurants in the hood. I can't help but feel like this place is overlooked by far too many. Check it out!", "author": "Anna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "The best bibimbap in town. Seriously. Get it in the sizzling pot, you won't regret it. It is mouthwatering good. I don't know how this place doesn't have a better overall rating, but their eats are delicious.", "author": "Keriann H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "I use to come here all most ever chance I get because their food is so good, the place is clean, and staff are nice and friendly. I moved away but now I back and had to come here to so if everything was the same and it is. The food is still very flavorful and the portion are still big. The place had a little makeover but still looks great and still clean still with the same friendly staff.", "author": "Michele T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "I got the Lunch Special #3, with barbecued pork, tempura shrimp, and pot stickers. Good food, healthy portions, and great price! Good, simple Korean food!", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "Came in today for lunch with my dad.  I was hoping for some soup but they didn't have anything like I wanted only noodles and tofu soup.  Dad had his tofu soup and I had the plate lunch.  Nothing like what I expected as compared to my Korean meals in Honolulu.  Looks like most of the neighborhood comes in for lunch and they aren't Asian.  They do remember their regulars.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "The year is 1978, San Francisco, working class city, no hipsters, lots of blue collar folks and neighborhoods, (\"The Mission, still belongs to the Hispanic Families that gave it its name, \"the Castro,\" and Noe Valley, still inhabited by factory workers and Irish Longshoremen and their families,  the \"influx\" just starting in full bloom,) Mayor Joe Alioto indicted for mob ties. His replacement, Mayor George Moscone, assassinated along with  Supervisor Harvey Milk by a colleague Dan White, giving rise to the \"Twinkie defense.\"  The burgeoning local LGBT community, for the most part, still oppressively closeted, erupts in rage. Gangs of all types and ethnicities rule different parts of the city, Korean Food? What the heck is that? And eat that garlicky stinky hot as hell veggie thing? hekka no! Enter Hahn's Hibachi. They did it anyway. Served up an \"exotic\" cuisine, cooking a real deal, authentic version, and hoping for an open minded response. The time is right. By quietly avoiding the big splash celebrity chef hype, providing good, solid, huge portion, reasonably priced, tasty authentic Korean BBQ all these years (since 1978) to the real, local, common folks, who know how to appreciate it, stayed the course to steady acceptance and continued success. They haven't changed a thing all these years. Take a walk back in time to a San Francisco of another era, and try the iconic original, and heartily eat the still best! (BBQ Combo plates or Rib Combo, one of a kind. Dig in dawgs. Get ur KQ on :)", "author": "George F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I write from a place of outrage--no sane human visiting this establishment could possibly conclude their review of this neighborhood landmark at anything less than five stars. Nestled amongst the fog of the Inner Sunset, its aromas wafting from the cozy interior, mingling with the warm greetings from its proprietors. \nThe food quickly follows, delivering on the promises of the before-mentioned aromas. Hearty Asian BBQ delivered with a smile satisfies the most carnivorous of appetites. Salty, savory, and tender meats dance with fresh salads, and cold beers. The sizzling bibimbap is a highlight. Don't worry about the check--Hahn's Hibachi had been delivering stunning value to Inner Sunsets residents for more than twenty years. If you break $20 on your meal, you may find you need to be wheelbarrowed out of this establishment. \nThe bottom line: This is a BBQ joint worth visiting the neighborhood for. Cozy interiors, welcoming owners, and incredible value for great food make it a city-wide standout!", "author": "Alexander K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Ordered the Bibimbap. AMAZING. So delicious and for such a great price. The other listings on the menu were not that impressive to be honest but the incredible Bibimbap is what warrants the five stars. Also, the lady who usually works here is the absolute sweetest.\n\nAffordable, great service and great food! Will definitely add Hahn's to my list of regulars.", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Very affordable compared to other Korean restaurants for dinner prices.  The portion is generous and the food is delicious!  The owner is super friendly and very attentive to our needs!", "author": "Bill L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-01", "description": "Sometimes one is not in the mood (or attire) for fancy, but comfy!! This tiny joint was just right for us after a hike through the Muir Woods. 'Not a drive-far-to-try type of destination, but a solid I'm-hungry-to-scarf-down-what's-around. Big portions. The sizzling bibimbap & bbq combo satiated our tongues & tummies.", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Tiny with wafts of Korean BBQ essence inviting you in - Hahn's Hibachi is a neighborhood spot brimming with personality.\n\nI came in here for the first time tonight and from the moment I walked in - the staff were unbelievably generous with their smiles and warmth.\n\nThe menu here is actually quite extensive and there's something for everyone if you look hard enough (I had eaten previously so stuck to some steamed vegetables).\n\nFrom hot tofu soup, to BBQ salmon and beef, to potstickers, to fried mushrooms, to combination rice plates - there's an array of options at Hahn's Hibachi. The staff are also more than willing to make adaptations depending on your eating preferences.\n\nThere was a steady stream of regulars that stopped in whether for pick-up orders or casual meals - throughout my time here. The staff welcomed each person with genuine gusto. \n\nIf you want a filling meal with some tasty protein  - whether it's tofu or meat - Hahn's Habachi is a reasonably priced option in the Inner Sunset.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "I've been here twice for lunch and both times I thoroughly enjoyed my food. I got a spicy chicken lunch combo with potstickers. \n\nThe service is very friendly 5/5\n\nThe food was all made fresh and was overall pretty tasty. 4-5/5\n\nThe price was very reasonable. 5/5\n\nI would definitely come back for a delicious cheap lunch!", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "I've been here a couple of times. I love the lunch package. I always order with Korean BBQ beef which is always soft, tender and has tasty flavor. The restaurant isn't a traditional Korean restaurant, but Asian fusion. You can see that the lunch package have shrimp tempura and dumplings which I really like about this menu.\n\nThe service is good and fast. This place is a bit small. Probably 10 tables, but nice neighborhood. It's kind of sad that they don't open for Sunday though.\n\nAlso, when it's nice whether, I'll take out the food and go to have picnic in GG Park which is walking distance from here.\n\nDefinitely recommended.", "author": "Betty O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "So much food for such a small price!\nEverything was delicious. I had the BBQ chicken dinner special and was so full. I'm excited to try other items. I wish they had soontofu.\nThe staff is very attentive and friendly.\nPlus! The location is adorable!", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-22", "description": "TL;DR no free appetizers that traditionally come with a Korean meal, and hot pot bibimbap rice was too wet to be good \n\nI fell in love with bibimbap when I was at Berkeley and ate their hot pot special every Wednesday. That's my gold standard; most places fall short. I had some excitement for this place because it seems family owned and they are Korean. The price was promising at $10.50 for the hot pot. Service was fine, what you expect at any Asian family owned restaurant. I was disappointed there were no appetizers, like bean sprouts, kimchee, cucumbers, etc. I wasn't offered any tea either. \n\nThe hot pot bibimbap came out and it was sizzling as promised. Unfortunately the rice was quite wet--maybe they put in too much water today. But because it was wet, it didn't mix well and didn't harden too easily. The ingredients were fine, broccoli instead of spinach was a curious choice. I got it with beef and there was an average portion. I harp on the lack of appetizers because I like to eat the cold dishes with the bi bim bap to even out the hot taste. As you're supposed to with this dish. \n\nOverall quite an average place, won't be returning. Still haven't found a good bi bim bap place on inner sunset (the Korean place down the street on Irving is not good for bi bim bap either, tho at least there they gave appetizers) but hope this review helped you decide.", "author": "Eddie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-18", "description": "I've eaten here off and on for many years, and it's just gotten worse and worse. The lunch I had the other day was pathetic. I got the spicy grilled chicken combo, and it was unbelievably bad. The shrimp tempura were laughable, they were so skinny it seemed like they split one shrimp lengthwise to make two pencil dick shrimps out of it, then used TONS of batter so that you're eating just fried batter. The potstickers had never seen a pot, they were deep-fried and misnamed, and the chicken sauce was so thick and goopy, with a sickly sweet spicy flavor that I swear it was 50% corn syrup, 50% Sriracha. It gummed up my mouth pretty quickly, and I couldn't finish the chicken.\n\nIt used to be decent, and maybe this was an off day, but it certainly put me off Hahn's.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-16", "description": "My friends took us here after a few hours at the zoo.  Dayam!  Serving sizes are well worth the price and delicious!  I shared the Mega Kebab plate with my teen and  my youngest ordered the chicken udon, which I helped her finish. My friends each ordered the meat platter and the spicy pork.  All excellent food and service was great.  It wasn't crowded around 5pm, but I can see this place get packed since seating is limited to about 20 people.", "author": "Jordan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "I've gone here twice now and have been totally and completely happy each time. Small and quaint little place, with nice kitchen staff and servers.\n\nThe bibimbop is wonderful but I felt like it could've used a bit more meat and kick to it (lacked some of the robust Korean flavor & spice I am used to). Nonetheless, with a bit of their table chili sauce, it was delicious and worthwhile. They also serve dinner combos, which I find is their best value, providing a large plate of rice, your choice of bbq meat, potstickers, or shrimp/veggie tempura.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-12", "description": "I used to love Hahn's Hibachi. Key word here is USED TO. Now, it's repulsive. The service is great, but the food is less than par.\n\nForemost, I'm Korean. When I order the tofu soup in a mainstream spot like Hahn's, I don't expect for the flavor to be on point.  It should come close to it, but it wasn't even close. \n\nI had to ask for seasonings to make it taste better, but they didn't have the main ingredient for the soup base when I asked for it. \n\nShocking. \n\nMy husband ordered the spicy pork. It was disgusting. Korean BBQ pork is not supposed to have teriyaki sauce on it. \n\nDon't get me started on their grotesque version of teriyaki sauce. It was slimy, the coloring was atrocious, and looked nasty when the waiter brought it to our table. \n\nDid they switch owners? I couldn't help but to think they did because the quality and style was so different from the many times I visited before. It was always my go-to spot when I was in SF. \n\nNot anymore.", "author": "Tracy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Cozy neighborhood place with solid bibimbap! The sizzling bibimbap is my favorite. I've been here three times just for their bibimbap. The sauce it comes with is awesome. Note--if you're gluten free, you can only get the bibimbap with tofu, not meat. The quality and amount of food you get for the price is very well worth it! Staff is friendly and accommodating.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "Alright, let me start off by saying that I'm a Los Angeles native. With that in mind, I am happy to report that this is one of my favorite Korean restaurants in the city. I myself am used to the great AYCE KBBQ experience, but the quality of food here makes up for the lack of grilling my own food happiness. My favorite dish is the sizzling bowl bibimbap, just remember to not let it sit in front of you for too long because the rice will get a little too crispy!", "author": "Jordan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "I picked up some takeout at this place one night before working a late shift at work. It was convenient, so that put it on my radar. I placed the order for a bibimbop and then walked next door for a bubble tea while the food was prepared.\n\nThe service was good and it didn't take very long. The food was pretty good, but I wouldn't say it was super flavorful or anything. Average to below average considering how delicious it can be. I would go back because it's close, but I'd probably try out some of the neighboring places first.", "author": "Brent W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-09", "description": "I went there after a job interview at UCSF. \nIt's a quaint Korean BBQ restaurant but food is not very good but a lot of selections. I had the bi bin bop- a lot of veggies, raw egg and sukiyaki beef but lacked of flavor (bland). It was meh.\ncleanliness and ambience  is 5\nfood is 1.5", "author": "Jade M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Love the sizzling bibimbap in a clay pot. Rice is perfect amount of crispy. Nice, low key place", "author": "Albina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "Solid lunch option. Good value lunch special - big portions. Wish the \"spicy\" dishes were spicy. Place is a little boring looking and run down.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "Great Service. The waitress/hostess is great. Very friendly and fast service. \n\nFood selection is wonderful -- lots of choices. We order our favorites and then something different to try.\n\nGreat neighborhood place to get take out or just swing by for lunch, dinner, snack.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "The sizzling bi bim pop is wonderful and so filling. I love going here when I'm starving for protein because they always deliver. If you want a bowl of comfort or a platter of meat, this is what you need.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Bibimbap hot stone was outstanding and delicious on a cold day! Small but cozy restaurant! Service was friendly and right in front of a Muni stop!", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-01", "description": "I don't get this place nor how it avgs 3.5 stars. Korean-esque food, at best, under a Japaese-ish name. No ban chan, no kimchi (unless you pay extra). Food is really Westernized, kind of how you'd get it at a Hawaiian style venue, but without the macaroni salad. The food was edible,  not gross or anything. But I can't say that I'll be coming back, at least not if I want korean food. There are far better spots within 100ft, or better Korean food @ 10th ave.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "We stopped in for lunch yesterday, and it was very good. I had the spicy beef bbq plate, and May had the rib combo. 3 huge ribs on a big plate. We both enjoyed the meal, the meat was cooked just right. We'll be back", "author": "James P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-16", "description": "Love the stuffed mushrooms.  The BBQ chicken isn't as flavorful the time I had it. It lacked the complexity of flavors that most Korean BBQ has. It was just salty.  I did not taste garlic or sweetness. I think they either didn't marinade it long enough, or maybe I should have ordered the spicy chicken.\n\nOk place for fast Korean food chain, and conveniently located to the UCSF campus.\n\nThe salad dressing is delicious!", "author": "JJAMZ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-10", "description": "Excellent Korean Barbecue. I had the rib platter plenty for a normal man. Spicy sauce added is good if you like that kind of thing, although it's no where near Thai spicy.\n\nBeer selection could be better. Had my first go at OB the Korean lager... Meh...\n\nThe beer isn't the restaurants fault though.\n\nStaff is very friendly. Would definitely return.", "author": "Brett H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "I was at work and was craving Korean.  Hahn's Hibachi really hit the spot! Within 10 minutes of placing my order, the food was ready (it was hot and fresh). The wait staff was very nice and welcoming.  I got the BBQ chicken plate, came with bean spouts and a salad. The side dishes were fair, but the chicken was very tender and marinated perfectly! \n\nCons: \n-Kimchi was a little bit too salty \n-The online menu prices did not reflect the prices that were actually charged. It came out cheaper in the end, but I was just a little surprised at the price differences. \n\nOverall, I would recommend this restaurant if you're in the inner sunset and craving korean food!", "author": "Bao D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-19", "description": "Not into super sweet meat, but if that's your thing this is right for you. Can see a reason why people love this place. Get to go order if you can to avoid the long wait.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "Whenever im craving \"American'' style Korean BBQ, Hahns is the spot.  Lets clarify that Hahn's isint an authentic Korean restaurant, so stop comparing it to one. You wont find Banchan, Galbi Tang, or Mul Naengmyun.....BUT you WILL find mountains of meat, delicious BiBimBop and damn yummuy chicken lettuce wraps =]. The waitress here is a sweetheart and always makes me smile. I must say the shrimp Tempura could use some help (its mostly breading. The couple that runs the joint are amazing nice. They warm my heart", "author": "Andrew V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "I adore this place and this location only. The woman who seems to have been here forever always does a good job. I request the Spicy Grilled Salmon with rice and extra dressing. Also their stuffed mushrooms are yummy. Have to eat there though. Best when fresh. Thank you for your kindness and for serving me for years.", "author": "S F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "We came here after a FAIL experience at the \"Lime Tree\" which is located right across the street. Only to find out this is a pretty decent Korean restaurant.\n\nDespite the fact that it could get crowded in here, we had a good time and enjoyed the food,  their tea, and their attentive service. Their portions are fairly big, so don't get discouraged by the price.", "author": "Oriel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-07", "description": "Small restaurant, phenomenal food, personal service. The tofu soup, bi bim bap and the spicy BBQ beef are all tasty. Moderate prices. I will be back.", "author": "Anna N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-16", "description": "Decent food, good price = 3 stars in my book. Place is small but cozy. Came here for lunch and ordered the chicken with rice combo. You get a lot of bang for you buck. Only complaint, the chicken was a overly drenched in the house sauce. Overall, this place good, if you're looking for a cheap lunch.", "author": "huy n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-24", "description": "\"what??? no Ban Chan??!!!\" What kind of Korean Restaurant is this??! It is not like the price was comparable to a \"take-out only\" Korean restaurant.\n\nI was a little disappointed eating my Korean meal without Ban Chan.\n\nOrdered:\n1) Glass Noodle appetizer\n2) Short rib comb\n3) Tofu bi-bim-bap \n\nEverything tasted decent--nothing impressive. I rather go to  Korean restaurant that serves Ban Chan. Plus, we ordered tea, and they charged us 1.75/person! Ridiculous charge for tea!\n\neh, i will probably not be back...", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "I have been here a few times, and each time is amazing. Most recently, I ordered the bibimbap, which I had only had from food trucks before. I wasn't sure how to deal with the sizzling pot. The woman serving us noticed that it was my 'first time' and showed me how to stir the bowl until it stops sizzling. She was so welcoming and helpful, and even brought us some kimchi cabbage to try, which i fell in love with. This is now our go-to spot in the neighborhood to eat when we want something that tastes fresh and healthy. I didn't know they had multiple locations until I came to write this review. It really feels like a friendly, cozy, family-owned establishment.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "I have been to the location on Polk street more times than I care to admit... I figured I would give this location a shot since I was in the area and I was pleasantly surprised. The food was great as usual and the service was better than the polk st location.", "author": "None O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "Order the BBQ CHICKEN PLATE!!!\n\nMy BF and I recently found our post-workout go-to place when we feel like devouring in some tasty meats after leaving the gym. Hahn's Hibachi serves an excellent plate of BBQ Chicken at an affordable price!! \n\nWhile this may not be your \"authentic\" Korean restaurant, they do serve excellent hibachi meats!! So if you are looking for an authentic Korean meal with all of your vegetable side dishes (they don't serve any), Hahn's Hibachi is not the place. But, if you are looking for a generous, hearty plate of delicious bbq meats for less than $10, this is the place for you!\n\nAdditionally, a side-note to anyone living in SF also from Hawaii. I want to point out that this place really reminds me of some of our local Korean BBQ restaurants back home. So just in case you are looking for that kind of place here in SF, I highly suggest you make your way to Hahn's Hibachi!", "author": "Mari S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-05", "description": "Service: Excellent. \nFood: Eh...I've had better. The pork combo I ordered was a bit fatty. The shrimp tempura was majority batter. \n\nThere was not a wait on a Saturday night around 8pm. Parking was horrible though. The rain didn't help.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-17", "description": "The Best SHRIMP TEMPURA I've ever had. Their special dipping sauce is one of a kind. \n\nStaff is nice and friendly \n\nLocation not good for big parties", "author": "Arlynn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-13", "description": "Came for lunch. Big fan of the chain and this location is just as great as the rest. Great service.\n\nStarted with the 'Mini; shrimp tempura - VERY generous 'mini' portions. 4 large shrimp and plenty of veggies. Big enough to share with a few other people.\n\nMain course - Pick 2: BBQ Chicken and Beef Spare Ribs. Great flavor on the meat. Generous portion of rice, but with so much good meat I don't really focus on the rice.", "author": "Sabrina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Love diggin in on some Korean saucy goodness here. You cant go wrong for the money. I usually order either the beef ribs or the bbq chicken plate. Gotta have the house Kimchee also and a pile of rice", "author": "D K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "The customer service was excellent. The waitress was very attentive and quick. The ambiance is very quaint and small, very simple place. \n\nThe portions were good. I got the dinner option #1, and when receiving the plate it looked like too much food but in actuality, the portions were fantastic. It was also great to have six different things on my plate to have different options. The reason why I'm rating this three stars is for the taste. The food is mediocre at best, the chicken was really thin and somewhat dry. The shrimp tempura was good, as was the salad. But again, the flavors weren't all there. \n\nFor the price, I would go back for a quick bite and it was on my way somewhere.", "author": "Lissette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Five stars does not do Hanh's justice. Their service is top notch, the food is always good and I have never had a complaint (eat here at least once a week).", "author": "Kevin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "The boy doesn't live too far from here - maybe half a block and we eat here whenever we need to fill up before drinking. They give you pretty big portions at night and definitely enough to fill you up. \n\nNew Years Eve. At about 8pm, and dropped by to get some dinner. One plate and an app was enough for us. They have pretty good bbq and definitely pretty cheap. Our date? 20 bucks.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-15", "description": "Mmmmm... Little disappointed.. I had the BBQ chicken plate and the sauce for the chicken was super watery.. The salad was blaaahhh.. Nothing special. And they don't have cucumbers like Castro street. :( Come to find out it's completely different owners. I think I'll stick to the Castro street restaurant.", "author": "Jillian S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-26", "description": "This place isn't your typical traditional Korean BBQ restaurant.\n\nThey don't serve ban chan (the side dishes that usually comes with anything you order at most Korean places.)\n\nTheir menu is pretty limited for traditional dishes. They have dol sot bi bam bap and tofu soup. I think that's pretty much it for traditional.\n\nBut, they do have a variety of BBQ items. Beef, pork, chicken, salmon and eel. \n\nI got the Spicy BBQ Chicken salad...ehhh. Not great, but it is what it is. \n\nThe bf got the kabob combo...he enjoyed it and it looked delicious. But, it's not something I would rave about.\n\nThe stuffed mushrooms were pretty good though.\n\nOverall, I probably won't crave to come back here for Korean food. But, if you want a simple Americanized Korean BBQ meal, come here. You have to pay for the kimchi too..", "author": "Christina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "Ordered take-out for my sister and me. \n\nI had their seafood tofu soup (spicy) and my sister had their mixed meat (forgot the name).\n\nHahn's Hibachi is very small; I think there was about 3-4 tables max. Seafood tofu soup is my to-go order for all korean restaurants-- theirs was plenty generous. My only complant is that their soup isn't spicy enough. I barely tasted the heat (and I love my food spicy!). My sister really liked her dish, I wish I could remember what it was.\n\nPrice was reasonable and the store owner (lady) was sooo sweet. She probably said thank you 10 times while we were there. I might try dining in with my sister soon.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-25", "description": "Ordered the spicy tofu soup here; this is my go-to dish at pretty much any Korean restaurant. I had drank a little during the day (hey, it was pride weekend, give me a break), and hot tofu soup is the best thing to eat when you've got the drunchies.\n\nThe soup was a little watery and unflavorful. I was a little disappointed. :( My friends got the special (9.25 for bbq chicken and some other stuffs), and that looked pretty delicious. They said it was good. Not great, but good.\n\nAll this would make me give the restaurant 3.5 stars, but then the service was pretty slow... and we were the only ones in the restaurant!! So that 3.5 falls down to a 3. :(\n\nI'll go back when I'm hung over, but that's pretty much the only reason I can see myself returning to Hahns.", "author": "Jade R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-17", "description": "This place is reasonably priced and serves pretty good food. I had the Korean BBQ chicken which was tasty but a little dry. The food comes out fast but the rest of the service is slow... They take awhile to get your order, bring drinks, etc. I'll be back if I'm in the neighborhood but I wouldn't go out of my way to return.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-17", "description": "I work at UCSF, so a quick walk down for some lunch. Had the lunch combo for $7.95. Very filling and satisfying. Had the beef combo, came with 2 shrimp tempura, rice, a little salad on the place and some miso soup. Service was quick as well. (oh, comes in spicy and non-spicy) so make sure you tell them!\n\nGreat place to stop by if you're in need of some quick and tasty food.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-08", "description": "Gordon Ramsay would tell me to stay away from this place. But I think the food is decent. The decor is sort of confusing. The ceiling lamps have dust bunnies having from them. I was iffy about dust bunnies having above my food. ( ? _ ? ) anyway, the dinner service was average. Our waitress was nice. The stuffed mushrooms were not too shabby. The BBQ spicy chicken was semi good. Average!", "author": "Philip V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "The BBQ Chicken Sandwich so good. Tender meat and juicy, with toasted bun. Awesome.", "author": "Cici C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "We had the lunch plates here and they are great. Really generous portions for the price, and everything on the plate was tasty. The meat is very flavorful and non-greasy. It's in a great location on Irving Street too so plenty to do in the area of you're looking to take a stroll after lunch!", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-11", "description": "Came here for lunch it was really tasty.  I got the lunch special BBQ chicken over rice and it comes with shrimp tempura and chicken jun (fried chicken patty). The chicken was really tender and well seasoned. The shrimp tempura is alright but the chicken patty was really good which made up for it.\n\nOverall a great casual local restaurant!\n\n(Limited seating - about 6 tables)", "author": "Cheung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "I usually see inflated reviews for SF restaurants,but this is definitely not one of them. I have to say that I am definitely not as confident in my judgments of Korean foods as I am of other foods, mostly due to exposure. I have had some experience with the food though and thought this place was really good. I came in for lunch with a coworker and got the soft tofu soup with beef. He got the bibimbap. I think each dish was about $8 or 9. We had eaten down the street at Manna before, which was a about $1-2 more on average I think. \n\nThe soup was pretty amazing. It actually had some spice to it, lots of soft tofu and plenty of meat as well. It was really delicious on a cold day. My coworker said that his bibimbap was excellent too and better than down the street. They were really quick (only one other table in the restaurant though) and very friendly. Great little work spot that I think we will definitely be back to. I really wanted to try some of the meat dishes as we saw a guy get some pork ribs that looked amazing! I don't know if I can get past the delicious soup though. We will see.", "author": "Miguel V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "Super small place, holds maybe 20 people from what I counted. Went on noon on a Saturday and it wasn't too busy, so our service was quick and the lady serving us was really friendly and nice. Food was good, not the most amazing Korean food ever but definitely satisfying.\n\nPlus we got two sticks of Korean gum with our bill. All in all, a good experience.", "author": "Floyd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "I've been getting food from here since it opened up a million years ago.  I've seen it go through a couple of different hands too  Prices have gone up, and portions have gotten slightly smaller.  But they have expanded the menu.  I don't exactly think of it as Korean though, more a certain degree of Asian fusion now since they are serving tempura and stuff.  My favorite dish is the chop chae.  I've had this at other places but Hahn's chop chae is so tasty with lots of little bits of vegetables in there.  I like the cellophane noodles too since I have a problem with wheat.  This past time we got the Meat Mountain, which wasn't as mountainous as it was before (only 1 beef rib, 1 pork rib, 2 real thin chicken filets) but it's still tasty--and we probably don't need so much meat anyway.  I wish they'd do something like give you some kim chi with each meal, or some one of those other pickled Korean vegetables.  Wish they had an item that was just \"assorted pickled Korean vegetables\" 'cause those are so damn good but i don't want to have to buy a whole jar of each of the stuff, nor do I want to have to go to a real Korean place to eat them (since I tend to want to take off my shoes and socks and get real comfortable when I eat).", "author": "Kai T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-11", "description": "I give them a 3.5 Stars.\n\nI had take out...so I can't review their services.\n\nI thought their food was decent. Again...of course it's bad to compare, but hey, that's life. Arang is my all-time favorite.\n\nArang\nhttp://www.yelp.com/biz/arang-restaurant-san-francisco\n\nChicken & Chicken Yun, Shrimp Tempura & Salad\nhttp://static.px.yelp.com/bphoto/pn3Av0BJLjJRd0xuo2a0CQ/l\n\n(Friday, April 10, 2009)", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "Yumm!!  Large portions, you'll definitely have leftovers. Great service, small private atmosphere, and fresh ingredients. Will definitely be returning.", "author": "Jessica O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-30", "description": "Great service... But I wasn't impresses by the taste of the BBQ rib plate.  Perhaps I ordered the wrong thing. Bim bim bop might be where its at. \n\n-Hopeful", "author": "beck l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "Not sure where my review went, but oh my. I love them.\n\nThe food is solid, but the menu is so enjoyable, and hilarious, to read:\nhttp://www.hahnshibachi.com/locations.html\n\n*VERY* family owned place with a bit of pizazz and good attitude.\n\n\"Meat Mountain  Well, fellow Meat Crazies, with the Meat Mountain, Meat Truly is everywhere.  \"The Meatinator,\" \"Meatarola,\" \"Meat O' Roni,\" \"Meat O' Lux,\"  \"Beef, Ribs, Chops, Chicken, Pork and a pile O' it.  \"Meat@ix.marsnet.com, Gig O' Meat, The last two  are for you High Tech folks.\"\n\nOr even better:\n\n\"BBQ Beef Thinly sliced Rib Eye, marinated and loaded with flavor, tasty, tender, and lean CAUTION, \"keep loose clothing, long hair, and small animals away from anyone eathing this dish.\"  \n\neven\n\n\"BBQ Beef Thinly sliced Rib Eye, marinated and loaded with flavor, tasty, tender, and lean CAUTION, \"keep loose clothing, long hair, and small animals away from anyone eathing this dish.\"  \n\nTo make good food is to be divine, to be make a wonderful atmosphere and enjoy having a business.... UNBELIEVABLE.\n\nSolid, epic, local Korean fave.  I love these guys so much.  Hard to find good food that also makes you happy. =)", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-08", "description": "Service is slow here.  \nFood was moderate.  Korean?!?  Hmmm... \n\nI see that they have several locations, but I'm not impressed enough to try again.  Granted, I did not get sick, but it's not worth trying a second time.\n\nGo somewhere else for better food.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-19", "description": "Unlike most Korean BBQ houses, this place is a small restaurant which can fit 20-30 people comfortably. Every time I am on the metro passing by, its never totally jam packed with people, but decent enough to keep the business alive. If you don't know how to use chopsticks, have no fear! This place is a fork and knife type of restaurant and geared more towards the American flavor. The restaurant is also run by a local Korean family. Support the locals!\n\nA dinner for two tonight was an affordable $25. The amount of food they gave us was like a bowl of rice and a mountain of food. Don't get me wrong, but the food was also delicious. \n\nI ordered the spicy beef bulgogi over rice while my friend had a saute chicken bulgogi with broccoli. Service was prompt and straightforward and the waitress was knowledgeable in some of the items I had questions about. \n\nThe downside is that kimchee and tea are not served with your meals. They are listed as a side dish or as a drink. It was still an affordable $2. \n\nIf you like a peaceful meal by yourself or with 2-3 friends, come here! The only noise you would really get is from the occasional passing street car.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-12", "description": "It was alright, but nothing special in any way.  I bet there are other, better restaurants in the neighborhood.", "author": "Angela R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-12", "description": "\"Habachi\" - without the chef cooking in front of you. More like a cheap fusion restaurant", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "MmmMmm, \n\nOver the years Hahn's has never disappointed me. Today just reassured my confidence in always having a fulfilling meal here.\n\nThe lunch combinations are spectacular in taste and price. All I can say is I was not completely full after the meal, but for 8 bucks who can complain. Also I must admit I can eat like a bear.\n\n=)", "author": "Tip S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-22", "description": "Well, it was been a while since I ate there.  All the dishes came with Kimchi salad  when I use to eat there monthly.  Now they all include an American salad on the side.  I use to order the BBQ Chicken and so I did again.  Yummy, but it wasn't as good as I remembered.  Clearly, it was not as juicy and tasty like before.  Plus, where wasn't even a glimpse of black marks on the BBQ chicken that gives the great BBQ taste fresh off the grill.  Must have been clean grill I guess but not my forte.  Back in the day, the joint was super cheap.  Not anymore and thats fine.  Everyone needs money but everyone doesn't have to eat here.  Now it taste like basic boring mall food.", "author": "joseph c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "For a local restaurant that's been successful enough to expand to at least 7 locations, the various Hahn's Hibachis sure do hold some low Yelp averages.  But when I'm tired, hungry, and having one of those days, I'm not looking for greatness.  I'm looking for food I can deal with no matter how dazed and confused life has left me.  And for me that food is greasy, salty rice in a big hot bowl, AKA Hahn's Sizzling Pork Bi Bim Bap.  Sure I had to douse it in hot sauce to get some flavor going, but those super-golden-crispy chunks of rice at the bottom of the bowl are a pure (albeit guilty) treasure.\n\nThrow in the cozy size and the short walk from home, and Hahn's Hibachi is my new favorite for days that just require a Plan B.  Even though technically Lime Tree's food is way better:)", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "Love this place! Used to go out of my way whenever I traveled to SF. Now that I live here, watch out. Be sure to ask for Kim chee or else you won't get it. ;)", "author": "Robin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "Food is great, prices are reasonable. The lady that always works, 7 days a week is such a nice lady, always very attentive. I recommend this place for.individuals looking for good food and great service.", "author": "Luis L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-03", "description": "Went here to grab a bite for lunch. From first impressions, did not look bad. Their selection was pretty fair and the food smelled great. I decided to go with the dolsott (stone bowl) bibimbap, a personnel favorite and I placed my order. Being a Korean restaurant I began to wait. For the Ban Chan (appetizer-type side dishes). Which never came. Kind of a disappointment. Those little dishes really help get your appetite up and also serve to compliment the main course quite nicely. Ouch minus 1 star. \n\nMy bibimbap came sizzling and hot and everything looked great. I proceeded to dive right in. As i began to hit the rice at the bottom I began to notice something. The bottom of the bowl was heavily oiled (so the rice wouldn't stick or something?) This completely ruined the meal for me. The more I ate, the more saturated in oil everything became. The rice was soaked in it and towards the end when I got to that wonderful layer of burnt rice that should be there, I found a slightly browned but nauseatingly greasy layer. Minus 2 stars. \n\nWould I come back? Perhaps if the rest of their offerings are not as botched as this one appeared to be. As for now I think I'll stay away and go to Tofu Village about 10 blocks away.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "I had a combo of spicy pork plus spicy chicken and while I'm no expert on Korean food, I have to say I was pretty happy with it. BBQ sauce was nice and tangy, with a good kick to it, especially with the addition of some red chili paste. The rice was perfectly done, nice and sticky without being impossible to eat.\n\nI went on a Monday night when the place was empty and the service was totally fine so maybe just a place to avoid when it's busy. \n\nWill definitely go back to try some of the traditional Korean options on the menu.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-06", "description": "this is not your typical korean restaurant with the little dishes in front\n\nI usually come here when i have a slight craving and their meat dishes always hit the spot. They have all sorts of meat combos and you should definitely get it spicy. \n\nthey also got these fried mushrooms, i like em a whole bunch.", "author": "phillip w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-27", "description": "As we all know parking can be a beotch in the City, luckily I found metered parking on 7th Avenue right around the corner in this area.\n\nSo I scoped out the place for lunch. Small, roughly seats about 20 or so people. The minute you walk in you're greeted by the aroma of grilled barbecued meats.\n\nThere's quite a selection of barbecued dishes on the menu. I ordered one of their lunch special combo's - BBQ Chicken, Shrimp Tempura and Pot Stickers served with steamed rice, marinated bean sprouts, and lettuce salad w/miso dressing.\n\nOrder arrived fairly quickly. First thing I noticed was the plate, it's huge! Portions, not bad , just enough to get me through the rest of the day.\n\nFood tasted okay, the BBQ Chicken was tender and glazed with a lemon Teriyaki based sauce. Shrimp Tempura and Pot Stickers was so-so. You have the option for a spicy sauce with your barbecued meal which cost a little bit extra.\n\nService was okay.\n\nNot your typical Korean fare, but will do the trick to fill that void in your tummy...", "author": "Gary E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "My first bi-bim-bap was as good as I'd hoped. Fresh veggies, tender meat, and yummy kim-chi. They even included a stick of gum in my take-out order! \n\nSince I live just around the corner, Hahn's is likely to become a habit.", "author": "David Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-03", "description": "Are you kidding?\n\nGo to a supermarket, buy meat, cook it at home and cover it in your sauce of choice.\n\nI went once and I was offended.", "author": "Jin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-01", "description": "I am so happy to have discovered this place! I love their food. Great prices, and wonderful service. I am obsessed with the spicy pork and I need to get take out every few weeks. I am always happy, and have tried lots of other dishes too. I live in the outer sunset and happily drive to get pick-up, but I do wish they delivered! I love u Hanh's!", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-28", "description": "I went here a few weeks ago only because San Tung had an insanely long line (as usual) and I was on a time crunch.\n\nThe last time I ate here was more than 7 years ago. I remembered it being pretty good, but maybe that's because I didn't really know what Korean food was supposed to taste like. Needless to say, this place has either declined or has always been this bad and I didn't recognize it.\n\nI ordered the spicy pork combo and my boyfriend ordered the rib combo. The Chap Jae was decent, but it tasted off. Good for noodles but not good for Chap Jae. The meat was pretty good, but by no means authentic tasting. It made me wish I was in Hayward so I could eat at Han Yang.\n\nOverall, a measely ... OK restaurant. I don't plan to come back here. Next time I'll make the drive down to lower Irving and eat some cheap boxed rice combo or pho.", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "The beef ribs were scrumptious and well priced. I would definitely go back for them. The Bimibop dish was tasty, but not too heavy. Solid service too.", "author": "Omar M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-16", "description": "2 Words:\n\nHORRIBLE SERVICE. \n\nIf I could, I would give this place ZERO stars.  My mother told me of an incident where she and my little sister were dining here.  Turns out, my sister ended up thinking that her meal was a little too spicy.  So my mom told the waitress that they order was too spicy fo my sister to eat.  The waitress responded saying \"Well that's what you ordered.\"  My mom responded back saying \" Yeah? So what?  It wasn't what we had expected.  We would like to order something else.\" Now a normal waitress would just take the meal back, and try to accomodate the customer, but this one just took the plate back and never took it off the bill.  My mom asked her why she hadn't taken it off the bill since she hardly touched the plate.  The crazy waitress just responds again by saying \"Well you ordered!\" Screw that man, my mom left without paying for that order.  No money, no tip, and no more business from us!", "author": "Cass J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-19", "description": "I decided to give this place a shot because I have been to the Hahn's on Polk street, and it was phenomenal. Unfortunately, it looks like there is a completely different crew that has taken over operations here. First of all, the food was disgusting. The teriyaki beef was barely seasoned, and the cut of meat was extremely fatty. Next, we decided to try a new dish, bbq unagi. I'm thinking, I like BBQ, and I like unagi, so why not combine the two? The combination resulted in a gooey mess, and the sauce tasted like they had purchased the ingredients from the local dollar store. The bathrooms - you have to go through the kitchen. Now, I've done this before, and it's been no big deal. As a matter of fact, some of my favorite Chinese food restaurants have this same set up. But Hahn's is a modern restaurant. They should have a decent bathroom. \n\nAnd what killed it all? The service. This place was about the size of a small SF living room. You could literally stand at the host stand, and hit everyone in the restaurant with a pair of chopsticks, EASILY. Every time we ordered more beers or sake, it would take at least 10 minutes, but there was no one else in the restaurant (should have been a sign...). And when we finally were taking our time and paying the bill, we received the deadly, ominous stares from the hostess, chef, and busboy. We weren't even close to closing time, so I have no idea what the issue was. And sadly, with the number of fly restaurants in SF, I don't plan to give this place another shot. I'M DONE SON!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "It is always warm and cozy inside, the atmosphere is comforting and the serving staff is sweet. I always get the vegetarian bibimbap and it is orgasmic at a price which won't leave you suffering financial second thoughts.", "author": "MJ W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "Hahn's Hibachi - probably not the BEST Korean food in the City, but at least you don't leave smelling like you've been cooking Kal Bi in a closet all day.\n\nI love Korean food, and my favorite is probably Brother's in the Richmond District.  But, when I'm craving Korean without the smelly after-effects - I wander on over to Hahn's. \n\nIt's hard for me to pick just one favorite off their menu.  On cold days, or if I'm craving some comfort food, I order myself a nice hot bowl of sizzling chicken Bi Bim Bop.   I love how the rice gets crispy on the bottom!  The portions are not skimpy either, so be sure to bring your appetite!   They fill the bowl with rice, veggies, chicken and an egg.  I slather on the hot sauce like there's no tomorrow, and enjoy.  My worries, cold hands and feet just melt away!\n\nI'm also a big fan of their Chop Chae and spicy pork.  The meat always comes out in huge portions, marinated to perfection and tender.  If you're craving heaps of meat, this is the place for you!\n\nThe Irving location is very small, with only about 10 - 12 tables.  The service is excellent and fast.  Great spot to come for lunch, or if you're craving some Korean BBQ and don't feel like smelling like your food after.", "author": "Christy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-28", "description": "D'OH! Why did I go back here again?! And how could I forget they charge for Kim Chee?!\n\nFrom my 1st meal here a few years ago until now, I've been to Hahn's a few times. Every time I eat here, I tell myself I won't come back again, but when my little nose smells the BBQ, my brain thinks, \"Oooh, if it smells good, it'll probably taste good - drool drool.\" The thought that I don't enjoy their food that much crosses my mind, but the smell of Korean BBQ overpowers it! And then I try to justify it by telling myself they may have improved. But, I gotta' stop doing that because they never do!\n\nI'm always sooo disappointed the with Korean BBQ (I usually get some form of cow) because I want it to taste like it smells - sweet AND salty AND garlicky and maybe even a little fatty! My most recent experience a couple of days ago was dry beef (not tough mind you, just not moist). It was salty, maybe a slight bit garlicky, but there was no caramelized sweetness or make-you-drool tastiness and all that other good stuff! I was so excited there was a generous portion of sauce on my rice and plate - I thought it would add flavor to the dish, but it didn't! Disappointed again!\n\nAt least the service was good and the server was nice enough to let me order the lunch special even though we were way past that time!\n\nI had a difficult time choosing between 2 and 3 stars, so maybe 2.5 - it sucks to mislead my nose like that!\nI'd rather spend more money and go to Brothers!!!", "author": "Sharon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "Love this place. Sizzling pork bi bim bap with the hot sauce and kim chi, so tasty. The barbeque chicken and beef are also pretty good.", "author": "Tyson T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-22", "description": "When the sf fog monster reaches into my body and manhandles (or monsterhandles as it were) my bones, causing them to turn to ice, I come to this Hahn's Hibachi for some Sizzling Bi Bim Bop with pork. \n\nAuthentic? *shoulder shrug*\nTasty? *affirmative nod*\nPricey? Hell's No!\n\nI'm sure there are better Koren BBQ's in SF, but this is where I go for a screaming hot stone bowl full of rice, meat and veggies. I smother, not coat or slather, but completely smother this with the hot sauce provided. It doesn't necessarily need it but that's the way I do it. The key is to stir your food as soon as it hits your table to ensure that the rice become crispy, but not burnt. \n\nEssential this is my remedy for a damn cold day.\n\nP.S. The pot stickers are pretty good as well.", "author": "Ricky J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "This place is small. Not meant for walk-ins of 7 or more. The menu is is well covered from Pot Stickers, Udon, Sandwiches,  and of course Korean BBQ. The food is very good. Service is quick and friendly. There is the Polk Street location that's larger and easier to park.", "author": "Cam Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "Came here for dinner one night with friends. It's a small place, so don't come with a large group or else you will take over the entire place. The lady that served us was very nice. We all ordered the Meat Mountain. I don't know what I was thinking when I ordered it. I had enough left over for lunch the next day. I didn't want to ask for more bean sprouts, so my friend asked for me and the lady was nice enough to bring out a big plate of it. The food was very flavorful and cooked well.", "author": "Adelina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "combo with short ribs and spicy pork & dolsot bibimbap with beef. always the same order. always delicious and she remembers it every time! i love this place. you won't get assorted banchan but the kim chee is great and you get refills. pure comfort food and great service. if you sit at the window you can watch all the people on the Ntrain ogling your food", "author": "T T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "Dol Sot Bi Bim Bop.. Bim Bop a Be bop a Ree-bop Rhubarb pie..\n\nSizzling pots with hot food and hot sauce, Hahns you bridge authenticity with culinary appeal so well.  The menu has plentiful selection without being pretentious and the dishes are correctly price-scaled from light lunch to full dinner.\n\nFor a friend-date, a real-date, a by-myself treat date.. I can't picture going wrong here.", "author": "Jim W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "My clothes smelled like the sizzling bibimbop 6 hours later. Awesome.", "author": "Phuong M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-30", "description": "went here for an early lunch on a sunday morning.  service was good because it was empty.  the food is awesome here and went back a few times afterwards because the food was pretty good.", "author": "Kurt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "The food here is delicious and reasonably priced.  It's served up in a more \"western\" manner with individual complete meals rather than to-be-shared entrees with the small side dishes.  Our family likes the BBQ chicken, Korean noodles, and bibimbop.  The gyozas are good as well, though less of a value given their small size.  Service is always friendly, and the owner takes time to say hello to the kids.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "Love this place! The waitress is always so welcoming and attentive. The best hot stone pot beebimpbop in SF.  Great combination rib platter. Excellent Kim chee. Great value and service! A favorite neighborhood gem.", "author": "Cincia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "My husband and I love Hahn's. It's owned by an absolutely lovely couple who are so kind and welcoming - the environment is cozy and it makes you feel like you're being cooked a delicious meal at someone's home. They're incredibly accommodating to your needs/tastes which I really appreciate. The food is super fresh, delicious and really well priced. My husband can't get enough of their homemade BBQ sauce and loves the way they prepare the chicken. Other favorites are their tofu soup and bimbimbop. Overall a wonderful neighborhood gem!!", "author": "Vtsf T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "I was in the mood for spicy beef bimbibop.  It came it its out sizzling hot bowl.  I love when you are given the bowl instead of just the serving.  This guarantees the crispiness at the bottom.  Honestly, if I could just have the crispy part of the meal I would be a happy camper.  It was the right amount of crispy and spicy.  Yum!", "author": "Megan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-19", "description": "The first time I went to a Hahn's Hibachi was in the Marina.  Since then, if I ever found out a new one opened, I was there.  I used to order their BBQ pork sandwiches at the Polk location when I visited my friend in Nob Hill.  I'm still going to the one on Irving because I live in the inner sunset.  West Portal isn't too far and the place is bigger.\n\nI think Hahn's is great because it's a nice and quick way to get some Korean BBQ.  I used to stuff my face with a BBQ meat combo and be too full to move.  Now I'm satisfied with just the BBQ chicken with some kimchi on the side.  It's also a great meal to go.  Also, how can you go wrong with extra sauce?\n\nWhere's the next one opening?  I'll find a way to go there too.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "I absolutely love going to Hahn's!  It is one of my favorite places to eat in the city and I get excited to go there :)  You know a place is good if your mouth waters thinking about their food! Plus their prices are great. Try their combo specials... And their tempura shrimp are guaranteed to make you come back! Lee, the main server is the best, and I always look forward to her friendly service. You have to check this place out if you haven't already! Now I'm hungry :)", "author": "Georgia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-07", "description": "Their bibinbap is super good! Maybe not the same atmosphere as Manna, but the bibinbap is bigger and much better.", "author": "Valerie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-25", "description": "Having eaten at the Polk Street location and craving Korean BBQ I recently ordered take-out from the Irving Street one. Ready in 15 minutes. Very polite behind the counter. Absolutely delicious food, perfectly seasoned, peppery meaty goodness. I also got the stuffed jalapeños which I would recommend if you like crispy meat-stuffed treats. \n\nI'm not sure if the management has changed since the scathing reviews about the service that I read, but I have no idea what they are talking about. I'm very happy to have a dependable local place to get my Korean BBQ fix from. Also, I noticed that they scored 100 on their health inspection if you care about the state of the kitchen.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-18", "description": "Great food - nice wait staff.  A little small and crowded restaurant though...", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "My boyfriend and I have been threatening to eat at one of the Hahn's Hibachi locations for at least 4 years, and finally -- FINALLY -- we got ourselves in there for dinner.\n\nWe split the Deluxe Kabob entree, it comes with 1 pork, 1 beef, 2 teriyaki chicken and 2 shrimp kabobs plus a big scoop of teriyaki-covered white rice and seasoned grilled vegetables.  The beef and pork were very flavorful; the teriyaki chicken kabobs appeared to be all-white meat; and the grilled vegetables were super tasty.  The one entree was just enough to satisfy two of us without feeling stuffed.  I thought it was a great deal at $14.\n\nCan't comment much on the speed of service as there were only 2 other diners present during our meal --  but of course everything was brought out quickly and tasted great.  I will go back, possibly trying one of the other locations?   There were definitely other menu items I am interested in trying, specifically the BBQ Pork ribs!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-08", "description": "Korean BBQ on a trip meant for Persian food. Thats what happens on Monday's when Lavash is closed. Luckily for us we ducked into this Korean BBQ for a lunch special. What a nice way to spend $10 bucks.\n\nLunch specials are $7.50 and you have your choice of BBQ beef, chicken, or pork. You'll get a scoop of rice, 2 looong strips of tempura shrimp, 2 small potstickers, small bit of salad, and small bit of sprouts, plus sauce.\nSoda's are from the can for $1.50 with a cup.\n\nThe BBQ beef was fine, not fatty, and the sauce was good. The salad dressing had something about it that made me woof it down, and the pot stickers had a good balanced flavor.\nTempura shrimp wasn't very flavorful but offered a nice compliment to the rest of the dish.\n\nService was fine, though basically none was required, as neither myself nor my dining associate needed refills or anything. Still I suspect that service would always be good because the place is so small...probably holds little more than a dozen people.\n\nAll in all a solid Korean BBQ joint. I suspect you'd spend around $15 if you came here for dinner and had an entree and something to drink.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-29", "description": "Their lunch specials consist of: bean sprouts, salad greens with asian dressing (bomb diggity flavor), cup of rice drenched with sauce, two perfectly fried crispy tempura shrimps, Either your choice of chicken jun or potstickers and your choice of meat: chicken, pork, or beef. (Chicken jun if you don't know is basically a chicken patty basically chicken meat grinded up into a chicken patty. Potstickers FOR THE WIN) \n\nI love their Lunch Special #2 which is hella good. It's thinly sliced beef strips drenched in some lovely delicious sexy sauce that is very sweet and amaaazing. The dipping sauce that comes with the potstickers/tempura is LEGENDARY! It's so good I soak up all my food in it. I ask for more of it on the side. The sauce is a perfect compliment to the food. Yummy. Their fried stuffed mushrooms are to die for. They stuff them with pork and again that sauce just makes it even better. Their bibimbop was sooo good. It's basically a veggie, meat, kimchi hot sizzling plate with what else? a freshly cracked egg on top of it fiercely getting cooked by the ingredients underneath.\n\nPrices are $5.95-$16 depending on what you get. The bigger the dish, the more you pay. The space is small and it could get busy when them UCSF employees are on their lunch break. But the only good thing about it being small is that the waiters aren't slow because the place seats about 20 people. But trust you will devour your food because it's so tasty. Parking might suck since it is on the streets of San francisco. \n\nThe best part about leaving this place is the WATERMELON bubble gum they leave you with your receipt. snaaaaps.", "author": "Philbert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "I've been coming here for years now. And I love the food. I pretty much order either the chicken salad (I love miso dressing) Or for lunch, the specials they have.  My bf loves the spicy combo's. And for some reason everytime we go, he always has a white shirt on and spills some of the sauce on himself!\n\nThe service is always super friendly, super fast and the food is pretty good. The BBQ sandwhich's are really good and we always order one to go, so we can take it home.  The prices are pretty good, espcially for lunch.  You get 2 pot stickers, 2 tempura shrimp, 2 big pieces of chicken, a little salad, a nice size portion of rice and some garlicy bean sprouts, For $7.95\n\nThe only downside is that it's super tiny with maybe 8 tables, so it's not so good for a party of 8 or more.", "author": "Mara L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "This place is different than the most typical Korean restaurant.  They don't have have the little side dishes that you would get in other places.  Bummer! Yes, I know.  But they also aren't overpriced like all other places are. Even Kukje, a Korean supermarket lunch spot in Daly City, is way more expensive than this little spot located on Irving and 6th ave.  unlike other places, their portions are also generous relative to their prices.  We ordered the sizzling bi bim bop with spicy pork ($11) and medium spicy tofu soup ($10).  The sizzling bi bim bop was very delicious as the spicy pork was tender.  The medium spicy tofu soup came with rice, sprout, and salad. We enjoyed the soup very much. Their medium spicy was perfect for me. I would say it's on the spicier end of the scale, but Koreans eat very spicy, so it was appropriate. The service was attentive, too.  During lunch on weekends this place isn't busy, but I can see it can get very crowded during nights because they only have a handful of tables.  I hilly recommend Hibachi for quality food at a lower cost.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "Order the Bi Bim Bop.  It is outstanding.  Also, if you dare, try the Meat Mountain.  It is everything you would expect from something called a meat mountain.  I am a big fan of Korean food.  While this is not the number one on my list, it has fulfilled the need every time I've tried it.\n\nLow prices are great but the place is a little small.", "author": "Jacob H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-23", "description": "I agree the meat is good here but the udon I feel like it is something I had at a food court and the tofu soup was super salty. Personal preference I don't enjoy meat enough to come back.", "author": "Jess H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-14", "description": "5 Star for Delicious full body and full of spice food\n\n\nEating at Hahn's hibachi is like falling in love with a women whose language you don't speak-captivating but mystifying.At Hahn's,you won't understand the food,but you will immediately regret all the years you lived without it", "author": "chris j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "Korean bbq isn't really my bag, but this place is pretty good. I got the lunch special and it was a lot of food for $7.99. The place is very small but quaint and the service is pretty quick. I particularly liked their pot-stickers.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-07", "description": "Good menu selection and super friendly staff makes this a nice place to get a quick bite to eat, or to lounge and pretend you're sitting in your own house. Small place, but the food was yummy and came pretty quickly. The pile of meat was seasoned deliciously and went down smooth. The server was very nice, and ensured we didn't need for anything, checking back often. We went on the later side of the evening so we were there with 2 other tables. The tempura udon noodle soup tasted like it needed a little something, but that's probably because we got the tempura on the side. Overall, a good place to eat and we will come back :)", "author": "S P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-01", "description": "Sure it isn't your traditional Korean BBQ restaurant, but it is a great place for what it is. Food is tasty, comes out quick, prices are good and service is with a smile - not much to complain about at all.\nThey have a large variety of BBQ items and some other traditional dishes. Portions are large, and they leftovers warm up well.\nBottom line, if you are looking for authentic Korean BBQ, realize that Geary is on the other side of the park. If you are looking for a tasty meaty meal, then this place is definitely worth a shot.", "author": "Arthur L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-27", "description": "the young waitress is pretty blunt and rude. my dad asked about the tofu soup and just how spicy \"medium spicy\" was (which admittedly, was a retarded question.) \n\nwaitress: \"it's MEDIUM. not HOT, not NOT hot.\" (glares at Ben T.)\n\nben: \"what are you looking at me for? i know what medium spicy is. AND i didn't ask you the question.\"\n\nwaitress: (rolling eyes) \"so what do you want?\"\n\nben: seafood tofu soup... spicy.\n\nwaitress: are you SURE? it's SPICY.\n\nben: yes...\n\n(awkward silence)\n\nwaitress: o..kay. (finishes glaring)\n\ni never saw her again.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "This restaurant really filled my meat craving.  I wanted some ribs so I ordered the rib combo plate.  It had beef, pork, and short ribs served with some rice and salad.  If you are looking for some \"fall off the bone\" ribs... this is not the place.  The beef rib was a little tough and chewy.  I had to gnaw on the pork rib for a while to really get at the meat.  However, both were nicely seasoned and tasty.  The star of the dish was the short ribs.  They cooked them just right and very flavorful.  The next time I go I'm just ordering a short rib plate.\n\nMy wife had a bowl of udon beef soup.  She really enjoyed it.  It filled that need where you are hungry and want something warm and filling but not overly heavy.  She joked that it might replace traditional chicken soup the next time she has a cold.\n\nThe service was very friendly and polite.  Every time the waitress came to our table she always had a smile on her face.", "author": "Brent V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-24", "description": "The \"Sizzling Bi Bim Bop with Beef\" with the additional spicy sauce is incredible here. Great prices, small place, and good service.", "author": "KebabKing .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-21", "description": "Whoa. this is a chain that continuously relocates its outlets, because they rip you off once, and you never go back. Then they change locations and rip you off again because you're too stupid to realize that it's the same shitty place but only in a new location. The food is so awful! And the tea is sinfully disgusting. Green tea in a tea bag?! Yuk.", "author": "Ricardo O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-14", "description": "If you want to gorge yourself on big, cheap steaming piles of grilled meat cut up with scissors, go here.  Although, there are certainly much better quality korean bbq joints around the City.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "This place is great. The service was very friendly and helpul, and the food was yummy. We had the bbq beef lunch special and the tempura fried marinated beef stuffed jalepenos. Both were amazing, will definitely go back.", "author": "Danielle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-21", "description": "It's not the most \"authentic\" of Korean places from what I hear but who cares?  The food is yummy, the prices are cheap and you don't have to cook it yourself.", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-01", "description": "Eh. The food is decent enough, but I could find the same thing elsewhere without having to deal with HORRIBLE service. We didn't get our side order and we were waiting for our check over twice as long as it took for us to eat. Our server (the owner?) dropped off our main dishes and proceeded to eat lunch with a friend and then make a long, long telephone call without even checking in on us or looking at us as I tried to get her attention because we'd been there an hour. And we were the only people in the place. You think you could get decent service when you're the only people there...", "author": "Amy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-17", "description": "--first time going there already gave me the bad impression--\n\nOkay, I was going to give this place a 3 because their JapChae (they call it Chop Chae I DON'T KNOW WHY w/e) is like.... so salty and sour? Doesn't taste like the JapChaes I've ever eaten!\n\nThis place has such a slow service. The waitress is like around in her 40-50s and she REALLY takes her time. and yes, she's not crippled or have any walking problems... takes her more than 5 minutes to get the hot water to you and clearly this place doesn't have that much people eating in there.\n\nThe worst about this restaurant is that when I asked for a to-go box (not expecting any help.. she took my plate and did it for me so i'm like ooh okay and thought that gave a good impression etc).\nbefore she took my plate:\nlady: everything? with the rice too?\nme: yes please\n*got my box*\nleft the restaurant..\n*opened the box to check on the food*\nand guess what? \"EVERYTHING wasn't in there. I was missing 3/4s of my plate (the veggies, the lettece, bean sprouts, the chicken!!! ALL I GOT WAS A FEW STRANDS OF THE NOODLES AND THE WHOLE RICE.. WHERE'S THE CHICKEN?! LOL)... I only took a few bites on my meal btw... the only thing i got from the to-go box was ALL OF THE RICE and a few strands of the noodles! It makes me really wonder why she put all the rice in instead of the noodles... did they plan to REUSE THE NOODLES to feed the next customer?! REALLY, WHERE'S ALL THE CHICKEN FROM MY NOODLES?! LOL.. I don't trust this restaurant... & I've heard real stories about how some restaurants are cheap and crazy (reusing food that was eaten).\nseriously... all the rice and a few noodles? really... I only took a few bites from my plate and obviously I get full easy and want to take it home... i only got back the 1/9 portion of the food. wtf? the to-go box still has a lot of room in it...\nugh!\n\nDefinitely not going back again!\n\n\nWARNING:\n-don't go if you know you're going to be in a rush. SLOW SERVICE!\n-need to make a take out more than a half eaten plate (PLEASE, DO THIS YOURSELF, OFFER TO HELP YOURSELF IF YOU DON'T WANT MORE THAN HALF OF YOUR PLATE'S FOOD PORTION TO BE GONE, don't let her do it!).\n-THEY DO RIP YOU OFF IN MANY WAYS... OTHER REVIEWERS WERE RIGHT!\n-waitress sounds so intelligent... how she repeats what you say and point it out... she doesn't do it...\n-doesn't include free appetizers\n-CHARGES FOR TEA...\n-you'll hate this restaurant someday/any time of your life (not just this restaurant... all their locations suck).\n-DON'T GO THERE? PICK SOMEWHERE ELSE! LOL\n\nRegret:\nGiving her a $5 tip", "author": "ABC Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-12", "description": "For the amount of money I spent here, I could have gone to a  real Korean restaurant and ordered a bbq dish or tofu stew with a lot of typical Korean side dishes.\n\nI think the entire Hahn's Hibachi chain changed owners or something.  The menu changed, the food doesn't taste quite the same.  Very disappointing.  \n\nRight when you walk in, there's a certain kind of funk and then it goes downhill from there.", "author": "Ernest Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-08", "description": "wow. what is this?? how could you possibly eat korean food with authentic korean flavors exempt? Very nice owner that I feel bad writing this review - OK, the food was edible (had the lunch special), but If you're one who loves Korean food, you'd be insulted with their BBQ beef. Basically, it's American-style Korean food, accommodating weak, unimaginative palates. (And if you want exemplary Korean food, go to LA, Koreatown).", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-06", "description": "I would not call this place authentic Korean as it is more of a fusion style of food.  Like people have said, the portions are good for the price which is the major plus I think.  Being automobileless I take the Judah N Line that passes by this particular location and drop by once in a while.  Not the best \"Korean\" food in town, but an easy quick fix that will fill you up right.  It's awesome that the waitress (who always seems to be the same girl all the time with a crazy manicure) actually speaks Korean - that's bonus points for me.  As far the menu items, I've only tried their bi-bim-bap both in the stone bowl and without and both were a pleasant surprise considering there aren't many Koreans in this area of town to my knowledge.  Probably should only give this place 3 stars, but because of my sometimes desperate cravings for close Korean food, I'll barely give this a 4.", "author": "Sokokyu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-19", "description": "Small location and clean bathroom. Tried the afternoon special.  Everything was fine, but to make this place a 4 star or higher, need a different sauce for the meat.  I liked salad and tempura appetizer, but when it came time for the main meal, the sauce was weak in taste and flavor.  Service was fine and attentive, but missing 1 detail in flavor made the meal average as well as the rating.", "author": "Jesse M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-21", "description": "I wasn't a fan of their food. I didn't like the little octopus in the salad. Also when I went here, my dad and I realized we had left the oven on while baking an apple pie, so he had to go home and turn off the oven, and then come back. That might have ruined the dinner, but all in all, the food wasn't so great.", "author": "O K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-24", "description": "I eat dinner here somewhat frequently. The tempura was really good, but I usually just order the Bi Bim Bop, which is pretty good. This place wins because it is nearby my house. I would never come to the Inner Sunset with the intention of just coming here. To be honest, though, I haven't been blown away by any Korean food I've had recently.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-07", "description": "my favorite local spot!  i only order the sizzling bee bim bop and the spicy bbq beef but theyre both so good theres no need to expand my horizons..", "author": "Alison T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-09", "description": "We've been there a few times and always order the chicken sandwich.  We call it in and get it to go.  It comes in a neatly wrapped package, no leakage.  It's a perfect size to sneak it into the movies.  ;)", "author": "Delilah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-11", "description": "Chocolate slut thinks the Hahn's on Polk is better....I say, I can't tell a damn difference.  I love the spicy pork with a fried egg on top and the tasty fruity gum I get with my check.  Now, Hahn's is no Brothers (more authentic Korean), and I don't care, because Hahn's is good!!!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-24", "description": "I ate here a long time ago and had the famous korean bbq chicken. I think it was hyped up too much by my friends because it was super good like it had sounded! The chicken comes with a scoop of rice and also a salad. The portions were also not that big considering the price. I would eat here again but try something different. I havent seen many Korean bbq places in my area so Hahns is an ideal place for me to go.", "author": "Miss H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-06", "description": "Keeping up with the American tradition, bigger is better.  Feel like you could eat a mountain of meat?  Well they have a \"Mountain of Meat\" on the menu.  This was the first one of the 5 Hahn's I've been too and always hold that special place in my stomach.  Great bbq and a decent price for an entire mountain of meat.", "author": "patrick o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-21", "description": "Took my roommate here before she knew of Han's and I couldn't wait to share my love of their bbq chicken. They have decent prices for a straight-forward meal. She liked it. I was happy she liked it. And we kept going back at least once a week for... forever!", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-05", "description": "This place is close to my work, so I end up going for luch quite a lot. I love their lunch menu. Their BBQ meat is really good. Go and try it.............", "author": "Ghiz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-03", "description": "I've been going to Hahn's Hibachi on Irving for a few years now and I usually order the spicy BBQ beef, but the other things on the menu are pretty good, too, such as the noodles. Hahn's Hibachi has a lunch special which is about $6-7 and it comes with BBQ pork/chicken/beef (your choice), salad, pot stickers, and shrimp tempura. I highly recommend going in for lunch, it's worth it.", "author": "Edgar G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "reasonable prices, fast and polite service, and  hits the spot when you're craving some korean food. i got take out bbef bi bim bap from here on my way to the 44 bus stop, and i couldnt wait to get home so i could eat it! they give you a pretty big serving, although they were kind of stingy with the meat, which is where the bulk of the price goes. regardless, the food was good. nothing spectacular and ive had better, but still good enough that im thinking about going back again later this week.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-11", "description": "Tasty, really good food, not greasy. And I love to say \"bi bim bop, please!\"", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-06", "description": "Small sized place but the portions, prices, and food were really good!  I had the short ribs and they gave 3 large pieces, 2 mounds of rice, and salad!  So filling!", "author": "Carmen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-29", "description": "Great place for my lunch when escaping from the drone of the UCSF campus food.  Cheap and satisfying combo plates.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-19", "description": "I love eating at this place. The food is good, atmosphere cozy and the service friendly. I don't mind eating here. I get good service and good quality food. Nothing more I could want.\n\nHowever, they could servre more condiments than just plain Kim Chi. Then again this place is not a true Korean resturaunt..... But great anyway.", "author": "Big C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-24", "description": "Highly recommend the \"Sizzling Pot - Bi Bim Bop with Spicy Pork\".  It's my favorite on a cold day and ultimate comfort food.  Service is not great and it's tiny, but the food is well worth getting.", "author": "Jaemi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "I've gone here twice and I have to say that both times the food was great!  Spicy pork is a must order as well as the Stuffed mushroom Tempura.  If you get the Combonation platter of Tempura it has stuffed jalapeno tempura too which is amazing!  I have to say that this location is a very small place and you shouldn't bring a large group unless its slow.  The first time I went to Hahn's I went with three four other people and the place was packed, I had to sit on the window sill until a chair was available, but the server found me one after a few minutes.  And if you've never had Korean beer order a \"Hite.\"  All in all its a great cheap place to go with a friend or two, but not for a large group.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "I love this place. Good neighborhood food. You can bring a book because it is pretty bright (for my aging eyes). I love how their medium spicy is just right for me!", "author": "Avril S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-30", "description": "Thumbs down for this place!  I went here with a friend of mine two nights ago and what a waste of money this turned out to be.  My friend and I were talking and catching up when the old hag of a waitress comes over and asks if we were ready to order.  We hadn't had a chance to look at the menu yet (we'd been there about 5 mins) and she basically ordered us to order before we talked.  WTF???  You're gonna tell your customers to order before they talk?  Ok hag!  So we ordered the seafood tofu soup (medium spicy) and the BBQ rib combo.  Let me just say that if you want a good bowl of tofu soup take your ass over to Tofu House on Geary because the soup at Hahn's was bland and tasteless.  Not only that but they don't give you the raw egg to crack open and drop into the soup.  The bbq rib combo was pretty much one short rib, one pork spare rib, and one beef spare rib that was each basically covered in the same sauce.  Not too creative there.  Overall the service was terrible at this place, and the food wasn't worth the money.   Needless to say, I will not make a return trip to this joint.  I'll stick to the Korean restaurants on Geary, or in the Fillmore.", "author": "D L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-08", "description": "I used to live right near this place. Their menu is funny - they definitely over-dramatize the food, but in a good way. The Korean BBQ dishes are yummy, and you get a lot of food for your money. Some things just didn't turn out quite right, like the udon and some seafood offerings, but stick with the standards and you'll be fine. I took a group of friends from Pennsylvania here and they were impressed. I like the $1.50 Coronas. Overall, not five star food, but a good place to get a good and reasonably priced meal (and their take-out is fast, too!).", "author": "Tess K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "yummy meats and other eats but much better to take out than eat in. unless you like being ignored for 20 minutes ? I was kind of weirded out by the faded soda cans and beer labels. but ! I really loved the cashier's manicure; you see, these things matter to me", "author": "Prima D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-01", "description": "i originally thought this place was a super expensive korean bbq place but its not. came here for lunch though and it was a cheap $8ish for a rather large plate. ordered the bbq beef+gyoza+tempura special. beef was too salty and strong. they also put sauce over the rice. this wouldnt be so bad if the sauce wasnt salty enough. with the salty sauce over rice i didnt have anything to eat the salty beef with so it was straight up salt if you know what i mean.\n\neven so id still come back if i want a cheap filling meal. ill just tell them to lay off on the salt and the sauce on rice.", "author": "Kyle Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-09", "description": "Weird coming to yelp and finding all the slag reviews of this place. Maybe I was there on an off day but this has been the best beef bi bim bop I've had in SF so far. I know! Weird! I went to Tofu House on Geary the other night for the first time because of all the love that place gets here and man...I spent nearly double on the same dish ($14 I think for bi bim bop) and there was truly little flavor at all! Seriously disappointing. Even after I put the hot sauce all over their bi bim bop, fail. BUT, a couple days later I end up trying Hahn's on a whim and the beef bi bim bop was excellent and only like $8! The beef was very well marinated, the veggies were fresh and plentiful, and the server was actually nice. No, really! She even let us in before they officially opened for lunch because we were just checking out the menu outside. Maybe they are trying to \"beef\" up business but they served a nice lunch. My wife liked the tofu stew as well. Not the best she's had but very good. I'd come back here for bi bim bop anytime if it is like this first visit. Jus' sayin' :-) Get the bi bim bop and you should be happy.  I'm only giving 5 stars cuz they need some love here. Okay, go.", "author": "McKay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "LOVE the bi bim bop. It is amazing a must have. The BBQ chicken and pork sandwich are also amazing but there is nothing like sizzling bi bim bop to satisfy an appetite.", "author": "Katharine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "i gave this place 4 stars. off the bat we were greeted with a warm hello. with the help of the waitress we ordered the spicy pork & chicken, the mountain meat combo, and the spicy tofu soup. just enough for 3 i would say. the spicy pork was probably the best item we ordered. tender and tasty. yuuuum! probably should have just ordered the pork alone for more because the other two guys ate it all and i only had like 3 pieces! the mountain meat combo consisted of pork ribs, beef ribs, and chicken i believe. all was good except our chicken was hard and dry. if it wasn't for the great service and the fact that we got an extra plate of rice and salad probably would have got a 3 star. i really appreciated the extra effort from our server. for some reason we couldnt decide and she saved us some time. i brought my appetite and they brought the meat, that's all that matters!", "author": "mike c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-15", "description": "I climbed meat mountain and I have been reborn.  No longer shall I scoff at other cultures supposed meager attempts at bbq.  And holy cow was it cheap.  I feel like I could become the antithesis of Tantalus were I allowed to take squatting rights over their refuse bin.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-20", "description": "not the best place to go for dinner in the inner sunset.   wish i would have tried something else.  ended up eating here solo and the waitress was slow and unfriendly.  it seemed like it would have been easier to order at the counter.  not really a place one wants to get waited on.  it's also pricey.  i ate the bbq chicken and pork ribs combo along with just a glass of water - $14 (with tip).  loved the bbq chicken not crazy about the pork ribs (they were hard on the bone and the bone looked liked a pigs actual leg).  i liked the dressing on the tiny side salad.", "author": "Keri K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-09", "description": "there's something on the menu aboout a sauce that's so delicious it would make even shredded newspaper taste good.  well, the sauce was just so-so.  the do have some decent spicey chicken dishes though.", "author": "vlad k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-12", "description": "the food was great! but im not a fan of the interior. it wasnt dazzling. \nwe had the appetizer combo (fried shrimp, mushroom, jalapeno that was SPICYYY)... and i ordered the bbq chicken bi bim bop, which was really good! i guess people usually do take-out.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-27", "description": "I always enjoy Hahn's Hibachi.  We went there last night and I was reminded what a nice, cheap and delicious place it is.  It's nice to have a neighborhood joint where you can expect really good food at reasonable prices.  As some of the reviews suggest, the service isn't always the greatest and the atmosphere is certainly low key.  But, hey, just set your expectations before you go and enjoy some tasty affordable Korean food.", "author": "Dave B."}
