{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Really good Hunan food! This location is the best among all chains. The scallions fried eggs and the pork with pepper were fantastic and authentic to the core! Really love them!\nThis is my to-go place whenever I visit my friends in Airbnb, and my to-go face for spicy food whenever I am in town!\nJust authentic Hunan food. Period.", "author": "Tian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "No question, the top, authentic, holes in the wall, spicy Chinese food restaurant.\n\nEVERYTHING IS AMAZING!! Even the most simple dish is fantastic!!!\n\nGo try it itself, and put the stereotype away. You will enjoy it!!!", "author": "Weijia W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Gave this place a try this week.  Not a good idea.  Ordered the beef with vegetables.  The vegetables were some sliced carrots and chopped cabbage.  Not too much beef in the dish.  There wasn't really any sauce, the dish just seemed oily.\n\nBut spending the next morning on the toilet wasn't me idea of fun!", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Lots of people commented that this place sits Chinese speaking people first. \n\n\n- It is WRONG. Whenever my friends and I come, we ALWAYS make a reservation and order dishes beforehand. By the time we walk in this place, all we need to do is to sit down and eat.", "author": "Zheng Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "Wow. Don't come here. I stopped in because I have eaten at the other two Henry's and have always loved their food. This is like the hillbilly cousin of Henry's with no teeth and no understanding of why anyone would WANT to have teeth. \n\nThis place greets you with a funny smell when you walk in. The service was beyond detached; it was intentionally unfriendly. (And I'm an \"excuse me sir, please and thank you\" kind of customer.) There's masking tape over one quarter of the menu; those things aren't available. (Including Harvest Pork, Which is why one should go to Henrys'.) The picture below shows part of the dining room. \n\nBut if you're still undecided, how's this: There Is No Hot Tea. There Is No Hot Sauce. There is just a sad plate of passable chow mein. \n\nJust don't.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-20", "description": "My boyfriend and I are big eaters, but couldn't finish either of our dishes because it was not good whatsoever.\n\nFood was either super bland or tasted odd - definitely did not possess any sort of Hunan flavors. The potato dish was sour, the pork was stale and chewy, and the chicken dish was bland. Where are the spices?! Where!!!!\n\nAnyways, easy street parking right across the street from Nordstrom Rack + Trader Joe's", "author": "Elvi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Although I have never been to Hunan Province, my friends told me that this restaurant provides the most authentic Hunan dishes. I highly doubt what they said until I tasted the food by myself. The food is very authentic and good! From time to time, I have the delusion of sitting in a small restaurant in Hunan near the Xiang River, watching people come and go while pondering over my entire life.\n\nIf you are a big fan of red and green peppers and want to have a bite of Hunan traditional dishes, this is the place to go. If you are looking for a restaurant with five-star service, clean tables and floors, open your Yelp and find those 4.5+ star Chinese restaurants and order your General Tso's chicken with rice.", "author": "Chen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "This place discriminates against white folks. I walked in to only be thrown out and was told dinner would take an hour. Of course it sounded like total BS from the start. Don't waste time finding a parking space in this dangerous area because you'll only get in the door to just be told to leave. A very big disgrace to this once vibrant city hell even 1 star is too gracious! Oh, and prepare to get sick eating there because it looked like the obviously lazy staff don't even bother to clean the tables and dishes. They're running a crap joint and oughta be run out of business!", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Hard to find authentic Hunan cuisine. The pepper they used is super tasty, very spicy and flavorful. My personal favorite is pickled pepper beef. \n\nBut I need to say they used too much oil in most of their dishes. I wouldn't eat here very often if I want to eat healthier.", "author": "Wenjing Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-07", "description": "So sad, really.\n\nI have been going, consistently, to Hunan Restaurants (ever since they were on Kearny Street, in Chinatown, in 1979). Henry, who recently passed, after creating a classic San Francisco institution, would be mortified to see what THIS location of his family restaurant group has come to. \n\nUpon our arrival, the shabby waiter (as it turned out) was standing outside the front door, smoking. After flipping his cigarette into the street he came inside with us. (That's our waiter?!) We made some effort to have our order understood, in English, as he spoke nearly no English as far as we could discern. Not great for someone in a customer service position. After putting down our order we never saw him at our table-side again. Oh, ... except when I called him over and told him that one dish had been delivered nearly cold. \"No, ... hot.\" He told us, and set the dish back down on the table, and left.\n\nThis location, to which I have been many times in the past, is usually very busy at lunchtime. Yesterday, a week day, it was a ghost town. \nNow I know why. \n\nBesides terrible service, the food was abysmal. It makes me sad to say so, but it's true.They have NO dumplings (signature steamed 'pot stickers\") on the menu at all, how is that? One dish that I always order, because it's wonderful, was delivered to our table unrecognizable. I was dark and lifeless; I'm certain it had been previously cooked and reheated to serve. It was very sad.\n\nGreen beans were overly fried and blistered, which made them tough.\n\nDo yourself a favor and steer clear of this place and visit their OTHER location on Church Street @ Day Street if you want the original food Henry designed and was so proud of. There they still take pride in the legacy Henry left them. The manager there, Henry's grandson, Jeffrey, and his staff, deliver the home cooking of Hunan we know and love.", "author": "James G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-02", "description": "The last time I went there there were bugs crawling in the corner and the tables weren't clean at all (sticky and rattling and just dirty). I tried this place again because SO (next door) was closed, and they literally ignored all non-Chinese speakers and seated Chinese speakers who came later first.", "author": "Joanne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "According to my hunan gf, this place serves authentic Hunan food. I've tried several of their dishes and none of them disappoint. The spices and herbs they add to their dishes creates appetizing food. \n\nEven walking into the restaurant feels like entering a new country. All the times I've went, all the people were Chinese. \n\nDishes that are must tries:\n\n- Farmer's Pork\n- Preserved Smoke Pork\n- Cucumber Basil\n- Beer Duck", "author": "Jim G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-02", "description": "This is the worst place you could ever go for dinner in SF. I've been here many times and my waiting time for dinner really differs, it could actually range from 1 hour to 2 hours to even 4 hours!!!!! How could a restaurant without even showing the least respect to a customer's time still be running! I swear to god if I go to this place ever again please food poison me to death!", "author": "Linda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Super authentic hunan food, best I've tried in SF. Only thing is the wait after ordering the food was slightly long.", "author": "Ruby H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-15", "description": "FIRST AND FOREMOST:\nThis review is about their Bryant St location.\n\nBUT:\nIn my memory, their old location on Sansome was iconic. I know it was Chinese for White folk, but that's OK. We had epic lunches there back in the day when the whole area was ad agency row. I still crave Diana's meat pie and that wonderful garlicky and sour chicken rice plate. \n\nDO YOU KNOW:\nThey invented the delicious and now-ubiquitous Chinese Chicken Salad. \n\nTHAT SAID:\nI had lunch at the Bryant St location and it SUCKED. Tasteless. Greasy. Thoughtless lazy food that wasn't worth the calories. Diana's meat pie was bland ground beef overwhelmed by raw onions, all sandwiched into flavorless fry bread. Blecch.\n\nFWIW:\nI packaged up my lunch, largely uneaten, and gave it to some hungry dude on the street -- but apologized for it first. \n\nSO:\nThey have a location on Minna near New Montgomery that still delivers the goods. That's the only reason for two stars. I'll go there.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "The worst restaurant I've ever been. We waited 40min after placing the order and there were still zero dish on our table. Everyone who came in after us got their dishes. There is only one waiter and he is rude and lazy. The place is very dirty and chaotic. A complete disaster.", "author": "Ying N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "This place is F awful.  There are 5 tables including mine, and I waited my dishes for more than 30 mins.  If the dishes are very tasty, I could be fine to wait that long. In fact, the dishes are very salty and oily. I do not even want to rate this place because one start rating is still too much.", "author": "Slu L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "Classic Asian run eatery for Asians. They don't do courtesy well and they don't get the concept of \"service\" in the same way Americans expect. This is hard to explain, but being Asian I would describe it as a very simple minded way of doing business in a straight forward way. If you don't take it personally, and they do enough, it can be okay.\n\nAsians -- Willing to say this is pretty decent grub. I thought prices were good, it was authentic enough and had some good menu items. \n\nNon-Asians -- Probably just avoid this place for your own sanity.", "author": "Jack T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-16", "description": "My WORST dining experience ever. Not \"one of\", IT IS THE WORST FOR MY PAST DECADES. I was so furious when I got out of this place.\n\nThey don't know how to serve clients and that is fine. Evev worse, they don't respect people at all. When we questioned about why the final price on the bill was that high, they were so reluctant to show us the details of the bill. They firstly shouted out to each other \"these people don't want to pay\", then they carried the calculator with such an attitude to our desk with \"I will calculate it for you\", followed with \"each rice is 1.5, you ordered 8 how much is it\" - listen, is it the way you treat your clients? And just a BTW, we just got two large bowl of rice, and I have never seen restaurant charging people for rice in this weird way.\n\nThen I was like \"you said you will do the calculation, right? Please\". And you know what happened then? The waitress just STARED at me at a second with such a cursy look! I swear to God that is the MOST evil/terrible/intimidating stare I have ever experienced. It was like I had done something un-excuseable to her. I got so infuriated so I had to close my eyes, kept silent, and let my friends deal with it, otherwise I was afraid I would just fight with them. And I am not lying - I took out my phone and was ready to call 911 because the crew there had already crowded our table and we had a girl with us. \n\nOh and did I forgot to mention that they charged a dish 35 bucks, which is marked as 25 in their menu? When we questioned, they were like \"you have to pay! Everyone else from such a long while ago paid 35!\" \n\nOh and did I also forget to mentioned that we waited there 60 minutes for our food and the crew there were just sitting in the lobby playing mobile games? [smilence]\n\nTo be fair, their food is ok. But trust me, it is not worthy at all because of their terribly-terrible service - unless you are willing to take the risk to destroy your day.", "author": "Haoxiang L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-16", "description": "Shameful for Henry's family restaurants. Henry was respectful cooker and how come this place under his name as well. \n\nI came here months ago and it was pretty bad, but decided to give another try beacause it's just downstairs. I waited 90 mins for take out in the restaurant even though they told you it was 40 mins wait. When I asked them when would my orders be ready multiple times, no one answered my questions. The reason kept me waiting is I want to see how slow and bad it could be so that could complete my life. They did it and ruled it.\n\nI knew Chinese restaurant usually do not have good service. But this place is worst of all. It even makes me feel embarrassed if you consider this is typical Chinese restaurant.\n\nGo to other Chinese restaurants for your own sanity.", "author": "Dylan X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Real authentic Chinese food! \nDishes are definitely on the spicy side but this is what real Hunan cuisine is like.\nWill definitely return.", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "Born and raised in Changsha, I can vouch for the authenticity of Henry's Hunan. I understand how the one-star and two-star reviews feel about the service - granted it is very lacking, not the best attitude - but the food is so damn good. Flavorful and spicy! The Farmer's Pork isn't as good as other Hunan places in LA or San Diego, but my favorite dish is the pork knuckle. Hands down the best I've ever had, including the ones I've tried in Hunan. I also like the basil cucumber and hand-torn cabbage. Quintessential Hunan food. The Henry's Hunan in FiDi is definitely not as authentic.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Waited for one hour. Other desks who came much later than us got served before us. Staff seemed very impatient.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "spicy is good, recommend egg with chill paper. I really like that dish. everything is good too.", "author": "Yige X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-07", "description": "I waited for 1 hour before I got my first dish. I was hungry, then not hurgry, finally hungry again but still waiting. This is definitely intolerable. Very bad experience.", "author": "Du Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "I live above Henry's Hunan in Soma. The guy, Jason that runs it. Is rude and has a IDGAF attitude that I consistently deal with, daily. He smokes a foot from the door or sometimes doesn't even step outside and his friends/family do the same thing. He will have friends over that go until midnight or one in the morning. I've had numerous friends that have gone in their over the last couple of years and have had the worst service. That is a reason why I will never give him my business. Plus the negative reviews people have left adds to my reason. Jason you're giving Henry's a bad name", "author": "Steven T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-24", "description": "Authentic Hunan food, but with a long wait.\n\nDid I mention the wait is long? It's LONG. A typical lunch combo takes 40 min to cook. As in, you have to wait here for 40 min while they cook it. Plan ahead.\n\nThe food quality itself is authentic. Although, for my lunch combo double-cooked pork, even though I explicitly asked for spicy, it turned out to be not that spicy at all. The really spicy ones are the separate dishes, not the combos. The dishes are much more authentic than the lunch combos.\n\nOverall, a good place to visit if you are crazing authentic spicy chinese food. Just remember to get the individual dishes, and plan for a long wait.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-04", "description": "Been here couple times. I mean the food is amazing. But the service is the worst. The waiter is so impatient. And so pushy", "author": "Clancy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-21", "description": "Can't stand this place. There is ALWAYS some short fat man in gym shorts and a t-shirt smoking right in the front doorway!  Disgusting!!!", "author": "Steve M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "Me: \"We've waited for 30 minutes for our food.\"\n\nWaitress: \"Yeah it'll be a while 'cuz we cook for table after table.\"\n\nMe: \"How much longer do we have to wait?\"\n\nWaitress: \"Let me check.\"\n\n(back from the kitchen) Waitress: \"It'll be quite a long while.\"\n\nWe were so disappointed, starving, and shocked at the waitress's attitude. We started yelping for restaurants nearby. We planned to just stand up and leave.\n\nAnd our food came. And it was amazing. \n\nBut that wouldn't change my 1-star rating and the fact that I'd never be back. The whold experience was just way too confusing and somewhat insulting.", "author": "Shia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "If possible, I will give this 0 score.\n\nYou won't be able to get you food , unless you reserved with your menu over the phone. \n\nGreat, great business model and smart DFS based traversal.  I guess they never care about starvation", "author": "Bo Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-16", "description": "Almost called 9-1-1. Waiters made us feel physically unsafe!\n\nWe were confused about the total cost and asked politely for the bill. What comes next is ridiculous, the waitress gave us an angry look and rolled her eyes and waiter exclaimed \"they don't want to pay\" when we mentioned the price is totally different from the menu (1 / 3 higher). The manager came out from kitchen and shouted at us and said they did same thing to others and why we had questions.\n\nWe all felt this restaurant is DISGUSTING!!! Keep your dignity and what they have done is illegal!", "author": "Expo Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Attention for Chinese people, especially who loves spicy Hunan food. This restaurant, only the Bryant Street one, is the most authentic Hunan food in SF. I've tried other Henry's Hunan but they are not authentic at all. Other Henry's cook for Americans and not spicy. Don't try it. Just go to this location. It's the best. I'll come here again and again. So spicy and authentic", "author": "Meng D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "Four star for the good but zero for the services. Be careful of the bill as we found them charge more than the price on the menu. The price on the chicken soup is $25 dollars but they actually charge $35!! I literally find no more than 10 pieces of chicken? I would say that should not even price it more than $20.\n\nWe noted the bill shouldn't be that high and asked for the details they then tell us the chicken soup is $35 and they have charged other lients for $35 for the past two years! Even though the menu still says $25!! So be careful as they wouldn't even tell you if you don't ask. And what's more rediculous, they accused us of not willing to pay for what we ordered when we say we should only be paying the menu price!! What attitude is that? Besides, they charge $2 for rice for each person but they will just give you a big bowl of rice for your table. If you ask for more after your table finish that big bowl they will charge again for $2 per person. Really had experience and I doubt who would ever want to pay for this attitude???", "author": "Helena H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-07", "description": "Obviously not a legitimate business. Dumpy and dirty. Dirty dishes with half eaten entrees on most of the tables. They wouldn't even look at me much less seat me or take a to go order. Seedy looking patrons. Racist and clearly some front for a criminal element. The guy running the place with the big giant diamond earring didn't seem to know the menu, or any of the prices are even really what the hell was going on. Didn't get a sense that this guy had a whole lot of restaurant experience wink wink", "author": "Jim L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "Horrible service. Sat down and were completely ignored. The manager spent most of the night outside smoking and after we located our server he told us that most vegetarian items were unavailable (including fried rice) and that it would be over 30 minutes to get food. People around us sat down and immediately got service and food. They clearly had preferences for who they wanted to serve.", "author": "Mr. S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "Be aware of being over charged when you come here. The food is not bad, but the service deserved 0 start. I ordered 3 dishes which were 15 for each , ridiculously ended up with the bill of 70 .", "author": "Adele Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "Food quality has gone downhill. No longer as good as it once was several years ago. Maybe due to chef. Or owner cutting corners. Best to go to Natomas or Samsone Street restaurants.", "author": "Will L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "We used to love this restaurant when Jeff ran it\nThe food is ok\nThey won't make all the dishes at night\nAnd the don't seem to give a shit that you are a customer \nHenry would be embarrassed", "author": "Karen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-02", "description": "My \"Eight delight vegetable\" dish was pretty tasty but only had 5 vegetables in it. And mostly boring ones - onions, carrots, cabbage, green beans and a few green bell peppers. I picked out all the onions because I hate them, although they looked nicely charred, and I was left with a half full container. In other words it was half onions, half not particularly delight vegetables. Also, the place is a shambles.", "author": "Dee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-16", "description": "NEVER AGAIN! Love the original location on Minna street so decided to try this place while stuck on jury duty. With any Henry's  location you have to expect grimy windows and impassive waitstaff;it's part of the charm. What I did not expect was to be told that thay did not have brown rice and only had one of three salads on the menu, nor did I expect to wait over half an hour with an empty water glass and no food. I walked out.", "author": "Ian V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-08", "description": "Customer service abysmal to the point of disbelief. The phone line was broken (called several times over 10-15 minutes) so I went there in person to order take out. Once there I was warned that the food would take \"at minimum\" 40 minutes to cook. Asking why resulted in a shrug. When I mentioned the broken phone the woman at the front did not even acknowledge it - most likely it is turned off on purpose. \n\nHow this place keeps the lights on as a Chinese restaurant is beyond me. The food did look good, but there are way too many faster, cleaner, and frankly better alternatives to give this place one cent of my money.", "author": "Tony W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-30", "description": "My partner and I sat down 45 minutes before closing time and the waiter told us it would be a 35 minute wait.  I figured they were just trying to scare us away so that they could close early but he wasn't lying.  In fact they took more like 50 minutes for our food.  After 40 minutes they brought us food and then took it away and gave it to another table.  That was a fun twist to the night.  Service was also terrible.  The waiter made a stink about the 10% tip I gave but my partner wanted to give 0 so that was a compromise.  2 stars because the food was pretty decent...once it arrived.", "author": "Lance D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-06", "description": "I've been working in the neighborhood forever and have eaten here a ton. This branch of Henry's was great up until a few years ago when the folks in charge there struck out on their own and started up branches in Noe Valley and the Excelsior, both of which are excellent (just so you know). A new team took over at this spot and it began to go downhill. \n\nNowadays, the staff here does not seem to give a flying fuck. \n\nI always ordered for takeout. Typically you expect a place to get your stuff ready in 15 minutes or so. I'd order 15-20 minutes in advance, then show up and have to wait another 15 minutes until they made the food. This was a repeated thing, not a \"hey we're busy today give us a break\" deal. After a bit the camel's back was broken by a straw and I swore the place off. \n\nAfter two years I buckled and ordered from them again and didn't get fucked over or anything. I ordered further in advance and that seemed to work. The food was inconsistent though, to the point where there was one instance that was pretty gross due to an excess of salt. I'm talking gag reflex. Cook must have been smoking crack. You'd think someone wouldn't go back after something like that but the food in this fucking area sucks. Henry's, even now, is better than most places (OK if you wanna spend $20+ on lunch each day there are options but I don't got that kind of money). I have, finally, stopped going to this place and I'll tell you why.\n\nRecently one of the regular guys set himself up a little nook at a table right behind/next to the cash register. He's got his laptop set up there and a bunch of other shit, like some people have at their desk at home. He's got a small papasan chair where he sits to play video games on the laptop during the lunch rush. I've seen him full on ASLEEP there, in full view, when picking up takeout. I figure dude lost his apartment in expensive-ass SF and this is his fall back. \n\nHere's what occurred to me though--you got this guy living in Henry's Hunan. Not in the back room or anything on a cot, but in the main dining room. He has his computer and home comforts there and is, I'm guessing, single. It stands to reason that this guy probably fucking jacks off to internet porno right at that spot next to the cash register. RIGHT?!\n\nAnyway, I'm no \"delicate snowflake\" but that kills it for me.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "I love Henry's Hunan but this location isn't my fav. No dumplings at least the last several times I've been there. Other items on the menu aren't available but they don't take them off the menu for some reason, maybe they'll come back? Food still has that nice spicy Henry's flavor but go to the one on NATOMA street if you can. Much better. I do love the Harvest pork and the bean curd with meat sauce amongst my favorites.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-07", "description": "Granted this wasn't our first choice restaurant, as our MSG craving palates initially wanted to dine at SO next door only to realize it's not open for dinner anymore.  Being lazy, Henry's became the fallback plan.\n\nThis place isn't made for the westernized palate.  In fact, I don't think it's made for anyone non-Chinese.  Arrived to meet my friend who pointed out that there were two menus - one in English and the other in Chinese.  Now I've been to restaurants with my Chinese speaking friends and they're always telling me, \"you gotta order things not on the menu!\"  Secret menus were invented by Chinese restaurants, not In-N-Out.\n\nNeither of us being Chinese but both of us with adventurous food tastes was more interested in knowing what's on the Chinese menu so my friend used her phone to translate all the Chinese characters to English.  We asked the waitress for recommendations so she pointed out pork belly, green beans, and I like my chicken giblets.\n\nExcited to try authentic Chinese food, one bite into everything and I could feel beads of sweat dripping down my forehead.  No amount of white rice I was stuffing my face with could neutralize the spice.  Now I handle spice well but exorbitant amounts of spice in every single dish brought out to us that I can't even taste the difference between the dishes is kinda overkill.  This made me wish we went to Panda Express instead for some orange chicken or Kung pao chicken. \n\nMy friend and I usually love leftovers but we passed on this one.  Maybe I just don't get it when it comes to authentic Chinese food.", "author": "Bailey N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "So it's gonna be your favourite  \nOr it's gonna go down in flames\nYou can tell me when it's over\nIf the endorphins high was worth the pain\n\n(I may or may not have a song stuck in my head for too long) \n\nI've been debating if I should review this place because it's probably the best kept secret in Soma, and I almost don't want to share with others. On the other hand this place is not for everybody (as you can see from some of the reviews)... So I'm probably safe! \n\nDon't come here if:\n- you don't *love* spicy food\n- you like Americanized Chinese food more than authentic Chinese food\n- you expect the same experience as other Henry's Hunan chains\n- you are on a date (it really isn't even remotely romantic) \n\nThink twice if:\n- you are not comfortable in an all Chinese environment\n- you consider Sichuan food very spicy \n\nThis place is on a quiet street in SOMA. It has a very humble appearance (looks like it was converted from either a diner or taqueria) with cheap tables and chairs. But if you are an adventurous foodie and want to taste authentic Hunan food, give this place a try, it may just blow your mind.\n\nIt may used to be just another Henry's Hunan, but I think the owner has changed. It still has a regular English menu, but they also make authentic Chinese dishes on the side. They weren't used to be on any menu and you have to just know about them, now at least they are written down on a separate menu.\n\nIf you aren't Chinese, politely refuse the nicely bound English menu and insist on the handwritten Chinese menu on a small piece of paper. If you can't read Chinese, consider bringing a friend who can, or order from my list: \n\nSuper spicy:\n- 小炒肉/pork with peppers. I'm not sure what kind of pepper it is, but it sets my stomach on fire\n- 鸡胗/chicken gizzards. Chewy and nicely flavoured \n\nVery spicy:\n- 猪手/pig trotters. Good way to get some collagen! \n- 红烧鱼/steamed whole fish. Covered with chili peppers, but the fish meat is not very spicy without the juice. It's a combination of spicy and sour flavour (from pickled veggies) which I love. \n- 孜然排骨/cumin pork ribs. Needs no explanation but probably one of the best you'd find in the city. \n- 麻辣牛蛙/spicy bull frog. A little boney, but the meat is worth the work of spitting out bones. This is a very popular dish and it often run out. \n\nMild:\n- 藕片/lotus root chips. Love the crispy texture. It's one of my fav dishes\n- 手撕包菜/hand peeled cabbage with chili pepper. Not that spicy but very flavourful (with a hint of vinegar too)\n\nI suggest that you order one from each category. If it gets too spicy, they also sell sweetened milk and it's the best way to overrule the burning feeling. \n\nOr, you can just look at what dishes your neighbours are getting and demand the same thing. \n\nThe manager (or owner?) Jason is very nice and accommodating. We made a reservation for a large group and placed the order ahead of time. When we got there the table and food were both ready!", "author": "Rachel Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "R U HUNGRY?????? If so, DO NOT GO!   80min waiting time after you sit down and placed ur order", "author": "Jian Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "AMAZING. Yes the service is slow and the food takes super loooooong. BUT, as a hunanese - this is the BEST Hunan food SF has to offer.\nIt's what a human mama would cook for her kid!!!! Don't understand why some ppl gave such low rating. Lol\nPeople, this is the real shit*. Extremely glad I finally found this place :D", "author": "Sophie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "We sat down at this restaurant on Saturday night and were told that orders would take a minimum of 35 minutes because they had just accepted a big to go order. We left without eating - clearly if they want to be a restaurant with seated customers they need to re-evaluate their priorities. Beware of this when you go and ask if they are running behind.", "author": "G M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "The food tastes good. The amount of time taken to cook it is beyond ridiculous. If you don't care about your time, then sure, come here. I've been here 3 times now always hoping it would be better. Each time has resulted in immense regret. On a not so busy night, you have to wait 1h+. On a busy night, a trip to China would be quicker. Fml, I'm sitting here waiting right now - it's been 50 mins. hopefully I'll get my food in 10 more.\n\nupdate: \nactually turned out to take 75m to get dinner. \n\nhowever, I wanted to call out an injustice that I witnessed. they turned away a couple (Caucasian guy and girl) at 730p although they close at 9p, I thought this could be due to how terribly slow they are, but then right after they took in a group of people that consisted of 2 girls and 2 guys all Asian. I didn't think much of it until they turned away a second group with 2 Caucasian guys and one pleaded in mandarin to stay, saying \"even me?\". after they were turned away, another group of 2 girls 1 guy (all Asian) were let in not 2 mins after. from my point of view, this is f'd up.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-05", "description": "Got to the spot was ready to order some good food and the service was terrible.I sat next to a man that looked like he been there for a while I thought he had ordered until 10 minutes later he walked out the restaurant. So the guy is working on a large take out order to go and I'm thinking he's going to get me right after, a couple walks in and five minutes later he takes their order, so I'm thinking he's going to take mine right after Not the case and he ends up taking their order to the back and that's when I made my decision to get the hell up out. F'up my whole lunch I rather spend my money with folks that'll at acknowledge you rather than folks that don't give a shit.", "author": "88 G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-07", "description": "I made the mistake of not calling SO before heading over. When they were closed I made the second mistake of the day and settled for Henry's next door. \n\nDon't make the same mistake!\n\nService was pretty horrible when we needed to ask for small plates and utensils to eat the food we had ordered. On top of that, employees were blatantly on their phones every second they weren't actually working. \n\nLastly, the combo chow mein I had was so oily I picked out the chicken and shrimp bits and just ate that.", "author": "Leina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-17", "description": "What's wrong with this location's management?!!  Do you really not care about local business unless it is your secret and special membership. You're tarnishing the rest of the locations' reputation because you're terrible.\nWe called in a dinner phone order. You said you had no appetizers. You said at 5:30 pm on Friday it would be 45 minutes for 2 dishes.  When we arrived 45 minutes later, you said it would be 15 minutes.  You weren't even busy.\nSO restaurant next door had our take out order ready in 10 minutes, and their food was delicious and their service was excellent.  And, next door restaurant was fully packed, but still didn't disappoint. Your HORRIBLE, and this hasn't been the first time.  \nMay I suggest you change your name for this location to avoid tarnishing the Henry Hunan's name. You seem not to care about attracting new customers or even keeping the local ones who try to patronage you. Thanks for introducing to us to SO by way of us realizing your lack of service was unacceptable and walking out. Right next door they know how to run a restaurant ... it's a shame you can't follow their example or your other locations'!!!!!", "author": "WI O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-29", "description": "Very popular amongst Chinese young tech workers in the SOMA area.  The price is cheap and the Chinese menu can get you some reasonably authentic home dishes (given that SF doesn't really have good Hunan restaurants).\n\nPros:\n1. Portion size is good for the price, especially so for SOMA\n2. Shiso-based Hunan dishes are a rare find in the U.S.\n3. For those searching exotic meat, there are frog legs & rabbit meat\n\nCons:\n1. Some pork slices tasted VERY off and not fresh. It's not unusual trying to hide poor quality meat within spicy dishes. For things such as stir fry pork w. pepper (农家小炒肉), even though the chile peppers are supposed to be the star, the off-tasting pork/bacon was distracting and quite offensive. This is scary considering that this is the dish which almost every table orders (high turnover). Who knows what may be the case for dishes that are ordered less frequently.\n2. Food lacks complexity, even the supposedly Chinese dishes such as Stir Fry pork w. Pepper (农家小炒肉) is quite bland. They use serrano, which is somewhat spicy, but not quite up there for authentic Hunan taste. Wish they add the also some of the readily available bird's eye chilis for extra spiciness, but whatever.\n\nIf you do come during weekdays for dinner, then try to reserve ahead of time. They can get quite busy during dinner.\n\n\n-----\nUpdate: \nI'm pretty sure my friend & I got food poisoned here. \n\n昨晚吃的辣椒炒肉，吃的时候就觉得好像肉坏了，肚子一晚上不舒服，今早还得请假，我勒个去", "author": "Adam X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "I see that lots of people complain about the wait. But the reason is that they only have a few chefs in the kitchen. My friend is from Hunan, and she confirms that this Is As Close As it gets to the authentic Hunan cuisine. The restaurant tried to hired some more chefs in the past, but the taste won't be the same, so instead they went back the old way, longer wait, but better taste. The food can be quite spicy, so be prepared. If you wanna skip the wait, either go early, or order ahead. You can place your order when you make an reservation, or order for pickup.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-24", "description": "Couldn't get a table on a Friday evening after waiting for 40 minutes. No turnovers; everyone hogging tables on their cell phones. Don't go alone; they'll seat groups ahead of you. Wait staff not particularly helpful.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Henry's Hunan catered an event at 111 Minna for me...and the food + service + price was AMAZING. \n\nFrank was so helpful, there on the day of, hand delivering the fresh food. \n\nHe was able to come up with a menu to accommodate even the pickiest of eaters. Gluten free options, vegetarian, and dairy free. Everyone was raving about the food. \n\nHighly recommend.", "author": "Nanette R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-11", "description": "This place used to be great.  But I go back recently and many things are taken off the menu.  They dont even have the chili oil anymore.  Plus, there is always a worker out front smoking.  Not only do you have to wade through his smokey breathy smoke to even get in the place, whenever anyone opens the door all of the smokey smoke breath wafts in.  \n\nPass.", "author": "Terd F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "What a **** is this? I was just so mad about the service. Kind in a rush to go to the gym and ordered one dish for myself. ONLY ONE DISH!!! And I waited almost like 50 min. Is that crazy????\n\nWhen I asked the waitress why my order took so slow but just got the answer that I must wait until all the tables ordered before me to be fully served. There happened to be one table with 10+ people before me and ordered tons of food. Then I have to wait until all their food served!!! For ONE DISH, I have to wait like 50 minutes. This totally drove me crazy. \n\nI just want to say that it is just so ridiculous to run a restaurant in this way. I will never come back again even though the food is not bad!", "author": "Feng W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-14", "description": "Ordered from grubhub, came 30 mins late. Had chicken fried rice, chicken chow mein and orange chicken. \n\nThe only thing enjoyable was the chicken fried rice. The chow mein had little taste, and full of grease.  The orange chicken was super soggy. \n\nWill not be ordering from this establishment ever again.", "author": "Teal M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "the taste is good, the wait is really really long. Just 3 dishes, wait about 40mins. At the end you don't know if it is delicious because of you are starving or it really is good. I drop by the kitchen, there seams only one chef cooking. 3 waitress, one is lying loosely in sofa, one smoking outside, the other one wanting for serving. The waitress told us that chef cook table by table, which means if there is 10 people table before you, the wait could be hours?", "author": "Gigi W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-14", "description": "Slooowwwww service and they don't appear to give an ef*\n\nHaven't tasted the food yet bc we have been just sitting here forever waiting on 2 to go dishes. The only redeeming quality is almost everyone here (patrons, workers) are speaking Mandarin so come here if you are studying Chinese and want the exposure", "author": "yamam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Best authentic Chinese spicy food in the Bay Area!!! Must try if one wants to experience real Chinese food. Exactly what I ate during childhood in Hunan, China. \nThe only complaint is long waiting time during peak hours. I would suggest come in the afternoon between 3 and 5pm.", "author": "Emerson X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "This place SUCKS! no ice, no soy sauce, shitty food and completely disgusting and dirty! If I dont get get sick after this lunch I'll be amazed!", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "Food is ok not very authentic, at a dirty alley and it fits American's taste probably, if you don't Hunan good you have to know they have one of hottest chilly but here you don't get spicy enough even if you ask for it", "author": "Alex Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "The Chinese-only menu has the most authentic Hunan food in the bay area. Probably the spiciest too. The english menu's not bad either.", "author": "Changbai L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-07", "description": "worst service I have ever had. What was worse is the hygiene condition, the glass they put on our table had a lipstick mark left on it! This is insane!!!", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "Slow and chaotic. We waited one hour only to find out the servers forgot to place our order. Then we waited another half hour, the food was still not ready. During that hour and half of waiting, the severs were hanging out with their friends, eating and drinking. Yes! They were drinking with their friends while working. The cashier was negligent and was unapologetic about forgetting to place our order. They even gave us attitude when we inquired about our order!", "author": "Xue C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-04", "description": "What can i say... came at 5:30... 1 hour later... still waiting for my food... service is TERRIBLE... when we asked how long is that gonna be... they said still a long time as most people before you still didnt get the dish... i just got my white rice. If you need to wait 1.5 just to get the food... no matter how authentic it is. Thats just not worth it...", "author": "Nataly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-04", "description": "I've been to Henry's Hunan twice and they have two different menus. An English and a Chinese menu. \n\nThe English menu has regular chinese food you can find anywhere. The Chinese menu has a combination of things that I didn't know how to read.\n\nThe food was awful the first time. I felt like everything was a big goop of randomness and it lacked flavor and salt. I didn't know what I was eating.\n\nThe second time (came with my friend who knew what to order), the food was good. We ordered gizzard, shredded beef, and pork slices which were spicy and addictive with lots of bell peppers, celery, chilis, and jalapenos.\n\nI was confused by the two different experiences. What is going on?? We'll probably stick with going with our friend who knows how to order with the Chinese Menu in the future. \n\nIf you can read Chinese, try this place out. If not, I would pass on this.", "author": "Ingrid C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "Last place on earth to eat at.\n\nHaving frequented the other Henry's locations, I assumed (incorrectly) they had their formula down.  Not the case.  This was probably the most worst experience eating in San Francisco in 15 years.  I could go on and on (and others have it appears) but no need.  This place was filthy, the conditions in the kitchen were deplorable, the service was the worst I have ever experienced and it ended up taking over one hour to get our LUNCH order.  More people walked out after we sat than received their order!  Orders were brought out with no relationship to time sat, everyone was absolutely ignored and they processed a ridiculously large togo order in the middle of the lunch rush.\n\nHenry Hunan's normally means great, authentic Hunan food.  This was disgusting, bland, over cooked.\n\nThey did not even have the Henry's black bean sauce and offered sriracha sauce and old soy sauce packets!\n\nClose please", "author": "chris l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-25", "description": "If I could give them zero stars, I would. Such terrible service. My two friends and I ordered our food. Our appetizers come out 20 mins after. And we're starving but willing to wait. About another 20 mins after that we're starting to get hangry and we get up to ask our server how long our food were going to take. She replies back and says it's going to be another half hour to an hour because they have a huge group of people coming in and they need to serve the group food before serving us food. But that once that party has been served, they'll get started on our food. What. The. F***! We ask her to clarify and she just says it's going to be a long wait because the other group needs to be served first. \n\nFirst of all, what the hell. \n\nSecond of all, why couldn't you fcking tell us that we were going to have to wait so long and wait until the group coming in after us has been served, before we can be served our food? How does that make any sense? Should've told us that from the very start!\n\nLast of all, don't go there if you want people to know what \"common sense / courtesy\" means. She didn't even apologize but asked us to pay for our appetizers instead. Wtf to the max.", "author": "Chia X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "I have not eaten at Henrys for at least a year, though I work 1 block away.  All of the stories of ridiculous waits and rude managers are true.  And they have been CLOSED BY THE HEALTH DEPT since early Sept.", "author": "Ross K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-04", "description": "The food ate was maybe 2 or 3 stars, but based on service, like many other recent reviewers I wish I could give zero stars. A friend and I wandered here for lunch on a Saturday, and it took over an hour for our food to come out. We watched each dish slowly trickle out of the kitchen, one by one, incredibly slowly. I guess they cannot make more than one dish at a time? When we politely asked the waiter to check on the status of our food (which, by the way, I don't think we would have been able to do without my friend who speaks fluent Mandarin), she strolled into the kitchen, came back and told us there were two more dishes ahead of us. No urgency, no apologies.\n\nOn our way out, a couple of diners looked at us and said, \"The first time and the last time we're going here.\" I felt the same way.", "author": "Sidney L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-03", "description": "Where shall I begin?  I'll start with positive aspects, how about that?\n\n1st.  Easy to find as it is directly across from the Benz dealership.  Parking is reasonably easy to find; we went there during Friday rush hour at 530pm.  The place was fairly empty at that time so we were seated quickly and were able to put in our order in a fashion.\n\n2nd.  We ordered spare ribs, chicken gizzards, and \"bo cai.\"  All were tasty and delicious.  The pictures you see on Yelp are representative.  Some look very homemade but the taste is great.\n\nNow for the other aspects.\n\nThe owners have no idea how to run a restaurant.  I feel bad for the 2 older women cooks I saw in the kitchen.  They make a great meal.  I'll give them that but their kitchen is literally run like a home kitchen.  It's like when you were young and you shouted out to mom to cook up your favorite dishes for dinner and she did it.  These ladies have very little prep in the back as far as I could see when I stuck my head into the kitchen.  They are literally making everything from scratch as the orders come in.  THIS WOULD ACCOUNT FOR THE VERY LONG WAIT TIMES that everyone has mentioned on Yelp.  They are literally working dishes one at a time.  Add to the fact that have of their food is stored / refrigerated outside the kitchen downstairs or in the front of house which has the cooks running back and forth...now you've got a recipe for ultimate time warp.  We literally waited 1 hour for our 3 dishes.  When asked why a larger group of guests who came after us received their food much sooner than us, the reason was because they called ahead to order.  (another Yelper had this happen to them as well)\n\nThe front of house.\n\nThe waitresses were fine.  Not rude.  They do their best.  Give them a break.  They are just study abroad students who do not really know the etiquette because they are not getting the guidance from their bosses.\n\nThe manager / boss / owner or whatever was there the whole time.  You could it was him because of his demeanor.  Plus he walked to the back of the restaurant and brought out some expensive looking Chinese rice wine to drink with his friends at a table behind us.  He makes no effort to ensure speed of execution.  No effort to acknowledge his customers and to see how they are doing.  He doesn't take any orders and doesn't seem to care that food service is happening today or the food is coming out tomorrow.\n\nAlthough the food is excellent, this place has many issues in terms of expediting and front of house.  And at ~$50 for those 3 dishes at dinner time with a wait time of ~1 hour...um, there are many other options in SF to satisfy your stomach.  These managers / owners need to realize \"So's\" is literally RIGHT NEXT DOOR.  If they can fix these issues, they will do well.  Otherwise, the rising rent of SF will do them in because in the almost 2 hours we spent there, I only saw ONE table get turned over from 5-7pm during almost peak dinner time on a Friday.  Mind you that when we left the restaurant, it was almost full with one long table of 16 being reserved no doubt for their called in pre-order group which would get precedence over any walk-in's later.  The capacity is ~50-60 people.\n\nIn conclusion, I really want to like this place.  I really want to sample more of their food.  But the wait time is absolutely ridiculous.  The guy at the next table literally ran out of laptop power, smart phone power, and resorted to good ole fashion magazine reading during his wait.  So if you literally have NOTHING to do and don't mind waiting an eternity, come here.  Bring your phone, bring your reading material...but not your appetite initially.  Make sure you give your stomach about 30-45 minutes of pre-hungry time before arriving...or else you might just forget you were hungry!\n\nSo I give it 2 stars...only because of the food.  If it were not for the taste, it would be well....use your imagination....", "author": "Cary L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-27", "description": "This place would serve me, or at least said it was a 30-45 minute plate for one dish, 15 minutes after they open. Very unfriendly and unprofessional, and not willing to serve me unless I was willing to wait, with nobody currently eating in the restaurant. This place should not be open if they discriminate, as they were taking orders from 3-4 other people but didn't say anything about a wait. I will never go back to this location. A few doors down us a great Chinese place call \"So\" that was excellent.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "We're very excited to try this place. Our last office was close to another location and we're all fans of spicy food.\n\nCame into this restaurant today for the first time. We ordered and the wait began at about 12:15pm. \n\nAt 1pm, after quite a while after ordering, we began to wonder if our food was coming. Two other tables had been seated and received their food since.\n\nAfter they apologized, the meal finally started to come out at 1:10 -- one dish at a time, extremely hot. It seemed that didn't even start until almost an hour after receiving our order.\n\nIt was disappointing as I had to leave before even eating due to work schedule. I heard the food was pretty good.", "author": "William D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Best Hunan food in bay area. \n\nI was born in Hunan, China and spent my first 18 years there. Since I came to U.S. 3 years ago I've never found an authentic Hunan restaurant like how Henry's is. The owners are amazing at cooking Hunan food. The food tastes exactly the same as what I could have in the hometown. The pickled pepper beef even goes beyond many local restaurants in Hunan. \n\nYou probably have seen negative reviews about this place. They are probably true but let me tell you my trick. \n - Go for dinner, when they have less traffic. :)\n - Don't look at the menu but ask for the \"special\" menu. My favorites dishes include the picked pepper beef, fried pork with pepper, and pork with smoked bean curd. \n - only ask for spicy if you are REALLY good at it. \n\nBest luck and enjoy the food!", "author": "Huayang G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "Horrendously slow.  Was told it'd be a ~30 min wait for lunch.  Waited over an hour.  I would have stayed if they would have given me tea or even a word that they didn't forget, but got absolutely nothing.\n\nTo top it all off, 2 groups that came in after me got their food already.", "author": "ninpou k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "Great food. Fast service. Extremely polarizing reviews. Note that they have a chinese menu that has dishes not on the english menu. We got 2 dishes recommend by another reviewers (a guy from hunan) beef with peppers, egg with peppers. \n\nBeef has good sauce, extremely spicy. I like more spice than most people and i had to take some of the peppers out.\n\nI was wary of an egg dish for dinner but it's shockingly good. More egg flavor than other eggs somehow, not spicy compared to beef.\n\nI have never seen a place with as many 5 star AND 1 star reviews. All the 1 stars seem to be about service, our food came out in under 10 minutes. Our waiteess was nice, and according to my wife very helpful.\n\nAddendum: Came back and got the egg thing along with a pork belly dish. Eggs and bacon for dinner. 10/10", "author": "J D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-13", "description": "Went for lunch, early, and put in our order before the place filled up.  Waited 50mins for our food, which came after a party of 8+ got their food, when they arrived well after we (3 of us) had our orders taken.  Got the food to go and tipped two dollars for them having even completed the order...  Eating the Mongolian Beef now, and it's too salty.   Makes it seem like they rushed our 50min dishes.  If we're going to wait that long, it better be good.  Shouldn't have tipped at all.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "Forever wait. Waited almost an hour for a single dish of fried rice. And it tastes just ok.", "author": "Howard Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "Bad service, and environment is also bad. Servers seem to be arrogant, and it took over 1 hour to get only 4 dishes.", "author": "Winston Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-15", "description": "The food is amazing, but the service is incredibly slow. Don't expect to eat within a normal lunch break. Also, in recent months, the menu has a lot of redacted items. My favorite ten, their hot and sour soup, has been permanently removed.", "author": "Marcus B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "This place prepares authentic home-style Chinese cooking. I spent 2 months in a village in China and this food is on par or better. The food can be as spicy or not spicy as you like, provided you are not spice intolerant. This all comes from the \"secret\" menu. If you can speak but not read Chinese they will help you navigate the menu, and are especially friendly to non-native Chinese speakers.\n\nAll this said, know that Friday and Saturday evenings can be very busy. Also I can't speak for their English menu because I don't care for Americanized Chinese food.", "author": "Marc V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "I have stayed in U.S. for 8 years. And it is THE BEST (not one of the best) homemade Hunan style Chinese food I had so far. \n\nThe food come slow but it worth waiting, specially you like spicy Chinese food. If you like typical sweet and sour American Chinese food, this place is not suggested.", "author": "Richie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-28", "description": "I LOL'd that they had a \"People love us on Yelp!\" sticker on their front windows.  Yeah right.  People love their OTHER restaurants on Yelp! is more like it.\n\nDon't bother coming here for lunch.\n\nThe place is depressing and so unlike their restaurant on Natoma.  \n\nVibe I got from the servers were like they were serving out a prison sentence.\n\nFood took 40 minutes to come out.  Seriously.  At lunch.  I was a party of one ordering off the lunch menu, not some special dishes for a party of 10.\n\nNo place settings on the table..  Had to ask for a napkin because there were none.\n\nFelt like I was eating a funeral parlor.\n\nNever again.  Natoma all the way.  Not even in the same ballpark.", "author": "Darren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Easily my favorite restaurant in Bay Area featuring spicy food! I have been here countless times and brought many friends who love spicy food here! Never had I been disappointed. \n\nIf you are ordering from the printed menu, you are doing it wrong. Jason(the owner) always keeps his daily menu on a handwritten piece of paper. So if you want the real deal, looking at the right menu would be step one.\n\nI normally go for \n小炒肉/牛肉，spicy minced pork/beef\n辣椒炒蛋，eggs with pepper\n辣炒鸡胗，spicy chicken gizzards\n苦瓜炒蛋，bitter melon with eggs\n啤酒鸭，beer duck\n蒜香骨，garlic ribs\n剁椒鱼，fish with pepper\n\nIt is the best if you can go with someone who's able to read Chinese and understand authentic Hunan cuisine flavors.\n\nEvery time I come here, I sweat my ass off, and steam comes out of my head. \nOh boy, just think about the experience made me feel like Pavlov's dog now...\n\nHowever, your experience largely depends on what you order and if you love Hunan spiciness.", "author": "Cheng C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-08", "description": "I said for one person.  The fucker said no.  Clearly there was a seat there.  He said he is too busy.  I wouldn't go here.  Service is soooo bad.  One word \"discrimination\".", "author": "Francis A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "Used to be a great place, frequented it for 10+ years. Food is probably still good, assuming you manage to place an order. I would recommend you visit the Church location instead for an all around better experience.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-07", "description": "1st timer here and wow! What a let down! Read reviews and saw that it would be a good idea to call in a order because of how slow the service is. 1:15 phone order for beef and string beans over rice. Only one order to go mind you. \"20 mins, come and pick up\". COOL! Not bad, I get there at 1:40... 20 more mins, still not ready. 2:05, finally get my beef and string beans over rice! Walk back to the office and open the bag, mmmm smells good, open the container... WTF! (Wendy's commercial pops in my head) Where's the BEEF!? Not worth my time to go back and be a jerk... Oh well, you win some and you lose some.", "author": "Manny D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "We went there yesterday and was Very Disappointed. We usually go to Hunan on Sansome St. off Boardway and Love the Food and Service but they're close on weekends. From the time we entered we were not welcome and had to ask for menus after seated. We started ordering and immediately was told the item was not being served. We ordered something else and again was told it was not being served. Finally there was an item that was being served and after the 3rd food item the waitress said that would be enough when we're use to ordering several items and sampling each plate. My mom being 92 we didn't want to drive her around for something else. The simplest thing as sodas (sprite) they were completely out. The food was salty and came out slowly one at time. Being Filipino I noticed the items that we tried to order but was told it was not being served was actually served to another table across the room to a group of Chinese couples. Chinese couples that entered the restaurant after we were seated received their food before we did. The restaurant was small enough that I can actually see what was served to that table. We were DISAPPOINTED and STRONGLY do NOT Recommend Eating at this Restaurant.", "author": "Victor V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Great place if you're native Chinese. Food is great and authentic Hunan. Make sure you go with your Chinese friends because there's a Chinese only menu that has the authentic dishes.", "author": "Eric Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "As a person from Hunan, I'm highly recommended this restaurant! Even though the decoration is not that good, the flavor& feeling is soooo \"Chinese\" and Hunan. \n\nFYI. They have some dish which is very authentic you should make a reservation in advance.", "author": "Yvonne L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "horrible service;\nsalty & oily food;\nplain rice was horrible (people don't know how to cook rice)\nshit hole of a place;\nHad to order a beer to wash my salty & oilyass food down and to numb my anger from the horrible service.\nI WILL NEVER RETURN.\nWish I could give it 0 stars.", "author": "N L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-30", "description": "**Disclaimer: Big fan of ethnic hole-in-the-walls so I'm used with okay to bad service. As long as the food is bomb, I can overcome it.\n\n\nStopped by Henry's since SO was closed next door. I usually see a line out of Henry's so I decided it was the next best option. Found a table for me and my buddy. \n\nWe were seated fairly quickly and got menus. Took a few minutes to order and started chatting with the table next to us. They ordered a spicy dish too hot too handle, so they kindly offered us some while we waited for ours. Friendly atmosphere, right?\n\nHowever 10 minutes became 30 minutes, and soon close to 45 minutes ... we were getting impatient. I tried waving down a couple of waitresses but they made eye contact and ignored me. Our food finally arrived: Henry's Special, Shredded Pork w/ Veggies, and steamed rice. \n\nHenry's Special 7.5/10\nShredded Pork 4/10 (pork smelled rancid)\nSteamed rice: It's steamed rice -- just tasted a bit dry. \n\nDecent food but the wait won't have me coming back. There were 3 empty tables around us you can't say the place was packed. Also, there were people walking in the kitchen and out, having cigarettes, and slamming beers. Hard to tell who worked there and who didn't ...\n\nI also spoke to a regular there. She said the wait is usually that long, and you usually have to call ahead and sometimes order ahead. Kind of ridiculous.", "author": "Tee T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "Racist racist racist. If you Chinese you get service here. If not you ain't. Plus they were chopping things in a dirty and unsanitary room near the bathroom. Go elsewhere this place is the dumps!", "author": "P D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-21", "description": "This place is an absolute horror. I got one word for you. COCKROACH.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-12", "description": "I found it, guys! The restaurant with the worst service in the entire world! Incredible. I wanted to take my (now ex) friends to lunch so we walked down the block to Henry's Hunan. We were tempted to go to SO right next door, but I've had a terrible service experience there as well.\n\nWe sit down and 10 minutes later they bring us menus. Another 30 minutes go by before we have to wave a server down so they'll take our order.\n\nI'll save you some time: It took them 1.5 hours to bring us: sweet and sour chicken, kung pow chicken and fried rice - all of which was probably cooked in a microwave.\n\nMy friends broke up with me on the way back to the office.", "author": "Joshua I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-31", "description": "Worst service ever. Sat down and ordered, waited for 30 mins or longer. We saw 2 large tables came in after us all had a full table of foods, so we asked why ours was so slow. The waiter said \"they had reservations\". Really? Even when it comes to bringing food to the table? We asked him to check on our food and he said \"it's not ready\". We said in that case we would like to go some place else, he said \"sure it's up to you\". I will never come back to this place.", "author": "A J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-31", "description": "Foods cheap, but just alright. Service is extremely slow. If you're in the area, go to SO instead.", "author": "Liz Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-08", "description": "Worst experience ever.\n\nWe sat down and ordered food. Waited out for 30 mins. Nothing happened. Asked for when the food is ready. They go \"don't get inpatient\", \"those folks sitting there waited for two hours for food and they don't complain\", \"really? Nobody told u guys it would take at least one hour for food?\". Finally had some food, but not the food we ordered. No apologies. \n\nNever coming back again.", "author": "Li L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-24", "description": "Called and ordered two dishes: pork and frog. We were craving for the frog, so we were willing to wait for an hour. But when we came and picked up the dishes, they made pork and something else. And told us that we didn't order frog. And the manager was super rude, no apologize or anything. \n\nThis restaurant is super slow (avg wait after order is 45 mins). when you done in. When you order pick up, they just mess up your order. \n\nWill never eat here again.", "author": "violet s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Henry's Special (bomb)\nHot Sour Beef (bomb X2)\nOnion Cake (skip)\nDiana's Special Meat Pie (oh yes!)\nDry-sauteed String Beans (Divine)\nDumpling's (yup, I'll have 2 orders)\n\nLocation kinda sucks and so does parking but way worth it!", "author": "Carla F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "The best Hunan food in Bay Area.", "author": "Huahan Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-31", "description": "Seriously, what did I do to piss this restaurant off??  I honestly don't know but I must have.\n\nAnyway, here's what happened.  This place is a neighborhood joint and I already went there once and it was ok.  Here are the subsequent visits:\n\nVisit #1:  Placed an order via phone.  Was told it'll be 35 mins.  Ok, showed up 40 mins later - they said I must have called the wrong restaurant because they couldn't find my order in the kitchen.   Ah, no, I showed them the call log on my phone.  They tried to blame me still, \"You didn't call us and that's why we missed your order, it is YOUR fault! Sorry.\"  But how do you expand your phone number in my call log?  \"Sorry, it is your fault.\"  I then asked how long will it take if place an order now?  \"One hour.\"  Seriously??  Walked out.\n\nVisit #2:  Not really an actually visit but I called them and tried to place an order.  \nHH:  It will take A Hour and a Half, do you still want to order?\nMe:   Come again?\nHH:  One hour and a half wait, do you still want?\nMe:  But you guys close in an hour.....\nHH:  Do you want or not?\nMe:  Hell no.\n\nVisit: #3:\nMe:  How long is the wait this time?\nHH:  15 minutes.\nMe:  Cool, give me a large hot and sour soup.\nHH:  Sorry, we don't have soup.\nMe:  Huh?\nHH:  No soup today.\nMe:  It's only 5:30 pm and you're out of soup?\nHH:  Yes.\n\nThis can't be all coincidence.   I don't know what it is, but somebody at HH is mad at me.  Oh well, I guess I'll have to go somewhere else; it's for the best.\n.", "author": "Sammy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-02", "description": "I live nearby, and for many years this was my go-to place for great Chinese takeout when I'm in my SF place.  Unfortunately, the quality and the service have been noticeably declining for a long time, which is weird, since the same owners have a number of other restaurants around the city that seem to still be as good as ever.\n\nRecently, I've had long waits for take-out food, after I'd phoned ahead and arrived at around when they'd told me the food would be ready.  Tonight, I couldn't get them to answer the phone at all, but according to their website, they were open.  The answering machine was full, too, so I don't think it was an isolated incident.  This particular restaurant must a really bad manager at the moment; if you want this food (which is quite good), go to another one of their locations.", "author": "Lawrence S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "Came in 815pm. Half of the restaurant is empty. Only one waitress. I Order one simple dish- pepper fry egg. Now is 845pm. But My dish is still not ready. It appeared this restaurant needs more staffs.", "author": "Fangfang O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "I was going to give it one star since I waited 20 minutes in an empty room for service. 2 other people walked in and we're served before me. But then I got the food.....man, I had to rate better even though the service continued to be horrendous.\nAdvice? Don't be in a hurry when you go to eat there. But the food...is awesome", "author": "Kym M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "I've been going to various Henry's since 1975.  They are uniformly good, fast and cheap and this one used to be no exception.\n\nWent in for lunch with a former coworker a couple of weeks back.  Sat at a table. 10 minutes later moved to another table. 10 minutes later order was taken. 10 minutes later plates were brought. 20 minutes later no food.  Had to go to a meeting, so we cancelled our order. My former coworker said \"F&*ing noodes shouldn't take so long.  And the guy said \"F**k you:\" as we left. Nice.", "author": "Darien W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-18", "description": "This a review of my first and only visit to this restaurant.\n\nI was really looking forward to this place. I went at around noon and ordered the chicken and Napa cabbage w/ a side of brown rice. 30 minutes later my food had still not come, and I'd heard nothing back from any of the wait staff. I asked where my food was, and the waiter ran back to kitchen to check on my food.\n\n5 minutes later, my food comes out, with white rice. I had to remind the waiter that I'd ordered brown rice. The dish itself was the most hacked together, bland, and mediocre \"chicken in brown sauce\" concoction I'd had in a while. It was the sort of dish you'd expect at some americo-chinese cafe owned by rednecks in the middle of Idaho. Hella unimpressive. Ugh.\n\nI really had high hopes for this place, and I suspect my experience was a one-off due to the clueless and oblivious waitstaff not having their sh*t together. I'm going to try the other locations: hopefully my experience there won't be as retarded.", "author": "Steve Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-12", "description": "Would have gave zero star to the customer service if I could. For the past 8 years living in San Francisco, I have never encountered a restaurant the customer service as awful as this one. The twice I visited here, I averagely waited for more than 50 mins for foods to come out. I was told by one of the waiters arrogantly and somewhat proudly that the averagely waiting time is over 45 mins. The two waitresses seem hate their job being a waiter and serving people. I haven't seen one smile lit up on their faces all the time. The last time I cancelled my order after a 70 mins waiting, even though I called half an hour ago for reservation. The taste is actually okay and plenty of parking, but I'm not coming back again.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "My friend from Hunan told us that he would drive every two weeks with his girlfriend to have food here from sj. So when we were tired and hungry and desperate for some authentic chinese food, he suggested here. You can reserve for a table and order online here. Spicy food were awesome!", "author": "Chang L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "They had nothing in stock.  Almost every dish we wanted they said sorry no have.  Horrible service.  The staff just does not care about service.  Will never come back here ever again.", "author": "Konala-Xingmei L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-12", "description": "The food is amazing if you love spicy.  However, like what other people mentioned, the wait time after ordering the food is so long~~~~~~~~~~  I waited about 70 mins, AFTER I ordered the food.  This is so different from all the other Chinese restaurants.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Authentic Hunan style, and cheap! Some might be too spicy, 紫苏黄瓜很好。", "author": "Jianfei H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "This place is a legit hole in the wall hunan chinese joint. LEGIT. Owners, employees, everything is 100% chinese from the motherland. Even the dirtiness and flies in the bathroom. Yuck. \n\nThe food is blessed with hella hunan spices and will make your poop come out like lava. I had the unfortunate experience of exploding hunan poop several times the next morning (I had it for dinner). I expected it since the place isn't the cleanest. I can't imagine what the kitchen looks like if the bathroom was filled with dead flies on the wall. \n\nI'll probably be back cause the food is on point hunan but I'll definitely keep my schedule open in the morning next time.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Slow (super) service, low key presentation of food, but quite tasty. Of course you need to order their special daily menu, which is not written down. Always ask the waiter/waitress what they have for the day, most of the stuff on it are quite authentic and tasty.\n\nTry:\n- stir-fried pig ears\n- frog with pickles\n- beef pancacke: this is funny, with cheese and lettuce in it and a crunch face. It feels like a Chinese-Mexican fusion, kind of Chinese quesadilla?", "author": "Tian W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-25", "description": "Stay away. As hard as this is to believe You can sit at the table and they will look at you and not bother to take your order. This has happened twice now and I'll be damned if I go back.", "author": "john k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Best hole in the wall Chinese food in the city. We have not had a dish we have not liked. Friendly staff and quick to go service. Seriously if you have not eaten here you gotta try it. We love the meat pie and chicken chow mein. A good kept secret in the city. There are three locations. We go to the natomas location.", "author": "Melodie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-15", "description": "If this the first or second tine I won't say a thing.\nBut this is absolutely unacceptable that each time it takes more than 90mins to get my takeout while they  tell me it only takes 40.\nThis would be my last time ever.", "author": "Qiming L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "OH MY this place is AMAZING!!!\nWe tried green pepper fried egg, catfish soup and beer duck. I cannot believe how can the chef make fried egg, such a simple dish, so delicious.\n\nTo those who gave this place only one star: It's not wise to order spring rolls at such an authentic Chinese food restaurant. It's like ordering pizza in a sushi bar or asking for Chinese fried rice in an Italian restaurant. If you really want spring rolls or General Tso' chicken, please go to Panda Express.", "author": "Chenguang W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "I don't think the owner really cares about the business or the customers. Their target is probably Chinese people who learn abt this place from their friends. It's probably a side business for the owner. \n\nThe food is good if u want legit Chinese spicy food. You should definitely call ahead to order or u will end up waiting for hours. They prepare dish one at a time. There is no efficiency at all here. If u come after a large party.. Well sucks for u..\n\nThink twice before u come.. Or just call..", "author": "Heaven C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-27", "description": "With the current \"cold\" weather, I thought I try my best to make this review \"Hot\" and \"Spicy\"!\n\nWhenever I worked nearby, this restaurant is one of my lunch spots. I've had every item in the menu and the food is good. The owners and workers always give me the royal treatment. I come here with a big appetite and leave with a happy face. \n\nYesterday, I was here for lunch and ordered the Kung Pao Chicken. For $8.00, I get a plate of diced chicken with Red Chilli Peppers, diced Water Chestnuts, scallions and their own blend of spice to challenge my taste-buds. I also get a fat bowl of rice with my meal. \n\nAnd these guys know I love my dishes \"extra spicy\". So spicy, I was perspiring continously. The most perfect meal to spice up the holiday season. \n\nPaid with my Mastercard for my lunch.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "Came here around 11:50 am and ordered to go.\n\nGot country vegetables which consisted of stirfried cabbage, carrots and tofu. It was what I expected so I was content\n\nGot the curry chicken without bell peppers. They use white meat so that was different for me . But it was also good\n\nBoth needed rice to balance out the flavors. \n\nOnly had to wait 8 min from when I ordered so It was a good experience .\n\nI would come back for the meat pie.", "author": "DOM d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Okay, a bit of clarification for those that aren't in the know. There are many Henry's Hunan's throughout the City. I've eaten at all of them but the one in Noe Valley. This is not a chain. This is a family. One brother owns this one, another brother owns this one, this one is owned by an uncle - you get the gist. In fact, I was talking to the guy at the other SOMA location - the one on Natoma, which was closest to one of my last jobs - many years ago and he was telling me which family members owned which ones and how many other family members worked there. I didn't memorize it.\n\nAnother caveat: I had my rehearsal dinner at this location, on October 30, 1998. My mother picked up the tab, just as she had for my sister's rehearsal dinner. I told them how many people to expect, I ordered a bunch of stuff off the menu, I told them to add any other dishes they thought would be good, which they did, and the food was hot and ready when we showed up. My mom paid about a third that she paid for the chain restaurant for my sister's dinner, and we had leftovers. I said, it's nothing fancy, but everyone said oh-my-god-that-was-so-good.\n\nThe decor is not exquisite at any location, though I like the space at the one on Natoma. I worry about this particular location, because it never seems busy, although I think they do a considerable amount of takeout. My husband in conversation one time (we used to get lots of takeout when we lived South of Market) with one of the Giants fans who works there told my spouse that the clubhouse manager was always stopping by to get takeout before games. I hope that's still true.\n\nSo this last weekend we stopped in. It was a nearly empty restaurant on the first official Saturday of Chinese New Year. Our guy was limping as badly as my husband (they exchanged notes later). I was a little uncertain. But my three favorite dishes - Diana's special meat pie, the chicken salad, and Henry's special - were all still as good as I remembered. That's right. They tasted right, something that's difficult to do across so many restaurants across so many years in a picky-ass restaurant mecca like SF. Well, when you do something well... Our food tasted right, tasted good, and we were all happier people suddenly.\n\nThere was something monumentally satisfying about the whole experience. Since the whole unemployment-pregnancy-move-to-Oakland thing, I haven't been in a Henry's Hunan since some time in 2008. And the guy at this restaurant, the one with the limp, said to me: You used to go to the South of Market one at lunch, right? That's the one owned by my uncle. Uh, yeah - all the time. A couple of times a week, usually after 1 or 2. And I'd stop by in the early evening and get takeout. And he remembered?!!\n\nMaybe you can go home again.", "author": "Ingrid J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "This place has great, reliable Chinese food. I go here frequently -- it's a block away from where I work. \n\nPrices are decent, and portions are good. It's often very crowded, but you can usually find a table. Only thing to be concerned about: sometimes longer than usual wait times for food during the lunch hour.  \n\nFor vegetarians, I strongly recommend their dish called \"Chinese Green,\" which is basically steamed bok choy in a delicious garlic sauce.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-15", "description": "I've been here twice -- sat down, ordered food, then waited 30 - 45 minutes.   The food has been good when it arrived, but the wait after ordering is just too long.  Unless the management can hire more or quicker cooks I won't be back.", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "I actually stumbled upon Henry's Hunan because SO was closed randomly one day. It's got some authentic Hunan food and also Americanized Chinese food for people who enjoy either! So I usually hate tofu, but my friend ordered it -- and it was quite good! I consider that a feat in itself. I got the sweet and sour chicken, which was kind of fried first with a sweet and sour sauce drenched on top... Yummy and a little more unique!\n\nService was fine, and atmosphere isn't too special. Not necessarily the safest place late at night though.", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-30", "description": "If you only want some apparently good food but do not care of your own dignity - come here. \n\nI had my first attempt to dine here, but I can't stand the condescending attitude and constant ignorance of the waiters/manager of this restaurant.\n\nWe came in and were seated. Order taken quickly but we were told to wait 40 minutes - FINE, a lot of popular restaurants are like that.\n\n\nFirst shock came 20min later. Another table vacated, and that's a corner table. We were asked if we want to move there - OF COURSE. Then ridiculous thing happened - a Mexican couple who came in 5min ago were seated at our old table immediately after we were moved to the better table. I'm not trying to extend too much - but I'm Asian, my friend is Asian. The look from the Mexican couple was like \"why the f they were treated better\". I have read similar discriminative treatment in other reviews...\n\nThen 40 minutes passed - no food. 60 minutes passed - no food. To me, it's ok if you can't provide food as you promised - everyone in the world slips on their set timeline. But no explanation. And even worse, we called the waitors with the attempt to get explanation - what we received is ignorance - like we were vacuum.\n\n\nAt this moment, the Mexican couple who came 20 min later than us got their dishes (multiple dishes). I don't know what's going on there. \n\nWe made a decision - LEAVE. We want food, but we also want to be treated with respect.\n\nFunny thing - when I stood up, a young waitor finally realized we are leaving - and said in mandarin \"those guys just leave like this?\" Honestly, kiddo, with all the ignorance and lack of respect of your guests time, you don't deserve an explanation from me, just like you don't think we deserve an explanation from you why the food is nowhere after 70minutes of waiting.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "I am from Hunan and I am thrilled to find this place. This Henry's Hunan has secret menu that represent a very authentic taste of my hometown. It almost made me cry. Whenever my parents were visiting me, I brought them here. Love the food! Be sure if you can handle the food, cause it is very spicy ;)", "author": "Jessica Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "I am not a big fan of Chinese \"fast food\", but I am also open to try new things and give places a chance. I am well aware of the lack of customer service of majority of Chinese places I've been too (although some are great) but this one takes first place out of all and really brings it to a whole new level.\n\nI came here for the first time and sat myself in front of the waitress taking orders. I politely asked to see the menu after waiting for some time. After looking at the menu for some time and trying to get eye contact with the waitress getting orders, no one approached me to get my order even though I was in front of the servers, I then politely asked for the server to get my order.  After waiting for 40 minutes, I decided to follow up on my order only to be told that it was going to be another 15 minutes, thats almost an hour of waiting.  I asked them why does it take that long to make garlic chicken hoping to get an honest answer that someone dropped the ball, she then replied by saying \"there were a lot of people before me, do you still want your order\"  do I want my order? I wanted to burn the place down but that is obviously not an option. And the waitress didn't even apologize. What really happened was she forgot to place my order and didn't have the decency to admit it.  Oh well, I guess it goes with out saying that I am never going back to this place again.\n\nDon't expect this place to respect your time so be prepared to wait.", "author": "John G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "I've been a fan of Henry's food since it was just the single storefront on Kearney. And I've had good meals at the franchises on Mission, Sansome, Natoma and Sacramento. But the management on Bryant Street is incompetent, rude, and openly hostile to (attempted) customers. I called in a simple order for pick-up and was told it would be ready in 15 minutes. I arrived as instructed, paid for my food, and then waited another 20 minutes without explanation. When I asked the manager when he thought my food would be ready, he yelled \"do you want your money back?\" I actually just wanted my Henry's Special (which is usually excellent) but apparently had no choice. My money was returned with no apology.\n\nHey, I like their recipes -- and have had good experiences at the other Henry's -- but I'll never return to the Bryant St. location. Too many choices in SF to be treated that poorly.", "author": "john k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-26", "description": "first time at this Henry's for me. \nusually go the the sansome one. \ntried an old favorite the dumpling. either my bud's changed or the dumpling's changed.\n\neats: dumpling(4.5)\n-skipped the hot oil, what was left is the soy sauce. lots of it. not so good\n-6ish dumplings had dryish meat inside, not juicy.\nshould go with the hot oil next time\nor the henry bacon lunch special over rice\n\ntakeouts:\n-order took about 20 minutes which seems a long time.\n-decor is very casual. kind of rundown,\n-fanny's packed down the block.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-16", "description": "We came in at lunch time. For 15 minutes no one came to take our order. After they did the people who came after Us were getting their orders before us.Service Sucks.", "author": "Harsh A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "Really great authentic Hunan food! This place is perfect for people that want a nice spicy meaty meal. My personal favorite are their ribs. At lunch they also provide free sweet and sour soup! The only thing I would say though is the food tends to be on the over salty side.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "Super Cheap Chinese food with huge portions.\n\nEverything tastes okay, but to me it seems that all the food has the exact same sauce/taste to it with a different meat type.   \n\nGet: \nString beans and shrimp or beef\nFried Cod\nKung Pao Chicken\nShort Ribs\n\nOkay:\nMeat Pie", "author": "Steven F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "OMG!! I am part Chinese so I can tell you that this is the closest thing to authentic Chinese food besides my mom's cooking! The dumplings are to die for, the sauces are peppery, hot goodness; and the atmosphere is so friendly!! I love this place!!", "author": "Addy Belle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "wow. this place has very tasty food and great portion size.\n\nthey are beside \"SO\" which is also a great place. i would rate more to henry hunan.", "author": "Kumar G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "I work pretty close to Henry's Hunan and I've been coming here to eat at least once a week for the past couple of years. I'm pretty sure I'll keep coming back until something drastic happens. \n\nJason and the crew there is very nice and always working hard to give the best service. Sometimes the food can take a couple minutes more to be ready, but those extra couple minutes make all the difference when making food, let alone great food. \n\nThey have lunch deals that will keep your wallet heavy, will satisfy all of your taste buds, and will probably leave you with some to eat later. \n\nThe DUMPLINGS are amazing!!!", "author": "Johnny K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-23", "description": "I gave this place 2 stars because what I saw on a menu was meet pie for 6.50. However i wanted a replacement of beef instead of pork I was recommended huang style beef but an extra dish of beef was included on the side which resulted in paying almost $20.00.", "author": "Azziz I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-26", "description": "I'm lying at home wondering if this nauseous feeling is going to get worse. Food was terrible- I never should have continued eating- it seemed a little \"off\". (Sweet and sour chicken). They were out of soup AND spring rolls  (what Chinese restaurant runs out of soup or spring rolls at 6pm???!?). They forgot the appetizer. I had to get up to pay and when I asked to take the leftovers home the guy handed me a bag and two containers. Oh, and bathroom was one of the more disgusting I've seen in a while. Strange how this location can be SO much worse than the others. Never again.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-29", "description": "Terrible service! I waited for 70 minutes but I got nothing! I will never go there again! Never ever!", "author": "Yiping L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Henry's is amazing. It's awesome Chinese food and made quick.  My go-to picks are pork fried rice, chicken with vegetables, and broccoli chicken. And you get free tea with your meal if you dine in. I've been to the North Beach locations dozens and dozens of times over the past 3.5 years and never had a bad experience. LOVE this place!", "author": "Kristy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "Awwww,  Henry's is the MAN.\n\nEvery time my former boss would say to me, \"Let's get Chinese today\", I would do the human version of a tail wag. \n\nHenry's food is consistently good. Prepare to come hungry, as their portions are HUGE (A.K.A. 'Family Style'), and since I don't like sharing, I like to see if I can finish the whole meal in one sitting, because I'm a fat-ass. \n\nLunchtime is particularly hectic for these guys, so call ahead if you want your meal to-go, as it can take anywhere from 15-20 mins to prepare. \n\nMy former co-worker and I loooooved the Kung Pao Shrimp. It's right on the cusp of being 'too spicy'. Ohhhh, how I miss their Kung Pao Shrimp. Our bosses loved the Spicy and Hot Rock Cod Filet. \n\nSometimes these guys will throw in some Spring Rolls at no additional charge.\n\nAs an added bonus, they never use M.S.G. in any of their food. Just delicious, piping hot, perfectly prepared Hunan Chinese food every time. \n\nEven though I moved back to the East Bay, I will definitely be making the drive to SF to visit this place again in the near future. This place easily gets five stars. Thanks for  party-rockin', Henry's Hunan Restaurant!", "author": "Jen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "These guys are so fantastic.  Salty, spicy, and satisfying!", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "The service is so nice, the portions are huge and more importantly, you can find Chinese Chinese food here!\n\nLOVE the dumplings, meat pie and whatever the waiter recommend.", "author": "Ji C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "great food! if you like authentic spicy hunan food, come here and ask for the recommended menu (if you are not chinese they will give you a menu that has generic items such as kung pao chicken, ask for a different one!)\n\nthe only con of this place is that the wait time is INSANELY LONG! they only have one cook in the back and usually waits for several of the same dish to be ordered to cook a batch, meaning you have to wait very long. a 30-60 min wait is minimum. One time we waited for 90 minutes before the first item was served.", "author": "Bo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "Haven't been there in awhile, but when I worked at Sega, my co-workers and I ate there about once a week.\n\nTheir combination Chow Mein is hands down the best I have ever had. \n\nNot a fancy place, but the food quality and portions are great. I love this place.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-18", "description": "I used to go to their Sansome street location, but that location closed recently. On my first visit, I came with my girlfriend only to be told that none of the standard items that I had ordered in the past were available- no potstickers, no hot and sour soup, and no fish, and then we were told that it would be an hour wait. The restaurant was half full. I was the only white person in the restaurant. We walked out. Suspicious, but I decided to give it another go. I went back a second time, this time by myself, tried to order a similar line up, and got the same reception. I will not be returning.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Quite authenticated consider it's in a area outside of the Chinatown. \nThe price is very affordable, and the spicy keeps you sweat, which is great.", "author": "Zuck L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "this place has really authentic hunan food，don't come here if you cannot eat spicy food or you like americanized chinese food", "author": "Yuan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-22", "description": "In my perfect world the perfect chow mein would be perfectly fried noodles and meat, that's it.  Henry's hasn't perfected the Chicken Chow Mein of my perfect world, but they've come pretty darn close.  With the version at Henry's (pictured) you'll find an occasional bean sprout, a tiny bit of shaved carrot, a single sliver of onion and a little green onion to go with a large portion of noodles and cubes of all white meat chicken.  If you like noodles and meat, you're going to like the chow mein at Henry's, and because it is a Hunan restaurant you can bet that your food will be effectively spicy.\n\nThat's another beautiful thing at Henry's Hunan.  If you can't handle the heat the kitchen will be more than happy to season your food to your preferred spicyness or mildness should that be the case.\n\nI often get carried away with ordering food and end up over-eating instead.  Seriously, one order of chow mein and a beverage will fill you up, but I had to try the Dumplings too.  My server was seated at a table folding these when I walked into the restaurant; one look at the ingredients was enough to convince me to try these.  They're just like potstickers with a lean pork filling with just a bit of cabbage and ginger, but instead of being pan-fried crisp on one side these are steamed then presented in a bowl with a light, spicy soy sauce and chopped scallions (also pictured).  The dumplings were very good.\n\nThe service was excellent, but I went there during an off-peak hour so I was the only diner there at the time.  Inexpensive and less than two blocks from my work, I wonder why I haven't eaten here more often.  In my perfect world I will.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-11", "description": "I am here right now. Its been 75 minutes and I am still waiting for food. Zero stars.", "author": "Vidur S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-01", "description": "Stood around for 5-10 minutes (at 8pm) while the restaurant staff all sat at a table in plain clothes and ate.  The restaurant was half full and after someone finally got up and mumbled towards us... We pressed them and pressed them for a couple of minutes and we were told that we should order takeout or else it would take over an hour.  \"Well, if we order takeout how long will it take?\"  \"Over an hour for takeout, too\".\n\nMy wife said it best: \"get your shit together and choose to run a restaurant\".\n\nThis had a strong feel of an older couple breaking their back in the rear and the younger (30-ish) kids up front running it into the ground.", "author": "James R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-26", "description": "This spot is hard to assign a simple star rating. It is a place of extremes and I think there are some lovable things and some mediocre things. So I give it 3 stars and here is why. \n\nIt isn't your average Americanized corner beef-and-broccoli shop. They market themselves as distinctly Hunan and spicy. \n\nMy favorite thing about Henry's is the menu. It has odd and personal dishes that have a bit more explanation than just a list of ingredients. The menu speaks to you. \n\nI tried a soup, dumplings, and a pork and cabbage dish. Pork is a big feature on the menu. \n\nIn the case of the main dish, it came out very greasy and the pork had been cooked at least twice...and perhaps at least once too many times. \n\nThe dumplings were steamed and in a spicy soy sauce. Pretty good. \n\nThe soup was solid but not special. \n\nThe people are nice enough but not so attentive. The space is plain but that doesn't matter for this kind of meal. \n\nThe do have a TV on the wall which is tacky and distracting to the staff and guests in a resturant. It is probably a symptom of this also being the living room of a bunch of people who spend all their waking hours in this resturant. \n\nI didn't make any particular requests about the spiciness level and they didn't ask. It came out mildly spicy. \n\nIn the end I would say if you are a big eater who likes rich food that is outside the the norm and you like homespun dining experiences then this is a good spot for you. Otherwise, there are a lot of nice Chinese food options in SF to choose from. \n\nIf you work in the area I could see this as a part of a regular rotation.", "author": "Erik F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "Insider Tip #1: If SO next door is busy, and you are hungry, come here! It's pretty effing good.\n\nInsider Tip #2: \"Mild\" dishes are still relatively spicy, so careful when you ask for \"Spicy\" or \"Extra Spicy\" - YEOUCH!\n\nInsider Tip #3: Ask for the garlic chilli sauce, which they don't normally offer to customers. It will transform your meal, your palate and your life, in that order.", "author": "Joshua L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-02", "description": "Worst service ever in any restautant. We went for dinner where not many people were in. After 30 minutes, we were told the dish will take some tine and other late comers would get first due to preorder. After another 30 minutes, we asked how long to wait and got answer of not sure. We urged the waitress to  check and got rejected. The waitress was careless and didn't provide any explanation or water during wait. And she cleaned other table super slow as if she didn't want to do the work.", "author": "Michael Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-14", "description": "We felt totally unwelcome here.\n\nI may be reading too much into it, but the difference in quality of our experience versus those of the Asian duos which arrived at the same time seemed striking.\n\nSO had a huge line and this place had decent star rating so we decided to try it.  When we walked in I was hopeful because it seemed popular with a Chinese crowd- we were the only Anglo folks in the place.\n\nHowever, it seemed we got far worse service.  They had a pile up of unbused tables.  After they cleaned those  they sat the Chinese couple who arrived after us, then gave us a table, then sat two Asian guys.\n\nWe weren't given menus, water, silverware, or anything while those two tables were. We got up and got ourselves menus. Their orders were taken, then ours was.  Then server came back and told us the kitchen was really backed up, it would be a least 45 minutes.  We got the message and left, and they immediately sat the Chinese couple waiting at the table we'd vacated.", "author": "Alice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-07", "description": "Solid food, nothing too crazy, but very good chicken wings.", "author": "Rohan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-13", "description": "On a scale of 1 to 100 (100 is the best) for service, this place gets a ZERO  (and that is being VERY generous).  Don't bother.  Trust me.  We ordered the food from a server who clearly didn't give a crap, then sat for 45 minutes waiting for something, ANYthing to arrive.  Nothing arrived.  No beer.  No nothing.  We walked out and will never (EVER) go back.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-13", "description": "It took almost an hour to get my food. I ordered medium spicy and it was extremely spicy (I can handle more spice then most people I know, I eat spicy foods every other day). Water gave me a fork instead of chopsticks probably because I was white. They never checked in on me to see how I was doing. Table was wobbly. Portions were large and food was probably authentic though.", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "At the restaurant now everything we want led is sold out, and takes soooooo long for service. Tbd about food quality.", "author": "Chad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "There's a secret Chinese menu, which is way better than the English menu.  Authentic Hunan food, and as spicy as you can handle... no joke. I can handle spice and this place made me sweat like blind lesbian at a fish market. In fact, I don't even remember exactly what I ordered -- yes, the kind of spicy where your ears start ringing and you go into a burning, euphoric trance. It was great. Oh, and the owners are super friendly too.", "author": "N H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-20", "description": "I work across the street  and one day I decided to have lunch at this location. What a horrible mistake on my part. Due to being a first time customer I asked for a menu. After making my menu choice I attempted to place my order. The person taking my order informed me that it would be at least a 30 minute wait and that they usually only take phone orders. I will never spend money at this location and would not recommend anyone else go here unless you like rude people and slow service.", "author": "Jamel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "So, I see what happened. So, a child of San Tung opened up right next door to this Henry's Hunan location and appears to have killed the HH lunch business. So how mean!\n\nSkip the trendier So and enjoy a delicious meal at Hunan, with hearty portions and all the great dishes like Diana's Meat Pie, Cold Chicken Noodles, Bean Sprout Salad, Dumplings.......YUM.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "Would give zero star if I could. Service is horrible. Come here only if you are willing to wait for over 2 hours.", "author": "Qiming Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-21", "description": "I wanted to give three stars cause service was so nice but wow the food is just not tasty.\n\nDumplings and no flavor\n\nSpicy rock cod had a great sauce. The fish itself had a weird texture, not sure what it was.\n\nHot and sour soup was nice\n\nEnjoyed the green beans the most, but have had better.", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-18", "description": "I got a raving review from a family member about this place so we had high hopes when we decided to try it. Those hopes and dreams were quickly smashed. Placed a pick up order on a casual Monday, didn't have 4 of the 7 dishes we originally intended to order, okay Henry don't let me down now man. Then when we did get an order in the estimated time for pick up was 30 minutes then she changed her mind to 50 minutes. I'm sorry, 50 minutes for Chinese food? Alright fine. THEN when we went to pick it up a solid 50 minutes later, still isn't ready she says come back in 8-10 minutes. 10 minutes later, still isn't ready. Classic. Another 10 minutes goes by. In terms of what we finally made it home with 4 thousand years later...chicken fried rice with hot spicy sauce was pretty decent, would order again. Henry's special was a big meh. Hard pass. Chicken chow mein not great.  Long story short I expected to have my mind blown and the only thing mind blowing about this experience was how long I had to wait. I'm gonna go ahead and say that I most likely would not return.", "author": "Taylor V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-13", "description": "I have only ever eaten at the HH on Sansome, but, I spotted this locale when leaving TJ's a month or so ago, so, I decided to go with some co-workers\n\nI had my usual, the smoked ham rice plate.  It was as good as ever, though, there was a bunch of oil/grease left on my dish after I inhaled my lunch - I don't remember the dish being that greasy when I had it at the Sansome locale.\n\nI mean, sometimes it's good to have grease on your ham, and sometimes, just not.\n\nYa feel me??", "author": "Johnny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "Best Chinese food in bar area. Also the most spicy one.", "author": "Huahan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-19", "description": "Dude, where else can you get the biggest bowl of noodles, veggies, meat, and black bean sauce in the world for like $6? That said, I think I'll stick to the rice plates next time, but huge props for providing value. I took about 80% of the noodle bowl home, refried it with garlic, mushrooms, and an egg, and it was lunch for two!\n\nHope it stays open, it looks like SO is sharking some of their business. It's a solid 3 star from me and I hope to keep it in my lunch rotation whenever I'm working from home.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "We go there because the food is good. Like the other reviews said the service is terrible and only come if u have time because they say half hour but it's like over an hour of wait to get food. I think this maybe our last time. Hope they can change their ways about service. I know there are other Hunan restaurants and nothing like this one on service.", "author": "Nick P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-05", "description": "I was originally going to go to SO next door, but they were closed for Spring Break.  Against my coworker's warning, I went to Henry's Hunan instead.  \n\nThe food took a little too long to prepare, the noodles I got (with pork sauce) were oookay (not enough flavor), and to top it off, I found a piece of plastic the size of a quarter in my dumpling.\n\nI've had good food at other Henry's Hunan restaurant locations, but I was disappointed by this one.  Next time I want Chinese food at work, I'll be trying out SO.", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-18", "description": "Hate to give a place a bad review, but this place definitely deserves it. We had to walk out before eating our meal. This is the dirtiest place I've ever been to with the worst service, and believe me that's saying something.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "We wend in the afternoon and it was not busy. We like everything we ordered. The food was served fast. Will stop by next time.", "author": "Tracy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "This was my introduction to Henry's Hunan. I used to work in the SomArts building, and Jeff managed Henry's. I had complimentary hot and sour soup and piping hot tea while I decided. I almost never ordered from the lunch menu because with offerings such as black bean squid, smoked meats, and spicy green beans. Many people have written about their dumplings. I'll agree in that they are tasty. Also, they make the best rice. Chinese rice should be sticky. Too many restaurants serve rice that you cannot eat with chopsticks.", "author": "Therese M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "Just stopped by. The restaurant is only half full but was told that I'd better leave because the dish will not be ready in an hour ......\n\nI will not go there again. There are many better Chinese restaurants in sunset", "author": "Li C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "Meat pie. Best Ever.\n\n*drops mic, walks off stage*", "author": "Jorge H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-08", "description": "I would love to give 0 star. bad service. Only one waitress was doing service. No menu, we've been waiting about 20min, nobody bring any dishes even rice.  Also, there have another guy waiting even longer than us, he seems really uncomfortable, drank up three waters, eventually he left. We waited about another 5min, then we left too, even I am Chinese who loves Chinese food, for this kind of Terrible customer experience, never want to go back!!!", "author": "Blair Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "How is it, that they don't have items on the menu. Bryant street location is awful! Update your menu and website!", "author": "Brian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "Super Yummp! The best Hunan resturant in bay area!!!!!don't want to go to any others!!!", "author": "Xiaofeng W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "I went to Henry Hunan with some friends. The place is not one of those well decorated restaurants, you know. But as far as the taste is concerned, I'm happily surprised. It seems that they do not add MSG (which I don't like since it makes many Chinese food taste similarly). Instead, the chilli brings an aromatic flavor which I really enjoy, although I wasn't into spicy food particularly.", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-18", "description": "JESUS FUCKING CHRIST. This my first time come here and i swear the god I will not come here again. We came here at 8.30 PM. It is fucking 9.42PM already and there is no one single starter yet. Jesus fucking christ. I look around our table. Three other tables are all empty. We are starving. I can see stars over my head. No starter yet, but at least give us some appetizer or snacks. But there is none. not single of them. holy crap. There is a serious management problem of the restaurant. There are only two chiefs in the kitchen. and the restaurant is full of people waiting for food. Why dont hire more chiefs!! holy shit. Demonds exceeds supply too much. why they cant balance it! And I still dont understand why the hell there are still so many people come to this restaurant while people willing to wait for more than 1 hour. It is now 9:50 pm and there is still no one single starter. Never ever come here again.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "My favorite part of eating at Chinese restaurants is the traditional courtesy bestowed upon customers. The greeting, seating, menu, glass of water, and pot of tea have come to be something I expect. When I arrived at Henry's on a Saturday at noon, I was given the Stink Eye and told they wouldn't be open for another 20 minutes. Basically: \"Go away.\" So I did.", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "There spicy food is spicy OK???  Thats good..  There chicken tastes like chicken..  There salad???  Like salad.  They do it all right and for a good price and thats good cause its San Fran..   NO BODY wants to pay millions of bucks for chow fun.. \n\nCould eat there noodles all day !! Spilled some on my pants eating in the truck but there not to greasy so it didn't stain haha !! \n\nGoing back here alot from now on so you could find me here some times..  Say HI or you could be a wiredo staring to I guess..", "author": "Xavior G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-30", "description": "This particular Henry's is a big thumbs down for me.  I love the Henry's on Church street but this SOMA location just needs some good ole' fashioned TLC.  The inside is multi-colored and looks a bit run down with tables of food left from patrons long gone.  The server was friendly and nice but the food was a miss.  I ordered the Orange chicken with brown rice and having paid extra for my specialty rice selection I received white rice with some mushy chicken.  It was awkward but I ate it.  I will give it one more chance since the Velvet Chicken is near and dear to my heart.  Let's just hope that this particular Henry's can pull through.  Now if I can just get past the facade...", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "OMG, one of my faves. \n\nIt's funny...I've never really been a picky eater, but growing up one of the few things I couldn't eat was spicy food...but as I've gotten older I've learned to handle myself better and as a result...this is now one of my favorite restaurants. \n\nMy mom used to come here when they had their location in Chinatown and so, naturally, she introduced both me and my brother to their food. \n\nThings to try: \n\nDiana's pie: yes, it is greasy, but IT IS TOTALLY worth it. My brother is a...how should I say...purist, and refused to eat anything greasy or oily to be more healthy (funny, I should be doing that...not him) BUT even he is willing to eat this dish. It has spicy ground pork, lettuce, and some fried, crispy top and bottom. Please try it! \n\nNoodles: I'm not sure exactly what this dish is called, but I know it's noodles with spicy ground pork and lettuce?? It's one of my favorites, but then again, I'm a really big fan of noodles. \n\nMarty's special and Henry's special: I think one of them has scallops, chicken, and ham? All in a spicy sauce....which a delicious! And the other is ham and some veggies?? It's more smoky in flavor....both of these are pretty good. \n\nMy mom said Marty was another brother or son or some family member....my cousin made the general rule of thumb that if it's named after the restaurant it HAS to be good...and I feel like this is accurate! \n\nIf you're not a fan of spicy, don't come here...or ask for super super mild things. Obviously, if you're a health freak or on a diet...don't come here either...this is greasy, but good and hearty Chinese food.", "author": "Alison N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "One of the my favorite restaurants in the bay area. \n\nGo there once a week on average.", "author": "Jack G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-28", "description": "Worst place I've been to in years.\n\nNot only are you going to sit in that cockroach infested place where the only thing they bring you is luke warm water for 45 minutes - no, it was not busy. \n\nCockroaches, horrible service, carve out 1:30hrs to be served on an empty lunch break.", "author": "R M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-20", "description": "Came in here starvin' like marvin, LEFT here starvin' like marvin\n\n\nMy friend and I decided to give this place a go since SO was closed. (Noooo!!!)  We ordered the chicken fried rice, chicken string beans and little something chicken wings.  Everything... was so bland -___-.  The only thing that was bearable was the string beans with chicken and that was because my friend threw a WHOLE lotta hot sauce on there. We were literally only there for 15 mins, ate whatever we had on our plates after scooping it from family style and just bounced.  We had so much food left you'd think that we ordered TO GO.  \n\n\nI feel bad for the folks that asked us what we'd recommend. My friend and I looked at each other like uh... nothing?? But told them to get the string beans but ask for it to be \"hot\", maybe it'll be tastier than mild?\n\n\nNeedless to say, won't be back.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-11", "description": "I will give 2-3 stars for food, but the service is really killing the deal. I've been here 3 times and every time had to wait at least half an hour for the food while there were only a few customers in the restaurant. Today we waited for one hour and the food was not even prepared!!!!! Of course no one ever came to our table to check if we need anything or at least kind enough to let us know we probably have to wait for another hour for the food. The story ends with me and my family left with empty stomach as we can't afford to starve ourselves for another hour. I will never come back to this restaurant again or recommend to anyone.", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "Finally a place that makes spicy spicy. We ordered take out which was ready in 10 minutes. \n\nEggplant salad was light and tangy in a fragrant vinaigrette. \n\nMa Po Tofu was spicy but I was expecting the tofu to be fried. Probably saved me some calories with the silky tofu. \n\nChicken and mixed veggies made spicy was really good with big pieces of broccoli, bok choy and carrots. \n\n*Bonus* Brown rice is available! \n\nCan't wait to come back and try other dishes.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-27", "description": "If I could give this place zero stars I would.  I hate giving bad reviews but this place deserves one.  I have been eating here for 18 years.  When Jeff was in charge, it was wonderful.  Food was served quickly and tasted great.  Jeff was always friendly and had a smile on his face.  \n\nI moved out of SF and can't make it back unless I am in town a lot but when I am, I always stop in to get takeout here to bring back home with me.  The last 4 occasions I actually ate at the restaurant and whomever is the server now is very rude.  He only serves his friends or chinese people and you have to basically go up to someone else at the facility to be served.  I didn't want to believe that someone was that obvious about discrimination so I convinced myself that the last 4 visits was just an oversight on his part and that he was just bad at his job.   I loved the food so I put up with the previous bad service.  However, this last visit, it was obvious what was going on and I now understand why every time I eat here there are only chinese people in the restaurant.  We walked in to be seated and he walked right passed us ignoring us, walked up to a chinese couple behind us and seated them while we grabbed our own seats.  He then gave them a menu, took their order and walked to the kitchen. \n\nWe sat waiting for menus as he continually walked back and forth greeting other chinese patrons.  He gave everyone else (again, either his friends or chinese patrons) menus and ignored us.  Finally, another woman brought us menus.  Tick Tock, Tick Tock...we waited over 25 minutes for two entrees and my spouse had already finished hers before i even got my order.  \n\nThe male server then goes outside and smokes with his friends and smoke is coming into the restaurant (Not real fun to eat while smelling smoke).  Then he comes back in, grabs the water pitcher to refill glasses on the tables and only fills the glasses of every chinese table and walks right by ours even though we made it quite clear that we wanted water by putting our glasses at the very end of the table so he could see them.  I finally went and grabbed the water pitcher and served our own water.  \n\nWe had enough and my spouse asked him why he is not serving us but taking care of everyone else in the restaurant.  He looked at her and as she was in mid sentence walked away saying nothing and glaring at us.  What a jerk!  Then after this happened, two guys walked in (not chinese) and he ignored them too.  They stood there for at least 5 minutes waiting to be greeted as he walked right passed them.  We mentioned our bad service to them and one of them said to us \"Glad we aren't the only ones that thought he wasn't serving us because we aren't chinese\".  Wow, how this place is still operating is beyond me.  \n\nIf they want to ignore paying customers because of race, then why don't they just become a private facility and not open to the general public.  Too bad, cause I love their food but this guy is toxic and I am choosing to spend my money elsewhere.", "author": "Amie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "This review is for take-out only. I've only ever had a few items from here but loved them. Diana's Meat Pie, I know sounds odd and weird, but it's good. It's a chinese pizza/quesadilla type of thing. It's using chinese fried pancake for the top and bottom and the inside is lined with shredded lettuce and ground beef with sauce. that's all it is, so it's like a Chinese quesadilla. \n\nThe other item that we love is the Henry's special. This location is a hit-or-miss on this entree but overall still good. It's a mix of chicken, shrimp, scallop mixed with bell peppers with a hot spicy red sauce. Spoon that baby over white rice and you've got yourself a delicious meal! \n\nI wouldn't ever eat in here, it's a bit of a dive and parking is tough on Bryant street, so I just double park and run out to get the food.", "author": "Grace L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "We were the only people eating here this evening, but this didn't bother me. The place was clean, if not a bit too quiet- could have used a little music. I really liked the food. The soup with spinach egg and pork was different, in a good way. Very hearty and filling. I REALLY enjoyed the Marty's Special. Smoked ham in a Chinese restaurant sounded a bit odd at first but it was awesome. So smoky and flavorful and delicious. Sure, there was a good amount of oil at the bottom of the dish, but I didn't care. They also serve brown rice along with white. Prices are average.", "author": "Julie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "BEST Chinese food in town. I've been to many of Henry's Hunans but this one stands out. The food is very delicious. However, the service is okay. You get a big portion for a great price. I highly  recommend this restaurant to people who love spicy & flavorful Chinese food.", "author": "Henna A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "Good, good good.  Been wanting to go to one of these for a while.  A friend was in town from NY and the opportunity presented itself to go within a very short walk from the Civic Center Motor Inn where she's staying.  Best dumplings I've ever had. These guys put the sauce in the bowl they're served in, yum.  It lightly coats them as you stir it around.  Had the first item on the menu, can't remember the name but there's a great story about the dish that drew me to it.  My friend had MooShoo Pork and loved it.\n\nTried the meat pie w/ sauce to say we did cuz it's one of their quirky specialties...tasty!  I'd order it again.  \n\nMy friend was happy to have lots of leftovers for the next couple days.  We were there during lunch on a Wednesday. Got there around 11:45. It never got super busy. Wait staff was very attentive. Decor is cafeteria tables and chairs...that's all you need.  \n\nI don't think I'll bother trying to get to the one in the Financial District any longer.  I'll just pop in here.  Might have to make it a pre-Giants game spot in the process.", "author": "Sport G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "I like Henry's... the food is always consistently good, and you get a TON of it for not alot of cash. They use a good combination of spices for some nice flavors and they don't seem to try to over-do it. I also like the fact that they don't try to Americanize the food, either.\n\nThe staff are very friendly and efficient, though the decor and overall restaurant layout could use some work. Oh, and if you order your entree \"hot\", you can expect it extremely SPICY!!\n\nI always leave full and happy.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-11", "description": "One day last week, I came for lunch on this block.  I wanted to say to So for their hot and sour noodle but there was many people already waiting and I didn't want to spend that much time there.  Therefore, I came and gave this place a chance instead.\n\nI have been to a Henry's Hunan once, the Church Street location.  This one had a very very old feeling compared to that one.  Also, I recall the staff on the Church Street side was much more congenial.\n\nThere wasn't too much exciting on the menu (though I confess to having Cantonese or HongKong'nese bias there) so I ordered a plate with spicy smoked ham, which was okay.\n\nNot likely to come here again unless I run into the same situation when trying to go for lunch next door and don't want to drive somewhere else.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "I went to my friend's for \"take out\" last night..and this time they picked up from Henry's on Bryant. \n\nThere were three of us..but they ordered for 6--we had over 6 dishes...so we can try a variety of things family style. \n\nAs far as greasy Chinese goes..Henry's is pretty good. The Mah Po Tofu was my favorite..tender tofu in a savory meat sauce.. \n\nThe curry chicken was a close second..with lean white meat instead of mystery meat.  Their chow mein and fried rice were decent. The only slight disappointment was the eggplant --instead of using Asian eggplant..they used the regular eggplant which doesn't capture as much flavor. \n\nThe only downside to Henry's is that they don't deliver. Since they are out of the way for me..I don't foresee myself taking out from this location again any time soon.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-14", "description": "no.\n\nso sad. I first heard of HH when a coworker said they had some of the spiciest food, but because the location he was talking about in fidi was a few blocks away from the office, I never ventured there because with only a hour lunch, I was afraid I'd have to scarf down the food and I prefer to take my time\n\nnow you know part of my rant with this location..three servers, two mainly..one of them seems to only dole out water and the free soup..and I'm assuming one or two cooks at most..this place is clearly understaffed with the traffic it gets\n\nI snagged a table without problem or wait (others behind me, not so lucky)\n\nI ordered the mapo tofu and request as spicy as they can make it..and licked my lips in anticipation, after all, this place was only a block away from the office I was temp. helping out..so was happy to discover this HH just around the corner.. plenty of time to eat\n\nor so I thought, I watched as others got their food..I don't know how long they waited but I arrived at 11:15ish..order was taken ASAP mind you..at 11:45 I still haven't gotten my food and decided to flag down one of the waiters to see if it was even prepared yet, as I can just pay for my drink and be on my way,\n\n\nhe says its being prepared and will be out in a minute..comes out five minutes later and I have five minutes to eat before I had to pay and hurry back to the office\n\nthe biggest insult? the tofu wasn't even hot! not even mildly hot much less super spicy...\n\nit was just average mapo tofu, waste of time and money, as I only ate a few bite full, which I dumped quite a bit of red chili pepper on..still not as hot but mildly better", "author": "Whitne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "I'm glad we found this place after searching a while for a good Chinese place in the area. that doesn't have breaded chicken and syrupy sauce in every dish.  The food at Henry's Hunan used high quality ingredients and everything was fresh.  My spicy Chicken and Vegetables were actually spicy and very tasty.  My wife and I also got the Eggplant salad which had a great vinaigrette.  We got takeout and I'll have to go back sometime to try some other dishes.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-11", "description": "Come only if you are willing to wait for one than one hour after ordering your food. We came on a Saturday night at 7pm and ordered immediately. The store was not that busy, there were still some empty seats. But at 8:07pm, more than one hour after we ordered our food, we still didn't see a single dish on the table. I bet they must has only one cook cooking in the back.", "author": "Mika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Tasty, homemade Chinese food with a simple decor.  Advertised as \"no MSG,\" yay!", "author": "L T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-09", "description": "Maybe I just don't pick food/restaurants  right but took 15 mins for our order to be taken,it was packed and a line at so next door so decided to come here. Place was full but most patrons seemed to have already ate. Took 20 mins to flag down waiter for a glass of water,free tea my butt! And 40 mins for our food to arrive. Sweet and sour pork and spring rolls were a whole star above Safeway. Waste of time and money.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-06", "description": "Henry's food is incredible but that being said I absolutely want to scream at the staff.  They are rude and act beyond entitled.  Get a grip goddammit and respect your customers.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-05", "description": "Saw the great reviews of this place but something wasn't clicking today.\n\nFirst off... the front of the house was being run REALLY poorly. Two men taking care of a whole dining room. That being said, the room had the capacity for about 60 customers (20 tables), and there were about 5 people here, at 3 tables. Shouldn't have been a big deal, but they were running around as though they were completely overwhelmed, and the service I received certainly supported this observation.\n\nI sat down for almost ten minutes before I got up, walked to the counter, picked up a take-out menu from a plastic bin, and sat back down to read it, since I never got a menu. I then waited another five minutes until my order was taken. I ordered spring rolls and kung pao chicken. Keep it simple on my first visit, especially since it seemed like these two guys weren't really doing so well, running and yelling at each other (and into the phone when receiving phone orders).\n\nTook ten minutes for me to get my food. In that ten minutes, I overheard two of the other three tables complaining about the service. One guy had to ask for his check and then, as he was paying for his meal, the cashier started taking a phone order and ignored him mid-transaction. I heard the customer say \"It's $6.75. You owe me $5.25 back. I have to go, I'm late back to work... may I please just have my change please?\". Meanwhile, another table of two was waiting for their menus after sitting for five minutes. Really bad.\n\nMy food arrived. The sweet and sour soup was mediocre. Not bad. Not good. Just there. But the kung pao was quite nice. Flavorful, fresh, and large in quantity. Too much for me for lunch, really (not that that stopped me). The spring rolls didn't show up until I was done with lunch, but to their credit, they took them off of the bill and apologized. Took another five minutes to get another soda though.\n\nThe bill came and it was still $15 with tip, even sans eggrolls, for a lunch entree and a Diet Coke. Not particularly cheap.\n\n2.5 stars really. Horrible service though apologetic. Hole in the wall atmosphere. Lots of yelling in Mandarin between the employees. Not particularly cheap. But excellent Kung Pao. I MIGHT go back if I was in the neighborhood, in no hurry, and just craving that dish.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-06", "description": "Honestly, do these jokers even run a restaurant ? My colleagues and I dropped in after the neighboring SO was closed ( and subsequently also been added to now growing list of blacklisted restaurants )  . The wait staff was completely ignorant of our arrival. It took 50 minutes for them to serve us ONE starter !! And the waitress didnt even bother getting the coke I ordered. We left without being served. I rarely get mad, but the male waiter with the bad attitude needs a lesson or two in people skills.", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "Excellent authentic spicy greasy yummy Chinese food. Not much of an atmosphere or service but spicy tofu is sublime and most of their chicken entrees are really good. Easy on the budget to boot. And always fast and hot and satisfying", "author": "Umair K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-22", "description": "Totally affordable. That is a positive. \n\nThe food was solid, however it was soooo salty. My friend dug the food and probably would have given this 4 stars but sadly I'm reviewing. Hence the three.\n\nI'll be back because you are close, tasty enough and affordable.\n\nIf you read your yelp review, less salt please!!! If you do that, I'll be there frequently.", "author": "J. S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-16", "description": "Gross. I got broccoli beef (amongst some other things), and you could tell that the beef was spoiled. It tasted like it was 4 days old, and left in the kitchen sink overnight before they cooked it. All the other food was oily, but not in a good way. More like in a \"i'd like to make you regurgitate your dinner\" kind of way. \nIn addition, the place felt extremely dirty. \n\nI wouldn't come back.", "author": "Skylar W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-13", "description": "This place has a very terrible service. \n\nThe food was ok, but it took them a while to serve. After I was done eating, I went to the cashier to pay my bill as I was in hurry, but the waiter ignored me and didn't even say \"thank you\" afterwards.", "author": "Winny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-31", "description": "What a Hidden Treasure!! Best Chow Mein I have had !!! The combo with steak, chicken and shrimp is huge, $10 feeds 2 people.", "author": "Benjamin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-30", "description": "Coworkers dragged me here for lunch, which is quite a walk from our office (yes, we got chewed out for a 2hr lunch).\n\nThe food is interesting and unique enough to warrant a visit, though a bit greasy at times, as mentioned in other reviews.  I also didn't think it was that spicy, though we did ask for it to be.", "author": "dan s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-11", "description": "Agree as to understaffing, the second round of free hot & sour soup got turned away by me nicely. I needed to go to the desk to put in my order, and I'm a pretty patient guy. The help, 2 guys and a girl were not very organized or energized, but nice enough. I saw a few smart people call ahead so their orders were ready to eat there, that's smart, the order to table time is a bit too close for comfort if you are one a 1 hour lunch. The food that went by looked good and mine was tasty when it showed, so I'll be a return TAKE OUT customer. I'm a new neighbor so I'm happy to have them to try again.", "author": "Neal M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-06", "description": "Came here because So next door was closed. Shittiest \"Chinese\" food I've had in a while. Made me crave Panda Express (yuck)", "author": "Rich L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "Pleasant surprise. Our party intended to go to SO next door which was closed.  So glad we came.  Warning: spicy IS very very spicy.", "author": "Chris O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "This place is truly authentic.  The chefs are actually mom and pop who come from the area.  Anyways, the city is mostly filled with Guangzhou or Hong Kong style cooking.  Many of my \"mid-East\" (mid part of China) friends in China swear by this place.  They are just not down with Southern style food.  So, they to ask the waiter for authentic ,spicy, salty, oily entrees.  We don't even order off the menu; we just tell them what kind of dishes we want, and the chefs do the rest.\n\nThe rest of the restaurant is nothing to write home about.  The decor isn't all that great, and the layout is strange.  The service is prompt and friendly.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Best real Hunan in town. Almost pass the place since the outside looks not that good. However the food is real Hunan n the owner is amazing!!! Very spicy food n really really really good. If you are real Hunan food lover just ask Henry the real Hunan dishes not on their menu", "author": "Nikki Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-25", "description": "A fallen angel\n\nDO NOT EAT HERE UNLESS YOU WANT TO GET SICK. NO KIDDING.\n\nBeen going to this place for the last 8 years on a fairly regular basis, obviously liked the food and the kids seemed to want to do their best.  Even drove out to that place passing another Henry's Hunan that is closer to me, trying to help the kids kind of thing.  Referred many many people to their restaurant over the years and then lately things started changing.  About 8 months ago a friend of mine who works on 10th street ate there for lunch and got violently ill.  I figured it was a one off, unfortunately turns out it was not. I did start to notice a steep decline in the quality of the food, it was no longer made with fresh vegetables, they were now often wilted and bland.  The food became much more greasy and all of it started to taste the same.  The tables were often dirty and they just swept everything off on to the floor. They had always had good rice, now I started getting a different rice, smaller and gluey and frankly just disgusting.  I brought this to their attention but they just gave me some song and dance about it being a one off, something about having run out of the \"good rice\" but that it was only once.  Turns out it was not, the gluey small grain garbage starting appearing more often than not.\n\nConcurrent with this decline I witnessed a significant change of attitude as well.  The attention to the customer was gone, their standards seemed to have fallen off the face of the earth.  The restaurant became a place for the kids and their friends to hang out and they lost interest in the business, spending their time sitting at a large round table entertaining their friends even when they were not busy late in the day.  It was as if I was taking up their time and was bothering them by picking up food there and the kid running it was now seemingly above it all.  Then my family got very sick, violently sick from what was obviously food poisoning.  The hubris they exhibit is surely related to the health risk this place now poses for any one wandering in there.  I could probably overlook the lack of customer attention even the attitude but the food is now dangerous.  They have a lot to learn about dealing with the public but I intend to refer this place to the city's health inspectors as I don't think anything else will keep people from getting ill.\n\nThere are plenty of other good Chinese restaurants in the city with fresh food and no attitude; people who care about the business and not about using it as a playground for kids. Do yourself and your family a favor and avoid this place at all costs.  We will never go there again and I wish I had not referred so many people to them in the past.", "author": "Francis S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-24", "description": "Been here twice.  Did not care much for the food.  Everything tastes the same. Tried five different dishes.  Food doesn't seem fresh and it's all bland.  The only good item was the meat pie.  The waiter is nice though.", "author": "dublin a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-14", "description": "I love coming here for lunch. It's a block from my job, and they have great noodles. Nothing amazing in that it's just simple Hunan food, but I find myself craving this place all the same. I'm going to take my brother there tomorrow :) I need to try some of the other dishes on the menu, but for now I'm sticking with the noodles and of course the MEAT PIE. Yes, I said Meat Pie and I'm not referring to English pub-grub. \n\nGet down, SF. Get down.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-30", "description": "I love this place since I like spicy Hunan style Chinese.  It's not high end dining, but very down to earth and homey.  Jeff's almost always there and has a big smile on and the prices are spot on.\n\nNice and quick service at lunch time too.  And on cold days like today the soup that comes out right away totally hits the spot - i think i'll go now!", "author": "Gene X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "I've been coming to Henry's Hunan ever since a longtime local introduced me to the spicy rock cod dish shortly after I moved here. I like the quiet, clean and modest atmosphere at the Bryant location and the food is always good ... although my favorite (mostly vegetarian) dishes are a little heavy to eat more than once every few weeks. This is my go-to place when I need a quick escape to just relax for a moment and fuel up if we have a long day planned at work.\n\nThe Henry's staff is also very generous and lately they have been serving different kinds of flowering teas. They go above and beyond to make regular customers feel appreciated ... definitely worth checking out next time you are hungry in SoMa.", "author": "Lex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-25", "description": "I wouldn't drive clear across town for this place. Nor would I recommend it to a tourist who only has a couple of days in the city and wants a unique experience while here in San Francisco.  But I am recommending it to you, who are in the neighborhood anyway and want something different at a reasonable price.\n I really liked the sweet and sour soup which is served complimentary and was better than some I've tasted.   Sorry I can't remember the exact names of dishes, because I didn't do the ordering myself, but the \"smoked meat\" dishes were all excellent and the Tofu which one of the previous reviewers didn't like, I really liked. It had the soft tofu and bits of ground beef and I appreciated the abundance of sauce. So maybe it is oil, but I added some more hot oil myself from the spice rack and spread it over my rice till it soaks it. I'll upload some photos so you can see for yourself.", "author": "Jerome W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-11", "description": "Had to wait for 10 minutes just to sit down even though there were plenty of prepped and open tables, and another hour (not exaggerating, literally an hour) to eat. Didn't bring us a snack, didn't apologize for the wait, nothing. Food was good but nothing special, by the time it came I would have eaten an unseasoned hat.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-11", "description": "Next to SO, so you might pass it up. Spicy chinese food is the name of their game. Last visit impressed me. I don't really look for service at hole in the wall places. However, my wife spilled her water, the guy working the front was like the flash. wiped it up in one second. Had napkins and a new glass of water 5 seconds later. WOW I was impressed. Food was still what it always is, cheap, fast and spicy. But that service I will never forget. Thank you flash man =)", "author": "Numa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-10", "description": "I used to frequent often....Never Again  No Ice..Extremely slow service...no Dumplings.... Soy Sauce in packets....Filthy Bathroom...Employees out front smoking instead of helping...asked for hot sauce three times...Wow.... from Awesome to Never Again..... bring Jeff back to run this place correctly such a bad experience made the food a mute point....;", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "For office workers looking for a lunch place: if you can wait, go to SO noodles next door - it's crowded at lunch hour; if you can't, go to the McDonalds by the Hall of Justice. Just don't eat here. I tried their smoked pork and twice-cooked pork. Both were dry and hard to chew. I like their location on Natoma, but this one sucks.\n\nI am changing my rating from 2 stars to 4 stars. My recent experience has been good.", "author": "YM L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-30", "description": "Your orange chicken tastes like fruit loops.\n\nEek! Methinks not.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-29", "description": "The old Henry was such a liar and a cheater because 2 reasons.\n\n1. He said that the best chow-mein in the city In the old menu.\n    \nHow could you said that?\nHow can you measure in what degree and said, \"Umm, this is the best      \nchow mein ever!\"\nI love chow-mein so bad, I can eat any time in any day but ...The best chow-mein?\nChow-mein is the most mediocre food that even I can make my own and that'll be the best in the city.\n\n2. Old Henry has a dumbA'ss 1st great-grand son who plucked his senior year of Sacred Heart high school but the old Henry donated huge amount of money to save his dumbAss 1st great-grand son to graduate.\nSo, he did, graduated by money.\nWhat the Fxxx?\nIf you are a rich MozaFxxxer like the old Henry, you can graduate the high school with no grade.\n\nWhat a screwed up!\n\nBut, It's a new owner, but of course it's related. \nThe waitress is the old Henry's Great-Great Grand daughter.\nAnd her father ISN'T the dumbAss 1st grand son, but he is the new owner and cook.\nThey are hard working people.\nFood is pretty good.\nThe bathrooms are very clean for Chinese restaurant.\nAnd the new menu doesn't say \"the best chow mein\" at all.\n\nI'll come back.\n\nJeff- the old owner who told me the all story of the old Henry, opened a new Henry's on Church and 24th Street. Haven't been there yet.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-31", "description": "Do you want to know what happens when you ask a Chinese girl to order food for her white friends?  A world of pain happens.  And MSG.  \n\nI'm not sure how I manage to make such a mess of it all.  But I blame SO.  It was closed.  On a Monday, NOT Memorial day.  I should have known when I tried to call and place an order for pickup, when they didn't answer.  I should have given up.  But no.  \n\nThe lunch was certainly cheap.  And the portions huge.  But just don't try to be an Asian girl ordering for white friends who can't handle spice.  Seriously.  It felt so wrong.  \n\nI'm giving up Chinese food for Lent.  And Summer.  And the rest of my life.  Don't ever let me into a Chinese restaurant.  Don't ever let me order Chinese food.  Because I will eff it up.  Badly.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "I love Henry's! Great Kung Pao Beef and Chicken. All of the hot and sour dishes are delicious. The lunch rush is a nightmare, but if you can get in there after that, it's a quiet, enjoyable dining experience. I like the decor and the staff is frendly, too.", "author": "Jamie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "This restaurant is under new management  after June of 2010. The food over there is really traditional and delicious. Like henry's special, Kung pao chicken, harvest pork. Also Diana's meat pie and Chinese dumplings are the best appetizers I ever had. I hope everyone can try these dishes.", "author": "Hao Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "Really good affordable Chinese food that is both authentic yet American friendly. The menu has a great selection of traditional dishes that is both delicious and well-priced. The meat pie is an awesome, unique dish; it is a Chinese Chalupa that was probably conceived by a drunkard with muchies. I love the flavors and spiciness of the dishes. Service is fast and restaurant is clean. Although, I am a little insulted they gave me a fork and an all English menu even though I am Chinese.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-29", "description": "*Drool*\n\nLipsmacking greasy food. Its really tasty but dont try shying away from calories when you dine here. Its very damaging for the waistline but your taste buds will love you. Its quite economical too. Losing those pounds- ahem ahem not so economical. \n\nTried their Fried rice,Veggie chowmein and Five bean curd curry. All were par excellence. I feel the urge to eat here every week and of course I show up,and my burgeoning ass only gets bigger.\n\n *Sigh*", "author": "Natasha I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "It's under new management now and it's much better than the previous one. And I love the new paint here! The food is way better too! Plus, it's cheaper to get the same food than other Henry's Hunan locations! I love this place.", "author": "Grace J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "Decent surprise!  We went into the restaurant with very low expectations thinking its another Americanized Chinese food place..  Until we started chatting with the server and gently probed if they have a Chineses menu.  The server patiently and kindly explained that they didn't have one, but they can make certain dishes that're off the menu.  There were only a few items on this \"special menu\" and we ordered everything from it: stir-fried ferns, Chinese bacons, stir-friend tofu and meat.  We also got a hot sour soup.  Every dish is delicious reminds me of food I get at home.  There're also items you can call and reserve ahead of time like Pickled chili chicken/fish.  I'm definitely going back to try those special dishes :)", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-16", "description": "I couldn't bear people coming here hoping for some nice Chinese flavors because it has 3.5 stars on yelp. If you're looking for good flavor, this really is not the place. This is not about unauthentic, it's not about Americanized Chinese food: it just tastes bad. The hot and sour soup is so salty. I felt like the ingredients had their original flavors ripped off and replaced with salt and sauce. So sad. \n\nThe portions were huge. I asked to have half dine-in and half to go -- and I couldn't finish either portion. Partly because it's more comforting to stay hungry than to finish it. \n\nYes don't come here next time SO's closed. Walk another block to Sunrise Cafe.", "author": "Liz H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-01", "description": "One of my favorite Chinese restaurants.  Decent prices.  I love the meat pie and noodles with pork meat and Hunan special sauce.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "Foods above average, been coming here for 3yrs and it could use a remodeling or just new paint but other than that, I would recommend for lunch.", "author": "Johnny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Not a bad chinese place, but there are certainly many options in San Francisco.  It's proximity to where I was working at though made it completely convenient for me to go there to grab a quick meal.  The flavors to me tasted good, and the service is quick and simple.  Not much of an experience at this place, but great if you want good food real fast.", "author": "Lawrence C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "The few times that i've gone here, there was plenty of seating. I always get the spicy rock cod fillet. it's sooo damn good i sometimes have dreams about it. The people that work there are nice, venue is interesting...due to the paint colors, but the food is what i come here for, so i dont care about the ambience.", "author": "Darnell L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-19", "description": "I like Americanized Chinese food.  I suspect this might have something to do with the fact that I'm an American who was born and raised in the Midwest.\n\nActually, I have a pretty sophisticated palate and a wide range of cuisine I enjoy.  Authentic Chinese food didn't make the cut.  I'm just not down with noshing on duck tongues and chicken feet.\n\nSo, there are my biases.  Now on to the rest of the review.\n\nQuality of Food: Better than your average take out.  The very high levels of salt and oils make things tasty.  As with most tasty things, this isn't very healthy.\n\nVariety: They have a solid variety of dish names.  Like most Americanized chinese or mexican restaurants, it's a different combination of the same six ingredients.\n\nService: The table service is pretty good for a busy lunch rush.  Solid.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-19", "description": "I went here because a friend said it was the best chinese food in the world. Really? Better than in China? I bet there are like a 100 million chinese joints out there.\n\nIt was really good quality food, and really spicy.  But I will wait till I make it to China proper before I give it the best in the world title. \nService was good also. Friendly.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-05", "description": "I know two people that claim this is their favorite Chinese in the City and would give it five stars, but it's my review so it gets four.\n\nPros: \nJeff - the waiter who is nice, not in a \"I want a big tip\" kind of way, but in a \"I was born with a smile on my face and always remember your name and what you like to eat\" kind of way.  He's on top of the whole dining room whether there's one table or it's full.\n\nHealthy? - Well, they certainly claim to be on the healthier side of the Chinese food scale, which is similar to saying healthier side of the Soul Food scale, but whatever, it makes you feel just a little bit less guilty about eating Chinese.  No MSG, fresh ingredients, and plenty of vegetarian choices, although the meat dishes are too good not to order.\n\nTasty - The food is really good.  You really can't go wrong with anything on the menu.  Adjust the spice to your taste.\n\nCons: \nZero ambiance.  My school cafeteria had more charm.\n\nhttp://www.cleanscores.com/2715/Henry%27s+Hunan+Restaurant", "author": "Ann W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-17", "description": "Decent, flavorful Chinese food in outer SoMa\nGot the shredded pork Chow Mein, appropriate spice levels, tasty and needed nothing\nPersonally prefer Chow Fun (wide) style rice noodles, but unless they are fresh and cooked properly (not an easy thing to find) they can be yucky\n\nDecent size seating area\nVery hole-in-the-wall-esque, nothing fancy\nNot the type of place you'd want to bring a date to impress, unless you're a take out and movie at home type of gal, in that case, u need to contact me immediately :)\n\nWill go back for lunch sometime, when the mood strikes\n\nTIP: no w i f i there (yes put the spaces so non searchable)", "author": "G K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-23", "description": "*sigh*.  \n\nif you're goign to make bad chinese food, the least you can do is throw some MSG on there. Seriously, when the quality of ingredients is crappy, you have no choice but to mask it, either with Spice or with MSG!\n\nI only came because the line at SO was too long (I suspect its' where they get most of their business).  \n\nI'll try not to come back... I'm sure there's a place down the street with some MSG on top!", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "I've been eating here for a good year now and I would have to say that it's consistently good - I usually go with my co-workers for lunch and order close to the same thing - \n\nstring beans with shrimp - \nnapa cabbage - \nchicken chow mien - \n\nthe lunch comes with hot and sour soup which pretty good on a cold day - It's very salty and the spice varies but for the most part they make it hot -", "author": "Tony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-03", "description": "They smoke the meat themselves, staff make Pork Buns in their slack time. Friendly and good size portions. Mu Shu soup and the smoked meat special (chicken and pork) with rice is a satisfying meal for two. \n\nNot to sure about Dianna's meat pie - something like a Chinese Tostada but try once and you decide. \n\nRecommended.", "author": "Niall M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-25", "description": "Talk about GREASY! Everything tastes the same whether it's chicken or shrimp, green beans or broccoli. It's all got the same sick sauce on it.\nPut it this way, last time our office ordered take out from this place I found a giant BOLT in my kung pao chicken. \nNo joke. Keep an eye out when you eat this stuff!!!", "author": "Melissa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-16", "description": "Every office worker needs a cheap chinese place nearby to drown their sorrows in tea and spicy sauce.  Sort of the lunch equivalent of a dive bar.  For me, that place is Henry's Hunan.  It's divey, atmosphere-wise, but this isn't the Sunset, so the menu caters to westerners both in selection and, well, language.  They make a big deal about their no MSG, no extra sugar policy, so I was curious to see how the orange chicken would fare under such rules.  Sure enough, it wasn't drowning in syrup, and the flavor that was there tasted unusually fresh.  And it was even spicy!  Dunno if I'd call it \"healthy\", though; the breading still seemed pretty bad for you.  \n\nFriendly service and some extremely cheap lunch specials too.  Not a lot of choices for Chinese around here but you could do a lot worse.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-21", "description": "When I was at the nearby courthouse for jury duty I asked the employees in the building where they go for lunch. They mentioned this place.\n\nVery solid hole-in-the wall Chinese food. The food here comes piping hot right off the Wok. I love the Hunan smoked ham with vegetables over rice. They don't skimp on the spice. It makes me happy that I can get a great big spicy lunch for 5 dollars. The chopsticks of the Hunan region are longer than others too- lands more comfortably in my hands. \n\nGo here before you go across the street to Trader Joe's because its a disaster going to the grocery store while hungry. Also, when you do your jury duty go here.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-31", "description": "It was meh. I have been traveling around the Bay looking for GOOD mapo tofu, and i have NOT found it at Henry's Hunan. The beef bits with bean curd (i think thats a direct quote from the menu) was hardly flavorful and just mreh. and yes, I asked the waiter if that equated mapo tofu and he said yes. \n\nOn the other hand, I enjoyed the little complimentary bowls of soup, and the dumplings were pretty tasty. i think they're handmade somewhere or another, but it was pretty good.\n\nThe other food my colleagues got was pretty meh too. Its nice to switch it up and get away from the office, but I just meh.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-01", "description": "Fresh and hot chicken -- like my love life (I have NO idea what that means)! Every time I've been here, I've been in the middle of six hundred errands to be done in the immediate area (Trader Joe's, mailing Netflix, being \"foine,\" etc.) so I always run in out of breath and hurried, sputtering something like, \n\"thekungpaospicyyeahoki'mgonnaberightbackok?\" - very similar to the part in Goodfellas (ey, fuggit about it!) where Henry's doing his errands in a coke frenzy.   Seriously the freshest chicken I've had at a cheapo Chinese food place in ages.  Free Tibet!", "author": "J P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-30", "description": "By far the best of the Henry's Hunan family of restaurants that I've been to. Love the greasily delicious chicken chow mein and the free hot & sour at lunch.\n\nMichael is super swell, especially if you become a regular, although I get the sneaking suspicion that he runs the place with a Mao-like fist once the kitchen doors shut.\n\nThis place is the only thing I truly miss about working in that area.", "author": "RT G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-21", "description": "OK, so I feel bad writing a negative review of this place, but it'll balance out all the overly positive reviews. It did have AMAZING hot and sour soup-- so if you're a fan of that dish, you should come here for that alone. The green bean dish and stir-fried beef with green onions were decent. Also, the service is friendly and it's one of the few restaurants near the Concourse if you're heading there for a concert, show etc.\n\nBut, out of the other 4 or 5 dishes we ordered, the rest of them were just bad. Diana's special or the onion cake with ground meat reminded everyone of dog food. Even the rice was hard and tasted old-- they screwed up white rice at a Chinese restaurant!!! other dishes tasted overly salty, had way too much stir-fried onion (cheaper than meat or veggies I presume), or were just mleh... now you know, you've been warned", "author": "Amy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-30", "description": "Another lunch staple of my SOMA working days. Never could understand why we came here so much cuz there's nothing special about this place -- probably cuz I worked with a bunch of Bok-gwai (white people). However, they did have this meat pie thingy -- 2 deep fried onion pancakes filled with meat. Damn greasy but damn good. \n\nTo balance out the greasy meat oreo (or so the logic works in my head), I always ordered the cold chicken noodles -- chicken, noodles, julienned cucumbers and peanut sauce. Good stuff.", "author": "Law W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-05", "description": "Henry's Hunan reminds me of the chinese restaurant at the end of A Christmas Story.\n\nAlthough the restaurant is located next to the freeway, it has that hole in the wall feel. And the staff might sing you Deck the Halls, while decapitating a roast duck right in front of you.\n\nThe food is hit or miss on a lot of occasions.  The Hunan Smoked Ham with Vegetables was insanely salty; compounded with the heat that the dish was packing, I was ready to dunk my head into a trough of water. Thankfully, the Dry-Sauteed String Beans and Tofu with rice noodles and vegetables brought relief.\n\nAlthough the scallop and shrimp dishes were nothing special, the Orange Chicken and the Beef with Vegetables were two of the better ones on the menu.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-09", "description": "I love this spot Jeff is the best he always knows exactly what  \n we want(because we always get the same thing)..If you like  spicy then you need to check this place out...Family Owned ( Jeff's   uncle)n the food is always consistent try one of these  dishes if you go\n\n  Tofu with the clear noodles(not the name but ask for it)\n  Hunan Special Orange Sauce Chicken \n  Spicy and Hot Rock Fillets \n\n There is always parking", "author": "Kim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-22", "description": "Why should you eat at this Henry's?  Let me give you some reasons:\n\n1. Orange chicken\n2. Kung Pao anything\n3. Chow Mein (best in town, the menu says - and it ain't lying!)\n4. Becuase this guy when to the trouble of trying EVERY SINGLE DISH on the menu so you don't have to: http://greasepig.com/henrys/\n5. Becuase Jeff is the only server I've ever seen keep a very large dining room full of customers completely happy all by himself.\n\nBottom line: if you like spicy, greasyspoon, chinese food then look no further.  This is the THE place.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-24", "description": "So I went once and I'm probably not going again. The chicken chow mein did not work for me, even though I hadn't eaten in 8 hours it didn't taste good. It had a good toasty flavor, but it didn't have that yumminess. \n\nThe lady working in the front was really nice tho. I really wish this place was amazing so I could come by very often.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-10", "description": "A friend in concord mentioned that all the locals know that Henry's is the best. Another local confirmed it and I went off to try it out.\n\nThey have the best hot n sour soup i've tasted anywhere. I've yet to make it past dishes with hot bean curd sauce. amazing. I've also had fantastic service the times I've went as well.", "author": "Karsten M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-15", "description": "Dear Henry, \nPlease marry me and come live at my house. Your orange chicken always makes me feel better about myself, and plus, you're really super nice. I only ever see you by yourself in the restaurant, during the evening hours during which I come, and you serve the whole house with a big smile. I have never seen a chef. I think perhaps your food is made by magic, which is why it is so yummy.", "author": "Carleigh K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-18", "description": "Slowest Chinese restaurant ever.   We never even ended up getting our food.  After being seated, it was about 5 minutes before we were offered menus and 10 minutes later before were finally able to flag down the waitress to order.  Ok, no big deal.  We ordered a few dishes, including hot and sour soup.  Meanwhile, the waitress kept shuffling back and forth, avoiding eye contact.  About 35 minutes later we flagged her down again and asked how much longer it would be.  She said there were still 4 or so tables in front of us.  Having observed that food had been coming out at a rate of one table every 5 minutes (apparently they only cook for one table at a time), we decided we weren't willing to wait ANOTHER 20 minutes for crappy Chinese food, and told the waitress we were leaving.  Instead of apologizing, she seemed relieved.  Come on, they've got to at least have a vat of hot and sour soup back in the kitchen. It shouldn't take an hour to bring out something as simple as that.", "author": "natilee r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-27", "description": "A Chinese woman friend once told me that the only good Chinese Restaurants are the ones that have formica tables and flouresent lights.  Well, this fits that description.  Infact, they actually didn't completely take out the old kitchen when they \"remodeled\" and you can see the enormous satinless steel wall and hood of the old stove right in the dining room.  Gots to love tat.  \n\nAnyways, Jeffery (or Jeff) is a wonderful Chinese young man who works there constantly.  Seriously he's ALWAYS there.  I asked him about it and he says he NEVER gets a day off, holidays included as long as it's during the week.  He feels blessed that he doesn't have to work weekends because the place is closed, so he doesn't complain.  \nI look forward to discussing the Giants and A's with him.  He gets so excited by the prospect of baseball season and perhaps the Giants going all the way.  Unfortunately, the more excited he gets the less I understand, me being a white boy from CT.      ...and now that they've got Zito (yeah, I'm an A's freak) I can start rooting for the Gi's! \n\nSo say Hi to Jeffery and then go straignt on to order the Harvest Pork.  I freakin' LOVE that stuff. I seriously cannot order anything else. A am addicted and, NO, I won't go to counseling.", "author": "doug b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-14", "description": "got there early and food still took over an hour for first dishes to arrive. wait wasn't worth it as food was not anything to make the wait worthwhile. only saving grace was it was cheap, but you pay for what you get.", "author": "Ian V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "The place is very close to my work. Im only alloted 30 minutes for most lunches, so I love to go here. \nThe food is prepared very quickly. The cooks can bust out 3 orders in about 7 minutes. \n\nThe guy behind the counter, didnt catch his name, is ALWAYS up for a chat and is very friendly and personable. \n\nThe food is SPICY!!! Do not pass up the opportunity to order something spicy off the menu. \nOnce I ordered veggies and tofu without the spice and it was too bland. lol\n\nGood choice for vegetarians and people who want to eat less meat in their diet. Plenty to choose from.", "author": "joanna r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "HOT & SOUR SOUP (MY FAVE) is a MUST HAVE, especially in our SF FOG WEATHER! Their braised cod fillets, smoked ham & string beans, and noodles and pork sauce are to die for! i can't say enough about this place.. we get take-out at the office and they are always friendly with us since we're regulars. they even offer us discount coupons here and there!!!!!! talk about customer service and keeping their customers happy! their dishes are delicious, plentiful, and a lot of bang for your buck! :) you won't be disappointed!", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "Dumplings and Green Bean Chicken are a must have. If you like hot that can make you sweat ask for it spicy. They don't mind making it mild for those faint of heart. This place is great for family style meals and groups. So come hungry and leave happy.", "author": "Charlene K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-06", "description": "I gave this place 3 chances and I felt like an idiot the third time. Food is bland, greasy, and BIG portions. I was never even able to eat half my plate, gave it to a bum right outside the place  when I was being polite and asked for a doggy bag. I wonder what he would rate it? \n\nYou want good chinese food in the area go to eliza's.", "author": "T S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-21", "description": "Henry, when I tasted your meat pie, I heard angel's trumpets and devil's trombones. It was gorgeousness and gorgeousity made into an appetizer. Thank you.\n\nOh, I should mention also that apparently Henry is dead. Is it weird to write a paean in such a way to a dead man? I hope not, because I could write more florid, flowing prose about his namesake restaurant's dishes (try the Hot and Sour Beef), hilariously outdated signage (described justly as \"bowling alley\"-esque), and ample water (stretching here, but it was at optimal drinking temperature).\n\nSeriously though. Have the Meat Pie and Hot and Sour Beef - two hours later you will have the most glorious, wonderful itis ever. I happened to be at work at the time, but it's okay because I work for a startup and we're cool like that.", "author": "Nik B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-22", "description": "Unfortunately for Henry, I am back on the free wifi in the jury assembly room with plenty of time to review the mediocre lunch I just ate .  Very limited lunch menu.  I wish I was more adventurous with it, but sliced beef and smoked ham didn't sound appetizing.\n\nI ordered a kung pao dish, which had tough meat but good veggies.  Everything was way too salty, including the free soup.\n\nThey have a nice waitstaff, doing the best they can.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-03", "description": "This place is always packed during the lunch hour on weekdays!  Both times I've come, I wasn't able to get back to work on time and had to go over my hour for lunch.  The servers are actually really busy, and I see them running around, so it's not for lack of trying.  It's just that they don't have enough people for soooo many customers at lunch.  I actually eat in about 15 minutes or less, so the rest of my lunch hour is spent walking there and back(10 minutes each way), waiting for the food(20 minutes) and ordering/paying for the bill(10 minutes).\n\nMy low rating isn't for the wait time or service though.  While the wait time is super long, it's because they're one of the only options for Chinese in the area, and they're super cheap (lunch specials run from $6 to $8).  The service is actually pretty decent.  The poor waiters are always scurrying around to try to help all of the customers.  The rating is for the food itself...I just feel that the ingredients seem to lack flavor.  I got the kung pao shrimp once, and the shrimp didn't have much taste besides the taste of the sauce.  Plus, it was chopped up rather than being whole pieces, which was a turn off.  It just tasted like the shrimp had been frozen for too long and lost all of it's natural flavor.  I also got the combination chow mein, and once again, the beef and chicken didn't have much taste, besides the flavor from the sauces.  Both dishes were mediocre, if not disappointing.  I do like that they provide a free hot and sour soup with the lunch though.", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-01", "description": "I love henry's - this one is pretty inconsistent.  Plus is that every item can be a lunch special/rice plate.  Minus- sometimes the soup is watery and nasty, sometimes awesome.  I usually get the hot and sour vegetables, which is sometimes great.  sometimes the rice is soggy and the sauce not so good.  decor is very cheap.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-27", "description": "In brief, the worst restaurant to which I have ever been. Obligatory \"if I could give zero/negative stars...\" remark. I wouldn't go back unless I lost a bet.\n\nAfter learning that next-door Fanny's (now replaced by So) was closed down, my coworkers convinced me to settle for Henry's Hunan. Lisa W's review of Fruit Loops orange chicken rang in my head.\n\nI'm convinced that the orange chicken is a menu trap to play upon unsuspecting people brought up on Panda Express' bastardization of Chinese food. Do you remember eating orange Flintstones vitamins as a kid? If you forgot, orange chicken from Henry's Hunan tastes exactly like them! It was so unspeakably disgusting, I couldn't finish the only bite I took. I had the rest boxed up just so I could show my roommates how awful it was.\n\nMy coworker pitied me and shared some of his Hunan spare ribs with me, which tasted soapy, for lack of better words. When he ordered a Coke, he was handed a can and glass. Sure it was lunchtime, but this place was hardly busy. Would it have killed our waiter to fill the glass? To add insult to injury, despite the fact that there was American Express marketing near the cashier, I couldn't pay with American Express! No tip.\n\nI hope that next-door So drives this place out of business!", "author": "Cam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-20", "description": "I'd love it if people added an extra comment to their review which specifies if I should I go out of my way to visit a given place.\n\nIn this case, I drove down to Henry's with a friend and was disappointed.  The food was ok, if you like eating Chinese take out from the yellow book pages after bible dipping in a strangely appointed dinning space next to the freeway - I guess that's just not my thing.  With all the great (or at least good) Chinese places: Eric's, Alice's, etc. - I just don't know why I'd choose this one.  If you happening to be walking by for lunch.... sure, but as for making an effort to visit - I wouldn't.", "author": "Jared F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-31", "description": "I am addicted to Henry and his gang of dragons in his kitchen.  I went to lunch at the Natoma Henry's for Lunch with some buddies, and one of them called me out for dinner at the Bryant Henry's the same day.  I accepted the challenge and we hit it up.  \n\nIt was our first time attending this location so I had to roll with my Henry Flexi-FIt cap to show them I was legit.  It was pretty empty, but the hostess was really nice.  Friendly faces from the Natoma location recognized us so we rapped about the Bryant location.  The chef from Natoma was working there for dinner.\n\nWe had the dumplings, Kung Pao Chicken, and Henry's Short Ribs (first time dish).  Dumplings were pleasant as usual. The Kung Pao Chicken was hella good and extra spicy.  We thought it was possibly the best Kung Pao Chicken we have had at any Henry's location.  The short ribs took some time to eat, but was definitely tasty.  \n\nWe survived back to back Henry outings in the same day with no problems.  I highly recommend it.  We didn't even need to use the sink faucet that hangs above one of the tables against the wall to shower off the sweat from the spice.\n\nSeems like this is very popular for takeout/delivery.  It was pretty quiet. Also, it is popular for slirkers to pop in and try to get free food.  Some dude came in and asked how much coca cola was and after he found out it was a buck fifty he left, but not without grabbing a handful of food from the plate of a customer who left.  Another dude came in a bought a carton of rice.  Just rice.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "I was walking on the opposite side of the street and I could smell the awesomeness.\n\nnice waiter/host.\n\nonly problem....the handle on the togo carton made the thing singe in the microwave.....\ndoh.", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-09", "description": "TWO WORDS GOOD N SPICEY!!!! lol If you want some spicey chinese food, this is the place. I order the chicken curry and it's soooo good. You can taste that curry and the crunchiness of the bell peppers and onions. I took an order home to my hubbie and he loved it.\n\nThis place is real popular and very busy during lunch time...you should call your order in instead of having to wait 15-20 minutes.", "author": "Chantie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "The spicy garlic chicken dish I had was just what I was looking for. My wife had the shrimp tofu dish and enjoyed it as well. \n\nNo frills as far as the ambient qualities are concerned. Kind of a plain jane establishment. \n\nThe service was pleasant. \n\nOverall not bad for 7 bucks.", "author": "Gene G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "Smoked pork, fermented black beans, and green beans = one happy Yelper. There's nothing Earth-shattering here, but it's good solid Hunan fare. The waiters remember us betwixt visits and the spice hits the spot.\n\nRec's: spicy fried cod, smoked ham with green beans, Marty's special, mapo tofu (with respect to Jade, I like it), dry braised green beans, onion cake, and the complimentary hot and sour soup is pretty darned tasty. Henry's is a dependable SOMA lunch destination.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-13", "description": "I would give this place ZERO stars if that were an option. The hot and sour soup was so salty and yeasty that I couldn't force it down. I had one spoonful and I thought I was going to vomit. The beef with broccoli tasted like watered down horse shit. I have no idea how this place is still in business. I mean....how the hell can you fuck up Chinese food this badly? Stay away.", "author": "Babys P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-26", "description": "I am very disappointed now.  I have been going to this location for the past 5 years or so and have liked it, though noticed inconsistencies for the last year and a half.  Tonight was the worse and I may not go back. I ordered Henrys Special pork, usually good, but tonight the spinach was about 90% stems and although I like to eat the entire leaf (and stem) this was too much.  The fried rice does not have the depth of flavor that it used to.  Furthermore, when I mentioned this, they didn't care.  Finally, before I paid my bill they gave me a dollar off.  Thanks, I promised not to spend it in one place.  If they are listening, it is difficult to get to your restaurant now and I worked to get there.  I don't deserve second best.  \n\nThey even acknowledged the lack of spinach leaf but why didn't they say something.  Time to move on.....", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-04", "description": "Simply the best in the city. No foo foo frills. Just delicious food!\nI actually think they put crack in their curry sauce. I walk around all week thinking about Henry's curry chicken.\nFYI.-If you are a Henry's virgin, start with the Hot and Sour Chicken.\nIf I lived elsewhere I'd make someone go to Henry's to get me some food and put it in one of those vacuum-packing food sealer things and mail it off to me.", "author": "SF N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "I want to give Henry a fourth star. Service was great - host was friendly, and he had no problem with me running to Trader Joe's while they made my food. And the menu had quite a few good looking items, including chicken with string beans, which was labeled the healthy option. Sounded promising, and when I asked for it to be made without oil, there was no hesitation what so ever.\n\nNow I can't say this for certain, but I'm pretty sure my dish was loaded with oil. It was also loaded with chicken, which was awesome, but there is no way something that tasty and smothered in some questionable sauce wasn't overloaded with unnecessary oil. I guess I'll never know, but the suspect nature of what was in my white takeout box limits me to only three stars.\n\nHenry, buddy, if you can refute this, send a shout! Fourth star is waiting.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-31", "description": "The food is definitely oily and saltier than before...what the hell happened Henry? LOL!\n\nTHis place use to be good, now I don't go here anymore...that sucks! The Diane's meat pie is good as usual, but the dishes I use to order ain't spicy anymore! Big disappointment!\n\nParking is always hard, what do u expect...it's in the city!", "author": "Marc E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-11", "description": "I come here for lunch twice a week. Different style of Chinese food with the great service and low price. Love this place!", "author": "Byung K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "I've tried a few dishes, but the best thing on the menu to me is Dinah's meat pie. I use to go to the one on Natomas and was shocked to realize there was another one so close to my job on Brannan.", "author": "Barbara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "I must say, Good food! (oh well still eating as I'm writing this review) ,  Tried their \"SPICY & HOT ROCK COD FILLET\" and it was a dynamite. Interesting mix of flavors with just a right kick of hotness!. Would not mind trying other stuff next time.", "author": "Rajesh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "This place is awesome! Yes, like the other reviewers said they will make your spicy stuff spiiiicy. I'm weak when it comes to that but my friends loved it. I wasn't expecting much from here due to its location. Seriously one of those middle-of-nowhere-but-good-as-hell restaurants. If you want authenticity in some Chinese gourmet at decent prices you should check this place out.", "author": "Lily L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-02", "description": "Been going to Henry Hunans for lunch for years. Was one of my favorite places to eat in the city, plus the staff was very friendly and efficient. But Henry Hunan's is under different ownership now, and the experience is very poor.\n\nWent yesterday and noticed that there seemed to be new staff. Tried the hot and sour soup, was bland and watery. Had Pork Chow Mein, tasteless. Orange chicken also disappointed.\n\nService was horrible even though the place was only 1/3 full. Asked for chopsticks 3 times before I ended up getting them myself. First two dishes served 5 minutes before the third dish and rice. One of the waiters also started yelling at his 7 year old daughter right in front of our table.\n\nIn all, poor service, poor food. Will not visit again.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Seriously, we may be ruined for other Chinese food and we have been to China and live in the other best Asian food capital of the US, Seattle. We got to Henry's on a recommendation from a friend from SF who still dreams about Henry's. He gave us the menu musts of Dianes Meat Pie, Hot and Sour Chicken, and anything off the smoked menu so we got Marty's Special. AMAZING!!!! This location has little to recommend for ambience but the freshness and depth of flavors in the food is amazing. It's also cheap, clean and in a safe neighorhood.", "author": "L R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-05", "description": "I've seen lots of reviews about this place. However, I was very disappointed at the food when my office took us there. All the food was drenched in salt and they all have the same color. You can get much better Chinese food and not worry about your blood pressure by walking a few blocks towards Chinatown.", "author": "Yi-Bing Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-02", "description": "I have been going to the Henry's on Bryant St. for years. It was definitely a popular place among all the locals. Unfortunately, I was shocked when I went this week to find out that it appears that this Henry's is under new ownership.\n\nThe service was absolutely awful and none of the food tasted the same. The soup was different, and not in a good way, the orange chicken was way too orangy, and the chow mein had almost no flavor.\n\nI hate to say this, but I will not be going back to this Henry's and I would suggest you avoid it as well. Time to find a new Chinese restaurant...\n\nUpdate: Just found out that Jeff, who used to run this location, started a new restaurant over in Noe Valley: http://www.yelp.com/biz/henrys-hunan-jeff-and-eddies-san-francisco", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-02", "description": "bad food. but the server was super nice. but bad food\nI went here cus SO was closed 12/31 LOL\n\nill tell u what NOT to get:\n\nthe hot and sour soup2/5\nsauteed eggplant 3/5\nfried rice (no taste) 2/5\nonion cake 0/5\nliling chicken wings 1/5\n\nthese were the dishes we got.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-27", "description": "Don't know why I haven't reviewed Henry's sooner...  I've been eating here for years...  first at the Sacto St. location but now the Soma spot as my office moved.  I absolutely love Henry's!  The food is always fresh and delicious.  Some of my favorites are Harvest pork, Henry's special, meat pie, cold noodle salad, the list goes on and on.  They have a large menu selection that you can check out on line.  You can order your entree mild, medium or hot.  This is not health food people, it's Hunan at its finest.  Go, eat and enjoy.", "author": "Brenda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "this place is always packed during lunch rush hours...its better if you just do take out rather than dine in.\nnow, im not much into eggplant, but i tell every eggplant lover to try their eggplant dish here because its AMAZING! its spicy, cooked just  to the right consistency, and it melts in your mouth with the flavor of ground pork.\nevery dish ive had here was exceptional!  if you love spicy food and looking for something more substantial than the typical salad, this place would be a great option!", "author": "Anthro Food E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "Delicious chicken salad and fabulous chicken chow mein.  On the dinner menu the bean curd with the spicy meat sauce is very good too.  One of my friends couldn't handle the spicyness though.  That's OK.  If you let your waiter know the spicyness of the foods can be toned down to suit your taste.  Excellent service too!", "author": "Sara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-28", "description": "One time, Eddie, the head guy at the Natoma St. place, randomly gave me a replacement turn-signal mount for my motorcycle, which I was missing. Now that's service. \n\nI like Henry's. Not every day, but it's yummy and fun to go there with a big group of coworkers for lunch. At dinner time (yes, they seem to actually be open for dinner) it's empty but still tasty.", "author": "queue q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-13", "description": "Delicious items on the menu.  Start with the Diana's Special, as it's a fun appetizer in groups of 3 or more...or just your fat self.  If you're not allergic to seafood (travesty), have the cod.  The fried rice is also tastey.  The only thing I think they should improve is that there's too much salt in their dishes.  Well, what can you expect?  It is Hunan!", "author": "Michael B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-01-28", "description": "Great Hot and Sour Soup...very spicy!", "author": "Diane R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-03", "description": "I had lunch here today and I must say that this place has come along way since it's inception years ago. If you have a spicy appetite for traditional chinese, this is definitely your place. The hot spot dishes for me was the mongolian beef, and the hunan cashew chicken. You will need to bask in a bangload of water and steamed rice in order not to melt your throat from the chili pepper in just about every dish they have...!!!! The lunch specials are fairly priced considering the quality of the food is excellent and flavorful...! In case of emergency, dunk head in cold water..!", "author": "Sven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-21", "description": "I've eaten here about a half dozen times now and for me it's damn good Hunan!  The owners are very friendly and heck makes the best dumplings  in town...always fresh as you see him or other staff making them - simply yummy.  I like spicy so if you like Chinese on the hot end check this joint out.  Odd location, and very dive-ish, but heck, again - it's the food that brings me back.", "author": "Tiberius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "I love spicy food and they bring it.  I got their Henry special and it was enough for two people and had chicken, scallops, shrimp, woodear mushrooms, lots of other veggies and spicy sauce...yum!  Not a romantic place...only had lunch downstairs (not sure what upstairs is like) but good for lunch with coworkers.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-15", "description": "Food is great here.  It definitely fits the taste bud of a person straight off the boat or a person who is relatively picky in terms of ethnic foods.  \n\nGreat service, staff is very attentive and tend to remember their clients after only a few visits. Large and spacious, I think you'll enjoy the food here any time of the day.", "author": "Prince B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-01", "description": "Hot, cheap & greasy...just like I like my men...mmmm!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-29", "description": "This place is damn tasty, and if you like it hot they will oblige.  Perfect for those long booze addled nights of drinking in SOMA.", "author": "George K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-04", "description": "NASTY.  \n\nWent there because it was within walking distance for lunch.  Bad Idea.\n\nOrdered some chicken, beans and noodles.  Greasy and bland.\n\nWe would have been better off going to McDonalds next to the 850 Bryant-and that says a lot.", "author": "anthony l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-20", "description": "Huge surprise - live just around the corner, and never knew how good this place was until a week ago. Really interesting menu, a mix of stuff you've seen before and stuff you haven't. Everything is delicious and unique. My new go-to Chinese spot!", "author": "Nicolas C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-11", "description": "This place has a HUGE menu and big tables for big Friday-afternoon-lets -get-the-heck-out-of-the-office lunches.  BUUUUUTTTTTT it also has huge lines/waits and the food, while good, is no better than any other decent Chinese place in the neighborhood.  Only worth it if you have a giant group that won't fit elsewhere.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "Friendly staff, pretty good Chinese food. The sweet and sour beef was very tasty.  Orange chicken would have been better if I had ordered spicy. I got mild and it was a bit bland for me.  The hot and sour soup is really good.  The decor is pretty basic but clean (for a Chinese restaurant).  I can see this place being a regular lunch spot. If only they would deliver . . .", "author": "Su K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-20", "description": "I'm not sure why this place is rated so high on yelp, it has steered me the wrong way.  It was very disappointing, greasy, cheap chinese food for not so cheap prices.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "While I prefer the Minna and original Sansome locations, this place has the best family-run-business atmosphere.  Random location across from Bed Bath and Boring/Trader Joe's mall at Bryant and Ninth St.  Recommended dishes: hot/sour chicken; Henry's special; green beans without meat.  Only complaint is that rice is sometimes past its prime.  Dishes themselves are amazingly hot and fresh and truly as spicy as requested.  The other day my friend and I stopped for a late lunch here on the way to a movie downtown.  Easy on-street parking early afternoon on the weekend.  Even got free very spicy hot and sour soup with chicken stock which was a great appetizer.", "author": "Xander S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-04", "description": "I had the Chow Mein, and the dumplings, and both were great. Tons of food- and the service was impersonal, but efficient.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-23", "description": "this is one of my favorite chinese restaurant s in the SOMA.  the meat taco like thing (what is it called?i forgot); shrimp fried rice; and beef and broccoli are my favorites. the service is fast and the meal is mad cheap.  this place gets pretty packed at lunch time but i think u can make reservations. whenever we have a large party, we always ask to reserve our spot at the rear of the restaurant. \nprepare to have food coma when you get back to the office.", "author": "Bren L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-15", "description": "Pretty good but rice was not great.  We had the chicken and broccoli which I enjoyed but my wife was not crazy about and the kung pao shrimp which she liked.", "author": "Patrick Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-22", "description": "Huge portions, but very oily.  The pricing is good and cheap.  The Meat Pie is pretty awesome, I would give that a 4 star.  Everything else is alright.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-24", "description": "Henry's is the place I was introduced to Kung Pao Tofu the way it should be (in my mind, not they way it was supposed to be) - really spicy. \n\nWhenever I get a craving for really really spicy food with hot peppers (and oil), I simply call in and get an order of the kung pao tofu. \n\nApart from spicy, the food is nothing much to write about. Its standard fare. Service is good. However, its quite oily (regardless of whether I request to cut the oil).", "author": "Rahul A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Great for lunch.  Doesn't offer the typical crappy chinese food menu, which is refreshing.  Though some dishes are pretty one-dimensional in flavor.  Favorites are the eggplant salad and cold spicy noodles.", "author": "Kasima T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-15", "description": "better to take out than to eat there, as the decor is borrowed from the hall of justice just down the block.  \n\nif you can't handle super spicy food, you better order mild, as that is still as spicy as most conventional spicy Chinese food.\n\nvery fresh, very tasty, very good with pilsener beer (I suggest Lagunitas Pils or Sudwerk Pils).  Get yur ya ya's out!", "author": "Ken H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "This place is a great place to grab a quick bite.  My friend works at the Hall of Justice and we have lunch here every so often.    The prices are reasonable but the portions are small compared to other hunan places.  \n\nTheir pork and beef dishes are great.", "author": "kenny l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-15", "description": "I've been here twice -- the food is great, and the price is right.  The owner is also very personable.  This is officially my go-to place when I'm craving Chinese...", "author": "Kevin V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-10", "description": "OK everybody in my office love Henry's.  I think they are too spicy and too similar taste nothing special other than too hot.", "author": "C T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-18", "description": "Henry's Hunan is a small chain of restaurants at different locations throughout the city.  The food is consistent and the prices is reasonable!  Tonight, I ordered my favorite dish, Shrimp with String Beans and steamed rice.  The shrimp is tender and the green beans are cooked just right- with a bit of a snap, not soggy.  If you get a chance to dine at any one of their locations, I highly recommend this combination.  The serving was enough for two, so come with a hungry appetite and bring your friends.  Great food for a great price.", "author": "Denny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "The first time I tried Henry's Hunan was in the FD about a year ago.  I wasn't very impressed at that time, even though my colleagues loved this place.  I thought the food tasted like Panda Express or \"Westernized\" Chinese Food.  I am pretty picky when it comes to Chinese food.  However, much to my surprise when I decided to give it another try, this time, at the SOMA location -- it was pretty damn tasty.  The place in SOMA on Bryant is still a hole in the wall but the Spicy Sole Filet and String Beans were cooked just right and delicious.  I will definately be ordering take-out from here again when I'm craving some greasy Chinese food.", "author": "Janny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-05", "description": "My favorite dish here is the spicy fried cod.  Lots of black beans and very tasty.  The house made spiced ham is also great as well as the soups.  I like the spinach soup better than the hot and sour, though.  OK, I'm getting hungry just writing about it.\n\nYou will be hard pressed to find a more friendly server than Jeff, especially in a Chinese restaurant.  Good baseball fan.\n\nOnce you become a regular, you can get away with certain things.  For example, you may get  some of the entrees served over rice rather than having to order a whole entree.  That's great if you're dining alone or want to sample a dish without having to get the entire order.", "author": "Eddie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-18", "description": "this place is very efficient.  i've only been here during lunch hours because i work right by it but its in and out.  no muss no fuss.  everything is hella cheap too, i usually spend about 8 bucks.  i love how spicy everything is too.  i leave with my mouth on fire. love the hot & sour soup with the onion cakes.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-06", "description": "Food is still good, but went seriously downhill since Jeff left to open his restaurant on Church.  Now there is competition a few doors down too.", "author": "Bentley L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-07", "description": "tried their shrimp and green beans.  ordered it mild and it was still pretty darn spicy.  it was ok.  somewhat greasy.  not the best chinese i've had.  maybe i didn't order the right thing?", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-16", "description": "kungpao chicken , potstickers, hot sour beef just to name a few killers.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-25", "description": "This is a great place to eat, my co-workers and I really like eating there. We must eat there once a week. There are several things that are very good.", "author": "David S."}
