{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "I will go to war for Heyday's smoked rainbow trout and farro & asparagus salad. I don't say this lightly because I'm not fighting material.\n\nI'm a person who prides herself on always changing up what she eats. Not the case for workday lunch anymore. I eye the clock until it's a decent hour to step out for lunch and rush to Heyday for a large plate of organic and delicious food. I tend to split the plate between farro and kale with trout on top to keep things balanced. But shhhh just between us...I really only want the farro. It's no joke that the large plate is FILLING - not gonna stop me from eating my full portion though!\n\nI'm officially a huge proponent with a huge stomach and a huge smile.\n\nJust FYI - there's also delicious looking treats, coffees & teas, breakfast foods that I haven't tried yet", "author": "Claire W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "This is my ultimate lunch time go to - delicious and doesn't leave me in a food coma after lunch. I love the half salad/half sandwich option and the flexibility to add as many different salad options into that tiny box as possible and then a delicious sandwich on the side. Can you tell this is my jam? All for $11. Go to's: turkey sandwich, and of course their chickpea salad and kale salad are just staples..", "author": "Melody T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "I love Heyday and it has become my go-to spot for breakfast since starting to work in the area about 8 months ago. I very much value it being organic and am willing to pay more just for that. I usually get mocha with almond milk (they use Califia Farms milk!!! That's HUUUGE!). \n\nJust wish they had matcha lattes so I don't have to go to Peet's for that since I much rather support small businesses than big chains. Their breakfast sandwiches and seasonal fruit topped toasts are delicious too, oh and those fresh baked muffins.\n\nService is always friendly and music is good! Perfect place to chill before going to work.\n\nEDIT: They now serve MATCHA LATTES! Woohoo!!!", "author": "Kat S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "As of 10/8/18 they will no longer accept cash, so sadly, I will not be back. I do not support cashless businesses, and question the legality of refusing legal tender. Sad because their food is pretty decent, and location is convenient.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Heyday is another soup\\salad\\sandwich restaurant in FiDi catering to the lunch crowd. Unlike some other chains it has only two locations in downtown. For some reason it seems to be the favorite of our office admin who orders from here regularly whenever we need a working lunch, so I've had a chance to try most of the sandwiches and salads over a period of time.\n\nI've also been here a couple of times as it is literally next door to me. They have a pretty good lunch deal where you can get a single item for $6.50, two items for $11 and three items for $15. I generally get the two item deal and get a half sandwich and small salad combination. By itself the half sandwich is pretty small (but comparable in size to other similar sandwich shops) but the salad is of decent size. There isn't any make your own salad bar so you have to contend with standard pre-made combinations.\n\nThe sandwiches are good but and comparable to what you get in Breaking Bread, Bread and Coco or Boudin, but a step below the sandwiches from Working Girls or Homegrown. The salads are much better and can stand up to Ladle & Leaf easily (my favorite is the chickpea salad). I've also tried their cookie ($3) but like the ones from any one of the Specialty Cafe's much better.\n\nPrice-wise it is right around the $12 mark for a soup\\salad and sandwich combination which is where all other sandwich places in FiDi are at. They also seem to have an online ordering option which for some reason I've not used yet, but intend to do during the next visit. Overall this is a solid candidate for lunch rotation in downtown.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "This post is for the sandwiches only. While they are tasty, I wish I could justify spending $6.50 on a sandwich that's smaller than the size of my hand. It makes more sense to get the 2 item deal for $11.", "author": "Anne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Staple, consistent lunch meal (almost on the daily). Started coming here regularly over the past few months bc my work building is right next door. \n\nIdk why I never do it - maybe it's to get that extra 5-10mins out of the office - but you can preorder your meals online for pickup, if you're in a rush. If you come by Heyday any time btw 11:50am-12:30pm M-F, expect there to be a MUCH longer line. Majority of the time the line looks longer than it is though. Upside, the staff here has got their lunch schedule hustle down! And get ppl in and out fairly quickly. \n\nMy fav order used to be the small order, with pesto pasta mushroom + kale salad with added smoked trout. Comes out to $9.50. BUTTTTT recently they switched out the pesto pasta mushroom for this healthier pasta asparagus situation. WHYYYY. Bring back the mushroom pasta!!! It was sooo much better. \n\nI believe they switch out their menu seasonally...which is likely the reason for the asparagus swap in (it's a summer veggie, right?). Fine, fine. Anywho, the small looks a lot smaller than it really is. Don't be fooled (if you're being food or money saving conscious). I used to get the large, but ppl, it's massive. I usually pour out the \"small\" onto a plate when I get back to work...you should do the same. The box is usually way too tiny to eat out of and there's a lot more food in it than you think. \n\nALSO, they have a stamp card. Didn't know this for the longest time. If you get 2+ items, they'll give you a stamp! That means the large + soup, large + cookie, etc. Ten stamps = free meal. Happy eating!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "This is my favorite spot for when I need something quick, easy, healthy, and filling. Their small salad (I usually get the pasta salad and something else) is tiny but super filing cause they pack that container as much as they can. I love the atmosphere, and quick and easy service!", "author": "Mara Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "Loved this place for its food, organic and good tasting. It's a little pricey but can I don't mind for good quality organic produce. \n\nWhy the 3 star, unfortunately there is one worker there that feels the customer is an inconvenience to him. Short and rude to the point, you feel guilty about being there as a customer. I put up with it for a few weeks due to the other staff being great, and the food awesome but there are far better customer service options with good food in the area.", "author": "Luke L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "They Heyday on Mission Street is my go-to (just because it's closer to work), but I like this location due to the space alone. Unlike its counterpart, this place has enough room inside for a sit-down meal (1 point for Spear Street). Clean tables, roomy atmosphere, and brightly lit. All the same friendly service, fair price, and yummy healthy lunch options - my personal fave is the trout toast. Mix and match your lunch with sandwiches, soups or salads or different sizes. \n\nOnly downside about the Spear Street Heyday is they don't have a make-your-own salad bar (1 point for Mission Street). Sometimes, a girl just wants options on whether or not she wants chickpeas in her salad or not. Either way, Heyday is a win win.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Both times that I've been to Heyday have been very pleasant. I got the 2 item combination both times and was quite full afterwards. It doesn't look like it'll fill you up, but the half sandwich + salad is plenty.\n\nSomething I learned about the last time I was there: the salad counts as 1 item, but they'll actually let you pick two and fill half the container with each. It's a nice way to try a couple of salads at the same time!\n\nI personally really like the sandwich + salad combo, but will also echo other reviewers that a rotating variety would be nice for the future.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "one of the healthier options in the area. everything is fresh but I the menu (other than soup) never changes. \n\nyou can pick two or three servings, my go-to is two salads and a protein. the trout on toast is great\n\na little more variety would have me coming back more often", "author": "Bob U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-08", "description": "I like the food here but it's a bit pricey. The 2 option lunch is an ok deal but I once got a coup of soup for $7 which is a ridiculous price for basic lentil soup.", "author": "Siobhan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "I LOVE HEYDEY! It is pricey BUT if you sign up for MealPal the $11 two item choice ends up being around $7.50 for lunch! Cauliflower sando is my go-to. I'm not even a vegetarian. It's that good.", "author": "Angela T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-14", "description": "They  dont have the croissant egg /ham sandwich  apparently  only available in Mission.  Why? It's only 3 ingredients?", "author": "morfin k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Love this place like a family member. They have an awesome menu of healthy and delicious options with rotating specials. The chickpea quinoa salad and kale salad are two of the best offerings, as is any farro or bulgur dish. Good job heyday!", "author": "Vee S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-26", "description": "$7.07 for a cup of split pea soup?! Are you f'ing kidding me? It wasn't even a bowl. It was a little larger than a chobani yogurt cup. The worst part is that it wasn't even good. \n\nNothing special and way overpriced.", "author": "T M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "The food is delicious, convenient, and similarly priced to most of the lunch options in the area. I'm knocking off a couple of stars because this week when they were serving lentil soup, the lentils were very under cooked and did a number on my body for several days afterward.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "In love with this place!! I am a bit addicted, to be more accurate on the feelings. Since I discovered it, I have gone four days back to back... I have been working in the area for awhile and not that happy with the food selections - so this place is like a little gem. It is super clean, the staff is super friendly, and the food is just so satisfying AND healthy! \n\nGO, now!", "author": "Sha L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-29", "description": "Clean, cut fresh sides with gourmet sandwiches, but pricey.  It's a standard of one item for $6, two items for $10 and three items from the menu for $14.\n\nTheir sandwiches are already made and displayed as well as their sides.  Their yam salad vinegarette was yummy.  Their meatloaf, in which I opt for, was savory as well!  The only complaint that I would say, is that their sandwiches are only served up as half and not whole.\n\nThis place offers an urban, open space vibe.  The staff members are chill and friendly.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "I go there just about everyday I'm in the office.   I do not get tired of eating kale and cabbage.  I knocked off a star because charging $4 for a side of chicken is very unreasonable IMO.  They always have a steady stream of customers so business can't be bad.   Maybe it's too pay the heavy dose of people's working there or the price for organic food is jacked up.   Either way,  the price hikes is bearable though not welcomed.  To add this $4 chicken is ridiculous.   And is not even a healthy portion. Total downer even though it is very good.", "author": "Fong L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "On my first day at my office, we decided to go across the street to have a healthy meal. My coworkers mentioned that this place had some amazing salads and I was down to try a new joint. It was a done deal!\n\nWhen I walked in, I immediately thought of Yelp. Their prominent color is red, the Yelp shade of red. Their chairs, menu and wall art has this red, contrasting on the light brown walls and you've got a super popping focal. What attracted me was the variety of organic produce with a sustainable approach, using local farmers. The food  was made fresh every morning and displayed in glass casing. \n\nFor lunch, I went with their lunch item, 2 choices for $10. My choices were the Raw Kale salad (with toasted seeds and a yogurt avocado dressing) and the Roasted Sweet Potato salad (with autumn lettuces, figs and balsamic dressing). The kale salad was super fresh and I loved the texture from the seeds were good. The dressing was a little to tangy for my taste but it was overall fresh. The sweet potato salad was awesome. huge chunks of sweet potato, sweet figs and complimented with a nice tang of the balsamic. \n\nThis is a great option for the health conscious customer, looking to eat clean for lunch. It's located literally across the street from my work, so you know I'll be back again soon! Come check them out.", "author": "Rockne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "I love coming here during lunch when I'm craving salads. My favorite is the kale salad followed by the bulgur wheat and chicken salad. The kale salad dressing is really good and light, and the pine nuts are a major plus! The bulgur wheat and chicken salad is super filling and also has really good flavor. A 1-item order is $6, and a 2-item is $10 - pretty reasonably priced. I always feel satisfied and healthy after lunches here!\n\ntl;dr really good and healthy salads! Try the kale salad", "author": "Grace D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "Hey, I don't feel I've reached my heyday, at least I hope I haven't since I've got a few miles more to go before my giddy-up gets up and gone. Until I reach my peak, this Heyday will do, especially since it represents healthy, flavorful eats during the harried lunch hour. The chef is Jeremy Scheiblauer who worked at Chez Panisse Café right until the devastating fire early last month. And it was he who responded to my fumbling idiocy when I accidentally dropped my sandwich on the floor by packaging up a new one for me. I could tell just by this gesture that he is intent on exhibiting a high service ethic and is no doubt garnering repeat customers as I write this.\n\nFor years, this was the proficient yet lackluster Pasta Paradiso serving relatively unexceptional pasta dishes for indiscriminate tastes like myself, an easy lunch with that colleague you didn't know well except you knew you'd both suffer for the carb overload for the rest of the afternoon. Not so with Heyday as they focus on seasonal and organic soups, salads, and sandwiches (with top-drawer artisan Acme Bread, of course, due to the Panisse connection). I met my longtime friend and former colleague Liz, whom I hadn't seen in months, and she suggested it knowing it would be new to me.\n\nBy coincidence, I suggested Heyday as well since I just saw it on the \"Hot on Yelp\" feature list. It's light and open quite similar to Market & Rye in presentation and definitely a notch above anything you'd find at Specialties. Liz and I strategized and decided both to order the three-item lunch special for $14. That would allow us to try four salads between us and order our own sandwiches. I went for the heartier fare - the Chef's Special that day, Bulgar Wheat with Snap Peas & Herbs (quite delicious with the peas a nice contrast to the wheat) plus the Toasted Farro mixed with chopped Asparagus and Meyer Lemon (a nice toothy salad with a clean freshness) (see photo).\n\nLiz ordered the Raw Kale Salad with Toasted Seeds & Yogurt Avocado Dressing (crispy freshness with a real tang) and Marinated Beets with Pickled Vegetables (probably the most predictably executed of the quartet but solid nonetheless) (see photo). Our sandwiches were satisfying and sized proportionally to the salad servings. Mine was the Slow Roasted Turkey with a sweet-savory combination of Currants, Leeks & Mustard, all on a soft deli roll (see photo). Liz had the sweet veggie concoction of Roasted Red Onion with Ricotta Salata & Herb Jam on Focaccia. I have to admit hers was better. When we got there a little after 11:30AM, it was empty, but it crowded quickly as it got closer to noon with the queue going out to the sidewalk on Spear. Go early and enjoy.\n\nFOOD - 4 stars...salads are stellar, sandwiches also well executed, somewhat overpriced but looking forward to more choices as they get rolling along\nAMBIANCE - 4 stars...light and open, currently crowds very quickly close to noon\nSERVICE - 5 stars...Jeremy and crew are showing real empathy for their customers\nTOTAL - 4 stars...as I wait for my heyday, this Heyday works just fine", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-26", "description": "Had the pulled pork sandwich and pasta for $15.  The sandwich was admittedly pretty good but for the price point can't justify giving it more than 3 stars.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Top picks: rainbow trout sandwich, pesto pasta, lentil soup. Yes, this place is on the pricier side for lunch, but it's due to the quality of the food. I love that it's made fresh everyday and is quick even with a long line.", "author": "K J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "Excellent coffee and healthy breakfast and lunch items including salads, juices, fresh blueberry and strawberry muffins, yummy oatmeal, cornmeal cakes, veggie frittata, and my favorite savory and sweet breakfast toasts. For those looking for something more health conscious.", "author": "Sue D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-27", "description": "Heyday is literally underneath my office, so I come here pretty often out of convenience. Between noon and 1, there is usually a pretty long line, but it goes by pretty quickly. My coworkers and I usually joke around because it seems like people are being herded in to the line. \n\nI usually order:\nChickpea Salad (4/5) - The ingredients are nice and fresh, but it is a little oily for me, so I usually drain as much oil as I can off of it before I eat it.\n\nTurkey Sandwich (3.5/5) - A nice, clean tasting sandwich, but a little dry.\n\nI have also had:\nSoppressata Sandwich (3/5) - Nice for the first bite, but it was overwhelmingly salty for me\n\nSweet Potato Salad (4/5) - A nice bite. I enjoy this salad, but I just prefer the chickpea salad, so I usually get that in favor of this\n\nNoodle Salad (3/5) - Pretty standard. Fine, but nothing special.\n\nHeyday is a good place to stop for a quick lunch, but it is pretty pricey. I usually get 2 items, which amounts to $10, which may not sound like much, but the portions are pretty small.", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "Heyday is pretty close to where I work so when it finally opened my coworkers and I decided to head over and give it a try. \n\nTheir menu is pretty straightforward, $6 one item, $10 two item and $14 three item, You have your choice from any of their salads, sandwiches and soup of the day. \n\nI opted for the two item combo consisting of farro and barely salad + garbanzo bean salad. \n\nThe grains were cooked well and seasoned evenly. While the flavors did not wow me, I did appreciate the vibrant colors and freshness of the salads. \n\nOverall Thoughts\n\nI would not hesitate to tell my co-workers to give it a try but myself would not make Heyday my go to lunch destination", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "I used to love their roasted cauliflower sandwich. But this week when I went there, they said that was a seasonal sandwich. Since I am a vegetarian, the only veg sandwich option was roasted chicori and arugula sandwich. Since most of the things I have had from heyday - soup, sandwich, salads have been good I thought sure, let me try that.\nThe chicori sandwich is by far the WORST EVER SANDWICH I have ever had. The chicori was so so soooooo bitter, yuck. I mean who thought of putting it in a sandwich, what is wrong with you !\nNot good Heyday! This place was a 5 star rating place for me and you have reduced it to 0 if I could .", "author": "Janita S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-20", "description": "I didn't have high hopes. There is a limited shmattering of breakfast and lunch options for which you can order 1, 2, or 3 of. Prices vary accordingly and are fair as the portions are generous. \n\nI opted for soup (split pea) and garbanzo bean salad. Yes, they tasted healthy, but flavor was lacking. Other options included a few salads and sandwiches. I wasn't a fan of the huge bowls of pre-dressed salads. It made me wonder how long they'd be sitting there. \n\nNot sure I'd be back.", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-09", "description": "In honor of yesterday's SF Giants' home opener, three strikes, and you're out!\n\nI'm at a loss why people love this place.  Yes, they may use the fresh, high quality ingredients, but at the expense of flavor?  Add in the high cost plus the fact that I'm always starving two hours later, and plain and simple - no thanks, Hey Day.", "author": "Mel T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-28", "description": "This is really a 2.5 star review but I'm rounding up because the chickpea salad made me want to pull a Golum and guard my precious...\n\nYes, the food is delicious! Really delicious! It's a little spendy but the taste justifies the price. Did I tell you it's delicious?\n\nWhy not 5 stars? \n\nI ordered lunch for 24 people in my office. You don't get to pick the sandwich assortment and mortadella and salmon aren't usually top picks for mixed company. (Good reviews - so bullet dodged.)\n\nOrdering is just an email link. Very low tech. That's not usually a problem except that online ordering usually prompts you to add drinks and whatnot. I frantically sent a follow-up email requesting the addition of assorted drinks. \n\nA phone call from their office confirmed my order to be delivered at 12:15p the next day. It arrived at 11:15a, prior to my conference room reservation so my desk got cleared in a hurry and I worked for the next hour surrounded by towers of food. This gave me the chance to peek in the bags. \n\nNo plates or utensils. Dammit!\n\nI went back to their website and see that plates and utensils are extra. THATS FINE but when I drop $500 on lunch you'd expect their person to mention plates. \n\nSo 2.5 stars were penalized for having to eat delicious delicious food on 2 year old cake plates with cheap spoons that were scrounged out of the back of the kitchen cabinets. \n\nAt that price point I absolutely expect a VERY little bit of hand holding.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-24", "description": "Food was pretty good.  However, myself and 14 of my colleagues became violently ill within 12 hours of eating.  When I reached out to the vendor he apologized for me \"having to go through that\" and they were completing an \"investigation\".  However, it has been over a week and there has been no additional communication.  I would have really appreciated identifying what caused this extreme illness, especially if the identified illness would require a dr. visit.\n\nI would definitely suggest caution when eating at Heyday.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-05", "description": "My office keeps on ordering their food and after awhile its the same stuff. Very meh.\n\nBest thing here is probably the Turkey sandwich with fig spread.", "author": "Henry W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-22", "description": "Heard about Heyday opening so close to my office and honestly was a little hesitant to try it because of the mixed reviews.  But, I needed a detox from my vacation so decided to check them out with a curious co-worker.  Okay, it was probably my fault honestly, for the Spicy Coppa sandwich they listed I think on the overhead menu that it had whole grain mustard in it, but not on the tag in front of it in the glass case.  I was trying to decide between that and the turkey sandwich with the leek mustard, but not being such a mustard fan I went with the Coppa half sandwich (little did I know it has mustard in it) & the Asparagus Farro.  The sandwiches are all cut in half and the \"sides\" given to you are a good size.  It's mix n match 1 for $6, 2 for $10, & 3 for $14.  As someone else has mentioned, though the menu is \"healthy\" there aren't many protein options.  They have a cabbage salad side that has chicken in it but I couldn't really see any chicken, it was cabbage overload.  Just wished that they had the rotisserie chicken available for lunch because it sounds so tasty and would give another meat option.  The sandwiches are all made beforehand.  I wish some could be made at time of order upon request so I could ask for no mustard.  \n\nThe staff was very knowledgeable and friendly.  It was back to my office to eat my healthy lunch.  The bread they use was my favorite Acme!  The baguette was nice and crunchy.  There was some cheese and a layer of Coppa and lots of arugula.  The meat wasn't spicy, but the mustard was and there was so much of the grains all over the bread.  I think even if I didn't care for mustard much, it would've been much better without the mustard.  Maybe a nice aioli or a light pesto or mayo, if not plain.  I really liked the toasted asparagus farro.  It had lots of fresh asparagus & tasted like brown rice but better & the Meyer lemon was a nice compliment.  I may just come back sometime for a side of this!  \n\nAll in all, Heyday is a good option for lunch if you want something healthy.  I was full after my 2 item lunch, so portions are decent even though I usually tend to be a light eater.  If you are not opposed to mustard or are more of a herbivore definitely check them out!  I may come back to get their 1/2 chicken dinner deal to bring home for us for dinner sometime or for more of that farro.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-05", "description": "Just check my photo for this overpriced joint. I didn't know I had to pay a premium for a space that only promises beautiful design complete with showmanship (or bait and switch) while fulfilling your order.\n\nI was initially show a larger container for the salad and was perplexed when I had a fistful side of $6 kale salad. I know it's bubble, but really? \n\nMy colleagues scoffed and walked down the street to Working Girl for their $9 salad which was triple the size of mine (and just as good). \n\nAlso, when I all I wanted was a croissant on the go, the counter man made me half a 10 minute conversation with me as he tried to sell me (in order) - cappuccino, coffee, juice, tea, another croissant. \n\nNo thank you. And I won't be back. \n\nP.S. If you can afford these $6 salads, please move back to NYC.", "author": "Jenn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "It's like the really healthy wholesome food you would expect to get at the Whole Foods deli counter (or Bi-Rite). Not cheap but comparable. The sandwiches seem a bit small ($6 for half a sandwich?) but the salads seem on par. Since there aren't many options like this in this area of town you can't be too picky (otherwise pack your own food!). \n\nI just had the small ($6) gemelli pasta with zucchini and though it was small, it was perfect for a light lunch and really delish.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "Delicious, healthy, quick.  The only drawback is the price, but $10 for a sufficiently filling meal it's about par for downtown SF.\n\nTheir veggie sandwich appears to be seasonal, which at the moment is a roasted eggplant, herb jam (think pesto), and ricotta salata (sliceable, cured ricotta cheese) on foccacia.  I like the sprinkled salt on the outside of the bread, which really brings out the flavor in each bite without over salting the whole deal.\n\nThey also have a variety of salads (not just leaves, but grains and other veggies too) which are plenty flavorful and don't make you feel like crap after eating them.\n\nAn easy, healthy choice if you're fine paying $10 for a lunch that isn't massive.", "author": "Carlin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "It's love, exciting and new!\n\nSlightly pricy for lunch (if you get 3 items) but the food is so good I'll be working my way through the menu!  \n\nToday:\n\n- Faro salad\n- Chicken Salad (more like salad with chicken)\n- Turkey Sandwich with roasted leek spread\n\nPricing:\n\n- 1 items for 6\n- 2 items for 10\n- 3 items for 14\n\nMenu:\n\nThey seem to have 4-5 salads, 4-5 sandwiches, and a soup or two each day.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Delicious and healthy! Sometimes healthy salads are so boring and not very filling, here there's more focus on the ingredients other than salad like garbanzo beans, lentils etc. it looked a little boring from the outside so I don't think I would've come here if t wasn't for the recommendation from a friend.", "author": "Helena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "My friend and I both had the roasted vegetable wrap. The wrap was so fresh, with veggies roasted to perfection... So yummy! A healthy and delicious choice. As a side, I had the lobster bisque soup. It was so creamy and delicious. My friend choice the potato salad. She said it was really good.\n\nThe wait staff were very friendly and efficient. I will definitely come back when I'm in the area.", "author": "Cece M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "I JUST LOVE LOVE HEALTHY HEYDAY! \nI work in the financial district. I've been on a crazy health kick and this place is perfect. The service here is some of the best in the area! If you get a chance to talk to their manager, Jennifer, you'll be happy you did. She makes you feel as if you have been coming in forever! So refreshing compared to the hustle and bustle service you get elsewhere. I originally had questions about catering. She helped me get a last minute lunch order together and delivered for a last minute meeting. To top it off their salads are organic and tasty! Thank you, heyday!", "author": "Sara J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "Good lunch food at reasonable prices in the FiDi. \n\nI tried the Farro salad and their Soup of the day which came out to around $10. It felt healthy and filling. The farro was good, very olive-oily. But the soup didn't seem to be anything special, just lots of beans in it. But this is a \"soup of the day,\" meaning it can change. Anyway, I recommend this to the person who forgets to bring a lunch to work.", "author": "Manami K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Absolutely terrific, low-ceremony salads. Their seasoning can be inconsistent and it ain't cheap -- but still a great lunch place.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-28", "description": "Came here with a coworker for a bonding lunch. \n\nJust going to say - kale salad and chickpea salad are the best. They try and fill as much as they can in the box - it's actually surprisingly a lot of food. \n\nAlso, communal table - makes it easy to eavesdrop and can make it awkward with the lady next to you starts randomly talking to you about student debt...which neither of you have. AWKWARD.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "I've not been to Heyday for anything other than breakfast during the week, so I can't speak for the sandwiches and salads.  What I can say though is that the oatmeal I've had from here is delicious.  On both occasions I stopped in for a quick breakfast option, and decided that their house-made compote was worthy of having at least once.  The apple cinnamon compote I had was delicious.  Other topping options included granola (which, I must say, wasn't that good...there was some weird herb in it, maybe thyme? that ruined it for me the first time), brown sugar, chocolate, and dried fruit.  The oatmeal size they give you is the right size for breakfast, and is always hot when it's served.  \n\nI have yet to try any of their pastries or yogurt option, but seeing how this place is on my way to work from home, I'm assuming that I'll get around to it.  Other thing that I noticed about Heyday is that they have take home dinner options for 1/2 chicken.  As someone who doesn't always have time to cook, this would be an interesting option to try if I can get around to being at Heyday before 7.", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "You know you're getting old as hell when you look forward to buying oatmeal in the morning instead of a greasy fried egg sandwich. Not that I dislike the latter, but I don't find myself in a morning situation that requires fried egg sandwiches very often anymore (ie: extremely hungover).\n\nSo, sensible breakfasts it is, and the steel cut oatmeal here is really good, especially with their housemade strawberry jam. It's a huge portion, so you don't feel bad for the 5000% markup. Please don't remind me I have a perfectly good container of steel cut oats I can make myself at home. It's simply too painful.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "Great for catering, love the avocado toast at a breakfast meeting, but be sure to have some salt packets in the room, a lot of the food is super low sodium which is not for everyone.", "author": "Giselle E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "I was hella hungry the other day and tried both the organic meatloaf and the roasted cauliflower sandwiches. The cauliflower was good (a bit too tangy/salty), but the meatloaf was delicious.  \n\nTheir sandwiches may look very simple but it's very fresh and tasty. The meatloaf only included some pickled onions, a bit of arugula and aioli spread. But damn...never knew aioli and meatloaf can taste this good together. And best of all it was on a fresh Acme rustic roll; slightly crispy on the outside and soft and chewy inside. I love love Acme bread. In fact, most of the time, I feel like it's all about the bread when it comes to sandwiches. \n\nSorta pricey. You can choose among a good selection of salads or sandwiches. 1 item for $6, 2 for $10 and 3 for $14.  I definitely needed to choose at least 2 items to fill me up.", "author": "Cathy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "Tasty and healthy salads.  I love the chickpea salad, the kale salad and the cabbage and brown rice salad.  Sandwiches are decent.  I have to get a 2-item combo with a sandwich to feel like I ate enough.  But I'm a big dude.\n\nIt's hard to find decently healthy food right around this area.  Rincon and Spear food courts are kind of not so great.  So it's great to have Heyday as an option.\n\nMinus one star for high price and lack of variety.  Otherwise I'm pretty happy with this place.", "author": "Kayvaan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-26", "description": "Tiny, pretty food.\nSmall sandwich and side veggie salad.\nHas lines.\nFelt a little ripped off.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-05", "description": "Great concept for lunch - fast with lots of optionality.  Most get 2 for $10 deal and can select among soup du jour, a few sandwiches, and lots of salad variations. Felt healthy and was definitely very fast. Not exactly cheap given portion sizes though. And I didn't find it very delicious. I'm a 5'4\" girl and I was starving again by 4pm.", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "My favorite lunch place downtown.  I get three items, usually, and save half for the afternoon.  That will set you back $14, but so will a Mixt Greens salad.   \n\nI've seen lots of complaints about portion size, but I find the portions plenty big to last the six hours until dinner. Plus, the ingredients are fresh, the choices are healthy (plenty of gluten free/veg options), and the food is very well prepared. \n\nI almost always get:\nKale.  Always the kale! Very flavorful, fresh, well dressed.\nFarro. Sparse on the chicken, yes, but the grains are cooked perfectly. \nSoup. Delicious, delicious soup. \n\nBest part - when ordering 2 items (or soup, and 2 others), they will let you smash 3 kinds of salad in the 2 items box.  So nice! Decisions are hard, and variety is the spice of life.  Variety and cumin.", "author": "Marie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-25", "description": "I can't believe there's a line out the door at this place.  There is absolutely no variety here at all.  Some assorted salads, pre-made sandwiches - which looked sad sitting in the case, they were practically begging to be eaten.  And only one kind of soup? Please give me at least one other choice!  Bland, boring, and tasteless.  Their pasta of the day was just that - pasta.  No flavor, no kick, no nothing.  And kale salad?  Meh...don't bother.   \n\n2 stars for being organic, local, sustainable, blah, blah, blah, and friendly staff.  But I'd settle for a rude, a-hole behind the counter if the food was more memorable.", "author": "silvertongue- p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "This place is super good but for a place located right across Eatsa, you better watch your business plan! For $6.95, I got a really tiny pasta salad while across the street, you get a pretty good portion salad with a ton of stuff you can customize yourself. \n\nWhat can I say, SF is just a tough city.", "author": "Aggie Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-22", "description": "I was in the mood for soup and walked by to see a organic, sustainable eatery. Heyday? Looks promising...\n\nWhile standing in line...\n\nMe: \"how much is for a cup of soup?\"\nEmployee \"$4.00\"\nMe \"oh ok. what's the soup of the day?\"\nEmployee glances at her co-worker searching for an answer....\nEmployee's coworker \"Lentil with roasted tomato w/ cauliflower\"\nMe \"ok. let me get one.\"\n\nGet to the register...\nCashier: \"That will be $6.75\"\nMe: \"They just told me it was $4....\"\nCashier \"Well it would be $4 if you purchased two items... one would be $6 and the other would be $4. Its $10 for the two item meal. Is that ok?\"\n\n-_-\n\nMy brain \"Great for the math lesson but THE QUESTION WAS how much for a cup of soup.\"\n\nAll in all... not really fond of the customer service and $6 somethin for a cup of soup is a bit ridic. It's just an another healthy, organic alternative for the healthy conscious eaters in downtown financial district.", "author": "Crystal S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-01", "description": "Food is decent, but portion is horrible.   Only good thing about this place is you'll never gain weight eating here... given tiny portions just not possible.   I'd love this place to offer 'hearty' or 'guy' portions for a few dollars more.   After all... really how expensive is cabbage or quinoa?   \n\nExpect to leave hungry and you won't be disappointed...", "author": "Dan R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-09", "description": "Halfway there.\n\nWhat an amazing sandwich. Generous serving of roasted turkey with a quite good sweet peperonata (tomatoes, onion and pepper based dressing) on a deli roll.\n\nAdd in a great looking space and pleasant staff. So far so good.\n\nJust needed twice as much to make it worth the $6 price.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-11", "description": "Sandwich was so-so, and the chickpea salad was enjoyable. Quite overpriced, even considering the area.\n\nSure, it's environmentally friendly, but for $10, I could get equally environmentally-friendly food that tastes better and actually fills me up!\n\nBut perhaps I'm just biased because I don't like cold, dry, bland sandwiches, nor do I particular enjoy the feeling of hunger after lunch. To each his own, I guess.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-27", "description": "Classy with good food and a refreshing space -- great for a grab&go lunch.  As another yelper Denniz S. says, it's consistent.  It is also on the pricey side depending on what you order.  Salad/sandwich or soup/sandwich or soup/salad -- make that 2 choices, will set you back ~$10 plus if you get a drink then... nearly $15!\n\nThe space is open concept but the flow is a bit weird -- it's a line in and along the glass cases to the register, after which you need to navigate out, thru the sit-down area and out thru the folks crowding in from the door.\n\nDon't forget if you're getting it to go and they give you a bag, pick up some utensils to the right of the register so you don't get back to your desk without.\n\nSo... despite all that, since I do like the farro salad, the eggplant sandwich, and the coppa sandwich, I'll be back again~", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-15", "description": "I really want to like this place really love the oatmeal not much else, but I like the decor...real turnoff is the use of the seating by the staff!!! They use it as an employee lounge and office! Taking primo seating and on their breaks chilling...it's just not cool!!! Get an office and break room Heyday!!! Let customers sit without listening to you interviewing applicants!", "author": "Janet L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-04", "description": "HeyDay is under my office. I used to often drop by there for oatmeal and yogurt. Their lunch items are too oily for me. \n\nA couple of weeks back I had a nasty experience. I discovered a chewing gum in my oatmeal while eating it. I was really disgusted. I took it over to them expecting the manager to take charge of the situation. Instead the person just checked with the manager who never even turned around to apologize. She asked him to offer me a refill. Having lost my appetite and knowing that it would be the same batch I was not interested in that. He checked with her again and told me they could give me a refund. He simply said he was sorry and that he would let the chef know. I could care less but I took the refund and walked out. I am never eating there again.", "author": "K C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-19", "description": "I'm probably not the right person to review this place, but for others like me, here it is.\n\nWhen I was a kid,the vacations my family took were always road trips. Each morning of those trips, facing endless hours of counting Interstate signs and tired already from begging my parents to let me swim through the slimy flotsam in the hotel pool just one more time, I directed my best whining at the need for breakfast to be at Denny's. It had to be Denny's. Because in the late 60s and early 70s that was the only place I could reliably get a hamburger at 7:00 am.\n\nI can't really be sure if my carnivorism is due to nature or nurture, but it is a fact of my gastric identity and always has been. Imagine the difficulty I had navigating the bleak vegetarian times of the seventies and the carbohydrate happy eighties. Shudder. Dark days indeed.\n\nBut the only thing that remains constant is change and the triple whammy of Atkins/Paleo/gluten shaming has resulted in a culinary climate that speaks my language. Whenever I am contemplating my next meal, the question is usually \"where can I get tasty protein?\"\n(Which is not to say I don't love vegetables. I do. As a side dish or creating a bed for my meat. Veggies are great, veggies are fine. I especially love the current superstars like kale and brussels sprouts. But animal protein is the centerpiece of all my meals. Anything else is a snack.)\n\nI was excited to hear about Heyday, the Chez Panisse Cafe has been my favorite restaurant for 30 years. I knew the quality of food would be a cut above. Here is the set up at Heyday: There are a number of salads and sandwiches (half sandwiches really). You may get one item for $6, 2 for $10, or 3 for $14.\n\nMy first impression on walking into Heyday was \"where is the food?\" The only protein is in the half sandwiches, and even in those it is in condiment portions. I faced a dilemma. I did not want two \"sandwiches\" (1/2 sandwiches) since that would be a boatload of bread when all I really wanted was more meat. So I settled for the turkey sandwich, the kale salad and the farro salad. What the fuck is farro? It is not \"giving birth to a litter of pigs\" as I originally thought, it is, rather, an Italian grain. Ok.\n\nThere was about 1 ounce of meat on that plate. The salads and sandwich were very very good. I'm sure the food is organic and locally sourced, if you are a vegetarian or even better, vegan, this might be a real find.\n\n...but I could not get past feeling ripped off for paying $14 for a plate of stuff that my food eats.\n\nI enjoyed my $15 hamburger at Town Hall yesterday MUCH more.", "author": "Leigh C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-10", "description": "Read about them on a foodie blog. Decided to give a try, as I'm constantly trolling the area for new/yummy food.\n\nClean/airy atmosphere... super-nice guy behind counter helping me. Free cups of water (any more I just hate places who don't do that.) (Hear me, Out The Door??)\n\nPro: The turkey sandwich was amazing. Mustard seeds/leeks... really great chewy bread. Can't say enough about how delicious I thought it was.\nCon: It is a SMALL sandwich. I'd call it a half sandwich.\n\nPro: Really interesting selection of diverse salads. I had a hard time choosing, and ended up settling on a kale salad and a garbanzo bean/quinoa salad. Both were interesting a delicious.\n\nCon: $14 for a three-item combo. FOURTEEN DOLLARS. I'm full, but was able to eat it all, so it wasn't a huge portion. I can't spend $14 on lunch. Out The Door (who I just dissed for their lack of water-providing), Slanted Door's take-out cafe in the Ferry Bldg, has a hearty amazingly great hot pork sandwich with delicious ingredients, great bread -- and is $8.50). Specialty's (practically next door to Heyday) has ginormous salads for $7.99 that I can rarely finish.\n\nI second the person's review who questioned the amount of visible workstaff. I'm pretty sure I saw at least six people working. Possibly less staff could get the prices down...? And does the menu on the window not prominently show the prices because they're afraid of scaring people off before they walk in?\n\nI don't know what to say about the question of my returning. I can't afford it as a go-to place, that's for sure, and more than likely will not... although I'm pretty sure a turkey sandwich or rather, turkey \"half-sandwich\"!) siren song will be calling to me now that I've tasted this one... \n\nMy suggestion: make the side salads just a smidge smaller (maybe put them in the same bigger plastic box and include the sandwich) -- and charge $10.50 for the trio. Seems a more fair price, and comparable to other options. (Heyday -- if you see this message after you've lowered your pricing, send me a note here and I'll come back for another try!!)  :)", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Heyday is just about the fastest way to get a fresh tasting lunch in this part of the FiDi. The menu is limited, but that's part of how they keep the line moving, even between 12-1.\n\nIf you are someone who skips breakfast and is famished by lunch time, you are probably not going to get enough to eat at Heyday. If you are trying to eat mostly plants, as Michael Pollan advises, then Heyday might be right for you.\n\nSome appear to think the prices are high, but they are comparable to most Ferry Building eateries and a bit lower than places like The Plant.", "author": "Hans T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-11", "description": "This morning I consumed an everything bagel and cream cheese from Noah's and was feeling a bit on the guilty side. I work next door to Heyday and decided that my lunch should be more of a punishment than reward to make up for the delectable calories I consumed this morning. For some reason, Heyday seemed like just the right place.\n\nI purchased a half a turkey sandwich and a chicken salad. I tried the sandwich first. The quantity of the turkey was on the stingy side but the more pressing issue was lack of taste. Fortunately I had a packet of Dijon mustard left over from my outing last week to Bistro Burger. Once that was spread on the sandwich, it was quite tasty.\n\nI then tried the cabbage salad with bits of chicken in it. It too was lacking in flavor, so digging through my desk drawer, I found a packet of salt I used on my fries last week (also courtesy of Bistro Burger). Once the salt was liberally applied, my cabbage and chicken bit salad was edible.\n\nAfter spending $10 on a sandwich and salad that was barely passable, I think I'll skip the bagel and cream cheese next time and just go to Bistro Burger.", "author": "Colleen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "I'm not sure how I've been working in the Financial District for so long and never knew about this place, but I'm glad I know now!  \n\nWent to lunch with a colleague but trying to find a place to eat that's a departure from the ordinary when you're vegan can be a bit challenging.  So she recommended that we hit up Heyday and I loved it.\n\nThere were at least five salads that I wanted to try.  I went with two (although next time I'll probably go for three).  They were awesome and vegan and filing.  Everything I could have asked for.\n\nThe line was long, but moved quickly - they're obviously very efficient.  Definitely going on my list of nearby options for lunch!", "author": "Deb M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-02", "description": "Visited Heyday for the first time today & I'm pretty impressed. I like the local/eco aspect and all of the food is pretty healthy. The kale salad was flavorful & crunchy, turkey sandwich was good but on the small side. My only complaints:\n\n- Wish they had a little more variety - specials or something\n- Price value is not great - $10 for two small items, which is plenty for me but not if you are super hungry\n\nI will most likely be back, but would love to see them add more to the menu as they mature.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "This place just opened last week but I find myself craving it every day around lunch time. I've been back three times and am making my way through their menu: everything is so tasty! \n\nHaving worked in the neighborhood for a few years, finding a lunch spot that features organic, healthy food of this quality is rare, so I'm really excited it's here. I imagine it will be my new go-to lunch spot.\n\nThe people who work there put a lot of pride and love into each item and it shows. \n\n(To the person grumbling about still being hungry, maybe you should try the Olive Garden for unlimited soup, salad and breadsticks for lunch, hunty.)", "author": "Jack S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-28", "description": "This is more or less the Deli section of Whole Foods, dressed up in a trendy space. Unless you missed a grocery run this past week, skip it.", "author": "S G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "I was looking for a lunch time adventure...since it was a beautiful sunny day I decided to swing by Heyday and take my lunch by the water.\n\nSince I read that their portions are smaller I went with their 3 item combo. \nThe three items I chose were:\nchickpea + raisin curry salad\ncabbage & chicken salad\nhalf turkey sandwich \n\nI should have gotten 2 items since I was full after the two salads. \nJust meant I had a turkey sandwich for the next day's lunch!\nI'll be back to try more of their salads.", "author": "Sara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "I work a block away from Heyday and I'm pretty sure this will be the driving force to come into the office and not work from home! So delicious! I slightly agree with other reviews that it is a tad pricey, but the quality and the deliciousness make up for that. I'm not a fan of huge portions and love their portion sizes at it allows you to have a sandwich and soup or salad and not feel guilty for having leftovers that will go uneaten.\n\nThe design of the place is also very inviting, it almost pulls you in from the street! I HIGHLY recommend this place for people that are looking for REAL food and convenience!", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-15", "description": "Delicious, fresh, healthy lunch in light airy setting.\n\nMust try the kale salad with avocado and yogurt dressing with toasted seed, and the moroccan chickpea salad with quinoa and raisins.\n\nI love the 1-2-3 mix and match item combos, if I'm only slightly hungry I'll get two salads, if I want more I can get two salads and a half sandwich, or the best combo yet, salad, sandwich and soup.", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-27", "description": "I found Heyday on a weekend on a walk around my neighborhood and decided to check it out during the week.  The line was out the door so you know it must be pretty good and it was.  I got the Spicy Molinari Coppa and ended up getting the whole sandwich because one half wasn't going to be enough.  The sandwich was tasty but still left me a little hungry after I was done.  I do like that you could get a side salad or something else with the meal but I think I'd go with three menu items next go around.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "Delicious, fresh, imaginative.  This is the only place around you can get high quality food quickly!  The soups are the best i have had. The service is always friendly.  \n\nAs for the people complaining about the price, where else will you find an organic lightening fast lunch for $10?  Lee's deli?\n\nTheir new breakfast sando is amazing.  Espresso is pretty good.", "author": "pete c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-10", "description": "Went here for breakfast this morning. Have been to Heyday a couple of times for lunch or breakfast. Most of my colleagues love it because it's healthy and clean and they prepare the food in front of you.\n\nMy egg sandwich was tasty but it was cold and $5 for half a sandwich. Pricey!", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-19", "description": "Kudos for having fresh, quality food. I definitely feel like this is definitely a great healthy option for lunch. I would have to say it's definitely pricey esp for a soup/sandwich combo at $10. If you add a pellegrino or soda, you're looking at $12-13+ for lunch.  \n\nThere's a big communal table for people to sit as well as several 2 person tables. But overall not too much seating (esp if you get there post the 12 o clock rush). \n\nGreat for grab and go. I recommend the turkey and roast beef sandiwches. I wasn't loving the soup option I had but then again I'm not much of a soup person. \n\nOverall good lunch spot in SOMA but I question the price you pay for it.", "author": "Phillip D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "Although a lot of people seem to complain about the prices, my 3-item combo for $14 was filling, healthy, and worthy of the price. I got a half sandwich, large helping of farro salad, and a cup of nettle soup. I'd easily pay $4 apiece for each of them, so $14 including tax is totally reasonable. \n\nIt's great to have such a healthy place with an always-changing menu so close to work.", "author": "David Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "Really liked this place.  Good people behind the counter, nice open layout, really tasty and simple food.  I had a great quinoa and carrot salad, a spicy copa sandwich with the right amount of grainy mustard, and the chocolate chips in my cookie were slightly melty.  Tremendous\n\nI'm allergic to onions and garlic, so was pleasantly surprised that there were a number of choices for me on the board.  I was told that the owner likes to have gluton-free options, too...make sure that there is something for most everyone on the regular menu. \n\nI'll be back.", "author": "Jake M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "A cute spot for a sustainable, healthy, light lunch especially if you're trying to eat mostly plants, and not too much.  The food here isn't terribly exciting, but it consistently tastes fresh and good for you.  Plus, it won't put you into a food coma.  \n\nPortion sizes are a little small, but eating 2 items is usually enough for me to be satisfied if I am not super hungry.  I always get half servings of salads for more variety (i.e. 4 salads in a 2-items container).  I always get the cabbage & chicken slaw as one of my items (partially because it is the only salad with meat in it, partially because it is delicious).  Also, the portion sizes of the salads seem more substantial than the sandwiches.\n\nOverall, it is a great place to get a lot of fresh veggies and leafy greens for lunch in the Financial District for $10.  I usually go later (around 1:30pm) because there isn't a line, and the portions are a little more generous at that time.  The only downside is that sometimes they run out of things by then, but they usually have the cabbage & chicken slaw still.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "Maybe I'm just used to paying \"a lot\" for my meals when I travel or maybe I'm just willing to pay a fair price for delicious, organic food because I don't think the prices are all that bad like many of the other reviewers.  \n\nI stopped in after stumbling upon Heyday after a morning run while I was staying in the FiDi area.  The sign on the window offering a unique fritatta with what sounded like yummy cheeses and veggies drew me in.  I was sad to find that the special I saw was for lunch and I was too early for that.  Instead I ordered 2 of the 3 breakfast options - Strauss Creamery Greek Yogurt with a bran muffin - the other main option was steel cut oatmeal and there were several other pastry options.  \n\nI feel like they offer breakfast as a convenience only since employees are already in the cafe preparing all of the fresh produce, breads, and meats for lunch.  I must say that for a convenience meal it was darn good!  I've never had a more creamy, soft tasting Greek yogurt.  I almost don't want to eat the stuff I'm used to anymore...I will seek out this brand and see if i can get it in Texas...yes, that good!  The house-made toppings included 2 types of granola, brown sugar and a few others that I don't remember.  I added brown sugar and granola.  The muffin, while a little dry around the edges, had a fluffy middle and a crusty top that was tasty.  \n\nOverall a tasty, healthy breakfast.  I will make it a point to go back for lunch during my trip.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "I would eat here every day. (If it were $2 cheaper).\n\nI love this new(ish) spot near my office. The kale salad is amazing. The farro and chickpea are also hard to beat. It's very refreshing to go out for lunch and feel like you're doing something good for your body. I highly recommend just getting 2 salads --  most everyone I know is full after that much. I just wish it were $8 instead of $10 for 2 items... but compared to all the lunch spots nearby, this one is a definite winner!", "author": "Gretchen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-15", "description": "This review is just for breakfast... which, frankly is totally lacking in selection... 2 items? Yogurt or oatmeal. At least offer 1 breakfast sandwich with eggs? And $5 for yogurt? Yes, I was the sucker and paid $5 for yogurt figuring that it must be delicious because it's organic and yada yada. I went in, and as most people do in the mornings, got my breakfast, and rushed out. Except, when I got to my office and opened up my cup of yogurt (which was in a soup cup so the whole time I couldn't see what was inside), it was just PLAIN yogurt. BUT their menu would have  you believe that it has toppings! \n\nHere's what the menu said: \"Strauss Creamery Yogurt (Greek or Traditional) with house made toppings\". \n\nWhere were my house made toppings??? \n\nIF they were choosing to serve it separately, why was I NOT given any instruction to get my toppings or given toppings in a separate container??? Thanks for the heads up on the lack of toppings in my $5 yogurt and for conveniently not advising your patrons of this and just letting them walk out with only a PARTIAL product that they paid for in FULL.\n\nI am sure the yogurt and the mysterious non existent toppings would have tasted great but I wouldn't be able to confirm that today.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "Fantastic! I just finished walking for the American Heart Association on National Waking Day and Heyday was a PERFECT finish. Got the Toasted Farro Salad with Asparagus and Meyer Lemon Dressing along with the Raw Kale Salad tossed in a Yogurt Avocado dressing. \n\nBoth dishes were fabulous and refreshing after the long walk and delectable Joia Natural Blackberry Pomegranate Ginger Soda to wash it down. \n\nI'll be back tomorrow!", "author": "Jennavive P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-30", "description": "The portion for the sandwich could improve.   Quality is fine but still the organic turkey sandwich was not that pleasing for me.  Pasta salad of the day was a bit dry.  $10 is a decent price but still disappointed in the products overall.", "author": "Ivan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "I thought this place was great! I think $10 for the amount and quality of food is pretty reasonable.\n\nThe sweet potatoes and kale salad were particularly good!", "author": "Coree W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "I'm not sure if this is healthy or not but man they drench everything with vinegar. Not really a fan but there's always a good line going on during lunch hours", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "They're very dependable whenever I need them to deliver a lunch order for our meetings. Always get there on or before the time I requested. My boss always like their food. They're very nice and accommodating for the vegan and gluten-free needs of some of our teammates.", "author": "Charizz B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "A definite must in your weekly lunch rotation if you work in the FiDi.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "Today was my first time at Heyday, the food is so delicious , if you love light salad dressings, taste good herbs and vegetables for what they are (even bitter greens), Acme bread, Guittard Chocolate, and just great healthy food this is the place for you. The price is a bit on the high end but who have to take into consideration how much it would cost you if you go and get the same items at a store, then it is not pricey. We tried two lunches with each three items and everything was wonderful. I will be back. They also do catering for meetings. :-)", "author": "Wally C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "I'm stoked to find heyday. Organic, healthy, salads. And no hipsters in line to beat in downtown San Francisco yipee! Just wish they can serve better coffee and start a rewards program for it is pricey at $10 for 2 items. Oh hell, can you complain when the staff do stuff as much as possible in those tiny salad boxes? :) hope you're around for a couple years Heyday.", "author": "Zee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "I get lunch here almost every day. They rotate their choices frequently, and I have never been disappointed.\n\nI really like that it's easy to mix & match salads/sandwiches/soups based on how hungry you are. The chickpea and kale salads are amazing staples.\n\nIf you have a carnivorous insatiable appetite and care little about how food tastes, heyday is not the place for you. There are countless options in the area for hearty meals, but it's nice that there is one place where the emphasis is purely on quality, not quantity.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "There are a lot of decent places to grab lunch near my office, especially places that focus on salads and sandwiches, but I feel that Heyday consistently rises above all the others in quality, simplicity and most importantly, taste. It's fresh and I feel good after I eat there because it's healthy. I've never been disappointed with anything I've tried and I've definitely tried a lot by now. I've been going to Heyday pretty regularly since they opened (basically before the line started going around the corner). \n\nIt is expensive, but it is located in SoMa after all and organic food is generally more expensive anyway. If you're looking to gain more for your buck, I'd suggest the chickpea salad or sweet potato salad with mixed greens. Both of those are actually pretty filling.", "author": "Gloria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "I am still loving Heyday. I now have tried a handful of their soups and they are delicious! I'm still a fan of the chic peas... :)", "author": "Julie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "Yes, finally a healthy lunch place. They have Chez Panisse Cafe alum at the helm, doing seasonal salads and sandwiches.\n\nI had their breakfast items and they were delicious and their fruit muffin is the best. \nOrdering lunch option is easy; you can choose a combo by mixing sandwiches and salads.\n\nThe place is spacious and inviting. Their customer service is OUTSTANDING. I definitely will ask them to cater our next corporate lunch and be back regularly for my lunch.", "author": "Jeannie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Good lord, this place is delicious. I was so stoked when they opened up within walking distance of my office...we needed something like this. Super savory. Super fresh. Super people. Yeah, I'm a lil bit addicted.", "author": "Jen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "Amazing fresh and healthy food with a constantly changing menu depending on what's in season. The FiDi needed a place like this and so happy to see them going strong after their first year.", "author": "Wyatt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "Food is consistent & delicious! Great pricing, hearty & healthy menu items, friendly staff & upbeat music. \n\nI work in the neighborhood and am surrounded by dozens of choices. Heyday is hands down the best.  So happy I stumbled upon this place!", "author": "Denniz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "Order online if you're in a hurry. At 11am, they're still getting lunch food out and filling takeout orders for nearby companies, but enough people are there to get service when ordering in person.\nThe restaurant, seating ~25 with plenty of SRO room, is filled with bluegrass music and cooking / cleaning  noises.\nI ordered three dense side salads for $14: the raw kale salad, toasted farro, and chickpeas & quinoa. Each was surprisingly flavorful and very good. \nHeyday will be a great option for to-go dinner orders as well.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-13", "description": "Tried this place again (against my own advice) and I'ill say it again: a total rip off. Somehow I find myself feeling abused when paying $10 for a bowl of boiled birdseed and a drink. Phooey.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "Third day of their opening week and it seemed like it was going strong.\nFirst, I went for a small breakfast of their Steelcut Oatmeal. Amazing, I really loved the mild flavor, and the texture (not too mushy, bit of the chew) The staff was really friendly and accomodating. The toppings for the oatmeal were fantastic! Apple and currants in syrup, homemade granola, cacao nibs, and organic brown sugar.\n\n \nI went to pick up a quick lunch at 1pm and the service was really quick! Order at the counter style with mix and match options, I really liked their options of salads and sandwiches. I got the soup of the day which was a Potato and Spring Garlic soup with Braised Greens, and a salad set of Farro with Asparagus and Pickled Beets. The Farro and beets were tasty, though I wish I had gotten more beets (they loaded me up with the Farro). The soup was good but it was on the oily side. I could see the globules on top of the soup and the feeling it left in my mouth wasn't really too great.\n\nFrom my coworkers that got the sandwiches, they didn't like them too much but enjoyed their salad options. I would go back again for a fresh lunch!", "author": "Maggie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "The quality and freshness of the food that Heyday serves is insanely good. I cannot find another lunch spot in the neighborhood that comes close in terms of healthy, clean options. EVERYTHING here is organic and straight from the farm and prepared with the skill of their former Chez Panisse chef (for real). If you're like me and eat a salad basically every day for lunch because it's the only healthy option you can find, you gotta try this place to eat something that'll satisfy you and be 100% nutritious.", "author": "Derek M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "I work right around the corner so it isn't a haul for me; however, I would travel far and wide for Heyday. Fresh, simple, healthy and good. It isn't cheap, but at $10, it's a standard meal price in SF for lunch. Not to mention, the quality is 10X better than what you find at the grease box - your standard lunch choice. My favorites: Chickpea salad, and roasted cauliflower sandwich. My tastebuds are stoked every time I treat them to Heyday.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-09", "description": "Love this place.\n\nI went twice in one day today.  Breakfast of strong coffee and yummy, YUMMY oatmeal.  I love the granola and other toppings.  Good breakfast.\n\nTHEN I went back for lunch.  Roasted pork sandwich and kale salad.  LOVE it!  \n\nTasty, fresh, healthy, delicious.  So much better than other local options.  \n\nTerrific and much needed addition to the neighborhood.", "author": "Christie d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-17", "description": "When this place first opened up I was REALLY excited.  The store front looked really nice and are enviromentally friendly and use organic when they can.  $10 for 2 items???  Really???  Hey don't get me wrong, I'm not trying to bash this place but the food here really lacked flavor.  I got a cabbage chicken salad and a turkey sandwich which both, I needed to add salt to!!!  The other people who gave this place 2 stars are dead on.  \n\nI did go in this morning to get a ham and cheese croissant because their pastries are good I have to say.  End result for the ham and cheese....Meh.....It also cost me $4 for a very small portion!!!  \n\nI would go next door to Lee's Deli and fill up on a bunch of different things or go to Specialities a few doors down.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "Awesome!  Great to see a new healthy and tasty addition to the FiDi lunch scene.  Loved the quinoa/carrot and kale salads.  The sandwiches are great.  Portions are smaller but I like that you can calibrate to how hungry you are.  Well worth the extra $ to get something you know is  local, organic and super tasty.  I will definitely be back!", "author": "Craig V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-01", "description": "So says the place is open from 7am to 3pm, but i get there at 10:40 for lunch because i have meeting for the rest of the day and the guy behind the counter says yuo have to wait 15 mn for a roast beef sandwich, and i say, there are 15 of you behind the counter you cannot prioritize my sandwich, he says NO. How does this place expect to survive long term if already its is rated 3.5 on yelp", "author": "G S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "Just stumbled upon Heyday and decided to give it a try for lunch. I tried the two salad combo for $10 - romaine with cucumbers, mint and pumkin seeds, and roast chicken, farro, beets and radishes. Both were really yummy! This place is definitely going on my rotation!", "author": "Gina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Good salads at a slightly high price. They really pack the salads in, though, so you get enough for lunch and likely dinner, too! Healthy and tasty.", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "What a great deviation from typical lunch scene.  Simple Food done fresh, healthy and tasty.  While a plate with three antres and a drink pushing  $15 is a bit expensive but it is way better than a burger and fries.  I will go back.", "author": "Thad L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "Had lunch here while in town. The small menu was troubling, but I ended up deciding on a sandwich and salad, which I actually ended up enjoying. As far as portions, you probably do need two or three depending on your appetite, but I felt that two was just right for the price.", "author": "Candace R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "Great to have a fresh, healthy spot for lunch in this part of the city.  It's not for everyone (no deep frier, no junk food), but if you appreciate quality ingredients and food that won't put you into a coma when you get back to your office, this is a great option. I like that you can see into the kitchen area - this place makes \"real food\"...Michael Pollan and Mark Bittman would definitely approve.  \n\nThe Kuoignamon (spelling?) breakfast pastry from Starter Bakery is pure heaven. \n\n4 stars because they don't include soups in the combo and I might like to have another hot option on a cold, rainy day. Definitely making this part of my lunch rotation.", "author": "W J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "I had resolved not to review Heyday again until I had something good to say.  They have a new Lentil Chicken Salad that is off the hook!  PLEASE never stop making this.  Together with the chickpea and kale salads, I am now happy whenever I go here.  Just wish they would make the dilled potato salad more often - that is so good as well.\n\nHeyday is now one of my go-to places and I won't even complain about the prices.  Good job, Heyday!", "author": "Bridget M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "At first, I thought this place was way overpriced and that the food wasn't filling enough. Then I got obsessed with its faro/roasted eggplant/ roasted zucchini salad. Now I cannot stay away. It's easy to have a vegan-ish lunch here, too, if you are into that. Also, I pay at least that if not more at Mixt Greens and I have swallowed that pill... so I'll swallow this one too. Luckily, the pill tastes good and is organic.", "author": "Sahra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Came in and gave Heyday a whirl from having it suggested to me. Glad I did. A post Heyday had made one Friday was advertising a farro salad as their special for the day. Farro anything I will try, I went a little before 11ish and it still wasn't ready so I told the gal behind the counter it was totally fine, I'll take a seat & wait it out. I chose the 2 item option for $10. Along with the farro salad I decided on the cavatappi pasta. As soon as the farro was finished I was on my way. I thought I'd be able to hold out til lunch time to take a bite to taste but that didn't last long. I first took a spoon of farro salad which has roasted brussel sprouts pumpkin seeds & mushrooms in it. Oh goodness, why didn't I just get ALL farro! The mix of ingredients completely joined in together to highlight and round out this salad. Beyond delicious in my book. After much resisitance & trying to redirect my spoon towards the other half of the container I finally scooped up some of the cavatappi pasta. This is why I went for a 2 option package. The pasta was cooked to perfection and gently mixed with fresh mint pesto & roasted cauliflower. Two amazing healthy choices I will definitely go back for.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "Pretty pricey for what you get.  Almost 6 bucks for half a sandwich is pretty steep even if it's organic.  I tried both the egg salad and the arugula chicken.  The chicken was better with a tasty aioli sauce even though it was a bit dry.  The egg salad was bland and stale in comparison.   Both sandwich halves weren't quite as stuffed as I would like.  The salad offerings looked good but I'd rather hit Super Duper with what's left of my lunch money.  With the trend of new healthy lunch spots opening up, it's becoming harder to find a decent meal for your slimming wallet.", "author": "MTBer I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-09", "description": "I want to love this place, but as a person who buys and cooks organic at home, I have to say it's VERY overpriced.\n\nFood was good, not mind blowing.  Between 4 of us we tried everything on the menu.  Farro salad was the standout.  \n\nI overheard the woman ahead of me in line discussing the prices with the man behind the register.  He cited organic product as the cost driver... I couldn't help noticing the 8 employees behind the counter, wondering how that contributed.\n\nWon't go back.", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Great food.  All organic choices.  One of the only places you can find all organic.  I wisg their food was a little more normal though.  Sometimes you feel like organic speggetti, pizza, or asian cuisine.  Do believe they should increase their organic options to more 'standard' foods.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "I actually love this place; the food is so fresh and delicious.  5 stars for the food, but I'm giving a 4 star review because they keep raising their prices.  But, yah the food is really great.", "author": "Kathryn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Met a friend for lunch who worked nearby at Charles Schwab. Came here just a little before noon to beat the long line. I got the mozzarella and mushroom sandwich and their special daily salad - beet, cauliflower and cabbage. Flavors were very good and fresh. Also had a mint hibiscus house tea. That was pretty good too, but half of it was ice, so felt like I didn't get a lot of value. Pricing is probably higher, but the food is fresh , expect to pay more for good fresh food. I'd come back to try the other salads, the kale salad looked great. Great vegetarian selection.", "author": "Christine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "This place is yummy! Disclaimer - you really have to like healthy food to dig this place. You're going to fill up on kale and chickpeas, so if that's not your jam, hit up The Melt half a block away.", "author": "Katherine D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "The food was delicious but the portions are tiny.  For $6, you can get half a sandwich or a small container of salad. For $4 more, you can add another half a sandwich or small salad. I want to like this place more but the tiny portions are just not doing it for me.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Ate Heyday as delivered to my office through TryCaviar.\n\nI ordered the Chickpea Salad and the Faro and Roasted Chicken Salad.\n\nChickpea salad-- 5 stars. Good combination of spices.\nFaro salad-- 3 stars. Too bland, a little dry.\n\nPortions seemed small at first, but Heyday had, in fact, packed a ton in each container. Two $6 salads was more than enough for 1 meal.", "author": "Haley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "LOVED IT. Service was great and the line moved quickly during the lunch rush and the food was DELICIOUS.\n\nI had two flavorful, healthy salads--my favorite was the beet salad, but also really enjoyed the quinoa chickpea and carrot salad. \n\nI stole bites of my husband's potato leek soup and it was outstanding--light, savory, delicious. Plus I had a bite of his spicy coppa sandwich (on acme bread!) and I loved that too. And the chocolate chip walnut cookie didn't disappoint--it was great. \n\nWe really enjoyed our lunch there. The playlist was a good and the atmosphere was really nice. The wall papered with antique almanacs is a great touch!\n\nAlready looking forward to when they start serving dinner. We will be regulars at Heyday!!", "author": "Mimi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "Just swung by the preview and I can already say I will be at Heyday every week. This is exactly what this area needs. Fresh, seasonal food that is crazy tasty. The space is roomy, well designed and a very inviting place to take a quick lunch break. I am very excited to finally have a place like this to add to my lunch routine.", "author": "Blake R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "antastic place for a quick lunch in the financial district. Healthy, creative dishes. Fast and friendly service. I get in long line at noon that is snaking down the street but have my food in hand 15 minutes later max. Gotta love that. Very vegetarian friendly, too.", "author": "James S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-15", "description": "I love that heyday is environmentally friendly (everything is compostable). I love that it is right next to my work building. My hopes were high when my colleagues said they loved it.\n\nWhile I enjoyed the homemade leek soup, my sandwich was underwhelming. Maybe because I don't like my bread to be so hard that it knocks my teeth out and breaks my jaw. \n\nBeyond that, the staff is nice. I'll probably come back because it just adds variety to my lunch rotation, but nothing to scream over. It isn't the cheapest option on the block either so be prepared to spend more than $10.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "This restaurant is healthy, fast, and delicious!  Great price for the quality of food you get. Service staff is courteous and friendly.", "author": "Marlon F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "Updated Post 7/1/14\nHeyday, THANK YOU for getting way more awesome since you first opened!  Even though in my original post I said I was giving up on you, I didn't.  The flavors are too irresistible.  And now, today, I had the best experience yet!  I love that you allow me to order 3 items to put in the 2 item container (because I still think spending more than $10 is ridiculous)- this way I can satisfy my indecisive mind and get enough food.  I love that your employees are much more generous with their spoonfuls of salad that they fill up the container with (he had to force the lid closed and I'm thankful that I wasn't paying for all of that air between pieces of kale.)  I love that everyone who works there is so darn nice! :)\n\nSo, while I haven't tried the sandwiches again (though they look much bigger- yay!) I am a believer, a fan, and I'll be back!  Today I had the chickpeas, kale salad, and cucumbers+romaine and it was ALL simply delicious!  \n\nAnd by the way- your oatmeal is amazing!  my whole office raves about it! \n\n\nOriginal Post Fall 2013:\nAfter reading the Thrillist article on this new spot I was excited to try it.  Given that I had looked up the menu before visiting,  I was prepared to spend $10 on a 2-item lunch.  I had assumed, however, that the 2 items would be enough food to make me feel full.  While my turkey-mustard-leek sandwich and cabbage-chicken salad were delicious, the portions left my stomach growing.   The salad was in a smaller \"side\" container which did not surprise me (probably weighed about  a quarter of a pound), but the sandwich was approximately 2 inches x 1.5 inches- it was, literally, 3 bites.  Had I just ordered the sandwich, this tiny morsel would have cost $6.  \n\nOf course I could have ordered a 3-item lunch for $14, but that is out of my budget for lunch. \n\nThe flavors were nice, but not so complex that $10 would be warranted.  For $10, I expected more.  I hope the guys at HeyDay either make their portions bigger or reduce their prices.  Unless they do, I cannot warrant such an expense for lunch. Their fast service and pretty space will not be enough to bring me back.", "author": "noelle s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "Great place for a quick lunch - they have sandwiches with ACME bread (love!) with a great assortment of salads/veggies. Prices are very reasonable - most people get two items for $10. Portions were good and healthy too!", "author": "Samantha O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "i love the kale salad and the farro asparagus salad...both are super flavorful and fresh! My only complaint is the price, $10 is alot for two small sides of salad.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "I find the food here to be quite tasty. The food is fresh and healthy, and the flavors are well developed. I usually go for the two item combo which is about the right amount of food for me for lunch. However, given the portion size, I think they are quite overpriced. I only go to them in a pinch because of their easy online order system and pickup. My favorites are the squash sandwich and the chickpea salad.", "author": "Whitney G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "Work right around the corner from here and our bldg was invited for there opening preview so we got to receive a free lunch and I must say the sandwiches were delicious and the pickeled beets were great the only thing I did not like was the soup that particular day but otherwise I can see this place being here for awhile. good luck to them for taking on this adventure.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-01", "description": "oatmeal. Ginger scone. You won't find better! I would give another star if the coffee was great, to me, it isn't even close to great. But the oatmeal is so good, if you're an oatmeal fan you really should try it.", "author": "James P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "I tried this place for lunch today and found the food to be fresh and quite nice. I had the farro salad with chicken and enjoyed it. My colleague had the soup and liked it a lot (although she found herself wishing for more salt). The portions are somewhat small for the price and the flavors are subtle but it is a solid place for a healthy lunch.", "author": "Shani A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "Finally a healthy AND delicious lunch place in downtown SF! \nI went there for their opening party this weekend where all items on the menu had been prepared and I sampled each one. Their roasted onion sandwich on focaccia was to die for (I had 3), and so was the raw kale salad with avocado dressing and the chickpea and quinoa salad. You can immediately tell that what they are doing is miles away from your run-of-the-mill \"deli\" (of which there are 3 within a block), the ingredients they use are all top notch (locally sourced organic produce, ACME bread, in-house slow roasted turkey meat, etc) and every item on the menu is not only beautifully crafted but flavorful and complex. They make their own mayo and do their own pickling or veggies (I wish you could buy jars of their pickled onions and carrots).\nOrdering options are straightforward yet creative (you can choose a combo with 1, 2 or 3 items, mixing and matching sandwiches and salads).\nThe space is sleek and unpretentious and the staff is super friendly and proud of what they are doing.", "author": "Andreas B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-17", "description": "I was really excited to try this place, but was really disappointed. The ambiance is clean cut, minimalistic, and fresh. The spicy coppa sandwich was small and just average. My friend ordered the quinoa salad and said it was gross and didn't finish it. I probably won't come here again unless they add some new items to the menu.", "author": "Cathy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-29", "description": "The food was fine but none of the 12 people (no exaggeration) came out in the 40 minutes I was there to clean up the dirty tables, which turned into 6 by the time I left.  I sat at a dirty table because that was all that was left.  I don't think I'll go back.", "author": "J. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Unquestionably the best lunch in downtown San Francisco, with prepared food that can go head-to-head with Bi-Rite Market. No joke! The design of the space is awesome, the food is delicious, and the people are great. Try the sweet potatoes, farro salad, and roast beef sandwich (yes, its happy meat). Delicious. Bravo, Heyday.", "author": "Lenny N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "Ordered the 2-item combo with the Chickpeas & Quinoa Salad and Cabbage & Chicken Slaw. $10 is pretty standard for lunch in the FiDi, esp for a healthy spot like this (comparing it to The Plant...which is 5 blocks away). This is a block from my office which is super convenient, and the ever-changing menu keeps it fresh. The flavors were awesome in both salads. My only gripe with the Cabbage and Chicken Slaw was the three tiny shreds of chicken I got -_- Overall pretty legit. I'll try more from them when I don't pack lunch.", "author": "Lauren Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "excellent organic healthy food downtown.  Got the turkey sandwich and the potato leek soup (not creamy).  Both excellent.  I'll be back.", "author": "Heinz G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "Anywhere i can reliably/quickly get a tasty kale salad and well-cooked grains is a-okay in my book.  Super bonus for the organic + health & a good selection of vegan/veggie options.  Hoping they're planning to rotate some new salads in as the season changes.", "author": "Sierra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "This place is really cute on the inside.  The food is a bit pricey though.  It's healthy and fresh but everything is cold....and for that it shouldn't be so expensive.  Their options are also limited.  I've tried this place one time and it was ok....I'm not sure if I can confidently say that I'd return.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Love, love, love this place. Hearty, wholesome, delicious. They have the Midas touch with kale, soups are invariably delish and the baked goods are to die for. I hear they may be expanding? I hope so!!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "Great healthy lunch option.  A bit pricey, but so are the other nearby options - this is downtown SF after all.  Line can be long, but moves quickly.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "I'll be honest, I love the fact that this place is right across the street from my office but even if it wasn't its a great quick-grab lunch spot.  The food is tasty, healthy and reasonably priced and the staff works quickly and is always friendly.  I would give them a 5th star but I would like to see a little more variety in the soups and salads (again with the lentils & kale??? :-)  Recommended!", "author": "Steve G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-22", "description": "Giving this 2 stars instead of 3 in hopes of changing it for the better!\n\nLikes: \n- eco-friendly\n- cute decor\n- well-sourced ingredients\n- decent food\n- near my office\n\nDislikes:\n- I'm already tired of the non-changing menu.\n- TINY PORTIONS for too much money.\n\nSeriously...I'm usually the last person to complain about portion size or paying more for better quality food, however, when I spend $10 or more I do expect to be sated. And this ain't doin' it. \n\nThey should take a look at Il Cane Rosso, which is WAY better in my opinion. You get just enough more for your money, the menu changes all the time and the food is amazing. The food at Heyday is just okay; I feel like the original recipes were probably right-on but the daily execution suffers slightly. The sandwiches are good but not mind-blowing...the kale salad is good, but slightly too tangy (for me). Most dishes I've tried just need slight adjustments or a little more oomph. Nothing strikes as something I couldn't easily make at home.\n\nPortion wise, just make them slightly bigger! Everybody I know who has eaten here has commented - negatively - about the size, and many of my male colleagues won't be going back.", "author": "Jasmine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "Great, healthy salads and coffees. THE BEST chocolate chip walnut cookies I ever ate (and I am a connoisseur). Nice customer service too - they do the right thing when needed - impressive.", "author": "Good C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-08", "description": "Hey-I'm-Still-Hungry.  The food is good and goumet, but you need to order the 3 item lunch option for any sort of reasonable caloric intake and that is $14.  Hence the 3 stars.  It's bordering on ridiculous.  The sandwich had less than an ounce of meat on it, too.  I work half a block away, so I was hoping this would be a viable lunch option. It's really not.  They either need to increase the portion sizes or adjust the pricing.  I'm hoping they tweak their approach a bit.  This one has potential.", "author": "Gary R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "Well, hmmm.  They seemed to put more chicken in the chicken salad for a couple weeks, but the last two times I tried it there was hardly any.  I really like the *idea* of Heyday; just not thrilled with the execution.  Will have to go elsewhere.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-15", "description": "Totally overpriced, bland, unambitious food in a cheap setting.  My turkey sandwich was the definition of meh.  The kale salad was fresh, but boring and too bitter from all of the lemon juice.  I won't be going back.  There are way too many good sandwiches to enjoy in this area to settle for this stuff.  I can't believe I paid this much for a blad, PRE-MADE sandwich.", "author": "Otto D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-21", "description": "I have to say I have been here a few times and love the concept and have somewhat enjoyed my meals. Today I stopped in to grab an oatmeal and was disgusted by what I saw happening behind the counter. A man who was cutting veggies for something was texting on his cell phone, then continued to cut veggies ( Do you know how many germs are on the average cell phone?!?!?!)! Then proceded to touch the cabinets and the milk container that others use for coffee- ALL WITH OUT WASHING HIS HANDS!!!! I would love to have this be a nice healthy change from the run of the mill lunch spot but am afraid I was turned off today for good. HEYDAY EMPLOYEES PLEASE WASH YOUR HANDS!!!!!!!!!!!!!!!!!!!!!!", "author": "Marie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "Fresh and delicious - a welcome addition to the lunch options in the neighborhood!  They have increased the portion sizes since opening as a result of feedback.  All around great place!", "author": "Sean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "The chicken dinner is excellent. The chicken is roasted unlike supermarket rotisserie chicken. It is quite tasty and moist and is served with a large portion of tasty farro and some roasted carrots. A whole chicken fed 2 for dinner with enough left over for 2 lunches.  It's restaurant quality at about half the price but twice the price of say a supermarket meal. I would prefer more vegtables or a salad but as it is, I'll be back.", "author": "Rick G."}
