{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "GREAT bagels (chewy, dense inside, thin crackly crust, hard to find on this coast)\n\nGREAT owners, fast service. My go-to bagel place on the east side.\n\nI love they have a great selection of whole-wheat bagels too.\n\n(I wish they had a larger selection of full-fat spreads but it's a small complaint.)", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "The best bagels I've found in SF - and amongst the best bialys I've had ever (including NYC). An idyllic Saturday for me is walking to the Farmer's Market, going HAM on seasonal produce, and then getting a couple of everything bagels toasted with garlic & herb cream cheese to eat while I sit outside & non-creepily admire how cute the kids in Noe Valley are. \n\nI am also lol at everyone complaining about the whitefish salad and how the coffee isn't artisan. Take a look around. This is not a boughie spot, this IS a spot that nails the bagel basics. There are no Jewish grandmas hand smoking the trout, there ARE hard-working and lovely Chinese bagel mongers that probably get the chip bags at the SOMA Costco because why not? The bagels are bomb, everything else is inconsequential.", "author": "Steph U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Probably the best bagel in SF... I know that's not much compared to NYC... but it is a pretty good bagel... closes early and the coffee is standard filter... maybe they could be toasted a little more? They have a machine and it seems to just be one setting... but the filling is good, I had the lox bagel toasted and was very tasty...", "author": "Reg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Bagels on bagels on bagels...oh my! People who know me know how obsessed I am with bagels. But who wouldn't be? There's cream cheese bagels, lox bagels, eggs in bagels..I mean there's endless possibilities to put in two pieces of toasty moist bread. It's easy to fall in love. \n\nLocated right across from the Saturday morning farmers market is this hidden joint, holey bagels! I can't give this place enough credit. There bagels are superb.  They taste so chewy and moist and the cream cheese is perfectly proportioned to the lox. \n\nI ordered a poppy bagel with cream cheese and lox and it was delicious! The service was fast and if I lived in the city this would be my go to bagel place!", "author": "Lori R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "This place has the best way bialy.  Other places have dough balls masquerading as bialys but this is the real thing.  I baked bagels in Detroi for over 4 years so I know the real thing. Even kosar's in New York would be proud of these bialys.  \nI don't write many reviews because I write what I am expert at. And this is one long pursuit kit a decent Bay Area bialy that is now over I found it here!  Come early they don't make many.", "author": "Jonathan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-08", "description": "Bagels are...fine here. Nothing spectacular and the price point is notched a bit higher than you'd expect, even for Noe Valley. Whitefish salad here is wayyy too smooth, so less fish and more blank filling.\n\nBagel orders come with a bag of chips, though it's clearly the Costco variety pack, so unless you're into Doritos, you might be out of luck.\n\nSmall seating area and they do sell shmears and lox in picnic-friendly containers.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-01", "description": "Could not have put less whitefish salad on the bagel if they tried.  Also, poorly toasted.", "author": "Sitaram D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "Fresh bagels with large variety of choices- from plain, chocolate to everything. You can also customize it by adding cream cheese, eggs, cheese, salmon... etc. A bit over priced for what else is available in the area (there are other coffee shops and breakfast places).\n\nStore is a bit beat up, not a great place for meetings or hang out. Just grab your bagel, in and out!", "author": "Pauline H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "This past July I was living in Noe Valley for about a month for work. Pretty much every weekday morning I was there I'd stop in Holey Bagel before driving down to Silicon Valley. The bagels are always freshly baked and soft, and coming from NYC, it was great to get a little taste of home. These definitely stood up to my NYC standard and I'd recommend giving them a try if you're in the area. They open early and the service is extremely quick in the mornings-- something much appreciated when you're trying to beat the traffic. \n\nFor reference-- bagels tried: blueberry, everything, jalapeño cheddar, and chocolate chip. All were just with cream cheese, never as any of the breakfast/egg sandwiches, so take note that this review is solely based on the quality of the bagel itself & not any Holey Bagel creation that's offered. That being said, all the bagels were great!", "author": "Katey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "Nice local bagel stop. I had the Lox Bagel and really enjoyed it. The salmon was fresh and tasty. All around a nice breakfast/lunch stop but just make sure you are clear with the staff if you want your bagel a specific way.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "I mean, ya know, it's a bagel. It didn't blow my mind but it was pretty delicious, which is all I can ask for, right?", "author": "Justine J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-22", "description": "Meh, the bagels are kinda dry and the fillings are uninspiring. On the plus side they have a wide selection of bagels so there's always new things to try, and you get a free bag of chips with your bagel - although it's not written anywhere, and they rarely seem to tell you that, which is odd!\n\nAnyway, it's an ok place to grab something to eat if you need to fill up but it's definitely not one of my top picks in Noe.", "author": "George B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-25", "description": "They cook their eggs in a plastic bowl and a microwave.  Enough said.", "author": "Rolo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "I had an everything bagel with light cream cheese .. delicious! Fast service delivered with a smile, satisfied customer here, will be back!", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Best bagels I've found in San Francisco and on the west coast. Coworkers from the east coast and I agree. Holey Bagel is where it is at. \n\nLOX are super soft.  I always try to bring in a dozen and two low fat cream cheeses once a month for my team at the office. \n\nHoley cures the east coast blues. The staff is super fast as well when filling an order, quick in and out process.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-25", "description": "I've typically enjoyed eating here but today was treated extremely rudely by the staff and I will not be returning. \n\nThe staff accidentally made an extra bagel for my order and instead of simply taking it off the bill, actually tried to force me to accept and pay for an item that I did not want. In the end, they took the extra bagel off the bill - but the resulting experience was so unpleasant that I have no desire to return.\n\nI have never experienced this type of poor service and will be getting my bagels elsewhere from now on. The owner was confrontational and rude to me in front of other customers waiting in line.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-21", "description": "They get the NY-style bagel right, but everything else falls by the wayside.\n\nThe interior is a little run down and cramped. I get it...they're no frills in the Noe and that's perfectly OK with me. In fact, I walked in there because I wasn't in the mood for an overpriced \"organic grassfed\" type of breakfast. Not only did they have trouble with our order it was still almost as pricey as the low fat organic yogurt with rolled blahblah farm's oats and a double cappuccino. \n\nWe ordered skinnys. I don't think that terminology is limited to new york but they had no idea what I was talking about ... a bagel, with some of the insides scooped out. All the bagel deliciousness but minus some of the carbs. Got a bagel with eggs and cheese and a bagel with lox and cream cheese. Had to re-explain the order 3 times. Yikes. I also watched them microwave eggs when I was told they had a \"place\" to make eggs. Did they just not walk over to the griddle in the back? No idea. \n\nBagel itself was good, eggs kinda gooey while the other bagel was nothing to write home about.", "author": "Steph M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-25", "description": "Cheerful and quick service providing decent but ultimately mediocre bagels -- a nice hint of a crust on the outside, but just a hint, and an overly pillowy interior.  A decent breakfast in a pinch, but as the others say it's competitive only in the \"SF bagel\" category.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Super Bowl 50 bagel lovers must go here.\nIf you are Jewish or just a real bagel lover and want the BOLIED AND BAKED bagel go here buy 7 for the week, add a cream cheese, lox etc.\nBut buy 7 for the week.\n(Side note I've been going to HOLEY BAGEL for 32 yrs since I was 12).\nIt's in the Now Valley of SF. (94114)\nThe bonus is the trendy shops, family atmosphere and it's only one (1) 20 minute street car ride from SF Downtown. ENJOY THE BAGEL AS YOU WALK UP AND DOWN THE 4 BLOCKS BETWEEN CHURCH AND CASTRO on 24th street.\nThe shopping is awesome.\nIt's a quiet get away from downtown.\nYou might see Zuckerberg. He only live 5 blocks away.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Stumbled upon this gem this morning and bought a bagel with bacon, egg, cheese that was excellent.  Staff were extremely quick and kind.  Definitely returning.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-08", "description": "The sesame bagel (toasted) with cream cheese was not tasty in the slightest. \n\nRegardless, great service and really nice people working here.", "author": "Marc B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "The bagels here are very good. I got the bacon, egg and cheese on an everything bagel. I think their portions are good. I'm used to getting more egg, but it didn't make a difference to me it was still so tasty! The bagel tasted fresh and the bacon was nice and crispy. Don't know why this place doesn't have more stars! \n\nThe only complaint I'd have is that it's a little pricey, but I think it's worth it!", "author": "Sallie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "By no means is this an authentic NYC/NJ bagelry. Why? Because it's not in NYC/NJ DUH!\n\nIt's absolutely delish for a SF bagel. Exceeds expectations compared to other bagels because those places advertise themselves as NYC style bagels. Puh-lease. No such thing! \n\nBe warned. There is no tv or wifi...so you will be forced to interact with real people. If that's not your thing, this isn't the place for you. Also, there's so much room that you don't need to stand outside just to get a bagel. I can't believe there are chairs to sit down!\n\nAll sarcasm aside, I waited a couple minutes for an everything bagel since they were still in the oven...when I finally got it, it was fresh and hot! They don't use pretzel salt (woot) and even offer a whole wheat variety of the everything.\n\nI always make it a point to come here when I'm in town because it's one of the best bagels OUTSIDE of bagel town, NYC.", "author": "Sujin Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "Holey Bagel? Holey crap, I just got ripped off. There was nothing particularly special about this place. We ordered the lox bagel and significantly overpaid in my opinion. I can get a tastier bagel elsewhere and for cheaper. Besides this, I did not receive the friendliest of service, and there is a $5 minimum for cards.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Holey Bagels bake real boiled bagels that are equal to most good bagels on the east coast and LA. No pretense. Just a wide variety of very fresh, often hot bagels with a good crust and dense tasty interior.  Reasonably priced and even discounted after 2:30", "author": "Richard D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-24", "description": "I bought 9 bagels and 3 containers of cream cheese for 30 bucks, when I asked if they could be sliced he said it would be another dollar. That's pretty crappy customer service. Bagels are ok, not great.", "author": "Lane W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-20", "description": "Holey Bagel still makes a pretty decent bagel. The shop was a little better under the original ownership (when they had really nice bialys), but it's still not bad. I like 'em better than Katz and I like 'em much better than House of Bagels, especially when it's before 7 AM and their bagels are warm and soft on the inside, crunchy/crusty on the outside (kinda like me, I guess). They are definitely worth paying $1 for when they come out of the oven like that, you cheapskates! With a little cream cheese, it's a meal for a couple of bucks. Come on!\n\nI particularly appreciate that they produce actual bagels here, like onion, sesame, poppy, plain, and salt. For those of you who don't know what an actual bagel is, they also sell some dreck varieties like Asiago roll, Whole Wheat roll, Cinnamon Raisin roll, and Blueberry roll. Those creations are not bagels, just flavored rolls with a hole in the middle, but I guess they gotta carry 'em in this market. \n\nAnd no, they do not have lox, it's nova, which is less salted and not as good. Thus 4 stars instead of 5. \n\nTotal east coast bagel snob here, but I actually like Holey Bagel's bagels when they're warm better than Ess-A-Bagel and H & H. I've probably lived in California too long.", "author": "David G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "Paid over $9 for a pastrami sandwich with cream cheese. The pastrami was good but the sandwitch was small and the price is exorbitant. My recommendation is for $10 load it with vege.", "author": "Will D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "I love this place.  I LOOOOOVE the whole wheat everything bagel, which I just discovered.  Yum yum yum and very tasty cream cheese.  Also, if there's only one employee they take excellent care not to touch money with their gloved hand.  Love it!", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "My favorite bagel place in all of SF.  \n\nQuality bagles\nUnique types -- they have a whole wheat everything\nDelicious egg tasty (their name for a breakfast bagel) -- salty, cheesy, filiing, amazing\nFriendly staff\nQuick service", "author": "Bennett H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-23", "description": "I am giving them only one star because:\n\n1. They charge a dollar per bagel, which is on the high end.\n2. If you ask them to slice the bagel in half, they charge you ten cents. That is disgusting. \n\nThe bagels taste good, but to charge that much and then nickel and dime you for slicing them in half? Pathetic.", "author": "Green Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-26", "description": "Your bagels are disgusting.  I got to breakfast bagels this morning neither of them were toasted efficiently.  You didn't cut them, and they were very doughy, AF.  Never again", "author": "Kimo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-24", "description": "Hands down my favorite bagel place in the city. We love their everything bagels. Yummmmm.", "author": "Laura Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "I come to Holey Bagel for freshly made bagels and cream cheese to go. \n\nMmm, I like a variety so I go with the Jalapeno Cheddar, Everything, Garlic and Plain. I love the cream cheeses, they are so creamy and whipped and I love then nice and cold and added to a toasty hot bagel. \n\nNext time I'm going to pick up some of their lox cream spread, sounds really good and sometimes I just crave smoked salmon.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "i only have positive words of feedback for this place. i had the lox bagel on a sun dried tomatoe bagel and it was just fine. plenty of lox, tasty cream cheese, fine tomatoes and capers. we had our bagels out in the sun, thats maybe the only thing, i could mention, the place indeed is not so inviting to stay. but the staff was very obliging, fast and friendly. best bagels - go there and try!", "author": "diemo b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "Pretty good bagels. If you go after 2:30 and before they close at 3 pm, the bagels are on sale.", "author": "Tracy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "Yuck. Yuckiest bagel I've ever had. Tasted a little stale and definitely not worth the carbs.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-29", "description": "Just OK.  Jalapeno bagel was crumbly, tomatoes watery and blah, and the cream cheese had too smooth of a consistency.  I chose the bagel store over the coffee shop bagel, but the coffee shop does it better.\n\nService was efficient and friendly.", "author": "Bad Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "Yikes at all the Yelp snark... Holey Bagel is great, IMO. Not too many things better than a weekend morning stop at HB -- it's no-nonsense/quick (none of the fuss of brunch) and I've never had anything here that wasn't delicious. Their bagel selection is quite varied. I usually get the cheddar jalapeno or wheat (toasted. always) with  their low fat veggie spread which is whipped and airy and has bits of carrot and green that look like confetti. BF loves the lox sandwich.\n\nThey have a stocked beverage fridge with juices and drinks as well as spreads and toppings to go if you're into Bagel DIY. There's also a little seating area with a couple of tables where you can get your bagel-y carb binge on. No frills but totally sufficient for me.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Man, do I wish holey bagel were closer to where I live because I would be a regular. The few times I've had the pleasure of eating bagels were the best in San Francisco. Homemade cream cheese is delicious and the actual bagels are the perfect texture. So good. Service is good too. Please open one in the sunset!", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Okay. These bagels are the real thing. They are the ONLY bagels sold in SF, all others are squishy bread, probably not even boiled. Miller's imports half baked from NY, but they don't survive the process entirely. IDK what other people are talking about with their poor reviews. For me it's about grabbing some to take home, but they also sell good lox and whitefish salad. You are right, if you are making a damn sandwich out of em, you might as well buy the crap soft homogenous SF \"bagels\" you can find anywhere else.", "author": "Bryan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-07", "description": "Best bagels ever.  Period.  I don't care what any of you say.  The End.\n\nPostScript:     They taste especially delicious on Christmas morning...the only place open on all of 24th!", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-08", "description": "-Classic bagels\n-Discounted bagels in the afternoon\n-No nonsense\n-Cold drinks\n-Lox!\nThat's all!  It's a keeper!", "author": "Julia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "Of the several bagel options in Noe Valley, Holey Bagel has the best tasting, best textured bagels on 24th Street. They're still not nearly as good as NY bagels and San Francisco bagels in general are a sad comparison, but when I have a hankering, Holey Bagel is typically where I think of first. It's also great when I can catch the 2:30-3:00 period where you can get a dozen for half off, then I slice and freeze the remaining for later.", "author": "Victoria J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-04", "description": "Toasted Everything Bagel with Cream Cheese please.\n\nAfter grabbing our usual cup of joe next door, we wandered in for the everything bagel.\n\nThis store is bare bones, simple, and efficient.  No frills, fluffy lace setups or expensive interior decor that would up the price of a bagel.  The schmears are inventive and good.  I ordered plain cream cheese, but would definitely be happy to try out the honey walnut or strawberry next.\n\nThe coffee here is cheap, but don't except a barista.  It is definitely as simple as stated in several of the reviews, but why compete with the neighborhood when you have coffee right next door?\n\nIt's all about unity  ;)  Like the jelly on top of the cream cheese on top of my everything bagel.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Holey Bagel had exactly what I was looking for in a breakfast sandwich. I had the sausage, egg, and cheese, and it tasted fresh. It's a good option for a quick breakfast.", "author": "Austin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "Ok maybe I'm a little bias to the bagel shop because I grew up in the neighborhood. Before the Asian couple who bought it the people who ran it before must of told to keep the legacy and make the bagels the same way. They still boil their bagels as appose to Noe Bagel or Noah's bagels which steams their bagel makes for a totally different texture and taste. If you want ol style good Jewish New York style bagels This is the spot. It use to be Holy Bagel but when the changes hands they added the E in Holey. Either way it's spelt these are the best in San Francisco! Made the right & only way!", "author": "Roxanne O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "They do an egg and cheese bagel right!\nJust a hole in the wall (no pun intended) but cheap, fast and yummy.", "author": "Cathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "NYC Transplant. \n\nVery good bagel shop for SF.\n\nIgnore the bad reviews (typical yelp-I'm never happy with anything people)", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-05", "description": "I've been happy with Holey Bagel bagels for decades.\nit's certainly not Ess-a-Bagel, but for me it has been\nthe best SF has to offer.  But today I picked up a couple fresh\nbagels there and found them distressingly soft, lacking the\nhard crust that distinguishes boiled bagels from the soft toroidal\nbreads that Safeway calls bagels.  I'm hoping this was just\na one-time misadventure, not a permanent change in their bagels.\nThey've also upped the price to $1/bagel; I hate to sound like\nthe old fart I am, but that seems steep for a bagel.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "Best bagel in this part of SF. The decor is barebones. The service is quick. The price is cheap, especially compared to all the hotness that's around (Schmendricks' $4/bagel nonsense).", "author": "Anton S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "Small mom and pop joint that knows their bagels. If a place has bialys then you know it is legit.\n\nA few years ago I thought I remembered getting homemade tofu cream cheese. I was disappointed to receive the Tofutti store brand. There was an appropriate amount spread. An easy way to deal with too much of a spread is to order one extra bagel and scoop the extra off with that bagel.\n\nThe bagel itself is boiled, seeded both sides, and a nice golden brown crust. Decent size.\n\nTo date, this is the best bagel I have found in the city.", "author": "Bagelman D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "Great egg bagel sandwich. Super fast service. I love the tiered pricing -- I don't like meat on my breakfast sandwiches and saved ~2 bucks!", "author": "Max H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "For a west coast bagel, I was pretty impressed. Would have been three stars on the east coast, but in context this is a pretty good place! Good cream cheese, good bagels, not stingy with the schmear... Recommended!", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "Nothing fancy, but picked up a bakers dozen bagels and some cream cheese.  No fuss.  Bagels are very good, nice and dense, not just bread circles like at Posh Bagel.  Efficient service.  Would go agai.", "author": "Gene B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "Awesome bagels.  Love their honey walnut cream cheese on a cinnamon raisin bagel.", "author": "Peter O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "What are these low reviews all about? These bagels are the best I've had in SF, and on par in terms of quality with some of the best NY establishments, such as H&H and Esse Bagel. My girlfriend is a native born New Yorker and she can't get a enough of these things. Everything bagel with plain, not toasted. 'Nuff said.", "author": "Leo G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-10", "description": "I've only tried this place twice.  Shame on them the first time and shame on me for coming back the second time.  \n\nTheir bagels just don't taste fresh in the morning or in the afternoon.  So stale I thought it was a utility for filing my teeth?  They should change the name to Holy Crap Bagel instead.", "author": "Yvonne Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-26", "description": "You could do so much better with a bagel place in Noe.  \n\nThe best part of waking up is not Folgers in your cup, yet you give me no other option so I have to go to place next door for a real coffee.  \n\nThe atmosphere is similar to a dirty basement.  The bagels are decent.  You're mailing it in, Holey Bagel.  You can do better.", "author": "Johny X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-04", "description": "I'm not sure why people think they 1) not live in NYC and 2) real bagels.  Especially in Noe Valley.   This little shop is like any other bagel place in the city.  Really.  Several types of bagels and spreads (most spreads are kinda ick).  And don't ever get the coffee.\n\nHowever, the Holey Bagel does have an egg & cheese on bagel sandwich.  They basically poach and egg in the microwave, melt some cheese and throw it on a toasted bagel.  Will cost you 3 bucks (meat or veggies are pricey extras) and makes for a good quick breakfast (or an easy hangover helper).", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "Excellent bagels, better than Noe Bagel across the street.  Also this is near Martha's so you can get a good cup of cawfee over there.\n\nHoley Bagel is tiny but the bagels are good.  Overpriced in general, no matter what you buy.  it's Noe Valley, what do you expect?  \n\nAnyways, Holey Bagel ahs yummy bagels, better than Noah's.  But I prefer Posh bagel over all of them.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "These guys make a great bagel. My husband is particularly fond of the lox sandwich. The staff is also amazingly efficient, competent, and friendly.", "author": "Anonymous F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "I appreciate that they are open at 6am.  I can't say their bagels or egg sandwiches are spectacular, but they are serviceable.  I did get to try their vanilla cream cheese and it ticked me pink.  If that lives up to its first impressions, I might bump this thing up to four stars.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Fast. Friendly. Delicious. That's all I really need from a bagel shop.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-08", "description": "The bagels are good and I love trying the interesting flavors of bagels and cream cheese they are always sampling.  I usually stop here instead of Noe Bagel because it is next to Martha's Coffee.\n\nBut my staple at bagel places is bagel + egg + cheese.  They microwave their eggs in a plastic tupperware instead of making them on a griddle.  I eat them when I am hungry but as long as they take the lazy and carcinogenic approach they can't top 3 stars.  Anyway, Noe Bagel does it too.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-05", "description": "Not a fan! I have been to Holey Bagel twice and both times received a bagel that was raw in the middle, very very disappointing.", "author": "Andria N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "Here's why I like going to Holey Bagel: the breakfast sandwiches. Bagel + sausage + cheese + egg = warm, breakfast goodness.\n\nTheir shop is very tiny with only a few small tables, which is why we usually get our food to go. There are plenty of benches in the surrounding area to sit and enjoy your bagel if you so desire.\n\nThe staff has always been friendly and the food has always been tasty. So, if you're in Noe Valley and you're looking for a filling breakfast on the go - stop in to Holey Bagel!", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-08", "description": "I grew up in NYC.  I know what good bagels taste like, and I must say that I have been very impressed with Holey Bagel the two times I've been.  I ordered a toasted everything bagel with whitefish spread both times, and both times the bagels were toasted just right, fresh, and the whitefish spread was delicious.  \n\nDidn't have high expectations and left pretty impressed.  Concerns me to read reviews about the inconsistency here though.  Maybe they're not as good on weekdays? Maybe the other bagels and/or spreads aren't good?  I wouldn't hesitate taking a New Yorker here.", "author": "Elad C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-14", "description": "Oh Holey Bagel ... Let me count the ways I crave your carb-loaded goodness ...\n\n+ I bless you for having a large selection of authentic and real \"Jewish-friendly\" bagels.  We're not talking Noah's here my friend!\n\n+ The great woman behind the counter was super friendly when helping me with my difficult order - I know ... I'm difficult at even the a.m. hours ... Sheesh!  I'd like this shmear on this half and that shmear on that half - I'd like salmon here and tomatoes there ... You get it!\n\n+  Take the bagel home and yummmm it's delish!", "author": "Nicole Rynee B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-12", "description": "So disappointing.  \n\nBoo-urns, Holey Bagel! \n\nMake sure to check out the rating details graph for this place.  It's all over the place which makes me think that all the 5s are Californians who know jack shit about what real bagels should taste like.  If you're a native Californian and you've never been to the East Coast, you shouldn't be allowed to review bagels or thin pizza.  You skew the ratings in favor of CRAP.  Stop it.  For the LOVE OF GANESHA, stop it now.", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-21", "description": "If you are planning to visit Holey Bagel anytime soon, the best thing on their menu is:\n\nLox Sandwich on an everything bagel.\n\nOh sooo good....so good.\n\nRecommendations: \nLox Sandwich on an everything bagel\nSausage Egg Tasty on a plain bagel\nLox cream cheese", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-10", "description": "The good:  decent bagels, decent prices, fast service.\n\nThe bad:  horrible interior, kind of gross hummus, horrible interior.\n\nThe ugly:  I ate at this place on the day I got fired from the only job I've ever lost in my life.  But why would you care?", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "This is the best bagel egg sandwich I've had in the city.  They don't have some weird egg mix -- they crack their eggs and nuke them fresh.  Their bagels are good -- not the best in the world, but definitely better than anywhere in SF.  And, despite contrary opinion, they are pretty cheap.  My egg bagel sandwich is only $2.75.  It fills me up and tastes so good.\n\nI'm not promising that these bagels will move mountains; but they will make for a tasty breakfast.  Just don't forget to ask them to cut your bagel.  And go to Martha Brother's for coffee -- don't even try theirs.  It will ruin your appetite.", "author": "Courtaney W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-27", "description": "Nostalgia adds at least one star to this rating.  This is the first place I ever ate in noe valley.  I was checking out the neighborhood while apartment hunting.  I came here for lunch and was very happy to have my bagel with hummus and vegetables.  I then walked out of the place and simultaneously an elderly woman completely bit it tripping over the curb at the corner of sanchez and 24th.  Within seriously a second there were four people that ran over to help her up before I could even move.  This is how the charm of noe valley made me fall in love with it.  It may be full of stroller pushing mothers and fathers and only have three bars, but it is so charming you just can't resist.\n\nBack to the review- The bagels are good and the people are nice.  I did notice that they closed on Columbus day early because they ran out of bagels- good thing i didn't come on that day.", "author": "Maria F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-17", "description": "Friendly owners, fast service, super-fresh bagels with creative creamcheese options. I'm a regular buyer of a baker's dozen!", "author": "Nina J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-17", "description": "Been a regular customer for many years... before Charles bought out the old Jewish couple, and before it was Noah's or Manhattan or whatever that was for a little while.\n\nAll the while I've seen/felt them nickle and diming to death... now I feel like I need to say something.\n\n.95 cents for a bagel\n.10 cents to toast it\n\nTheir hours now are sliced down... only open until 2:30 or so...\n\nI have been ordering the same thing for years... and recently noticed (as the total went from $10 for lunch, to $13, to $16, now to $22.... that the sandwich I order is cheaper if I order it in pieces ... I asked the owner about this (I will list my sandwich below):\n\nBagel toasted\n1 slice cheese\n1 tomato\n1 lettuce\n1 mustard -which BTW is not listed as a condiment they charge for\n1 cucumber\n\nThis sandwich according to them costs $4.45 (I will explain below)\nThey tell me that it is equivalent to the following sandwich they sell (the veggie sandwich) which is $3.85 + .60 for the cheese \n\n1 bagel (toasted or not)\n1 lettuce\n1 tomato\n1 onion\n1 mustard \n1 mayo\n\nIf I read their menu which lists the bagel at .95 + toasting .10 + slice cheese .60 + 3 veg @.50 that is NOT $4.45 (uh more like $3.15 which is a $1.30 diff)... when I asked about this the owner got very upset and said that it's not meant to be ordered that way and that the extra cost is for the \"labor involved in making the sandwich\"\n\nAhem... I understand escalating business costs however... this seems to me to be deceptive, as it is not listed as \"alacarte\" on the menu, just as \"add vegetables to your sandwich\".\n\nNeedless to say they still charge me $4.45.", "author": "A. E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-10", "description": "Holy crap is more like it.  Come on.  These bagels come frozen and then reheated.  You know it, I know it, THEY know it.  I almost broke a tooth on a sesame bagel and then gagged on the veggie cream cheese spread. I am still looking for somewhere to replace my beloved H&H bagels from NYC, but it ain't this place.", "author": "Kamael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-16", "description": "Decent crave-able bagels. I don't get too fancy with the spreads, and on occasion venture out into the  \"egg-wich\" department for a quick protein boost. It's a nice walk and just a jump from the J for morning commuters. The diner style coffee even comes with little generic white cups. Fancy no? Decent yes!\n\nI'd still say I prefer Noah's and well Posh bagel's are good too but there's something about Holy that keeps it in the running.", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "I've never done just the bagel thing here - I always get a sandwich, which seems to be Holey Bagel's forte.  \n\nThe staff looks at you funny if you don't want your bagel toasted, though.  That bugs.  Don't judge, peeps.", "author": "Evan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-29", "description": "This place is better than Noe Bagel, but not as good as Posh Bagels.  Be prepared to spend around $9 dollars because you will get something to drink at Martha Bros. right next door.\n\nIt's just the Noe Valley way!", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "I don't know why but every time I come here I always get stuck in line behind a noe mom shoving a stroller spending 15 minutes deciding what she wants like its Le Hip Creperie for Lame Noe Mommies Du Jour. It's a bagel shop. It sells bagels.  Argh.\n\nEverything, as far as I know, is baked on-site, from the bagel-rolls, to the bagel-thins, to the bagels themselves. For years, the only way I could kill a hangover was an Egg tasty -- and they are very, very tasty -- and a V-8. They make it with a microwave, but so what -- you use a cell phone too, dontcha? You're getting cancer anyway, so eat up.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-20", "description": "If this is what a \"real\" bagel tastes like, I'm gonna stick to doughnuts.  Some kudos for the nice hummous bagel sandwich -- all they need to do to improve it is replace the bagel part .", "author": "Laurence W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "Very, very decent bagels for SF which gives Holey Bagel a solid 4 stars!  No bagel place outside New York can ever get 5 stars in my book so this is about as good as you can expect outside my native NY. I've tried many \"good\" bagel places in SF (used to live in Russian Hill and frequent \"the Bagelry\" up there which was OK) but I think these bagels are tastier. \n\nMy new fave flave here is the whole wheat everything bagel - a bit healthier but the everything seeded goodness masks the taste of the whole wheat - awww yeah! \n\nThese guys must have some affiliation with the tribe because they import whitefish salad (which is fairly decent) from Florida - tastes close to what I remember from home - not too shabby.", "author": "Heather F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-07", "description": "Pretty good fresh selection of bagels in Noe!\r\n\r\nTimes visited: 1", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-21", "description": "Fans of egg bagel sandwiches should experience the bliss that is Holey Bagel's \"Egg-Tasty\" sandwich.  I order mine with bacon on an everything bagel 'cause I like my egg-sandwich nice and salty!\n\nThe people who work there are nice too!", "author": "Rosanna O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-29", "description": "Wonderfully fresh bagels are available in the mornings, though a little pricey -- today I bought five and it came to $5.25.  Can that be right?  I didn't even toast them.\n\nI have to admit, I'm also not a fan of the staff -- they're a bit haywire and once I saw one of the women scream at a rude customer, while I was a foot away from her.\n\nDefinitely not a pleasant bagel shop, but the garlic bagels rule in the morning, as they're boiled, and have a soft, chewy texture that a proper bagel should have.  They're better untoasted than toasted I think, when they're done just right.", "author": "Abendigo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-14", "description": "Just got a lox trim sandwich on a poppyseed bagel w/everything.\n\nReally generous amound of lox. not that skimpy whisper of lox you get at Noahs. \n\nDefinitely would do it again!", "author": "pedro w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-05", "description": "These aren't bagels. At all. These aren't even close. These are baked break in a circle shape. \n\nI am an elitist. I grew up in New Jersey, one of the serious bastions of bagelry and pizza making. But not so much I haven't found passable, if not great bagels since leaving the area. Noe Bagel up the street works, and Katz Bagels is phenomenal. Having a bunch of spreads doesn't make it a good bagel shop. \n\nHaving good bagels is the key, and a ton of places have trouble understanding that. Holey Bagel is case and point.", "author": "Chad G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "My first meal of 2007 was a fresh holey bagel with Tofutti Cream Cheese.  It really brightened my morning; as the staff are quite friendly and quick!  Great selection of bagels, and spreads, including non-dairy. Yum.\nIts a bagel shop that feels like a bagel shop.  Pretty no nonsense.  Get Bagel inside, go eat bagel outside with the Martha's Coffee bunch.", "author": "Martha Luz Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-05", "description": "Went here yesterday with the hubby and will *not* come here again! His garlic bagel was ok, but nothing special, but my sundried tomato bagel was unbelievably bland. AND they gave me plain cream cheese even though I said, multiple times, that I wanted garlic cream cheese- weak!\n\nBottom line- when the best part of my bagel breakfast is the Nantucket Nectar Pomegranate and Pear juice, it's time to find a new bagel shop!!", "author": "Jane D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "OK, so on moving back to SF yet again from NY and LA (which were mostly home in the last 20 years) --  one of the few drawbacks, and an issue, albeit small, was the fact that you really can't get a real bagel in San Francisco. This bagel purist  stands corrected and thank you Holey Bagel for proving me wrong!\n\nHoley Bagel wins the prize for Best Bagel in the city!!   Right up there with H&H on the west side of NYC!  The reason?  -- they make them correctly and in the traditional way -- no bready, air-filled  abominations here -- just solid, fresh, perfectly cooked bagels with just the right texture, weight, and flavor. Simply the best. (Please note: I have not tried any other spreads or sandwiches as I make my own at home - but you can't beat the bagels)", "author": "Richard H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-20", "description": "Good bagels, plenty of variety, and most of their spreads are low-fat.  I tried their garlic & herb spread on a toasted sesame bagel - quite good!  Way over-priced though for a regular bagel + spread...", "author": "Shweta V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-19", "description": "The service here is really bad even later in the afternoon when you're the only one in the place. The food was nothing special even if they manage to get your order right.\n\nThere's another bagel place that's better just a block west of here - I go there all the time now...", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-14", "description": "our favorite bagel in san francisco (actually the entire bay area).. yum yum. especially with lox spread and orange juice!", "author": "Josh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-06", "description": "A bagel in SF that you can actually eat without toasting it? And whitefish and lox, and everything bagels? Their bagels have the proper consistency of a bagel (slightly hard on the outside, soft and chewy inside) and the proper seasonings (I think I even tasted toasted garlic on that everything bagel...). I might not need to bring bagels back with me from NY anymore...", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-02", "description": "Blah. The tofu chive spread was dripping while I ate my lox and bagel sandwich it also lacked many chives. The garlic bagel didn't even have a hint of garlic taste. Lame. After all the walking to Noe Valley for this place I have to say I was unimpressed. Skip it.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-20", "description": "Best bagel I've found in the Bay Area so far. I'm an H&H devotee. Good fresh selection and homemade cream cheese, albeit more expensive than what I'm used to for a bagel. No frills.", "author": "kathy c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-10", "description": "I have been coming here since before I can remember, so there is definitely some loyalty, but lately I have become somewhat disillusioned. Don't get me wrong, I still enjoy their bagels, but every time I get something here (which is pretty often, because I work next door), I get a little indignant about the prices. Everything is just a bit too expensive, and then extra vegetables and flavored cream cheese alll cost extra, so the total can shoot up fast. Also, it bugs me that they don't cut the bagels in half unless you ask them, but that's just me being needy. Despite the negatives, you can still get a good ass bagel here, and that's what counts.", "author": "Aly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "This place has a great variety of bagels.  I recommend the Spinach or Sun-dried tomato bagels, delicious.    \n\nThe place is open until 3:00, and you can get a dozen bagels for $5.50 after 2:30.  Nice value, and enough bagels to give to the person begging outside of Whole Foods when you pass.", "author": "Carla K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-16", "description": "Sadly, I have to say these bagels leave me desiring for more. However, since they do stock tofutti cream cheese I had to give them 3 stars. The service is mediocre and if your going for a whole sit down experience, I would recommend doing so outside since the inside decor is shabby. I like Noe Bagel better. Sorry Holey cause I heart your name.", "author": "Eryn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "I work in the area so my breakfast or lunch usually consists of a egg tasty: plain bagel with egg american cheese cucumbers and sprouts. Love it! Nuff Said!", "author": "Lorain C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-23", "description": "Their Everything bagel was warm, fresh, soft, and absolutely fabulous with their whipped regular cream cheese.  Reminded me of the Western Bagels I grew up with.  Hummus was pretty good, too.  Their hours are challenging since they close so early, but love their fresh bagels on the weekend.  They freeze well, too, btw.", "author": "Amber W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-19", "description": "Okay, I'm an H&H and Zabar's guy, and Holey has the best bagels I've found in SF.  Much better than Noe bagel across the street.  The people are friendly, and they have a NY pace.  Get an egg tasty.", "author": "Des Esseintes I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-24", "description": "My poppy seed bagel with lox and cream cheese was big and hearty, but boy did the saltiness kill it for me.  Coffee was none too impressive either.  I'll spend my morning $7.25 elsewhere, like Noe Valley Bakery, for example.", "author": "David N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-04", "description": "Great bagels (especially the well done ones). However, Never, Never, Never get the lox trim. Also, The owner should take a course in customer relations.", "author": "Laura F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "everything bagel is salty and ridiculously delicious\nas is their cream cheese", "author": "Lia A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-30", "description": "I don't know if the bagels here are any better then at Noe Bagel down the street, but I'm in the neighborhood one morning a month and this place is usually busier then the other one.  Maybe it has to do with the Martha & Bros next door.  Good stuff, though.", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-11", "description": "I think this is best you'll get for a bagel in this part of town.  The people behind the counter are friendly and the bagels don't resemble hockey pucks.  Pick up some coffee from Martha's next door and you're good to go.", "author": "Nat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "The real deal as opposed to the doughy and paste chewy Noah's.  Always good for a salmon lock.", "author": "Richie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-05", "description": "Have been walking down on the weekends and grabbing a toasted sesame bagel with plain cream cheese. Can't complain. Bagels have always been good and they seem to get through the line that is constantly out the door pretty quickly.", "author": "Jazzelyn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-03", "description": "I've been coming here for years, and I think their bagels are better than most I've had in the city. I always get the same thing: the everything bagel. The everything bagels here don't have rye seeds, which is a good thing: to me, the flavor of the rye is so strong that everything else is obliterated.\n\nCombine a toasted, buttered Everything with a slice or two of the dry-farmed tomatoes from the Buffalo Market on 19th and Castro, and you have yourself a delicious breakfast.", "author": "kelly r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-11", "description": "Not only is this place overpriced, but I got home and they had made my bagel wrong. After confirming twice that I didn't want egg, I get home only to find egg on my bagel. All for $5.75, which, in my opinion is way too much for a fricking bagel.", "author": "Vivi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-21", "description": "Great food i always come here and each time i either get a egg tasty or a lox sandwhich. can be pricey but it is better than noe bakery up the street which i did not like at all. they boil then bake their bagels which i like so they are not soft. they have a large variety of naked juices which i love drinking so thats a plus. once you get to know the owners and become what they call \"regulars\" sometimes you don't even need to order and they get it started for you. the people working there are always friendly when i come in. the two brothers are great to talk to and the asian man is nice and friendly once you get started talking to him. the asian woman is also very nice and very fast i try to catch her attention when i need to get in and out as quickly as i can. the one thing i don't like is the other woman who works there she is slow sometimes and i will say my order 4-5 times even though i always order one of the two bagels the same way every single time. \nPros: food is good. fast service. relatable staff. \nCons: sometimes on weekends it is packed. but its worth the wait", "author": "Ai W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-30", "description": "These bagels are much more like the ones I get at some of the better bagel shops in NYC. Dense and chewy, not light and fluffy like Noah's. I go there at least once a week and the service is always good. Is it expensive? Hard for me to say because I only buy one bagel and it costs 75 cents.", "author": "Yogi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-17", "description": "I wasn't planning on yelping Holey Bagel, but that was before I found myself talking up the spinach bagel with low-fat vanilla spread and tomato I had for lunch. It was on the sweet side, but seriously good. All part of the pre-Bay To Breakers carb load. We'll see if that pays off tomorrow.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "Best bagels in Noe, not that there is much competition.  They also have poppy whole wheat bagels which are great.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-17", "description": "This place gets my business often because SF. is short on Good bagelage; But it is pricey. The staff are mostly nice, but the main lady in charge now sabotages my bagel every time because I had the audacity to question the price once. if you order an \"egg tasty\", which comes with cheese, without the cheese, and ask to substitute cream cheese, they add an extra .65 cents. I asked if that was justified because, I am not getting the cheese they normally add... and now I am a pariah!  She can barely contain her fury... It is most unpleasant. The bagels are decent though.", "author": "john c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-21", "description": "this is the best place to get a bagel & cream cheese in the neighborhood.  trust me, i eat a bagel & cream cheese for breakfast almost every day, and i've tried all of the alternatives.  holey bagel is the best.  my favorite combos are the spinach bagel with regular cream cheese, the oat goodness with veggie, or the sesame seed with sundried tomato.  i don't understand people who say that these bagels don't compare to new york bagels - duh.  getting a fresh new york bagel when you live in san francisco isn't exactly an option, so given the choices actually available, holey bagel is the best.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-25", "description": "i found they were skimpy on my sandwich -- not much white fish salad on there.  the onion bagel was not that great, didn't taste super fresh (on the dry side) as i would expect for a saturday morning.  service was friendly and fast. i think i'll just stick to their bagels and cream cheese.", "author": "micaela r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-15", "description": "they microwave their eggs? oh well.. bagels are ok.. my friend saw the guy touch money and then handed him his bagel and didnt like that..", "author": "Beach L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "Being originally from the East Coast, I remember bagles on Sunday as a family tradition.  We're so pleased that we can continue this every Sunday at Holey Bagel!  The bagels here are not bready, but just the right consistency and flavor.  I'm an onion bagel fan, but there are many other choices.  They also have the normal sides to take out and many folks order bagel sandwiches.....", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-21", "description": "These are real bagels, dense & chewy. If you want yuppy atmosphere & soft round bread, go to the place across the street but these are the real deal. Ask if any flavors are warm now. They open super early & close at 4.", "author": "Paul F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-13", "description": "Just went here today for the first and last time.  I've been going to Noe Bagel down and across the street since it stays open later.  I have to agree with one of the reviewers that the plain bagel with lox trim and cream cheese that I just had tasted like dry normal bread.  It definitely didn't have that bagel kick to it like H&H Bagel NYC or some of the LA bagels that I've had.  There was only one type of lox offering and I was wondering if this stuff was Atlantic farm-raised salmon -- yuck, bad for you!  I much prefer Noe Bagel -- the plain bagel I had was fresh out of the oven, loaded with cream cheese (for those who want just the \"right amount\" -- just say you want less of it).  Isn't it better that Noe Bagel doesn't cheap out and instead offers you more cream cheese than less??  Noe Bagel also has 3 types of lox -- I get the less salty Norvegian lox.  Well that's it for this review.  I will not be returning to Holey Bagel.", "author": "M. J."}
