{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Great Vietnamese food! And I'm picky Vietnamese too!\n\nEven with long queue, they get people through ordering quickly. Not too much of wait to get food either, 10-15min max.\n\nAll the traditional dishes, done correctly!", "author": "Dan N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-09", "description": "I went here solely for the boba. It's decent, and I'd probably give it 4 stars for flavor. I got the original black tea, which is very bitter but plenty milky. The tea is only lightly sweetened, much less so than other boba I've had. The pearls are firm and chewy, and evenly cooked through. I personally like my tea sweeter and less bitter, but I like that this place has a unique style that they do well. \n\nBut minus two stars because I found a piece of plastic in my drink. It was grey and looked like a piece of a plastic bag. I'm sure someone tore open a packet and a bit fell into my drink-- it wasn't a mystery, and the prep area for the boba is open and looked clean. But it's still an unpleasant experience to feel something odd in your mouth as you're drinking, and fish out a piece of a plastic bag. Kind of put a damper on the whole experience for me.", "author": "Bhiravi R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-18", "description": "I went to this place for the first time during my lunch break and I thought this place was just so so. I order the 5 spice chicken and my coworker ordered a Mongolian beef both over rice. \n\nMy 5 spice chicken came out pretty fast so I waited for my coworker to get his food. The food timing was just so off. We were waiting for his food for 15 mins so my food got cold. I can't really judge the food because it was cold but the flavor was there. I wish it was hot. \n\nThis is a cafeteria kind of setting where you grab your own utensils and napkins. Water available at the front too. \n\nAll in all I don't see myself coming back here or to die for. It's not a quick lunch spot so this would be a no for me.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Closed when their business hours day they open at 9am. Went by at 9:30 and the doors were closed and gated. \n\nFail.", "author": "Offset M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-29", "description": "This place is quite overpriced for a Chinese restaurant and for the food it serves. Probably because it's in financial district where everything is overpriced.\n\nSo I got the five spice chicken with rice and egg rolls and some veggies. It was decent, not the most amazing thing. It was just normal honestly. But the egg rolls were pretty good!! It comes with fish sauce. The portions are very large and generous. \n\nIf I was looking to eat Chinese food in SF, I would not go here, but it's just convenient for when you're in the financial district where there isn't a lot of Chinese food. \n\nThe servers here are nice though. You just order in front, get a number, and they bring you the food. Decent place.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "Okay Vietnamese restaurant located in the Embarcadero. The place is somewhat easy to miss as it is on the second floor and the 1F stairways doesn't make it really seem like a restaurant. Came with a group of friends for a dinner on Friday night -- it was quite empty when we arrived at 6pm.\n\nYou order up at front, so we each decided to get their house pho with an order of imperial rolls to share. The imperial rolls were pretty good and tasty, deep fried very well, and very large compared to rolls at other Vietnamese places.\n\nThe pho was quite bland and not particularly memorable. There wasn't a whole lot of meat, and the beef tasted pretty average.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-31", "description": "I stayed at Hyatt Regency for a conference and discovered the restaurant on Yelp. It's located on the second floor across the street from the hotel. The decor is so so. I felt it's too dark ( I went there for dinner). The manu is mixed Chines and Vietnamese. I ordered a beef pho and imperial roll. They taste just O.K. The service is friendly and prompt. The price is fair considering it's location. I wouldn't recommend it unless you are craving for that kind of food.", "author": "Jeffrey W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-07", "description": "I ordered the Veggie & Tofu Sandwich ($6.50) and found it to be very plain. When I first ordered the sandwich, I assumed that it would be a banh mi sandwich. I was also hoping to see daikon, which I can typically find in banh mi sandwiches. Instead, I got a sandwich that was stuffed with vermicelli noodles, cilantro, carrots, large cucumbers, and huge tofu chunks. \n\nI never had a sandwich that had tons of noodles in it. The noodles were sticking out on the sides as I took a bite and it seemed as if I ordered a vermicelli dish stuffed inside a french bread. \n\nThe tofu was kind of dry and plain. They were cut into large pieces and seemed to overpower the rest of the sandwich. There was no sauce on it either. I ended up taking the tofu out of the bread.\n\nAt least the bread was crunchy...\n\nI thought it was a bit weird that the employees would bring out food to your table. Yet, you were expected to get out of your seat to pick up your own utensils. I might as well have just picked up the food from the counter instead.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-08", "description": "My aunt and I were looking for a place to eat around my office and we stumbled upon this place just because we were hungry and it was convenient. I got the beef noodle soup which is basically pho and she got the wonton soup. I also got a thai iced tea (total came out to be $28) \n\nThe beef noodle soup was pretty standard, nothing too special about it but they did give a generous portion. \n\nI liked the thai iced tea too but the only reason why I would give it a 3 star is because my aunt thought that her wonton noodle soup was way too salty and I thought the service can use some work. \n\nThis place will give you the food to make you full but it won't provide you with your bang for your buck when it comes to the quality of the food.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "I really didn't know what to expect here, but it showed up from my search for cheap eat walking my way from Embarcadero station to Fisherman's Wharf.\n\nIt was around 11:30am when I stopped by here and it was already 3/4 full when I headed to the upstairs restaurant. My friend and I just wanted a light snack as we had other plans for our stomachs in Fisherman's Wharf. I wanted to get the BBQ pork bun and my friend wanted the pork dumplings. But alas, none of those were had, because they sold out of them. (Before noon though? We think they just ran out of pork.)\n\nWe ended up getting the shrimp dumplings and chicken pot stickers instead, they gave us a tent number and we sat ourselves at an available table. It took just over 15 minutes for our food to arrive but it was ok. If you are familiar with Chinese dim sum, the shrimp dumpling was har gow, so I was quite surprised when the order came. \n\nIt was the perfect place to grab the necessary sustenance to hold us over without costing us too much or having to get more than we needed. With that said, the food is nothing great, but it wasn't too expensive, and sometimes you just need that to tie you over until your next meal.", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "Food was terrible!!!\n\nOrdered the Chicken Fried rice and now I feel sick  \n\nPlace was very dirty too \n\nDO NOT EAT HERE!!!!", "author": "Charlie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "It was pretty slow on a Friday afternoon. Came here with a friend and ordered the vermicelli bowl with beef and egg rolls. Portion was pretty big. I couldn't finish it. Four stars for service and food. Price was a bit high", "author": "Billy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-11", "description": "Wth, $13 for shitty noodle soup?! Was really, really craving noodle soup for lunch last week and couldn't find a closer noodle shop than this spot. Called in my order and they said it'd be ready in 5mins. Whoa, that was quick. I wouldn't even be able to walk over there in 5mins from work. \n\nAnyways, picked up the to go and brought it back to work. They do a good job of separating the soup from the noodles + other items in the dish. I especially appreciated the to go plastic bowl to make it easier to eat (other places use those longer, more narrow to go containers that make noodle soup eating on the go really difficult). Ordered the spicy seafood noodle soup.\n\nFew things. The noodles shouldn't have been as mushy as they were, since they separated it from the soup, but it was. The \"seafood\" lacked good/real seafood (LOTS of fake crab meat that I tossed out). The veggies were alright, but how could you mess that up? \n\nSoo much opportunity to have better, more legit pho/noodle soups in the dt/financial area. Someone else pleaseeee open one up. Two stars for the to go containers (sadly).", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "The service here is so good it's a nice vibe and affordable food. The lady that served me was so nice, such great customer service I love it. And I enjoyed my for the ambiance of the place is also nice", "author": "Natsai N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "Very big noodle bowl, the price is friendly. I ordered combination beef noodle soup, have to say the meat is really little ... noodle is a loooot. The soup is good.", "author": "Faye L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-27", "description": "~$12 fo chicken pho, which doesn't come with many bean sprouts and tastes more like chinese chicken soup.\n\nThere are a ton of other asian restaurants around for the same $ or less, that offer up much more protein + veggies.", "author": "Kristie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "I have been to this place n number of times and I simply love it. \n\nYou should definitely try their pho, and if you like the egg noodles, that's a must too. I like to have spicy chicken pho with egg noodles and man it's tasty. No matter how many times you try it.\n\nI have also had Mongolian chicken which is tasty. The staff is nice and service is quick. If you go at lunch time you will find it hard to find a table. So be patient, and keep some time for that. It's a fast moving place but you should reserve some time . Generally  by the time you order your food, wait for it to come, you should get a place. \n\nDecent priced, good quantities and I would definitely recommend it.", "author": "Ramyata M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "First time here in a long time - probably 10 years. It's a solid place for lunch for around $11. I got the chicken katsu rice dish. It was a large portion and it was fresh and crispy. The service was very nice. I'll be back.", "author": "joe m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "I found this place while exploring the Embarcadero Center. It was cold so I ordered the basic choice of beef noodle soup (pho). Also ordered the pork dumplings/dim sum out of curiosity. \n\nThe dumplings were ok but it wasn't hot and tasted like it was microwaves. The pho was pretty decent. Service was fast but understaffed when it came to ordering. My only issue is the price- $11 for basic beef pho?? And $5 for 4 pieces of dumplings? \n\nDecent food, decent service, overpriced.", "author": "Carol D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-05", "description": "I came here for lunch and ordered a rare steak and meatball pho. Food came quick, only had to wait 5 minutes. Soup base is delicious, but the rare steak was very minimum. Only one spoonful. I wish they would give a little bit more meat. Overall, would come back.", "author": "ZhiCheng Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "Solid 3.5/5. Decent food, generous portions (for the HK food), fast service, and location, location, location! Prices are a tad high for fast food chinese place, but... location x3!\n\nChinese-run place. Pho is decent, but don't go here to satisfy hardcore pho cravings. The pho portion is moderate, the flavor is... well, okay. The rice dishes were better. Five spice chicken was better than I expected! They had a special so it came with a single piece of vegetable and two spring rolls. Seafood stir fry (iirc that's what they called it) was pretty good as well. The stir fried noodle was huge, but was so bland, and filled with veggies (bean sprouts and onions). Conclusion? Get the rice dishes!\n\nDo not get the bubble tea. I usually know better, but I hadn't had BBT in so long so I decided to risk it. Yup, regret and remorse. \n\nOrder at the counter (& pay) and pick a seat! Any seat! They bring the food to you. Get cups for self-serve water refilling at the counter where you also pick up your own choice of utensils. \n\n(I'm not sure what this says about me but) service was a lot nicer than I expected! That is not to say they were super courteous, but rather, they knew how to smile, were decently friendly and patient. What more can you ask for?\n\nIt is on the second floor and the carpeted stairway looks... well very shabby is perhaps putting it mildly. It's better upstairs, and sorry I wasn't brave enough to venture into their bathroom.\n\nIf you're in a time squeeze, this is an okay spot to stuff your face with rice.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "I usually get their pho, and while it's not the BEST, it is quite tasty. I'm not a huge fan of their pork vermicelli, but the one time I got it, I ordered it to-go, so possibly the issue was with the fact that I didn't eat it fresh. Their prices are reasonable for the area, and it's the only place I can get pho within walking distance of my office in FiDi so it's a go-to for me.", "author": "Charlotte C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "Eh. Convenient asian food in FiDi but not the cheapest. Also not the tastiest but it works and I'm not opposed to the place when coworkers suggest it.\n\nPho is alright. Good portions for lunch as the noodles are pretty filling. It's also hard to find pho in fidi so good place to come if you're craving it. BBQ pork buns were a miss. Way too much soggy mushy bread and not very much filling. Shrimp dim sum dumplings were okay. Bbq pork fried rice is good. Depending on the day, there is usually no line before 12pm and a pretty long line by 12:30pm. The table turnover is usually fairly fast but sometimes you do have to wait a bit for an open table or share one of those big round tables with strangers. \n\nOverall not bad lunch place in fidi if you're craving pho/Asian/Vietnamese/Chinese food but won't blow your mind.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "Go early to get a good seat.", "author": "Sujeesha V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "I'm giving this place 4 stars in the bubble that is the FiDi.  There are definitely better places in Little Saigon, the Avenues and in towns outside of San Francisco (which I never visit).  But this place serves up some tasty Vietnamese (and  not-so-Vietnamese) dishes in a fast casual setting that beats the nearby competition for a good workday lunch bowl of Pho.\n\nBeef Pho: Rare steak, brisket and beef ball is my signature combo.  The rare steak is actually served rare here in a mound that thankfully isn't all stuck together (as seen at other Pho joints).  The portion of steak in the broth is medium and there is a gradient of doneness up to rare at the top.  The brisket comes in large slices and offers a nice well-done and fatty contrast.  The beef balls seem smaller and chewier compared to most pho places, but still decent enough to include in a bowl.  The broth-to-noodle ratio is good; in the past it seems like they had overloaded on noodles and skimped on broth so I'm glad that this has been remedied.  The broth itself is respectable.  Yes, there's better out there, but it sure beats pho from a place that makes donuts!", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Very good quality food. The ambiance is alright. The staff is awesome. Food takes time to be ready, but that actually seems like a good sign- that it's freshly prepared. I just got congee, my first time, it is so soothing! Good stuff Maynard!", "author": "E. R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-08", "description": "Not very good.  Who puts shredded iceberg lettuce in Pho?  It's just cheap filler.  The broth is flavorful, and the meat is tender, but ruined with the abundance of wilted lettuce.  The place isn't very clean either... sticky tables and stained walls.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-15", "description": "Food was very fresh, and the broth in my pho tasted great. \n\nIt has a very mom-and-pop feel, but still has a good selection of tables. Was packed for lunch, and the service was a bit slow (not sure if it's due to the lunch crowd or cook-from-scratch timing). \n\nWas very comparatively priced (especially for the area!), and I would eat here again.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-03", "description": "First time at Hong Kee & Kim. I used to frequent Hi-Tea circa 2010 when they were still in business for Pho as it's increasingly difficult to get Vietnamese in FiDi. Anyways I was venturing over to Osha Thai for lunch but the wait was 20+ minutes. I needed to get back to the office so I remembered that I've been meaning to give Hong Kee & Kim a try.\n\nThe restaurant is on the second floor so we made our way up there. It's a pretty big place and has plenty of seating. Order at the counter, take a number, and have a seat. Everything is self-serve (just like cafeteria style). They will bring out your food very quickly. I had the combo beef pho and a mango milk tea with tapioca. Prices are a premium in FiDi and portions are about average at best. Small price to pay for the convenience of not having to walk to Chinatown for a cash-only experience. Plus side they take all types of credit cards here. I'm still kind on the fence about tipping or not tipping. I mean if I have to go up to the counter, grab my own utensils, and refill my own drink does that count as waiter service? Probably not. Tipping in America is too complicated and I get kinda flustered when I have to decide how much. Why can't it be like the rest of the world where they include the entire cost of VAT and service in the price? They have a very good selection of Chinese and Vietnamese items. I don't think you can go wrong and many rave about the soups which are great on a cold day.\n\nI like the location and it's convenient. They are probably the most legit restaurant in the area and price wise it's pretty reasonable.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-07", "description": "After discovering that Hong Kee & Kim serve boba, I made the quick walk here from my building and got the milk tea with boba for $3.75. It came in a decently sized cup and had a great flavor, but they were a bit stingy with the amount of pearl. I decided to come back in the evening for my meal break to try the food.\n\nCame here for dinner at 6 and was pleased to find not a single soul in the restaurant aside from an older couple talking quietly to themselves in the corner. I ordered the grilled chicken vermicelli and the potstickers, along with a bottle of water, and found my total to be a whopping $16.03. Granted, the amount of chicken I got was nearly, if not, an entire breast, but the large bowl is padded on the bottom with lettuce underneath what I thought was a generous portion of noodles. The potstickers were very delicious, however, and the spicy chili oil/soy sauce dipping sauce was quite good as well. \n\nI was disappointed to find that my vermicelli tasted exactly like soap. Not that I've ever eaten soap, but it tasted like what laundry detergent or Dove smells like, and that's not what I want to taste when I'm eating rice noodles. It honestly killed the entire meal for me.\n\n$16 isn't what I want to pay for soapy-tasting noodles. I'd come back to try the rice plates or the other noodle dishes that aren't vermicelli, but I guess I also won't be ordering an appetizer either because I don't want to shell out nearly $20 for one entree just because I'm eating in the financial district.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "I like the spacious dining area provided at this place - in the Financial area and with feasible pho too!  \n\nIt's simple cafeteria style, where you order upfront and they conveniently accept credit cards!\n\nTheir Five Spice Chicken, lacked the spices ideally for it to be called five spice, but it sufficed.  I like their Pho with rare steak and beef balls.  Their broth was good.  Entrees are priced fairly - especially in the FiDi.  They serve up boba tea if you want a refreshment!\n\nIt'll suffice for the FiDi lunch flow!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "This place is always busy during the lunch hour. It's a big restaurant but it kind of reminds me of a cafeteria. Sometimes you have to sit next to strangers when they are full. \n\nI come here for the pho. There's not alot of places in the financial district that serves pho. \n\nIt's decent. The service is fast. They are friendly. But the prices definitely went up in the past year. \n\nI usually take a late lunch when most people in the financial district are back at work. I came here one day and almost had the whole place to myself. That was nice, except the place smelled of dirty mop. I couldn't get the smell off my mind so I stopped coming here for a long time. \n\nI recently went back cause I have to have pho every once in a while. It's still good.", "author": "Edie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-21", "description": "The Good: A place to sit and can accommodate a lot of people. The Chow Fun was passable\nThe Bad: Kind of cold because of all of the windows and for $12 I expected the food to taste a little better. With so many better places nearby I wouldn't make a special trip to here.", "author": "Timothy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "They're ok a lunch place.   Mix of Chinese and Vietnamese.  So can't expect any authentic tasting dishes.   Good seating.  Gets pretty crowded close to noon or after.    Price is reasonable.", "author": "Paul T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "Great food and the price is reasonable in downtown.  It's busy during lunch hours so the service is a bit slow.  Overall, the place is neat and clean.", "author": "JT T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Love to come here for pho or wonton noodle soup. A bit more expensive than pho outside of the FiDi but about what I expect for lunch in the area. Go early to get a table.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Outstanding (and quick) lunch options for less than $8 (before tax). Expansive vegetarian options too!\n\nHong Kee & Kim is located upstairs from the typically lengthy line consisting of Fidi minions waiting to order Oasis shawarma.  The rush here begins around 12:15 pm, so if you don't want to wait long for lunch, make sure to pop in before then.  \n\nPortions are very generous here.  I personally find that the pho is 2 servings.  I'm a big van of the vermicelli noodle \"bun\" dishes.  \n\nVegetarians will be in heaven here.  There is a very generous menu dedicated to meat-free dishes.\n\nTake-out is quick, but feel free to enjoy the dining room if it's not too full", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Short Story:  A great place for pho if you're near the Embarcadero Center.\n\nLong Story:  I've been here numerous times for the past 2 years for lunch and dinner as I work close by.  The place is usually packed during lunch and pretty empty for dinner.  The prices and quantity are pretty good for what you expect in San Francisco.  Although they've recently raised their prices by about $1 per dish.\n\nI usually get the pho with beef meatballs and sometimes get the Imperial Rolls appetizer.  During the lunch hour, it's tough to grab a table if you come later than 12PM.  It's best to get there around 11:30AM or after 12:45PM.  They don't have a lot of staff so when you leave your table, it takes a while before it is cleaned.  Therefore, sometimes if you want a table you'll have to clean it yourself.\n\nThe wait time is usually about 5 minutes and the staff are generally friendly.  Overall, the place is good although the décor and ambiance are a bit lacking and so is the cleanliness.  The place has been shut down a few times in the past year because of this.  Still...you can't beat it's prices, how good it tastes, and the quantity, so I keep coming back.\n\nVerdict:  I'm writing this review at the restaurant!  :)", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-25", "description": "Cafeteria style layout and cafeteria style food.\nIts convenient and quick if you are in the Financial District, but otherwise it is pretty mediocre.", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "For a Chinese/Vietnamese restaurant that is located in the financial district, this place is the shiznette!! I am so glad that my cousin brought me here because this is my go to spot for when I feel like eating out for lunch or just have a really bad hangover.\n\nThere is a lunch hour rush and it can be really hard to even find a table so I go later or earlier than the lunch hour.\n\nI always get the wonton noodle soup and the portion is huge! I am very particular with my wontons and because this is an infusion of Chinese and Vietnamese they have their wontons down! (I prefer Chinese wontons over Vietnamese) I'm not too sure if they use MSG, but if they do they don't put a lot because I've never gotten a reaction as I am VERY sensitive to it.\n\nDid I mention that the prices are great too!!! It is cheaper and better than the chain restaurant pho hoa, I can't believe people go there when this restaurant is located in such a sweet spot! Some people may miss it because you do have to go up the stairs but there is a teeny tiny sign outside.\n\nTheir rice plates are HUGE and well worth your money, I've also tried their egg rolls and they were delish! Next time I will try their pho.", "author": "Jerrica N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-01", "description": "We stumbled upon this place while walking from the Ferry Building to our hotel in Union Square.  We were craving Vietnamese food and checked out the menu by the door and happy to see we could get vermicelli bowls and rice plates.  It was just after 6 when we arrived and we went upstairs to find a few people at the tables.  Glad they were still open for us to get take out to eat at the hotel.\n\nWe looked at the menu and a few more people came in for take out.  The vermicelli bowls are about $10.  There's a row of chairs along the wall for those waiting for take out.  We waited  about 10 minutes for our food to be prepared.\n\nWe ate about an hour later and heated up our food in the hotel.  The portion was big but we were hungry from a day of sight seeing so devoured it all.  The spring rolls were not great, but the vermicelli and meat was good.  There was lettuce, cucumbers, and bean sprouts under the noodles too.  I used all my fish sauce for a tasty meal.\n\nDecent food for a cheaper dinner.", "author": "Violet P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "so in general, there are just not many delicious asian food places for lunch in fidi for a reasonable price! i mean, cant afford to eat at hakkasan every day! found this randomly on yelp and came in today with a friend, and was pleasantly surprised. queue up to pay for your food, grab your number, scout for a seat (it can be SUPER packed so come early or later, but there is lots of seating and people eat fast) and wait for your delicious food to arrive!  my friend got the beef combo pho, and i got spicy noodle soup. mine took longer, but i thought it was totally worth it!  large bowl of noodles for 10 bucks, and they have other options - sandwiches, dim sum, appetizers, bubble tea, etc.\n\nit seems pretty clean actually. one major improvement could be the food delivery system.. would totally come back!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-14", "description": "Wow $11 for a bowl of congee and with no customers in the restaurant, it takes more than 15 minutes to bring it out?\n\nSlow service. Expensive.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Over all this is a good place.   Yes, $13 rice plates or noodle soup bowls (final bill after taxes) are expensive, but you are talking about the financial district.   The food tastes good and they give you a lot.   However, I give 5 star mainly because of its value.  Here you get a solid comfort food, but don't expect the real authentic experience like you could have in Vietnam or something.", "author": "Will T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-22", "description": "The Spicy Chicken Noodle Soup and the Beef Pho (recommended by the cashier over their Chinese Soup) was pretty atrocious. The broth is bland, the vegetables are incredibly dried out, and they are stingy with the meat. There was nothing redeeming about this dish.\n\nOverall, I might come back to try a rice plate but would NOT recommend this place for their beef or chicken soup.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "I go here for lunch on workdays. Definitely come at odd hours because the line get LONG at 12:30. They are my pho saviors, as they open at 9am and sometimes after a night at one of the local bars you need breakfast pho to start the workday right. Their other options are good too, I like that you can add broccoli or an egg to anything. It's pretty basic and reliable Vietnamese fare. It is a tad more expensive than neighborhood pho restaurants, but it IS in the Financial District so you come to expect that.\nThe staff is always very friendly and polite. They make good use of the not-too-big seating area and fit a lot of tables in. It gets crowded but we can usually find a seat for 2 or 3 without waiting too long.", "author": "Lindsey P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-27", "description": "Snack while doing banking in financial district. This was an inexpensive lunch cafe that we ate at when we worked in the neighborhood. Basic decor built for low end lunching. Food is good for the price, relatively clean, and walk in with little parking.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "Last Wednesday I found myself in the same position I've been in since starting my new job in SF... trawling through Yelp for a place to eat lunch.  After narrowing my options down based upon cuisine (Vietnamese) and how far I was willing to walk (not a lot), I came upon Hong Kee & Kim.  With a health score of 100 out of 100, I grabbed my purse and headed out.  You see, I realize that I need to balance my relatively sedentary lifestyle with healthy eating and smaller quantities of food.  (Yeah, my doctor would have you know that she does not endorse that previous statement.)\n\nAnyway, I work near Fremont x Market, so it took me less than 5 minutes to get there.  I'll admit that I almost popped into the sandwich shop next door when I spied the stairs, but realizing that it would be good training for the Nike Women's (HALF) Marathon that I'm doing with some friends in October, I made the hike up the perilous steps.\n\nEven though there's construction going on across the street, this place would still be great for a sit-down lunch date.  But then again, the weather has been so wonderful that I chose to order my food to go, and eventually found a spot outside a Starbucks on California x Davis.\n\nMy receipt was timestamped 1:56:43 PM, and my less accurate phone display read 2:02 PM when one of the cashiers handed me my order (#20 - Beef Vermicelli - $7.75 + $0.68 (tax) = $8.43 total).  I know that the dish isn't that complex (it's essentially all about layering noodles, fresh veggies and meat in a container), but still... DAY-UM! \n \nTheir vermicelli dish was pretty solid - the noodles had a great consistency, the sauce was pretty tasty, it had just the right amount of veggies, and the meat was well-seasoned, too.\n\nMy only complaint is that they don't take Discover, just Visa.  I know, I know... #firstworldproblems.", "author": "Iona C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "I've been to this place many times out of convenience to my office. Their dim sum is the worst I've tasted (I'm Cantonese). Today, I learned that they don't do veggies chow mein or chow fun anymore. The garlic noodles is below average and absolutely not worth $14. I don't plan to go back again.", "author": "Spa E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "I've walked past this place a thousand times but something about having to go upstairs/ not being able to see the atmosphere before going in always stopped me.  Man have I been missing out! \n\nFirst of all- the reviews of \"the line\" also prevented me from trying this place out, but what those reviews fail to mention is \"the line\" is to order your food (which is then brought to your table) NOT the line to be seated.  This means it moves quickly and after \"the line\" all you have to do is eat and go!  SO EFFICIENT and then you don't have to wait for your check or wait in line again- take that Pho Ha!  \n\nThe pho was good! Broth was authentic and the beef was fresh/ seemed to be good quality.  I think they skimped a bit on the side plate of mint and Jalapeños- but I'm sure I could have asked for more if I really cared. \n\nTip: they have a bar area so if your alone it's not awkward and you don't have to sit with strangers or take up a whole table! \n\nTip 2: the iced coffee is good but pre-made (they don't give you the traditional cup where it brews in front of you)- but it's still authentic and delish! \n\nTip 3: once you order go to the right of the register and get your free water/ tea, spoon, chop sticks and napkins (I felt dumb when I asked a server for them).", "author": "CJ T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-03", "description": "Go up the stairs, order and pay at the counter and seat yourself.  Also drinks and utensils are self serve.  The staff will bring your food to your table.  \n\nQuick service for those who are short on time.  But the food was very bland. I was craving pho and it was the only place I can get to since Pho Hoa closed.  It was very disappointing.  The broth had no flavor and tasted watered down.  They give you very little sprouts and basil leaves.  My experience here was not very pleasant.  \n\nI'll probably go back if I ever crave watered down pho.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Came in for lunch today after reading some good yelp reviews.\nYou really have to get in here before 12:15 else there is a huge line.\nI ordered the vermicelli with grilled chicken and  Mango milk tea. The service was quick.\nThe vermicelli was ok; nothing great, but the Mango milk tea was one of the best I have ever tasted till now. Great flavor and the pearls are soft and chewy.\nWill be definitely coming back for lunch.", "author": "Steffi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "This is definitely one of my go-to spots in the FiDi for lunch. I usually get the combination pho with brisket and flank stank and it has great flavor. Definitely a solid pho spot if you're in downtown SF.", "author": "Gary H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-14", "description": "This place is tastey. Been here twice. First time ordered the fried rice for dinner. I wasn't expecting chucks of meat, thought it would be on the side but it was good regardless. My bf ordered the pho. Taste okay. I don't think they have the broth right here. \n\nSecond time was today for lunch. It was really busy. I suggest coming after 1230. I ordered the special, i guess they have the same special all the time but it was delish. 5 spice chicken, rice and 2 veg rolls with sauce. I recommend trying that. Its really good. My cousin ordered the pho and she also said the broth was watery. I suggest not getting the pho here. Okay place. Maybe i would come back since its pretty cheap.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-30", "description": "Came here for lunch with a few friends during a regular workday and boy was it packed by 12:30pm. Definitely come before 12 if you want a seat. Seats are first come first serve and after you order, you get a number so they can serve you wherever you're seated. \n\nNot much to say about service since it was a help yourself kind of situation after you order. I had the beef pho with jasmine milk tea with boba for a bit more than $12. The jasmine milk tea was too bland for my tastes, but the tapioca balls were super chewy and soft. The pho was a bit bland as well, but it is served for a good price in the financial district. I ended up finishing my small bowl of pho and was very full on the way back to work. Lots of noodles and portion isn't too bad. The spicy beef noodle one was also bland for a spicy soup and definitely didn't have that bright red color they usually have in the broth. \n\nWon't come out of my way to eat here if I didn't have to but I don't mind coming back again for its price, it fills me, and it is equidistant from all my friends' work locations too. You have to walk upstairs to reach the restaurant but you'll need to make sure you don't walk past that small doorway entrance.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Best pho ever! Maybe not so authentic (they seem to be Cantonese, not Vietnamese?), but the soup is definitely my favorite so far!\n\nFive Spice Chicken and other meat-with-rice items are also good. They also have porridge which saved me when I was sick.\n\nGreat place for casual work lunch if you're not really in a hurry. There can be a long line during peak lunch hour. One of the best lunch options in the area for my Asian taste!", "author": "Felicia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-08", "description": "Great selection of Asian dishes - too many in my opinion.  I don't normally like going to a place that offers more than one flavor of Asian food.  Here you can get pho, tons of Chinese dishes, even chicken katsu and kalbi.  This worked out for the group of coworkers because everyone wanted different types of food and this hit that mark.\n\nAtmosphere:\nSeating was plentiful and the place was pretty clean.  Bring a sweater or jacket because it can be cold in there.\n\nPricey - the prices were high for Asian food, but the quality was pretty good.  I guess you have to expect to pay a little bit more because of the area.\n\nFood:\nFive spice chicken with pho - the broth was flavorful and the chicken was tasty.\nBeef chow fun - a bit greasy, but a big plate of food and pretty tasty.  The beef was tender.\nMongolian beef with rice - decent portion, flavorful.\n\nIf you have some time, it's worth walking up to Chinatown instead of eating here.  I'd still go back because it's close to work and they offer something for everyone.", "author": "Curtis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "Decent place for lunch in the Financial District. The service is efficient and the food is filling. Seating around 12:30pm is hard to come by, if you're looking to eat there. It's self service seating.", "author": "Beatrize O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "I always drag my friend here to eat during lunch. He thinks I am obsessed because it's my #1 favorite lunch spot during the work week.\n\nI always order Grilled pork vermicelli here (without the imperial rolls). It's about $8-9 and after you order you just hunt for a seat. It goes by pretty fast but there are times where it was so crowded I just don't even bother ordering because I can't find a seat.\n\nConsidering prices are so high around this area, getting a filling, delicious lunch for under $10, who could complain?", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "This place don't open saturdays i don't no why they post it as open BUT the food is good and it's pretty expensive but that's a given being in the financial district", "author": "Hector G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-04", "description": "I spent most of my time picking out the pieces of chicken bone, gristle, and fat. The place seems pretty dirty too.  The only reason I give it two stars is the food is pretty tasty and large portions.  Would be much better if they spent more time trimming and preparing the meat.", "author": "David B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-11", "description": "Close to $12 for some shitty wonton noodle soup!!! I work up in Chinatown and it will cost me not even $8 and taste a lot better. I Went there this morning and no waiter/waitress was there. I stood there for 2 to 3 minutes before someone came to help. I am hoping that I don't have to come here for lunch nor dinner.", "author": "Peter N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-17", "description": "The pho is decent, the service is quick and nice, and the utensils are all relatively clean. A little more expensive than Chinatown, but hey, we're in FiDi and this is convenient. ($9 for pho)\n\nThe only thing I HATE about this place is they need some new dishcloths! Every time they wipe the tables it smells like shit (puke mixed with bleach mixed with mildew). There's also flies all the time, so you're never really eating lunch alone! :) :(\n\nTheir jasmine green milk tea was SUPER good. Their bubbles aren't the greatest, but the drink part I loved.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-24", "description": "Short story: bland, pricey, but if you have to, do it. Come in no later than 11:30am or face the local lunchtime line-ups.\n\nLong story:\n\nIn the kingdom of the blind, the one eyed man is king. Perfectly describes in this case... This is one of the only average-priced Asian spots in the FiDi and so although it is rather average it attracts even Asian people to it.\n\nI ordered a rare beef pho, fresh spring rolls, and an original bubble tea. Total was $20 + tip = $23.00\n\nThe soup smelled promising but something was missing flavor-wise. The rare beef promptly got super hard (likely frozen before). The noodles were extra soft. It's not the best pho you will taste, yet if you really need some, you'll make do.\n\nThe spring rolls were okay. Nice enough. The peanut dressing watery and lacking flavor. \n\nThe bubble tea was nice, I liked that the original (black) tea base was bitter, but that's rare and many won't like it. It's not much sweetened either and they don't check how you like it. The boba were chewy and harder than the usual, likely not do fresh. Lots of milk. It's a fair enough cup - again - if you're pretty desperate to have it HERE AND NOW. If there are other options, go for that or take a quick ride to Chinatown. \n\nI give it 3 stomata for lack of flavor accuracy.\n\nThe place is clean, quiet, organized. They accept cash and plastic, they're quick to serve. It's not a bad spot, just not a great one either for those of you who really know good Asian food.", "author": "Morenita C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-23", "description": "We need more options in FiDi!!  \n\nI haven't been here in a while and was short on time so gave it a try. \n\nBeef chow fun (most entrees) is almost $13 inc tax. Won't complain that it's greasy because it's chow fun and you have to expect that. But $13 for 7.5 pieces of meat over oily noodles is a big rip off, even for FiDi. \n\nEntrees were about $8 only a couple of years ago and the food was barely worth it then when they gave twice the amount of beef.  \n\nDef plan ahead and walk the 10 min to Chinatown", "author": "Lena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-19", "description": "Came here with my coworker today for lunch and I must say, I would've not known about this place because it's pretty hidden. You have to go upstairs from Oasis Grill. \n\nI got the spicy beef noodle soup and let me tell you- it's SPICY. And when I say it's spicy, it's spicy! I was having a stuffy nose and the soup cleared up my nose! They do skimp out on meat *but what Asian restaurant doesn't?*. The soup itself is very flavorful even though you can just tell it's all spices in there! \n\nCome here a little before 12 and you'll find a table with no problem! They accept cards as well. Yay in my book for an Asian restaurant :)", "author": "Anny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "I had the pho beef soup and fried rice it was absolutely delicious, love that its across the street from the hotel were staying at. will go again.", "author": "Sandy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "don't let the sketchy stairway scare you away. I always meant to try this place, but I let that fear of the unknown stop me. not anymore though!\n\nonce you get upstairs, it's a normal little asian restaurant. walk up to the counter and order whatever you'd like. they have pho, other noodle soups, dim sum and Chinese/other asian dishes. they also have boba and a pretty amazing iced viet coffee that I had once.\n\ngreat lunch spot if you need that pho or noodle soup fix!", "author": "Evelyn S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-17", "description": "OMG.  I was so happy I found this place... Cuz the food is good and the price is decent... \n\nUntil today.  \n\nI should have known that this meal was jinxed from the beginning, when they got my order wrong.  I ended up not asking them to make me what I really wanted and just take the thing they thought I ordered.  \n\nIt was tasty enough, but it was already, by then, lukewarm.  I should have worried about temperature, but by this time, I was hungry, so ate it (plus, it was hot not that long ago?).\n\nTwo hours later... I'm having some grumpy tummy!!!\n\nStill gets two stars because of all the good memories... I mean, they do make a decent pho...  but I won't be back for a while...", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Chinese/Vietnamese food that is a pretty solid deal in the heart of the financial district. This is no yank sing, but a meal will also only cost you $12!", "author": "Richard C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-10", "description": "A disappointing return visit. I had been thinking about fresh spring rolls all week and went to HK&K since I knew they had them.  The rolls were fat and sassy, but mostly filled with what seemed to be shredded iceberg lettuce and vermicelli noodles.  There was no discernible mint or basil in the rolls.  One plus was the dipping sauce, which was nice and peanutty.\n\nI also ordered a side of su mai, which came out stuck together and rather oily.  Not so good.\n\nAs I am writing this review, I also noticed that they have a health department grade of 72 out of 100.  Yipes!\n\nI won't be going again until they get that rating improved.  Consider yourself warned!", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-08", "description": "Food is decent. I wasn't a fan of the sauce used on the chicken/broccoli rice plate. The congee is okay. My preference is the five spiced chicken over rice.", "author": "Elsie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-27", "description": "It was my first time here at Hong Kee. I was craving chicken porridge and thought I would give it a shot.  Considering that it is in FiDi, I didn't expect my food to taste phenomenal or cheap (Chinese standard). Well, but for $10 Chinese street food, I did have some expectation. It came out bland and tasted nothing like chicken porridge I have had elsewhere...", "author": "Yuki K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-02", "description": "I was super excited when I saw my friends get their meal first, huge portions!!!  Then I got mine...#30, Spicy beef noddle soup...I dig in, and it's mostly just broth, not a lot of noodles or meat.  So disappointing!  While my friends happily munched on their lunch, I was there slowly sipping my soup.  Most likely will not be returning again...", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-26", "description": "2nd story viet/chinese fast food place above Oasis Grill. I had bun thit nuong (bbq pork noodles), it was just ehh. The pork was super salty and the noodles tasted old and dry. I drowned my bowl with fish sauce to offset the salty flavors.", "author": "Jo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-11", "description": "I got the chicken vermicelli bowl and the food the other customers ordered also looked very good. I see this place being a great lunch spot to go to if you are by the ferry building and is priced pretty well. While there are other places that offer better food for the specific dishes, I could see myself using this as a go to spot due to the location and pricing. The service is fast and friendly here too. I would come back for lunches but not out of my way if I had a car.", "author": "Lily P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "If you're around the area and desperately in need of some noodle soup, this is the place for you. One of my favorites is their pho with 5-spice chicken or their wonton noodle soups. But, I only come here because it's the closest noodle soup spot near my work.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-03", "description": "I guess if you're madly craving Asian food in the FiDi during lunch hour, it's not a bad place.  \n\nThis place is lacking some warmth.  It's just a restaurant where you order at the counter, find a spot to sit, and they deliver your food to you.  It just looks and feels like an empty lobby that was switched to a restaurant.  \n\nThey have your typical Vietnamese dishes like pho, five spice noodles, egg rolls, Vietnamese sandwiches, etc.  However, they also have Chinese dishes too.. like fried rice, chow mein, and other stuff... It was very strange because with a name like \"Hong Kee & Kim,\" you'd think it's a Chinese restaurant.. \n\nI was more or less just confused.  I had the rare steak pho since it was a cold and wet day.  Eh... it was ok.  The flavor in the soup was definitely lacking something.  However, my friend's five spice chicken dish looked pretty good, so maybe I'll try it again.\n\nOverall, I don't think this will be my first choice for pho.", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-30", "description": "My review......\n\n\"Punt\"\n\nMy automatic rice cooker does better at home.\n\nBBQ Chicken is not suppose to be red inside.\nBBQ Ribs....cooked well done....BBQ Sauce....too sweet....some may like it....some may not.\n\nhttp://www.yelp.com/biz_photos/Q0i5oC2e5k0sZVCkgdR8Ig?select=MkptlPUfyPqZELhnoi4axA\n\nSeafood Soup (Pho)....just not my type of noodles....doesn't compliment....\n\nhttp://www.yelp.com/biz_photos/Q0i5oC2e5k0sZVCkgdR8Ig?select=fRyZz0U2t7wRGu5k_FiPSA\n\nShrimp Dumpling....My shrimp overcooked.\n\nhttp://www.yelp.com/biz_photos/Q0i5oC2e5k0sZVCkgdR8Ig?select=kFusoevXWc1G7USJB41bxQ\n\nHere is what was left of my lunch....\n\nhttp://www.yelp.com/biz_photos/Q0i5oC2e5k0sZVCkgdR8Ig?select=MjtwwBaNmjE2I48M4EajPA\n\n\"Punt\"", "author": "Alan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "I think this place has excellent Chinese food even though a tad bit pricey but I can't complain since it's a stone's throw away from my office. Definitely try the Wet Seafood Flat Noodle on their secret menu!", "author": "Jon W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "This is 3 stars for the financial district. Elsewhere,  it's like a 2 stars kinda place. \n\nSince Pho Hoa has closed down and been replaced by mediocre ramen, I reluctantly tried this place and was actually pleasantly surprised. \n\nIt's one of those self serve places. You order/pay at the counter, then you get a number, get your own utensils, sit down and wait for your food. \n\nI ordered the pho with brisket, tendon, tripe. It wasn't bad! I was expecting to be disgusted... I don't know why either... I think the fact that it's totally hidden, and you walk upstairs not really knowing what to expect. They have a bunch of other chinese food menu items along with the pho... it looked like a healthy portion for the price (esp in the fidi). \n\nIt's not bad... but it's definitely not amazing. The prices are decent, about $8.50 for my pho, not including tax. Since it's self serve, you don't need to tip either (or at least I didn't see anyone leaving tips, I followed suit).", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-20", "description": "This restaurant used to be called All Seasons Chinese restaurant but has now changed to Vietnamese/Chinese food. The offerings include but are not limited to\n\n*Typical variations of Beef Pho\n*Special Pho which has a broth that contains tomatoes \n*Fresh shrimp spring rolls\n*Fried spring rolls\n*Wonton noodle soup\n*Beef Stew noodle soup\n*Congee -- aka Jook, Porridge\n*Dim Sum such as shrimp dumpling, pork dumpling, sweet rice in lotus leaf\n\nOK, now for my experience.  I originally headed out there for some wonton noodle soup thinking it was still going to be All Seasons restaurant.  As I made my way up the stairs, I notice that they got rid of their hot food bar and the place looked newly remodeled.  I tried to order the wonton noodle soup but they told me that they didn't have the egg noodles that go delightfully with the soup.  So being that it was a Pho place, I ordered some pho & fresh shrimp spring rolls.  \n\nFood --- Substantially mediocre and not quite up to par.  Perhaps they should have waited another day to open so that the pho broth would be more flavorful. This place is ran by Chinese people and seems to lack the flare of authentic Vietnamese Pho.  The broth was lukewarm, bland and the flavors of cloves & star anise were a bit strong.  They probably should have left some fish sauce on the table to help with the blandness.  The only good thing about the pho is that they were very generous with the noodle & beef portion.  It really didn't matter though because it wasn't very good so I only ate a quarter of it. The shrimp spring rolls looked beautiful with a decent amount of shrimp.  They even shredded the lettuce to make it easier to eat however, they also added some shredded cucumber which I found to be strange.  Also, there was no pork in the spring rolls & the sauce was enough to dip only one spring roll.  \n\nService --- Boy O Boy.. they really need to get it together.  I ordered the beef & tripe pho but didn't get any tripe.  Trying to communicate this was extremely difficult.  I just wanted them to bring me a side of tripe but they kept wanting to take all of my noodles back.  Being the noodle queen that I am, I wouldn't allow them to do that since I knew that by the time they came back with it, my noodles would be soggy.  \n\nBefore my spring rolls arrived, they took away my number -you pay when you order & sit down with a number for someone to bring your food. When I explained this to the server, she wanted to see my receipt.  Well, the register gal never gave me receipt but thankfully I remembered my number...whew.  When the server arrives, I see that she brought me deep fried spring rolls....wrong again... so I sent them back.  Finally, they came out with my fresh spring rolls and side of tripe.  \n\nThe only reason this place gets two stars from me is because I sympathize that they just opened and that they finally got my order correct.  In addition, the girl that did speak English came back to my table to make sure that I received what I ordered & already paid for.  Although, I won't go back for the pho or spring rolls, I will go back to try the congee & dim sum which they offer for breakfast starting at 7am!", "author": "Wina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-06", "description": "I've gotten to the point in my life where a 2-star average rating makes me automatically scared.  However, last night I watched TLC's Virgin Diaries, and I can handle anything now.\n\nThis place actually wasn't bad for me.  There was no line when I went with my friend, and the seating area was about 80% full.  We ordered right away and found a seat next to the wall at a 4-person table.\n\nMy chicken noodle soup (basically pho ga) wasn't very salty and didn't taste like it was laden with MSG.  There were a LOT of noodles and a lot of dark-meat chicken, which was a slight surprise.  The bowl was a nice big size for $7.95.\n\nHowever, the broth was very one-dimensional and was a little sweet.  Even with a squeeze of lime, it didn't have a nice strong savory and tart taste that I like my pho broths to be.\n\nWe didn't encounter any problems with them delivering our food (they give you a number to take to your table).  There is free water next to the counter.  Get there early or later to snag a seat.\n\nBy the way, if you haven't seen Virgin Diaries, it'll probably make you never want to have sex or kiss anyone again.  Ever.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "Went here with a co worker for lunch during a cold day. We thought soup would be a fantastic idea!\n\nI decided to try the Spicy Beef Noodle Soup.\n\nThe broth had great depth of flavor rich in spices with a great balance of savory goodness. As for the noodles, there was a good amount to keep me satisfied. As for the meat, it was good but nothing amazing.\n\nSeating can be sparse so to go is a great option. Just head over to Embarcadero Center and take a seat over the bridges. \n\nOverall Thoughts\n\nGreat little place for lunch despite the limited seating when packed", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "This is one of the few places open late in the financial district. I typically order the BBQ Pork Ban Mi Sandwich here. I have tried the pho a few times when it was cold outside. They make a decent bowl of pho. The cold vermicelli is good with the BBQ pork over it. \nI have never dined inside as my orders are always to go. The staff is always friendly. Try this place out.", "author": "Marty M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "huh? where is all seasons? oh it's under new management now. No more chinese item take out menu but in exchange you can still order their classic's without much fuss. You also get a selection of bubble tea's and vietnamese offerings such as Pho or Banh Mi. \n\nMuch nicer layout with more space and ambiance with the remodel. I feel much better about sitting down for a meal here than I used to when they had the old look. \n\nThe food is still a solid 3 stars. No more no less. \n\nI'm not the guy that's gonna hype up the movie leading to a let down when it doesn't live up to expectations. This is a place you can get a full lunch under $10 bucks and you can get a very decent bubble tea to go while your at it. If you're clear and concise in ordering you'll never have to wait longer than 10 minutes for your food. \nYou'd have to walk at least 5+ blocks to get anything comparable to the value for asian lunch food options so I'm glad this place is here. \n\nLast note: Order rice plates to go. Order soup to stay. And if you don't know what you want then get out of my way!", "author": "Norris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-25", "description": "Four stars for what it is.  I came here for lunch with a friend.\n\nService was SO fast, and the girl didn't give me shit for not knowing what to order / taking a long time.  Portions were huge (esp the non-soup noodles... not sure what they're called).  I might come here again on a cold day because there's so much indoor seating!!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-03", "description": "I had been suffering from a craving for jook for the past two weeks. Finally, I decided to satisfy the craving by having lunch here since it was down the street from work. I ordered their beef jook, and Boyfriend got their barbecue pork fried rice and I eagerly sat there waiting, excited to soon be putting into my belly what it had been wanting for what felt like FOREVER.\n\nI should've just begged my mom to make some at home instead.\n\nI mean, jook in and of itself is rather tasteless. It's the toppings and added ingredients that give it the flavor (like preserved duck eggs and pork), but the beef didn't really add too much to the jook. Luckily, flavors did become a little more pronounced as I got deeper into the bowl (and after I did a little mixing when the jook wasn't ridiculously piping hot anymore), but I felt like it should've been equally flavorful from start to end.\n\nBoyfriend was also sorely disappointed by his fried rice. He claimed it was \"typical,\" and it was -- nothing that you couldn't grab at a Panda Express or something. He actually ended up grabbing soup instead to eat because he couldn't bring himself to finish the rest of his lunch. I wouldn't say it was flavorless, but there wasn't anything about it that made it spectacular. It was fried rice, with bits of barbecue pork chopped up and thrown into it.\n\nI have to agree with Boyfriend that we did choose probably the two worst dishes to judge them by -- jook and fried rice. I think I'm going to have to come back and try their pho or something before I pass an everlasting judgment on the place, though so far I have to say that I'm not highly impressed by what I've had.", "author": "Anna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "3.5 STARS. \n\nHong Kee Kim attracts a bunch of financial district business folk as they search for a good place to satisfy their Chinese/Vietnamese food cravings. They have a wide array of items here, ranging from congee and pho to beef chow fun and five spiced chicken. Banh mi, thai iced tea, and Vietnamese coffee to name a few others.\n\nWith so many different choices, it's easy to come here everyday, and I basically do. It's just so close and convenient! My go to is the salt and pepper spare ribs with fried rice (instead of the standard white rice) and a pan fried egg (add $1.25) to top it off. I know, kind of a fatty meal. But for just under $10, I'd say there's good value for what you get. Sometimes a long day of work calls for a little splurging in the calorie department. I'd recommend this for those who are struggling with choosing from their overwhelming menu. If spare ribs aren't your thing, their five spiced chicken special, which comes with vegetarian egg rolls, is a solid option as well!\n\nThis place isn't anything mind blowing, but I like it for it's convenience, good tasting foods, and just overall chill vibe you get here. The staff is very nice as well! So give it a shot if you're looking for something simple and easy in the area!", "author": "Jason T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-15", "description": "This is my go to spot when I'm working in FIDI. Nothing fancy about it, just good food at a decent price. It's located next door to Oasis grill (upstairs) off of Drumm st. The place is pretty open and spacious when you get upstairs. \n\nMust get: Spicy beef noodle soup. This is their take on Pho and it's my go to dish. The vermicelli bowls are all very good as well and the portions are great. They are not greedy with their pork chops thats for sure. Also try the mango iced tea.\n\nPS. The place gets pretty busy at noon so try and come a bit earlier or a bit later. I've never been here for dinner though.", "author": "William L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-23", "description": "The good: Quick lunch combo :)\n\nThe bad: The rice combo I choose was dry :(\n\nTips N tricks: If you want to go during lunch hour, you better order by phone first ;)", "author": "Karnis S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-10", "description": "Since the closing of Pho-Hoa, there are VERY few places to get Pho in the Financial District. \n\nDecided to give this place a try last week on a chilly day. I ordered the combination beef pho. It was just fine. I like that I was able to order ahead and pick it up. They're also open pretty early for those of you that like eating pho for breakfast. \n\nI did have to wait a bit for my pho. Given that it was a pick up order and I was the only customer, I'm not sure what that was about. Go in off-hours. I've heard this place gets crazy crowded during the lunch rush.", "author": "Casey M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-25", "description": "Got the wonton soup. It's pretty bland. And it only had four wontons in it. And a ton of cabbage. Maybe it should be called cabbage soup...", "author": "Elina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-18", "description": "I had the rare beef pho -- wonderful mixture of flavors, and warming on a chilly day.", "author": "Martin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-25", "description": "Disappointed!  No sticky rice in lotus leaf, no baked pork bun.  Only shrimp dumpling with uber thick skin and shrimp debris inside (membrane and dirty vein).  Not worth visiting for dim sum.  Also got the chicken sandwich - it was fine.  \n\nService was awful - \"no we don't have that....\", \"no, none of those....\",  did not bring water.  Yes, I know its self serve, but places that treat customers with courtesy have repeat visitors.  I won't be back.", "author": "Jaime O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "Had spicy chicken noodle Pho Togo.. Not so impressive. It's full of oil \nIf you are a great Pho lover, this is not the right place for you", "author": "Venkat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-16", "description": "The broth was delicious, the soup nice and hot, the noodles fresh, and the service pleasant and prompt.\n\nJust a decent amount of \"meat & assorted\", though so 3 instead of 4 stars.\n\nGreat price.", "author": "Stan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "A+ for take out, convenient, delicious, quick and cheap\n\nB+ for eat-in, people at our tables food came at different times, it got the job done for a quick convenient lunch, large menu, clean space", "author": "Nic S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "Life saving pho to the rescue.  Open \"early\" on Sunday morning, was able to get some pho for a sick friend, to go.  They were fast, I was in and out, and they were able to package the soup separate from the noodles.  Better so that the noodles don't get too soggy.\n\nThe restaurant itself is upstairs.  It's very casual.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-22", "description": "I'm sitting here currently having their beef noodle soup with steak and beef balls. I also had the fried chicken wings. The chicken wings were crispy and full of flavor. Granted, this will probably be the last time that I spend 5 dollars for 4 chicken wings though. Onto the soup...delicious broth that is slightly creamy. The steak was just the right texture and cooked just rare. What I did happen to notice (and this is my only complaint) was that the serving staff told me to get up to get my silverware, even though they served everyone their's.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "Came here at 11:30AM before the crowds for a lunch catchup with some law school friends.\n\nFOOD:\nGot the Grilled Pork Vermicelli and fresh shrimp egg rolls.\n\nVermicelli was ok- TONS OF vermicelli, about 8 pieces of cold pork. \nEgg rolls- were flavorless and mostly filled with more vermicelli; would not recommend these\n\nSERVICE:\nvery friendly and fast\n\nAMBIENCE:\ntons of seating here so shouldn't have any trouble finding a spot for 2-4 people during lunch\n\n-HungryHungryPongy (HHP)", "author": "Sangita A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-04", "description": "Their five spice chicken over rice is the dish to get here. It's their special and also their most popular dish because for $7.55, you get chicken over rice along with 2 egg rolls and broccoli. The boba milk tea here is decent, too. This place can get quite busy during weekday lunch, so expect a 10-15 minute wait for a to-go order. If you are looking to dine here instead, you'll have to order at the counter and then attempt to find a table. This can be a challenge, since it's not only very busy but also they're very slow with cleaning up tables from previous guests.", "author": "Celia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-02", "description": "Came here yesterday. Due to the warm-humid weather. I wanted what everyone wanted...A nice cold drink.  Got word that jamba juice was obviously packed.  So, I opted for a milk tea w/ tapioca instead.\n\nTapioca was chewy, milk tea wayyy to sweet.  I went back to the office and combined it with some black tea to take some of the sweetness out.  Overall it's okay but next time I'll be sure to ask \"less sweet\"\n\nHaven't tried the food yet, since I went around the evening time. Considering that fidi doesn't have much food variety besides the typical salad, sammie, and soup joints.  It's nice to have asian food and noodle soups for those craving days.", "author": "SF Giants Unite D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-19", "description": "So, the old place was replaced by the same people who used to run the now-called French Baguette. I noticed the same nice cashier and she said yes, we just moved here and took a new name and added stuff to the menu.\n\nThe food is ok. Not great, but not bad. If you are hungry and you want something quick, cheap, and filling, then come here. Great service, at the very least.", "author": "July N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "I seen this spot while walking during my lunch time.  Me and a couple of coworkers wanted some pho and I think this was the nearest spot next to our training facility.\n\nFirst off, the food. I thought it was good considering how busy this place is all the time. The soup was piping hot and we all got our food within 5 minutes of our order. They also serve rice plates too. I'll probably try 1 the next time I stop by. But overall, the food was good.\n\nThe service was fast and efficient, but like usual, not the friendliest service you'll get from a restaurant. This mainly goes out to the servers, but I'll give them the benefit of the doubt because its super busy. \n\nThe restaurant is located at an upstairs part of the building and is clean for the most part. Surprising it would be due to how busy it is. \n\nMy coworkers love this place, so I'm sure I'll he back. Highly recommended if you love pho and you're around the area.", "author": "Jerrold M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "Hi Tea and All Seasons made a baby, and that baby is HK&K.\n\n I like to walk in here, get my Pho, then moonwalk out.", "author": "J D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "This place is perfect to break up your lunch options of sandwich and salads. Right upstairs from the popular Oasis Grill they are incredibly fast. \n\nThere is seating is a good amount of seating or a fast takeout service with waiting area. \n\nIt's Chinese and Vietnamese so you can literally get Pho, Congee, Banhn Mis, etc. \n\nThe pricing is very reasonable for lunch. Under $10 is legit!", "author": "Anya R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "When you get that craving for some greasy Chinese-Vietnamese food and don't want to go to Chinatown to get it, Hong Kee hits the spot. Pretty good variety of dishes at decent prices (~$6-$9 per dish).\n\nFlavors are not bad, but -1 star for being too greasy.\n\nTip: The chicken in the lunch special is quite fatty and has lots of skin. If that's not your cup of tea, try the BBQ Chicken, which has much leaner meat.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-31", "description": "Not wheelchair or handicap accessible. My mother wanted to eat there and shes handicapped and unable to climb longs fights of stairs. It was unfortunate because the prices looked decent and its smelled delicious.....from downstairs.", "author": "peter p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-06", "description": "Place was empty at 6pm--usually not a good sign. I ordered the five spice chicken per Yelp recommendations. Speedy turnaround--7 minutes to carry out. The chicken was tasty, flavorful, with a nice crispy pan-seared crust (not breaking). Only $.25 up charge for brown rice which was very reasonable. The broccoli that came with my dish was too crunchy for my liking. Also, as I was leaving I realized I could have gotten the special with the egg rolls for only $.20 more--shame on the wait staff for not mentioning this. There was some grease to the dish but not overly so--not the healthiest thing I ate this week but acceptable for $7.88. Three stars for the extra grease and lack of up sell to the egg roll.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-03", "description": "Cheap and decent Chinese food in downtown San Francisco. Service is pretty fast and can get busy starting at noon. Come in a little earlier to avoid the rush. Menu ranges from basic Chinese dishes and even has boba drinks. No need to bus your own table as its done for you - not a full waiter service, but they don't bring your food to you and bus your table.", "author": "Robb J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-15", "description": "This place used to be All Seasons Chinese, one of my Fidi lunch go-to spots. Now HKK has emerged, supposedly brought to you by the same folks who ran Hi-Tea that used to be a few blocks over by Bush St.\n\nI've been to HKK maybe about 3 times now with a couple of take-out orders, and I honestly have to say that it's just \"OK.\" \n\nThe Good: No frills. Wait in line to order. For here? Grab a number and curve right and try to find an open table. To go? Take your receipt, keep left, find a chair and wait for your number to be called. I like their spring rolls here, especially the peanut sauce. \n\nThe Eh: The waiting. First you gotta wait in line to order. There are at most 2 registers open, and while the ladies hustle there, the lines just always tend to move sloooowly. Then you usually have to wait longer to get your food. I guess I just compare this to All Seasons that came before, because AS was way more efficient at getting the lines moving.\n\nTip: Do try to eat there if you can help it. They skimp major on to-go orders. I got the wonton noodle soup last week, and was appalled to find the small portion they gave me. Better yet, don't order the wonton noodle soup! Because the noodles tasted WAY starchy to a point it was almost inedible. My experiences eating in were much better. It's like night and day.\n\nWill I be back? Yeah, probably.", "author": "Jing D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-28", "description": "This place is convenient and okay; not great. My pho stock was a bit bland - where's the star anise? Same for the spring rolls; passable, not great. The peanut sauce could use more hoisin. \n\nConvenient, spacious and cheap. And good enough.", "author": "Bob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-25", "description": "This is like a dream.  My favorite spicy broth of Hi Tea with MORE noodles and MORE seating.  Kinda sad that All Season is gone, but they've really cleaned this place up and turned it around to be my new favorite pho place.\n\nI highly recommend the spicy chicken noodle and the spicy vegetable.  JUST GET THE SPICY BROTH, OKAY?", "author": "Light Bulb J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "Really like this reinvented spot I had banned for years after getting tired of the old greasy Chinese they served around 2000.  Found it's really a lot better now and the bbq chicken vermicelli bowl is perfect and if you use GoPaGo, super speedy for takeout and lets you bypass the line and the wait.  If you have time, though, it's nice to eat there and out of the big a roomy bowl they serve it.  I haven't tried the imperial rolls here, but the dish is big enough without them.  The chicken is very nicely flavored and pretty good quality.  There's a reason why this place has a good crowd willing to climb the stairs to get up there.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "I always get the vegetarian chow-mein here. It is delicious. They can make it a little spicy if you like it like that too. \n\nThree things I am not a fan of:\n1) The menu says $8.75 for their chow-mein, but they always charge me $9.75. Stop with the hidden costs or attempt to overcharge me.\n2) Their chow-mein doesn't come with free tofu. Come-on, I am paying $9-10. Throw in some free tofu.\n3) I like bok-choy, but reduce the quantity of it. I almost choke on big pieces everytime I order the chow-mein.", "author": "Saumya B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-25", "description": "Came in here thinking it was Korean, left not knowing if it's Vietnamese or Chinese food.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "This used to be a fast food chinese spot (All Seasons).  To my surprise I noticed some of the employees at Hi Tea working here, and she says to me, 'We are the new Hi Tea!\".\n \nYaaay. I missed the old one on Battery and the one that replaced that location isn't worth it.  We found ginger shreds in our pho there. The prices were higher and the menu was very limited. \n\nThis is the best you are going to get for fast food and price AND selection.  Do NOT expect the 5 star quality food.  This is a fast food place to cater downtown people quickly and cheaply.  I love it I am skinny on time and pocket.  The food isn't that bad there is nothing on the menu I have tried that made me throw up and people ask me what is good I say try whatever.\n\nThe extra star is for the wonderful service that I received from both locations (same employees).  They are very attentive, polite, and move very quickly.  They cater to ALL of my requests asap and the food is hot off the stove when I receive it.", "author": "Samrang N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-03", "description": "Ordered veggie pho...the ingredients were not fresh the tofu tasted terrible, the noodles tasted like plastic, and the price wasn't particularly low.", "author": "Max S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-24", "description": "Not going to lie, I've been waiting a long time for a good chinese restaurant close to my work. Hong Kee fits the part!\n\nPro's:\n-  I'm a huge fan of soup. Their won ton soup is hearty and tasty. \n- The fish congee is pretty good as well\n- Being at the hear of downtown SF, the price is pretty cheap.. \n- The customer service is not too shabby.. The cashier always has a smile on her face \n\nCon's:\n- They took away the steam table so every order is made when you get there. If you're pressed for time, you might want to reconsider.. To me, I rather wait a few minutes for good food than hit up subway day in and day out", "author": "Alan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "I've only had the grilled pork vermicelli here (with and without cha gio (\"imperial rolls\")), but I don't deviate from it because it is sooo tasty, huge and decently priced for FiDi. The pork is delicious, the noodles are perfect, and lettuce underneath is fresh and crisp.\n\nThe ambiance is very cafeteria style. You wouldn't want to bring someone here for a meeting but for a regular lunch out it is just fine. Nice for friends as their are no waiters hovering over you.\n\nNot good for large groups. Seating 3-4 is tricky as it is.\n\nWill eat here many times again.", "author": "Hope W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "Been here a good number of times, and the food is all pretty decent. Pretty good portions if you're hungry. Prices are pretty average for being around the financial district.\n\nService is pretty good too, everyone is very nice. Obviously, lunch hours get very busy, so if you're not one for the crowds, plan to come before or after noon.\n\nI suggest getting the spicy beef noodle soup, especially on a cold San Francisco day. It's probably my top food item on their menu, but their rice plates are good too. They probably give only 1 or 2 pieces of broccoli (which is pretty much a downer), but you can ask for more and they'll happily give you another 2-3 pieces, lol.\n\nI'm giving this place 3 stars simply because I've been to better asian places before, and this doesn't compare very well, but is still a place I'd go to eat, especially working in the FiDi.", "author": "Vincent A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "When Hi Tea closed, I was a bit traumatized. I remember it like it was yesterday. I walked towards the door when I noticed a crowd of 8-10 people. They were as confused as I was. Why is the door locked? What's the sign say? Why aren't there people inside? Where am I going to get my quick, tasty, conveniently priced rice plate? \n\nWell, Hi Tea is back and what an improvement!\n\nThey're now across from the Hyatt (where All-Seasons) used to be. The horrifying buffet line is gone. And the restaurant has new tables and chairs. And they make bubble tea? Nice.\n\nI've been here twice now. First time I ordered pho. Reasonably priced and tasty (Pho Hoa is doomed). Not the best pho ever but good for FiDi. Tasty, non-greasy broth. And the house special had book tripe and tendon, not just meat and beef balls. Could have used more beef and less beef balls (settle down, please). Thumbs up.\n\nI'm currently eating the grilled pork and egg roll rice vermicelli. Hot crisp egg rolls and tasty grilled pork. Yum.\n\nI've taken a couple of bites of the beef congee. For $6, not worth it. Decent flavor, but very little beef. And they don't have any white pepper. (They do have Chinese donut for an extra $2.50.) Maybe when it's winter and I'm sick and in desperate need of congee.\n\nA good lunch option if you don't feel like dropping $15 at the Ferry Building... Take out and a short walk to Justin Herman Plaza is also a great option on a nice day.", "author": "Marcus W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "Reasonably priced lunch place in Fi-Di with plenty of seating and vegetarian options--I'm sold.\n\nThis is my favorite place to eat on a cold, foggy day.  I've come here for lunch a few times and the service has been fast and the food tasty.  They have vegetarian pho with veggie broth available upon request.  I thought it was bland, but that's nothing sriracha sauce can't cure.  Other than that, they have a list of veggie-friendly entrees, good egg rolls, and mostly everything under $10.  There are plenty of delicious meat things on the menu too, which makes the company I tend to keep happy.  I'm a vietnamese sandwich whore and this place enables that, too.  HK & K ftw!", "author": "Jatinder S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-06", "description": "Guess Hi Tea relocated here. Best Vietnamese food you going to find in this area, which I'm not saying its spectacular but good enough when your craving some Pho or a Vietnamese rice plate. \n\nThe go to for me is the lunch special. \n5 spice chicken over rice with a couple emperial rolls for 7 dollars and some change. \n\n2 stars + 1 star for being the only decent one in the area.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "The first time I came here for lunch, I walked past a line practically wrapping around the corner for one of Hong Kee & Kim's downstairs neighbors. I felt super smug ... until I walked up the steps into a line at least as long as the one outside. My first impression was one of organized and efficient bustle. Servers carrying cafeteria style trays clearly calling out numbers as business people lean in with excitement, hoping that it's their turn to receive what they paid for. The line moved quickly up the stairs, giving way to a tidy, almost cozy looking spot to catch up with coworkers as you gulp down your pho. Despite being crazy crowded, the noise level wasn't so bad, which I attribute to the acoustic tile ceiling taking the sharp edges off of neighboring conversations. \n\nGenerally I get take out, so atmosphere doesn't matter to me so much as the little touches like how fast my order arrives and what they include in their to-go packet, and I have to say, it's impressive. The addition of a packet of sri racha sauce with my order of dumplings was very much appreciated! The pho has a nice broth for a base, not quite flavorful on its own but hearty when taken in concert with the sprouts, lime, and assorted meats the complete the dish. The noodles that came with it were surprisingly good: soft without being soggy, flavorful without being salty.\n\nOverall, Hong Kee & Kim is a solid addition to anyone's lunch repertoire.", "author": "Aaron Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "Lunchtime Munchies near work, a list of noms over the last 3 weeks:\n-Beef Pho Noodles\n-Salt and Pepper Spareribs\n-Mongolian Beef\n\nIt's nice to see a decent and affordable asian place open up near work.  Does it deliver?  Yes, if you're not a fan of the nearby competitor, Pho Hoa.\n\nCompared to Pho Hoa, the vietnamese noodles are better prepared and more fragrant, rather than relying on the old MSG and salt trick.  Still, a lot is left to be desired.  The broth, in comparison to many good pho places, is a bit bland and lacks a lot of beefy flavor that makes a good bowl of pho.\n\nThe salt and pepper spareribs were alright too.  A little too soggy once it got to my table, and it could really use another side to cut the fried flavor a bit (pickled cucumbers and white carrots maybe?) .\n\nThe mongolian beef was good too, and it mixed well with the rice.  Just a tad salty.  What Americanized Asian food isn't nowadays though -_-...\n\nService was fine, though it's obvious from observing the service of others that the staff has a lot to learn.  Still, I got my food in a timely manner.\n\nOh, and if the owners/staff are reading this, please, for the love of god, close the front door.  It's absolutely freezing in there in this winter weather. bbrrrrr\n\nOk, for a FiDi asian restaurant, it's 4 stars.  Anywhere else and this place is lackluster.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "Food is 3-4 stars, but for combo of location and large servings leans towards a 4.  I usually get beef congee (jook, rice porridge) - folks into authentic can get preserved egg and pork [all these years in the Bay Area, still haven't got the taste for gelatinous eggs in my food :^( ] or I get spicy beef soup (pho).  Tried the five spice and grilled pork, and they are fine too.\n\nCrowded during 12-1pm (lunch), so if a big group (2+) gotta go early (before 11:45am).", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-17", "description": "They have the best spicy pho, and always get the seafood one (it's not the freshest seafood, but what do you expect for less than $10?).  I only get this pho here,  I wouldn't try anything else.  It's not the cleanest place around, I have heard of complaints.  But it's a pho place, I think they are all the same, cleanliness wise.  Just order the pho, and you are good to go.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "I love their Spicy Beef Noodle Soup. Best hangover food ever. I'm also a fan of their Katsu Chicken & their fried egg rolls. I come here often for lunch and I will continue to do so. Staff is friendly, food is good so they'll be seeing me often.", "author": "Joane B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "I had the Vietnamese pork sandwich and my wife had a spicy noodle soup with chicken. Both were great, as was the Vietnamese coffee. We'd come here again.", "author": "Ran M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "A-OK.\n\nThis place is upstairs and then a big open space.\nOn one back wall is the register and menu. There's a fairly comprehensive selection of food, enough to cover all bases. Prices are also very reasonable for this location.\n\nThe place has no character, the lighting isn't great but then I guess you don't come here for that. Quick and cheap this place is tops.\n\nFood quality is ok. The food is more than edible but my beef chow fun was more like beef bean sprouts. Why? I am sure there were more bean sprouts than hor fun on my plate. Shame as it's pretty good otherwise. Beef is tender, I feel there is msg present but you will only find that out later on!!\n\nSpicy chicken noodle soup, broth was ok, chicken was tasty but by no means the best we've had. It's good for 3 stars overall. It is pretty fast on the plus side but a little lacking in the food quality on the downside.\n\nThe one restroom is hilarious. There's a key on the outside with a strong attached to it. You have to open the door and go in with the key or anyone could just open the door and come in?! Then you have to put the key back or no one else would ever be able to get in. Odd.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-09", "description": "What I like about this place is that it's spacious, clean, and affordable! Sure, it's not the best tasting food but good enough to fill you up for lunch for less than $10.\n\nWhile I was eating my Vietnamese sandwich, I looked around at what other people were having and everything looked BIG, they are not shady on the portions.", "author": "Emmie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "I come here a few times a month to get my Pho fix, but it's just ok. Just enough to get me through. Not bad, just not great.  The rice plates are decent as well. \"Phood Nation\"", "author": "Sean J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "Pho and 5 spice chicken, the only 2 dishes I ever get here. Hkk is a good option if you're looking for some solid Asian food in the financial district. The service is quick, food is aiite, and the prices are reasonable for downtown sf.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "This is hidden away on the second floor, occupying the space that used to be All Seasons.  The review is for lunch only.  \n\nThey're fast, even during the lunch rush.  Their specialties are their Vietnamese dishes, especially their soups; they still offer a small Chinese / pan-Asian menu, which you should avoid, and I am not factoring into this review.\n\nTheir soups are very, very good - five star worthy.  I especially recommend their spicy vegetable soup and their \"Special beef soup\".  For $8, in this location, they're both a very good deal.  \n\nThis review is part of a series on lunch places near my office.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "Haven't been back in this part of town in a long time and ordered the won ton soup.  Delicous, delicous, delicous!!", "author": "Liz H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Good pho, but probably a bit more expensive than it should be. I had the spicy seafood pho and it had more seafood in it than most other pho I have had. My order was to go and I was walking out the door within 5 minutes at lunch time on a Wednesday. The place used to be a shabby Asian restaurant but it has been renovated and re-purposed in the last couple of years.", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-24", "description": "This is a good option for Vietnamese or Chinese food for lunch in the financial district. Their prices are reasonable and the food is good. Keep in mind, this is a quick lunch spot type of place so it is nothing fancy in terms of decor or service. I recommend any of the beef phos, wonton soup, vermicelli bowls, and the preserved egg congee. I've had the chicken pho and spicy seafood noodle soups before, but those weren't as good.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "Ehhh....ordered the porridge. It was a very big bowl. Nothing special or mind blowing...", "author": "Tikisha O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "I was staying across the street at the Hyatt with some colleagues when we needed a quick lunch and found this place.  Hong's is one of those out of the way places that aren't visually simulating or impressive but have rock solid food that will surprise you.  Three of the five colleagues who came to lunch wiht me were Asian, and ALL of us loved the food. We all ordered different dishes and all of it was very good. While you don't want to come here for fine dining if you're looking for very good Asian at a very reasonable price I would recommend this place in a heartbeat.  Enjoy....", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Super fast service, good portions and really good affordable pho! Don't know why it's not more packed in here", "author": "Kim H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-02", "description": "Service was great, really sweet people which is why its hard for me to write this. but the pho was very sub par, tasted bland/not like real pho brother. i had the pho with meat balls. meats balls were a bit chewy/fatty for my taste. and i have had a lot of pho in my life...i know whati m talkin about.", "author": "Thach N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-19", "description": "I feel like I'm nit-picking but I just had to update my review.  I dined here recently instead of ordering take-out and to my dismay I had a much different experience.  First of all when you ask for water instead of ordering a drink they don't bring it to your table, I suppose it's self-service.  Second of all, after patrons leave they don't clean the tables.  I sat in a corner for 45 minutes observing the workers and they did not clean a single table.  They just picked off the food from the table with tissues, yuck.  It made me question what else in the restaurant they're not cleaning.  Very grossed out.  My table was oily and slimey and now I know why.", "author": "Amber R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-03", "description": "Great location.  Food could be better, though.  Also, this restaurant does not make notations for spicy foods on the menu so for those who do not like hot/spicy foods, it's trial and error.", "author": "Virginia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-25", "description": "There used to be a Chinese place here, which I truly miss.  I started coming here as soon as they opened....and have been disappointed every time.  I only get take out since when I get released from my job, it's usually between 2pm and 4pm and the whole place has always been completely empty except for the service girls.  The girls are always very sweet.  However, everything I've ever gotten from here has been sub-par, even for Chinese food.  Plus it's always taken them close to 45 mins. to get the food to me, even just a cold salad.  There are other places to eat around this area so I've stopped going here.  Plus there's this stairway you have to climb to get up there, and then you have to climb down it and it's kind of steep; my old knees aren't always happy to do that climb anymore.  If I want Vietnamese, I do the 5-6 block walk to Sai's.  If I want Chinese I'll go the Henry's Hunan, another easy walk.  They could do do much more with this restaurant but they haven't which is so disappointing.\n\nMarch 2015.  So, it's been a while and I'm still going here.  It's not Chinese, it's Vietnamese!  They have some Chinese dishes but it's done Vietnamese style.  It makes a difference to know this.  Ok, I find their pho has a kind of anise taste to it.  Not a bad thing, just different.  They also do a wor won ton.  Their rice dishes are ok.  I still don't understand that with all these Asian vegetables we have available in this city why they have to resort to broccoli--too many Vietnamese eateries do this.  Their dishes would be so much better if they'd use napa or Chinese broccoli at least.  And the keep removing entrees from their blackboard.  The food is good since there isn't another Vietnamese eatery real closeby (the bun mi shop in Embarco 5 sucks! threw out 2 sandwiches from there (I think it's called LIttle Saigon?)).  The other pho place, Soup Junkie, on Market has closed.  Oh me, oh my.  Good thing I have a few good Vietnamese places near home, just wish I could get my fix while at work too.  Oh, but Hong Kee will do.  The young women are all very nice.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-10", "description": "A OK place. Nothing stands out. Pho soup is too plain, and sandwiches aren't that good either.", "author": "Kihoon Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-06", "description": "I suspect a lot of the other dishes are fine, but I was really disappointed by my chicken pho. Cheap, nasty chicken, remarkably greasy broth, and the curious addition of tomatoes and cabbage.  I wouldn't complain if it were cheaper, but for $8 I should get nice tender chicken breast, not consistently chewy gristle, and a broth that relied more on fresh flavors than grease. It almost had a Ramen quality to it, very far from homemade.\n\nTo be fair, the service was fast and friendly and the place seemed popular.", "author": "Mat S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-06", "description": "went there today.  ordered spicy mixed vegetable soup under \"vegetarian choices.\"  brought back to office.  it smelled fishy, like it contained fish.  I called.  they confirmed it has fish sauce in it. i bought it back.\n\ni am a vegetarian but not an angry one.  i assume that an item under \"vegetarian choices\" is vegetarian.  this is bullshit.", "author": "pete c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Easy, convenient lunch spot in the heart of the Embaradero Center area. Definitely go a little before noon to beat the Fi-Di lunch crowd. Lots of variety to choose from. I usually like to get the special five spice chicken with fried imperial rolls. Definitely affordable.", "author": "Phillip D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-05", "description": "Meh pretty much sums it up. I thought it was the All Seasons with a badly needed remodel but it appears to be Vietnamese. I had the wonton noodle soup. The broth was OK, the noodles OK but the shrimp wontons.... the meat they bundled around the shrimp tasted like sausage. Not sure I'll be going back here.", "author": "Hitomi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "I like the Vietnamese sandwiches and BBQ pork vermicelli they have. It's pretty decent and the prices are ok. It's not as cheap as other Vietnamese places in inner richmond but it's good for the financial district. It's also much better than the old chinese place that use to be here before! They also accept GoPaGo!", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "This Vietnamese/Chinese breakfast and lunch restaurant serves a variety of food (congee, dim sum, banh mi, salads, pho, vermicelli bowls, etc.), but I've only tried the pho so far.  The takeaway packaging is definitely similar to Hi-Tea's with handy tupperwares (one for soup, and a separate bowl for the noodles), and all the condiments you need.  The combination beef pho definitely satisfied my noodle soup craving, but the broth was pretty lackluster.  For dining in, the seating area is really large, so it's great for groups or eating on your own.  I'd come again only because of the convenience factor, but not because the food is spectacular.", "author": "Audacity L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-01", "description": "This place sucks. I arrived upon opening, ordered, and received my meal quickly but -- if I have to add 2tbsp of sriracha and hoisin to the broth then it isn't good broth. I tasted it beforehand and it was flavorless and watery. The noodles were really starchy, the brisket was undercooked and too fatty, and they skimp out on tendon and tripe.", "author": "Zooey I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "Hong Kee & Kim adds much needed variety to the Asian cuisine around the Embarcadero.  The Vietnamese and Chinese cuisine here is authentic, albeit unspectacular and rather salty.  The restaurant interior is somewhat dim and nondescript, though it is clean and orderly.  Given the few dinner alternatives and the early closing times of other neighborhood restaurants, Hong Kee is certainly a welcome addition.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-03", "description": "Close to work, the prices aren't FiDi ridiculous & they conveniently have jook & a bowl of pho when need be for my yearnings. 2 pluses for me.  They have authentic jook with salted pork & my black eggs.  Yes people I am one of \"those\" .  Secondly, pho that they allow me to customize to my fave tendon & tripe ONLY.  And get this there's no extra charge for this or that when I tweak my hot bowl o' beef noodle soup..Uh Hem *Pho Hoa* I will not be paying you another visit anytime soon.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-02", "description": "tried hong kee today after finding out they'd just opened. The menu and pricing is what I've been looking for near the office.\n\nGot a bowl of pho that was so-so. The soup was a bit hollow, if you eat pho you know what i mean. My beef also had a slightly weird taste to it - nonetheless i finished it anwyays. I'm hoping the owners read the reviews and adjust their recipes accordingly. BTW this place is chinese owned (I know because im chinese too, ha) \n\nA coworker got the grilled chicken + egg roll over rice. He said the chicken was great, but the egg roll needs work. The fish sauce was a bit sweet too. \n\nAll in all I'd go again, we still havnt had the vermicelli yet and theyve got a long list of menu items. The space is big and the service was fast, plusses for the work lunch crowd. Both our items were less than $8 so that was also a plus.", "author": "pato m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "This place is a gem in the fidi.  It is cheap, fast, and delicious.  I had the pho ga (chicken noodle soup), and it was super tasty.  The broth didn't taste msg-saturated like some other pho places -- it was a nice change.  It's a good alternative to Sai's.", "author": "tiff g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-18", "description": "To go with my \"it's really not a cold, *cough*\" I needed serious chicken noodle soup with wontons (chinese style, but not greasy).  I got exactly what I was craving and envisioning.  So happy I can walk over easily during lunch to try more.  Noodle soup season is coming!", "author": "Olivia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "This is my go-to place whenever I want Chinese/Vietnamese food within walking distance from my office in the Financial District. Honestly, the pho can't compare to some other places that one might go to in a more Asian neighborhood, but for the location and price, I'll choose this place over some other nearby shops anytime. I really like their spicy beef noodle soup as well for the days I'd like a bit more of a kick to my food. The preserved egg and pork porridge is good, though some may feel it runs on the watery side, but I don't like overly chunky and thick porridge either. I think the five spice chicken and the grilled pork chop with rice are both pretty yummy and well portioned. So I give this place a 4/5 star based on price and flavor for the location it's at. There are definitely other restaurants that are better if you go farther out in SF or down over to San Jose, but this place has treated me well for many lunches and they have quick service.", "author": "Becky C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-19", "description": "If this is actually the new Hi Tea everybody with low stars is on f*&$ing drugs. Hi tea is amazing. I am coming tomorrow. Spicy chicken noodle soup all around. Go to hell, vegetarians, you obviously dont know whats good for you..... or you wouldnt be a vegetarian.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Solid vegetarian pho, loved the spicy broth. Filling and comforting, and especially good for the price point.", "author": "R. O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Lunchtime with a few friends near work, and came to find that they have my favorite item \"Beef with eggrolls in Vermicelli noodle\".  It was a fair amount of food and the price isn't that bad for financial district.  My friend had the spicy broth noodle and she actually liked it too.  \n\nThis place actually wasn't bad at all.  I think I'll make this luncheon once a week.", "author": "Susie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "Hong Kee & Kim occupies an impressive space on the second floor of its building, impressive because it's spacious and bright, and altogether too nice for the type of establishment they're trying to run. Props for being one of the few places in FiDi where you can, without too much trouble, find a table for a moderate-sized group. In fact, I think they're under-utilizing their space, as only about half of the area has tables. The other half is given over to people in line and waiting for their to-go orders.\n\nI found my beef banh mi as tasty as any other I've had, and filling. At $5, it's also one of the cheapest meals to be had around my office. Unfortunately, my friends' entrees didn't look too good. One of them got some chicken and rice dish that came with very suspicious-looking eggrolls. They looked like eggrolls that would come with your Swanson TV dinner. I would say check this place out, but think carefully before placing your order.", "author": "Angela X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "First time getting lunch from this place. The food I ordered was great; turned out to be way better than expected. I will be buying ongoing lunches @ this place. You do have to provide adequate time to get your food because they only cook when ordered. For to go's, you should call and order before heading over.", "author": "poogs d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "Amazing. Went here not expecting much, but the food was delicious! It was carefully prepared, well presented, and tasty. And it was affordable. Definitely coming back when we're in the area. Service was super nice, too. :)", "author": "Erin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Given the location and price of the food, this place is pretty unbeatable.  \nYes, the pho isn't the greatest... but probably the best you'll find in the area, so just deal with it.  Awesome comfort food.  \n\nThis place is definitely my go to spot for their GRILLED PORK SANDWICH (definite must try) and their milk tea tapioca is very consistent.  \n\nBest to just call in to place your order and then go and pay to avoid having to wait.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-19", "description": "do i seriously have to ask you for extra bean sprouts and lemon each time? 1 star for skimpping so much on the food. \n\nAnd seriously, do u know what I extremely hate about restaurants.?... Restaurants who don't leave their napkins out... where do u think we are? Vietnam? \n\nHere's a tip for ALLLL you restaurant owners... conserving a few hundred dollers on napkins really pisses the customers off b/c they have to ask u for napkins. That's no way to do business, if you're smart, you'll notice that restaurants with good reviews all have their napkins out.. so, won't u just not be cheap? u will earn more reputation (money), if u stop being cheap,", "author": "Mr. AzzHole A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "This pretty great little place for lunch.  The Pho was great and chicken noodle dish was delicious as well.  It's convenient if you work or live near the financial district and usually the wait isn't too bad.  I'd recommend it for visitors as it's not too touristy.", "author": "Carly H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "Theres a good variety of Asian food and Vietnamese sandwiches, lots of indoor seating, and they take credit cards. Food is alright.", "author": "Melody L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-08", "description": "awesome breakfast combo.  Fresh good congee and dim sum for $6.  Price - quality - location are all good. Self serve not a big deal", "author": "Mia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "This place is pretty good for the location and price. Came here at the suggestion of a coworker and was pleasantly surprised. If you don't pay attention when you walk by, you can miss the entrance as the restaurant signage on the building is on the second floor. \n\nIt's pretty obvious that they didn't spend much thought or $$ on the TIs but food is what I'm reviewing. I got the lunch special - 5 spice chicken and 2 spring rolls over rice for $7.87 including tax. The food was slightly bland but I don't like the salt bomb taste of most Asian fastfood-type restaurants so it was good. The order came out pretty quick so no complaints here.\n\nAll in all, it's more like a eat quick and get out, rather than enjoy the ambiance (don't have none) type of establishment. They have quite a few selections for the lunch items so I will probably return.", "author": "Shikshin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "Vegetarian \"pho\"!!!  That actually has flavor!  Make sure you ask them to \"make it vegetarian\" if that concerns you.  The ladies who work the counter are always courteous and on top of it, even during the mad lunch rush.  I've only gotten my food to go, but the wait has always been manageable.  Also, you can call ahead.", "author": "Jorie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "Much, MUCH nicer than the chinese restaurant that was here before!  I went here today for the first time and overall the service and menu was good, but the spicy chicken pho was not all that great.  It was a strange color with not a lot of flavor (and NOT spicy) and had lettuce and tomatoes and other random ingredients in it.  Not a fan.  In all fairness, my co-worker had the pork with rice,  which she really enjoyed.  I will definitely be trying something else next time.", "author": "Justine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-15", "description": "I wanted to love Hong Kee but I couldn't. I had spicy pho which was underwhelming. I also ordered pork buns once and it took an hour after they blamed it on my friend for ordering the last one (huh??). Another time they forgot to make my food. Every time I come here something goes wrong. It just wasn't meant to be.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "The new Hi-Tea!!!!\n\nI am in love with their Spciy Chicken Noodle Soup! It's perfect for a cold winter day in SF. Just the right amount of spicy.\n\nGrilled pork with vermicelli and egg rolls are super delish as well.\n\nSo glad I found this place, I come here atleast twice a week now.", "author": "Anon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "Decided to to try this place after hearing from a friend that these were opened by the same owners as Hi-Tea. Had their Spicy Beef Noodle Soup.. they gave a lot of noodles, not so much beef.. the beef was not the rare beef ones you would have with pho, but instead the ones you would have when eating chow-mein..I'm ok with that, but would prefer to have rare beef instead.. also, the soup was really spicy which was great!", "author": "Linda Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-01", "description": "The food is all right.  But our order took over 30 minutes to come.  And when one of the plates came, it was wrong.", "author": "Margaret H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "This place is right next to my work and I had been here a few times when it was All Seasons Chinese.  I had the spicy chicken noodle soup and it was just what I needed for a cold day.  The broth is delicious and the portions are pretty big.  It is definitely one of my favorite go-to noodle soups for lunch and I plan on coming back again.", "author": "Connie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-10", "description": "Good, high volume, no frills Asian restaurant.  You probably want to leave your skittish non-Asian friends back at the office though.  Keep aesthetic standards low, but food overall tastes good.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-21", "description": "I hate to write such a poor rating for a new Asian fast-food restaurant in the financial district.  I think the concept of a multi-Asian food restaurant, mostly Vietnamese and Chinese food, is great, especially in the finacial district, but the execution was not so good.  I waited for at least 25 minutes to get my take-out order, chicken chow mein, and there were two other people who had ordered the same item waiting before me.  After hearing the person behind the counter say that the wait would be at least 15 minutes for chicken chow mein to another customer, I asked them how much longer my order would take.  You would think that if so many people were ordering the same item, the cook would make a bigger batch to give all the people waiting for that dish.  They finally came out with my order, but the other person who had been waiting before I ordered had been waiting for 35 minutes already, and he was still waiting after I left.  The food was not too good either.  The chicken was tender but the noodles had a very smokey burnt flavor to them.  The other disturbing thing is there was a piece of hair in the bag my food came.  Going forward, if I am in the mood for Asian food, I will just look to Pho Hoa or Stone Korean Kitchen which is fairly fast to take out and tastes good.", "author": "Lisa M."}
