{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Superbasic, supercheap.  Good service.  Never had to wait for a table.  No noticable decor.  Food arrives quicky.  I worked in the area and developed a fondness for the Beef with Black Bean Chow Fun that lasts until this day.  Delivery is fast, food always hot.\n\nLimited choice of drinks: hot tea, ice water, canned soda.  Don't know if they serve beer.\n\nAccessibility: front door is flat on the sidewalk and aisles are roomy.  Door is usually open.  The tables are suitable for wheelchairs, and there is room to put a walker.  To get to the bathrooms you have to go down a narrowish hall and make a sharp right, which is a problem.", "author": "SF Disability Awareness N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "Decent food for the price. Not outstanding but the prices are good and delivery was efficient.\n\nHad the fried rice, tad dry but soy sauce did the trick and wonton soup was tasty and filling. The wonton soup not only had large 4-5 wontons but also vegetables and bbq pork.\n\nProbably one of the better Chinese restaurant hole in the wall in terms of delivered food.", "author": "Carmen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "I avoided Jade Cafe for awhile because a friend told me he didn't like it. Then I had another friend who usually has good taste in food mention that he liked the place, so I finally went and I'm glad I did!\n\nFood:\nThey had probably the best chicken chow mein I've ever had (and I always order chow mein). The noodles were the perfect texture and the dish wasn't super oily. I also ordered the BBQ pork fried rice, and it was yummy but I would've liked the pork to be a little crispier and I added extra soy sauce -- not a huge deal though, I'd definitely order it again. I also ordered the succulent spicy pork with garlic sauce, this was good but I always forget that the garlic sauce for this dish is supposed to be a little sweet so just an FYI -- I'll probably order a more savory/salty entree next time. Lastly, their chili sauce on the table was good and would go well with potstickers.\n\nCustomer Service:\nI don't understand why this place gets such a bad rep for customer service. The waiters were really nice and would fill up our glasses of water often. One of them also came by and asked us how the food was. When you dine at an authentic mom-and-pop Chinese restaurant, you shouldn't expect good customer service, but this place treated my party really well.", "author": "Wendy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Really good food! My husband and I  are staying in San Francisco for his job we come from Los Angeles,we order from Jade café and it was delicious  everything was great... and paid cash at the door for delivery", "author": "Karla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "Jade isn't trying to be any fancy authentic Chinese food. It's well priced and good cheap fast lunch. Reason why I'm giving them 4 stars is cause I love the workers here. They are all Chinese and I've noticed how they engage their customers. They even speak Spanish to their Spanish speaking customers.  Real nice staff", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Looooove this place! The food is amazing! I always get take out and when I come in they are so on top of it and always have my order ready to go!!! Best Chinese place I've been to in the Bay Area! Portions are also pretty good!!", "author": "Brooke H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Great value for what you pay.  Lady owner remembered me from 5 years ago.  Wow!  What I loved about this place is that they treat everyone with respect, whether you are white collar or blue collar, nationality.  It doesn't matter.  They just concentrate on being an affordable Chinese restaurant, And they do it well.", "author": "Phillip L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Was craving hot and sour soup the other night but I didn't wanna leave my cozy bed ha. So I picked Jade Cafe on random from the many Chinese restaurants on Postmates. There's always a risk doing this, but sometimes you get something great - unfortunately this wasn't one of those times :( The hot and sour soup wasn't \"sour\" enough - that vinegar-y flavor was mission, and it just tasted like plain bland soup with a bunch of vegetables and tofu. Would not recommend the soup. However I also ordered the shrimp in lobster sauce - which tasted exactly like what I expected, not super special but good enough.", "author": "Farrah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "This place is pretty good. Rice plates are around ~$7.50. It's a typical hole in the wall.", "author": "Ardee A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Why is it that the \"whole in the wall\" restaurants seems to dish out the best meals? I'll have to add Jade Cafe to this list! I won't let the \"76\" score scare me off! In addition, I didn't have an MSG reaction after eating here. Another plus for J/C! Not really concerned about rude waiters or waitresses; I'm there to eat and that's all that matters to me when I'm hungry! Of all the times I've eaten at J/C I've never had a bad dinner yet.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "The restaurant smells like cigarette. I think the cooks smoke in the kitchen. The smoke spreads to the dining area. It's not acceptable. The owner needs to stop that", "author": "Bk L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-24", "description": "I placed a order of chicken ,rice and pot stickers .This is what I received  3 and a half ate one with dirt and hair inside the box, that's is very nasty and unsanitary, I called for the delivery driver to come back pick up the food ,and give me my money back and my tip money back the owner of the restaurant stated that's she did not care that's the order came this way and that if I want my money back I had to bring the food back and receiving my tip back was no a option. everyone save your money please do NOT eat or Order food from here .", "author": "Keidra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "If you're vegetarian, you must try the Kung Pao Tofu.  It is the best that I have tried (and I've tried that dish at several restaurants in San Francisco).  BUT, you must eat it at the restaurant or within a few minutes that it gets cooked.  Otherwise, the tofu will become soggy and the taste will alter and it'll be just blah.", "author": "Ms D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "I give it 5 stars because it really is the tastiest damn Chinese Food EVER!!! I could care less how they look or act, food is \"da bomb\"", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-17", "description": "I ordered beef with oyster sauce a few months ago from Jade, but it doesn't taste right. If you are a Chinese grown up in China, you will know how beef with oyster sauce supposed to taste. However, this dish had a very odd taste and it's nothing close to the original. Maybe the chef is from other China province, it's not too big of the deal. Couple days ago  I decided to give it another try, so I ordered BBQ pork with tofu for lunch assuming there is no way to F this one up. Guess what? I'm wrong. The BBQ pork tasted OK, but they managed to use tofu probably expired long ago and already turned sour. I'm OK due to I didn't eat any of the tofu, but my co-worker got sick after lunch. Food safety is a big concern. I will definitely NOT recommend this place to anyone I know.", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "Let's be honest.  If you eat here you shouldn't be expecting perfection.  This spot is a greasy nasty probably dirty classic SF Chinese restaurant.  The condiments are sticky and waitress are rude.  But that's what makes this place great.  The food really isn't bad if you can get past all the little things.   Affordable old school Chinese food. Suck it up and get in there before this place disappears and becomes another yoga studio or Kombucha cafe.", "author": "M B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "Don't order from here, personally I've ordered here tons of times, but lately they've been taking a while with the orders. There drivers are extremely rude, and expect good/great tips from you. They don't even wait to give you the change first before you give them tip, they just expect to take the bills sometimes without even asking for change back. I just ordered recently, and they forgot  the sodas I've ordered, and I could've sworn the guy accidentally left the sodas in the car, and since I gave him only a dollar he decided not to even remind me once he got back into the car, because I heard his voice behind me as I walked in, then when I turned back he just drove off. It isn't the first time they charged me for about 4-6 dollars of soda and forgetting it, despite me STILL tipping there driver even if they get rude with me.", "author": "Philip R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Ordered chicken wonton, and mixed vegetable with chicken and steamed rice. The food was good. I like that the mixed vegetable dish has pieces of ginger. Really enjoyed.", "author": "Donald B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "Very unprofessional. I've pre-ordered my food 1 hour before the restaurant open and the app said I will get my food at lunch time. They called me up said we won't get you your food until 1:30pm. 1 and a half hours late is very unforgivable and they still dare to tell me that they won't take any responsibility and I need to call the app to cancel it by myself. How can you handle your business like this? I placed order before anybody else but I need to get them the last because I'm far away from your restaurant? Shame on you.", "author": "Saharat S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-14", "description": "Not good at all\nFood burn/Mongolian beef\nBeef chow mein no flavor\nBad customers  service", "author": "Margarita L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "Le bf and I discovered Jade Cafe via Eat24. Our previous go-to Chinese delivery place was City Chopsticks. \n\nWe usually get the chicken chow mein, hot and sour soup, golden pot stickers, fried egg rolls, and Rainbow Chicken. The chicken chow mein is definitely a solid pick. If you enjoy chow mein, definitely order it from here. The hot and sour soup is ok, not as good as City Chopsticks. The depth of flavor isn't there. Everything else is very solid.\n\nWe will continue to order from Jade Cafe when we crave Chinese delivery. \n\nPro tip: Don't order from this place on Chinese New Year. We did this past Lunar New Year and they not only messed up our order, it also came 80 minutes later than it was supposed to. At one point, Eat24 stopped the restaurant from accepting more delivery orders because they were so far behind.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-29", "description": "Average Chinese food.\nQuick, no frills, sometimes too bland. But ok for fast bite.\n\nThe waitresses all have the attitude of \"here's your food, hurry eat and get out of my restaurant\". So I just don't leave a tip.", "author": "F B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-20", "description": "Where's the Beef ? I ordered some Mongolian Beef from here and there were only a few tiny slivers of beef in the dish  scattered about hidden amongst some onion and mushroom made to look like beef . This dish was absolute rubbish for $9.75 I won't order from here again\n\n*salty\n*burnt tasting\n*didn't include chopsticks\n*lots of rice and vegetable very little beef\n*vegetable overcooked to resemble beef instead of standing on their own\n*sad,  drink lots of water after eating this", "author": "Ann Oyed .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "Came to eat here because our usual spot was closed (the Chinese restaurant next to mission cafe campus) this place was horrible the soup beginning is good but when our plates came out I noticed the chicken had a nasty flavor to eat wasn't fully cooked ! I lost appetite . And there were many flies roaming around in this place . Never again wasted my money and lost my appetite .", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "Poor quality\nPoor service\nPoor environment \nPoor hygiene\nNothing good about this place\nSf typical style", "author": "GQ G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "I came here as a nice lunch with the family. It was pretty good. The rice was the best. I also liked the orange chicken.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Came in for lunch on a Saturday afternoon since I was closeby. Ordered the shrimp fried rice - good portion for the price. The food was okay, the employees were polite, and the service was quick.", "author": "AK _."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "Jade Cafe is my mother's go-to Chinese greasy spoon so I pick up food there on the way over.  Usually get won ton, chow mein, etc.  Food is pretty good but not spectacular.  Generous portions, little on the greasy side, but overall good value.  Typical indifferent service of a Chinese restaurant.  Easy parking.\n\nWill continue to to go there on the way to Mom's but wouldn't go out of my way for it.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "Not so bad for what they charge\nA place where is for everyone\nAffordable\nNot bad customer service\nGood parking area\nClose to shopping plaza", "author": "Chef C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "I like this Chinese restaurant. My favorite are the plates with vegetables and tofu. I like the hot sauce.", "author": "Yovana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "I came for the food which is always the best. I've traveled to many places and their combination won ton soup is the best I've ever had. The food is so good that it makes up from the lack of smiles from the workers.\n\nThis is one of my top 5 restaurants", "author": "Keith A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-14", "description": "Ordered from Delivery.com. Order was cancelled.  No explanation given.  Had to scramble to get food for meeting.", "author": "Scooby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "My go-to chinese restaurant. We always order the beef and bok choy chow fun, cod and veggies over rice, shrimp fried rice, and if you order over $20 you get a free chow mein! They're won ton soup is really great too.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-12", "description": "I ordered vegetarian chow mein to go and when it was ready they threw my order on the table and turned away. That was totally rude. \n\nOne woman behind the counter was yelling in Chinese after I made my order. I think they were upset I didn't order more. I just wanted a simple meal for myself. \n\nAfter I ate I was still hungry. I could have bought a better noodle dish at the safeway around the corner for cheaper. So much for that 79 health rating. \n\nMy fortune cookie said \"You deserve to have a good time after a hard day's work.\" It's true, I worked a long hard day on Saturday to have my food thrown towards me? I do deserve better... \n\nWhat ungrateful, hypocrites.", "author": "Rich A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-17", "description": "This place is disgusting. Flys everywhere inside and the food gave my a stomach ache after I ate it", "author": "LaChelle W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "They never delivered my order and then when I tried to get an explanation the woman I spoke with was rude and wouldn't give me a straight answer. I'm kind of glad it didn't work out because their food safety score is apparently pretty low.", "author": "Kristen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "A bunch of co workers were craving chinese food. And we decided to try this place out. The price and portion is pretty resonable. But the food was on the slty side", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-27", "description": "Mouse poop in your food....I once picked up a to-go order and when I opened the chow mein container, there was mouse poop mixed with the noodles. It explains why they are now under the scope!", "author": "Eliana B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "Please beware! Went to have some lunch at this location and was shocked to discover a roach in our food! The worst thing that can happen when eating out. Department of Public Health has been informed and will be inspecting. Looking out for anyone out there that decides to give this place a shot. Also a lot flies by the entrance! Close the door or something. SMH.", "author": "J M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-11", "description": "DO NOT EAT HERE!!! Disgusting!!! First the cook wore her gloves to the bathroom then came out with the same gloves on not washing her hands, after being shocked at that I walk back to my table and my 11 year old son shows me a bug in his food GROSSS!!!!! I showed the lady and she expected me to pay for it", "author": "Frances R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "This place has very rude employees... Tried calling for delivery and the person who was taking my order was very short and replied with attitude. Jeez, made me feel like I was asking her for free food. Will not be ordering from them ever again, or even walking in to their restaurant.", "author": "Karen G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-31", "description": "OMG \nI like this place for Take Out but never will I ever eat inside the restaurant ever again, their table service absolutely is the worst I have ever encountered.  My partner and I had to wait and effing wait 20 effing minutes just for a waitress to come take our order. \nJust stick to take out and you won't be aggravated by the lack of service", "author": "anita b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Some of the best Chinese I've had in recent memory... Delivery was super fast, food was all fresh and delicious. The salt and pepper spicy prawns are amazing (ask for them without the shell IMO) although not spicy.... Mongolian Beef was also fantastic! Will definitely be ordering again... And often.", "author": "Dennis P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "I usually order the generals chicken over white rice which is pretty good. Runs about 8 bucks if you're picking up your own food and the wait is usually about 10 mins. Nice seating area if you want to sit inside.. Just a bit too noisy for me but your call.", "author": "Priscilla S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "I'm big on \"atmosphere\" when I am going out to eat. The first steps I took in this place I stepped on so many crumbs.. the floors looked like they hadn't been swept, let alone mopped in weeks. Their menus provide no pictures, just one sheet of laminated paper.. slow service, everything looked dirty. All 3 adults agreed that we could not bring ourselves to eat dinner there. So We had dinner next door instead!", "author": "Nikki K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-03", "description": "So disappointed. Came to eat with my girlfriend on a Friday night. Biggest mistake ever. I was starving hadn't eaten hardly anything all day. Just to come here and get a very rude waitress.. She was rushing me and my girlfriend to order. And when we weren't ordering fast enough she would walk away.. It took about 20 mins to get me a glass of water. Not to mention over 40 mins to get our food. We saw people that showed up after us get there food way before us. Food was good but service was terrible. I dnt recommend coming here on a busy night. I personally won't be coming back.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-02", "description": "Food was good and reasonably fast. But there was food and even a spoon on the floor where we sat. No prob tho, I knew what to expect.", "author": "Tattiana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Yes this place is the real deal, best Beef Chow fun.   Have never been able to find decent chow fun since my favorite Hakka place closed but this is it.   Wonderful,warm, and friendly. My go to place in SF.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-11", "description": "I'll be the first to admit that their food tastes good. MSG will make dog food taste good, too. \nEvery time I come here, SOMETHING goes wrong. Either they forget something, the ladies are never in the best of moods, the \"78\" food score, or I have to wait for my online order. \nIt's discouraging because I want so badly to like this place.", "author": "Reed S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "Honestly I don't give a damn about the poor safety report.. First Chinese food place I've everrrrr gone to where they make your order on the spot. I actually had to wait for my food to cool down a bit. My favorite would have to be the spring rolls so hot and crispy! Delicious!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "Women that work there are always in the bad mood yelling accross the restaurant. They sit you at a table and dont even greet just ask \"what do you want\" in the rude tone! &still have the nerve to demand tips!!\nPaying the tab they say \"we didnt charge you the tips pay tips\" wth dont bother going to this place is horrible. All you hear at every table \"tips tips pay tips.\"", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "The pan fried noodles with beef and broccoli turned me into a hungry dog.  I could not stop eating this dish. Four stars for this dish alone.  Family style and very plain inside but who cares?  I was too busy snarfing the broccoli beef on heavenly half soft, half crunchy noodles.", "author": "Thelma Lee G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "If you want tasty Chinese food to go or to eat, this hole-in-the-wall restaurant is the way to go.  Reasonable price, generous portions and above average Inspection score. Conveniently located, this greasy spoon is popular in the neighborhood.", "author": "Smjoe F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Love the food and love their service. The house special fried rice is amazing. And if you have cold order their hot and sour soup.", "author": "Madhubanti B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-24", "description": "After 75 minutes, the food arrived missing an item. The egg rolls were soaked with grease and tasteless. The Mongolian beef was way too salty, overloaded with mushrooms, and lacked both flavor  and spice. In addition, the sauce had spilled all over the bag, soaking everything in it by the time we opened it.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-20", "description": "I really like their food but do yourself a favor and pick up the good yourself the delivery driver begs and I mean begs for tips and when you give him a tip he asks for more money how rude", "author": "Malaina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "I've been here around 10-15 times for lunch in the past few years. The Chinese food is average, but it's never bad. I would rate it very high on the comfort scale. It's simple, enjoyable, and reliable food. You can order a single entree with rice, and it's enough to fill you up.\n\nAnd at $6-8, it's a bargain lunch. I recommend any of the mixed vegetables + rice dishes.", "author": "Nathan Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "THE FOOD IS SOOOOOOOO GOOOOOOOD. But the service isn't the best. Waiters are kind of mean so I just order for pick up. It isn't the cleanest place so I'm doing myself a favor eating the food at home anyway.", "author": "Oscar T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "I am a very big fan of Mongolian Beef! Every time I order Chinese food I order mongolian beef, but its never cooked right. I love a lot of chili peppers and onions. I decided to order it from this place and I feel in love! The meet was tender and had plenty of flavor. I called in my order when I was maybe 10 mins away and it was ready when I go there. I haven't tried anything else from this restaurant but I do recommend this place if you like Mongolian beef.", "author": "Johanna G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-25", "description": "I will NEVER order from here again.!!!! The customer service sucks and the man who took my order did not follow directions. Its to the point I want to say write in ENGLISH SO THAT I CAN SEE THAT YOU GOT MY ORDER RIGHT!  I ordered Mongolian Beef over rice NO mushrooms light onions HEAVY GRAVY, Prawn Fried Rice NO EGGS NO VEGGIES just green onions, Chicken Chow Mein NO VEGGIES, Oyster Beef over rice NO VEGGIES. They gave me an extra order of prawn fried rice regular with everything in it, another prawn fried rice just the way that I ordered  but they forgot to hold the shit (feces) in the prawns, the prawns felt overly swetty like soggy moist, no gravy at all on my mongolian beef, veggies all through the chow mein, and the bathroom had a lil turd (feces) on the floor. I will completely slap the piss out of myself before I EVER come back here", "author": "SHRONDA J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "This place is solid. I honestly came here because I didn't feel like really cooking and I got their sesame chicken as well as eggplant in garlic sauce. Both were a-ok and exactly what I expected. Not amazing, but just good, decent Americanized Chinese food. What I ordered lasted me ~5 meals, which was amazing. So much food for so little and was just pretty alright and good. I'd go back. Service was good too. Nothing too great, but not horrible. Just your normal hole in a wall type of restaurant that was physically a lot bigger than a normal hole in the wall.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "BEWARE!!!!!!!! \n\nTHIS PLACE IS DISGUSTING!\n\nI have ONLY eaten the \"house rice\" from this place and have never tried any other dish. I also had never been to this place in person before last week as coworkers and such would usually take orders and pickup for everyone. \n\nI called and placed an order in advance for the house rice. The lady who answered the phone rushed me to place my order and then quickly hung up on me!\n\nAbout 20 minutes later I arrived to pick up my order and I was shocked when I walked in! This place is FILTHY! Now, I am all for a good \"hole in the wall\" restaurant but this place takes things to a whole other level. The floors, walls and celiling are dirty and there are stains and cracks everywhere! \n\nI waited for about 5 minutes at the front counter to pickup my food before I was acknowledged by anyone. The front counter was old, dingy and covered in paperwork. There was a lady standing behind the front counter bagging phone orders and I noticed that she was putting fortune cookies into each of the bags with her bare hands!!!! (BTW: The fortune cookies at this place are NOT individually wrapped).\n\nOf course, my order still wasn't ready so, as I waited and observed the lady bagging the phone orders I SAW HER KILL A FLY BY SLAMMING HER HAND DOWN ONTO THE COUNTER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! \n\nSHE THEN WIPED HER HANDS ON A PAPER TOWEL AND PRECEDED TO PLACE FORTUNE COOKIES INTO THE BAGS WITH HER BARE HANDS!\n\nAbsolutely disgusting!!!!!!! I said nothing and walked right out! I will NEVER return here and have placed everyone I know that eats at this place on HIGH ALERT!", "author": "Andreea M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-19", "description": "Pros: Cheap\nCons: Everything else!!!\n\nThey missed our wonton soup from the order. I called the driver immediately as he had just driven away - he said he'd call me back in 5minutes and drop off our soup, but he never did. Awful service. Check your order before you hand over the cash!\n\nSo to the products that we DID get... The chicken chow mein was greasy and totally flavourless. Literally no sauce what so ever. Hardly any veggies to add colour and very poor quality \"chicken\" pieces. Avoid!\n\nThe pot stickers were very soggy (a result of the very long delivery time sitting in a plastic container) but it was made even worse because the dumplings dough was very thick and the fillings very scarce, so they were mostly just flavourless mush. Avoid!\n\nThe chicken curry looked good with lots of veggies (again just a few scarce pieces of \"chicken\") but when I tasted it I instantly recognised the curry sauce was just a very plain and basic madras curry powder. Avoid!\n\nSo we paid for 4 items, got 3, even after instantly telling the driver. 2 were so bad we left them after a taste, and the final curry fish was mostly just an overpriced container of veggies.\n\nI guess you buy cheap, you buy twice! :-(", "author": "Liam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "So I work in the area and always try to find cheap eats.  This place is it!  Usually I just order a lunch plate which includes some meat, veggies, and rice and I end up paying $6.40 for take out.  \n\nIf you do want to try anything here...Order the Beef Stew Curry for lunch because I tell ya...there's something in there that makes you want to keep eating it...all for the magical price of $6.40!", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-02", "description": "DO NOT EAT HERE!!!!  I found several hairs in my food. So so gross\n\nWhen I went back in to tell them they were not at all surprised, just asked if I wanted another one. I should have known with all the flys buzzing around this place what the food would look like!\n\nIf I could give negative stars I would.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "I'm a FAN.\n\nWhen I'm in the area or don't mind traveling to Jade's on a lazy Saturday- I do it!\n\nGREAT prices. I order the SAME THING every time. lol \n\nHoney Walnut Shrimp, Chicken Friend Rice, Chicken Chow Mein and sometimes Egg Rolls. Portions are pretty huge so when I order this it's for a family or friends night in. \n\nMy food is ALWAYS fresh. Never had an issue with my order. They usually throw in free stuff. The lady of the house has a dry humor so beware if you aren't use to it. I think she's hilarious.\n\nThe place isn't ever packed so come anytime.", "author": "Drea W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "I wish I can give this place no stars!!!\nLack of customer service!\nLack of food safety \nAnd this place is just dirty as hell! Ugh \nNever coming back again!", "author": "Taiana T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-01", "description": "I have been going there for over 25 years and when I order off their eat 24 menu... I don't get the order I requested and when I called to tell them the person who answered started arguing with me...terrible customer service...it will be the last time I go there!", "author": "Kathy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "OMG!  Great, fresh food!  Best Mongolian beef, sesame chicken, hot and sour soup ... So good!", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-27", "description": "Tried 3 different dishes here on several occasions.  This place is a small family owned Chinese restaurant.  I'm assuming there's no MSG in any of the dishes since they didn't taste salty.  In addition, the food weren't very greasy (surprising!).  Here's the dishes.\n\n* Roasted Duck Noodle Soup - Best bang for your buck on a cold winter day.  Chinese style roast duck pieces with noodles.  Broth was pretty good.\n\n* House Chow Fun - Sorta bland but for the price you pay, you get a good amount.  Add some chili oil and you are set.\n\n* Salt & Pepper Pork Chop - Mmmm good stuff.  You can't mess up on this unless it's soggy.  Fortunately, it wasn't soggy and wasn't too salty.", "author": "Ronald L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "I have come to this place for the last 15 years, I just love their food and it's the only Chinese food I eat. I have known the servers for so long that it feels like family every time they walk in ( we come every week) They even speak Spanish!!! My kids love to come here ! Their fried rice, tofu with veggies and hot and sour soup are the best I have tried....", "author": "Marcela M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "Rude typical uneducated hostess. Mice droppings everywhere. Don't ever come to this place. I heard on the next table , this louth hostess, saying \"Tip, tip! to a customer leaving!\"! It was hilarious. If it were only available to leave no stars, I would have done that. Do yourself a favor, don't even glance at this place. And spread the word.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-19", "description": "People are rude and the service is very poor. And most importantly the food is disgustingly dirty. Never going back to this place again.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-26", "description": "Well I should've checked the yelp reviews before ordering from this place for the first & last time. Not so stellar health inspection records. Will I get sick? We'll find out.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-08", "description": "Decent, inexpensive Chinese food.  One caveat being that if you want to order food Togo it is much quicker to call then to use the yelp24 app.  I don't think they are super tech savvy especially when they are busy...", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-27", "description": "There was a dirty pinkie fingernail in the shrimp fried rice that I ordered to go. DISGUSTING!!  Beware...", "author": "Rhonda G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-03", "description": "This restaurant is okay for some fast and quick Chinese food, especially if you live or work in the area. IMO, it's not really anything special, but it's not bad and it's filling and has pretty good portions for a very reasonable price.", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-22", "description": "I work across the street so this place was very convenient during lunch. Not to sound racist but typically Asian restaurants have bad service but this place takes the medal. \n\nI order the Mongolian beef, very good. But when I ordered it, the older lady who seems in charge is saying things under her breath. Negative things, the majority of my friends are Chinese so I know the bad words when I hear it. So I don't tip. Ever. I continue to go here for lunch and I order my food. Parties come after me and sit, their appetizers & entrees come out before mine.  So I hate this place.  2 stars because of the Mongolian beef & they deliver.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "They were really nice. I ordered for pick up and drove from my job which is on the wharf when I got there my food was ready and super fresh I then drove home and I was happy to see that my food was still hot I live right near daly city so I had some ways to go to make it home and the fact that when I opened the containers to what I knew was going to be a delicious meal and I saw steam release I was over come with pure intensity of what was about to hit my taste buds and just as I expected the food was great the chicken chow mien was bomb the beef and green beans with black beans sauce was great and the sweet and sour chicken was great to but I would like to see them not put so much sauce next time it was kind of a over kill I'm gald I'm not dibetic because I would I been in a coma by the end of the frist bite of that sweet and sour chicken  lol hope this helps", "author": "Marie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-13", "description": "SEAMLESS DELIVERY REVIEW:\n\nI would say this is a \"if you can't do it well, do it big\" kind of place. \n\nFOOD:\n\nThe food was incredibly low quality, but the portions were massive. That doesn't make up for it though if you don't want to eat what they're serving. I had a bbq pork noodle soup, and snow peas w/ water chestnuts. The broth of the soup was good, but that was pretty much it. noodles were super soggy, pork was mostly fat. The snow peas were steamed w/ no dressing, just a tiny bit of garlic. \n\nOVERALL:\n\nFood came on time, so I guess there's that. They also wouldn't come up to drop the food off, the office manager had to go down to pick it up. That's lazy delivery.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-19", "description": "Health Score: 71 out of 100\n\nAging and dirty. This place is so dirty that the restaurant's fish tank needed some seriously cleaning. With algae, green gunk and other filth, the kids wanted to see the goldfish, but not being able to with all those nasty and clouded debris visibly on the tank.\n\nThe food was just below average, the waitress was constantly talking so loud and her spit was flying into people's food as she carried on her conversation and served the food.\nI should have known with all the flys buzzing around this place what the food would look like!\n\nBe aware, their phone etiquette and the deliver guy are even worse.\nWell, a youtube I found listed below, That's what you want to say to them.\nWarning: contains strong Languege\n\nhttp://www.youtube.com/watch?v=PSEYXWmEse8\n\nOh hell, I feel great saying' it.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-14", "description": "If you're looking for some cheap Chinese food, this is the place to go. I came here with two of my friends after work, and it satisfied my hunger, although it definitely wasn't the best Chinese food I've ever had. We ordered the sweet & sour chicken, the potstickers, and beef & broccoli pan fried noodles. The potstickers were good, though the wrapping was a little thicker than I'm used to. The sweet & sour chicken were smothered in sauce, so I ended up trying to wipe some of it off, but the flavor itself was good. The beef in the noodle plate was very tender, the broccoli was cooked just the way I like it, not too crunchy but not too soft, and the noodles were also very crispy (except the parts that were soaked in sauce at the bottom of the plate.\n\nThis place is definitely very affordable ($23 for 3 people) and the portions are huge. The service was good, except one minor blip where they forgot our potstickers, but upon realizing that the dish was missing from our table, they immediately brought it out for us. Since the restaurant isn't in an Asian district, it's not top notch Chinese food, but it certainly satisfies one's Chinese food cravings for a very good price.", "author": "KC W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "Visiting the mission found this little hole in the wall. The food  is delicious the service was great. The score on the wall said 78 pay no attention to  it, it's YUMMY!", "author": "Heredia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "I've been eating here for years.  The food here is really good, consistent but the place is a total dump.  Go figure!!!!  The prices can't be beat and the ladies that work here are nice, welcoming.", "author": "B W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "One of my favorite lunch spots, super friendly staff, low price menu, and decent quality for the price. Always looking forward to the soup and the fortune cookie!", "author": "Arnold Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "For those of us that work near 3rd/4th and Market, Jade Cafe on Geary St. was your easy place to go to if you needed quick fix of Chinese food for lunch.  My co-workers and I would always order for pickup from this place for countless workday lunches over the past 10 years or so.  So, it was kinda sad that location closed.  \n\nLuckily, they had a sister location near the Potrero Center on 16th and Bryant.  Last week I had a craving for their Mongolian Beef over rice (my old usual).\n\nI placed an order  through online on Seamless via Yelp.  Placed an order from the luxury of my own home and told that it would be ready for pickup within 15-30 minutes.  The order placed rather easily and uneventful - as it should.\n\nWhen I came by the order was ready, they had you sign that you picked your order and off you go.  Overall, the food was the same as it was before.  Yummy and it did the trick.\n\nWould order online from Jade again the future!", "author": "Raymond G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "Ever notice that many Chinese restaurants stopped serving rice plates after lunch?  They think they can outsmart the customers by forcing them to order the plates and the rice separately ($$).  But ever notice that these restaurants are usually empty during dinner time?  \n\nAll those restaurants need to learn from Jade Cafe.  They serve rice plates from lunch to dinner.  End of story.  Viola!  Customers!!  I can go to some other restaurants and order a plate of Mongolian Beef for $7.50 + rice for $1.50 = $9.00, and end up with too much food for one person; or I can order a Mongolian Beef rice plate from Jade Cafe for $6, with the right portion.  Which way do you think I'd go?  Which way would you go?  I rest my case.\n\nBesides this is not a typical bland Chinese place out in the hood where there are few Chinese.  No, no, this is a genuine Chinese restaurant where the food has \"wok hei\", y'all!!  You will not go out of your way to dine at Jade's, but if you're in the neighborhood and you have an urging for good rice plates, this place will surprise you.", "author": "Uncle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-27", "description": "This review is not for the food, because I did not get to taste it.\n\nI don't care if you don't speak English well.  I can probably still understand you.\n\nI also don't have the same expectations for cheap carryout as I do for fine dining.\n\nBut, I do expect to be treated a certain way when I am a customer.  I stopped here because it's on my way home from work.  No one greeted me, but that's ok.  I helped myself to a menu and sat down.  One of the wait staff barked at me \"for here?\"  I said \"to go, please.\"  They then proceeded to ignore me.  \n\nThe final straw was when the people who came in afterwards had their order taken while I was still being ignored.  I left.  They still didn't say anything to me.", "author": "Bruce S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-10", "description": "We have had bad luck with this place in the past but hope springs eternal so we try again every 6 months or so. This is the last time. Told one hour, didn't arrive for 1:30. When it arrived it was completely cold and one of the containers had broken so the bottom of the bag was just a soupy mess. Never again. The food is really bottom of the barrel to begin with so the only thing they have going for them is that they deliver and sometimes you just need greasy american style chinese food. Literally NEVER again.", "author": "KK H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-24", "description": "Despite that I found one black hair in my food and I showed to the lady, she didn't take it so seriously.. I used to came more often then I do these days..\nThey seemly do what they are told .. The owner is a nice guy and I'm not going to stop coming here just for a single hair..Unless a find something else..\nI only eat here the \"magnolia beef\" I usually asked it to be prepared on light sauce and they do a pure good job..", "author": "Pedro D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-01", "description": "1.  Review of delivery from Jade Cafe.\n\n2.  Easy to order on Grubhub.com\n\n3.  Mongolian Beef - The meat was tender but oily.  It was rather bland. The portion was large.\n\nhttp://tinyurl.com/3uhazyj\n\n4.  Steamed Rice - The rice was clumpy.\n\n5.   Chicken with Mixed Vegetables on Rice  - I did not like this dish.  It was extremely bland.  I did not eat it.  Who knows?  Maybe, after drinking later on, it will taste better.  The portion was large.\n\nhttp://tinyurl.com/3lzpogn\n\n6.  Delivery took a little over the estimate.  It was just over an hour.\n\n7.  I asked for paper plates.  They did not bring them.\n\n8.  I asked for a side of hot sauce.  They did not bring it.\n\n9.   Low minimum for delivery ($10).\n\n10.  Good prices for delivery.  $16.43 including tax for 2 entrees and a side of rice.\n\n11.  My fortune was \"This year your highest priority will be your family\".\n\n12.  For lottery players, my lucky numbers were:\n      3, 8, 12, 16, 19, 20", "author": "Mark D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "I walked past this restaurant yesterday and noticed it was closed. The sign on the door says it was closed for health violations.", "author": "Jeanette C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-17", "description": "Food was TERRIBLE,\nAs well as not my order.\nThe fried rice wasn't fried.\nThe chicken looked , felt and taste like baby alien fetus.\nNEVER Again !\nComplete waste of currency", "author": "Ashana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-24", "description": "Food taste alright, a bit on the salty side and mainly kind of greasy. \nThe service is just awful no matter how many times I go. Every time they \"slam-dunk\" my food on the table or have their thumb in my soup.\nHowever I guess what you pay is what you get. The food is rather cheap and it taste alright. Therefore a three star for the food price and service.", "author": "Janice S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "(See pic)\n\nSo I have not had Hong Kong style pan fried noodle since I was a kid. Came here and could not help but checked it out because it's a dish I can't make at home.\n\nI had the pan fried noodles with shrimps as well as with beef and vegetables and the noodles were crispy like eating chips. The shrimps and vegetables were of pretty good taste too. An authentic taste where people frequently get in HK. The fact that the noodles were dry was excellent that made the dish less greasy.\n\nIt's definitely a hole-in-the-wall local joint and cheap. They did not even bother on decoration but more about the food and fast service.", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-01", "description": "Iy must be that I had high expectations and the fact that I am of this kind, none-the-less disappointed all together. \nIt was a take-out momment with little time to pick another place, and it was on my walk from sports basement. Decided to try the mango prawns sounds good right, complete bummer, full of rice at the bottom and shrimp over cooked, and had no flavor. Mangos were not ripe = no sweetness..... \n\n2stars for the beef chow fun..... Taste ok, tho forgot to say no MSG!\n\nReally I should of known right when I walked in, you can tell most of the time by the patrons who gather.  \n\nOverall, friendly ladies at the counter and looks clean, lol, but the best Chinese is the greasy spoon locations ;)", "author": "A. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "This restaurant is literally a hole in the wall - but one of my favorites. If you're looking for some chinese comfort food that tastes a whole lot better than panda express - this is your place! \n\nMy favorites:\n\n- fried rice with chinese pork - so good! So flavorful - more than just oil and msg.  Full of peas, corn and chinese pork\n-orange chicken - I don't know why, but I think I'm in love with this orange chicken - it's fried in batter and then rolled in orange sauce... something about it makes it so wonderful.\n-chow mein - they use big fat orange noodles for this and it's pretty basic, simple, but tasty - you get some cabbage and carrots in the mix as well.\n-sweet and sour pork - pork, onions, bell peppers in a saucy mix.\n\nI've eaten inside the hole in the wall restaurant and I've also ordered from eat24 for delivery from them. Just as good!\n\nOverall - this is going to be good cheap, easy, fast Chinese fast food that you can access relatively easily!", "author": "Christine B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-15", "description": "I've been coming to Jade for years. YEARS. I've never had a complaint about their food and really this isn't about their food it's about their DELIVERY service. Straight up their delivery service sucks. I waited 1.5 hours for a simple wonton soup. Then when I called to find out the status of my soup the man who took my order was EXTREMELY rude about it! \n\nSo tip: if you want food from here its better to just go and it there.", "author": "Emilia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "My co workers and I usually order here because they deliver to my work. My favorite thing here is rainbow chicken. SO GOOD. everything else is okay. nothing crazy special. My least favorite thing here is the salt and pepper fish. Anything that's fried fish is not good here. It had a weird texture and super fishy taste.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "This is my neighborhood Chinese restaurant and I go there very often, most of the time the food and service are really good.  The staff are all really nice and say hi when i see them around the area. Like any good Chinese place they have a ton of great lunch specials. They serve a little bowl of soup if you eat in and also have an option to drink a pot of tea with your meal.", "author": "James D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-15", "description": "We tried Jade Cafe for the first time this evening (delivery) after receiving a flyer at our home. We were extremely disappointed. \n\nWe ordered the following dishes:\nPotstickers - mediocre (they had obviously been prepared earlier in the day)\nEggplant w/ chicken, shrimp in special sauce - good\nHouse Special Chow Mein - mediocre\nPork Fried Rice (free w/ order) - mediocre\nFortune Cookies - were floating in sauce, mushy and inedible\n\nDelivery - very prompt (earlier than estimated)", "author": "Terry A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-11", "description": "We like this restaurant. The food is good, but the soups always are very hot. The staff is friendly.", "author": "Sandra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-01", "description": "AFcknMazing\nwalnut shrimps are soooo worth it and they dont skimp on the shrimp\nawesome lunch specials\nEGG ROLLS are a must!!! \nbeef and brocolli, mongolian beef & chowfun/mein are top best items", "author": "Mar L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "Great place for a quick bite to eat at reasonable prices. Am a loyal customer ever since when they were located on Folsom Street.  The food is not spectacular but it will do when the hunger pangs hit!  I normally call and have my lunch delivered where I work in Downtown SF, but this time I walked in! Beef with Tendergreen over rice! Tasty with minimal MSG with a bowl of soup and tea for $6.50( tax included!).", "author": "Steven L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "BEST Chinese Take Out EVER!! \n\nMy partner and have our favorites saved on their ordering website and they rarely ever take more than 30 minutes to deliver even though the ETA is 45-60 min. \n\nVery tasty and very affordable. \n\nThe only thing is that they recently changed the inside of the fortune cookies to advertising space for a third party, so that's my only complaint. But if you want serious good Chinese Food - this is the place :)", "author": "Alan A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-15", "description": "I thought I'd give this place a try given the opportunity to pre order online for an 11:30am delivery. I get a call at 11:44am, two to be exact. The first call I was hung up on, the second finally a person on the other end get this.....asking me to go downstairs of my buidling to pick up my food. Not only that but the guy was still in his car. I had no idea who to look for. As if that wasn't enough of an experience I get back to the office and notice that the order was wrong. I didn't even think to call them back. I'll stick with Shanghai China for friendly, reliable & quality delivery while in a pinch.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-24", "description": "Delivery guy was an hour and a half late! Our house driving is about 10 min away! When he got here he demanded tip, I told him no tip because he was really late , he insisted on tip and said he has to get a tip, my mom felt pressured and gave him $3 so he would go away. As thought, the food was cold.. never consuming food from here again.", "author": "Maria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-09", "description": "My takeout order was ready amazingly fast. The garlic eggplant was good and the kung pao tofu was ok. I was kind of concerned with cleanliness though and I'm usually not much of a germaphobe. They got a 78 on their health inspection and the checkout lady stuck her hand in a bucket of loose fortune cookies to put in my dinner right after handling money.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-01", "description": "Worst Chinese restaurant because they have the WORST customer service ever!! Not only was I on hold for about a half an hour when I placed my order but they took my phone number down wrong so my lunch delivery was 2 hours late! Nonetheless, even though my lunch was late I still tipped $3 on a $15 order (20%) which I thought was fairly resonable. I called back about 2 months later to place another order for delivery and the lady who answered the phone had the audacity to complain about my tip that I left her delivery guy the last time I ordered. She said that he needed more \"gas\" money. I literally work 3 blocks away from this place. Freakin idiots! I told the lady who answers the phone that it was RUDE to even ask for more of a tip and that tips are a gracious gesture hence the name GRATUITY! Food was alright but not really worth the BS you have to go through!", "author": "Priscilla P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-08", "description": "This place has gone from sugar to shit. I really used to like this spot back in the day. So let me give you a break down of what not to get. Do not order the pot stickers they are too doughy and soggy, the taste was there but the texture wasnt. The spring rolls were okay, the black bean chicken taste like chicken livers over rice hashtag hella gross. And last but not least the prawns with scrambled eggs over rice, hella dry no type of sauce, too many peas and carrots, they really messed up this time. I dont think I will frequent here in the future.", "author": "Tenia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "I dont see how this place isn't rated higher. everything is made fresh, pretty fast, and the place is clean. Always busy too. The waitresses are always nice. Ive been here well over 20 times through the years. Cant find a better place for this price.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-30", "description": "The food is okay it's not the best, but what really got me mad was that the waitress was forcing my mom to give her a tip. You earn a tip you don't force anyone to give you a tip. And to top it off the glassware was disgusting.", "author": "B L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "Good traditional chinese food. slow service", "author": "Murphy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-10", "description": "Curry Chicken was soupy and low rent. Ok I wasn't expecting too much from a typical divey mom and pop chinese restaurant, but it was pretty awful. One extra star for fast friendly service.", "author": "Dan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "Lunch!\n\nMy regular full order of Seaweed soup with egg swirl. House Chow Mein, laden with tasty little morsels of bbq pork, shrimp, & chicken, peeking between the noodles and diced crunchy vegetables. \n\nIt was just right!", "author": "Clifford L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Just had a wonderful delivery order - the cook was in a good mood? Ordered Sweet Sour Pork, Beef Chow Fun w/black bean sauce, Hot & Sour Soup, Salt & Pepper Shrimp, Chinese Broccoli with Garlic Sauce  - very typical foods and EVERYTHING was delicious.  My fortune cookies were also fresh and crunchy. A nice treat for someone who cooks most meals daily.  Salt and Pepper Calamari and Wor Won Ton Soup are other favorites. When I visit the restaurant, everyone is very nice and friendly.", "author": "E Elsa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "The food is delicious, big portions and prices are very reasonable. I recommend the shrimp w/ scrambled eggs over rice", "author": "Trev C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-06", "description": "Lunch menu is, quite nice - the Spicy mixed veg w shrimp & rice with a pot of tea & sour & spicy soup! This place is perfect for take-aways!", "author": "Julian I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Very good food. I love the won ton soup and spicy mango chicken with fried rice is soooo good.Very fast service. I always do take out, so I cannot comment on service. But Im guessing its good because a lot of my co workers are regulars.", "author": "P A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "I like Jade's chinese food. I hate their service! They're always nicer to me in person once they see I'm chinese. However they are just rude as heck over the phone. C'mon gals you're making a bad name for our people. \n\nThe food I love from Jade is the Hong Kong Style Crispy Noodles! Crispy with some sauce and lots of meat with vegetables. Also their salt and pepper shrimp, salt and pepper chicken wings and braised tofu and twice-cooked pork is really good too! Their combination fried rice and combination chow mein is pretty good as well for standard  fare. However their braised tofu and twice-cooked pork was DRENCHED in oil unfortunately but it was very tasty! \n\nI've never eaten there, nor will I ever since it's a dive type of place. But I always take my food to go.", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "They serve the most AMAZING green string beans with chicken, evvvvver! I am NOT even exaggerating!! They are delish and fast! Wish I lived closer to this place   :( This rating is coming from someone who is not a big fan of Chinese food. Therefore, it is safe to say that this place was on point! Make sure to try their String beans with chicken, you will NOT be disappointed :) Enjoy!", "author": "Shelby C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-02", "description": "The food was passable. The service was dismal. In part, this may have been due to the language barrier. But largely it was the snottiness of the staff. I placed an order with Yelp online which would not seem to take. I called the restaurant to see if they had a record of my order. When I called, a women who spoke fluent English answered and told me they had no record of my order. I told her thanks anyway, but Inwas giving up for the time being. An hour later, I got a call from them. This time, the woman on the phone barely spoke English, and I am deficient in both Cantonese and Mandarin. But, aside from the language barrier, this woman was plain rude. She asked me why I hadn't come to pick up my order. I replied that I had been told there was no order and that, in any case, I'd wanted to elect delivery when I tried to set it up on Yelp. She argued that there was no address and I offered to give it. She then yelled at me: \"How I can deliver when there no address!!!\" Again, I gave her the address with the cross streets. A half hour later, a young man called and asked the cross streets again. I told him. Then he called again and told me to come downstairs from my apartment building to get the food (rather than ring the apartment buzzer I'd given). I did go down and I asked the young man of he's gotten the message after I had been told there was no order. Again, there was a language barrier and he began to argue with me. In all, the service was just plain lousy. The food was passable. Won't order from here again.", "author": "Luke A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "You know, not bad. Not bad at all.\n\nMy friend and I just wanted a quick bite to eat before we went to Oyster Fest and I was just craving Chinese food. So we randomly picked this place which was on the way. And you know, it sure does help to have low expectations because I was pleasantly surprised.\n\nNow, I'm not going to say it was the best Chinese food I've ever had. But they have this family dinner special which is so worth it. For its price, you get so much food. It was nice to not have to spend a lot to get some variety in your meal.\n\nAnytime I'm looking for some cheap and decent Chinese food, I am definitely coming here.", "author": "Brent C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "CHINESE COMFORT FOOD\nAs a native SF (almost 60 years) who grew up mostly in the 60's, Chinese Delivery/Take out all use to come from China Town.  As I remember, the primary place was the Chinese Kitchen (no longer in existence).  This food is the food we all ate in those days before food became viewed as an enemy; something to assess, control and hold at bay; we ate what we liked, even here in San Francisco.  We've become too \"gormet\" and eccentric now for a variety of reasons.  That being said; I also was a frequent customer of theirs since moving into this neighborhood 19 years ago.  I usually ate Orange Chicken and steamed rice.  I haven't ordered take out in years, and hadn't eaten their food in about 10 years, but recently was desiring my old usual dish.  I checked out Yelp, and was a bit taken aback by the negative comments.  After a few days, I decided last Tuesday afternoon (I'm retired now and at home) to order delivery anyway.  I got Orange Chicken, double steamed rice, Sweet and Sour Pork, and decided to try the String Beans and fried Tofu, so I'd have leftoevers, maybe to share with my brother.  I received a pork fried rice too, as a freebie.  I did it on the internet over Eat24 at @3:00.  My doorbell rang @25 minutes later, it was here.  Simon, the delivery guy, couldn't have been more polite and nice.  It was like he was my friend bringing me food. I asked about the owner, (with whom I was always friendly as well), by name (I don't want to say his name in this review) and was told he's still there.  I had so much food.  Today is Friday, and I just finished the last of it.  Those four dishes have been all I've eaten for 4 days, reheated in the microwave, and the leftovers were more flavorful and delicious than the first.  This is the kind of Chinese food that characterized San Francisco, except it's less greasy than those kind of dishes use to be.   I will certainly begin ordering deleivery from time to time, now. Thank you Mr. A, and thank you my new friend Simon, daytime delivery guy.  I'm glad you are here.", "author": "Donald W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "-conveniently ordered online through yelp for pick up. free delivery over $15!!\n-haven't had a good pan fried noodle dish since i lived in Flushing Queens!\n-beef was incredibly tender and noodles were crunchy\n-the flavor was decent. i guess nothing some sriracha can't fix\n-i dont think i'll be having any cravings anytime soon\n-wouldnt go back unless I was desperate", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "Delicious place for food and great and affordable portion for lunch, but the staff could be a little friendlier..", "author": "Carlos F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-09", "description": "I am very new to this place, and I have already been back 2 times for the past week. Perhaps one of the best Cheapo-Chinese food anyone can ask for, so Panda Express can go to hell.\n\nTrue, some of the food they serve are still greasy, but hey, if it ain't greasy, it ain't chinese food. Go sulk to your $9 Mixt Greens Salad. Jade Cafe is hygenic, authentic, affordable, and taste is spot-on! I love their braised fish with seasonal greens. With the kind of portion they serve for $6, you can divide the meal into 2. They have amazing homemade wontons too.", "author": "Rika P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-07", "description": "Another Chinese restaurant owned and operated by grunt workers and/or maintenance staff.\n\n*A rude hostess who barked when asked questions about menu items and nearly ripped the page of the menu to point rather than speak\n*Large bowls of food seated on the same chairs we seat our butts on\n*Kitchen & service staff yelling at one another within the single room restaurant/dining area in the presence of diners \n*Over-priced plates with outrageous charges for additional single items (i.e.. 2 halved shitake mushrooms)\n\nIf you're desperate for food, then chow down.  Its digestible.  If you're looking for something delicious, worth your money and a pleasant dining experience, look elsewhere.", "author": "Honest J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-02", "description": "Updating my review -- this place used to be our go-to for a cheap chinese takeout dinner.  As of late the food has been less than spectacular and we are looking for an alternative.\n\nGood:  Huge portions, free chow mein if your order is over $20, and quick service.  Prices are reasonable, though not always up to date.\n\nBad:  Lately the quality of their food has taken a step down and been less enjoyable.  Also the plastic containers they give your to-go food in are flimsy -- in one case the hot food melted the plastic and we had sauce everywhere.  As I mentioned about the prices, they updated their prices but didn't update their menu....  A couple of times I thought I had spent just over $20 and gotten a $28 check.  So be aware.", "author": "Steve T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-22", "description": "My wife was suppose to attend her Zumba class across the street but quickly found out that the instructor she liked apparently opened up her own shop elsewhere and to top it off the class was full for the evening. So instead, we ended up stuffing our faces here.\n\nThis place was a pretty casual dive type hole in the wall. The menu offered had a good selection of Chinese food across the board. I quickly noticed that the flow of to-go phone in orders were steady so that's good news for the business. The place was half full and everyone seemed pleased with the food. We ordered Yang Chow Fried Rice, Shrimp Chow Mein and Mongolian Beef.\n\nIt didn't take long for the food to arrive. The yang chow fried rice and mongolian beef were okay but I really liked the shrimp chow mein it was yummy flavorful. I'd go back in a heartbeat. Fairly priced and good service!\n\nZumba turned into Jade...", "author": "Gary E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-18", "description": "There is something to be said for cheap, quick, decent Chinese food. If you have only about a good 30 minutes to grab lunch and head back to your cube, this place is a good choice. \n\nSome of my favorite dishes:\n\n- Beef Noodle Soup\nA beefy soup that has a grip of egg style noodles. You can add wontons to make it even more epic.\n\n- Ma po Tofu\nNice and filling for those days you don't really want meat.\n\n- Mongolian Beef\nVery tasty. Not too spicey\n\nThe potstickers aren't shabby either. \n\nThe ladies that work the counter don't have anytime to be nice to you. Its all business. What do you want. Ok its this much.\n\nYou then migrate over to the wall of waiting shame next to the bathroom to wait for your order. Luckily they are pretty quick. \n\nI have worked in this area for over 7 years and they have never failed me. \n\nProtip: Order 10-15 mins before you come for takeout. Most likely your food will be ready when you get there. Otherwise you might have to wait a \nwhile especially if you hit the middle of the lunch hour rush.", "author": "Lawrence S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "Seriously good Chinese food.  \n\nKung Pao Tofu.  Potstickers.  Chow Mein with Mixed Vegetables.\n\nThese are my current favorites.\n\nI usually do pickup, so I can't speak to the waiter service.  But the staff is always very friendly on the phone and in the restaurant.\n\nPrices are pretty cheap too.  Around $10 per person...and that is for a lot of food.", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-09", "description": "Inedible.\n\nI ordered delivery.  I asked for brown rice but was told they only had white, but I was hungry and it didn't seem like a big deal so I placed my order.  After 50 minutes I got a phone call from someone who clearly did not know the area and he couldn't read the handwriting of the person who wrote down my address .  There was a major language barrier and it became a real problem trying to communicate.  However, I was starving.\n\nWhen my food arrived, it was luke warm/ cold.  The spring rolls came without sauce or mustard and were inedible - greasy, soggy and predominantly pastry without much filler.  There was neither sauce nor mustard for the spring rolls. The vegetarian deluxe was overcooked  and more or less tasteless.  And cold.\n\nI would have been happier with a bowl of breakfast cereal, which, in the end, is what I had.  The food had to be discarded - what a sorry waste.", "author": "Lea E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "Delicious Chinese food. Always busy, which I take as a great sign. Sometimes it is a long wait for delivery but there's always a ridiculous amount of leftovers and its good the next day.", "author": "Sofia F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-15", "description": "This little place is located on one of the strangest business corners in the city.  Right accross from a big strip center with a Safeway, Office Depot & Petco.  Sadly there isn't a decent food place for several blocks around here.  Lots of nasty fast food but nothing really good.  Enter Jade Cafe.\n\nThe place is smallish dive.  I mean that as a compliment.  The menu is straightforward Chinese delivery.  The food is good, cheap and homemade.  You'll often find a lady at the corner table rolling eggrolls by hand.  They also deliver. \n\nLunch is super busy as this is the only decent place around so go early if you want a seat.", "author": "Russell D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-06", "description": "New to SF, read all the reviews, some good reviews and some bad reviews.  My personal experience was perfect.  Food was hot, fresh, tasty, reasonably priced, with a standard variety of food options and specials.  I dined inside.  Order to pay was about 20 minutes.  So I was in and out in a jiffy with my belly full.  Plus, the restaurant was packed, which is a good sign.", "author": "Dimitri M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-11", "description": "Best Chinese dive in SF. Anything on Anything for $5 all day and night.\n\nGod I forgot all about this place, but it's my fav Chinese dive in SF. Amy runs it and has since it was Jade Cafe #1 about a block from my house (my god... 15 years ago). \n\nHere is what it is:\n\nWhen it was on Folsom Street it was a single room with a kitchen in one corner. We'd go there and order Anything we'd like on Anything we'd like for $5. I'm talking fish, chicken, beef, whatever anyway you want it, on chow mien, chow fun, fried rice, white rice, crispy noodles whatever. The woks were always going with High fire, lots of oil, and everything was super yummy. \n\nThey've been on Bryant forever now, but its still good, still run by Amy, and nothing has changed other than the kitchen is now in the back and not visible.\n\nLove the chow fun, and the Hunan Fish. Its not high end in any way, but most everything is really good and after all these years, I owe them at least this. \n\nBasically they do have a full menu and you can order dishes, but the best deal is that they do lunch all day and night. Anything on anything. Just ask.\n\nIf anyone slags this place, good, we're better off without you. \n\nThanks Amy", "author": "Adam X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-13", "description": "2.5 hours after placing a delivery order and it still hasn't arrived. (I live less than2 miles away, not across the bay or anything). I've called a total of 5 times to check on the order--twice the person on the other end of the line has immediately hung up the phone without answering, and three times I've been told that because of \"traffic\" they don't know where the driver is or how much longer it will take. I could have walked there, taken a class on Chinese cooking, made the food myself, walked home, and eaten it in that time. Shame, because I've heard great things and love a good no-frills hole-in-the-wall joint. :(\n\nUpdate: In the spirit of fairness, upping from one to three stars. Once it arrived (2h 41m after ordering) and I reheated it, the duck won ton soup was incredible. Also, I felt for the delivery guy because by this point in the night he was sprinting to my door. I would have given this 4 stars without the delivery fiasco, and I'd rather judge a cheap Chinese takeaway place on their ability to ace a hard-to-find food item.", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-19", "description": "I ordered the shrimp and scrambled eggs over rice - it was bland, the shrimp didn't taste good, but it was cheap and affordable!", "author": "Ray P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-25", "description": "A co-worker suggested that I try this restaurant.  He told me the food was okay and the place fills up in the evening with many of the patrons who work out at the 24 Hour Fitness located across the street.\n\nThese folks must be working out pretty hard to be able to enjoy a dining experience here.  The floors are filthy and the place is loud, but it's not the restaurant patrons who are making all the noise.  The waitress managed to carry on a very loud conversation in Cantonese with members of the kitchen staff as she took orders and served food to restaurant patrons.  I would not have minded had the conversation's subject been a bit more interesting other than family gossip.  I was trying not to think of how much of her spit was flying into people's food as she carried on her conversation and served the food.\n\nTaste-wise, the food was edible and the portions are a good size.  Think back to my days in elementary school when the \"cook's choice\" served up every Friday was a combination of all the leftover parts of the lunches served on Monday through Thursday.  I think that's what I got on my Deluxe Seafood Chow Fun.  Chow fun was not meant to be served this way ... along with the flat rice noodles, I found a few coils of rubbery calamari, a few bits of scallops, a couple of shrimp, a few chunks of imitation crab, some zucchini, half a button mushroom, two straw mushrooms, water chestnut slices, celery, onion chunks, bamboo shoots, one string bean, two florets of broccoli, bean sprouts, two black beans, a few pieces of green bell pepper, and a single carrot slice.  What happened here?  Did the cook not find any cockroaches to throw into my plate because I was certainly anticipating it?  \n\nTry not to look too closely at the wood paneling because you will find that the walls are not cleaned very well either, and there are actually food particles stuck to it.  Gross!  Stick with a can of Coke because that was probably the best part of my meal.  You don't know unless you experience it, and this restaurant is a bad experience.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-24", "description": "The Fantastic-4 was doing some shopping at the Potrero Center and Sport's Basement. After 2 hours of shopping, we worked up an extreme appetite, so we landed at this Chinese Restaurant, which is up the hill from Sport's Basement and across the street from the shopping complex. \n\nMy goodness, this place looks like one of my facility at work; aging and dirty. This place is so dirty that the restaurant's fish tank needed some seriously cleaning. With algae, green gunk and other filth, the kids wanted to see the goldfish, but not being able to with all those nasty and clouded debris visibly on the tank.\n\nFrom the menu, we ordered the $5.50 Chicken with Chinese Broccoli over Pan-fried noodles and an order of $3.50 Pot-stickers (Gyosa). The noodle plate was tremendously crunchy and oily; the chicken pieces were unusually sweet, but the vegetables were very crunchy with four stalks on our dish. The pot-stickers were ok, but nothing to get excited about. We each also got a bowl of a knockoff to the popular Westlake soup as our house soup, which was decent. We bought two cans of coke. I'm sure the taste of the soda doesn't change. \n\nSince it's my questionable decision to come here, I charged our sub par lunch with a $10.00 minimum, which surpassed that requirement on what we order. The three of them weren't too happy too. Even not having anything all day to eat may sound like a desperate circumstance; the food was just below average, despite the workers being friendly to us Chinese family.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-19", "description": "This is my go to Chinese delivery place.  I was hooked because of the lemon chicken.  Crispy little nuggets with just enough of the lemony sauce! Over the years I tried many things off the menu, and can honestly say everything (so far) is so satisfying.  \n\nOne of my favorites is the beef wonton soup.  It's always perfect.  I actually just had some for dinner (maybe that was my inspiration for finally writing this review).  The broth is flavorful, the wontons are fairly large and plentiful and the beef tender.  It makes for a perfect starter and is consistently delicious!\n\nAnother fave, is the veggie fried rice.  It's a good balance of rice, egg, and a really good combo of different veggies (broccoli, zucchini, etc)\n\nDelivery is always fast and the food tastes fresh. \n\nThe waitresses are very friendly and sweet.  I recently ate in with my 14 month old niece, who made a bit of a mess but the ladies never made a bad face or said anything rude and were actually helpful when my niece wanted to play the \"throw the spoon on the floor\" game.  \n\nDefinitely give it a try if u haven't already!", "author": "Lesliegh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Stopped in for a bite (rice plate) on a rainy Sunday. Service was prompt and friendly, food was tasty, free soup, price was right. OK this is not the Four Seasons but my experience was better than expected and I would stop in again if caught in a rainstorm nearby.", "author": "Paul A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-21", "description": "Atmosphere: Greatly disappointing. The manager's family was there, with kids actually running around the restaurant, being loud and disrupting the customers' meals.\n\nFood: Everything we had was too greasy, and on the poor side of mediocre.\n\nPrice: Quite cheap, but I'd rather spend $5/person more and get better food.\n\nIn short, not a good environment inside the restaurant, and the food was not even very good for take-out. Doubt we'll ever go back.", "author": "C. H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-18", "description": "Never coming here again. The WORST hot&sour soup I've had. It wasn't prepared the traditional way. It was lacking the sour vinegar hit I was craving&there was pork meat in it(?). Thats a first. As for the spareribs w/black bean, ehh! Never coming back.", "author": "EmmettsGuRL C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-06", "description": "Food is very good but the place is so nasty last time I ate there I had gotten food poisoning from the duck but it was good I was sick for 4 days", "author": "isaac a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "I love their lunch specials here and they are quick with the turnaround! I like the hot and sour soup they send out for your appetizer. \n\nI've had the Fish with black bean & asparagus over rice! Yummy!! Good portions, too! The shrimp(prawns) over rice with scrambled egg is always good for me..the Garlic noodles are delicious - I get it with Chicken - I'll have to try it with the other meats.\n\nThey have good Oxtail over rice as well - I think they only have this dish every once in a while....\n\nThe wait staff are always STERN looking, but are always nice & VERY accommodating when they get to your table.\n\nThey are GREAT for to go orders as well.", "author": "Juliet W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-16", "description": "I like Americanized Chinese food, so kill me you cuisine purists out there! Working and living within close proximity to this place for close to 15 years I've seen and tasted the environment here all too well. Recently they put out this fancy glossy fivefold mailer/ menu, it makes their dishes look incredible, now if only a bit more effort were put into the actual presentation of the actual dishes then we can talk. No complaints on the portions here, I always take home a little doggie bag (and lucky me gets to play doggie since I have no pets). Where else can you find your classic rice plate faves like Mongolian Beef over rice, Mango chicken, Won ton soup, or Honey walnut prawns all usually under 10 dollars. \n\nMuch improved from the past, when I would eat in and thought that \"Palmolive dish soap\" was their secret ingredient. Service seems to be selective. Is it me or do they always seem mad at something or somebody, I can't comprehend any Cantonese, but you don't have to be a linguistics major to understand the staff snapping at each other like phirana fish in one tank. I've tried tipping well up to 20- 25% above the norm but just can't seem to get the same reaction? If you're a pudgy Caucasian blue collar man you seem to get a smile, maybe even a laugh from the always busy waitstaff, Oh well it's all about the food, my 45-50 minutes of freedom on my lunch hour, and pleasing my \"gut\" and it's instincts.", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "Friends and I have ordered from Jade twice now.\nWe've tried:\nWalnut Prawns\nShrimp w/Snow Peas\nFresh Vegetable Fried Rice\nFried Tofu w/Green Bean in Dry Spicy Garlic\n\nEverything has been veryyyyy delicious! And delivered quickly as well!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "Just as good as it always was. The best Walnut Prawns anywhere. BBQ pork wonton soup is fantastic, though not listed on the menu I don't think. Just ask for it!", "author": "Alex W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "big portions, low prices, and good food.. love the fried rice", "author": "Shari H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "I always have the Hunan Fish or Rainbow Fish every time I come to this restaurant. They were really good!\nThe price was so reasonable, the portion was huge, and the service was quick and good.\nThe place is always clean and tidy.", "author": "Joice K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "As a Mexican American I might not know a lot about Chinese food but this is very good and tasty food! Enjoyed it a lot.", "author": "A A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-12", "description": "Perhaps the worst Chinese food I've ever tasted (rating two stars only because there was LOTS of it, which might be a good thing if you were starved and and had drug-induced munchies. \nOily, salty, overcooked - no redeeming qualities other than the quantity of food that was delivered.  \n\nAnd if that weren't bad enough, their phone etiquette is even worse.", "author": "Lady D S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "I ate here yesterday due to having to do pet things at the SPCA. \n\nI'll definitely eat here again. It's not the best but, it's far from the worst. \n\nThe prices are good. The portions are healthy and as several of the Yelpers stated...this is definitely a blue collar establishment. \n\nI had the Mango Shrimp and my wife had the Sesame Chicken with both dishes spicy. Neither of us could find fault with the dishes. We also washed it all down with a couple of cold Tsing-Tao beers. \n\nOur server was fantastic. She made us feel right at home and checked on us a few times. She made certain we were taken care of. I did notice two of the other servers that if they waited on us...I would be writing a different review. \n\nNo complaints from me folks. I'll eat there again. \n\nGive it a try.", "author": "Wayne B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-11", "description": "I can't speak about many of the items on the menu, but the chicken in black bean sauce wasn't good. Maybe I'm being too harsh by giving them a low rating when I've only eaten here once and only tried one entree, but the tastiness of my order (or lack thereof) didn't exactly compel me to come back to this place. The waiter was pretty hostile as well. I realize that the customer service in Chinese restaurants isn't exactly the friendliest, but this guy was pretty bad even by those standards. I've always been curious about trying Jade Cafe every time I'd pass by, but never again will I venture into this place.", "author": "Tito The Incognito .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "Dive Chinese.  Good food quick and cheap.  The beef noodle soup was great.  Cranky staff but expected.  \n\nThey have Siracha but you need to ask twice.\n\nMakes lunchtime fun.", "author": "Doreen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "Reasonable prices for decent Chinese food in the area.  Lunch specials/Rice plates are pretty generous.  This place usually has a pretty busy weekday lunch crowd. Check the board above the register for the daily specials.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-08", "description": "Wow, is this an f-ing joke?  This is seriously the only time I wish I could give a zero-star rating.\n\nThe GF and I stopped in here for a bite after a late run to Sports Basement.  The lady says we can't sit down; take-out only because they're closing.  Fine, that was the plan anyway.\n\nWe order orange chicken and something with eggplant and noodles.  It wasn't cheap - almost $20.\n\nWe get home and find the following in our to-go containers: tough noodles, a minimal amount of chicken (not orange), round slices of bone (pork? feline femur...?), a couple of shrimp, and other random stuff other than what we ordered.\n\nDoes Jade Cafe really think this is good business?  You charged me full price for whatever scraps were left in the kitchen, and I didn't notice until it was too late.  Good for you, you got one over on me.  But don't think you're immune to this, the digitatl enforcement arm of the free market.\n\nI hope people read this and put this place out of business.", "author": "Peter A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "I get the combination fried rice.  Great version of my favorite dish, I've been back many times.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-14", "description": "The price alone warrants a 3 star rating. Add to that the tasty Chinese dishes and great service in this hole in the wall and I can't wait to grab lunch while at work from here again! I got the orange chicken with fried rice and although it took longest for it to come out ( I was the only one at the table who didn't get white rice), it was well worth it! I paid about 8 bucks total and had 2 meals out of this. Large portions!!\n\n\nupdate:\n\ncame back here and go the chow mein with orange chicken. same great meal with not as long a wait. throw in the complimentary hot and sour soup for the table and this is probably one of my favorite spots to eat!", "author": "omid a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-03", "description": "This reminds me of Jade China and Wonder Wok from San Jose all in one.. very good service, quick, cheap, portions are rather plentiful, and tastes great!  \n\nWe came in on a super hot ass day.. our server was nice and kept refilling our water though she apologized that there was no ice but at least she made that extra effort.  We had the eggrolls for appetizer, a beef chow fun plate, a seafood/veggie chow mein plate, and a soda for just $20!  I think that is a pretty good ass deal.. \n\nChow fun was tasty, meat was juicy, and there was enough gravy and bell peppers and black beans to cover each bite, the chow mein looked good, though I did not try it.. the eggrolls were yummy; came w/ a small plate of sweet and sour sauce.\n\nParking can be terrible but if you park in the Safeway/24 Hour Fitness Plaza and walk across the street then no coins needed for the meter!", "author": "Tram N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "Fast and friendly service, lots of different items on the menu. We ordered chow fun, Mongolian beef, sesame chicken, steamed rice and pot-stickers. Every was good and the portions were pretty big. Although this isn't my regular go-to place for Chinese, I was pleased and will be back here again. \n\nSmall family-run joint and worth a visit if you're in the area and craving Chinese.", "author": "L M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-03", "description": "I work in San Francisco on the weekend and I order lunch from this place some what often but that's going to end. The past two times I ordered from Jade's café the delivery person watched as I signed my receipt, the driver said \"No tip\"?. This happen today. After the transaction is complete the delivery person leaves the building and mutters \"every time deliver no tip\" not Thank you we appreciate your business. Don't tip the delivery driver he won't say Thank you or Have a nice day.", "author": "Rebecca W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-02", "description": "We were craving Chinese food and ended up here on a Sunday afternoon. We had the mango chicken and the seafood Hong Kong style noodles. Our meal came with complimentary tea and hot & sour soup. Service was standard but I didn't expect much to begin with, and the food was average. Wouldn't go out of the way to dine here, but wouldn't mind coming back if I'm in the area craving Chinese food.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Great place to go to if you want good & quick chinese food. \n\nLove their crispy chicken, pan fried noodles and bbq pork chow mein. My daughter makes it a point to always get th honey walnut prawns!", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "This is a great cafe for those on the run and looking for good quality food.\nI have digestive problems since having been poisoned in an expensive restaurant, therefore, I am very picky about what I eat, otherwise I get unpleasant feelings. I can eat most things in this cafe, so the food is of good quality. The food is simple and to the point. So if you are a health-oriented person on the run, this place will satisfy your needs. There isn't much of a decor, but the place doesn't claim to be a restaurant...it is a cafe. The service is good, but you may need to wait a minute if there are lots of people, so be patient. People working there are real people...sometimes tired...so if they don't smile at you (some people complain here...get a life) don't take it personally, usually they will smile.", "author": "Sergey A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-22", "description": "Had lunch here yesterday.  The food was better than most of the chinese restaurants in the area at a valued price.  Only thing I didn't like, was the service, it was like pulling teeth trying to order food.  Waving, making eye contact while waving to the staff doesn't work.  The only person seems to take orders is the lady behind the counter.  After 7-10 of waving, she finally comes over and doesn't ever acknowledge with a sorry.  I'll probably wont return to this place.  The service really bugged me", "author": "Delon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "If you are looking for somewhere fancy, then here is not the place. Looking for some lunch or dinner take out? Oh yes, all kinds of Chow Fun are one of the best taste in town. Another day, I noticed that lunch special rice plate are normally only fish fillet plate also very yummy, and it's only $6.5 as I remembered. geez... hard to spend $20 buck here! A must try place if anyone is in the neighborhood. :)", "author": "Flora F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "Who'd think that a hole in the wall restaurant with no decorations and furniture that came out of a discount restaurant supply store could have good food?  Well, this is often the case.  They spent their money on the food, not on the furnishings.  \n\nI've long liked the Jade, both the 16th and Bryant one and the long-established one in the Polk area.  \n\nThe mushu pork is excellent, the curry beef is meaty and spicy, the won tons and the kung pao chicken, you name it, they cook it fast and fresh, and deliver it for a GREAT price.  The curry beef with vegetables over rice for $6 -- who can beat that?  The Jade is a regular stop for me.", "author": "Chilly M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-18", "description": "Like the previous yelper stated, this place is very Blue Collar.  You look around and you'll almost always see a lot of big dudes dining there.  \n\nI come here for lunch, as it's close to my work.  The servers are friendly and the food comes really quick.  \n\nIf you dine-in, they serve you soup for the lunch specials.   The food they serve is pretty decent.  The portion is pretty big so I always end up taking the rest home.  Oh, and the price is pretty cheap, too.", "author": "Kioko O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Cheap Chinese food.  I pretty much always get the chicken fried rice and it's a good portion (enough for 2 meals) and quite delish.  I guess the reviews here are saying that the food is bland and I do have to agree somewhat.  It's really nothing some soy sauce and chili oil can't fix.  And I prefer that over something overly salty.  I'm rating this place pretty generously despite some pretty major flaws.  For one, the chicken fried rice is listed at $5.50 on the menu but they always charge me $6 (actually, I  just realized that's probably tax).  I figure that's cool because they give me soup and tea with my meal.  I also don't like all the rules about minimum order for take out and credit cards.  Still, for cheap and filling lunch, it makes me happy.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-27", "description": "Don't know what it is about these sisters who run this place. I must have been here over ten times, tip them well and every time I come here, I'm treated as a stranger. They hardly ever smile. The food is ok for the money but I may have to fund another chinese restaurant where my business is valued.", "author": "James R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-29", "description": "Let's keep this straightforward:\n\nI had a cheap Chinese lunch that was pretty decent. My Sesame Chicken was freshly cooked and tender.\n\nThis place won't win any points from germophobes, but I didn't feel the need to take a shower after leaving, so it's not so bad.\n\nOverall a solid choice for the neighborhood.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-21", "description": "Service is halfway to nonexistent. It was 85 degrees in there, but nobody came by to refill my tiny water glass. Best stick to noodle and rice dishes on the menu.\n\nBut, garlic powder dumped on top of garlic fried rice? Really?!", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-10", "description": "Been coming here for over 6 years now. The food is good espically for the price and has stayed consistant. Oneof my favorite greasy chinese food places of all time. My boyfriends favorite is the Mongollian Beef. I love the Pan Fried noodles and Mango chicken. The servers can be a bit rude at times... but hey the food is still good.", "author": "Jasmine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-18", "description": "Sometimes you get what you pay for. Other times you pay very little...and you get even less.\n\nMy trip to Jade was an accident. I had accidentally paid for way too much time on the parking meter and had a full 30 minutes leftover when I returned to the car. (I know! How often does THAT happen?) So I decided to pop into Jade.\n\nBig mistake.\n\nI ordered the duck and rice combo. It was oddly inexpensive. One bite and I knew why -- my \"duck\" was 90 percent bone. I gagged and spit out a chunk of bone that was nearly the size of my pinky finger. So I proceeded to separate the rest of the meat from its bony counterparts. When I was finished, I was left with a large pile of inedible bird bone and a miniscule pile of actual flesh. So I ate that in about 2 or 3 forkfuls and was then faced with nothing but boring white rice.\n\nIf you decide to eat here, stick with the veggie plates! Your easily shredded throat tissue will thank you.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-27", "description": "Taking advice from my fellow soup loving yelper Rita, I decided to check this place out for lunch today. I had a hankering for some wonton soup!\n\nWord to the wise: CALL AHEAD. WAY AHEAD. I came in here planning on ordering soup to go, and this place was crankin! I mean packed at lunch time. The bulldog of a lady at the counter was no nonsense. She was so effecient taking orders, phone calls, and handling the business. The servers were flying in and out of the kitchen with giant plates of chow mein, which I then wished I ordered. So needless to say, my \"to-go\" order took actually like 15-20 minutes. Downside is that there's really nowhere to wait, so you kind of just get in the way. I feel like I would've gotten served more quickly if I had decided to sit and eat, because the servers were on top of it.\n\nAnyways, after I finally get my soup and take it back to the office, all was forgiven. Packed full of wontons and barbequed pork and greens, my soup was just what I wanted. It was satisfying and tasty.\n\nNext time I'll get smart and call it in. Or, you can get free delivery with a $10 order! My co-workers and I can team up and get it delivered! Sweet. So all in all, I can't really hate on a place for being busy; that just means they're doing something right!", "author": "Audrey K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-24", "description": "Cheap is nice but not worth the $7 I have paid at Jade to put something vile into my mouth.\n\nI've gone here twice and all I can say is take a peek into the kitchen and my review is explanatory. It's dirty. I saw one cook place a bowl on the ground as she was cutting up meat, and shucking the leftover \"unacceptable\" portions over the counter into the bowl. \n\nOn top of that, ambivalent service and disgusting food (rubbery chicken that you doubt is even chicken, sauce that tastes a week old) = just don't do it.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-12", "description": "This is a Blue Collar Chinese Restaurant. So what does that mean exactly? You ever go to a Chinese place in the Sunset or Richmond during lunch and it's full of painters or construction handymen? Well this Jade Cafe has all kinds of workers on lunch. Muni, Postal Svc, Cal Trans, construction. This place is packed during lunch. You just want to eat, enjoy it, and get full in less than 45 minutes... maybe less than 30. This is that place. \n\nThis is not the place where you just sit and enjoy the travel log. This is pretty good food, not Panda Express. The servers know that you're watching the clock, and if they know they're ahead of schedule, they'll tell you to take your time. I found that kind of funny.\n\nWith a generous Rice Plate that comes with soup, you're out of there for $7 including tip. Scrambled eggs with beef is awesome and so is the Chicken with Tender Greens. The full order of Chicken and Broccoli has really nice presentation, and the Chow Mein is pretty good too. The won ton & noodle soups are alright. You're not going to find better Chinese food in this neighborhood, and getting to have it for lunch is awesome.\n\nFeed the meters on the street (8min/.25) or try your luck at the mall lot across the street.\n\nJade Cafe #2 is COOL!", "author": "Rick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-11", "description": "let me bottom line it for you.\ncheap, good tasting Chinese food.\nbig food portions, \ncrowded during lunch time.\nthis means that others agree with me.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-17", "description": "I'm giving these guys 2 stars, because I'm a frequent vistor of this restaurant. I've eaten their food 5-6 times in the last 4 months. They are also in close proximity to where I work. Here are the reasons why I think they deserve 2 stars:\n\n1. To get the 'free chow mein over $20', your total order must be over $20 BEFORE taxes. This seems to be a real issue for them and they were relentless when I was $.38 off.\n2. Their vegetable freshness is inconsistent: I had the fish fillet with asparagus dish and the asparagus tasted like it had been previously cooked, frozen, then reheated. Who serves THAT at a restaurant?!\n3. They don't give receipts and demand that you pay the correct amount of taxes.\n4.Their eggrolls are disgusting! They flavor them with a strange pork lard/blood mixture.\n5. Any entree with rice or noodles ALWAYS has 3/5 portioned rice/noodles to 2/5 meat/veggies.\n6. Everything has a bad aftertaste. They must add MSG to everything, because it all tastes the same!\n7. The person who answers the phone is rude and hangs up on you before confirming orders.\n\nHope you have a better experience than I did.", "author": "Jj H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-02", "description": "I don't mind the non authentic aspect. I just love love love their seafood over rice plate. My breath is horrifying afterwards but the pleasure is worth it. I don't live in the area so I'm not sure if there's a cop station nearby but there seems to always be hungry cops coming in every time I come here for a bite. This place is not glamorous but I consistently enjoy their cheap tasty grub.", "author": "Caroline N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "Right in the corner of ghetto and fabulous.  Didn't expect the nice service but it was more than amusing to see Chinese people smile!  We were instantly greeted with a menu and some house tea.  Ordered the dinner for 2 which came with appetizer, soup or salad 2 main courses and of course fried rice or chow mein.  ALL FOR 12.50 per person!  Dont mind if I do!!! Was I expecting a delicious dish with mouth watering food? No but I certainly got it!!", "author": "James V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "This place is cheap, quick and the servings are plentiful. The egg rolls had too much pepper but everything else was great, at least for me. But the woman who served was HI-larious. I hope we get her again.\n\nBut just so you know, I've never been big on Chinese food. If I can get in and out without feeling totally disgusted, it's a successful meal.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-25", "description": "If you are one of those customers that expect excellent service when you pay less than $10 for a full plate of food go someplace else. This place is on it for the price and food. They serve an excellent dry fried calamari with garlic and jalapenos and have lunch specials. This is my go-to Chinese restaurant in the neighborhood.", "author": "A M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-20", "description": "These guys have a problem answering the phone.  Then they out the phone down and ignored me for awhile.  \n\nI got their menu on my car, so I assume they wanted me to call.  But I'm not likely to try again.  I didn't realize Monday night was so busy.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-29", "description": "Use to really like this place. Had great food flavor, Up until I found a HAIR in my soup. Aside from that being disgusting, The way they handled the situation was worse than the hair! (kinda) The woman thought I was joking about the hair, She was smiling the whole time. Then when she finally found it, Told her I wasnt paying for the soup, She had the nerve to ask me to pay for the steamed rice that I got on the side! RUDE! Other times I have been there they are extremly rude, they yell, they roll their eyes and they just have NO customer service skills!", "author": "Dee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-08", "description": "I just love this place. For awhile there I was here at least  two times a week. I have my favorite dishes and I rarely stray:\n\nKung Pao Tofu!\nBroccoli in Oyster Sauce!\nBlack Bean Tofu!\n\nOk, so I haven't had any meat here. But if you eat tofu, this is the place because it's big honking pieces; crispy on the outside and soft on the inside.\n\nI also can't say enough about the service here. It's a very casual place and family run. The ladies there are very nice, that they remember me. I love that.  You also get your food so fast, and it's really hot (temperature wise)\n\nThank you nice ladies for always feeding me yummy tofu.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-01", "description": "Teddybear ordered dinner...its music to my ear when one mentions salted fish...but he meant rice...its okay...he is a foodie (construction man's stomach) so i trust his jusdgement to oder our to-go dinner and I guess the other order was HK style chow mein. \n\nIts chinese food, its cheap and were hungry...what do you expect...we devoured the food...enough said.\n\nIve tasted better but for a dive this is not bad.", "author": "Malou C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-30", "description": "I have been to Jade Cafe several times since I didn't want to eat the \n$1.50 hot dog and drink at 10th street Costco. The restaurants is pretty\nordinary Chinese food with a cheap price , $5-$7 dollar dishes or rice plates, the rice plates are served all day. We had the beef stew over rice it was very good, the chow fun is pretty average and the lemon chicken\nis average. I do notice a lot of employees go here , must be from Costco,the shopping center across the street and General hospital. food 3.5) portion4)  taste4) service4) (Mr Peabody system) will go back again cant be the price and parking.", "author": "Howard J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-03", "description": "I ordered their Hong Kong Style beef pan friend noodles which was average in taste and large in quantity.  The sauce seemed darker than I was used to and it had a saltier taste than normal. \n\nThe food here is decent for the price you pay and service is usually fast during lunch considering the volume of people that visit this place.  The restaurant itself is not pleasing to the eye and there is no level of ambiance to this place.  It is what it is, Chinese food and nothing more.  This place is designed for a quick meal, not the type of place you'd take a date to.", "author": "R B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-19", "description": "This is the last min place when the other resturants are not open.\nIt is fast and cheap but you get what you pay for.  First time experience was a take out order and the person on the phone is rude and the portion was small and the taste is a hit and miss.  They can do decent chow fun but the pan fry HK syle have an odd sauce on it.  I have decided this place is not going to be my regular hang out.\nWonton is not the best,  its home made but small and not even close to what I can make. They have a weak soup base and lack flavor.\nThen again I was hungry and in a hurry I have to find something to eat and here I am stuck in Protrero.\nDinning in house is much better, they might even give you free soup.  Most customers are not chinese and they order chow mein and fry rice.   The portion is much bigger then the take out.  The parking is not bad next to the mini mall, spacious area not bad to take the kids.", "author": "Lantz G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-23", "description": "Unlike every other Chinese restaurant I've ever been to, I've never had anything bad here. In fact, I've stop trying to find it, and at least once a week I'm back for thier Kun Pao tofu and rice plate. That and a Coke for $6.00 is usually the highlight of my lunch-week. They'll even give you a bowl of soup and pot of tea while you wait.\r\nThe place is crowded during lunch-time, so unless you want to sit with strangers, which they will gladly try to push you into, show up late or early.\r\nIf you go enough, they'll remember you, and lunch usually includes a little bit of friendly chit chat.\r\nWhen it's slow you'll find staff members folding won ton or de-stringing snow peas on the back table. Yes, it's certainly not a formal place, but you'll find good food at a good value.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "I haven't found all that many restaurants that will give you choices on what you get in your won ton soup, so I have to say that Jade Cafe gets a star just for having a whole section on its menu dedicated to won ton soup.\n\nI have only received delivery from this place, but it's always hot when it gets here and the delivery guy is UNBELIEVABLY friendly. He always calls me \"sister\" even though I'm not Asian like him. I like that in a delivery guy, I do. \n\nThe chicken is a little on the fatty side but otherwise good, and the wontons are delightful. When you order fried rice, you get an ENTIRE TRAY of it. We're talking entree size times two. For the price, this place almost can't be beat.", "author": "Kat E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "The food here is good. Depending on who your server is it's hit or miss. The one gal who is our regular server is quite good as she remembers my special requests (not too much sauce,etc.).", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-13", "description": "Every time I go here, this place just gets better...\n\nTonight we ordered more food than any two people should ever consume...to the point that the waitress even laughed...\n\nEverything was amazing\nHot & Sour soup was the best I've ever had\nSalt & Pepper shrimp was to die for (as always)\nSweet & sour chicken, which I normally don't do...was great\neven the steamed rice kicked booty\n\nThe daughter of one of the employees was cruising around the joint (she's like 6 or 7 years old) and made our night...she was chatting with us and asking all kinds of questions about our tattoos.  It was hilarious...her parents weren't too happy...no 7 year old girl should ask their parents for tattoos...", "author": "Matt V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-03", "description": "I had food delivered from here and I did not like it.  The egg rolls were lousy tasting and had a funny taste like the oil was not fresh.  I ordered the pan fried noodles with seafood.  This dish was dry, there was no sauce or any kind of liquid; just noodles, vegetables and fish.  There also appeared to have some type of fake fish in it.  I will not order from here again.  There are too many good Chinese restaurants in the city.  \n\nB.", "author": "Bernie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "This is not a four star place in the same way you'd say a hotel is a \"four star hotel.\"  I rated this four stars because of a combination of factors: the staff is super-friendly and accommodating (they're willing to modify the dish), the food is inexpensive (it's nice not to have every lunch be over ten dollars) and yes the food is good.  The decor is nothing special, for sure, but I don't always want to pay for fancy styling which is usually designed to make a place purposely loud.\n\nWent with five other co-workers for lunch and everyone was satisfied with their dish.  I particularly recommend the orange chicken.\n\nI use to go to Jade Cafe #1 on Geary when I used to work near there.  Also very good.", "author": "Hector O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-22", "description": "This place is near my work and for cheap Chinese food it is okay.  It's not great but it's not bad.  \n\nOkay Food & Cheap", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-24", "description": "I'm addicted to this place.  Very friendly and speedy delivery service that usually arrives at my place in under 25 minutes.  I highly recommend the Roasted Duck Wonton Soup, Chicken with Salted Fish Fried Rice, Ma Po Dofu (Spicy Hot Bean Curd with minced pork)...well, pretty much everything that I've tried.\n\nI've heard that the actual establishment is pretty disgusting, so delivery is recommended.", "author": "Will H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "I work near here and it is definitely one of my lunchtime favorites! Dining in for some reason tastes much better than taking it to go, but still worth it. The wait staff is quick and attentive. One waitress we call Mama (not sure of her real name) is the best! She always gives us little extras and knows just how we like our food. \nNot to mention the price! I usually get the BBQ pork with tender greens with rice and soup and my meal is under $7! And I always have enough to take leftovers back to the office. \nI hope this place stays around for a long time for my enjoyment", "author": "Priya P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-14", "description": "The food is only ok, and I've had cheaper Chinese food. The staff there are rude. They want to take your order and have you move out of their way.\n\nI only go there for convenience since I work a block away.", "author": "Gina P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-11", "description": "Average Chinese food, but totally affordable, the rice plates average $5.25 to $7.  I like their veggie spring rolls, nice size and they were crunchy still when they arrived.  Delivery of large food orders is hit or miss so be sure to check your food before the delivery guy leaves.  Had an $80 lunch order and 3 boxes of rice were missing.  After calling the restaurant back they said they would send him back, he was back in 45 minutes.", "author": "Emy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-30", "description": "Awesome Chinese delivery - truly. I ordered shrimp with black bean sauce and broccoli (Not on the menu/I made it up/no questions asked). The broc was fresh and there were no filler veggies (peppers/onions/celery/carrots). The sauce wasn't too oily or salty. Also great was the egg flower soup - ordered per Yelp - tasty and hot! The pot stickers weren't awesome, but fine. I wish they came with that sweet sauce pot stickers sometimes come with. The delivery came fast. Food for 3 was $20.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "Very tasty chinnese food. Love the sesame chicken and orange chicken... My wife loves this place so much", "author": "Rene C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-06", "description": "The food was okay, the price was pretty good. There were two of us and we got one of the family meals for two. It was a ridiculous amount of food. The service, however, will ensure that I don't return. It wasn't bad service, it was just rude.", "author": "Jeffrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-19", "description": "If you feel like good, solid, cheap Chinese food, and if you're in the area, this is definitely a place to consider.  The minced beef soup was okay, the walnut prawns and salt and pepper pork chops were definitely very tasty.  and good sized portions too!\n\nThe waitress gave us great service, refilling water frequently, helped us pack up the leftovers, etc.  Probably it was just because my friend and I are both very cute.  Yea, that must be it.", "author": "John R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-14", "description": "There's a lot of white people here so it must be good, right?\n\nAs the only good Chinese place in Potrero Hill, the place is poppin at lunch time.  Nights, I have no clue.  \n\nI was a customer of Jade Cafe Geary 2005-2006 and Potrero Hill since 2006, because they were conveniently near my jobs.  I chose Geary in the first place because they had the best Broccoli Beef in the region, a dish which I use to gauge all Chinese lunch spots.  I ended up going back to Geary repeatedly because they make what I can't.\n\nThe other dish which is very well done is the tomato beef chow mein (or jeen mein/crispy noodle).  it USED to be a sopping sweet & sour noodle dish WITH tomato chunks, which is utterly annoying for someone who knows how to cook tomato beef, but they've changed the recipe to be a very good tomato dish.  Very good flavor that I can't replicate.\n\nThe only thing they lack is a peking spareribs dish, which is kind of hard to make well.  If you taste ketchup, get the hell out of there man cmon.  \n\nI don't bother ordering duck, because of the skimps.  There's NEVER a good portion of duck on a RICE dish!  kiddding me? novice or something...  Even noodle dishes are like that, and that's only my exp with Chinese lunch places.  GO BUY A POUND from the markets on Stockton/Sac and microwave it at home.  so much more worth it.  \n\nyes I'm Chinese, but I'm not the harshest critic.  I'll eat most anything if I'm impressed, lazy, or clueless as to how they got it to taste so damn good.  \"no msg?  You sure?? hmm... [skeptically stuffs face]\" \n\nBut I only have a rotating menu of 4 dishes, so what do i know?\n\nBest place for a Chinese rice/noodle lunch in PH and Montgomery, until schooled otherwise...", "author": "Waylan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-04", "description": "We like the food and great service. We always go on Friday night. Yummy,yummy, the food and service better than another one on Geary st.", "author": "Ipohgirl T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-03", "description": "Compared to Mikados next door this place is \"OK\".  The service is what you expect from a chinese place... fast paced order now pay now hang up kind of deal.  That's okay because their food is good and priced well.  Although it sometimes gives me a stomach ache when I eat too much.\n\nOne time me and my co-worker ordered some food to go and the price came out to be $34.50 and if you ever seen Russel Peters you would understand how awesome that is haha.", "author": "rocky b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-27", "description": "Cheap food with a cheap taste.  Sorry, I'll pass next time.", "author": "Ricky M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-13", "description": "I'd have given them a better review (we ordered from them tonight), but last time we ate in, it was pretty F'd up. I order the same thing every time-Asian food is my one chance to get the only meat I eat-shrimp. Call it justification if you like, I call them insects. \n\nSo, given that I gave up everything else meatish years ago, I know I did not order the wrong thing. I got chicken chow fun. I will not eat this and asked her to get me what I ordered (politely as always). Three minutes later, I got it back with shrimp. Yes, I was suspicious, but what do I know about line speed? \n\nIt had shrimp, certainly, but on closer inspection, contained dozens of chicken particles and even quite large chunks. Kind of sick. I'd rather have waited and taken home what I could not consume, had my partner been impatient. \n\nThe main question-what if I'd ordered the chicken because I was allergic to shrimp? \n\nI'd recommend this place if you're on a budget and have no allergies. Nothing I've had there is too greasy, and it's four blocks away, so I give them another chance, but check it, 'cause that substitution was wak (and we paid for it, anyway). \n\nMaybe politeness is the wrong approach, in some cases. That is, unless you hope to return.", "author": "dodie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-30", "description": "i liked it better when it actually looked like a hole in the wall. Now they've repainted and look a notch more decent bleh!\n\nWhenever i'm in this part of town and need some eats Jade cafe is one of the places i'll visit. It's the typical chinese place with greasy bathroom floors and waitresses screaming orders to the kitchen. Oh wait they don't scream anymore, they've updated remember?\n\nFood is tasty, fresh and filling. Lunch specials are screaming deals. But i over-order just to pack leftovers for the next days lunch. \n\nI think this place never got in touch with other chinese restaurants because some items are named silly. I don't know why they call it Rainbow chicken (in s.f. why not), it's General Tso's (Zhao, Zao, Tzo, etc.) Chicken is my favorite. Followed by Peking Spicy Beef (aka Beef with Black pepper sauce). Spicy Eggplant with Chicken and Shrimp is good too!\n\nParking is decent but the area is kinda skuzzy. \n\nBest feat from Jade Cafe was i ordered 10 items, they told me that they'd be ready in 10 minutes. Went to Safeway for a 1/2 gallon of vanilla ice cream and came back 10minutes later with 2 boxes (cardboard, not the Styrofoam the food is in) of food ready to go. Daaang..\n\ni feel bad for the delivery guy though. He needs to see a chiropractor.. *Worried*", "author": "ToAsTy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-23", "description": "Does anyone remember New World Chinese restaurant on Clement Street? OMG, that was the best chinese restaurant in SF in the 80's. There was never a bad dish. Sadly, it closed and I have not had anything close to the quality of food and service that I experienced at New World. Most of the szechwan and mandarin restaurants that I try \njust flat out pour the sugar into the sauces and it makes me angry. If  I wanted dessert then I would order dessert. Sorry, I digress into a rant\nand that is not the point here. Jade Cafe #2 was just fine. I ordered \nBeef with tender greens over rice lunch special and guess what, no\nsugar. My husband ordered Kung Pao chicken lunch special and guess what, no sugar! The dishes weren't the greatest but we had \nlunch specials and a beer each. Total with tip 20.50. Service was \nfriendly and top notch. What happened to New World?! Does anyone\nknow?", "author": "Cindy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-06", "description": "I eat here virtually every week. Now if you work in this neighborhood [No, I am not a hooker] it's not like you can weigh options between Zuni Cafe and Hayes Street Grill. For Crissakes, across the street is the Double Play which is fine for getting lit, but food choices are limited unless you go into the Mission.\n\nSo this is a review for folks who happen to be in this area. Why you would drive to an area where hookers and homeless people hang, I'm not sure. Your call. But with choices like Eliza's up on Potrero to drive to, I wouldn't suggest you do any back flips to get here.\n\nBut I like the Jade. I give Two Strong Stars. Interior decorating is not a strength. The bathroom has issues. But the staff is friendly, the food is freshly prepared, the Shrimp and Bok Choy [called \"Tender Greens\" on the menu] is solid, the prices are cheap, and it's fast. The place is packed at lunch time with loyal regulars.\n\nI don't want to hear this \"only white people go here\" song and dance. I have been here 80 times, and that's horse shit. Its solid. No head fakes. Nothing fancy. But just fine.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-07", "description": "first off the place doesnt have any special \"ora\" about it what so ever, and the fish tank is a bit on the grimy side. but other than that it's just the plain ol' regular chinese restaurant you might find anywhere else. i found the staff to be pretty friendly though. all smiles and very quick on the draw. i was in and out in under 45 minutes and considering that i got the spare ribs i found that to be quite pleasant. the menu is pretty large and can satisfy everything from the most diehard of vegetarians to the gnarliest of carnivours. \n\nnow of course one could take a step back and say \"you do know that there is better chinese food in san francisco right?\". my answer to that is most certainly yes, but for the price and the service, not to mention its location, i'd say there's no reason why one wouldn't mess with the jade cafe if in the mission/portrero/soma area. it has always fit my lunch/dinner-time needs.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-21", "description": "Oh, dear.\n\nFor some reason, the office decided to come here for lunch. It was a sunny day, we walked down from Potrero Hill, getting further from our kind, delicious, standby lunch spots with every step.\n\nWe were seated promptly. Everything was a little scummy. My boss asked like 14 times for chopsticks. When I tried to order some steamed bean curd, the waitress told me I should get Kung Pao Tofu, if I liked tofu. Uh, I wanted some steamed bean curd! WTF? But I never stand up for myself at restaurants, so fine, Kung Pao Tofu for me.\n\nMy coworker needed to order something soft because she just had her wisdom teeth taken out, so KPT was not going to work for her. There was a big ordeal when she tried to order something else. Eventually she got some soft vegetables in sauce. Mmmm.\n\nThe food was not very good, even for cheap, greasy Chinese, but, inexplicably, there were sure a lot of people in there.\n\nI will not be back, and I really wouldn't recommend it. Sorry, Jade Cafe.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-04", "description": "I ordered from this restaurant strictly because of the rave reviews i read from city search. Um, no. \n\n\"No\" SO MUCH that I decided to create a YELP account strictly to steer other sheep away from this Place !!!  How bad are you that it drives me to take the time to create an entire on line profile to complain about you?  \n\nI ordered the walnut prawns and the kung pao chicken (extra hot). Both of these dishes were specifically recommended. When i got them, they were terrible. The walnut prawns were tasteless and soggy. The kung pao chicken was supposed to spicy and was definitely not at all. It was over-sauced so much, the chicken tasted like the peanuts, like the carrots, like the zucchini.....all tasted like soy sauce..... \n\nI will cut  city searchers some slack. Maybe this is your first Chinese food experience ever? Maybe you are deathly ill and can't taste, or smell, or have blurry vision ?! Maybe you are used to eating at Chain Chinese Food Establishments like: Pick Up Sticks, or I Love Teriyaki......Or possibly you are co-owner of Jade Cafe and really need to promote your business. \n\n3 (Good) things about Jade (I am not a total bee-och)- Fast delivery, friendly and professional delivery driver and found our apartment which is not easy.... \n\nPros: Fast Deliver, Friendly Deliver Driver, Found our Apartment which is not easy.... \nCons: Terrible Quality of Food, Over Sauced, and OVER salty, Put us on hold six times when trying to order delivery.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Food is very good! Decent Price! Service is ok but could definitely could be friendlier.", "author": "D A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-29", "description": "I work a block away and have given this restaurant a few tries. Each time the service has been as bad as the food. It looks like sisters own the place and each one of them are as mean as the next. They don't crack a smile and they don't say \"thank you\". Maybe because each time I've gone its for pick up, but my money is still green. Onto to the disgusting food, it's always been overly greasy and just plain salty. They need to lay off the MSG and try putting real flavor into their food. YUCK!", "author": "Freckles H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "Decent, cheap chinese food.  Servers/service is a little short/sharp.", "author": "B c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "It always be one of our choice for Friday night take-out. You can order it on Seamless , even though their forgot to prepare our order twice that we had to wait for 15 min. Food is good if you consider the price. Personally, I think the beef stew rice plate is the best, my little one can gobble a bowl of rice mixed with the beef gravy. We also had their family dinner set, the portion is huge. We even had leftover for the next day.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-23", "description": "My co-worker took me here a few weeks back in thanks for painting his bathroom, and it was quite lovely.  They serve you tea and soup while you wait and the food was quite good and reasonably affordable.  I ordered their beef chow fun with black bean sauce and was so hungry I wolfed down an entire plate.  Very yummy.  I only give three stars because I am not in the area and have my own local spot when I want fast Chinese food, but I assure you if I lived by here it would be my emergency to-go food place. This place is also endeared to me, because several years ago when I was very young I had roast duck for the first time here and I recall it being tasty as well.  Stop here after a long day of shopping at Sports Basement or that little mall-let across the street!", "author": "Jane D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "The rainbow chicken is to die for! One plate feeds both my husband and I! 7.00 for a meal for two people? Can't beat it! :)", "author": "Chelsey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-18", "description": "The food is ok, but not outstanding, though pretty salty and overcooked.  However, I will never, ever go there again since they plastered my car with a menu.  Now my neighborhood street has their menus all over it when people ripped them off their cars.  Sorry, spam me like this, mess up my neighborhood and you lose my business forever.  I encourage other people to not visit companies that advertise in this illegal and invasive way.", "author": "William F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "I go for lunch 3 times a month and its always the same. Cheap and good. The lady that serves us is so nice and always asks how my family is doing. Yes it can be greasy, but what ever. I did ask them to turn the radio down one time and they did. And they recooked my food since it was just warm one time. They are very busy at lunch so be ready to wait.", "author": "krispy k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-17", "description": "And now for the long-overdue final installment in my Potrero Center trilogy.  I was probably looking forward to Jade Cafe the least, but I was pleasantly surprised.  The Kung Pao Tofu truly is a marvel of budget dining--large, hot, cheap, yet still cooked like they mean it.  This puts them in at least the same league as other, closer lunch spots like Chow's or Fanny's.  But then, maybe I'll wait to come back until the P-Center has been transformed into the mixed-use TOD it so desperately ought to be (yeah, it's a long wait, but I'll manage).", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "The food here is alright, though a little greasy for my taste. On the plus side, it's pretty cheap and they deliver! And, if you order at least $20 worth of food, you get a free chicken chow mien or pork fried rice! They told me it would be 1 hour for delivery, but they arrived in 30 minutes. It's good for those days when I just can't muster up the energy to cook dinner... or care about eating healthy.", "author": "Bridgette A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "Chinese food is good, simple and cheap.   That is basically what this place is.  Not stellar, but for $6 it ain't bad.  Food was tasty, if a bit heavy (the ole' bowling-ball-in-stomach feeling set in after lunch).  Best part was the service.  The waitress noticed me eyeing my friends chow fun in duck sauce and offered to have my chow mien brought back to the kitchen for a little duck sauce.  Awesome.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-27", "description": "Typical cheap  and greasy chinese food except with a weird waiter who insists on commenting on whatever I'm reading in the Chronicle while trying to enjoy my lunch", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "The food is very YUMMY....but the girls who work there at the counter bagging the to-go orders are very RUDE....not very nice...good cheap chinese food but bad customer service at this location. The one on Geary downtown, the people there seem nicer. I was there one day and met the owner, she was SO NICE! I wish all her employees would be like her :)", "author": "v v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-10", "description": "Pretty standard chinese take-out.  Fast and cheap.  Now only if their staff were just a micron more friendly.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "Better than expected. It's not exactly luring you in with it's charm and good looks. But...pretty solid hot and sour soup and potstickers. Not too greasy and the soup was really flavorful. One tip - don't leave the to-go bag in your car for too long...that stuff is Fragrant with a capital \"F\".", "author": "Kate S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-21", "description": "I went here for the first time this afternoon and had some extremely mixed emotions about everything.\n\nI had been told for 3 days straight that everyone in my building was telling me (the new girl) that I HAVE to go to the Chinese restaurant up the street.\n\n\"Well how good is it?\"\n\"It's so good, I live in the Sunset and come all the way over here on my days off just to get the broccoli beef\"\n\nWell damn, with a review like that how can I say no!\n\nSo I get an hour lunch break.  The restaurant is especially busy so i can understand if there wasn't enough of the staff there to tend to everyone, but I was completely ignored for a good 10 minutes before a woman shoved hot tea onto my table and rudely took my order.  I'm still not one to have this place be a one star review in my head only because I feel like I should give them a decent chance at wowing me.  So I am patient and I sip on my tea while the clock is slowly ticking away on my lunch hour.\n\nMy food arrives hot and fast which was a nice change from the silence I was subjected to at the beginning of my meal.  I thought the rice smelled a little funny but my eyes opened wide at the sight of the plate that was set in front of me.  The colors were vibrant and the food looked fresh and crisp. I couldn't wait to get my hands on one of my sweet and sour chicken pieces. Glistening Chinese ecstasy enveloped my taste buds as I crunched down on the crispy chicken pieces. It finally had been done.  I had finally found the most unforgettable sweet and sour chicken in the city.  I was hooked and the service I received slowly became a mere memory until I actually sat down to write this review.  \n\nAll in all, I gave the place 3 stars and that was based on the entire experience.  I mean, I could figure out a way to make extra crispy chicken pieces covered in homemade sweet and sour sauce, but I go out because its convenient and I am paying someone to serve me the goods.  If I could base this review strictly on the food it would get a 5 star rating hands down, but unfortunately for me I believe good service is at least worth 2 stars of a 5 star review, Sorry Jade!  Maybe next time I'll just have to learn that I will order in advance and take it back to my desk where I can enjoy a fully uninterrupted foodgasm in the privacy of my own cubicle instead of in a place where its going to cost me extra for service.  Seriously? \nOtherwise my meal would have only cost me $6.50.  It comes on a giant dinner plate and I came nowhere near finishing it all.  You get a good portion of some bomb ass take out...just don't eat there and you'll be golden. Seriously..don't...it was in my fortune cookie...", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-24", "description": "It's really is a Blue Collar place, the foods the last time I ordered from here it was OK now it's just plain nasty!!!!   I have to take back the stars I gave them!\nI've been there 3 times and once left irritated with the rude workers and poor service!   I've ordered a few times for delivery usually the person on the phone is more pleasant but today I might as well have been in the actual restaurant!  \nI will not be returning to nor ordering from #2 Jade Cafe on Bryant! YUCK!", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-27", "description": "Reasonable prices, decent food, quick service make Jade a 3 star.....", "author": "Mia T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-05", "description": "I stopped in here for dinner one Sunday night. I'd been in the mood for Vietnamese but all my local Vietnamese places were closed. I had the egg rolls and BBQ duck won ton soup. The service was slow and confused and the food lacked flavor. Nothing I had was bad but nothing was impressive. There are plenty of better restaurants in the cheap-Chinese genre, even in the Mission.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-16", "description": "Average Chinese food.  Not a bad price either.  Really decent!!!  We ordered take out for work and within 15 minutes the food was ready and picked up.  They are quick and efficient plus the place was filled with people out on their lunch break.  I had the Mango Chicken - a tad spicy, the chicken was good, and the sauce was yummy over rice!  I'll be back.", "author": "Kaitlyn G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-07", "description": "a few years back, while  waiting for a show at bottom of the hill to start, my friends and i went to get some grub and ended up at jade cafe #2.\n\ni ordered the spring rolls, which weren't too bad, until i bit down on something hard.  i spit out a few pieces of twisted METAL!!!!  i looked at the rest of my uneaten spring roll, and there was another, longer piece sticking out.\n\ni called the waitress over, and put the chards of metal and half eaten food in her hand... and all she did was bring us our bill so we could get the hell out!  and she still made me pay!\n\nhopefully the was just a one time thing, but never again!", "author": "Cady C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-15", "description": "Decent food at a very affordable price. Love the rainbow chicken! Just dont order for delivery the food shows up cold and greasy had to drive all the way back there and return it.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-21", "description": "i came into work hungover every single day this week.\n\n(! happy holidays !)  \n\nwhen im hungover, i am a bottomless pit.  and bottomless pit wants noodles.  soupy carby big fat rice noodles.  ho-fun-alicious noodles.\n\nmy initial thought was mission hunan chinese.  i have had their noodles before and it was decent.  good comfort food.  but the thought of walking those 3 looooooooooong blocks made my head hurt.  i want ho fun and i want it now.  so i walked up a block to jade cafe #2.\n\nservice was eh, but who cares about that when a big honking bowl of noodle soup is dominating your every thought.  im used to the indifferent service of chinese restaurants anyway.\n\nmy veggie ho fun noodle soup came.  it was very... blah.  a blah veggie noodle soup is just down right preposterous.  all it takes is just noodles, a decent soup base, and some decent veggies!   \n\nwell.  this blah veggie noodle soup had a handful of blah stir fry vegetables.  2 florets of broccoli, some small pieces of onion, bell pepper, carrots.  a very sad vegetable assortment indeed. \n\nit also featured a very bland soup base, i suspect its just water and probably lots of msg because my tongue is tingling with the msg effect right now.  (just use chicken broth!  chicken broth makes everything taste good, damn it!)  it had a film of oil and was so greasy that in the end i just ate the plain ol noodles.\n\nsigh, it was so disappointing.  halfway through the bowl i actually contemplated not finishing it.  but alas, the bottomless pit won and i finished the bowl, sadder and angrier with each tasteless worthless bite.\n\ni paid and opened my fortune cookie.\n\n\"today is a good day to be spontaneous!\"\n\nso i walked down to mission hunan and got bowl #2.  \n\ni am a fatass.\n\n(! happy holidays !)", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "The Tofu with Green Bean in Dry Spicy Garlic Sauce is excellent.  Good place to pick up dinner on the way home from work.", "author": "Wan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "Consistent food, service is friendly. The garlic eggplant is a favorite- a bit greasy but just drain it off. They delivered within an hour of ordering on a Friday night which was great.", "author": "Jay F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-07", "description": "Excellent, fresh, and dirt cheap Chinese food. I especially love their homemade egg rolls and potstickers. Friendly service.", "author": "L S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-13", "description": "For cheap, tasty Chinese food that delivers, you could do far worse. Really, three-star taste, but when you throw in the price/amount/delivery factor its a strong four stars!", "author": "Johnny O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-14", "description": "I went to Jade Cafe #2 based on a recommendation.  I was told that Jade Cafe is a good lunch spot for \"good and cheap\" Chinese food.  The cheap part I agree with but the good part is a stretch.  The food is inexpensive and the service is fast which usually makes for a good lunch experience but the missing ingredient was good food.  The food wasn't bad but just really generic.  If I am going to eat heavy Chinese food, it has to be good otherwise I rather just pop a lean cuisine in the microwave at the office.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-13", "description": "Well its not the best Chinese restaurant, its really not a typical Chinese restaurant by rice plates and they will let you customize is not bad for the price you pay.  How did I explain this to a friend - its quick, its Chinese and its decent!", "author": "May A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-16", "description": "If what you are looking for is quick Chinese food for a decent price for either delivery or take out then you have found your place. I wouldn't take a date here or eat here if you do not plan on smelling like Chinese food when you leave however for the price and the quick turn around then this gets a good rating. The service is so/so if you are eating here however if you are picking it up and running out with the food then what you need is right here.", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-04", "description": "For a \"restaurant\" that has single handedly littered almost every neighborhood in SF with its stupid green flyers, they sure have'nt gotten the memo about cleanliness standards and customer service. Jade cafe has a very scummy vibe and really hasn't updated it's look in all of the years its been open. Lets give it one star for being authenticaly a dive with dirty walls and floors and pictures that hang at an angle off the wall, tilting forward such that they look like they are ready to fall on your head.\nThe clientel are typically working class and people who don't look like they are critical of the cuisine. I guess I'm a snob. I like to enter a restaurant and not be treated like a criminal. From the moment I entered this dump, the ladies that take the orders were staring at me like I was lower class then the food they serve. When my order was ready, the waitress handed my food to me from an extended arm while looking away from me. Kind of like when you hand a bag of dog shit to someone you are disusted with. I interpreted it as Tattoo prejudice as I sometimes get the riff raff treatment from asian food establishments.\nI ordered the green beans and fried tofu which is bathed in garlic and MSG. What followed my meal was two trips the bathroom, stomach cramps, heart palpatations and dizziness. Jade was the color my skin turned after eating here. If you enjoy the smell of bleach while you eat....don't hesitate to dine here.", "author": "Go Cat Go G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-23", "description": "I went here for a late lunch last week. Wasn't too busy, but it was around 2pm. I guess you just kinda seat yourselves, and the waitresses will get to you. It's a definite dive, not that clean with mismatching dishes. But the prices are quite affordable, and the food portions are pretty sizable. I usually get the fried squid with spicy salt...a little heat from the jalepeno, a little crunch from the fried batter. I have tried other items from the menu like black bean fish (unmemorable, bland). \n\nDon't actively seek this place out; I would only recommend it if you are in the area regularly and have to choose from the limited dining scene.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-22", "description": "I went to lunch here today, and had my worst Chinese food experience in a long time.  Considering it was lunchtime in the city, the service was not so bad...it was actually fast.  The problem for me was in the food.  While their soups are quite good, I ordered chow mein today that was more grease than noodle.  If you don't mind eating extremely greasy food, then this place is right for you. - you definitely get what you're paying for...", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-27", "description": "Generic cheap chinese food.  Large portions. If you're hungry, on a budget, or work near here, it's not bad.  Otherwise I see no reason to eat here.", "author": "Avi H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-02", "description": "I thought the food here was pretty greasy....the price was cheap but service was pretty fast.  The only thing I ordered from here was the Wonton Soup with Chicken and I thought that was pretty tasty!", "author": "JenJen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-09", "description": "good food, was recommended by co workers, and indeed is a good place to eat. except the employees who have bad attitude. this lady that stays behind the counter, writing the checks and answering the phone.  sorry but after that incident where she gave me attitude, i am not going back.", "author": "Julio C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-15", "description": "I go here for lunch sometimes. Its good Chinese comfort food and reasonable prices ($5-6). They give you a lot and its quite tasty.", "author": "Roger C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-28", "description": "I love this place.  Where else can you get 3000 calories worth of homemade Kung Pao Tofu for $4.50?", "author": "Amy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-23", "description": "the food is plentiful, inexpensive, and ok.  the service is hit and miss and don't try and go 30 minutes before closing because you get the bums rush, complete with chairs stack on top all the tables, except yours, etc.  but the place is not clean.  the entire white pepper shaker i used was very sticky and the backs of the aqua colored seats almost made me lose my appetite, they are so grimy.", "author": "caveat e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "This place is pleasant.  I have been coming here for years and sometimes on semi-special occasions, and during my lunch break.  The food is good, tasty, and the prices are affordable.  I always get seating quick and fast service.  I have many memories of this place when I come here, sometimes I wake at night thinking about lunch tomorrow, I don't know why.  Located right on Bryant and 16th Streets,  the 22 Fillmore bus will take you right there.  Decent food at good prices = good review.", "author": "Bryant K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-09", "description": "their food is ok, price is fair, other than these, nothing good.\nthe worst thing is their faces, the fat viet boss looks @ you just like you murdered her parents and destroyed her family!", "author": "Jex H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-08", "description": "I used to liked Chinese food, until the day that I went with my friends to eat to the jade's cofe restaurant, where we ordered four orders of chicken brocoli and two of chicken fried rice. The food was undercook, but it  became disgusting when we saw a cockroach coming out from under the table. the worts part was when we noticed that it was also a dead cockroach in  one of our dishes. i sincerely  recommend you to pay a little more money when you go to eat. its always better to spend a little more money and have a nice time, instead of having a horrible experience. Jade's cofe restaurant is the worts place that i have ever been in my entire life. ITS DISGUSTING AND NASTY AS HELL :/", "author": "fischer t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-17", "description": "I was craving Chinese food while at work the other day and decided to check out Jade cafe across the street from me. You know that feeling when food absolutely satisfies what you crave? Thank you Jade Cafe. 5.75 for an enormous portion of chicken chow mein. I'll definitely be a regular there.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-12", "description": "Wow...amazing delivery service , when I notified them that  the single can of soda I ordered did not arrive; they sent the delivery guy back with two cans   ! what a great thing  to do..and the food was hot & fresh and tasty as ever. !", "author": "Barry C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-15", "description": "HORRIBLE SERVICE!!!  That's the best way to describe this place.  The food wasn't horrible, but I have had better elsewhere.  Some of the dishes lacked flavor.  It took a total of 15 minutes of just sitting there before we finally asked for the check.  It took two tries before they gave us boxes.  I will never go here again!", "author": "Kim C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-18", "description": "we had ordered from th is place 12/17 f/11 and spent $31 for family of 4. the food was skimpy:shrimp fried rice and beef br occoli. the beef broccoli tasted mushy and bland, the fried chicken wasn't seasoned. the only items that was good: shrimp fried rice and pot stickers. i've been to chinese food places that give u big portions for your money's worth.i just wanted to check this place out and give it a chance but not going to be on my list of favorite.", "author": "Bernadette F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-11", "description": "this place is ok. the people who work here are kind of rude and pushy. they took forever to make our food that we ordered to go, and i'm generally a patient person. i guess i didn't like the feeling i got that i was being punished for asking questions about the food. (their answers were gruff, like i was bothering them..) the food isn't that great, very greasy and the orange chicken isn't as good as other places i've tried. however, since this place is close to my house i still go there when i'm having a chinese craving. after my last experience though, i don't think i'll go again, unless its a dire emergency. the food took forever, was pretty cold by the time we got it, and i just don't like it when people who are getting my business aren't that nice to me.", "author": "Jo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-28", "description": "decent place for takeout the lady at the counter aka \"pig nose\" is rude as hell but wtf its only lik 5-7 for lunch", "author": "d l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-01", "description": "they have BAD SERVICE.sushi and chinese?!?! not fresh fish.i tried the Spicy Tuna roll, and the fish smells disgusting.i also tried the chicken with corn soup and it was all water,little chicken and a lot of corn.the kitchen was very dirty.a lot of msg and oil,when i tried the Rainbow Chicken.they delivery once very bad delivery guy,he asked me for more tips?! their miso soup is just water.they are cheap but not fresh.", "author": "Tony B."}
